[
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "One of potential solutions is to subsidise a portion of PoW blocks going beyond the transition block. And pay reward for these blocks on docked eth1 chain (that is, secured by PoS). Thus, incentivise miners to stay as long as it's needed for sustainable docking. There is an option to subsidise only those blocks that has no transactions to decouple canonical eth1 chain.",
        "created_at": "2020-12-15T08:42:32.816000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Eth1 history will become optional when the transition point gets finalized and reaches the boundary of weak subjectivity period. As at that point it won't be needed for consensus. Some parties will highly likely keep maintaining the history to provide their services.",
        "created_at": "2020-12-15T08:52:00.836000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "one point 1) above.. I do strongly encourage the economic incentives to keep the hash rate high.. it is when ETH will be at its most vulnerable stage.  (another alternative.. but probably less popular but in a similar theme.. would be to have an intentional transaction outage.. whereby trnasactions are not put in the ETH1 chain.. but only mining is possible.. to allow for the docking.. and let miners keep the the hashrate for 8-12 hours (insert X time).. and then the \"final docking\".. so that final snapshot is known and miners will fade off from the start of the outage to the end of it.. but since no transactions woul dbe possible.. no double-spending issues)..",
        "created_at": "2020-12-15T11:00:31.689000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "on point 2) understood so, it sound like an ETH1 state would be basically inserted into a shard... and the history could be held externally .. pls correct where I am wrong ont hsi.. I believe the eth1 snapshot is around 1gb.. while of course the full history is ~300x that.. having ~10000+ nodes sync on a 1gb block is a helluva lot more probable than a 300gb block !",
        "created_at": "2020-12-15T11:02:33.651000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "the concern either way is that many of the enthusiast validators today are using a simple VPS and infura as their eth1 connection.. no way to migrate that state from infura without sticker-shock.. it will knock out many base level enthusiasts.  granted phase 1 hasnt launched , let along prep for phase 1.5.. however the earlier the above items can be locked down.. the longer the knowledge has an oppty to be shared with folks on what the new reqs will be..",
        "created_at": "2020-12-15T11:04:44.667000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "That would stop chain progress for this period of time and lead to related services being out. And it doesn't prevent double spend near to the point when empty blocks starts emerge and where eth1 chain would already entered its vulnerable stage if in practice we see this stage at all.",
        "created_at": "2020-12-15T15:16:36.266000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "From what I know the state snapshot is way bigger than 1gb. Of course, the full history is much more of that. There is a new proposal about enshrining eth1 execution into the beacon chain (https://ethresear.ch/t/executable-beacon-chain/8271).\n\nDisregarding the particular proposal, validators will keep running their eth1 nodes during the docking. And it won't be necessary to download a specific snapshot to start producing eth1 blocks inside of eth2 system. It should happen seamlessly by switching eth1 node from mainnet mode to eth1-engine mode allowing for new-fashioned eth1 block production and processing.",
        "created_at": "2020-12-15T15:25:32.426000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "My gut is that there will be no big increase in resource requirements for running eth1 nodes for validators to support eth1 docking. Anyway, this is one of the considerations and we'll get more understanding on that part when get closer to the docking procedure.",
        "created_at": "2020-12-15T15:35:07.621000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "FYI, Phase 1 has been decomposed to a number of upgrades. Light client and shards are being separated now and there are more changes on the list. The new proposal (that is, executable beacon chain) makes docking independent from shards. So, in the current vision there is no Phase 1 and Phase 1.5 as they were previously.",
        "created_at": "2020-12-15T15:38:43.083000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e whereby trnasactions are not put in the ETH1 chain.. but only mining is possible.. to allow for the docking.. \nif i'm understanding correctly, another caveat to this strategy is that miners would collect the block subsidy for each of these empty blocks so the state would still be changing -- arguably the \"state diffs\" during such a period could be much less than allowing full blocks w/ arbitrary transactions in them which could potentially help w/ a \"crossover\"",
        "created_at": "2020-12-15T22:50:03.266000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "and btw here are some numbers on recent mainnet state:",
        "created_at": "2020-12-15T22:51:53.709000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "https://github.com/ethereum/devp2p/blob/master/caps/snap.md#expected-results",
        "created_at": "2020-12-15T22:51:59.853000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "~70Gb",
        "created_at": "2020-12-15T22:52:26.618000+00:00",
        "attachments": null
    }
]