[
    {
        "author": "jakepospischil",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hi all! I have a couple of random questions about this proposal and didn't want to clutter the ethresearch thread up with them:\n\n1) Where would this likely fit into the Eth 2.0 rollout roadmap? Somewhere between phases 0 and 1?\n\n2) If the beacon chain has visibility of the Eth 1.0 state, could this be used to facilitate withdrawals of validator deposits directly to Eth 1.0 contracts (under an alternate withdrawal mechanism)?\n\n3) If so, would that be a sane/reasonable thing to implement?",
        "created_at": "2020-04-17T09:01:51.349000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "1) After the Phase 1 as this proposal has shard chains as prerequisite\n2) Definitely\n3) Yes",
        "created_at": "2020-04-17T10:23:46.185000+00:00",
        "attachments": null
    },
    {
        "author": "jakepospischil",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "makes sense, thanks! :) withdrawals to contract addresses would be huge for decentralised staking pools to avoid complicated key management issues. shame this would only be enabled after phase 1 but still great to hear!",
        "created_at": "2020-04-17T10:28:21.220000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Oh, sorry, that was my misread. I thought about withdrawals to Eth1, not to the contracts in particular.",
        "created_at": "2020-04-17T10:51:26.696000+00:00",
        "attachments": null
    },
    {
        "author": "jakepospischil",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "ah no worries, I was talking about something like minting withdrawn validator deposits to a specified address (contained in the withdrawal credentials) instead of signing a withdrawal message with a BLS key",
        "created_at": "2020-04-17T10:56:25.345000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Currently, there is only BLS withdrawal scheme available for validators, signing withdrawal message with the private key is part of this scheme. Spec says that it will be possible to withdraw to shards. IIUC the whole process is not yet specified anywhere. What is clear is that Eth1 is going to be enclosed by one of the shards Thus, when shard withdrawals become available it will make it possible to use this scheme to withdraw to Eth1, probably Eth1 shard being a specific one will require some additional work, but it should be straightforward.",
        "created_at": "2020-04-17T11:34:16.086000+00:00",
        "attachments": null
    },
    {
        "author": "jakepospischil",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yep that all makes sense :). Just trying to feel out whether or not there is any possibility of alternate withdrawal mechanisms being added to the spec (and especially involving Eth 1.0 since this proposal would give the beacon chain more agency over the Eth 1.0 chain). A scheme for withdrawals via a contract would solve some big problems for decentralised staking pools which are very difficulty to address using the current scheme (or what is currently specced out for it at least).",
        "created_at": "2020-04-17T12:34:24.260000+00:00",
        "attachments": null
    },
    {
        "author": "jakepospischil",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I understand that this is kind of tangentially related to this proposal (but possibly depends on it), which is why I didn't want to sidetrack the discussion on it.",
        "created_at": "2020-04-17T12:36:51.850000+00:00",
        "attachments": null
    }
]