[
    {
        "author": "mrabino1",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "ty... while I claim no authority on what is the best way to do the docking, I lead with the core understand we should all share that maintaining the hash rate during the process is essential..",
        "created_at": "2020-12-16T12:18:38.558000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "and should the state be ~70gb.. for the skinny validators that are using a basic VPS and an infura connection as their web3 eth1 interface, I can imagine that docking moment will require significant infura calls (load) to query all of that state.. (waaaay more than the \"free\" account).. while of course there is time, my point is that there will be many small validators knocked off unless they know to spin up a local ETH1 node to allow for significant queries (my sense at least)..",
        "created_at": "2020-12-16T12:21:00.611000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "in this context, the narrative of how the process will unfold is important to start circulating those requirements (even if not 100% finalized) sooner than later to allow for the knowledge to circulate .. as we even saw with ETH2 launch, there were some that were struggling initially to get their nodes up (even after all of the testnets).",
        "created_at": "2020-12-16T12:22:50.687000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "also, fwiw, maybe a hybrid could be having ETH2 query the ETH1 node for state (but throttled)... and construct the then current state on an iterative basis to construct the ETH1 state over a period to time..  this might also help the transition as a 70gb block would not be needed..  😉",
        "created_at": "2020-12-16T12:24:38.295000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Downloading 70gb snapshot at particular point won't be needed. Eth2-clients will maintain their own eth1-engines or will be connected to external service providing that functionality. From state maintenance point of view eth1 engine is similar to eth1 node hence the state will already be prepared at the transition point by importing all eth1 blocks before that point.\n\nYou may read more about eth2-client, eth1-engine and relationship between these two here: https://ethresear.ch/t/eth1-eth2-client-relationship/7248",
        "created_at": "2020-12-16T13:23:13.638000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "interesting... v much appreciated !",
        "created_at": "2020-12-16T13:27:33.123000+00:00",
        "attachments": null
    }
]