[
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I would presume that you mask this in the standard \"safe\" algorithm within the beacon node communicated to execution  engine (assuming we go with something like the above design)\n\nAnd if you want a more sophisticated alg or info, call the beacon api directly",
        "created_at": "2021-08-24T01:07:55.975000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think it is important that all possibly relevant data is exposed to apps.  As \u003c@555483069038198827\u003e said above, even if most apps don't use it we should support well designed apps who want to provide more complex safety guarantees.",
        "created_at": "2021-08-24T03:27:00.519000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "We can also offer users some simplicity stuff like what \u003c@425279588009246720\u003e suggested above.",
        "created_at": "2021-08-24T03:27:20.229000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This means we either need to provide a public endpoint on the consensus client, or we need to route this information through the execution client (even though the execution client won't use it).",
        "created_at": "2021-08-24T03:28:03.793000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm fine with either, though if we take the proxied approach I think it should be a transparent proxy solely for providing a single host/port for users to connect to, but we shouldn't require that the execution client actually understand the data it is proxying.",
        "created_at": "2021-08-24T03:29:14.664000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "As mentioned above, we don't want every change in data provided by the consensus client to require execution clients to do engineering work.",
        "created_at": "2021-08-24T03:30:08.422000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Long term, I would rather see a new microservice added to the mix that provides a single RPC endpoint.  So an Ethereum installer package would include execution client, consensus client, UI server, and RPC server.",
        "created_at": "2021-08-24T03:31:12.579000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "For the record, Infura is already exposing the beacon node rest api as a separate endpoint.",
        "created_at": "2021-08-24T03:31:26.056000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The one that should be private?",
        "created_at": "2021-08-24T03:31:45.115000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The current beacon node REST API. There's only one currently. https://ethereum.github.io/beacon-APIs/",
        "created_at": "2021-08-24T03:32:20.581000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It's got the same security model as the eth1 JSON-RPC API.  You shouldn't expose it to the public without putting in place your own restrictions to prevent DOS attacks etc.",
        "created_at": "2021-08-24T03:32:51.707000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "DoS is the only bad thing someone can do with it?  They can't trick your consensus client into signing something bad?",
        "created_at": "2021-08-24T03:44:26.963000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "No, the beacon node doesn't ever have access to validator keys.  And slashing protection should always prevent that even if for some reason you exposed your signer to the public (they could prevent you signing anything ever again which would be bad, but shouldn't be able to get you slashed).",
        "created_at": "2021-08-24T03:52:53.011000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The beacon API is just the beacon node, the validator client and any external signer is completely separate and not exposed by that API.",
        "created_at": "2021-08-24T03:53:31.349000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdannyryan\u003e +1 \nMy current position is to supply execution engine with head info sufficient enough that existing utilized head api endpoints cna be considered safe, and then for advanced consensus usage/queries, the user should go to beacon endpoint itself",
        "created_at": "2021-08-24T04:07:55.991000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "IMO, information from beacon chain about a number of confirmations contributed to a block is important for the user's RPC. And implementation of the proposal made by Dankrad is under consideration for the Merge scope. There is a JSON-RPC item in the Merge readiness checklist that implicitly covers this proposal along with other RPC updates.\n\nI am leaning towards separation of responsibilities between consensus and execution layers in terms of providing an information about the state of the network. As it was mentioned above, it will allow us to expose more information from the consensus layer to the user's JSON-RPC without involving execution client updates as it would be if we take another path (propagating everything down to the execution layer).\n\nAs for the approach to user's lib implementations, web3 *may* query data from both endpoints, consensus and execution, and match the information before serving it to the user. `eth_getBlockByNumber` may have a new option for the block identifier e.g. \"confirmed\". Serving a request with this option web3 impl queries consensus layer in the first place to get the most recent block with e.g. `0.7` confirmation threshold (whatever is considered safe); then query execution layer to get the block information and respond to the user.\n\nLate to the party again. All these points were mentioned above.\n\ncc \u003c@!555483069038198827\u003e \u003c@!322222239850168331\u003e",
        "created_at": "2021-08-24T04:58:36.236000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Thinking more about the API, I think having them as separate endpoints is good because it means someone running their own consensus client but a third party execution client can trustlessly follow the correct chain at least.",
        "created_at": "2021-08-24T10:43:42.969000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "For end-users, I believe this results in a *slightly* lower trust setup than if you outsource both execution and consensus clients.",
        "created_at": "2021-08-24T10:44:17.563000+00:00",
        "attachments": null
    },
    {
        "author": "thegostep",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Something i have been wondering wrt to the fork choice rule, is it possible to have model which probabilistically estimates if `engine_forkchoiceUpdated` gets triggered based on the current state of votes of various forks?",
        "created_at": "2021-08-24T10:44:48.345000+00:00",
        "attachments": null
    },
    {
        "author": "thegostep",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I am trying to figure out what is the 'earliest' a client could go with optimistically updating the head",
        "created_at": "2021-08-24T10:45:30.464000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think this also could provide some easy wins for light-ish execution clients which source data from external parties, but validate blocks and transaction inclusions locally.  This then leads to the next step in the iteration of light clients where they get storage proofs trustlessly from a third party (since they have trustless blocks now), and can do local transaction execution without having full state.",
        "created_at": "2021-08-24T10:45:50.798000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If we have the consensus API and execution API coming through the same endpoint, then it makes it harder for a user to run a setup like this.",
        "created_at": "2021-08-24T10:46:22.264000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "That's essentially Dankrad's algorithm above",
        "created_at": "2021-08-24T10:46:23.270000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I believe in a non-attacking scenario, probability very rapidly approaches 1.",
        "created_at": "2021-08-24T10:47:09.890000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The problem is that the system is still susceptible to attack during that time, and that is incredibly hard to model with a single probability.  It is basically, \"what is the probability that someone will choose to attack right now\" which really is an out-of-protocol thing.",
        "created_at": "2021-08-24T10:47:49.395000+00:00",
        "attachments": null
    },
    {
        "author": "thegostep",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Define \"very rapidly\" :p every pico-second of computation will be worth millions",
        "created_at": "2021-08-24T10:48:15.332000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I believe as soon as you see a valid block for the next slot probability gets pretty close to 1 in a non-attack scenario.",
        "created_at": "2021-08-24T10:49:09.560000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It isn't like PoW where reorgs just due to \"internet being irregularly shaped\" are common.",
        "created_at": "2021-08-24T10:49:25.598000+00:00",
        "attachments": null
    },
    {
        "author": "thegostep",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I see - and I assume you would classify attestation bribery as an attack?",
        "created_at": "2021-08-24T10:49:55.209000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It is possible that the slot will be \"reorged out\", but outside of an attack that is much less likely than PoW IIUC.",
        "created_at": "2021-08-24T10:50:09.434000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "In this context, I classify anything other than \"everyone is running a stock client\" as an attack.",
        "created_at": "2021-08-24T10:50:32.222000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "More specifically, anything other than the intended ruleset that the consensus client devs have agreed on.",
        "created_at": "2021-08-24T10:51:04.403000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@555483069038198827\u003e I have one question about using your algorithm as a \"safe head\" to serve. If this gets widely accepted as the default head, I wonder if attacking the synchronicity of the network suddenly becomes more of a target and when does it become profitable. I mean that's the strong supposition of the algo and one could in principle envision attacks that would not be profitable if most use finalized head or even a random mix of criteria vs a fixed one",
        "created_at": "2021-08-24T10:53:22.901000+00:00",
        "attachments": null
    },
    {
        "author": "thegostep",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "yeah I get what you are saying, though I don't think it's black and white",
        "created_at": "2021-08-24T10:53:34.256000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Nothing in life is.",
        "created_at": "2021-08-24T10:54:14.707000+00:00",
        "attachments": null
    },
    {
        "author": "thegostep",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I expect that similar to pow, pos validators will grow quite attached to the power they have to implement non-consensus breaking changes",
        "created_at": "2021-08-24T10:55:26.706000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "They don't have much power to do reorgs on an individual level I don't think, though that is a bit out of my depth.",
        "created_at": "2021-08-24T10:57:10.211000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "And if they did, I would strongly advocate for an irregular state change to slash anyone who did such a thing.",
        "created_at": "2021-08-24T10:57:29.056000+00:00",
        "attachments": null
    },
    {
        "author": "thegostep",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "something something hidden out of band payments though darkdaos 😬",
        "created_at": "2021-08-24T10:59:35.103000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I don't care who pays who for what.",
        "created_at": "2021-08-24T11:17:30.960000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "What I care about is anyone who signs against the spirit of the system.",
        "created_at": "2021-08-24T11:17:46.494000+00:00",
        "attachments": null
    },
    {
        "author": "thegostep",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "fair enough",
        "created_at": "2021-08-24T11:23:02.205000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e I think if you can force that network asynchronicity then you can also use that to attack (re @merge_chat_bot: \u003cpotuz\u003e @dankrad I have one question about using your algorithm as a \"safe head\" to serve. If this gets widely accepted as the default head, I wonder if attacking the synchronicity of the network suddenly becomes more of a target and when does it become profitable. I mean that's the strong supposition of the algo and one could in principle envision attacks that would not be profitable if most use finalized head or even a random mix of criteria vs a fixed one)",
        "created_at": "2021-08-24T11:26:54.819000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e for a user there is now way to distinguish the case \"there is an attacker who can force asynchronicity\" and \"there is an attacker who is forcing asynchronicity AND has enough stake to actually attack\"",
        "created_at": "2021-08-24T11:27:42.758000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "what ticks me is suppose that getting a percentage of validators latency to be off for just a couple of slots costs x, in general this x does not achieve much if you do not have a target that can be exploited during those few slots and you identify it (and I presume the attacker needs to also happen to propose during those slots). If everyone would not commit to anything unless a transaction is finalized then spending this x is always a waste of money. If on the other hand everyone is following \"safe head\" then I can assume that everyone is vulnerable to my attack and if I see a large transaction that is exploitable I may expect to get back my x. I just do not know the cost of breaking the supposition of the safe head algorithm. To bring an extreme: there is a supposition that the majority of validators are honest in Casper, and this supposition is reasonable cause breaking it may eventually cost more than what one may get back. I am just pointing that what one may expect to get back from breaking synchronicity changes if everyone uses a safe head  instead of a finalized one.",
        "created_at": "2021-08-24T16:03:33.820000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e wait can you explain what you gain?",
        "created_at": "2021-08-24T16:17:53.436000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e by breaking synchronicity you will just make them follow the head with a little more latency. So if you're a defi trader you may gain some competitive edge from that, but then again I would expect exactly your competitors (other competent defi traders) would do the work to work with unsafeHead and check how trustworthy it is because they have so much to gain",
        "created_at": "2021-08-24T16:19:02.785000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e So I don't understand what your attack is supposed to achieve",
        "created_at": "2021-08-24T16:19:13.763000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "In principle is a double spend: Making a long fork in PoS, longer than finality is impossible without slashing a majority of validators. But making a short one, that doesn't threaten finality, in principle can be made much cheaper. If I make a fork long enough so that a \"safe head\" becomes not safe I can siphon funds from a party that trusted a head when it shouldn't. But for this I need to first screw synchronicity which is the assumption of the safe head algorithm",
        "created_at": "2021-08-24T16:41:43.877000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I am still willing to slash a few of my validators, but the point is that there's an interplay of how long a fork needs to be for a double spend to work as long as someone trusts a non-finalized head",
        "created_at": "2021-08-24T16:42:48.629000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e ooooh I see what you mean now. But this is already a problem with current PoW networks in exactly the same way",
        "created_at": "2021-08-24T16:42:52.986000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Indeed, but currently everyone  has a choice to decide how deep they take their security and I as an attacker do not know a priory how long they take",
        "created_at": "2021-08-24T16:43:27.905000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "but with your proposal I can safely assume knowledge of their idea of the safe head if they all use the same algorithm provided by the API",
        "created_at": "2021-08-24T16:43:53.953000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e right. I think you can put additional safety thresholds on the safeHead if you want",
        "created_at": "2021-08-24T16:44:34.932000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e Note that I think to attack it you would really need much more than \"spam the network to make attestations come more slowly\". I think that would only achieve delaying the safeHead",
        "created_at": "2021-08-24T16:45:32.494000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e whereas what you need for an actual attack is to more or less split the network",
        "created_at": "2021-08-24T16:45:46.379000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e This can probably be further elaborated. But for example, if you only accept 95% of validators voting for current chain, then you are pretty safe. You can configure that threshold",
        "created_at": "2021-08-24T16:46:38.129000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "yeah, I think this is not cheap, but napkin estimating a couple of thousands of validators can fork for a few slots with high chances. And yes indeed, I am advocating in favor of a simplified view of a \"safe head\" but perhaps it's something to take into account to add a parameter to the call, specifying how safe the safe head should be",
        "created_at": "2021-08-24T16:48:39.243000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e Can you explain this? I don't think the safeHead is that easy to attack",
        "created_at": "2021-08-24T16:57:37.191000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "oh I don't think attacking the safehead is easy, but short forks of a couple of slots slashing my own validators plus spamming peers may be possible",
        "created_at": "2021-08-24T16:59:55.504000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e slashing thousands of validators would be a high cost though",
        "created_at": "2021-08-24T17:00:21.170000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I have no clue what the cost of this is, none-whatsopever",
        "created_at": "2021-08-24T17:00:24.531000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e we're talking about 100 million US$",
        "created_at": "2021-08-24T17:00:53.302000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "but whatever this number is, has to be weighted against a target assuming a safe head is",
        "created_at": "2021-08-24T17:00:55.955000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e if you have 100 million $ at stake you may want to wait for finalization",
        "created_at": "2021-08-24T17:01:20.977000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Exactly! the issue I see is if the default is \"safe head\" and is taken as valid by the vast majority",
        "created_at": "2021-08-24T17:02:01.067000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e scuse me but if you are managing 100 million $ you don't just use the defaults",
        "created_at": "2021-08-24T17:02:31.510000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e if I have 100 million $ in my normal bank account I'm f***ing irresponsible",
        "created_at": "2021-08-24T17:03:07.733000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e and to add to that, the safeHead is likely to still be much safer than the current standard behaviour of waiting for 30 confirmations",
        "created_at": "2021-08-24T17:03:48.313000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I completely agree that whomever has 100 million at stake should wait for finalization, but that assumption you are making that managers will be in-depth enough to not use the default I think is overoptimistic... I think the API should aim to be so that the default is finalized or safe head with a strong security, and then allow users to lower this threshold",
        "created_at": "2021-08-24T17:04:09.093000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e https://www.crypto51.app/",
        "created_at": "2021-08-24T17:04:37.760000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e the current cost of a ~30 block reorg is only about $200k",
        "created_at": "2021-08-24T17:05:30.914000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "oh that site is awesome, I now want to rent hashpower for some of those that it seems I can afford 🙂",
        "created_at": "2021-08-24T17:05:54.655000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e yup",
        "created_at": "2021-08-24T17:06:04.524000+00:00",
        "attachments": null
    },
    {
        "author": "0xblacktemplar",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If we have a parameter like 95% of validators voting for the current chain, is it possible to associate with this parameter an estimated \"cost of attack\"? That would help maybe people to understand the risks of trusting the safeHead.",
        "created_at": "2021-08-24T19:26:15.776000+00:00",
        "attachments": null
    }
]