[
    {
        "author": "butta",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "(i’d expect block proposers to propose their blocks as late as possible to capture most of the MEV)",
        "created_at": "2021-05-22T06:45:51.573000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I don't think so since if the attestation window is tight, they risk their block not being  included by proposing late.",
        "created_at": "2021-05-22T08:12:56.150000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "how late is late? 😛",
        "created_at": "2021-05-22T08:13:53.227000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Anything into the slot I suspect",
        "created_at": "2021-05-22T08:14:13.399000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "doesn't this risk decrease for larger pools?",
        "created_at": "2021-05-22T08:14:57.737000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "so it becomes much likelier to happen",
        "created_at": "2021-05-22T08:15:21.886000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Well actually I take it back, the economics of validators is a bit weird in that blocks are not rewarded by the votes they get but by the attestations they include (and after the merge the transactions as well). Since inclusion depends only on the next proposer seeing the block and not the attesters, you are right that there's an incentive to submit late",
        "created_at": "2021-05-22T08:20:50.243000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I had proposed a while back to change the way proposers are rewarded to include votes rather than attestations. But in the specs there's no direct mechanism to get the index of a block proposer given a slot number. Even though for the latest slots there's great chance that all implementations have them cached, this proposal required an ugly change in the specs which is to change `get_beacon_proposer_index` to take a slot number as second parameter.",
        "created_at": "2021-05-22T08:26:08.248000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Late proposing, and also the next slot's proposer ignoring your block, will definitely be even more of an issue if the stakes (pun intended) are higher. I still don't fully understand the incentives/penalties involved though, or if it's even possible to just ignore the previous block even when the slot's validators attested to it.\nGut feeling is that late proposing a block with high rewards in it might make it easier for the next block proposer to just ignore your block and claim those high rewards for themselves.",
        "created_at": "2021-05-22T08:51:48.386000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yep proposing after the 4 second mark likely means the next proposer is free to ignore your block without concern if they want to because it won’t have any attestations. The only thing that makes that difficult is that they can’t be sure if they got it late or if everyone did.",
        "created_at": "2021-05-22T08:54:22.736000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "But if the next block proposer _doesn't_ ignore the late block, does that mean the validators get less rewards (voting for wrong head)?",
        "created_at": "2021-05-22T09:05:25.333000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yes.",
        "created_at": "2021-05-22T09:06:56.887000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There’s been a few proposals to try and fix that but they haven’t worked out for various reasons.",
        "created_at": "2021-05-22T09:07:16.195000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I guess that goes for the other situation as well then? So when I propose a block on time, lots of validators attest to it, but the next slot's proposer ignores it. Then those validators will have voted for the wrong head (my block), no?",
        "created_at": "2021-05-22T09:15:04.462000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "No. In that case the next slot validators should all vote for your block because it has attestations and the next one doesn’t. \nFork choice always chooses the fork with the greatest attesting weight.",
        "created_at": "2021-05-22T09:51:34.909000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think many of these issues are mitigated by rewarding votes instead of attestations. I don't know what other issues would be raised though",
        "created_at": "2021-05-22T12:44:01.432000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It's tricky. What is happening currently with late blocks is that those that vote for the right head, namely those that did see a late block, get less rewards than those that vote for the wrong head",
        "created_at": "2021-05-22T13:04:41.139000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'd say that \"the right head\" is that of an empty slot when the proposer is late, but apparently that cannot be given any weight (yet) in the fork-choice rule",
        "created_at": "2021-05-22T13:44:58.755000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "As far as I remember there was a shift from (block, slot) to (block, epoch) in those proposals, so it doesn't look like empty slot will be the right vote anytime soon",
        "created_at": "2021-05-22T13:49:39.754000+00:00",
        "attachments": null
    }
]