[
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "The other potential way is to use different sync strategy for after the merge. According to this strategy either PoW or PoS blocks are verified according to post-merge rules, i.e. difficulty, ethash checks are simply excluded. This way would work for state sync only, at least a switch from PoW rewards to No rewards is required for block sync.\n\nThere might be edge cases for the transition period, though. Where verifying PoW could be more secure strategy even if `NewBlock` and `NewHead` already in place.",
        "created_at": "2021-04-26T08:40:29.622000+00:00",
        "attachments": null
    },
    {
        "author": "garyrong",
        "category": "general",
        "parent": "",
        "content": "Yes, peter also mentioned it that we can just disable the verification after the merge. Since the consensus layer is always trusted",
        "created_at": "2021-04-26T08:43:28.560000+00:00",
        "attachments": null
    },
    {
        "author": "garyrong",
        "category": "general",
        "parent": "",
        "content": "\u003e There might be edge cases for the transition period, though. Where verifying PoW could be more secure strategy even if NewBlock and NewHead already in place.",
        "created_at": "2021-04-26T08:44:08.952000+00:00",
        "attachments": null
    },
    {
        "author": "garyrong",
        "category": "general",
        "parent": "",
        "content": "yes, I am thinking how to implement it. In this transition phase, pow blocks from the p2p network should be verified meaningfully. Because it might be the canonical block.",
        "created_at": "2021-04-26T08:45:11.890000+00:00",
        "attachments": null
    },
    {
        "author": "garyrong",
        "category": "general",
        "parent": "",
        "content": "Use the post-merge rules seem make more sense.",
        "created_at": "2021-04-26T08:47:47.939000+00:00",
        "attachments": null
    },
    {
        "author": "garyrong",
        "category": "general",
        "parent": "",
        "content": "Because like the gas-usage, it can't be verified in the consensus-layer.",
        "created_at": "2021-04-26T08:48:20.205000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I see two reasons to keep accepting them. First one is implementation simplicity, consensus layer requests the head of the PoW chain, tests it against transition conditions and triggers corresponding logic. If the first embedded block is orphaned due to network delay and the slot is empty then the next proposer will have to filter block tree to pick up this first eligible PoW block once again; this is just adds a bit of logic on top of \"always take the PoW head if first embedded block is being produced\". The second reason is that if we would have first slot missed then there will be no falls in network capacity as the block space will be supplied by the PoW chain during this short period.\n\nThese two reasons are not that critical, though, might be desired still.",
        "created_at": "2021-04-26T08:50:03.781000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "It, actually, can. And there was an idea of including gas rule into `process_execution_payload` before the payload is sent to the execution-layer. But all block tree rules will start working since the *second* embedded block, bc they need a parent.",
        "created_at": "2021-04-26T08:52:45.200000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I was referring to the following edge case. A node starts syncing after a couple of first `NewHead` messages arrived, i.e. very close to the first embedded block. And it appears that reorg happens after and orphans these recent blocks, then state downloader will be restarted with the new fork. Taking in account the length of the period of time required to catch up with the state on the mainnet it must not be an issue.\n\nI think that bootstrapping the sync after receiving the first `FinaliseBlock` should be more secure. As the chain between `PowGenesis` and `FinaliseBlock` can be verified with post-merge rules only without loss in security for *any* moment wrt transition process. wdyt?",
        "created_at": "2021-04-26T08:59:15.390000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "btw, do you want to talk about the sync and transition during the merge implementers call this week? i'd add it to the agenda",
        "created_at": "2021-04-26T09:00:05.668000+00:00",
        "attachments": null
    },
    {
        "author": "garyrong",
        "category": "general",
        "parent": "",
        "content": "\u003e I think that bootstrapping the sync after receiving the first FinaliseBlock should be more secure\n\u003e Sounds reasonable.",
        "created_at": "2021-04-26T11:03:36.561000+00:00",
        "attachments": null
    },
    {
        "author": "garyrong",
        "category": "general",
        "parent": "",
        "content": "I would prefer to listen the discussion instead of talking something now. I still need some time to investigate 😄",
        "created_at": "2021-04-26T11:04:16.827000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "**Merge Implementers Call 3\nMeeting Date/Time: Thursday 2021/4/29 at 13:00 UTC\nMeeting Duration 90 minutes**\n\nAgenda: https://github.com/ethereum/pm/issues/305",
        "created_at": "2021-04-26T14:40:49.429000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Nothing specific in the agenda yet, feel free to propose topics for discussion",
        "created_at": "2021-04-26T14:41:34.527000+00:00",
        "attachments": null
    }
]