[
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "During the network upgrade (aka hardfork) the software will have to support two versions, e.g. the `V1` for the blocks before the fork epoch and `V2` for the blocks after the fork epoch",
        "created_at": "2021-11-10T04:04:15.705000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Is it anticipated that running both will cause the hardware requirement to increase? Is there a minimum hardware spec that the merge is aiming for? If not can I request one be done up since I know it’s not just me that wonders if a pi can handle being a validator post merge. I know there’s lots of testing being done before the merge to ensure things will work but until you set required hardware minimums then each client team is going to developing clients likely for top spec hardware\n\nI’ve seen several request that the pi not be recommended validator equipment on the website anymore and if it can’t handle post merge validation and gets slashed/penalized that would be a bit sad as the users have followed the guides written on the ethereum site.",
        "created_at": "2021-11-10T05:51:53.165000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "If you can run a beacon node and PoW chain client today you can run them post merge.",
        "created_at": "2021-11-10T05:58:51.096000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Correct me if I’m wrong but the current pi validators are only running the beacon node?",
        "created_at": "2021-11-10T06:00:30.735000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "“Besides, Eth 2.0 clients don’t support 32 bits binaries so using Raspbian would exclude the Raspberry Pi 4 from running an Eth 2.0 node (and the possibility of staking).\n\nSo, after several tests we are now releasing 2 different images based on Ubuntu 20.04 64bit [3]: Eth 1.0 and Eth 2.0 editions.\n\nBasically, both are the same image and include the same features of the Raspbian based images. But they are setup for running Eth 1.0 or Eth 2.0 software by default.”",
        "created_at": "2021-11-10T06:01:35.303000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "I’m going to go try running both and see how it holds up",
        "created_at": "2021-11-10T06:02:02.642000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Many people are using third party eth1 node on pis and other systems. All of them will need to start running their own nodes.",
        "created_at": "2021-11-10T06:03:16.731000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Rocket pool already did an experiment of running both nodes on a pi, https://docs.rocketpool.net/guides/node/local/prepare-pi.html#preliminary-setup",
        "created_at": "2021-11-10T06:11:51.902000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Awesome@ty glad to see it works",
        "created_at": "2021-11-10T06:15:30.036000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "The ethereum on ARM folks have been running eth1+eth2 tests on 8GB pi board and will be doing public tests on the upcoming merge testnets\nhttps://twitter.com/EthereumOnARM/",
        "created_at": "2021-11-10T14:35:05.941000+00:00",
        "attachments": null
    }
]