[
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "have the discussions stalled or been tabled RE providing eth1 miners additional block reward leading up immediately before the merge to ensure a cohesive handover?",
        "created_at": "2021-06-09T03:48:12.398000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "No one of the approaches that we have discussed here gives us required level of stability while extra issuance in a short period of time may have adverse effects that are pretty difficult for evaluation.\n\n- Subsidising miners after the merge to keep mining the PoW chain isn't trustless from miners standpoint\n- Paying extra rewards prior the point of Merge comes with uncertainty around the size of these extra payments (we will never know it for sure) and due to probabilistic nature of mining it comes with level of instability gradually growing as we will be approaching the point of Merge (probability for each miner to get the next portion of rewards is being constantly reduced)\n- Locking extra rewards until some point in the future doesn't work well as these \"futures\" may be sold in advance",
        "created_at": "2021-06-09T06:14:38.532000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "following-on, there should then be a logical reduction in hash power leading up to the merge (if there are not sufficient incentives to continue mining) , are there any discussions about precipitously reducing the difficulty leading up to the merge such that blocks will not be sufficiently delayed ?",
        "created_at": "2021-06-09T09:07:27.258000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The difficulty will automatically reduce as hashpower leaves.",
        "created_at": "2021-06-09T09:09:17.922000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Or is your concern that the hashing power will vacate faster than the difficulty can adjust?",
        "created_at": "2021-06-09T09:09:27.852000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "the latter...",
        "created_at": "2021-06-09T09:12:27.002000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "concerned that the \"day of the merge\" we will all be stuck watching blocks dribble out every 10-20min and delay the merge in a recoverable (but potentially a little bit embarrassing ) way ... while also remembering that it when the entire eth project should (as i understand it) be at its weakest point. ...",
        "created_at": "2021-06-09T09:15:36.190000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "i am not familiar with how fast the difficulty adjustment is for ETH... but maybe a 25% reduction of the difficulty the day of the merge may accomplish both... food for thought",
        "created_at": "2021-06-09T09:16:50.729000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "(or at a minimum reduce the difficulty adjustment timeframe the day of the merge) ..\nWhile i am not a miner, i can imagine the incentives to keep equipment running will drastically reduce approaching the weeks and days before the merge. with a particular emphasis on the day of.",
        "created_at": "2021-06-09T09:20:38.944000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "the day of the merge there will really be two types of miners.... well intended and nefarious miners. the ones that are economically incentivized will have already left before....  so the question is raised how do we ensure good folks (and some economic miners) stick around the day of",
        "created_at": "2021-06-09T09:22:21.936000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "maybe in the minority, i personally am still absolutely for an exponential increase in mining rewards leading up to the merge to ensure we retain economically incentivized miners.",
        "created_at": "2021-06-09T09:23:54.936000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I would much rather see a change in the difficulty adjustment rate than the difficulty itself.",
        "created_at": "2021-06-09T09:31:52.734000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Difficulty formula has a nice property of reducing difficulty much faster than if it would need to be increased. But if we get an instant hashrate drop resulting in 10mins per block it will still take a plenty of time. Though, this kind of drop should be huge and is quite unlikely. If hashrate drops twice we get 26 seconds per block, right? So, for a minute block time it must be x2.5 (5 times) and so force. I'd expect gradual hashrate decrease leading up to the merge",
        "created_at": "2021-06-09T09:32:02.714000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "E.g., if currently we can adjust difficulty by x% per minute, perhaps it can adjust by 10*x% difficulty per minute.",
        "created_at": "2021-06-09T09:32:35.017000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "i do agree that in the weeks leading up to the merge it will be gradual. my concern is the day of... with no net-present-value for subsequent mining, economic miners will accelerate and abruptly stop mining that day.",
        "created_at": "2021-06-09T09:35:00.286000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Why stop that day rather than the next day?",
        "created_at": "2021-06-09T09:35:37.893000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "well the next day there is no mining... PoS",
        "created_at": "2021-06-09T09:36:07.042000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Seems silly to turn off the money printer before it stops working, unless you are trying to sell your money printer for parts, which you would want to do much sooner than the day money printing stops working.",
        "created_at": "2021-06-09T09:36:27.682000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "in the absence of additional probability of solving a block, miners will look at the historic daily returns and migrate accordingly. this part is particularly more pronounced right before the merge.",
        "created_at": "2021-06-09T09:38:54.195000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I don't understand why this would change EV.",
        "created_at": "2021-06-09T09:39:47.843000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "At every moment in time miners should be looking at EV and deciding whether to power off or leave powered on.",
        "created_at": "2021-06-09T09:40:02.433000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If EV is positive for that moment, then leave on.  If negative, power off.",
        "created_at": "2021-06-09T09:40:13.242000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Looking at the future is something you do when considering hardware purchases/sales, and that isn't something you do on a 24 hour time scale in most cases.",
        "created_at": "2021-06-09T09:40:27.297000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "we are talking past each other a bit.... not disputing that point.",
        "created_at": "2021-06-09T09:40:44.540000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Current difficulty formula allows to decrease difficulty 99 times faster than to increase it. I would not change it at all. Incentives from EIP-2 (https://eips.ethereum.org/EIPS/eip-2) on the lower boundary: \n\u003e The cap of -99 simply serves to ensure that the difficulty does not fall extremely far if two blocks happen to be very far apart in time due to a client security bug or other black-swan issue.",
        "created_at": "2021-06-09T09:41:23.546000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "we also have to view this in the bigger picture of the competitive landscape of where else to send that hashpower.   my point is that while i totally get the EV notion... in a broader perspective , that analysis won't be made per block.. it will be made w a broad brush the day before or the day of...",
        "created_at": "2021-06-09T09:42:32.868000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "excellent! didn't know this .",
        "created_at": "2021-06-09T09:42:44.041000+00:00",
        "attachments": null
    }
]