[
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Suppose a BN is replaying blocks to get some intermediate state in the merge context, i.e. it requests eth1-engine to insert duplicates that results in eth1-engine is returning a success flag immediately",
        "created_at": "2021-02-04T09:13:27.196000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "This is what I was thinking about too. What if we have yet another round of resource exhaustion attacks on eth1, there were no such attacks after the Shanghai ones as I remember. But anyway we still have a risk of it. In the case after the merge it could result into a liveness issue. Thus, tight coupling of execution with the beacon chain opens increases a surface of liveness attacks.\n\nPossible protection would be a timeout latch on eth1 block production. A guarantee that block production (hence processing) won't take more than the timeout e.g. sent as a param to `produceBlock` call.",
        "created_at": "2021-02-04T09:18:55.523000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "\u003e 500ms was an over estimate\nIt's an overestimate for geth. But might not be for other eth1 clients. In the slide speculating about timeline of the first part of a slot I might have set propagation time to unrealistically low value. And now I am really curious about the following:\n- Do all clients run signature verification _only_ before propagating a block?\n- How much time it take to verify the signature on avg and at periods of spikes, e.g. when intermediate state should be computed to verify signature\n- How much time it takes on avg to disseminate a block across the network",
        "created_at": "2021-02-04T09:22:40.417000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Even though it takes a second for each of the following, producing, disseminating and processing a block we still have a second in advance. It doesn't take in account epoch processing which affect should become negligible in the most cases after optimisations that were recently discussed. Or do we expect dissemination to take, say 3 seconds? Hence my questions above.",
        "created_at": "2021-02-04T09:40:03.379000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "There is a possibility for anyone to recreate any version of eth1 state or even run an archive node. And stemming from the promise that all history blocks are guaranteed to be available in the network breaks this invariant. It appears to be another breaking change during the merge and might become an issue if some users are relying on it.",
        "created_at": "2021-02-04T09:52:25.095000+00:00",
        "attachments": null
    }
]