[
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "In this scenario a proposer would have to execute all blocks suggested by builders in order to pick up the most profitable one, right?",
        "created_at": "2021-08-30T09:04:23.476000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yes, but isn't that always going to be the case? (although again, note that value can be subjective, or measured across more dimensions than ETH received)",
        "created_at": "2021-08-30T09:09:47.415000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If there would be a separate payment channel then the proposer would read all required information from a payload suggestion (a hash of a payload and a bribe), would easily rate all payload suggestions and pick the most profitable one. And by including a header into a beacon block it would redeem the bribe given by the builder. Then the builder would need to publish the payload.\n\nWhat is also nice about this approach is that a payload content is unknown when the proposer makes a decision on which one to include. The complexity of this approach is this new payment channel that is needed to be added to the protocol, potentially introducing another type of accounts to the beacon chain as block builders would need to become validators otherwise.",
        "created_at": "2021-08-30T09:15:32.082000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Biggest bribe !== most profitable, though.  Without executing the block the proposer won't know what the tx fees coming back to them will be, so won't know what is actually the most profitable block for them.\n\n\u003e What is also nice about this approach is that a payload content is unknown when the proposer makes a decision on which one to include.\n\nI consider this an anti-feature.  Not only for the above reason, but because block proposers could well be on the hook, at least to some extent, for what they publish in certain jurisdictions at certain times.  Claiming ignorance may be no defence.\n\nWe're basically introducing a system where block proposers have to trust block builders.  If every block proposer can trivially be their own block builder I'm not so worried about it, but if anything starts to creep in to the protocol to force block proposers to favour one block over another I'd be very much against.",
        "created_at": "2021-08-30T09:30:39.046000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e I agree (re @dankrad: but I would say that this is the better behaviour)",
        "created_at": "2021-08-30T09:35:07.114000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e One possible simple special case is to make the max slack increase with the number of slots missed since the previous block (re @dankrad: But I agree that it would need a special case when more than ~1/3  blocks are missing)",
        "created_at": "2021-08-30T09:35:36.838000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e Another approach of course is to not bother, and just accept that if lots of validators are offline then the chain's functionality becomes pre-London-like",
        "created_at": "2021-08-30T09:36:25.224000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e Although... that has serious disadvantages, it means that the code paths to handle that case have to be implemented by wallets, even if they are only rarely used",
        "created_at": "2021-08-30T09:36:57.905000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e So maybe increasing slack to 3x if there are missed slots is reasonable",
        "created_at": "2021-08-30T09:37:12.561000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Increasing slack when slots are missed seems like a reasonable solution",
        "created_at": "2021-08-30T09:40:17.147000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e On the proposer/builder separation, I personally favor it, but I don't favor making it mandatory (ie. if a proposer *wants* to ignore the builder ecosystem and make their own proposal I think they should be able to)",
        "created_at": "2021-08-30T09:41:13.543000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "My understanding is that in this scenario the proposer won't get anything other than the bribe. Taking a clear understanding that the proposer has no access to the payload content, shouldn't a block builder be accountable for a payload content? It could be make accountable as there is its signature on a payload suggestion header.",
        "created_at": "2021-08-30T09:41:18.522000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e Right, we should even make the COINBASE opcode return the builder so there isn't a \"natural\" way to bribe the proposer outside of the builder -\u003e proposer payment",
        "created_at": "2021-08-30T09:41:55.367000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There are no guarantees that all jurisdictions will take that view.",
        "created_at": "2021-08-30T09:44:47.755000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e Sure, but the idea that proposers become *more* legally vulnerable if their functionality is reduced to picking the biggest number out of a hat seems less likely than the opposite",
        "created_at": "2021-08-30T09:46:05.143000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e If it was \"maybe more, maybe no effect\" that's one thing, but here it's \"maybe more, maybe less\", and most people's default impression seems to be less",
        "created_at": "2021-08-30T09:46:51.804000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Agreed, but in the latter case the proposer has some level of control over what they propose.",
        "created_at": "2021-08-30T09:46:53.057000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e But *just in case* you're right and it's more, giving proposers the choice to ignore builders and self-propose does seem reasonable",
        "created_at": "2021-08-30T09:47:19.369000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If it is trivial for anyone to become a block builder, and there are no protocol gates in the way of allowing a block proposer to pick a \"non-optimal\" block, then that seems to retain the flexibility for all cases.  The simplistic block builder may not provide the \"best\" block, but it allows the control for them to choose.",
        "created_at": "2021-08-30T09:49:53.593000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e btw I have my own reason for not wanting mandatory max-fee-picking à la some of the recent proposals: I think it improves censorship resistance if proposers retain the ability to be independently altruistic and ignore the highest-paying builder",
        "created_at": "2021-08-30T09:50:56.090000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "What also could be harmful with this scheme is somebody discovering a payload that takes say 6 seconds to get executed by average network participant. In this case changing e.g. the `coinbase` of a payload an adversary will be able to DoS the network paying the highest bribe, the severity of this vector will depend on the the highest bid price that is suggested by the market.",
        "created_at": "2021-08-30T10:00:52.553000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Micah is saying in \u003c#598292067260825641\u003e that it can be done today: find blocks that take longer than 12 seconds",
        "created_at": "2021-08-30T10:13:17.034000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "So if proposer does not see the block, it may well be a dos vector",
        "created_at": "2021-08-30T10:14:43.631000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "But currently there is a possibility to avoid including this transactions into a block, it should be a protection on the implementation level and I am not sure if any client has it today. But in the case when the payload is unknown in advance there is even no possibility for this kind of protection.",
        "created_at": "2021-08-30T10:15:21.150000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Do we have reason to believe validators will be more censorship resistant than block builders?",
        "created_at": "2021-08-30T10:20:26.297000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This kind of protection becomes more valuable for a PoS network in comparison to PoW because PoS is much more time restrictive. And it might be a good incentive to find and implement a solution protecting the network from resource exhaustion vector. The rationale behind this should be one of the outcomes of the Resource exhaustion post-merge R\u0026D, we should figure out how sever this vector is, my gut tells it's pretty severe.",
        "created_at": "2021-08-30T10:20:37.277000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If some government decides they want to censor certain content on Ethereum, will it be easier for them to assert that authority over proposers or builders?",
        "created_at": "2021-08-30T10:20:58.073000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Which is more mobile?  Can proposers migrate to lower censorship jurisdictions easier than builders can move?",
        "created_at": "2021-08-30T10:21:20.818000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e I think the important thing is that validators have a N/2 of N trust model, whereas builders have a 1 of N trust model",
        "created_at": "2021-08-30T10:21:45.867000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "That aligns with my thinking, which is why I'm surprised by your conclusion.",
        "created_at": "2021-08-30T10:22:10.599000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e surprised by which conclusion?",
        "created_at": "2021-08-30T10:22:21.221000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "That we should allow proposers to censor builders if they want.",
        "created_at": "2021-08-30T10:22:29.511000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Which is effectively what we are saying if we say that a proposer can ignore builders.",
        "created_at": "2021-08-30T10:22:50.624000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e The proposals rely on validators (in their capacity as attesters) to enforce top-fee picking. If less than 50% of validators are malicious, then all that proposers can do is delay some txs by a slot. If more than 50% of validators are malicious, then anything we do (except UASF) won't stop them.",
        "created_at": "2021-08-30T10:23:42.960000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e So I don't see \"proposers censoring builders in their capacity as proposers\" as a real risk worth protecting against",
        "created_at": "2021-08-30T10:24:14.854000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hmm, good point that we can easily UASF proposers but not builders.",
        "created_at": "2021-08-30T10:24:22.804000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If some government says \"anyone who proposes a block with bad stuff in it will be imprisoned\" and we allow proposers to override builders, then we would expect to see most proposers from that jurisdiction just not accept builder blocks.\n\nOn the other hand, if proposers *cannot* know what is in the block before proposing ever, then those proposers will go offline or move.",
        "created_at": "2021-08-30T10:26:56.458000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I feel like the latter is *healthier* than the former in terms of censorship resistance.",
        "created_at": "2021-08-30T10:27:03.919000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think we *want* validators to move to countries that are censorship resistant, rather than *trying* to enforce censorships demanded by their local authorities.",
        "created_at": "2021-08-30T10:27:47.547000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e My concern is that if we don't allow proposer to override builders, then we're throwing all our eggs into the builder basket despite having no practical experience with it",
        "created_at": "2021-08-30T10:27:48.273000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "That is a very reasonable fear.",
        "created_at": "2021-08-30T10:28:04.696000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Is there a way we could improve our confidence first, while still leaving a clear path forward that isn't bogged down by technical debt later?",
        "created_at": "2021-08-30T10:28:32.147000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e How do we *know* that there isn't going to be one builder that's reliably more profitable than the others, and by a significant enough margin that allows them to keep censoring some txs",
        "created_at": "2021-08-30T10:28:36.268000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e Make builder/proposer separation optional as  I propose, and then revisit the issue of making accepting top builder headers mandatory after we see how the optional version runs for \u003e1 year? (re @merge_chat_bot: \u003cMicah\u003e Is there a way we could improve our confidence first, while still leaving a clear path forward that isn't bogged down by technical debt later?)",
        "created_at": "2021-08-30T10:29:10.093000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e I don't think that even requires any wasted dev effort; optional separation is directly on the path to mandatory separation implementation-wise",
        "created_at": "2021-08-30T10:29:49.686000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e the latter is the former plus a fork choice rule change",
        "created_at": "2021-08-30T10:29:57.144000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I don't grok the implementation details well enough to know if that will come with technical debt.  If those more deep in the weeds assert that the cost of such a switch would be very low I'm willing to believe it and go with your proposal for now, with the weak agreement that if this builder separation works out we should revoke proposer rights to override later.",
        "created_at": "2021-08-30T10:30:09.261000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Also, I would want to make it clear to the public that this is a temporary right that may be revoked, so proposers don't get angry later when we take it away.",
        "created_at": "2021-08-30T10:30:29.660000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If a block proposer is forced to accept the block built with the highest bribe then censoring the network comes down to a cost of (current highest bribe + 1wei - total block rewards) per block.  That could be a small number.",
        "created_at": "2021-08-30T10:30:57.463000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I don't want to have to fight Coinbase, Kraken, and Binance in a hard fork that removes proposer override because their government's are making them censor.",
        "created_at": "2021-08-30T10:31:12.600000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e It's theoretically not that bad (re @merge_chat_bot: \u003cjgm\u003e If a block proposer is forced to accept the block built with the highest bribe then censoring the network comes down to a cost of (current highest bribe + 1wei - total block rewards) per block.  That could be a small number.)",
        "created_at": "2021-08-30T10:31:31.577000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e Because the censor would have to pay the cost of the priority fees of the txs they are censoring *every block*",
        "created_at": "2021-08-30T10:31:57.058000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e Whereas to get included, the tx senders only have to pay once",
        "created_at": "2021-08-30T10:32:05.144000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e So the griefing factors are quite strongly against the censor",
        "created_at": "2021-08-30T10:32:15.344000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cvbuterin\u003e Yeah, this is a totally fair concern (re @merge_chat_bot: \u003cMicah\u003e Also, I would want to make it clear to the public that this is a temporary right that may be revoked, so proposers don't get angry later when we take it away.)",
        "created_at": "2021-08-30T10:32:27.287000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If the builder can select whatever they want in the block they can pack it with other transactions that could be of similar rewards.  It's still a delta rather than an absolute.",
        "created_at": "2021-08-30T10:33:19.131000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "(in the degenerate case of having no other txs available the delta becomes the absolute, but we don't seem to run with an empty mempool very often)",
        "created_at": "2021-08-30T10:33:52.086000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "For one-block censorship yes, the cost is just the `base_fee + priority_fee` (effectively) of the transaction being censored.",
        "created_at": "2021-08-30T10:35:03.019000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "However, that needs to be paid by the censor for every block in a row that they want to censor.  So from the standpoint of a block builder trying to censor every block, they would have to have a more profitable block, every block, forever.",
        "created_at": "2021-08-30T10:36:08.767000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "So they have to pay that delta over and over for all time essentially.",
        "created_at": "2021-08-30T10:36:22.210000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Unless you can replace the censored transaction with a different transaction, in which case it's just the difference between the two.  Which is where you can have a very low cost to censor.",
        "created_at": "2021-08-30T10:36:36.461000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm not saying that censoring doesn't come with a cost, I'm just saying that the cost is reduced if the block proposer is forced to take the block builder's block.",
        "created_at": "2021-08-30T10:37:19.784000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "As of London, it is pretty rare that there are \"spare\" transactions lying around.",
        "created_at": "2021-08-30T10:37:21.886000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hmm, I'm not following why proposers being forced to accept builder blocks changes the calculus here?  Maybe I missed something above?",
        "created_at": "2021-08-30T10:37:56.251000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If I have a transaction that someone else is trying to censor, then I only need a single validator to eventually be in a position where I can propose a block that contains the transaction.  If all validators are forced to take the block with the highest bribe I am no longer able to do so.",
        "created_at": "2021-08-30T10:39:31.816000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It just changes from \"I need a single proposer to propose the block\" to \"I need a single builder to build the block\".",
        "created_at": "2021-08-30T10:40:14.120000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "https://etherscan.io/chart/pendingtx would tend to disagree with that assertion.",
        "created_at": "2021-08-30T10:40:18.310000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hmm, I think I see what you are saying.",
        "created_at": "2021-08-30T10:40:18.374000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Pending transactions != includable transactions.",
        "created_at": "2021-08-30T10:40:37.100000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Essentially every transaction in the pending pool is a transaction that *cannot* be included in the chain right now.",
        "created_at": "2021-08-30T10:40:50.425000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "(with some exceptions during times of rapidly increasing congestion)",
        "created_at": "2021-08-30T10:41:04.904000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Not if the proposer is forced to take the block that has the highest bribe attached to it.",
        "created_at": "2021-08-30T10:41:16.641000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The pending pool is entirely (effectively) transactions that *may* become includable later.",
        "created_at": "2021-08-30T10:41:30.684000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Historically it's been a case where there are a fair number that are just not worth as much as the ones that are included, but I'll concede that point for now as I haven't looked at the pool in detail for a while.",
        "created_at": "2021-08-30T10:44:54.024000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "In the normal (ignoring some rare edge cases because they don't really matter for censorship resistance) case where the most profitable built block doesn't include the censored transaction, the block builder has to eat a loss for excluding that transaction (`base_fee + priority_fee + 1`).\n\nIn the same scenario but where proposers can override, a non-censoring proposer can include the censored transaction but would take a loss of 1 attoeth.\n\nIf the censoring builder in that scenario pays more than just `base_fee + priority_fee + 1`, then the non-censoring proposer would need to pay whatever that difference is (opportunity cost).",
        "created_at": "2021-08-30T10:45:11.468000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "(still thinking this through)",
        "created_at": "2021-08-30T10:45:16.132000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Prior to London that is very true.  As of London, the pending pool should be almost entirely non-includable transactions.  That is, transactions that are considered unprofitable to include by all miners or are ineligible for inclusion.  If you find different that suggests a major bug in Geth that we should fix!",
        "created_at": "2021-08-30T10:46:17.704000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There's a difference between a proposer that is passively non-censoring, and one actively trying to include an otherwise-censored tx.  In the former case the builder won't increase their bribe above whatever the censor is proposing because that would cost them money for no ascertainable reason.  (The latter case I would hope we would not have to explicitly build, because it would suggest some sort of \"guardian angel\" block builder that could probably be taken advantage of.)",
        "created_at": "2021-08-30T10:48:14.799000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Any proposer that is passively non-censoring will censor even if they are allowed to override builders, because the builders are providing them with blocks that are more profitable than what they built (by +1 attoeth).",
        "created_at": "2021-08-30T10:51:35.947000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "So I think the actor we care about here is the proposer who is actively trying to include censored transactions.",
        "created_at": "2021-08-30T10:51:58.467000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "In the model where the proposer is not allowed to override builders, couldn't they just be a builder instead and achieve the same goal?  Just build a block and propose it and overbid the censoring builders?",
        "created_at": "2021-08-30T10:52:46.702000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Or is your assumption that one or more proposers will *never* accept builder blocks, and take a loss on potentially every block that comes through just to ensure that censorship doesn't happen?",
        "created_at": "2021-08-30T10:53:15.704000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yes but that seems to be a rather convoluted way around, and not guaranteed (you'd basically be in a race to secure the highest bid before whatever clock runs down).\n\nThe more general point is that having a system where a proposer is forced to accept the block with the highest bribe attached to it seems inherently less free than one in which the proposer can choose.  _Especially_ if there can be consequences for including said block (I believe that the discussion in consensus-dev was around penalising validators that include invalid blocks, which could interplay here if said block had the highest bribe), but just on the general principle of freedom of choice.",
        "created_at": "2021-08-30T10:59:41.559000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think it should be a choice.  I worry that a system that forces proposers to carry out a given action (in this case including the block with the highest bribe) could reduce their ability to operate as they desire within the bounds of the protocol.",
        "created_at": "2021-08-30T11:00:50.314000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yes, it definitely is a constraint of their power.  However, I don't think limiting the power of any particular actor over the system is inherently bad.  In general, I favor freedom when it opens the system up to more market forces, and I favor constraint when it prevents seizing power.",
        "created_at": "2021-08-30T11:12:05.988000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "In this case, I think limiting proposer power here would *slightly* limit the ability for a large actor to seize power, and I don't think we gain *much* in terms of freedom of market choice since the proposer could just be a builder if they wanted to express their values.",
        "created_at": "2021-08-30T11:12:47.114000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Proposers are valid protocol entities with skin in the game, and a mechanism to punish them if they don't fulfil their role.  Builders are just random nodes on the internet with no ties to the protocol at all.  Given that, I would prefer the proposers have the greater power and builders none.\n\nIf builders have to make a deposit, can be punished for building \"bad\" blocks, etc. then my opinion would change.  At current they are unconstrained by the protocol.",
        "created_at": "2021-08-30T11:15:31.773000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Specifically to this point, we should remember that a proposer is a validator.  If an entity controls enough proposers to carry out effective censorship they already have enough validators to do so, so I don't see this as a change to the status quo.",
        "created_at": "2021-08-30T11:17:39.987000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The ability to punish validators via UAHFs is a strong argument I think.",
        "created_at": "2021-08-30T11:29:33.579000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "And I would like it if we (core protocol developer and research community) were more public about our willingness to code and support such a hard fork so it is a viable threat to any would-be bad actors.",
        "created_at": "2021-08-30T11:30:20.688000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Was just skimming this, and wanted to mention: in geth, 'pending' means the tx can be included. We have 'queued' for non-includable txs.",
        "created_at": "2021-08-30T12:36:36.290000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Not sure what the definition of 'pending' is for the chart on etherscan.",
        "created_at": "2021-08-30T12:37:11.116000+00:00",
        "attachments": null
    },
    {
        "author": "_prefontaine",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "when does the next phase of Eth2.0 merge? Has a date been set yet?",
        "created_at": "2021-08-30T17:37:34.245000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "No, not yet, \u003c@!417907275269668864\u003e",
        "created_at": "2021-08-30T17:45:04.850000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "We are working on it, but it is still early.",
        "created_at": "2021-08-30T17:45:14.491000+00:00",
        "attachments": null
    }
]