[
    {
        "author": "yorickdowne",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This creates potentially some trouble for pools like RocketPool. Because the node operator can set the coinbase to anything they like, there is no way for Rocketpool to force sharing of inclusion fee. In RocketPool, a validator has 16 ETH from the node operator and 16 ETH from the pool. A node operator would receive 100% of the inclusion fee, rather than a portion. Given even one pool that shares inclusion fee rewards with its users, RocketPool would dry up. And there is no way I can see that RocketPool can force node operators to use a contract address as `coinbase`, because that can be set freely by the node operator.\n\nI don't have an excellent solution there either. I get that there's a desire to make these fees withdrawable.",
        "created_at": "2021-04-20T16:32:51.346000+00:00",
        "attachments": null
    },
    {
        "author": "trztn",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "RP could potentially just lower operator commission rates to account for estimated rewards. They also have oracles that could potentially even be smart enough to do accounting on coinbase rewards.",
        "created_at": "2021-04-20T17:01:34.807000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Thanks for bringing this in. I have no solution for this kind of problem off the top of my head. Making transaction fees withdrawable may break some other use cases. For example, execution node service which could leverage `coinbase` machinery to collect fees. This change would also bring more complexity to the design and consensus \u003c-\u003e execution interaction. Need to think that through.",
        "created_at": "2021-04-20T17:02:59.928000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Rocket pool should be able to split the rewards by using a splitter-contract address as coinbase address, and penalize/ban any user that produces a block with a different coinbase.",
        "created_at": "2021-04-20T17:05:38.692000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "was just about to suggest the same. depends on RPs operator governance though",
        "created_at": "2021-04-20T17:06:11.665000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "right, I was thinking that governance might not allow this kind of measures",
        "created_at": "2021-04-20T17:06:37.101000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It can be like a slashing of a bond. The block with the bad coinbase address was signed by the malicious actor, so it can be penalized in a trustless way",
        "created_at": "2021-04-20T17:07:24.274000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "accounting for transaction fees of already produced blocks via operator fees reduction sounds interesting",
        "created_at": "2021-04-20T17:07:29.474000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm just not sure how. The validator clients are being run by the node operators and hold the validation keys. So penalize/ban might be difficult technically. That'll be a discussion with Rocketpool devs later today when they wake up",
        "created_at": "2021-04-20T17:09:33.876000+00:00",
        "attachments": null
    },
    {
        "author": "trztn",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Balance withdrawals in RP already involve some oracle accounting of how to split the balance between the operator and the pool. This is currently just so that an operator who stakes 32 eth without being matched keeps all the rewards they earned until they were matched... but it opens the door to more complex accounting.",
        "created_at": "2021-04-20T17:11:43.948000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Interesting idea",
        "created_at": "2021-04-20T17:12:19.278000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "So account for coinbase rewards and just withdraw accordingly, calculate pool rewards with that in mind",
        "created_at": "2021-04-20T17:12:37.299000+00:00",
        "attachments": null
    },
    {
        "author": "boodle9209",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This is only a problem between merge and withdrawal activation, is that correct?\nIn other words, once withdrawals are enabled the coinbase is an ETH2 address which RP could more easily write into their contracts.",
        "created_at": "2021-04-20T17:23:39.368000+00:00",
        "attachments": null
    },
    {
        "author": "boodle9209",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If not, the RP node operator would be incentivized to never exit.",
        "created_at": "2021-04-20T17:25:08.094000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "And could potentially, over time, earn more inclusion fees than can be subtracted from their portion of the validator balance.",
        "created_at": "2021-04-20T17:25:47.327000+00:00",
        "attachments": null
    },
    {
        "author": "trztn",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Good point... and over time, if enough validators have no withdrawal value, maybe that could even turn into a cheap attack on the network for a collector of those valueless validators?",
        "created_at": "2021-04-20T17:41:28.095000+00:00",
        "attachments": null
    },
    {
        "author": "boodle9209",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "But if the coinbase just gets reverted to the validator address this is not really an issue",
        "created_at": "2021-04-20T17:42:56.407000+00:00",
        "attachments": null
    },
    {
        "author": "boodle9209",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "post-withdrawals that is",
        "created_at": "2021-04-20T17:43:06.363000+00:00",
        "attachments": null
    },
    {
        "author": "boodle9209",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It would take years (I think??) for the RP pool to get that far ahead, much longer than the fixed period of time between the merge and withdrawal activation.",
        "created_at": "2021-04-20T17:44:24.074000+00:00",
        "attachments": null
    }
]