[
    {
        "author": "_tachyonic",
        "category": "general",
        "parent": "",
        "content": "A useful overview: https://vitalik.ca/general/2021/04/07/sharding.html",
        "created_at": "2021-04-08T08:55:35.849000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "Yes this is a good overview but still does not address my original question about backing up the claim that sharding serves no purpose before POS. This article backs up my claim that sharding under POW like the orginal plan does serve a purpose. https://hackernoon.com/proof-of-work-pow-vs-proof-of-stake-pos-sharding-edition-9kae30ge Moving to POS may in fact hinder Ethereum scalability problem by slowing down the move to sharding by introducing an additional variable and learning curve for the team (POS). There is a very strong argument that can be made to use the current POW system to implement such a complex advancement as sharding before moving to new base system. Most of the POW devs find themselves asking the POS team questions about the intricacies of POS",
        "created_at": "2021-04-08T12:02:57.708000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "for anyone interested, I've been contributing to this new explainer resource, https://ethmerge.com/ open to any contributors",
        "created_at": "2021-04-08T13:20:16.689000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "wow! let me take a look",
        "created_at": "2021-04-08T13:26:32.682000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "Yay another woke article claiming how much energy is wasted securing a $200B asset class. If you want to write a truthful article about how much relative energy is consumed you should include this chart. Ethereum uses only .02% of worldwide energy. Compare this to the banking industry and I think you will be writing a fair article.",
        "created_at": "2021-04-08T13:49:55.113000+00:00",
        "attachments": [
            {
                "type": "image/jpeg",
                "origin_name": "Screenshot_20210312-150719_Brave.jpg",
                "content": "e67cb6f0643edc63d7b2ae20ce55840f5eef9506e03733d7ef61f39875e78189"
            }
        ]
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "\"Sharding under POW\" \n\ndo you mean to use pow nodes to shard across the network, or to use pos nodes to create sharding and then expose the sharded layer to the pow nodes?",
        "created_at": "2021-04-08T13:56:09.026000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "I would argue that the former has a similar (if not higher) complexity than just doing it with pos",
        "created_at": "2021-04-08T13:58:11.306000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "Keep in mind you can always skew data in the direction you want it. For example if you compared the amount of commerce GPU POW creates versus POS, I am pretty sure the 10,000,000 GPUs mining Ethereum creates a lot more jobs than the couple of thousand validator servers.",
        "created_at": "2021-04-08T13:59:19.934000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "Do a search on this Discord alone and you will find a lot of POW developers asking questions about this new system we call POS. It is very naive to think we can just switch to a new base system like POS and all the devs will be able to implement sharding without learning a new system (POS) first.  The original concept made sense to introduce sharding first on POW before moving it into POS. Working in parallel would have been the best way to implement and then finally merge. This allows you to use the full 1.0 client dev teams to work on sharding in an environment they understand and are experts.",
        "created_at": "2021-04-08T14:05:32.312000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "This is my guess why sharding is being pushed to the side as it is quite apparent small validators will be pushed out using sharding in POS",
        "created_at": "2021-04-08T14:20:33.385000+00:00",
        "attachments": [
            {
                "type": "image/jpeg",
                "origin_name": "Screenshot_20210408-081743_Brave.jpg",
                "content": "62307cc6093e0594c946d4188b41061e21647608d5ea8185e07ca8dc78b43ac9"
            }
        ]
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "I recommend reading the whole article, it is an eye opener.",
        "created_at": "2021-04-08T14:21:19.862000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "PoW devs provide an execution engine in the merged context. They get to black box both PoS and sharding",
        "created_at": "2021-04-08T15:08:42.974000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "The system is designed such that a small number of validators can be run on home hardware and bandwidth",
        "created_at": "2021-04-08T15:09:16.147000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "it is certainly the case that running all shards all the time would exceed nroaml bandwidth constraints at a home",
        "created_at": "2021-04-08T15:09:36.998000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "but that is the entire point of the design",
        "created_at": "2021-04-08T15:09:44.195000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "\u003e This is my guess why sharding is being pushed to the side as it is quite apparent small validators will be pushed out using sharding in POS\nThis is an incorrect guess\n\nEth2 attempts 3 things -- make the protocol more secure, sustainable, and scalable.\nSharding is being prioritized only after the merge because rollups coming online get much more *scale* out of ethereum in the next 3 to 6 months. Then, sharding (more L1 data) would enhance this scalability after.\nThus we can focus on the merge today to bring more security and sustainablility to the protocol today",
        "created_at": "2021-04-08T15:12:16.340000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "in combination, rollups + the merge give us a good dose of the three goals whereas sharding will enhance scalability later",
        "created_at": "2021-04-08T15:12:36.670000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "What year is this? I assume bitcoin power use is wayyyy up. I have seen various plans proposed to smooth out the merge and I think more discussion needs to happen around these. There is 500ths on the network and in a year there will likely be double this. There needs to be action taken now to slow this growth, likely by speeding up dag growth. By having stages of DAG growth you can retire equipment in stages rather than all at once at the merge. There of course need to be other plans and its not a bad idea to have a declining block reward POW chain that continues on for a bit to deincentivise any attack.",
        "created_at": "2021-04-08T19:51:14.013000+00:00",
        "attachments": null
    },
    {
        "author": "underbasic",
        "category": "general",
        "parent": "",
        "content": "that was my idea I pitched around the merge, increasing the dag instead of a difficulty bomb and removing asics",
        "created_at": "2021-04-08T22:23:47.957000+00:00",
        "attachments": null
    },
    {
        "author": "underbasic",
        "category": "general",
        "parent": "",
        "content": "thus reducing the amount of hashrate needed to protect/able to attack the network",
        "created_at": "2021-04-08T22:27:31.187000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "The chart was from a recent study published by Concensys. Total world energy production is over 160,000 THW and Ethereum usage 34 THW (0.02%). The people spinning this disinformation are using it to obtain their own agenda. https://digiconomist.net/ethereum-energy-consumption/",
        "created_at": "2021-04-08T22:27:41.683000+00:00",
        "attachments": [
            {
                "type": "image/jpeg",
                "origin_name": "Screenshot_20210408-162320_Brave.jpg",
                "content": "cec8af22fcec18f4e1fe0c1397bb6f4766c9a3af203856b0e8595a7481bd86b4"
            }
        ]
    },
    {
        "author": "underbasic",
        "category": "general",
        "parent": "",
        "content": "this could also have the effect of being able to reduce the cost (as the hash rate decreases) by reducing the block reward as there is less hashrate sharing it over time",
        "created_at": "2021-04-08T22:28:12.691000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "While I am a very strong advocate of renewable energy, targeting a new technology that is using energy supplied by governments is not their fault nor should it hinder advancement. It is the governments responsibility to upgrade their energy grids with renewables and to incentivize power production by the private sector like solar. That being said there are also studies that show Crypto power use is over 70% from renewables.",
        "created_at": "2021-04-08T22:33:51.672000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Can we stay focussed on the merge here please? Ethereum has always planned to move to PoS so arguing about what type of power is being PoW is irrelevant - we're moving to PoS and this channel is about how to do it.",
        "created_at": "2021-04-08T22:36:28.692000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "Agree, conversation began asking for data around sharding in relation to merge. Will take POW discussions to Off topic",
        "created_at": "2021-04-08T22:38:11.520000+00:00",
        "attachments": null
    }
]