[
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "I don't think I spoke very clearly this morning\n\nI think regardless of the route in which MEV is provided by a market (e.g. block builder bundles, current flashbots, querying a set of eecution engines, etc), the simplest way for a validator to assess the value of what has been provided is to check the effect on the COINBASE. This also reduces the overhead in what must be communicated a priori to the MEV market providers (i.e. some separate address)\n\nThus, whether you run your execution engine or not (not to mention research projects which aim to make this more of a requirement), I think it is a needless misdirection for the spec to allow for the execution engine to not listen to the request of the validator (validator requests through the beacon node).  All I can see is that this complicates potential MEV markets as well as BeaconNode and/or execution engine's assessment of correctness and/or value of a block",
        "created_at": "2021-08-27T01:13:35.249000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "cc: \u003c@!385978868131168259\u003e ICYMI ^",
        "created_at": "2021-08-27T01:29:34.829000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I'm guessing it is too much to ask to add a field to the block with the merge?",
        "created_at": "2021-08-27T02:56:50.256000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Perhaps during post merge cleanup forks we can add another address to the block, along with a new EVM instruction for accessing it.",
        "created_at": "2021-08-27T02:57:26.501000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "I tihnk adding a field to the block to facilitate some sort of MEV payment *before* figuring out the deeper block builder/proposer separation design is putting the cart before the horse",
        "created_at": "2021-08-27T03:06:14.215000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The block builder distribution will use whatever tools it has at its disposal.  Waiting to provide tools until after it is built may result in those tools not being used.",
        "created_at": "2021-08-27T03:19:53.387000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "That is, once there is a secondary payment channel system setup, there isn't an advantage for people participating in that system to switch to it.  The community is the one that benefits with wore transparency.",
        "created_at": "2021-08-27T03:20:38.761000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "If we end up with only one source of the `coinbase` which in this case will be the address passed as a parameter to `engine_preparePayload` it will reduce the complexity of re-solving the conflicts between two `coinbase` addresses coming from different sources. It will make the spec cleaner and client's behaviour unambiguous providing a better UX. If a staker runs several validators served by a single execution client then it will need to set the same `coinbase` for each validator which is appropriate and does not increase the complexity of VC's setup.\n\nI am in favour of one source of the `coinbase`. The question is whether we need an option for execution client to set the `coinbase` too. Is there any use cases for that? Perhaps staking pools depend on it?",
        "created_at": "2021-08-27T03:20:50.765000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "But MEV people are unlikely to change just for the benefit of transparency.",
        "created_at": "2021-08-27T03:20:57.939000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Right but are we certain enough that the block builders market will be introduced? I understand that it is pretty likely the case. And it will be convenient to have two fields as it makes it very easy to get what goes to the validator and what goes to the block builder. Though, we're not sure that introducing this field fits well as block builder publishes only a block header (or even a hash) first along with the bribe for a validator. And at that moment validator won't be able to check what it gets as the block body is not available. Potentially, we need another payment channel and introducing a field might not work as the needs are.",
        "created_at": "2021-08-27T03:28:31.081000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "The question: are these two fields is the design that we're looking for when aiming block builders market?",
        "created_at": "2021-08-27T03:29:36.469000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "What is a good word for \"the actor who submits the bock to the beacon chain\"?",
        "created_at": "2021-08-27T03:30:58.304000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Block validator doesn't seem to fit because *everyone* validates the block.",
        "created_at": "2021-08-27T03:31:08.067000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Block Proposer maybe, but that is a bit ambiguous since the block builder proposes the block to the execution client, and the execution client proposes the block to the x, and the x proposes the block to the network.",
        "created_at": "2021-08-27T03:31:58.631000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "it must be proposer",
        "created_at": "2021-08-27T03:32:06.499000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Proposer leaves his signature on a block and proposes it to the network in order to accept it or not. Builder shapes a transaction set of a block and proposes it to the proposer 😆",
        "created_at": "2021-08-27T03:33:13.957000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "yeah, same line of thoughts",
        "created_at": "2021-08-27T03:33:35.552000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I'll use proposer for this conversation, but I don't like it due to the ambiguity.  🙂",
        "created_at": "2021-08-27T03:33:37.134000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "My preference would be for the block to have two address fields.  One which is for the proposer, and the other is for the builder.  No matter how block building secondary market pans out, fundamentally (from a game theory perspective) there are two actors involved in the process.  There is the actor who decides what transactions get included in the block and in what order, and there is the actor that submits the block to the network.  Both of these actors need to be appropriately incentivized to do their job.",
        "created_at": "2021-08-27T03:34:55.003000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "In some cases, both roles will be filled by one actor, but I think we should design things so that those two roles *can* be split apart, and if they are we have a clean and transparent way of incentivizing both.",
        "created_at": "2021-08-27T03:35:46.873000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If I had to choose one, I would choose the proposer because that is the \"highest level\" actor, and then they can figure out secondary payment channels for payments below them.  I would rather have two addresses though.",
        "created_at": "2021-08-27T03:37:05.931000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Right, but should these two addresses go into an execution block or should one of them (on the highest level) be on top of the execution block that is being built and set up by builder when it sends a proposal of the execution block to the proposer.",
        "created_at": "2021-08-27T03:39:07.084000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think both of them should be accessible by the EVM, which I think means they both need to be part of the execution block.",
        "created_at": "2021-08-27T03:39:41.192000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Hmm, I see what you are saying I think.  🤔",
        "created_at": "2021-08-27T03:40:28.016000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We want to make it so the proposer address can be added to an execution block after the fact.  🤔",
        "created_at": "2021-08-27T03:41:04.511000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Ugh, this causes some problems.",
        "created_at": "2021-08-27T03:41:11.135000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If the proposer address is unknown until late in the process, it means that the post-block state is unknown until after that address has been appended.",
        "created_at": "2021-08-27T03:42:05.179000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It also means that transaction execution may flow differently (particularly if the proposer address ends up being a contract).",
        "created_at": "2021-08-27T03:42:22.906000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "For maximum flexibility we would want the block builder to be able to execute a block that transfers money to the block proposer, but such that the block builder doesn't need to know the block proposer's address at the time of block build.",
        "created_at": "2021-08-27T03:43:46.470000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "It make sense for proposer to claim the bribe in advance when receiving a block proposal from builder and do not care about transaction execution after that.",
        "created_at": "2021-08-27T03:43:59.352000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Which I think implies that they **have** to pay via some other payment channel.",
        "created_at": "2021-08-27T03:44:02.727000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "right, this is one of the potential designs to my understanding",
        "created_at": "2021-08-27T03:44:50.632000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Like maybe you include a transaction that allows the block proposer to withdraw funds in a future block by submitting a proof of inclusion or something.",
        "created_at": "2021-08-27T03:44:53.522000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I am sorry, I have to run. Will be happy to continue chatting on that here or on one of the calls 🙂",
        "created_at": "2021-08-27T03:45:46.925000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Would be good to get \u003c@489256758989029405\u003e and \u003c@385978868131168259\u003e's thoughts on the above discussion.",
        "created_at": "2021-08-27T03:46:14.278000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "first attestor / lead attestor?",
        "created_at": "2021-08-27T05:23:47.796000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Surely the above will be post-merge, and the conversation can be delayed until then (and until they're is a better ideas as to if a separate block builder is the way that blocks will be produced in the main) . Given everything that has been removed from the spec to make deployment as minimal as possible, this doesn't seem to me to be top of the list when it comes to things to add.",
        "created_at": "2021-08-27T08:13:37.648000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think that is true for adding a second address.  However, we still need to figure out what the `coinbase` field in the execution block represents prior to the merge.",
        "created_at": "2021-08-27T08:16:29.762000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I'm not sure that the builder address should have a privileged position.  I'm not a fan of building being part of the protocol anyway, as it reduces various other use cases (not least that of the existing method of generating blocks from the public transaction pool) but in the situation that block building is outsourced it would e up to a non-protocol discussion between the builder and proposer as to how the builder would be paid.  Given the proposer would have to sign whatever transaction is present in the block anyway, it appears that this ends up being hard-coded one way (in the tx) or the other (in the block) and the former would be a lot simpler.",
        "created_at": "2021-08-27T08:32:38.085000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "In a public marketplace for blocks, the block builder and proposer don't have a pre-existing relationship/arrangement.",
        "created_at": "2021-08-27T09:08:32.887000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The block builder builds a block and essentially broadcasts it out to everyone.  The proposer then looks through all of the proposed blocks that people have published and picks the most valuable one to sign over.",
        "created_at": "2021-08-27T09:09:04.120000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I originally thought that having the proposer be the address returned by the `COINBASE` opcode would help with this, but I actually don't think it does because without knowing the coinbase address up front you cannot generate the new block state root (at build time), and coinbase could be a contract that has some behavior upon receipt that changes transaction execution for the rest of the block (or at least gas used).",
        "created_at": "2021-08-27T09:10:54.768000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Just as there might be a public market for blocks, there is similarly a public market for transactions.  The transactions need a way to publish into the global pending pool such that any block builder can build a block and receive payment from those transactions.",
        "created_at": "2021-08-27T09:11:48.664000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "In the latter case, having the block builder be the coinbase actually does help, because the transaction author wants to pay the block builder, not the block proposer in this two tier model.",
        "created_at": "2021-08-27T09:12:18.501000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "1. We want the people who publish transactions to be able to pay the person who constructs the block.\n2. We want the people who construct blocks to be able to pay the people who person who proposes their block.",
        "created_at": "2021-08-27T09:13:05.696000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It is *only* in the case where the block builder == block proposer that we want transaction authors to pay the block proposer.  But even in that case, the transaction author is still paying the block builder, it just so happens that is the same person as the block proposer.",
        "created_at": "2021-08-27T09:13:45.746000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I'm concerned that if we go forward with the model of block proposer == block.coinbase, then we are not gaining any significant benefits, and we are hurting our ability to have a superior model for builder/proposer differentiation in the future.",
        "created_at": "2021-08-27T09:14:45.513000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "My current preference is to include a coinbase address in the `prepareBlock` method, but encourage consensus clients to provide a configuration option that allows the execution client to return a block with a coinbase that doesn't match that.",
        "created_at": "2021-08-27T09:16:00.303000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This gives us flexibility for better transparent block production marketplaces in the future, but it also allows us to launch without that and allow people to setup their infrastructure such that the coinbase comes from the consensus client.",
        "created_at": "2021-08-27T09:17:54.112000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I disagree with your point 1) above.  We want the people who publish transactions to be able to pay the person who proposes the block.  Constructing a block has no inherent value, in contrast to proposing a block.  This simplifies the process, removing 1) and flipping 2) so that block proposers pay the block builder.  As to how block proposers pay block builders, I'm strongly inclined to keep that out of the protocol.\n\nAll that said, I'm okay with your current preference.",
        "created_at": "2021-08-27T10:18:19.293000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I don't see how this is a misdirection for the spec since it's actually cleaner and simpler for the spec to not say anything about this: validator requests a block with a given coinbase. That's it, no extra requirement. It's up to implementers if they want to check it matches or not. I'm inclined to support this idea since it's the simplest from a specification perspective and leaves open several options instead of closing them at the spec level",
        "created_at": "2021-08-27T10:21:20.038000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Constructing a block has value to block proposers.  I *weakly* agree that it doesn't provide value to the network as a whole since there is a very naive strategy that any executor can run.",
        "created_at": "2021-08-27T10:25:07.762000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "That being said, I think there may be value in segregating the transaction gossip stuff away from execution clients in the future and into another layer.  I think having a block-builder network, and a way for block builders to pay block producers, could facilitate that split.",
        "created_at": "2021-08-27T10:26:17.373000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Given that constructing a block has value to block proposers, does  it not follow that block proposers should pay block builders for that value?\n\n(I think that we're moving in to the more general area of block building.  I think that it makes a lot of sense for the tx p2p network to be logically separate from the execution engine, and we could see a plethora of models for how those txs are handled as a result.  I'd rather keep things as open as possible for now, so that these can have space to develop.)",
        "created_at": "2021-08-27T10:30:57.522000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I strongly agree on keeping things as open to future mutations in architecture.",
        "created_at": "2021-08-27T10:31:51.936000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Hmm, interesting view on proposers buying blocks from builders.  🤔",
        "created_at": "2021-08-27T10:32:18.434000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "In that model, the builder would construct a block with some kind of promise on it that \"this block is worth X to the person who mines it\".  The proposer would then pay the builder to release the block's details.",
        "created_at": "2021-08-27T10:32:57.861000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The model I had in mind was that the transactions would pay the builder for inclusion in a built block, and the builder would pay the proposer for inclusion in the chain.",
        "created_at": "2021-08-27T10:33:28.713000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "My gut likes the latter better, but I'm not sure why.",
        "created_at": "2021-08-27T10:33:44.483000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "More convoluted? 😉",
        "created_at": "2021-08-27T10:34:05.946000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "To me the latter feels simpler than the former.",
        "created_at": "2021-08-27T10:34:19.173000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "But that could easily be just because it has been in my head longer.",
        "created_at": "2021-08-27T10:34:29.650000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think I would like to see what solutions are available if coinbase is set by the proposer.  I feel like that *closes* a number of potential solutions for payments and while I can imagine some solutions to it, none of them are particularly appealing to me (complex).",
        "created_at": "2021-08-27T10:35:42.857000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If coinbase is set by the proposer, we can't have block builders build complete/valid blocks that can be published to a global block network.  Each block needs to be build specifically for a given proposer (coinbase).",
        "created_at": "2021-08-27T10:36:42.104000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "At best, they can build a block that *probably* is valid and doesn't have a post state root.",
        "created_at": "2021-08-27T10:37:10.573000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This may not be a big issue if the proposer coinbase is known in advance of the previous block being published, but I don't know if that will be the case.",
        "created_at": "2021-08-27T10:38:05.715000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Agree, but I don't think this has much in terms of consequence.  Each block will need to be rebuilt each time head changes, and we know the proposer (although not the coinbase directly, but that's another area I think should be addresses out-of-protocol).",
        "created_at": "2021-08-27T10:38:29.111000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think I would be more satisfied with that solution if we knew the coinbase in advance in-protocol.",
        "created_at": "2021-08-27T10:39:35.426000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Otherwise we are back to needing another gossip network in the core.",
        "created_at": "2021-08-27T10:39:52.392000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "There are a couple of things here.  We already have the potential for an ETH1 address as the withdrawal address, which could be used in the absence of other info.  Or we could state that block builders and producers have to work together (again, out-of-protocol) to arrange something for this.",
        "created_at": "2021-08-27T10:42:40.950000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Using the withdraw address would work, but only if we are willing to forcefully bind it.  That feels like one of those things where we are constraining the solution space.",
        "created_at": "2021-08-27T10:45:04.872000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Requiring block builders and producers work directly together is likely to encourage centralization, as it is expensive to have established relationships with *everyone*.  I would prefer a solution where block builders can publish their blocks more broadly without establishing a relationship/connection to producers.",
        "created_at": "2021-08-27T10:46:20.737000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "That being said, if the only aspect of this relationship is just \"here is the address for my upcoming block\", that isn't too bad.",
        "created_at": "2021-08-27T10:46:36.619000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I guess the question comes down to where the effort should be placed.  Adding to the protocol to provide this information seems like the wrong place to do so, so we're back to having a separate system in which to provide this data.\n\nPersonally I'm fine with this being centralized, because I don't see the value in protecting this (as the block producer can always reject the block if it doesn't use their desired coinbase).",
        "created_at": "2021-08-27T10:48:48.142000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "My problem with centralization is that it reduces censorship resistant potentially.",
        "created_at": "2021-08-27T10:50:23.064000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Only if the block producers rely on the block builders.  In my mind, all block producers always have a fallback of \"build a block from the public tx pool\".  It may not have the highest value, but will always be a path for block proposers to propose.",
        "created_at": "2021-08-27T10:52:45.437000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I think I have a profound misunderstanding of how MEV works. I had thought that the block builder would benefit directly from the transactions included and that the arbitrage opportunities three outweigh by far the tips and fees from simply including them. That's why I always assumed that there wouldn't be a problem for block builders to simply set coinbase to whatever the proposer wants.",
        "created_at": "2021-08-27T10:54:55.668000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If block proposers are all accepting blocks from block builders, and block builders are gated (centralized, need to know people, etc.) then we have an avenue for introducing transaction censorship, which is what we want to avoid the most I think.",
        "created_at": "2021-08-27T10:55:55.611000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Yes, block builders can make money off of deciding transaction order.  We want a censorship resistant way for transaction authors to pay those block builders though, since they are the ones that ultimately decide who gets into the chain and who doesn't.",
        "created_at": "2021-08-27T10:57:25.039000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Well, technically the block producers are the final arbiter.  But if they are just getting blocks from block builders then functionally it is the block builders who decide who gets included and who doesn't.",
        "created_at": "2021-08-27T10:58:19.536000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Ideally, the priority fee goes to the actor making that decision (who gets included and who doesn't).",
        "created_at": "2021-08-27T10:58:38.493000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "This is only true if block proposers can _only_ accept blocks from block builders, no?",
        "created_at": "2021-08-27T11:00:06.784000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If we assume block proposers are profit motivated, we should assume that they only will do that.",
        "created_at": "2021-08-27T11:00:37.926000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Except it would still be possible for a tx to be published in the public pool with a high tip, at which point the block producer would build its own block with that tx in it",
        "created_at": "2021-08-27T11:01:50.044000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Only an altruistic block proposer would propose a block that paid less but pulled transactions from a public pool.  More importantly though, ultimately such a block proposer is really just a block builder who also happens to be a block propser.",
        "created_at": "2021-08-27T11:01:51.332000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "In this situation I consider that person to be a block builder, not a block proposer.",
        "created_at": "2021-08-27T11:02:06.760000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "A given actor can fill both roles simultaneously, but from a modelling perspective it simplifies things to model them as separate.",
        "created_at": "2021-08-27T11:02:29.738000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Okay, so yes in that case I think that it makes sense for every block proposer to be a (naive, low-cost) block builder as well.",
        "created_at": "2021-08-27T11:02:35.399000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "In this case, we can model this as the block builder subsidizing a low value block in order to altruistically include some transactions that maybe are getting censored.",
        "created_at": "2021-08-27T11:03:12.830000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I don't like the idea of the system relying on someone subsidizing blocks in order for transactions to avoid censorship.",
        "created_at": "2021-08-27T11:04:09.747000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I disagree with \"subsidizing\".  There is no guarantee that block builders will always build the highest-value blocks, and even if they do there is no guarantee that those blocks will be of highest value to the block proposer (_e.g._ a block that contains a tx the proposer wants to have included on chain may not be highest monetary value but still preferred).",
        "created_at": "2021-08-27T11:05:01.316000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Ultimately it should be up to the proposer to select whichever block they want, for whatever reasons they want.  Otherwise we're back in to restricting models.",
        "created_at": "2021-08-27T11:05:41.549000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "In a liquid market for blocks (which I suspect there will be) proposers stop wasting resources building own blocks.",
        "created_at": "2021-08-27T11:05:48.291000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "They would just validate the best block they saw on the open market and propose it.",
        "created_at": "2021-08-27T11:06:29.935000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "They don't even need to subscribe to any global pending transaction pool in such a case (which can sometimes be resource intensive).",
        "created_at": "2021-08-27T11:06:54.402000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Possible.  But if the (perhaps centralized) block builders are known to be censoring blocks I would expect a new block builder to turn up that builds uncensored (and higher-value) blocks, which would then be picked up by the producer.  Which is why I'm not too worried about centralized services for block builders: it will be a competitive market rather than a cartel.",
        "created_at": "2021-08-27T11:09:03.809000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I agree with that all fully.  I want to emphasize though that this only works properly if the block market is free/unconstrained/ungated.",
        "created_at": "2021-08-27T11:10:51.233000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Yeah, I'm thinking that federated rather than decentralized is possibly the better model.  But worth playing with both to see.",
        "created_at": "2021-08-27T11:16:39.057000+00:00",
        "attachments": null
    },
    {
        "author": "thegostep",
        "category": "general",
        "parent": "",
        "content": "working on it, have not forgotten",
        "created_at": "2021-08-27T18:02:55.527000+00:00",
        "attachments": null
    }
]