[
    {
        "author": "stank2872",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Two questions:\n\n- currently beacon chain essentially runs empty blocks.  Is there a quantiative analysis showing that beacon chain will be able  produce 15M gas  blocks at least at the same rate as ETH1? The reason why I am asking is  ETH1 mining pools have highly optimized and powerful networks and nodes, and non-mining nodes simply serve as downstream replicas. With ETH2 there is full symmetry of proposers, which means that proposers will need to have fast networks (or speed will suffer)\n- Will ETH2-client/geth combination be able to process blocks at a a speed to of the current ETH1 main net\n\nI think those are important questions, since if ETH2 merged net ends up to be slower than ETH1,  gas fees will skyrocket",
        "created_at": "2021-05-26T10:50:01.979000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Blocks on the beacon chain have a regular pace and the network produces them at the beginning of each slot. The right question to ask would be would the beacon chain coped well with production of blocks with 15M gas payloads inside them? And after 1559 the limit in this kind of considerations will be doubled.\n\nDon't you think that miners run this super-speed hardware because they have to execute blocks as fast as its possible in order to increase the possibility of finding the solution first? There is not such arm race in the beacon chain at all. And regular hardware that executed blocks in a sane amount of time should be pretty much enough.\n\nA sane amount of time is a time that would allow for creating (execution is a part of creation process), propagating, verifying (executing a block again) in 4 seconds throughout a slot. This is when attestations should be fired and attestations must include a block proposed in a same slot in order for the system to make progress.",
        "created_at": "2021-05-26T11:00:10.568000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "You might be interesting in reading this blog post, https://blog.ethereum.org/2021/05/18/eth_state_problems/\nIt has a quantification of time required to process the worst case block with `25M` gas limit. These numbers with recent upgrade on the state management (snapshot introduction) look really promising.",
        "created_at": "2021-05-26T11:02:55.061000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Though, I don't think that block execution time matters that much for mining itself. Miners should always have a block to make a work on, thus, machines they have should be powerful enough to run the client and serve `eth_getWork` RPC requests at required pace which requires additional cycles spend on block execution.",
        "created_at": "2021-05-26T11:37:19.725000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Regular (non-mining) nodes are definitely capable of staying in sync with the network",
        "created_at": "2021-05-26T15:42:19.125000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "And we know that verification time is in the hundreds of milliseconds",
        "created_at": "2021-05-26T15:42:29.482000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "(somewhat related to the \"smoothing\" talk just now in \u003c#595701319793377299\u003e )\n\nIs there any write-up of any kind of how one might pool tx rewards after the merge? The ideas that I seem to come up with have many requirements (i.e. hypothetical opcodes accessing the beacon chain etc.) and flaws (\"socialize losses, capitalize profits\").",
        "created_at": "2021-05-26T22:31:29.884000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "You mean without being part of a beacon chain pool?Staking pools can easily do this",
        "created_at": "2021-05-26T22:45:36.571000+00:00",
        "attachments": null
    }
]