[
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Increased network delays would cause another problem. Poisson process parameters that we have on Ethereum today assume much less network delay, otherwise, chain security might be reduced; if network delay is of the same order of magnitude as block time then we have honest miners being inefficient which could be exploited by adversary.\n\n10 minutes cut off potentially results in portion of hashpower is off as well. And further steps would depend on how big this portion was. I suspect this outstanding case (I do believe we haven't seen such thing before, don't we?) would require manual intervention nevertheless.\n\nWhat I really like about this soft rule is that, for example, regular users may not turn on it at all while market places may set it to a safe distance like `64` or event `128` blocks (default distance of state pruning) and set a number of confirmations to the same number to protect themselves from double spend attacks. It would reduce UX for relatively short period of time but IMHO it definitely worth doing so as it improves security for this period.",
        "created_at": "2021-05-16T07:26:31.484000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I agree, we could expect much lower increase than that (if there will be a decision to increase rewards prior the merge). The drop off is more likely but still not that much because default option is keep collecting rewards until it becomes impossible to. \n\nRegarding the time of the merge. I think it's difficult to pick up the right time due to timezones issue because client implementers are spread all over the globe. We could try to find an optimal time frame which most of developers are fall into. So, I would pick up the minimal safe time to react if something really goes wrong during fork on the beacon chain and I think 2 days is pretty enough timeframe to identify the problem and react accordingly.",
        "created_at": "2021-05-16T07:31:48.201000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I have long been an advocate of allowing a configurable local-finality (meaning distance an Ethereum client is willing to reorg back without manual intervention), and encouraging people to set it to *random* numbers.  This creates protection from a number of attacks because the attacker doesn't know the reorg distance of all of the nodes on the network, so they cannot know how far back they can safely do a deep reorg.",
        "created_at": "2021-05-16T08:04:45.397000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I would be happy if even just exchanges did this and everyone else used some \"very far back\" follow distance.",
        "created_at": "2021-05-16T08:05:11.245000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If we assume 51% of hashpower switches over to a secret fork, then instead of taking ~8 minutes of a network partition to cause problems, it would take ~16 minutes.  I don't think this is significant enough of a difference to matter.",
        "created_at": "2021-05-16T08:07:04.575000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Re: Have we ever seen a global network partition before, that is a good/interesting question.  These days there are usually *many* routes so even when a whole DC goes down or cables are cut things can route another way.  However, the Chinese firewall is a bit special because it is centrally controlled and one can *imagine* the Chinese government deciding they want to hurt Ethereum, so they shut down the firewall for 15 minutes.  🤷",
        "created_at": "2021-05-16T08:08:18.989000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "That is probably a pretty unlikely scenario, but I feel like since we are specifically building a system that is supposed to be resistant to government censorship attacks, we should do our best to defend against exactly that.",
        "created_at": "2021-05-16T08:09:02.260000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Network should resist and self-heal in this kind of problems in general long term case. But I think we may change self-healing property for a short period of time if network could benefit from it. Like in the pre-merge state.\n\nWere there any other counter arguments you've met advocating for local-finality?",
        "created_at": "2021-05-16T08:38:40.502000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It creates a new DoS vector which may be worse than the thing you are trying to fix.",
        "created_at": "2021-05-16T08:47:10.930000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If I miner or miner conglomerate were able to acquire 51% hashing power, they could do a 32 block secret side chain (which is free for 51%) and when they come back online all other miners need manual intervention and possibly a re-sync to come back online.",
        "created_at": "2021-05-16T08:48:06.843000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "And they can just claim \"network partition 🤷\" if it is only 15 blocks long and they don't execute any double spends in the middle.",
        "created_at": "2021-05-16T08:48:32.693000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If the follow distance is random/unknown (e.g., all users set it manually) this isn't a problem, but it is if there is some hard-coded default like 32 blocks.",
        "created_at": "2021-05-16T08:49:06.638000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I haven't heard really any arguments against my random-local-finality idea other than \"meh, PoS is coming so not worth the effort\".  😃 I haven't shopped it around a lot though.",
        "created_at": "2021-05-16T08:49:49.616000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I see it in a following way. Miners don't need to enable local finality at all. Those users who want to protect themselves using it. If 51% attack happens and longer malicious chain reveals then miners are switching on it adhering total difficulty rule while users with local finality get stuck until the end of attack and manual recovery after attack that would fork away malicious chain segment. Without manual recovery it could be the case when network will have to build this malicious chain.",
        "created_at": "2021-05-16T09:13:27.997000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If miners and users are following different rules, then we have a chain split.",
        "created_at": "2021-05-16T09:22:40.529000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Imagine the following scenario:\nUsers are all using 32 block local finality.  Miners are using 1000 block local finality.  51% of hashpower stealth mines a 32 block chain.  Once the stealth chain is revealed, all miners switch to it and mine on top of the stealth chain.  All users halt.",
        "created_at": "2021-05-16T09:23:59.100000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "right, this is what I meant by stuck",
        "created_at": "2021-05-16T09:24:23.967000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Should the users switch to the attack chain, because that is where 100% of the miners are?  Or should they demand everyone rollback?  In either case if we can answer in advance what the right answer is, then we should have had all miners and users on the same ruleset (whichever we deem right).",
        "created_at": "2021-05-16T09:24:47.131000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "but it's not gonna be a chain split unless miners have local finality too",
        "created_at": "2021-05-16T09:24:48.885000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It will be a chain split in the sense that all miners are on one chain and all users are on another chain.",
        "created_at": "2021-05-16T09:25:24.669000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "One of Ethereum's consensus features is that it doesn't halt.  If we are willing to halt, there are a whole bunch of solutions to various problems open up, but we historically have been unwilling to halt in any circumstance.",
        "created_at": "2021-05-16T09:25:52.722000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Yes, in that sense it will be a split. I don't know what usual behaviour of community during 51% attacks happening and wrt recovering from it. Which chain is considered the right one?",
        "created_at": "2021-05-16T09:26:28.915000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I am considering a time period between merge epoch is announced and transition completes as a special case. We might or might not want to revisit the set of rules and properties of Ethereum network that we desire to have considering that this period is relatively short and it gives us real benefits like attack protection.",
        "created_at": "2021-05-16T09:30:17.604000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Currently, the \"Right\" chain is the longest by definition.",
        "created_at": "2021-05-16T09:31:10.143000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "No matter how deep the reorg.",
        "created_at": "2021-05-16T09:31:17.954000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "So, no recovery and intervention is actually needed, right?",
        "created_at": "2021-05-16T09:31:46.179000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I'm not a fan of turning off a major system security feature for a well defined and well known period of time.",
        "created_at": "2021-05-16T09:31:50.790000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Yeah, it will always recover using current rules.",
        "created_at": "2021-05-16T09:32:11.638000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "What is the attack you are trying to defend against?  I think I missed it early on in this conversation.",
        "created_at": "2021-05-16T09:33:05.295000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "51% attack near the merge",
        "created_at": "2021-05-16T09:33:48.589000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "ok, then introducing a need of manual intervention isn't that easy",
        "created_at": "2021-05-16T09:34:04.746000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Technically it would probably be easy.",
        "created_at": "2021-05-16T09:34:19.340000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Just requires changing the consensus rules.",
        "created_at": "2021-05-16T09:34:39.535000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "However, it doesn't \"solve\" 51% attacks, it just changes their nature and I'm not sure that change in nature is a win.",
        "created_at": "2021-05-16T09:34:56.764000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "If we'd have this kind of preventing measure then attack likely wouldn't happen. This is my thought",
        "created_at": "2021-05-16T09:35:18.572000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Under the rules you are proposing (if I understand them correctly), a 51% attack would halt the network instead of causing a shadow mined chain to takeover.",
        "created_at": "2021-05-16T09:35:38.423000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "you mean, it changes the result of attack, right? like instead of double spend we get network halt for some users",
        "created_at": "2021-05-16T09:35:59.364000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It is possible that it would be more profitable to halt the network right before The Merge than it would be to try to double spend.",
        "created_at": "2021-05-16T09:36:05.339000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We get a halt for *all* users if the mitigation is working properly.  🙂",
        "created_at": "2021-05-16T09:36:29.081000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "and then this longest chain could be finalized by the beacon chain once transition happens, finalizing double spend on it as well. as we won't likely revert the merge back 🙂",
        "created_at": "2021-05-16T09:36:52.512000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "IIUC, we want a shadow mined chain to *not* be accepted by the network, and the way we achieve that is by halting when we see it.",
        "created_at": "2021-05-16T09:36:55.512000+00:00",
        "attachments": null
    },
    {
        "author": "mohamed.mansour",
        "category": "general",
        "parent": "",
        "content": "Are we looking for the merge testnet?",
        "created_at": "2021-05-16T09:37:09.367000+00:00",
        "attachments": null
    },
    {
        "author": "mohamed.mansour",
        "category": "general",
        "parent": "",
        "content": "testers*",
        "created_at": "2021-05-16T09:37:19.173000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If validators are willing to validate a shadow mined chain, then I feel like the halt is just a poor user experience and nothing more.  All users break, but we still accept the shadow mined chain anyway, which means the users could have just followed the original rules in the first place and not halted.",
        "created_at": "2021-05-16T09:37:47.269000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If validators are unwilling to validate the shadow mined chain, and miners are willing to follow the shadow mined chain, then the system halts until miners manually rollback.  In this scenario, we would have been better off with miners also refusing to reorg past 32 blocks.",
        "created_at": "2021-05-16T09:38:57.190000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "We definitely look for more testing of the merge code which is happening now in the Nocturne devnet and it is expecting to see much more testing efforts in a month or two. do you have anything related to testing on your mind?",
        "created_at": "2021-05-16T09:39:29.301000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If validators are unwilling to validate the shadow mined chain, and miners are unwilling to mine on the shadow mined chain, then the system doesn't halt, but becomes susceptible to network partitions (such as short term government censorship attacks) and network splitting attacks, where you stealth mine exactly 32 blocks and publish exactly when the main chain is about 32 blocks so part of the network splits (those who see the shadow mined 32 blocks first) from the other (those who see the publicly mined 32 blocks first).",
        "created_at": "2021-05-16T09:40:30.233000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "It would make transition process even more complicated by adding a kind of social approval of the transition block hash and manual intervention again. Otherwise, validators won't be able to recognize which block to keep building the chain upon.",
        "created_at": "2021-05-16T09:40:52.573000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "What specific problem are you trying to defend against around the merge here?",
        "created_at": "2021-05-16T09:41:36.083000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Is it just the risk of miners deciding to burn the city down on the way out?",
        "created_at": "2021-05-16T09:41:49.910000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "It's a risk of double spend that we have been discussed a while ago",
        "created_at": "2021-05-16T09:42:50.001000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "It's more of a risk miners deciding to rent their hashpower and some party uses it for attack",
        "created_at": "2021-05-16T09:44:18.927000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "In that case, I *suspect* the damage of the attack in against a system with local finality is as bad or worse than the damage of the attack against a system without local finality.",
        "created_at": "2021-05-16T09:45:15.649000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Though, the question is. Whether mining pool is able to rent its hashpower or is it possible for hashpower owners only. THe latter would make this scenario less likely",
        "created_at": "2021-05-16T09:45:23.597000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Agree. I see that local finality at least won't help us to get protected against 51% attack. Especially if it happens a few blocks before the transition giving no time for social coordination and according reaction",
        "created_at": "2021-05-16T09:46:34.889000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Also an attack can be executed against local finality via censorship alone (network partition), while attacking the current system requires controlling hashing power directly.",
        "created_at": "2021-05-16T09:47:19.950000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Thanks a lot for discussing this through!",
        "created_at": "2021-05-16T09:51:52.870000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Thanks for giving me my daily dose of human interaction.  My government mandated psychiatrist will be pleased with my progress.  😉",
        "created_at": "2021-05-16T09:54:18.721000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "I do think that, _just in case_, we want a \"manual emergency setting\" for the merge. Something like \"start accepting blocks that are descendants of X as first-embedded-blocks starting from timestamp T\" where (X, T) can be negotiated off-chain",
        "created_at": "2021-05-16T20:28:34.168000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "this would of course only be used if a 51% attack actually happens",
        "created_at": "2021-05-16T20:28:44.830000+00:00",
        "attachments": null
    }
]