[
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "General question:  are proposals like these being seriously considered for the merge? \u003chttps://github.com/ethereum/consensus-specs/pull/2731\u003e is there any compelling reason to address MEV right now and not in a future fork? I feel like a lot of honestly useful functionality was left out of the merge in the name of simplicity and having a smaller surface of failure. Aren't these extra structures adding complexity and presumably delaying the merge because of larger testing times?",
        "created_at": "2021-11-21T00:58:07.527000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdannyryan\u003e No mev related stuff is going to make it into core specs this point.\nMev market support for hobbyist vals is very impotant. Thus designs like mev boost. But all of those specs should be additive and work on top of base merge specs",
        "created_at": "2021-11-21T01:00:40.488000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdannyryan\u003e And unless native pbs, I don't think any mev side market design will show up in core specs ever",
        "created_at": "2021-11-21T01:01:06.927000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Ah thanks for clarifying! I started freaking out when saw that these PRs are being based on the merge branch",
        "created_at": "2021-11-21T01:08:07.341000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "We do need to have a conversation on where things like this should live. And I'll pick it up in the issue you linked",
        "created_at": "2021-11-21T01:08:07.425000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Haa",
        "created_at": "2021-11-21T01:08:10.932000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Also, note that current flashbots design does not scale past ~10 entities so it would be super centralizing to not have a design that works for the thousands of hobbyists",
        "created_at": "2021-11-21T01:08:41.589000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yes, and currently CL uses `eth_` namespace for Eth1Data poll which will stay the same after the Merge. Adding `eth_` to the same port doesn't break any assumptions and should make CL's life a bit easier as it won't use JSON-RPC API endpoint in addition to the Engine API one",
        "created_at": "2021-11-21T03:20:47.291000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It's still the hash of EL's block header, but fields related to PoW are deprecated and set to constant values as per EIP-3675, `transactionRoot` is still used and given a list of transactions is computed on EL side",
        "created_at": "2021-11-21T03:24:35.519000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Oh, I see.  You want to add the `eth_` namespace to the EL\u003c=\u003eCL channel, not add the `engine_` namespace to the public JSON-RPC channel.",
        "created_at": "2021-11-21T05:22:49.221000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "While I think that is reasonable in theory, I worry that for some clients that may introduce some complexity or code duplication depending on how it is architected.",
        "created_at": "2021-11-21T05:23:22.803000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It may not be simple for all clients to expose the `eth_` namespace on two ports, or to expose only the `eth_` namespace and not all of the others.",
        "created_at": "2021-11-21T05:24:24.946000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think that would be a bad code smell the client would want to illuminate.\nIf there’s a practical reason it would be difficult then it’s worth a conversation but I wouldn’t make up hypotheticals about it being difficult.",
        "created_at": "2021-11-21T06:27:30.876000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This is one of those things where I think we should \"start\" the conversation by asking the various clients if it is easy, because I think it is more likely than other changes to be difficult.  If it is easy for everyone, then I think it is fine.",
        "created_at": "2021-11-21T06:33:29.717000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Rather than designing it and having some clients implement it only to find out later that it is going to be a problem is one or more clients.",
        "created_at": "2021-11-21T06:33:57.830000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I’m really struggling to see how you make this difficult in a client to be honest. \n\nWe can’t complicate our designs on a hypothetical that something is complex.",
        "created_at": "2021-11-21T07:07:40.454000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I can totally imagine an internal code architecture where the namespaces are coupled with the endpoint.  Perhaps you are using a library that is designed with this assumption, or you just wrote your code with that assumption.  These are solvable problems, but perhaps complex enough that it doesn't make sense to include it in a minimum viable merge.",
        "created_at": "2021-11-21T07:36:47.268000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Ideally, every client would have all the right abstractions in all the right places and this will be a one-line code change.  My experience in the real world suggests to me that not everyone will have all of the right abstractions in all of the right places though.",
        "created_at": "2021-11-21T07:37:23.487000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Sure, it's possible this will be a problem for someone and we can readjust.  But let's not just assume stuff is hard, especially when it at face value it should be simple.",
        "created_at": "2021-11-21T08:16:49.920000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Really what I'm lobbying for here is just that at this stage of the process, with a strong desire to get to a spec freeze, one of the *first* steps for any change proposal should be to validate difficulty of the change with all of the impacted teams.  If we weren't trying to hard to reach a code freeze I would likely care less, but I would like to avoid the recent situation with the TTD flag in CL only ending up being difficult for Geth to implement (which came as a surprise to many), and we only learned of it after sinking non-trivial time into discussing and developing a solution that we ended up dropping.",
        "created_at": "2021-11-21T08:40:39.879000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It is possible I am suffering from some recency bias here, but even if I try to discount that (which I recognize is non-trivial), I still think that at this stage we should be evaluating complexity of change as one of the first steps in any change proposal so we can avoid spending time iterating on changes that are going to end up being high complexity.",
        "created_at": "2021-11-21T08:41:53.799000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think the reality is that if we don’t make eth_ available on the execution engine we’ll have to add at least get block to the engine_ api as the CL requires the ability to get the total difficulty for execution blocks to validate the TTD was reached.",
        "created_at": "2021-11-21T08:52:49.833000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Why can't the CL connect to the public EL JSON-RPC API?",
        "created_at": "2021-11-21T09:17:05.558000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I mean we can but now we’re adding complexity to the CL client which has to have to use two endpoints for one job. And given that request ids have to be sequential that’s an additional complication. Probably doable but again why not just plan for the clean approach and if it’s hard for someone we can look at alternatives then.",
        "created_at": "2021-11-21T09:26:12.226000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Why do request IDs have to be sequential?",
        "created_at": "2021-11-21T09:41:07.777000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "So that requests can be sent asynchronously and the order, which is important, can still be guaranteed on the EL side.",
        "created_at": "2021-11-21T10:26:15.888000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hmm, I thought Geth (and possibly other clients) didn't guarantee JSON-RPC response or processing ordering?",
        "created_at": "2021-11-21T10:26:47.728000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Or do you just mean that the CL will process them in the order they were sent, even if they receive responses out of order (using the JSON-RPC ID to ensure that)?",
        "created_at": "2021-11-21T10:27:08.877000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The EL is required to process them in order. Fork choice updates being reordered would cause problems for example",
        "created_at": "2021-11-21T10:27:42.123000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm assuming the EL client teams know of this requirement?  Just thinking about Nethermind's internal JSON-RPC processor implementation, I don't believe processing in order is something that will happen automatically without work.",
        "created_at": "2021-11-21T10:28:38.933000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Well geth and Nethermind claim to implement the spec according to the kintsugi milestone tracker so I assume so.",
        "created_at": "2021-11-21T10:31:56.800000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Happen to have a link to where the ordering stuff is specified?",
        "created_at": "2021-11-21T10:34:30.060000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hmm, actually a more general question: Where is the specification for the `engine_` API endpoint happening at?  I don't see it in the EIPs repository.",
        "created_at": "2021-11-21T10:37:36.347000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Ah, \u003chttps://github.com/ethereum/execution-apis/tree/main/src/engine\u003e appears to be the place.",
        "created_at": "2021-11-21T10:38:55.211000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "And \u003chttps://github.com/ethereum/execution-apis/blob/main/src/engine/specification.md#message-ordering\u003e is the section on explicit ordering.",
        "created_at": "2021-11-21T10:39:26.395000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdannyryan\u003e I am also beginning to bias against changes, even small\nThere are some renamings coming through monday as well as some exceptional ttd treatment, but we are definitely getting to the place where we should only be changing things if they are broken.",
        "created_at": "2021-11-21T15:13:56.173000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "A thousand knives can push a ship date by many months",
        "created_at": "2021-11-21T15:15:40.569000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Would be good to give people a week or so's warning between \"we want this to be final\" and \"we aren't going to change this unless it's a security issue\", so they can spend some focused time looking at the specs in their near-final form, knowing that they aren't likely to change substantively.  Certainly for people like me, who are not directly involved in the changes that have happened recently but would at least like to take a look at the specs to comment if they see anything very awry, a signposted time period where this would be possible would be much appreciated.",
        "created_at": "2021-11-21T15:19:43.927000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The testnet launch in december is supposed to be this. If not \"we wont changeit from here\" at least \"we know the final tweeks and they are going into a spec release immediately\"\n\nAll client engineering teams are vetting specs through building and I'd encourage anyone else that intends to look at it to do so this very soon\n\nThis process (or running it for a month) could uncover deeper things but we'll have to adjust if/when that happens",
        "created_at": "2021-11-21T15:39:11.955000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Cool, just helps to know when the spec goes from \"work in progress\" to \"we think this is it (give or take)\", but before \"this is set in stone\".",
        "created_at": "2021-11-21T15:45:01.175000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Got it\n\nI'll write a bit about kintsugi and intended next steps on monday blog post",
        "created_at": "2021-11-21T15:47:01.177000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "You are essentially referring to the Last Call phase of an EIP IIUC, which I don't think consensus specs have a concept of (also you want it for the entire specification IIUC).",
        "created_at": "2021-11-21T16:21:10.434000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdannyryan\u003e Yep, another reason we might need to use EIPs or some better structure post merge...\nBut not going to debate that today 😶😅",
        "created_at": "2021-11-21T16:37:04.313000+00:00",
        "attachments": null
    }
]