[
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "quick and basic question.. post-merge, with a consensus layer and execution layer, where will the actual blockchain data be stored (I would assume the consensus layer, though in this space, assumptions are killers!) ... so if a node operator were running prysm and geth, do we expect the chain under prysm to start growing substantially faster post-merge?  thx.",
        "created_at": "2021-06-07T10:21:12.359000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Beacon chain nodes will have to store execution payload because it is included in every beacon block. The size of the payload should be near the same as the beacon chain blocks today. But because of the weak subjectivity period it should not be an issue as history data that goes beyond recent WS checkpoint will be pruned. While execution clients (ex-pow clients) will store all the data of the execution chain as they are today, at least right after the merge; long term there is an intention to expire and prune this data as well",
        "created_at": "2021-06-07T10:32:07.987000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "exclude the notion of pruning for a moment... if I understand what you wrote correctly, I believe it means that things will pretty much stay the same as they are today.. n?",
        "created_at": "2021-06-07T10:36:00.095000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "right, they will. Except of the beacon chain block size (roughly, it will be doubled). But it doesn't mean that prysm will need to maintain Ethereum Mainnet state, it will be still deferred to geth after the Merge. If that is what you're asking about.",
        "created_at": "2021-06-07T10:51:59.930000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "gotcha. thank you!",
        "created_at": "2021-06-07T11:06:00.436000+00:00",
        "attachments": null
    }
]