[
    {
        "author": "samajammin",
        "category": "general",
        "parent": "",
        "content": "Thanks for looking into this! I've responded on the issue: https://github.com/ethereum/ethereum-org-website/issues/3434#issuecomment-907850048",
        "created_at": "2021-08-29T18:54:47.568000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e I think the ideal behavioour should be that a missed block is treated like an empty block in terms of the basefee (re @merge_chat_bot: \u003cpietjepuk\u003e If a proposer does not perform its duty (slot not filled with block), I assume the execution clients do not update their head block right? A missed block then also doesn't have any effect on the base fee?)",
        "created_at": "2021-08-29T21:29:56.113000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "Then the el needs to know about the missed slots on cl",
        "created_at": "2021-08-29T21:46:52.903000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "Otherwise it can't update the basefee",
        "created_at": "2021-08-29T21:47:11.159000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "yeah, this is doable since the validator is requesting the block can pass this information, but I think it requires changes both in execution and the consensus RPC API at the same time which probably increase the complexity of the merge",
        "created_at": "2021-08-29T21:47:49.998000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "Yes",
        "created_at": "2021-08-29T21:48:04.731000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e ok, so maybe something for the merge cleanup then",
        "created_at": "2021-08-29T21:48:24.845000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e but I would say that this is the better behaviour",
        "created_at": "2021-08-29T21:48:38.186000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "It looks doable and reasonable to me at least",
        "created_at": "2021-08-29T21:48:40.832000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I'm not sure if the additional work is worth the effort.  A missed execution block feels more like a \"no information =\u003e no change\" situation rather than an \"empty block =\u003e reduce base fee\" situation.  The end result is likely to be more congestion in the following execution block, so reducing base fee in advance seems counter-intuitive.",
        "created_at": "2021-08-29T21:56:27.944000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "but if you don't most probably you'll end up with an unnecessary higher hike in the first block after the missed one.",
        "created_at": "2021-08-29T21:58:37.135000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "either way it does seem like an EIP would be necessary (I don't know if those will still be the mechanism to update execution) but from the point of view of the current execution we would be changing 1559 rules, to lower basefee even though the next block will be full and based on the previous parent that wasn´t missed.",
        "created_at": "2021-08-29T22:00:28.139000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e I think this is a repeat discussion, but the \"no information, no change\" analogy is not good.\nLet's say that the base fee is currently \"correct\", i.e. leads to exactly half full blocks.\nThen the skipped block will lead to a decrease in basefee, and the next block will be 100% full so increase back to the previous level -\u003e no change (after two blocks). This is good behaviour.\nIf instead it's \"no change\", then the next block will be 100% full and lead to an increase in base fee.  Doesn't make sense since the execution chain average load is still exactly the desired load (and EIP1559 is about saying that it's mostly average load that matters) (re @merge_chat_bot: \u003cjgm\u003e I'm not sure if the additional work is worth the effort.  A missed execution block feels more like a \"no information =\u003e no change\" situation rather than an \"empty block =\u003e reduce base fee\" situation.  The end result is likely to be more congestion in the following execution block, so reducing base fee in advance seems counter-intuitive.)",
        "created_at": "2021-08-29T22:04:04.786000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Not sure that it's unnecessary.  Say, for example, that every other block was missed on the consensus side.  That would result in a rough halving of the execution chain capacity and so I would expect to see a higher base fee as a result (assuming the same amount of gas consumed per second).",
        "created_at": "2021-08-29T22:04:58.244000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e half of the blocks missing is a really extreme case",
        "created_at": "2021-08-29T22:05:41.775000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e my point is, we have a mechamism that can keep capacity constant even if 10-20% of slots are missing and it seems sensible to design it like that. I don't think there's a downside",
        "created_at": "2021-08-29T22:06:34.688000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e But I agree that it would need a special case when more than ~1/3  blocks are missing",
        "created_at": "2021-08-29T22:07:02.725000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "\u003c@!555483069038198827\u003e yeah it was more illustrative.  Even if we're \"only\" missing 10% of blocks it does result in an overall reduction in capacity so I would expect base fee to rise under constant gas usage per second conditions.",
        "created_at": "2021-08-29T22:08:24.660000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e it is a possible design decision but I think it's suboptimal. Yes the max capacity decreases but the system is still able to handle the \"average\" load (which is 50% of all blocks being full) so why not design the economic mechanism to target that. In my opinion there is no downside, can you tell me any?",
        "created_at": "2021-08-29T22:10:02.119000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e I think the only effect is that basefee is a bit slower at ramping up in case there is a surge. Not sure if that's such a big deal",
        "created_at": "2021-08-29T22:11:54.497000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I suppose this somewhat comes down to the question of if an average of 50% full blocks with every block present is different from (e.g.) 75% full blocks with 2/3 of blocks present.  For me it feels like the latter situation should be considered more constrained capacity and as a result incur a higher base fee, as there is less headroom for spikes and so it diminishes one of the strengths of EIP-1559's design.\n\nThat said, this is only off the top of my head and I haven't thought very deeply about it.",
        "created_at": "2021-08-29T22:14:20.529000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e I believe this exact same discussion already happened somewhere. Don't know if it was an issue or this channel",
        "created_at": "2021-08-29T22:17:46.735000+00:00",
        "attachments": null
    }
]