[
    {
        "author": "Deleted User",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Is this approximately how the merge fits into the roadmap of future upgrades (of course pending final decision in the next ACD call)?\n\n- Berlin (April 14, 2021)\n- Altair (June-ish 2021)\n- London (July 2021)\n- Quick merge (late 2021)\n- Post-merge cleanup (early 2022)\n- PoS “feature fork” (mid-2022)\n- Shanghai (mid-to-late 2022)\n\nAnd after the merge, will application-layer upgrades like Shanghai be worked on and delivered in parallel with consensus-layer upgrades?",
        "created_at": "2021-03-20T06:52:56.543000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm not a fan of the quick merge personally because it basically means all of the stuff that is backlogged due to Berlin taking forever to reach consensus has to wait *years* before it gets implemented.",
        "created_at": "2021-03-20T08:41:31.223000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Things like 3074 have potential to *greatly* improve the UX for real users today, and waiting until 2022 or 2023 before that gets included sits very poorly with me.",
        "created_at": "2021-03-20T08:41:56.405000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "BLS is another one that is very valuable because it enables people to build reasonable zkRollups over the next couple years while we sort through The Merge, and I would hate to put zkRollup scaling on hold for 2 years while we deal with The Merge.",
        "created_at": "2021-03-20T08:42:56.581000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "And of course there are a whole bunch of little things like BASE_FEE opcode which are crazy cheap to implement and allow useful things like protecting ORs from censorship attacks which has value in scaling over the next couple years.",
        "created_at": "2021-03-20T08:43:42.698000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think that the merge is more a process than an event.  Personally I think that the merge needs to start, with the swap from PoW to PoS, as early as reasonably possible, but beyond that there will be several steps that will be rolled in to the ETH1 upgrade schedules and fight for developer attention the same as any other EIPs.",
        "created_at": "2021-03-20T09:21:52.488000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I do agree with the general sentiment, there are some things on the roadmap that would be neat to have as soon as possible. But devil's advocate, there will always be things like that on the roadmap, and if we are always postponing the merge so we can do those small and important changes, then it's highly unlikely we will get a window to do the merge",
        "created_at": "2021-03-20T09:24:00.191000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The Merge is *only* the swap from PoW to PoS IMO.  I don't know why people are calling sharding and other future features part of The Merge?",
        "created_at": "2021-03-20T09:25:39.379000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I would replace the term \"quick merge\" with \"consensus upgrade\" for clarity",
        "created_at": "2021-03-20T09:26:52.953000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Agreed.  In this particular instance though Berlin was kind of pathologically bad in terms of actually getting things done in the application layer and so we are in a particularly bad spot right now because we went almost a year without any hard fork.",
        "created_at": "2021-03-20T09:26:55.708000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Also, I *really* would like to see more progress made on an actual specification or conversion document for application developers.  I don't like the current situation which feels really like the consensus client devs and researchers have everything in their head and they want to pull the application client developers away from other tasks to try to brain dump on them.",
        "created_at": "2021-03-20T09:28:00.927000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I would much rather the consensus teams codify exactly what it is they need from application teams first so we can then have a productive conversation on timelines.",
        "created_at": "2021-03-20T09:28:25.403000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminion",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This is normal for Ethereum governance, hardly pathological - 2018 was fork free (~15 months between forks/upgrades). It what I was moaning about in the latest eth2.news.",
        "created_at": "2021-03-20T09:29:16.660000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It may make sense to pull one application client dev away to help with prototyping, but we should pick a client dev for a team that is generally \"ahead of the curve\" so we don't have to hold up application client work while that prototyping is done.",
        "created_at": "2021-03-20T09:29:34.620000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There are various facets, though.  Vitalik's quick merge is a different beast from Mikhail's full merge.",
        "created_at": "2021-03-20T09:29:38.973000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think I agree with \u003c@425572898787426305\u003e.  We should get some more precise names.",
        "created_at": "2021-03-20T09:30:05.428000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\"Consensus Swap\" maybe?",
        "created_at": "2021-03-20T09:30:15.793000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Totally",
        "created_at": "2021-03-20T09:30:22.439000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Consensus upgrade?",
        "created_at": "2021-03-20T09:30:38.768000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "We now need names for all of the other pieces.  🙂",
        "created_at": "2021-03-20T09:31:26.249000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It's not that full actually, the full merge would mean that application chain is merged with the beacon chain with pretty big impact on the network.",
        "created_at": "2021-03-20T09:31:47.770000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Consensus Upgrade, Validator Withdraws, etc.\nAnd then some bucket names that include certain sets of things.",
        "created_at": "2021-03-20T09:31:51.967000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Do we think that a \"full\" merge like that will ever happen?  Or will we keep the two layers at arms length.",
        "created_at": "2021-03-20T09:32:50.223000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "1) Consensus Upgrade\n2) `Eth1Data` follow distance cut\n3) BEACONBLOCKROOT opcode\n4) Validator withdrawals\n5) Merge chains (app with beacon)\n\n1+2 can go together as 2) doesn't seem that complex and involves only beacon chain work but this is not yet decided. \n\nIt would make sense to deploy 3+4 at once\n\nThis is a rough change set. 5) is the \"full\" merge but it requires a layer that will provide the application chain history beyond WS period; and it also requires application JSON-RPC changes. This is why it's that complicated and we don't want it to go with the consensus upgrade.",
        "created_at": "2021-03-20T09:36:56.197000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The \"quick merge\" is 1+2?",
        "created_at": "2021-03-20T09:37:51.540000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "the quick merge is just 1)",
        "created_at": "2021-03-20T09:37:59.959000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "And \"The Merge\" is 1+2+3+4?",
        "created_at": "2021-03-20T09:38:01.761000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The full merge is all together, the executable beacon chain implied 1+2+3 but could be easily stripped down to 1+2 or just 1",
        "created_at": "2021-03-20T09:38:43.717000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "To be more precise, executable beacon chain was not explicit about the 5) but it was implied in the time of the origin proposal. After the R\u0026D workshop, merging two chains was re-visited with the decision to decouple it from consensus upgrade and propose separately for the sake of simplicity and to make core developers' and researchers' lives easier.",
        "created_at": "2021-03-20T09:45:33.314000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e regarding the specs for the application layer. The draft of a highlevel spec for consensus part is here, https://hackmd.io/@n0ble/eth1-eth2-communication-protocol-draft. It should be purified and adjusted to consensus upgrade needs, i.e. block roots should be removed as EVM does not expose them.\n\nIt does not include block gossip deprecation, state and full sync adjustments, simply speaking does not cover the network part of the application layer.\n\nAnd there are might be huge changes behind each method of this simple RPC in the modern clients. `setHead` implies that fork choice and block storage based on difficulty are deprecated and should undergo corresponding changes which could be pretty big. Block production doesn't require much I think as `getWork` is already exposed. Block import means removing any consensus validation e.g. ethash, difficulty, time restrictions.",
        "created_at": "2021-03-20T09:53:29.631000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The work on merging the chains will start after the consensus upgrade. Keeping two chains is redundant and it makes sense to have only one chain, the beacon chain and the application layer to manage the state and be stripped down to state transition function only. Even transaction pool may sit in the beacon chain network. \n\nBut it would require a work on the history data retrieval and JSON-RPC upgrade. Also, plans on scaling execution on L1 would also be an input to merging the chains problem. Probably removing some components would not be needed if application layer will be moved to a shard further.",
        "created_at": "2021-03-20T09:58:54.776000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I would add to the list of things that I would hate to not come with the merge being validator withdrawals, depending on the actual implementation of the merge that it's used. If we need to have current eth1 to attest on, instead of just proposing, I'd want to see serious testnets with current validating hardware. I suspect it will be carnage on many current validators and without a proper exit+cashing out mechanism it's just bad PR.  If current eth1 data is only needed to propose a block then that's not a serious blow to validators and they can still be profitable without a local  eth1 node.",
        "created_at": "2021-03-20T10:36:18.641000+00:00",
        "attachments": null
    },
    {
        "author": "chat-bridge",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cadietrichs\u003e As one of the co-authors of 3074: If the EIP does not make it into London (I have some hope left!), I would still very much prefer a focus on the merge post-London, even if it means the next chance for 3074 might be 18 months out. I just don’t think it or any of the other EIPs discussed for after London are important enough to justify a multi-month merge delay. (re @ef_general_chat_bridge_bot: \u003cMicah\u003e Things like 3074 have potential to *greatly* improve the UX for real users today, and waiting until 2022 or 2023 before that gets included sits very poorly with me.)",
        "created_at": "2021-03-20T10:42:42.787000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "but I understand that withdrawals  touches the EVM and most probably will not happen at all with the merge... still, enough notice to validators to upgrade their hardward should be noticed in case it's needed",
        "created_at": "2021-03-20T10:43:23.164000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "agreed, the least i would love to see are withdrawls. Otherwise it will be a UX nightmare 😦",
        "created_at": "2021-03-20T10:43:46.845000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I would like to see withdrawals as soon as practicable, but I don't see how it would happen with the initial merge.  There are significant additional requirements.  I also wouldn't want to see the move to PoS held up by requiring withdrawals because of the lack of withdrawals, it could put a delivery date back many months if not years.\n\nI think that an alternative approach, some combination of transfer between validators and ability to change the validator key, would be enough to provide liquidity where necessary without holding up consensus upgrade.",
        "created_at": "2021-03-20T10:53:47.077000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "And we are again on this fight, I'll certainly do my tiny bit to try to rally  small validators in against transfers before withdrawals are implemented 🙂",
        "created_at": "2021-03-20T10:55:20.343000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "or at the very least before a trustless pool announces a testnet that will allow existing validators to change ownership",
        "created_at": "2021-03-20T10:56:29.386000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Let's focus on the fact that liquidity is required, not the mechanism by which to do it.",
        "created_at": "2021-03-20T10:56:45+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "but without an exit path I feel is very unffair to have these changes",
        "created_at": "2021-03-20T10:56:47.868000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "For the record, I agree that upping the requirements for validators without giving them some sort of path to liquidity and to stop validating is important.",
        "created_at": "2021-03-20T10:57:18.532000+00:00",
        "attachments": null
    },
    {
        "author": "dkdkdkdkdkdk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "transfer between validators has the danger of creating a new currency parallel to ETH, which could make the full merge problematic if their market prices diverge significantly",
        "created_at": "2021-03-20T11:00:20.257000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I don't see that, it's all ETH",
        "created_at": "2021-03-20T11:02:14.499000+00:00",
        "attachments": null
    },
    {
        "author": "dkdkdkdkdkdk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "someone who wants ETH on eth1 won't buy validator balance, so there will have to be two markets",
        "created_at": "2021-03-20T11:05:18.604000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Right, adding withdrawals to the scope of the merge would make it more complicated and would delay both, PoS and withdrawals. Consensus upgrade is very complex by itself, it's already gonna be the biggest hard fork ever without putting any changes on top of it.",
        "created_at": "2021-03-20T11:20:26.358000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Opened a new PR with executable beacon chain stripped down to the quick merge proposal with the transition process onboard, https://github.com/ethereum/eth2.0-specs/pull/2257",
        "created_at": "2021-03-20T13:50:57.709000+00:00",
        "attachments": null
    },
    {
        "author": "chat-bridge",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cprotolambda\u003e https://www.youtube.com/watch?v=tL8l7GGCpw0 ethstaker is hosting a call about the merge",
        "created_at": "2021-03-20T14:01:06.297000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "thanks Proto!",
        "created_at": "2021-03-20T14:02:10.826000+00:00",
        "attachments": null
    },
    {
        "author": "imman6820",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Validators can still exit but not withdraw. The withdrawal feature would probably be in the first feature fork after the merge. Considering validators signed up under the assumption that withdrawals would be enabled after approx 2 yrs, I think it's fair if it happens within 1.5 yrs even if it's a few months after the merge.",
        "created_at": "2021-03-20T16:27:27.922000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think there's a big difference between having your funds locked for 2 years earning ETH and not being able to. And considering that raspberry pi instructions are still on the ethereum.org domain, it is at the very least misleading if a raspberri pi cannot handle the task. As I said above I also don't think there's a way out of this, but the situation is really unfortunate if indeed current hardware has to be upgraded or exit. The very least we should expect is clear guidance in this regard.",
        "created_at": "2021-03-20T17:56:31.603000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I would say it is too early to say that hardware upgrade is a must or is not a must for those who used to get eth1 data from Infura. But running an application node aside the beacon node _may_ become a requirement. For those who run own eth1 node today there hardware upgrade won't be needed",
        "created_at": "2021-03-20T18:24:14.465000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "My assumption is that Infura will receive all the blocks from the network very fast and will import them and verify the execution. It should be relatively easy for Infura to expose a method that would return `true/false` for already imported block; it could be done by exploiting `eth_getBlockByHash` at the moment but it doesn't allow to pass a block which would be needed if for some case the block hasn't been received by Infura before the request for validity.\n\nBlock production is more complicated. If a service will keep all the transaction fees then the proposer will be incentivised to propose an empty application payload rather than initiating a roundtrip with the service. Therefore, there is a need of the model which would allow to pay a portion of fees to the proposer.",
        "created_at": "2021-03-20T18:35:52.074000+00:00",
        "attachments": null
    },
    {
        "author": "ladidan",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "even if a raspberry pi/lower budget hw *could* handle validator duties in combination with a third party service at the merge, wouldn't it be more of a good advice to make stakers aware that -given the current eth-roadmap- at some point in the future a hardware upgrade is going to be necessary anyways - let's say at least because of DAS?",
        "created_at": "2021-03-20T18:59:02.628000+00:00",
        "attachments": null
    },
    {
        "author": "dkdkdkdkdkdk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "what's stopping a validator from skipping eth1 validation and assuming that whatever they see on the beacon chain is valid?",
        "created_at": "2021-03-20T19:08:26+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Nothing stops actually, except of being dishonest and relatively low penalties for attesting to an invalid block (if it appears to be invalid)",
        "created_at": "2021-03-20T19:27:10.699000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Being honest here has more strong incentive rather than just being good from moral standpoint. Each honest vote contributes to the security of the system and if verification of the execution will be rather cheap then it would probably be enough",
        "created_at": "2021-03-20T19:44:21.062000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "With current gas limits a raspberry pi today can handle both eth1 and eth2 at the same time",
        "created_at": "2021-03-20T19:44:41.553000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "What is the cost of running a raspberry pi including a disk require to handle eth1?",
        "created_at": "2021-03-20T19:45:26.514000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I know because I run one, it works well, I don't think merging the chain would take more resources",
        "created_at": "2021-03-20T19:45:37.944000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I don't remember exactly, but I would say around 200 EUR , Raspberry Pi 8gb and SSD",
        "created_at": "2021-03-20T19:46:10.015000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "200EUR is to buy it, right? and what are the operational expenses?",
        "created_at": "2021-03-20T19:47:47.765000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If we go beyond the merge then yes, DAS and proof of custody will increase the requirement to hardware but not sure that it will be a significant increase.",
        "created_at": "2021-03-20T19:48:33.130000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Ohh sorry, operational spenses in my case are almost zero, I use the same home internet that I use for everything else, and I didn't measured power consumption but it's around 4 watts peak, I imagine that's something like 3 EUR monthly",
        "created_at": "2021-03-20T19:58:57.677000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "it probably won't if there are finality issues",
        "created_at": "2021-03-20T20:00:20.118000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "we had this scenario a few months ago on testnets, it's a domino effect and will kick pi stakers out of the network one by one",
        "created_at": "2021-03-20T20:00:42.491000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "That's true, I doubt Pis are a big enough % of the network for it to snowball tho",
        "created_at": "2021-03-20T20:03:04.255000+00:00",
        "attachments": null
    },
    {
        "author": "zkfloof",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Why do they get pushed out so far? Can we not have them 3-6 months after the merge?",
        "created_at": "2021-03-20T20:58:42.520000+00:00",
        "attachments": null
    },
    {
        "author": "zkfloof",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "really hoping to see 3074 go in either before or immediately after the merge 🤞",
        "created_at": "2021-03-20T21:01:11.041000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "zk rollups don't depend on BLS; there's perfectly fine ones using the bn128 curve. The focus on adding BLS was originally because of the possibility that the ethpow chain would need to verify the beacon chain, but the merge makes that moot",
        "created_at": "2021-03-20T21:02:32.970000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think having a hard fork 3-6 months after the merge that includes both \"features\" and \"merge cleanup\" stuff (remove eth1 voting, add withdrawals...) is reasonable",
        "created_at": "2021-03-20T21:03:17.907000+00:00",
        "attachments": null
    },
    {
        "author": "chat-bridge",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e the resources for DAS and proof of custody are trivial. It's only bandwidth that increases (re @ef_general_chat_bridge_bot: \u003cMikhail Kalinin [mkalinin]\u003e If we go beyond the merge then yes, DAS and proof of custody will increase the requirement to hardware but not sure that it will be a significant increase.)",
        "created_at": "2021-03-20T22:26:33.768000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "You just posted a couple of days ago that you miss a couple of attestations every now and then, this does not count as running well, it happens to be profitable now.",
        "created_at": "2021-03-20T23:11:33.899000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I wander how many bad head votes you get per day on a pi",
        "created_at": "2021-03-20T23:12:05.791000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This has the same flavour as currently just proposing blocks with random Eth1 data: you may rarely lose the block rewards if there were deposits to include (which is a negligible proportion of blocks since genesis even with a queue) and saving the cost of disk and not having geth becomes more profitable. Even though I am raising the point that it's worrisome to have lower grade hardware at risk of not being able to validate properly, I think this kind of loopholes should be closed somehow.",
        "created_at": "2021-03-20T23:18:06.064000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I did some tests and that was because of my internet connection, the ethereumonarm guys have been running one flawless",
        "created_at": "2021-03-20T23:19:23.485000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I don't think it is *realistic* just due to engineering availability constraints at the moment.",
        "created_at": "2021-03-20T23:25:22.481000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Just pragmatic estimates based on historic velocity of application clients.",
        "created_at": "2021-03-20T23:25:38.859000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "we'll see how berlin-then-london-in-3-months goes",
        "created_at": "2021-03-20T23:26:03.661000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "So after the merge how does one become a validator? Deposits are to the same contract but how do they get onboard without eth1 data voting?",
        "created_at": "2021-03-20T23:48:53.575000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Oh, when we remove eth1 data voting, the beacon chain will just be aware of the application block hash directly",
        "created_at": "2021-03-20T23:49:26.335000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "So on each block proposal validators will be automatically added to the queue? Right, thanks",
        "created_at": "2021-03-20T23:50:17.520000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "right",
        "created_at": "2021-03-20T23:51:14.811000+00:00",
        "attachments": null
    }
]