[
    {
        "author": "chaserxy",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "someone correct me if I'm wrong, but AFAIK the block gas limit exists at the current level primarily to prevent state bloat (https://twitter.com/peter_szilagyi/status/1358663676052520963); and secondarily to keep the uncle rate low (securing liveness). in short, Ethereum's scaling is limited by the effort to keep it sustainable and live. neither eip-1559, not the merge with PoS offer anything that improves on the first, greater problem. (I intuit that the  second problem will be made somewhat better with PoS.)\n\nactually \u003c@!206016661470314496\u003e if you see this, I'd be thankful for a confirmation, because up until recently I totally conflated this bottleneck with the one imposed by random read/write speeds and the used database structure.",
        "created_at": "2021-02-11T02:02:11.341000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The root of the problem with \"state bloat\" is that we want Ethereum to run on the lowest spec hardware possible.  As state grows, the hardware requirements increase, particularly disk drive requirements.",
        "created_at": "2021-02-11T03:05:07.288000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It is a bit more complex than just \"bigger drive required\" because it also needs to be able to keep up with the random IOPS over all of that data.",
        "created_at": "2021-02-11T03:05:33.327000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Note, if part of your attestation is for shard data, you risk getting the custody bit incorrect and getting slased if you just follow the leader",
        "created_at": "2021-02-11T13:16:05.126000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'd highly recommend eth2 clients move to a place where they can *broadcast* at nearly the start of the slot rather than starting work at the start of the slot to shave down this propogation time",
        "created_at": "2021-02-11T13:18:11.124000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Isn't it a reduction of valuable part of a slot and if we think to do something like isn't it a signal for increasing the number of seconds per slot?",
        "created_at": "2021-02-11T13:23:15.799000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Do you mean produce the block just before the start of the slot and then broadcast right at the start?",
        "created_at": "2021-02-11T20:25:25.216000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I suppose there is a  trade-off here. You don't want to do work early at the expense of including good aggregates, but there might be ways to pre-compute some things before the the start of the slot and maybe as values come in and then just compute root/signature right at the 0 mark.\n\ne.g. pre-compute epoch transition\ne.g. form a block and continually add/transition new aggreagtes as they come in \u003c--- might be possible/valuable. worth considering at least",
        "created_at": "2021-02-11T22:36:38.683000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Some clients do this already",
        "created_at": "2021-02-11T22:37:16.128000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "These are precomputes of epoch transitions and caches of states etc",
        "created_at": "2021-02-11T22:37:44.168000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yep makes sense.  Based on the experience of blocks coming late and the work I did looking at how to fix that, I suspect the general approach of \"keep a block nearly ready\" is going to be an important tool.  Lighthouse and Teku both precompute the epoch now and it helps a lot (both in slightly different ways with slightly different misprediction conditions).  But I don't know of any client that tries to select attestations ahead of time (not sure how long that takes in practice either).",
        "created_at": "2021-02-11T22:38:58.051000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I strongly suspect that Eth1 blocks will be created ahead of time and transactions that arrive just before the end of the slot just wind up being left until the next block.",
        "created_at": "2021-02-11T22:39:47.046000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "which is reasonable and likely happens in mining",
        "created_at": "2021-02-11T22:40:15.805000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "there is compute time in recomputing a block even if more valuable than what you have",
        "created_at": "2021-02-11T22:40:30.352000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "from what I understand, btc miners sometimes send out 0 tx blocks because they start mining an empty block *immediately* when they see the new block while they start building a block with TXs in parallel",
        "created_at": "2021-02-11T22:41:17.812000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yeah absolutely, it's essentially the equivalent of miners starting to mine an empty block and then switching to one with transactions (and possibly then one with better transactions if new ones are received).  They then just publish whatever they happen to find the solution for.",
        "created_at": "2021-02-11T22:41:23.353000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "lol",
        "created_at": "2021-02-11T22:41:29.697000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "yep",
        "created_at": "2021-02-11T22:41:30.995000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "In general I think there's huge value is being able to be more flexible about the timing of things.  If you do exactly what the spec says you wind up exceptionally busy 0, 4 and 8 seconds into a slot (approx) and fairly idle most of the rest of the time.  So precomputing in those quieter/less critical times is a surprisingly simple and effective approach.",
        "created_at": "2021-02-11T22:43:43.850000+00:00",
        "attachments": null
    }
]