[
    {
        "author": "keenwau",
        "category": "general",
        "parent": "",
        "content": "Yea I didnt mean to venture off topic I just saw your post and it made me think. I agree with all of that completely 😄 I am just super curious how the 32 ETH thing is going to play out next year since I dont know a single person who could afford it or would invest even if they could. It seems like an elephant in the room to me but maybe I just dont know the right people lol. Even pools making it 16 ETH is still pretty unpallatable",
        "created_at": "2021-12-13T00:01:28.040000+00:00",
        "attachments": null
    },
    {
        "author": ".someoneanonymous",
        "category": "general",
        "parent": "",
        "content": "We always have services like RocketPool for staking at a lower cost (you can use this for pooling funds as well). The market can also build more abstractions to make it cheaper. \n\nStaking is an overloaded term since people call “delegating” in a DPoS network “staking” even though the delegated may not be doing any work to secure the network, and may not even have their funds at risk. \n\nI do believe that, in most cases, groups would have an easier time looking funds than running a high-cost machine in a cloud or data center. You can imagine a small town pooling funds to run a validator even with an understaffed town IT department, and they’d both help secure the network as well as make money for the town itself. I think we currently imagine that validator == individual, but IMO, large groups are far more likely over the long run.",
        "created_at": "2021-12-13T00:07:03.499000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "general",
        "parent": "",
        "content": "I am reading spec and cant find how exactly is execution side receiving new block from consensus side. Is there some consensus side API that execution side need to call?",
        "created_at": "2021-12-13T10:44:38.823000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "The opposite, consensus layer client drives the communication, and it sends the payload to execution layer client via Engine API. See the spec here https://github.com/ethereum/execution-apis/blob/main/src/engine/specification.md",
        "created_at": "2021-12-13T10:47:09.920000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "general",
        "parent": "",
        "content": "then `engine_executePayloadV1` is the one used to import block generated from other clients?",
        "created_at": "2021-12-13T10:48:18.719000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Right, this is the one",
        "created_at": "2021-12-13T10:48:39.448000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "general",
        "parent": "",
        "content": "nice, thank you",
        "created_at": "2021-12-13T10:49:00.913000+00:00",
        "attachments": null
    }
]