[
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Anyone can compute the randao of head block and timestamp of next block.  Only the proposer (and people they share that knowledge with) knows what fee recipient the proposer wants to set on the block.",
        "created_at": "2021-09-15T04:53:10.700000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The block proposer would know the coinbase at essentially the same time as they could know the head block that will be used as parent though.\nIs the point here that people submitting transactions to the block proposer also need to know the coinbase and thus need it before the parent block is known? I'm not sure how that fits with the idea of eliminating things that could be path dependent though.",
        "created_at": "2021-09-15T04:56:48.668000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Can you clarify which proposal you are questioning (there are a few floating around now)?",
        "created_at": "2021-09-15T04:58:07.829000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Are you wanting to remove the `suggestedFeeRecipient` from the `preparePayload` and `getPayload` methods entirely?",
        "created_at": "2021-09-15T04:58:33.841000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm just trying to understand the screen shotted message above and why knowing the coinbase ahead of time is important so builders know all elements that can affect EVM execution paths ahead of time.",
        "created_at": "2021-09-15T05:00:45.263000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "What is important to builders is being able to construct a block without being in direct contact with the proposer in advance.",
        "created_at": "2021-09-15T05:01:16.461000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\"Construct a block\" here means select transactions and generate state root, receipts root, and transaction root.",
        "created_at": "2021-09-15T05:02:28.719000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Right so they'd only be able to do that once the parent block is known.",
        "created_at": "2021-09-15T05:05:30.402000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yes, that is fine.  The problem is that the `suggestedFeeRecipient` (aka: coinbase) is a \"personal choice\" of the block proposer for a block, and we don't currently have a system in place for broadcasting that globally over a peer to peer network in advance of the proposer proposing a block.",
        "created_at": "2021-09-15T05:08:08.171000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Ultimately, I'm a fan of the block builder (execution client initially) being in full control over the block contents.  We are assuming that there is a trusted relationship between the consensus client and execution client, so I think this is fine from a security standpoint.  I think the system would function fine without the `suggestedFeeRecipient` parameter at all if you accept this trust model and separation of ownership.\n\nHowever, some people have proposed novel architectures where the consensus client has additional information not available to the execution client at time of block building (such as who the fee recipient should be), so adding a `suggestedFeeRecipient` to the API is a simple way to enable these designs.  By making it just a suggestion rather than a requirement, we still retain the mental/architectural model where the block builder (execution client) is ultimately in charge of the block contents.",
        "created_at": "2021-09-15T05:14:51.421000+00:00",
        "attachments": null
    },
    {
        "author": "holgerd77",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e Client teams (both Eth1 and Eth2) are all now working on implementing the latest specs in preparation for devnets in October.\n\nJust discovered this in the \"What's new in Eth 2\" newsletter from Ben Edgington in the context of the Merge. Is this accurate respectively can someone point me to where to find some more information on this (so: the `devnets` part)?\n\nI am bit puzzled since I am reading here relatively closely and never found a word on this timeline. Is there another Merge-(testnet) related channel on this Discord that I am missing? 🤔",
        "created_at": "2021-09-15T08:21:39.320000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Someone should contact Ben Edgington and ask them to rename that from `Eth 2` to something more accurate.  And also to refer to \"Execution Engine and Consensus Engine client teams\" not \"Eth1 and Eth2 client teams\".",
        "created_at": "2021-09-15T08:35:41.446000+00:00",
        "attachments": null
    },
    {
        "author": "_tachyonic",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I believe that he has publicly expressed some mild resistance to the proposed change, and is steaming ahead with the old terminology. 😋",
        "created_at": "2021-09-15T09:13:11.144000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Did they indicate why they hate goodness in the world and desire to spread ignorance and set people up to be scammed?",
        "created_at": "2021-09-15T09:27:11.510000+00:00",
        "attachments": null
    },
    {
        "author": "_tachyonic",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I believe it was more because the title of their blogpost rhymed under the old scheme.",
        "created_at": "2021-09-15T09:31:43.659000+00:00",
        "attachments": null
    },
    {
        "author": "holgerd77",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Just a humble reminder that there was a question included in the post above. 😋 Anyone has got some insights on this?",
        "created_at": "2021-09-15T09:32:03.882000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "My guess is that it came up in the consensus client bi-weekly video meeting.  They are published to YouTube I think, and I think agenda and minutes are posted somewhere?",
        "created_at": "2021-09-15T09:37:43.169000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There is no second merge related channel that I'm aware of.\nWe talked quite a bit about the merge spec during the last calls and it seems to solidify so it makes sense to create testnets soonish",
        "created_at": "2021-09-15T09:37:51.545000+00:00",
        "attachments": null
    },
    {
        "author": "holgerd77",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!360491619402776577\u003e ah, thanks a lot. Then we'll try to prioritize our own implementation a bit more, we'll try to be joining with our EthereumJS client implementation (on the Eth1 side) (respectively - sorry - on the execution side of course 😛).",
        "created_at": "2021-09-15T10:06:29.004000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!425269142615097345\u003e yeah, there is no any other side channels. We're working hard to make specs for the Merge interop settled down by the end of this week/early next week. You may start looking into EIP-3675, and this section of the Engine API design doc https://hackmd.io/@n0ble/consensus_api_design_space#Minimal-set-of-methods. This section is gonna go to the interop spec soon plus some other stuff on top, but this is the most important one.",
        "created_at": "2021-09-15T12:33:12.875000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Once we have this work done it will be shared in this channel and cross-posted to the \u003c#745077610685661265\u003e",
        "created_at": "2021-09-15T12:34:37.282000+00:00",
        "attachments": null
    },
    {
        "author": "holgerd77",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@425572898787426305\u003e ok, cool, thanks 🙏, we have a substantial part of EIP-3675 already implemented.",
        "created_at": "2021-09-15T12:40:51.853000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It sounds great! 👍",
        "created_at": "2021-09-15T12:41:07.334000+00:00",
        "attachments": null
    }
]