[
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "good questions, this is still a concept and the work on JSON-RPC spec hasn't yet started. \n\nIMO, `eth_getByNumber(finalized)` should return nothing before the merge, i.e. the same as a request block by hash if a block doesn't exist. `eth_subscribe(newHeads)` -- tricky one, and it's even not in the standard list of calls, probably `newSafeHeads` and `newHeads` pointing to `unsafe` heads? Or `newHeads` and `newUnsafeHeads` depending on what is the general use case for this subscription is",
        "created_at": "2021-12-06T10:30:19.391000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "There is no such a resource. I would say that primary risk is potential instability around the Merge. Once the Merge date becomes known we enter an unstable period of time from game theory point of view as miners might want to attack the network, because there is nothing else to do seeing that your hardware will be bricked pretty much soon. Though, the attacking scenario is unlikely to happen the risk of it still exists. The other risk is software/design bugs which is usual for every network upgrade, though, the Merge is more complicated one hence this risk is bigger. A lot of testing of different system properties and on all levels should make this risk negligible",
        "created_at": "2021-12-06T10:39:40.967000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "Hey all, so I stumbled today a bit about the message ordering requirement in the engine api spec. I think doing it the way it is specified is not great. If we use the JSON-RPC message id for a strict ordering, we introduce a lot of statefulness into our API. This is especially bad for things like proxies, starting and stoping an EL or CL etc. From what I understand, this idea is to prevent `forkChoiceUpdated` messages from racing with each other. I think a simpler way to achieve this, is to require the CL's to always wait for the result of a `forkChoiceUpdated` message (or a timeout) before sending a new one and adding a lock to the `fCU` method in the Execution layer which would prevent multiple threads from calling it simultaneously. Additionally, since we use ready-made frameworks for our JSON-RPC methods, enforcing this ordering would be incredibly difficult to implement as it cuts through different layers (JSON-handling, engine api). Wdyt? (cc \u003c@!758579010027782144\u003e \u003c@!194432762315407360\u003e \u003c@!425572898787426305\u003e )",
        "created_at": "2021-12-06T16:00:44.503000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "Let me add to that: waiting for the result of one call before sending the next can be achieved even in asynchronous/event-driven implementations.",
        "created_at": "2021-12-06T16:07:46.662000+00:00",
        "attachments": null
    },
    {
        "author": "hsiaowei",
        "category": "general",
        "parent": "",
        "content": "CL HF2 naming updates: ECH kindly offers help with https://github.com/ethereum/pm/issues/430 program 🌟\n\nWe are considering about using the POAP vote again since (i) it was fun and (ii) we had some experience with it.\n\nAny thought or objection? Feel free to DM \u003c@!642887713246150666\u003e or me. 🙏",
        "created_at": "2021-12-06T17:48:11.362000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "My preference would be for the existing `newHeads` subscription type to track safe heads and a new `eth_subscribe(unsafeHeads)` to be added.  My rationale is that users will have subscriptions running across the TTD so existing subscription types should probably track the preferred behavior.  For example we use newHead subscriptions ourselves to drive several internal systems, as well as offering it to end users.",
        "created_at": "2021-12-06T17:54:20.929000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "I think an additional risk is that that a large portion of validators don't realize they need a synced mainnet EL until too late to actually get synced before the merge happens, which is another advantage of having some sort of \"heartbeat\" happening over the engine API layer before the merge happens.",
        "created_at": "2021-12-06T17:58:26.797000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "If the id-based ordering ends up being a hard requirement my suggestion would be to add a sequential id to the `params` rather than rely on the JSONRPC ID.",
        "created_at": "2021-12-06T17:59:47.227000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "Yeah, relying on JSON-RPC ID is absolutely not a good idea.",
        "created_at": "2021-12-06T18:02:21.858000+00:00",
        "attachments": null
    },
    {
        "author": "galaxybloom.",
        "category": "general",
        "parent": "",
        "content": "Has the latest Merge call been uploaded to YouTube \u003c@552133098075193354\u003e ? I can’t seem to find it.",
        "created_at": "2021-12-06T23:25:10.830000+00:00",
        "attachments": null
    }
]