[
    {
        "author": "chat-bridge",
        "category": "general",
        "parent": "",
        "content": "\u003cSouptacular\u003e The bridge between the merge channel in the Eth R\u0026D Discord and the Eth1-Eth2 merger Telegram channel is set-up! Enjoy :)",
        "created_at": "2021-02-22T06:53:32.903000+00:00",
        "attachments": null
    },
    {
        "author": "chat-bridge",
        "category": "general",
        "parent": "",
        "content": "\u003cn0ble\u003e cool cool!",
        "created_at": "2021-02-22T07:25:44.687000+00:00",
        "attachments": null
    },
    {
        "author": "gballet",
        "category": "general",
        "parent": "",
        "content": "\u003e is this possible for the current catalyst version to find the hash of a block given the state root? If that is then we can get rid of eth1 block hashes in executable data by passing the previous state root to insertBlock and produceBlock instead of parent block hashes\n\n\u003c@!425572898787426305\u003e that's not currently possible, and there is a problem with that approach: at least in Clique, the same state root can be found in several blocks.",
        "created_at": "2021-02-22T13:09:50.083000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "One consideration for not breaking randomness is that random games are often (definitely more often than the average dapp) played in non-English-speaking communities, and so we run a higher risk of accidentally rug-pulling people who don't even have a chance to read the merge discussions (and regardless of what we think of those dapps, them being attacked is worse for users than them not being attacked)",
        "created_at": "2021-02-22T22:28:39.416000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "So given that we have to wreck the block hash structure regardless (SSZ, hexary tree -\u003e binary or verkle, changed params) it does seem total-risk-minimizing to repurpose BLOCKHASH to RANDAO",
        "created_at": "2021-02-22T22:29:29.848000+00:00",
        "attachments": null
    }
]