[
    {
        "author": "undying1200",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "All my models that were developed based on 2016-2020 EIP progress VS roadmap still show 2023 will be the earliest ETH 1.5 deployment, aka The Merge. There are also algos that suggest  models will expand exponentially if merge dates move forward. This implies exponential future models of ETH which also justify hardware deployment within 30 days of the actual merge😆",
        "created_at": "2021-04-06T06:32:06.107000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The challenge with modeling humans is that there are so many inputs that the problem ends up being chaotic (effectively).",
        "created_at": "2021-04-06T06:33:21.710000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I agree these challenges of chaos are not for mere mortals. But it does in fact explain the infusion of massive hardware amounts in conjunction with massive Fiat moving into ETH. All models, until proven invalid, suggest maximizing investments if resources are available.",
        "created_at": "2021-04-06T06:35:52.416000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There is an actual shortage right now in Tether products preventing the true value of ETH to be realized in the market. The issue is there is not enough supply of leveraged Fiat to accommodate current demand. Because of this there are other avenues to aquire ETH that are being implemented through mining.\n\nMoving to POS removes this acquisition channel and does not provide a likewise method to increase exposure when all other methods have been exhausted. To those that do not understand the dynamics of POW mining and the leverage it provides in acquiring grade A crypto assets might assume the move by HUT 8 is irrational, but I do argue it is quite rational indeed.",
        "created_at": "2021-04-06T06:42:45.970000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Imagine if you will what would happen to gold if you created a world wide ban on mining. It is pretty simple and I don't need to explain this further. Likewise you would expect mining operations to begin shutting down and the expansion of mining to halt as this is typically a multi year process. However if it only took 30 days to add additional mining capacity (not typically true for gold mining) how many miners would continue adding capacity up until the ban occurred?\n\nI think this is a good analogy in understanding what is happening and will happen to Ethereum mining going into the merge. As the last of the mineable gold (Ethereum) is acquired, the new Ethereum created post merge will be a small fraction of what was possible pre merge. So to some the addition of hardware in this late stage might seem short sighted, but to others, it is the last chance to obtain what will not be so easily obtainable in the future.",
        "created_at": "2021-04-06T07:03:27.525000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "We expect ETH2.0 APR to hit equilibrium from 3.5-8% based on 80 years of US Tbills prior to Fed money printing, the separation of USD from gold, and the exponential growth of the US military using USD printing (began with the cold war in early 80s). Even at the highest of 8% APR, mining ROI is still higher even at 30 days prior to merge!!!",
        "created_at": "2021-04-06T07:17:53.506000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "unknown.png",
                "content": "812021f26c3a6eeab7b33d9b120b93f8206e0967d789eb02c26c7bb6d237e5ca"
            }
        ]
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@405499552838189056\u003e This isn't the right channel or server for ETH price speculation, or even hashpower speculation.",
        "created_at": "2021-04-06T07:21:33.394000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Agreed, I will remove those... edit done. Also this post seems to revole around the metrics you suggested are speculative. As I was only respondong to the context of the OP I have quoted below.\n\n_I am confused. Why did they do this if soon much of the GPU mining hardware will be useless and sold? thinking_\n\nIs this not speculative??? I could elaborate on RVN who respects miners and how that hardware will find a permanent home there. But lets discuss why this post is not speculative. Waiting for your rebuttal.",
        "created_at": "2021-04-06T07:24:18.094000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This isn't the right channel or server for ETH price speculation.",
        "created_at": "2021-04-06T08:21:15.207000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "What data backs up this claim? Would shard chains improve block capacity if we followed the original roadmap? Or are shard chains just a dream?",
        "created_at": "2021-04-06T08:28:40.047000+00:00",
        "attachments": [
            {
                "type": "image/jpeg",
                "origin_name": "Screenshot_20210406-022533_Brave.jpg",
                "content": "041a22a7d2450e935c5f90292d701bcd0f3944f7f8ecc8fe1d0889c4d7e52c98"
            }
        ]
    }
]