[
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Everything that is required from eth1 including deposits can be obtained from Infura, this is the solution for today. Am I getting this right?",
        "created_at": "2021-03-22T08:41:28.142000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There will be a reduction of `Eth1Data` follow distance to `1` meaning that deposits from the previous block can be processed in the current one. We would like to keep `Eth1Data` and current depositing mechanism to keep the ability of decoupling execution from the beacon chain. It could be a further requirement if we decide to move the execution to a shard.",
        "created_at": "2021-03-22T08:43:58.863000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Will it be possible to work on upgrades of consensus and application layers independently after the merge? Is this your question?",
        "created_at": "2021-03-22T09:01:04.567000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yes",
        "created_at": "2021-03-22T09:03:20.971000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This is a good one. Because, previously there were no major upgrades on the consensus layer, difficulty bomb and issuance reduction are pretty small changes which were bundled with the application layer changes. But after the merge we expect cleanups, validator withdrawals, shards which makes it difficult to release applicaiton layer upgrades at the same time.\n\nConsensus and application upgrades could be worked out in parallel but tested and shipped sequentially which would allow to reduce the time between network upgrades. It depends on clients and client teams diversity. The process of upgrades should settle down once major consensus changes are shipped.",
        "created_at": "2021-03-22T09:15:06.529000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Thank you, Mikhail",
        "created_at": "2021-03-22T09:22:55.768000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "What I meant is that currently is you run without any eth1 endpoint at all, it's more profitable than running with a local one. Eth1 data is needed only for blocks that need to include new deposits. Which very rarely happens. So running without any endpoint and just voting for random eth1 hashes chances are that you will never lose even a block proposal. Seemed to me that the situation with attesting everything we see as valid after the merge is a similar situation",
        "created_at": "2021-03-22T09:28:21.599000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Gotcha",
        "created_at": "2021-03-22T09:46:25.611000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I guess that the second part of my question, \u003c@425572898787426305\u003e, is: can eth1 clients be broken down into smaller lego blocks (at the spec level) so that those  smaller blocks can be worked on and upgraded in parallel?",
        "created_at": "2021-03-22T11:43:45.798000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If they could but testing including testnets and releases schedule will be a bottleneck anyway. Not sure about breaking down application clients (eth1 clients) into several components. I don't think the merge changes anything regarding that part of client development",
        "created_at": "2021-03-22T11:50:26.513000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "On the process of the merge , are there any active plans to enable validator withdrawals post-merge ?",
        "created_at": "2021-03-22T12:05:31.710000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Understood\nThank you",
        "created_at": "2021-03-22T12:52:34.261000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yes, the plan is to make the pure consensus upgrade first and do cleanups and withdrawals after that (and new EVM opcode as well)",
        "created_at": "2021-03-22T13:08:29.015000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Is it possible to allow validators to be able to properly withdraw their balance as soon as the upgrade from POW to POS happens ? It would be wierd to have the security of the system reliant on validators who are locked in with no ability to exit and access their eth.",
        "created_at": "2021-03-22T13:15:47.315000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It is possible to add withdrawals to the feature set of the merge. But we would like to avoid extra complexity for already complex consensus upgrade because it potentially delays the merge in time which results in delaying two (in our case) features, PoS and withdrawals. Also, with PoS validator will be able to propose application blocks/payloads and get transaction fees via `coinbase`.",
        "created_at": "2021-03-22T14:07:49.920000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "How would the validator be credited via `coinbase` , if it only has exposed its BLS public key ?",
        "created_at": "2021-03-22T15:48:45.436000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Validators will be able to produce application payloads / blocks and pass eth1-styled address that they own to the `coinbase` of this block. Thus, with a pure consensus upgrade validators get the possibility to be instantly paid on the application layer",
        "created_at": "2021-03-22T15:53:12.432000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "question (and this might be more post-merge).. but when withdrawals are possible, is it contemplated to allow a withdrawal of the amount \u003e32ETH (e.g. taxable portion) but without having to exit the entire validator (and get at the back of the line).. fwiw, the above is highly desireable.. especially if the queue to be a new validator gets REALLY long...",
        "created_at": "2021-03-22T16:17:58.037000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Something like this is very much needed to avoid validator churn.  I proposed a pure beacon chain version of this, which would be one way of doing it.  If you want to send it to an ETH1 address it won't turn up before withdrawals.",
        "created_at": "2021-03-22T16:31:30.014000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I am less concerned about the period of time between the consensus upgrade and the withdrawal window.. than I am about the raw ability to allow for profit withdrawal in general... I do agree it is very important RE validator churn...  while the system is setup to ensure honest conduct, one of the best ways to determine if someone is an honest participant is to look at their history... and having validators go in and out, we lose that information... (granted not much you can do w/ that info).",
        "created_at": "2021-03-22T16:34:32.358000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Alright thanks, so I am guessing in this case, this will be a requirement for all validators to provide an eth1 address post-merge",
        "created_at": "2021-03-22T16:55:33.560000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "As the validators will be creating an ETH1 block I don't think they need to supply it to the beacon chain, just incorporate it as part of the block.",
        "created_at": "2021-03-22T16:59:37.127000+00:00",
        "attachments": null
    },
    {
        "author": "chat-bridge",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdannyryan\u003e I like the proposer withdrawal method \u003c@144468805697929216\u003e proposed a while back. Where you can withdraw any balance excess of 32 at point of proposal. Keeps it simple and hte load bound and each validator gets a regular interval at which they get to pull off rewards",
        "created_at": "2021-03-22T17:01:57.449000+00:00",
        "attachments": null
    },
    {
        "author": "chat-bridge",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdannyryan\u003e need to get the withdrawal mechanism in place first to better understand load and complexity first. it would likely be a receipt tree so this method would add ~32 receipts per epoch",
        "created_at": "2021-03-22T17:02:58.867000+00:00",
        "attachments": null
    },
    {
        "author": "chat-bridge",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdannyryan\u003e but would reduce validatorset churn so likely a pretty major win",
        "created_at": "2021-03-22T17:03:08.849000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think we may be able to pull this off because (1) Berlin was \"done\" a long time ago and we were super slow in rolling it out, (2) the Berlin features were relatively easy to implement and (3) for London, 1/2 the client teams have a prototype of 1559 and we've been working on it for ~1 y. \n\nI think perhaps before deciding \"Shanghai vs the merge\", having an intermediate goal of \"most client teams have a prototype\" can be good.",
        "created_at": "2021-03-22T17:22:20.392000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Allowing validators to withdraw excess and not the 32 helps avoid market oversupply too. Now that ETH prices are much higher than when staking started a sudden supply may hit prices hard. I suspect many would selloff their eth fast before any planned full withdrawal because it'll be turbulent. Even in the future when full withdrawals are allowed I'd suggest a staggered withdrawal. Or perhaps offer extra incentives to keep your eth staked long-term.",
        "created_at": "2021-03-22T17:38:24.825000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "As Jim mentioned above, validators won't need to submit this address. The logic around `coinbase` will be pretty much the same as it is today.",
        "created_at": "2021-03-22T17:48:37.094000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There is already an exit churn on the beacon chain which prevents immediate mass exits. Potentially, it limits withdrawals too",
        "created_at": "2021-03-22T17:50:54.961000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "as long as there aren't a ton of pre-exits, it would functionality limit withdrawals but I don't expect the queue to be directly applied to withdrawas",
        "created_at": "2021-03-22T17:51:36.081000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I proposed a while back a mechanism to directly credit all rewards of validators to another address, this is very simple to implement and it shouldn't add transactions. Just simply add a recipient field to the validator structure that defaults to itself but that may be changed with the withdrawal key to another address. And then just send all rewards as today, to the recipient instead of the validator address.",
        "created_at": "2021-03-22T20:08:27.717000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Also this way you do not need to wait to propose a block which can be weeks or months for single validators",
        "created_at": "2021-03-22T20:09:09.698000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I myself considered many times exiting my validator as soon as any withdrawal method is posted in the dev branch. I suspect there'll be plenty thinking like this",
        "created_at": "2021-03-22T20:11:49.979000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I suspect many will exit and sell ASAP to stable coins to wait out any sell off. It’s what I would do",
        "created_at": "2021-03-22T20:23:15.625000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "You mean to allow an accumulator/auto-withdraw address that is an eth1 address, or a bls staking pubkey (/validator index)?",
        "created_at": "2021-03-22T20:35:19.959000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I was thinking on bls key at the time.",
        "created_at": "2021-03-22T20:36:20.410000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "That's minimal change, still need withdrawals to actually take that out, but it's the same as in Jim's case",
        "created_at": "2021-03-22T20:36:55.464000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The thing is that it doesn't generate transactions",
        "created_at": "2021-03-22T20:37:51.426000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "No, but we don't want any DDoS either. So I assume that only the proposer of a block can change its withdrawal address at that time?",
        "created_at": "2021-03-22T20:38:47.245000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It causes other concerns as slowly drifting with penalties for example that may require a top up every now and then",
        "created_at": "2021-03-22T20:39:31.171000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The increasing of balance is \"just\" a map of pubkey -\u003e pubkey indeed, so that _should_ be rather fast",
        "created_at": "2021-03-22T20:39:37.214000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The message would be just like an exit message, so the risk of a ddos is the same, and also in Jim's approach you need to set the address by a signed message",
        "created_at": "2021-03-22T20:40:50.085000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "But an exit message you can send only once",
        "created_at": "2021-03-22T20:41:06.181000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "But the point is that any approach will need you to set the recipient address anyway",
        "created_at": "2021-03-22T20:41:29.763000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\"Set my withdrawal address to x\", \"now set it to y\", \"now set it to x again\", \"and now y again please\". Limiting the change of this field to proposals (and possibly exit messages) limits the processing load. But I feel this has probably come up at least once on ethresear.ch in the discussion of the 0x01 format",
        "created_at": "2021-03-22T20:41:31.206000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "yeah there are a bunch of places where the same phenomenon happens. I apologize didn't want to pollute this channel, this fits more in \u003c#748530848470663208\u003e",
        "created_at": "2021-03-22T20:47:52.167000+00:00",
        "attachments": null
    }
]