[
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Q for the EL devs: If the user is starting a new CL \u0026 EL pair, and (perhaps inadvisably) the CL is syncing from genesis or even just a really old checkpoint state - the EL will essentially get a stream of forkChoiceUpdated messages.  Does the EL wind up downloading the world state for a very early block and then doing a full sync from there, or is there some logic that lets the EL realise the beacon node is rapidly importing blocks and so it's probably worth waiting to find a later head before starting to download the world state?\nOr does the EL just keep starting then effectively abandoning world state downloads because the target block keeps moving forward (in fast sync terms it's very rapidly switching pivot blocks)?",
        "created_at": "2021-12-09T00:56:56.783000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "It's probably not the end of the world if the EL essentially winds up doing a full sync from the checkpoint state onwards as users really shouldn't be starting from really old checkpoints, just interested in what does wind up happening.",
        "created_at": "2021-12-09T00:58:01.723000+00:00",
        "attachments": null
    },
    {
        "author": "jmozah",
        "category": "general",
        "parent": "",
        "content": "\u003e \n\u003e  or is there some logic that lets the EL realise the beacon node is rapidly importing blocks and so it's probably worth waiting to find a later head before starting to download the world state?\n\u003e \nI think right now both EL and CL downloads all the blocks independently and CL blindly send all the blocks after merge to EL again.\ni am not sure of EL validates it again or just return the validated result.\nSomeone talked about this i the last call too.\nIt would be good to someone short circuit this and avoid sending EP through the EL API.",
        "created_at": "2021-12-09T04:22:55.745000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "The CL shouldn't need to resend all blocks to the EL.  That sounds like how things would work without optimistic sync which is basically doing a full sync and will wind up being too slow long term. I'm not sure any of the CL clients have optimistic sync fully complete, but Teku has the fork choice and block import part of it done (we just need to make sure every other part of the system can deal with having imported blocks without validating the payload safely now). We've had optimistic sync work with at least Teku + Geth so that we can start from an initial state post merge and the EL will sort out syncing itself.",
        "created_at": "2021-12-09T04:44:00.763000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "What I don't know is whether Geth (or any EL) winds up downloading the world state at the first forkChoiceUpdated it gets or whether its smart enough to figure out that's actually still a long way from chain head and that it would be wasting its time starting to download world state now.",
        "created_at": "2021-12-09T04:45:27.039000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "From my understanding EL will update the pivot block upon receiving more recent blocks from CL if the sync is in progress. Which means that if EL initial sync converges faster than CL's sync there will be a point at which EL stops pulling the state and switches to block execution.",
        "created_at": "2021-12-09T07:23:40.574000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "hello, is there any test vectors for engine_getBodiesV1",
        "created_at": "2021-12-09T17:40:08.743000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "I don't have it implemented yet, are we supposed to already?",
        "created_at": "2021-12-09T17:40:53.672000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "I don't think it's part of an official release yet?",
        "created_at": "2021-12-09T17:54:27.216000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "\u003e It's probably not the end of the world if the EL essentially winds up doing a full sync from the checkpoint state onwards as users really shouldn't be starting from really old checkpoints, just interested in what does wind up happening.\n\nI'm not terribly familiar with the beacon chain, especially when it comes to checkpoints, but are recent ones easily available over the network?  Or are they retrieved out of band from somewhere?",
        "created_at": "2021-12-09T22:08:25.713000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "They're retrieved out of band.  Currently the most common way to get them is to get the latest finalised state from Infura's eth2 api.  Ideally more places (e.g block explorers) would support retrieving these states too)",
        "created_at": "2021-12-09T22:13:35.574000+00:00",
        "attachments": null
    },
    {
        "author": "telepathicabilityperson",
        "category": "general",
        "parent": "",
        "content": "how does one become a core dev?",
        "created_at": "2021-12-09T22:30:48.408000+00:00",
        "attachments": null
    },
    {
        "author": "telepathicabilityperson",
        "category": "general",
        "parent": "",
        "content": "or what does one have to learn in order to do so",
        "created_at": "2021-12-09T22:30:59.429000+00:00",
        "attachments": null
    },
    {
        "author": "joshuaisbuilding",
        "category": "general",
        "parent": "",
        "content": "\u003c@!598299873158103071\u003e probably best having this conversation in \u003c#843176491386667018\u003e",
        "created_at": "2021-12-09T22:31:17.222000+00:00",
        "attachments": null
    },
    {
        "author": "telepathicabilityperson",
        "category": "general",
        "parent": "",
        "content": "sorry",
        "created_at": "2021-12-09T22:31:22.342000+00:00",
        "attachments": null
    },
    {
        "author": "joshuaisbuilding",
        "category": "general",
        "parent": "",
        "content": "no worries 🙂",
        "created_at": "2021-12-09T22:31:27.878000+00:00",
        "attachments": null
    }
]