[
    {
        "author": "Deleted User",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "What makes ethereum PoS different from other PoS on the market?",
        "created_at": "2021-12-12T05:44:45.450000+00:00",
        "attachments": null
    },
    {
        "author": "endprematureresolutions0974",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think the more appropriate question is: what do various PoS shitcoins bring to the table that Ethereum won't?",
        "created_at": "2021-12-12T12:35:11.500000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "that ethereum has a more vast ecosystem and demand for usage, for example it may not be too groundbreaking when compared to let's say cardano, but cardano does 90k txns per day while ethereum 1.2 millions",
        "created_at": "2021-12-12T22:02:08.804000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "so Ethereum going PoS will affect the cryptocurrency ecosystem more than other competitors",
        "created_at": "2021-12-12T22:05:48.482000+00:00",
        "attachments": null
    },
    {
        "author": "kedos25.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Other chains such as Cardano or Tron use dPoS. There are delegates which create pools for users to deposit their tokens. They are way less decentralized than real PoS chains. PoS chains such as Ethereum (after the merge), Solana and Avalanche uses PoS. However, requirements for validators on Solana/Avalanche are really high (hardware requirements and token requirements) so there are way less than on the Ethereum beaconchain. On the beaconchain are currently 268,675 active validators and the number is growing. The main difference between Ethereum PoS and other PoS chains are the lower requirements for running a validator, hence the decentralization is way better. There could be also differences in the PoS algorithm itself, but my technical understanding is not good enough to grasp them😅",
        "created_at": "2021-12-12T22:41:49.042000+00:00",
        "attachments": null
    },
    {
        "author": "keenwau",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Owning $80,000 in ETH is \"not a really high requirement\" to setup a validator? I dont know how the other chains work but that is a lot of dough to lock up!",
        "created_at": "2021-12-12T23:39:09.688000+00:00",
        "attachments": null
    },
    {
        "author": ".someoneanonymous",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I’m not sure if this thread is appropriate for the channel, but while $80k is a lot of money, a validator node can be run at home, which can’t be said for chains with high hardware/network requirements. With secret-shared-validators, you can get together with other people and collectively run a validator node to reduce the per-person cost. \n\nOf course, I believe we’re seeing a centralizing force in Eth staking as well since people use third parties to stake for them, but in the bright side, those third parties are slashable if they break the rules, which can’t be said about every PoS chain mentioned here.  Slashing may have an interesting effect on the idea of lending your ETH to third parties to stake if we ever have a major slashing event caused by a lack of client and host diversity. \n\nI think the exact parameters of PoS are less important than ensuring that the protocol punishes invalid behavior and that  everyone will be able to validate the chain post-merge (which is also what drives a lot of the Ethereum design and is ignored by many other chains).",
        "created_at": "2021-12-12T23:53:56.820000+00:00",
        "attachments": null
    }
]