[
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Could you please give more context on that? What is the desirable property of a system or approach you're looking for? Tx rewards will be toped up with the same coinbase mechanism as before the merge. The question is who sets the coinbase address for particular execution payload. And whom do we want to give an ability to set it. It could be set once at the launch of execution client and never changed after or it could be send by beacon chain client that is being produced a block each time it does it. The former doesn't require any additional work, the latter would require adding coinbase address to `assembleBlock` params which is doable.\n\nBut the latter would work well only in a trusted setup. Because execution client may set whatever address to the coinbase it would want to and beacon chain client have only one way to react, it either uses the payload with the coinbase address in it or falls back to an empty payload. Sharing fees between these two parties is more sophisticated but also doable, execution client may set coinbase to its own address and include transaction that transfers a portion of fees in a block -- the tricky part for a beacon client would be to verify this transfer.",
        "created_at": "2021-05-27T03:45:25.975000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "It'd be desirable for the beacon chain / consensus client to be able to signal this to the execution client on a block-per-block basis. I am thinking of infrastructure providers like Blox Staking. They run centralized execution clients and consensus clients, and their users run remote signers in their own AWS instances. They've expressed a desire to have a mapping of validator public key to desired `coinbase` payout address, which would be controlled by the user, and have the priority fees go directly to their user/customer on each block.",
        "created_at": "2021-05-27T06:57:09.498000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "They don't want to be custodians of that and then have to figure out how to split it up.",
        "created_at": "2021-05-27T06:58:01.952000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "That is a trusted setup in this case, as they control both the execution client and the consensus client.",
        "created_at": "2021-05-27T06:58:56.222000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Then they will have to store mapping of validator pub-key/index on addresses and have a kind of proxy that would pick the right address depending on proposer index/pub-key and send it to execution client on `assembleBlock` request. Or extend consensus API with a new method that matches validators onto coinbase addresses and patch their execution client's code.",
        "created_at": "2021-05-27T07:30:35.178000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "I we say that:\n- small stakers are good for decentralization\n- tx rewards can vary a lot from block to block (also, MEV stuff)\n- small stakers don't like unpredictable/random rewards (they prefer a more stable income)\n\nSo I'm a bit afraid that varying rewards will push new and existing small stakers to use more centralized solutions like staking pools instead, for the sake of predictable (or higher) income. I was hoping for a shade of gray where small stakers can still stake themselves, but can delegate and/or share block production/coinbase rewards somewhat trustlessly/decentralized.",
        "created_at": "2021-05-27T08:01:55.412000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "You mean that pool may offer tx fee shares independently on the number of produced blocks by each validator but on some different conditions, like on per ETH staked basis making tx fees income more stable hence more attractive for individual stakers?",
        "created_at": "2021-05-27T08:07:10.469000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "A system based on the number of block proposals would already be smoother than not pooling I think, but what you describe is even smoother (and therefore \"more attractive\") yes.",
        "created_at": "2021-05-27T08:10:36.635000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Individual stakers may propose on their own and grab transaction fees. What pool can done for them is to take a portion of fee for running the execution client for them which might be also appealing depending on how resourceful is to run own execution client",
        "created_at": "2021-05-27T08:18:05.177000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "That's why my question above: if the operator is willing to run on a pool, pools can enforce using of a coinbase to a contract that will later distribute ETH from tx fees to all operators.",
        "created_at": "2021-05-27T09:40:38.951000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Without staking on a pool I think delayed methods should be simple: you sign in a \"coimbase pool\" and set your coinbase to their contract. After n months that contact redistributes everything they got to their subscribers, checking that all their blocks were sent to the contract",
        "created_at": "2021-05-27T09:44:27.157000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "For the beacon chain we would have solo stakers, decentralized pooling like RocketPool, trustless SSV staking, and centralized staking (probably more shades).\nFor the exec layer we would have... Solo/individual nodes, and centralized pools (e.g. single geth node that everyone subscribes/listens to).",
        "created_at": "2021-05-27T09:45:08.954000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "Wouldn't you just be selfish, and if a 10 ETH tx reward block reward come along just take the lot (set coinbase to your own address)? Only if tx reward is about average (or lower than average) does it make sense to send it to the pool.",
        "created_at": "2021-05-27T09:46:21.665000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I suppose so, but if the n months is large enough to expect several blocks in that timeframe, the game for the single staker is more complicated",
        "created_at": "2021-05-27T09:47:43.691000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "Depends on the payout method as well I guess. If it's based on # proposals or ETH staked. Anyway, I'd rather have something that is _not_ susceptible to such selfish behavior (but still encourages people to run their own exec layer node).",
        "created_at": "2021-05-27T09:50:23.471000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "We're discussing this a lot in the rocketpool server as well",
        "created_at": "2021-05-27T09:51:04.125000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Apologies for the unrelated question: I see discussions that Ropstein and other testnets will be forked to accept 1559 soon. Are there any plans to deploy a contract there and start a public testnet there so that we can merge it? Are any of those public execution testnets expendable?",
        "created_at": "2021-05-27T09:51:20.696000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "I also think this is a big problem and especially for a fully decentralized/trustless/nonpermissioned solution (where e.g. node operators are running their own execution clients)",
        "created_at": "2021-05-27T09:51:21.549000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I'd choose it to be dependent on staked eth and the time you staked it, completely independent on block production, since you want to socialize luck",
        "created_at": "2021-05-27T09:52:32.624000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "You basically need a penalization mechanism and in certain cases of MEV rewards even the penalization mechanism may be worthless  (e.g. imagine if EV extractable from 1 block is \u003e 16 eth, which is the required deposit from a node operator)",
        "created_at": "2021-05-27T09:52:36.227000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "I understand why we want to use the coinbase address pre-merge and until withdrawals are enabled, but post-merge, post-withdrawals, why can't EV rewards go to the staking reward address instead?",
        "created_at": "2021-05-27T09:53:36.794000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "In the case of pools can't you force your operators to run signed, untampered software? If you control their clients you can set coinbase",
        "created_at": "2021-05-27T09:54:24.387000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "Is it a technical \"this is not really possible issue due to how the execution chain and beacon chain operate\" or is it a \"we haven't seen a reason to do the work to make this possible\"?",
        "created_at": "2021-05-27T09:54:26.161000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "How would you force your operators to run signed software? Also if it's simply a mater of configuring the a parameter for the client, how do you enforce a specific configuration?",
        "created_at": "2021-05-27T09:54:48.166000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "In the case of LIDO where it's permissioned in theory you can (if a staking pool operator goes rogue you can depermission them). In rocketpool you can't",
        "created_at": "2021-05-27T09:55:42.484000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I mean to sign in your pool you need to run a pool provided software, that software sends proof that it's untampered every attestation or every epoch or whatever period. If your see this failing you punish the operator",
        "created_at": "2021-05-27T09:56:36.837000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "yes but there's cases where the maximum punishment may be less than the value extracted for going rogue",
        "created_at": "2021-05-27T09:57:01.404000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "in which case the punishment is useless",
        "created_at": "2021-05-27T09:57:04.393000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "\u003c@!77492786336636928\u003e I am understanding you correctly that you think this \"problem\" would be solved if rewards go to the validator balance?",
        "created_at": "2021-05-27T09:58:41.415000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "It can, be because this validator address can be a smart contract",
        "created_at": "2021-05-27T09:58:58.034000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "(I haven't thought about it as much, and I didn't see it mentioned a lot here yet either, which is why I started the conversation)",
        "created_at": "2021-05-27T09:59:03.156000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "and the stipulation would be that the \"rewards address\" is assigned at creation and cannot be changed by the node operator",
        "created_at": "2021-05-27T09:59:25.068000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "It is very hard to go rogue in that scenario: your user will have to be running two sets of beacons constantly: one tampered and one untampered, and if he sees a block worth more than 16ETH then switch. Anyway, if we reach the stage were tx rewards are of that order of magnitude we're in trouble cause even the protocol doesn't prevent validators from going rogue as they won't care about being slashed",
        "created_at": "2021-05-27T09:59:40.735000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "They already kind of are?",
        "created_at": "2021-05-27T09:59:58.847000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "There ahve been blocks with like 20 ETH MEV no?",
        "created_at": "2021-05-27T10:00:09.008000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I guess we'll see the impact of 1559 soon..",
        "created_at": "2021-05-27T10:01:14.449000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "I have seen 45, 80, 100 ETH as well. In that case, losing 16 ETH is not much of a deterrent",
        "created_at": "2021-05-27T10:01:16.660000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "The issue we're to solve is not a rogue solo validator, but an operator who joins a decentralized staking pool who acts as a good guy, sharing in EV rewards, and then pounces when it's opportune",
        "created_at": "2021-05-27T10:01:47.018000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "But yeah I agree that for pool operators they indeed may get very large blocks",
        "created_at": "2021-05-27T10:01:56.013000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "btw not sure if you've seen an analysis I wrote about the points you brought up before, generally I agree and I think it's an issue https://hackmd.io/@Izzy-/Eth2VevStaking . I'm working on a part 2 followup where I want to explore in more detail possible solutions for (semi)-decentralized staking pools",
        "created_at": "2021-05-27T10:02:59.065000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I understand that's the issue you want to solve, but I take \u003c@397389662085185547\u003e original question as to how to solve this for the single, unpooled staker",
        "created_at": "2021-05-27T10:03:04.580000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "but in general I think solo validators are dead",
        "created_at": "2021-05-27T10:03:05.743000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "\u003c@!755590043632140352\u003e do you know if something like this would be possible? https://discord.com/channels/595666850260713488/692062809701482577/847412217434472459",
        "created_at": "2021-05-27T10:04:13.435000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Also, as I said above if you delay payments of coinbase to several months, then for operators to switch they will be forfeiting all previous and future blocks in the timeframe",
        "created_at": "2021-05-27T10:05:25.369000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "If who delays payments of coinbase?",
        "created_at": "2021-05-27T10:06:06.413000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "at the protocol level?",
        "created_at": "2021-05-27T10:06:31.577000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "If you are enforcing coinbase to be a contract you control",
        "created_at": "2021-05-27T10:06:34.437000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "You really can't enforce that when the node operator is running their own client, though",
        "created_at": "2021-05-27T10:06:46.956000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "even this \"anti-tampering\" mechanism doesn't work, you jsut increase the possible cost",
        "created_at": "2021-05-27T10:07:00.177000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "so basically the \"go or don't go rogue\" equation changes from  `(1 time MEV reward) \u003e (operator's staked ETH)` to  is `(1 time MEV reward) \u003e (operator's staked ETH  + deferred rewards not yet distributed)`",
        "created_at": "2021-05-27T10:07:58.791000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "correct",
        "created_at": "2021-05-27T10:09:37.700000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "If there's a technical solution to be had I think it's better to consider it than to rely on this cost/benefit mechanism, because we really have no way to be able to tell how large these MEV rewards may get",
        "created_at": "2021-05-27T10:10:16.991000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I don't think you will see even after the merge rewards going directly to the validator's balance. However I think you can send it to the withdrawal address which may be useful for pools like yours",
        "created_at": "2021-05-27T10:11:09.747000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "and this can be done right at the merge without any changes",
        "created_at": "2021-05-27T10:11:36.082000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "but if you mean to \"get rid of coinbase mechanism\"",
        "created_at": "2021-05-27T10:12:20.568000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "You mean the node operator can choose to point the coinbase address to the withdrawal address, but the  problem with that is the enforcement mechanism (which we discussed above)",
        "created_at": "2021-05-27T10:12:23.690000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "But im saying, replace the coinbase mechanism",
        "created_at": "2021-05-27T10:12:32+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Yes, that's something that I expect eventually will be gone",
        "created_at": "2021-05-27T10:13:02.560000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "I get why we don't want to do it now",
        "created_at": "2021-05-27T10:13:10.639000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "It does not make sense at least to me, to keep it",
        "created_at": "2021-05-27T10:13:21.599000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "and I get why we don't want to do it until withdrawals are enabled at the very soonest... but if it's technically feasible it would solve a lot of issues",
        "created_at": "2021-05-27T10:13:27.465000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "even now, in an ugly fashion, but at the protocol level you could enforce this, by ignoring coinbase if the proposer has an eth1 withrawal prefix",
        "created_at": "2021-05-27T10:15:16.898000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "the problem is that the distribution of that eth is done by the execution engine, which does not have knowledge of the beaconchain",
        "created_at": "2021-05-27T10:16:05.031000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "Will this \"always\" be true? Like is there some way/plans in the future for the execution engine to have knowledge of the beaconchain?",
        "created_at": "2021-05-27T10:18:48.143000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I don't know the answer to this. Ways I suspect there are, specially if we ever move to execution shards, as for plans, I only suspects there are none for the time being.",
        "created_at": "2021-05-27T10:21:10.142000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "The execution engine has _some_ knowledge of the beaconchain (at least in the full merge) as it will have access to the Randao mix and the beaconstate root through opcodes",
        "created_at": "2021-05-27T11:29:10.058000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "general",
        "parent": "",
        "content": "For software running on untrusted hardware, this is not possible. Under this scenario, any software  (with more or less effort) can be reverse engineered and send fake integrity checks. When the time is right (e.g. a sufficient MEV reward appears) then the attacker changes the coinbase address. This is just a simple “if” in the code",
        "created_at": "2021-05-27T11:40:56.523000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "We could enforce withdrawal address set to the coinbase on the protocol level (beacon chain could enforce it). But it would require every validator in the system to have eth1 address set to withdrawal credentials and prohibiting new deposits with BLS credentials from appear.",
        "created_at": "2021-05-27T11:56:28.799000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "In general it will be possible for execution layer to read beacon state after `BEACONBLOCKROOT` opcode is enabled, this opcode is required for withdrawals. But we aim asynchronous schema for general purpose reads. For the coinbase in particular, consensus client may send address in withdrawal credentials to the execution layer when requesting a new payload to be created.",
        "created_at": "2021-05-27T11:58:50.824000+00:00",
        "attachments": null
    },
    {
        "author": "dkdkdkdkdkdk",
        "category": "general",
        "parent": "",
        "content": "why are they dead?",
        "created_at": "2021-05-27T13:41:11.425000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "Interesting, I think this could work... I will ping the RP devs and let them know to take a look and chime in when they can. Thank you!",
        "created_at": "2021-05-27T13:55:55.923000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I don't think that making all validators turn their withdrawal credentials to eth1 address in a short term is feasible",
        "created_at": "2021-05-27T13:59:22.228000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "Well not dead dead. Hobbyists and people who are doing it because they prefer the security model will still do it, I just think it will be a very small percentage of overall staked eth because from a cost/benefit perspective it's a bad option. If you scroll up a bit I linked to an analysis I wrote on the economic intuition behind this.",
        "created_at": "2021-05-27T14:01:31.231000+00:00",
        "attachments": null
    },
    {
        "author": "dkdkdkdkdkdk",
        "category": "general",
        "parent": "",
        "content": "shouldn't something be done to make it a less bad option?",
        "created_at": "2021-05-27T14:04:42.767000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "Unfortunately I think that ship sailed when we didn't implement delegated staking at the protocol level (which wasn't necessarily a \"bad/wrong\" decision)",
        "created_at": "2021-05-27T14:05:38.109000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "The lack of a staked eth derivative token and the possibility of outsized priority fee + MEV rewards compared to normal staking rewards basically makes solo staking just a bad economic option, unfortunately.",
        "created_at": "2021-05-27T14:06:13.431000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "So the best we can do at this point is try to make sure that the decentralized staking pool options are supported to offer as competitive a service as possible",
        "created_at": "2021-05-27T14:07:11.331000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "In what timeframe might this be feasible? Like 6months after withdrawals are enabled or something?",
        "created_at": "2021-05-27T14:08:21.027000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Good question. We would also need to deprecate BLS withdrawal credentials and stop accepting deposits with them",
        "created_at": "2021-05-27T14:09:07.570000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "This looks like a recipe for disaster, the contract will keep accepting them.",
        "created_at": "2021-05-27T14:14:23.299000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "The contract accepts just about everything though",
        "created_at": "2021-05-27T14:16:57.769000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "not really, you need to go out of your way to trick it into accepting your deposit, essentially wrong fork is the only way of getting a bad deposit now",
        "created_at": "2021-05-27T14:17:38.945000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "Or not transferring the correct amount of ETH with the signed transaction.\nBut my point was that you can just enter any random data as the withdrawal credentials. The contract doesn't care, but the beacon chain clients do.",
        "created_at": "2021-05-27T14:19:25.889000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "still, one thing is a user passing a key to which he doesn´t have the private counterpart to prove ownership, you can really blame it on him. Another is a user passing a valid hash of a BLS public key, and that user losing all of his ETH.",
        "created_at": "2021-05-27T14:22:04.334000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "Who's to say the beacon chain can't say something like \"Yo, this was an old-style deposit. We do not process those anymore, but you can change it to an 0x01-style if you send this signed message\"",
        "created_at": "2021-05-27T14:23:56.179000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "That seems very hard from an accounting perspective. In principle the beaconchain can actually mint new eth and return it to the address that sent the deposit (which  is already a bit complicated cause this info does not come from the logs of the deposit contract)",
        "created_at": "2021-05-27T14:25:13.961000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "and then the eth will still be there in the contract balance",
        "created_at": "2021-05-27T14:25:24.590000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I'd expect that is more likely that we'll move to BLS addresses than going through something like that 🙂",
        "created_at": "2021-05-27T14:26:07.992000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "\u003e That seems very hard from an accounting perspective\nIsn't sending a signed message _exactly_ what will be required for those of us with BLS withdrawal credentials anyway?",
        "created_at": "2021-05-27T14:26:23.720000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Oh you mean the beacon chain reject even the transaction",
        "created_at": "2021-05-27T14:27:08.383000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "Something like that, there's many ways of accomplishing this type of deprecation, probably some better than what I just thought up.",
        "created_at": "2021-05-27T14:28:06.379000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "that's really ugly, but yes",
        "created_at": "2021-05-27T14:28:16.357000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "Anyway, my original point was that I'd be very sad if solo staking dies after the merge when it won't make sense financially anymore. It's not entirely unexpected of course, but I do feel that all the decentralization efforts with e.g. BLS signatures will have been in vain if we end up with 3-6 large pools again.",
        "created_at": "2021-05-27T14:35:54.506000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "Do you consider Rocket Pool to be in the same category as other SaaS providers in this context?",
        "created_at": "2021-05-27T14:38:12.037000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "If you scroll up a bit you can see that RocketPool will suffer a similar issue.",
        "created_at": "2021-05-27T14:41:31.941000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "Right, I was referring to this:\n\u003e BLS signatures will have been in vain if we end up with 3-6 large pools again.",
        "created_at": "2021-05-27T14:41:51.770000+00:00",
        "attachments": null
    },
    {
        "author": "pieterastra",
        "category": "general",
        "parent": "",
        "content": "why is it necessary to do this for all validators at once? it's not possible to enforce only for validators with eth1 withdrawal credentials?",
        "created_at": "2021-05-27T14:43:00.758000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "If I understood correctly, both solo staking and Rocket Pool won't be able to compete with centralized pools (that are in charge of both withdrawal addresses and block proposals and their coinbase address, and probably more sophisticated MEV).",
        "created_at": "2021-05-27T14:44:23.152000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "Ok, I understand now",
        "created_at": "2021-05-27T14:46:42.989000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "general",
        "parent": "",
        "content": "There’s hope for Rocket Pool, provided the changes we are discussing are implemented, somehow",
        "created_at": "2021-05-27T14:47:00.729000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "That's one of the main reasons I see bringing the coinbase / MEV issue up here, solving this problem will make Rocket Pool competitive with the other platforms in a world where MEV rewards tend to dominate attestation rewards",
        "created_at": "2021-05-27T14:48:03.483000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "general",
        "parent": "",
        "content": "This",
        "created_at": "2021-05-27T14:48:15.867000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "Sorry, just got into the conversation",
        "created_at": "2021-05-27T14:48:19.543000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "So the summary of the concern as I understand is: MEV (and post EIP 1559 priority fees) mean that a huge chunk of staking revenue will still be for proposing",
        "created_at": "2021-05-27T14:48:48.808000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "And so you worry validators will have high variance and this encourages pooling",
        "created_at": "2021-05-27T14:49:05.033000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "Correct?",
        "created_at": "2021-05-27T14:49:06.577000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "Our worry is that with RP, the staking pool (which funded half of a validator) will not receive their cut of MEV rewards / priority fees, because we can't enforce a node operator to give them their cut since all of it will go to an ETH1 address they control",
        "created_at": "2021-05-27T14:50:26.566000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "general",
        "parent": "",
        "content": "\u003c@273808422753796097\u003e \u003c@!77492786336636928\u003e has written a good article about this issue: https://hackmd.io/@Izzy-/Eth2VevStaking",
        "created_at": "2021-05-27T14:50:34.335000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "got it",
        "created_at": "2021-05-27T14:50:48.216000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "In the post-merge cleanup HF, we could change the rules so that instead of the funds going to `block.coinbase` they go to the beacon chain validator balance",
        "created_at": "2021-05-27T14:51:49.577000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "But I guess for MEV, you can't enforce that",
        "created_at": "2021-05-27T14:51:55.266000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "So you can't stop whoever has technical control of block contents from getting the revenue for themselves",
        "created_at": "2021-05-27T14:52:26.487000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "Correct",
        "created_at": "2021-05-27T14:52:34.925000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I don't see how the side-channel payment method can be stopped, to be honest.  Something that pooled validators will have to risk.",
        "created_at": "2021-05-27T14:53:08.059000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "So what do we want? Some mechanism to pre-sell proposal rights perhaps, so that the proposer economies of scale can be firewalled off from the rest of the validation game?",
        "created_at": "2021-05-27T14:53:37.375000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "In a perfect world, validators with 0x01 withdrawal credentials (to smart contracts) would ignore the coinbase and just have their rewards sent to the validator address",
        "created_at": "2021-05-27T14:54:32.683000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "I'm not sure who else is using the 0x01 mechanism beyond Rocket Pool",
        "created_at": "2021-05-27T14:54:47.758000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "right, but you can't enforce that for MEV payments",
        "created_at": "2021-05-27T14:54:49.643000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "Yeah, this is not a perfect world heh",
        "created_at": "2021-05-27T14:55:06.331000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "(There is a separate argument that if I run a validator then the rewards from doing that come from the beacon chain.  If in addition I hunt down MEV, build the best ETH1 block I can, etc. then that's on me and I deserve the additional payment.)",
        "created_at": "2021-05-27T14:55:14.715000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "Sure, but then Searchers will not prefer you to send their bundles to",
        "created_at": "2021-05-27T14:56:11.241000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "3291/159650 deposits used ETH1 credentials, at last count",
        "created_at": "2021-05-27T14:56:12.476000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "they will prefer pools that execute searcher bundles instead",
        "created_at": "2021-05-27T14:56:21.097000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "general",
        "parent": "",
        "content": "What if half of your validator balance is not yours? E.g. rocket pool?",
        "created_at": "2021-05-27T14:56:31.726000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "so over time, more MEV rewards will accrue to those pools, and then therefore retail stakers will also want to invest their money via those pools",
        "created_at": "2021-05-27T14:56:37.727000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Just a note, but I think the point you made in your article (if it was yours, apologies if not) about searchers preferring pools is not necessarily correct.  I think that searchers will more likely differentiate at the validator level, as they can make more returns by paying less to validators that have yet to establish trustworthiness.",
        "created_at": "2021-05-27T14:58:18.917000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "it might be a moot discussion if the way MEV gets paid out eventually changes (e.g. it goes to sequencers, or it's all done off-chain and then settled on chain)",
        "created_at": "2021-05-27T14:58:20.337000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "Yep it's mine. I think you're right short-term, but not long term",
        "created_at": "2021-05-27T14:59:21.195000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Long-term most validators will have at least a basic level of trustworthiness due to history.",
        "created_at": "2021-05-27T14:59:54.019000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "Basically the way that \"new pools\" will be able to get a foot in the door will be to \"ask for less\" until their trustworthiness is established",
        "created_at": "2021-05-27T15:00:01.726000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "Most large pools, sure, most small to medium ones probably not. How many blocks is  1 validator going to propose per year in a 2 years when we have rotating validator sets etc?",
        "created_at": "2021-05-27T15:00:46.666000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I think that 2 years down the line it's going to be a somewhat different game.  I expect by that stage a lot of what is MEV today will have moved to layer 2 (as that's where the user-level transactions will go), and a lot of block proposers at layer 1 will be more focused on inclusion of rollups/SNARKs.  So the need for secrecy/trustworthiness will be significantly less.",
        "created_at": "2021-05-27T15:02:48.966000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "That's very likely I agree",
        "created_at": "2021-05-27T15:05:16.603000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "Forcing the coinbase rewards to go to the validator balance will already be something, but that still requires the existence of pooling contracts I guess? Or are we assuming all solo stakers move to RocketPool with its tokenomics on top?",
        "created_at": "2021-05-27T15:09:17.704000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "But it would still be nice to come up with a simpler solution that doesn't create \"extra\" burden for protocols that are trying to do things in a more decentralized manner in the nearer term, regardless of where MEV ends up migrating to or how effective the various minimization strategies end up being",
        "created_at": "2021-05-27T15:09:39.578000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Block producers can always be paid in a side channel, wholly or partially, if they have control of the block they are producing.",
        "created_at": "2021-05-27T15:13:02.090000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "It's probably not a good idea to enforce that on *everybody* per se, but it may make sense for platforms that use 0x01 - that being said, \u003c@!144468805697929216\u003e reported that people were already using it on mainnet, so I'm curious how it would negatively impact them",
        "created_at": "2021-05-27T15:13:19.743000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "Indeed, this would solve the priority fee issue but not the side-channel issue",
        "created_at": "2021-05-27T15:14:18.958000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "Is something better than nothing?",
        "created_at": "2021-05-27T15:14:28.533000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "If it gives the illusion that block producers' fees are all being accounted for, but with no guarantees, I'd say \"no\".  The situation where the block producer is dishonest has exactly the same result either way.",
        "created_at": "2021-05-27T15:16:38.996000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "But I think we all agree that there cannot be a 100% guarantee",
        "created_at": "2021-05-27T15:17:09.681000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "It'll just take more effort for the block producer to \"go rogue\" with such a patch as opposed to without it",
        "created_at": "2021-05-27T15:17:37.434000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "e.g. if rocketpool is packaging a form of mev-geth, c hanging a simple coinbase address is really easy",
        "created_at": "2021-05-27T15:18:15.456000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "setting up your own MEV apparatus or running a more modified client or relayer setup to sidechannel the MEV payment is a lot more involved",
        "created_at": "2021-05-27T15:18:40.449000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "It requires exactly the same effort, as far as I can see.  They either go rogue and work with the searcher to be paid in a separate transaction, or they don't.  If they just change coinbase it will be immediately obvious not only that it occurred, but how much they profited directly as a result.",
        "created_at": "2021-05-27T15:19:38.677000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "I'm not sure I follow. Modifying a coinbase address requires no \"extra\" interaction with the searcher at all",
        "created_at": "2021-05-27T15:21:08.773000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "(Also, given that ETH1 withdrawal credentials are only for 2% of the validators it would require substantial engineering to force-upgrade everyone to have a suitable address.)",
        "created_at": "2021-05-27T15:22:14.280000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "It's probably not the cleverest mechanism to go rogue and get away with it so you can do it again, to be sure",
        "created_at": "2021-05-27T15:22:15.425000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "Sure, and I'm not technical enough to know if that's the only viable solution or not. If it is, then I guess the summary is that it's not worth the effort and that's fair I guess",
        "created_at": "2021-05-27T15:22:50.749000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "isn't high mev assumption a contradiction with the rollup scaling strategy? if almost everything moves to rollups mev on l1 is going to be tiny",
        "created_at": "2021-05-27T15:48:33.146000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "I think that's the hope",
        "created_at": "2021-05-27T15:50:40.126000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "That shifts the issue back to the coinbase, which I think is solvable based on what I've read here",
        "created_at": "2021-05-27T15:51:16.928000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "It's possible but this partial solution is bug prone. Imagine the case when the block is invalidated because somebody forgot to restart their execution client after withdrawal credentials have been changed or due to bug in software. This kind of thing would lead to missed proposal.",
        "created_at": "2021-05-27T15:54:49.909000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "ethereum is over if rollups don't pan out, so worrying about l1 mev appears to not make much sense to me.",
        "created_at": "2021-05-27T15:56:33.310000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "If they go to balance then it would add a synchronicity constraint on relation between beacon and execution block processing which we are willing to avoid. sending fees to `withdrawal_address` or to any other EOA doesn't introduce this constraint",
        "created_at": "2021-05-27T15:56:56.649000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I can also forsee a lot of misbehaving and misunderstanding wrt to having two alternative ways of transaction fee transfer",
        "created_at": "2021-05-27T15:58:16.661000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "I just want to make sure I understand the concern here, pardon my pseudo code but something like\n\n```\nif (validator.withdrawal_credentials.starts_with(\"0x00\")) {\n    send_to(block.coinbase) // This is an ETH1 address\n}\nelse if (validator.withdrawal_credentials.starts_with(\"0x01\")) {\n    send_to(get_address(validator.withdrawal_credentials)) // This is also an eth1 address\n}\n```\n\nwould not work at the protocol level because it is a partial solution and bug prone?",
        "created_at": "2021-05-27T16:26:52.818000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "yeah you can do that",
        "created_at": "2021-05-27T16:32:19.461000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "Though I do think that it's not even worth doing if we know that MEV bypasses this restriction",
        "created_at": "2021-05-27T16:32:30.836000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "Better to acknowledge that whoever has technical control over block proposal contents gets the money, and work around that",
        "created_at": "2021-05-27T16:32:50.694000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "Yeah this is moot as long as MEV payments far exceed conventional rewards and can be handled in side-channels, but this is predicated on L2 largely removing that balance discrepancy as \u003c@!426309542482018305\u003e suggested",
        "created_at": "2021-05-27T16:34:23.494000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "If that ends up being the case, the MEV side-channel issue is just something that we'll have to eat and acknowledge but the coinbase issue still exists and can be solved",
        "created_at": "2021-05-27T16:35:56.868000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "It's not as simple as in these few lines of code. Transaction fees are paid inside of execution client code as it is in mainnet clients today and beacon chain client will send the address (if we implement this functionality) to the execution client to be set as a coinbase. This schema would be alternative to the old one which is run execution client with the coinbase address set in CLI on launch and forget about it.",
        "created_at": "2021-05-27T16:36:57.647000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "What should execution client do if there is a coinbase address set on a start and there is address coming from the consensus client? What should be preferred in this case?",
        "created_at": "2021-05-27T16:38:02.052000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "I mean, personally I think the priority should go to what the consensus client reports",
        "created_at": "2021-05-27T16:38:55.548000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "How do you propose to work around this though for a protocol that doesn't permission who gets to be an operator in the staking pool?",
        "created_at": "2021-05-27T16:40:12.177000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "But that is the crux of the conversation - the current schema is incompatible with scenarios where the block proposer shouldn't \"own\" all of their rewards, so the questions are really:\n\n- Does Ethereum want to \"officially\" support this mode of operation, which is necessary for decentralized staking systems\n- If so, how can we do it in the least-disruptive way possible",
        "created_at": "2021-05-27T16:40:15.956000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "If the estimated rewards from a retail staker putting their money into a decentralized permissionless pool are less than they would be in a centralized or semi-decentralized but permissioned one (as in such a case operators can be kicked and barred from re-entry via KYC/meatspace contracts), you're only really going to have people who are willing to pay this \"decentralization premium\" putting their money in.",
        "created_at": "2021-05-27T16:41:26.649000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Technically this is correct and coinbase address came from consensus is the right one, otherwise block may be invalid. But I am not sure that this will be correct answer in a 100% cases and would not cause somebody's misunderstanding. It will need to be clarified well: if you change your withdrawal creds to eth1 address bear in mind that coinbase address will change.",
        "created_at": "2021-05-27T16:41:37.647000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "I agree, it would need to be considered carefully and documented quite well",
        "created_at": "2021-05-27T16:42:11.361000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I am not saying it's impossible. It adds complexity and probably more than it seems at the first glance",
        "created_at": "2021-05-27T16:42:37.433000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "It does, which is why before even diving into it, it's best to answer the first question above",
        "created_at": "2021-05-27T16:43:11.579000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "Does Ethereum want to support a mode of operation where a block proposer didn't stake 32 of their own ETH, and doesn't own all of the reward",
        "created_at": "2021-05-27T16:43:33.675000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Also, are users willing their `withdrawal_creds` address used as the coinbase with no alternative to it?",
        "created_at": "2021-05-27T16:43:46.302000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I'd disagree with the premise of the question.  There are other ways to allow decentralised staking systems, for example punishing the validator if they don't send to the required coinbase (in the same way that rocketpool punishes slashed validators).",
        "created_at": "2021-05-27T16:44:10.548000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "I would hope so, because presumably they own / have access to that contract",
        "created_at": "2021-05-27T16:44:13.256000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "You can only punish a validator up to their stake+collateral. There are single blocks with more EV in them than 16 ETH",
        "created_at": "2021-05-27T16:44:29.827000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "You can change your coinbase by restarting a node now but in the case of withdrawal creds in coinbase you won't have this ability once you turned you creds to eth1 address (it can't be changed after that)",
        "created_at": "2021-05-27T16:44:30.448000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "That doesn't work if you accumulate more ETH by \"cheating\" than you can possibly be punished for though",
        "created_at": "2021-05-27T16:44:41.501000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Given that we don't want to allow changing `withdrawal_creds` if we can avoid it, I'd be against this as you'd be stuck with whatever it was set to first.",
        "created_at": "2021-05-27T16:45:00.714000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "Perhaps we need a 0x02 prefix that comes with this constraint then heh",
        "created_at": "2021-05-27T16:45:13.020000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Sure, but there are also no doubt blocks with a small EV and a large side payment.  So locking coinbase to the withdrawal credentials doesn't seem to solve the problem.",
        "created_at": "2021-05-27T16:46:11.963000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "general",
        "parent": "",
        "content": "I feel that two distinct scenarios are being merged into one. While I agree that, ultimately, a validator will have control of MEV rewards, be it from setting the coinbase address, or from using a side-channel, there are two (arguably) very different abuse scenarios. a) a well funded player, creates many rocket pool validators (as this effectively doubles the chances of block proposals - remember that a node operator contributes with 16 ETH - the other half coming from users of the protocol), and then creates a distributed infra-structure / contracts to split MEV rewards among block searchers / block validators. This requires a fairly sophisticated malicious actor that may have to manage non-trivial infrastructure. then there's b) a regular malicious node operator that can change the coinbase address at any time. we don't know what will be the percentagem of malicious operators, but if it's large, this poses a serious threat to decentralized pools. it would be a huge win to kill this attack vector by design.",
        "created_at": "2021-05-27T16:46:37.198000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "This particular coinbase proposal is separate from the MEV side-channel discussion, it's targeted at a world where L2 has essentially solved that problem and reduced MEV fees to levels that don't invalidate the coinbase reward",
        "created_at": "2021-05-27T16:47:18.577000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "Another thing to keep in mind btw is that you can MPC the proposer",
        "created_at": "2021-05-27T16:47:34.904000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "But that's only viable if the algorithm for block selection is very simple",
        "created_at": "2021-05-27T16:47:45.470000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "Which is not true today, but *would* be true if you're mainly choosing between flashbots bundles!",
        "created_at": "2021-05-27T16:48:02.419000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "So perhaps we should look at this holistically in the context of outsourceable proposing...",
        "created_at": "2021-05-27T16:48:41.616000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "This is likely to be where things end up.  Rocketpool run a service that gives validator nodes a block they can propose, complete with coinbase.\n\n(It may be that the decision on what block to propose is distributed, of course)",
        "created_at": "2021-05-27T16:49:54.088000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "I don't know enough to fully judge, but that sounds like a centralized component and RP is very adamant about remaining as decentralized as possible",
        "created_at": "2021-05-27T16:51:00.215000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "The side payment is an unfixable problem really, I think we all agree. The question is how to enable a decentralized permissionless protocol to not always have to offer rewards at a disadvantage vs centralized/permissioned protocols that have more control over who and how blocks are proposed.",
        "created_at": "2021-05-27T16:51:36.281000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "then MPCing block proposing seems like a good direction to look into! The participants all share data with each other, all compute the tx/bundle selection locally, and then all sign if they agree with each other (as they should)",
        "created_at": "2021-05-27T16:52:23.286000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Problem there is that the MEV searchers don't want to give details of their bundles out for fear of being out-bundled, and any MPC system will increase the number of parties with access to the bundles prior to being broadcast.  May still work out if the timeframe is tight enough (i.e. don't release the bundle until the prior block has been broadcast).",
        "created_at": "2021-05-27T16:54:00.603000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "\u003e Problem there is that the MEV searchers don't want to give details of their bundles out for fear of being out-bundled\n\nI think there's ways to handle that! Particularly the whole \"proposer accepts the bundle without knowing the contents\" thing",
        "created_at": "2021-05-27T16:54:32.202000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "There is a level at which if you want to be decentralized you may have to allow for a punishment system that has a cap.",
        "created_at": "2021-05-27T16:54:49.123000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Early on, yes, but at some stage you need the real transactions to build the rest of the block, execute it, and ultimately sign it.  And with MPC you have the additional co-ordination overhead.\n\nI'm sure it's solvable with enough horsepower behind it.  Would be interesting to see how it would work in distributed reality.",
        "created_at": "2021-05-27T16:55:48.216000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "\u003e but at some stage you need the real transactions to build the rest of the block, execute it, and ultimately sign it.",
        "created_at": "2021-05-27T16:56:02.694000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "No you don't",
        "created_at": "2021-05-27T16:56:04.791000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "You sign the header",
        "created_at": "2021-05-27T16:56:07.305000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "🤣",
        "created_at": "2021-05-27T16:56:11.846000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "I guess that's hard to combine with multi-bundling though",
        "created_at": "2021-05-27T16:56:21.336000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Then the searcher would have to propose the entire block, rather than just a tx or a bundle.  Still doable, I suppose, but makes it harder to combine bundles.",
        "created_at": "2021-05-27T16:56:43.875000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "general",
        "parent": "",
        "content": "Wouldn’t a malicious validator always win the race? (Or almost always)",
        "created_at": "2021-05-27T16:57:04.681000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "I understand, but if so that puts the decentralized protocol at a disadvantage vis a vis rewards, which means that on average money will go elsewhere.",
        "created_at": "2021-05-27T16:57:07.112000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "general",
        "parent": "",
        "content": "(Not familiar with the mechanism being proposed. Any links ? :))",
        "created_at": "2021-05-27T16:57:29.773000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "ok this is a conversation I should ask in the flashbots research channel 😆",
        "created_at": "2021-05-27T16:57:54.102000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "I'm sure they've thought more than I have",
        "created_at": "2021-05-27T16:57:58.765000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Is that really true though?  Surely the centralized service is taking its own cut, and if the decentralized service can weed out bad actors it seems that they would end up with a better return.",
        "created_at": "2021-05-27T16:58:45.024000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "Well if you want to maximize revenue as a centralized service what you will do charge the least possible commission (let's use commision to mean both the staking cut and the MEV) possible",
        "created_at": "2021-05-27T16:59:54.034000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "and since centralized services have smaller marginal costs due to economies of scale and just by nature of being centralized (e.g. no need to come up with decentralized onchain methods of reward distribution), that means they can effectively charge a lower commission",
        "created_at": "2021-05-27T17:00:16.839000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "That does suggest that this is purely an economic model, and that the validators don't put any value on decentralization.  If true then we're going to end up fully centralized regardless of our best efforts, which would be a shame.",
        "created_at": "2021-05-27T17:01:47.282000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "Well validators do, but the average chain user depositing their eth probably doesn't",
        "created_at": "2021-05-27T17:02:05.449000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "(From talking to many validators, they *do* put a value on decentralization.)",
        "created_at": "2021-05-27T17:02:12.429000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "Was the MPC stuff meant to be an alternative to the \"check the credentials prefix\" thing?",
        "created_at": "2021-05-27T17:02:17.382000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "Some will be wliling to pay this \"decentralization premium\", but the bigger the premium is, the harder of a pill that will be to swallow",
        "created_at": "2021-05-27T17:02:19.342000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "In general I think right now in etheruem we are a bit spoilt by a userbase that places a high premium on decentralization from an ideological perspective (but also considering/knowing that in general this is good for network health long term). There's no guarantee that this holds true going forward, though.",
        "created_at": "2021-05-27T17:03:43.301000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I need to go do some work, but it sounds like the idea of using ETH1 withdrawal credentials as a hard-coded coinbase are going to be tricky as-is.\n  - a number of validators are already on ETH1 withdrawal credentials that may not be suitable\n  - a number of validators are not on ETH1 withdrawal credentials\n\nThe idea of a new set of withdrawal credentials (`0x02`) to do this and be enforced by consensus is a more likely path, but would that impact on RocketPool's deployment schedule?  It would also add a fair chunk of complexity to the merge, which has been stripped down significantly so then the question would be why add this rather than transfers, withdrawals or any of the other functionality that isn't in place?",
        "created_at": "2021-05-27T17:06:58.277000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "The impact on schedule would really depend on how quickly it can be merged into eth2.0-specs",
        "created_at": "2021-05-27T17:08:00.961000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "If we're talking a matter of a few weeks, it shouldn't change much as it's still going through the 2nd round of audits right now",
        "created_at": "2021-05-27T17:09:32.333000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "If we're talking months, it would impact it severely",
        "created_at": "2021-05-27T17:09:43.808000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "Having it merged into eth2.0-specs has historically been enough for Rocket Pool to press, as we did with 0x01",
        "created_at": "2021-05-27T17:10:39.184000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "I can talk with the team tonight when they get on to gather their thoughts on it",
        "created_at": "2021-05-27T17:19:36.201000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "\u003e why add this rather than transfers, withdrawals or any of the other functionality that isn't in place?\n\nOn this front, I'll just reiterate that those mechanisms don't allow for situations where a block proposer isn't entitled to the entire block reward + priority fees for the block they proposed, because they didn't fund the entire validator. Punishment systems necessarily require a watcher (like our Oracle DAO), and can only punish malicious behavior up to a certain point (their initial deposit), whereas this mechanism will scale without limit.",
        "created_at": "2021-05-27T17:27:24.068000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "If we have to concede that support for 0x02 won't come with the initial merge but be added later down the road, that might be a good middle ground (as long as it's committed to in the design docs); as long as a bad actor doesn't gain more than 16 ETH from inclusion fees prior to this upgrade, our Oracle-based checks can penalize them accordingly",
        "created_at": "2021-05-27T17:28:27.938000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "To summarize:\n\n- `0x01` states \"when this validator exits, send its balance to address 0x1234abcd... on the eth1 chain\"\n\n- `0x02` would state \"when this validator exits, send its balance to address 0x1234abcd... on the eth1 chain, *and* when it proposes a block, send the inclusion fees to that address as well\"",
        "created_at": "2021-05-27T20:06:22.943000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "This could solve the problem that Blox had as well (see https://discord.com/channels/595666850260713488/692062809701482577/847367811096903680)",
        "created_at": "2021-05-27T20:07:24.863000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Kind-of.  `0x02` would mean \"blocks from this proposer should only be considered valid if the coinbase matches this address\".\n\nThis would open up some complexity, as mentioned above, and there are open questions about if the withdrawal credentials can be changed, and if so by whom and from what.  But the general idea seems reasonable.",
        "created_at": "2021-05-27T20:20:10.568000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "\u003e \"blocks from this proposer should only be considered valid if the coinbase matches this address\".\n\nYeah, I suppose I hadn't thought down into the implementation that far but I agree the end result is the same",
        "created_at": "2021-05-27T20:21:29.043000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "From our perspective, the fact that the withdrawal address *can't* be changed is actually a security feature",
        "created_at": "2021-05-27T20:22:30.764000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "Or could only be changed with a signed tx *from* the withdrawal address",
        "created_at": "2021-05-27T20:23:26.033000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "Which could be desirable for a number of reasons",
        "created_at": "2021-05-27T20:23:34.068000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "That's an interesting take",
        "created_at": "2021-05-27T20:23:49.774000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "general",
        "parent": "",
        "content": "🤔",
        "created_at": "2021-05-27T20:23:55.105000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "We don't want the generic ability to be able to change withdrawal addresses as it is a DOS vector (via flooding of withdrawal credential change requests).  Prior thinking was that it would be allowable to change from a `0x00` to a `0x01` address, as that can only be done once.  Introducing a new value would require additional consideration.",
        "created_at": "2021-05-27T20:53:45.714000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "In principle you could take care of the DOS vector by having another contract to emit logs of changes of address: you want to change your address, you interact with this contract and this costs gas. The beacon chain picks the logs as it does with deposits now. Ugly, but it can be done without changes to the current execution engine",
        "created_at": "2021-05-27T20:58:56.825000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Ideally you would want to have these changes purely on the beacon chain, though. Withdrawal credentials could relate to layer 2 addresses, for example, so we'd want to not tie changes in to the ETH1 chain.",
        "created_at": "2021-05-27T22:25:10.742000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "In principle the contract on eth1 just acts as a relayer of data, to add a mechanism of gas to the beacon chain without actually implementing it on the consensus side. It could relay any address, including L2 ones",
        "created_at": "2021-05-27T22:27:47.017000+00:00",
        "attachments": null
    }
]