[
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Can't talk in \u003c#892088344438255616\u003e , so I'll leave it here (can I get me one of those ethusiast thingies? 😉 )\n1) If the status is \"withdrawal_done\", is it skipped over in the withdrawal loop?\n2)  As unlikely as it is, with the sync committee rewards being as high as they are, it really sucks to miss them due to unfortunate exit queue timing.",
        "created_at": "2022-12-11T11:08:13.759000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Maybe you can lobby to join the bowties?",
        "created_at": "2022-12-11T13:47:54.321000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think it may require changing your name to `micah` first though.  I know it did for me.",
        "created_at": "2022-12-11T13:48:21.326000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Joining the bowties would definitely be an honor. And I would say whatever my avatar/picture has is at least _somewhat_ similar to one...",
        "created_at": "2022-12-11T14:15:52.541000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Rewards will still wind up being withdrawn. The rule is just that if the validator is withdrawable, when it's turn comes around it's entire balance is withdrawn.",
        "created_at": "2022-12-11T20:45:50.533000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Cool, i do wonder how this ties into reusing validator indices though. Apparently \"withdrawal_done\" is not enough to say whether a validator index is (or will be) in use. Related question, what happens if I deposit 32 ETH again to that exited/withdrawn validator? Will the deposit fail (losing me 32 ETH)? Will it reactivate the validator? Will it top up the balance but not reactivate (and balance gets automatically withdrawn to 0x01 address)?",
        "created_at": "2022-12-11T21:15:16.384000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It would increase the balance of the validator and then the next withdrawal sweep would withdraw those funds again.",
        "created_at": "2022-12-11T21:16:12.288000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The idea for reusing indices that I've heard is that they'd only be reused a fixed amount of time after the validator's withdrawable_epoch (remember that the `withdrawal_done` state doesn't actually exist in the beacon state - it's a synthetic interpretation of a few separate fields the REST API generates). That amount of time would be something like a year, so there's no chance the validator would still be in a sync committee.  Sending a deposit is done on public key which would have changed so it would actually just create a new validator with the old public key and a new index.",
        "created_at": "2022-12-11T21:17:59.504000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hmm, i thought there was some type of tree in the deposit contact tied to the index and pubkey. Will do some reading on it tomorrow",
        "created_at": "2022-12-11T21:21:51.982000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Either way thanks for the helpful answers, as always 🙂",
        "created_at": "2022-12-11T21:22:26.902000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yes and no... 🙂 There's a merkle tree of deposit index to data. However the deposit index is not the same as the validator index because deposits might be invalid or there might be multiple deposits for a single validator.",
        "created_at": "2022-12-11T21:23:57.025000+00:00",
        "attachments": null
    }
]