[
    {
        "author": "paulhauner",
        "category": "general",
        "parent": "",
        "content": "If there are other MEV teams targeting the merge then they should reach out ASAP. We’ve been trying to build APIs agnostic to Flashbots, we don’t want to enshrine them of course. If we don’t know the requirements for other teams we can’t cater for them. I can be a point of contact for any such teams, DM me.",
        "created_at": "2022-04-02T00:01:31.265000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "general",
        "parent": "",
        "content": "Definition of APIs and implementation has already started. It’s not too late, but it’s certainty not too early.",
        "created_at": "2022-04-02T00:03:03.074000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "I'll forward this on to the ones I'm aware of",
        "created_at": "2022-04-02T00:08:36.965000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "\u003c@!425572898787426305\u003e , regarding https://hackmd.io/GDc0maGsQeKfP8o2C7L52w, I agree with the specification as in that document, but I find that you can't really distinguish the synchronous vs asynchronous implementation (in the sense that any EC can claim to be syncing at any time). So given this, I do not really see any point in complicating the implementation. I tend to agree with Adrian that if LVH is not useful as in the current spec, then it may as well not be there that that would be fine. So I think that a very simple specification like \n```\nIf validation fails, the response MUST contain {status: INVALID, latestValidHash: validHash} where validHash is either empty or the block hash of the most recent valid ancestor of the invalid payload. That is, the valid ancestor of the payload with the highest blockNumber\n```\nWhich is simply 4 words different than the current specification and leaves the EL to do whatever it wants.",
        "created_at": "2022-04-02T01:09:39.067000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "In particular, returning the parent hash is seldomly useful: if no lvh is returned, then we will assume this is the case. While if you return the parent hash we will have to 1) check that the hash is there in forkchoice and it's known, 2) check that it's an ancestor of the invalid block, etc...",
        "created_at": "2022-04-02T01:12:58.794000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "Is it safe to assume the risks of being slashed will be higher at the merge? I am thinking of turning off my validators for 24 hours when the merge occurs to prevent a possible mass slashing event if something goes wrong. Has the team thought about removing slashing for 24 hours at the merge to prevent validators from turning off at the merge?",
        "created_at": "2022-04-02T03:33:14.337000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "general",
        "parent": "",
        "content": "There’s two factors involved with getting slashed (slashing here means producing conflicting messages), assuming that clients implement slashing protection correctly (I have no reason to believe they don’t):\n\n1. Running the same validator keys in two different validator clients.\n2. Having those two different validator clients produce conflicting information. It’s not uncommon for users to run duplicate setups for some time before that setup actually causes them to be slashed. \n\nI have no reason to believe the client implementations of slashing protection will be affected by the merge, I expect the slashing protection system to be well insulated from practically all changes introduced by the merge. \n\nFor (1), users upgrading their setups to support the new merge configuration might result in them making mistakes and running the same keys twice. For example, starting a new, more powerful machine to run EL+CL and forgetting to turn the old one off. \n\nFor (2), the merge might introduce some turbulence into the network which might cause already misconfigured setups to produce conflicting messages, simply because some nodes will have slightly different views of the networks.\n\nSo, I wouldn’t be surprised if we saw some more slashings during the merge. However, I don’t expect users who are running safe (non-duplicate) setups to get slashed from no fault of their own.\n\nSo, I don’t think that turning your system off for 24hrs will help. If you have a duplicate setup you’ll almost certainly get slashed at some point. I also wouldn’t recommend people turn off their setups during the merge, since if enough people do that then we won’t have enough validators to finalise the chain!",
        "created_at": "2022-04-02T03:54:43.014000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "ngl, i was thinking the same when i saw the slashings @ kiln around the merge event",
        "created_at": "2022-04-02T08:49:44.054000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "is there a post mortem what caused the slashings at kiln?",
        "created_at": "2022-04-02T08:51:15.759000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "At one point there were a bunch of slashings on kiln because no one had been running a slasher (or were running a selfish one) and so quite old violations were then slashed in a batch.",
        "created_at": "2022-04-02T08:59:51.608000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "i see, so it was coincidence that it happened right after the merge?",
        "created_at": "2022-04-02T09:00:42.286000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I’m not entirely sure what the timing was in relation to the merge. I just remember freaking out about the slashings then discovering they were actually old from when the person was trying to get slashed.",
        "created_at": "2022-04-02T09:05:24.330000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "But I’m certainly unaware of any merge related slashings.",
        "created_at": "2022-04-02T09:08:11.394000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "fair, maybe jgm has more info 😄 \nhttps://discord.com/channels/595666850260713488/692062809701482577/953318312966762576",
        "created_at": "2022-04-02T09:10:19.649000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "general",
        "parent": "",
        "content": "I haven’t seen a formal report but I was told it was an execution team that made a mistake whilst setting up their infra.",
        "created_at": "2022-04-02T10:27:29.495000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "From that thread it looks they were pubic indices",
        "created_at": "2022-04-02T10:28:32.562000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "I don't really see how the merge would increase slashing risk\n\nVC slashing protection is entirely unchanged and the rule is still the same - only run your keys in one place",
        "created_at": "2022-04-02T23:12:15.792000+00:00",
        "attachments": null
    }
]