[
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "MicahZoltu, though it looks like you found it already.",
        "created_at": "2022-09-17T01:46:09.993000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "See also the related \"block scoring\" discussion here: https://collective.flashbots.net/t/block-scoring-for-mev-boost-relays/202",
        "created_at": "2022-09-17T12:04:52.617000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "is that scoring pre signed blinded block submission or post? did check iit out, wasn't clear to me",
        "created_at": "2022-09-17T12:05:38.593000+00:00",
        "attachments": null
    },
    {
        "author": ".10320",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Are devs aware that withdrawals are an extremely important issue for the common ethereum user? The fact that coinbase/kraken/lido have so much marketshare is not that great. Also there is no way for people to actually vote with their wallets on pool providers that censor or are too centralized if withdrawals are not active. Lido was early. But there are alternatives now. For the sake of chain health its important that people have some agency in that matter.",
        "created_at": "2022-09-17T21:47:24.531000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Withdrawals are \"considered for inclusion\" for Shanghai. They were deferred from the merge to reduce complexity, speed up that process, and help ensure it went off without a hitch. \n\nDevs probably have a diverse and nuanced perspective on feature priorities but most are well aware that stakers have been staking  for 2 years on good faith that the feature would be integrated asap and that without such a feature, the market can become further distorted. \n\nWe're doing a second pass on writing of consensus tests on the feature now so that it can be considered complete and ready for the coming Shanghai discussions",
        "created_at": "2022-09-17T22:10:45.722000+00:00",
        "attachments": null
    }
]