[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "It may for those running complicated setups sharing keys among different validator clients. I don't think there's any limit to human imagination and the lengths they may try to go in the name of having the moniker \"the pool with no missed attestations\"... Imagine \"the pool with maximum MEV extracted\". I would not be surprised when I read a post mortem explaining some unseen situation in such setup",
        "created_at": "2022-04-03T19:26:02.729000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "Right. More moving parts means more room to get unnecessarily creative.",
        "created_at": "2022-04-03T19:56:18.127000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "I do stand by the fact that the narrative and instructions to keep your key setup simple remains stable",
        "created_at": "2022-04-03T19:56:39.135000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "But yeah. People love to optimize beyond reason",
        "created_at": "2022-04-03T19:57:03.505000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "One piece of messaging that I've not seen that much delivered in a concerted way is quantifying the actual (not very large) losses of missing an attestation or two, and just working through some expected-value calculations of that even a low likelihood of slashing due to misconfiguration under many assumption sets results in less expected profit than a simpler configuration which misses a few attestations.",
        "created_at": "2022-04-03T20:30:12.222000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "There are more technical writeups aimed at people comparing validator performance metrics or who want to look at exactly how Altair changed the reward schemes, but in terms of providing baseline expectations for people running validators, maybe they're around, but not sure I've seen as much targeted to that audience.\n\n(Staking pools, who know all this already and make the bet anyway, are a different question.)",
        "created_at": "2022-04-03T20:31:41.840000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I've found just saying \"inactivity penalties are small but a slashing is forever\" tends to hold a lot of weight currently.  It will become less so as withdrawals get closer but the biggest penalty for slashing at the moment is having the remaining ETH locked and unproductive indefinitely.",
        "created_at": "2022-04-03T20:56:08.358000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "But the biggest challenge seems to be getting people to understand that there's a difference between inactivity penalty and slashing.  So often people think they're getting slashed when they miss an attestation.",
        "created_at": "2022-04-03T20:57:25.574000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "general",
        "parent": "",
        "content": "I'm wondering if there's some prior-work on how we ensure that EEs are building payloads that fit within the 10MiB limits for beacon gossip/RPC? I assume we'll need to define some max-size for EEs that's 10MiB minus the maximum size of the non-payload components of a `BeaconBlock`. \n\nReference for 10 MiB limit: https://github.com/ethereum/consensus-specs/blob/dev/specs/bellatrix/p2p-interface.md#configuration",
        "created_at": "2022-04-03T21:57:10.492000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdannyryan\u003e So the gas limit at 30M prevents it by about 5x",
        "created_at": "2022-04-03T22:40:29.482000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdannyryan\u003e So if it's valid and anywhere we expect gas to scale soonish, it is max 2mb and that's *all* gas as calldata at 30M",
        "created_at": "2022-04-03T22:41:20.126000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdannyryan\u003e If we get worried about this, we could instead define limits wrt gas limit but would have to on EL as well",
        "created_at": "2022-04-03T22:42:13.392000+00:00",
        "attachments": null
    }
]