[
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I didn't get your point. PoS has been announced before Mainnet launch back in 2014, it took us a while to get to a point where upgrade to PoS is nearly scheduled, and I don't see a world where miners securing the network without this process being profitable. Profit can be the only predictable reason why miners are securing the network, any other reasons, like good relationships in the past, are pretty much unlikely to take place, thus, taking any other reason into account would be unreliable.",
        "created_at": "2022-05-01T07:24:27.079000+00:00",
        "attachments": null
    },
    {
        "author": "juliantg",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I am not really a frequent reader of this channel, but I think a lot of discussion that does not lead to fruitful actions is about mining here. Maybe we should consider adding another channel to the merge section related to mining.",
        "created_at": "2022-05-01T08:09:17.613000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There isn't much R\u0026D w.r.t. mining anymore, so not sure a channel makes sense. Feel free to talk here about re-org attacks around the merge and the like, although note that many conversations have already been had (use Ctrl+F). Maybe someone has a write-up of design considerations that lead to the merge spec / engine api as it stands, such that it can be pinned and pointed to by others if the topic comes up (again).",
        "created_at": "2022-05-01T09:05:10.080000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Miners aren't as bad as the public thinks they are. No one would ever even think about being malicious, even when there's merge activating in an hour.",
        "created_at": "2022-05-01T09:36:49.901000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The only thing miners came the closest to, is a peaceful demonstration to point 51% of hashrate to a single mining pool. Which never happened FWIW.",
        "created_at": "2022-05-01T09:37:54.052000+00:00",
        "attachments": null
    },
    {
        "author": "gusto_m",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "small miners can sell hw after merge and can staking eth, big miners can be validators?",
        "created_at": "2022-05-01T09:43:16.933000+00:00",
        "attachments": null
    },
    {
        "author": "gusto_m",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "programmers can have more jobs in security of eth",
        "created_at": "2022-05-01T09:44:33.501000+00:00",
        "attachments": null
    },
    {
        "author": "gusto_m",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "i thing all can be happy after merge",
        "created_at": "2022-05-01T09:46:22.704000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Except for miners of a certain pool that staked their eth with ldo and thus can’t afford to payout its miners completely at merge 😅",
        "created_at": "2022-05-01T11:42:05.396000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The merge is in a weird place with regards to EIPs, because the consensus layer has its own change control and tracking process, and execution clients are getting fairly \"minor\" changes made.",
        "created_at": "2022-05-01T12:54:41.150000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There are a couple EIPs, but it doesn't cover the full spectrum of what is going into the merge.",
        "created_at": "2022-05-01T12:55:00.837000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminion",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This (first section) is probably the most comprehensive reference for all the changes: https://github.com/ethereum/pm/blob/master/Merge/mainnet-readiness.md",
        "created_at": "2022-05-01T14:05:14.983000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "See starting from “Merge Pre-History”: https://tim.mirror.xyz/CHQtTJb1NDxCK41JpULL-zAJe7YOtw-m4UDw6KDju6c",
        "created_at": "2022-05-01T15:01:04.298000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I’m mildly against this - we did it for 1559 and I think 90% of the volume wasn’t really useful and it distracted people from all the other channels. There are plenty of places outside this discord for people to debate things and I’d rather keep us as much on topic as possible.",
        "created_at": "2022-05-01T15:02:31.931000+00:00",
        "attachments": null
    },
    {
        "author": "syentist.",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yes and on the main chanels these posts add zero value besides fluffing some delusional parts of the mining community...if core devs are busy for moderating maybe appoint a discord manager who can delete out this junk?",
        "created_at": "2022-05-01T16:21:56.066000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I was more referring to why the first block with the TTD is chosen/fixed (no re-allowed iirc), why optimistic import of the transition block (EL not synced, CL synced) is not safe [0], and other design decisions of that sort. Some of it would probably require in-depth explanations, and not sure it makes sense to write that all up for a one-time event.\n\n[0] at least that's what Adrian said in https://discord.com/channels/595666850260713488/692062809701482577/967427596390371379 . I don't know the details either, but am curious 😉",
        "created_at": "2022-05-01T19:14:58.726000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Right, I think some of it are part of EIP-3675 security consideration sections, probably more in the annotated consensus specs, and then scattered in various threads. It's really hard to aggregate all this still in real time when it's constantly changing, and in practice the handful of people who _can_ do it are busy with other things 😅  If anyone does want to volunteer to help with this, we can certainly find funds to pay for their time!",
        "created_at": "2022-05-01T19:19:13.426000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Too late for that yes, maybe for Shanghai, but also a stop on that (until the merge actually occurs) afaik.",
        "created_at": "2022-05-01T19:45:34.129000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It will not be included in a difficulty bomb fork, I can guarantee you that much.",
        "created_at": "2022-05-01T19:50:01.097000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Kind of by definition I would say. If feature EIPs are included, it's not an difficulty-bomb-only fork anymore. Anyway, for discussions on the contents on the EIP (and the rationale of why repricing is warranted), maybe \u003c#706868829900505180\u003e is a better place than this channel.",
        "created_at": "2022-05-01T19:51:38.357000+00:00",
        "attachments": null
    }
]