[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I agree with the potential here, but the only known problem of optimistic sync is the fork poisoning attack and this particular attack does not benefit from this",
        "created_at": "2022-03-04T02:31:23.838000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "What worries me is a race condition between the EC delaying enough validation that when it comes back with VALID it's already late to attest and the next block might come back syncing",
        "created_at": "2022-03-04T02:35:01.137000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Personally I think that's something the EL should solve. It certainly shouldn't be a common scenario.",
        "created_at": "2022-03-04T02:36:33.193000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I'm not that sure how uncommon will be the situation of having to validate large blocks. And the spec it's quite strict here that we can't vote for the previous head if the EL returns that is syncing. I think this is a place were we can actually vote and be helpful since target matters as well as head. Either allowing to vote for the previous head or vote late for the right head at the time smell to me that should be considered...",
        "created_at": "2022-03-04T02:39:51.984000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "If the EL is unable to import large blocks quickly we'll need to reduce the size of blocks or improve the EL.  But it shouldn't be overly common to have blocks taking more than 4 seconds to import. And large blocks shouldn't trigger a syncing response when importing new blocks on the chain head. It might cause it when doing a reorg but they aren't overly common and a short reorg probably still shouldn't returning syncing.",
        "created_at": "2022-03-04T02:43:49.915000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I'm at a loss here. I would have expected a non-reply here while the block is validating. It doesn't take 4 seconds, on slot zero is not uncommon to get a block at second 2, and it's not so crazy to think of two seconds EL blocks. So this combination should happen at the order of days, not weeks. My interpretation of a non-reply might be wrong though, my reading is that we can't attest in this situation. If we could attest for the previous head that would be fine by me, attesting late is less optimal but also better than not attesting at all",
        "created_at": "2022-03-04T02:52:04.755000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "The CL must not optimistically import a block unless the EL explicitly replies EL, so a non-reply is not sufficient.  And I don't see why the EL would reply with SYNCING if it knew it was importing a block on the existing chain head (assuming it was previously in sync so has world state etc) - it has all the data required and knows the block is the new chain head so it should process the block immediately.",
        "created_at": "2022-03-04T02:56:06.221000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Yeah but a non reply implies that we may put the block in a queue for later processing. While technically this doesn't put us in an optimistic status, it's still a confusing point. My reading of this conversation is that Teku would attest for the previous head if the EL is still validating the execution payload at second 4",
        "created_at": "2022-03-04T03:00:51.166000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Which is fine and what I think we should all do, just that we have internal arguments about this",
        "created_at": "2022-03-04T03:01:38.720000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Right, so the confusion here isn't about when it's safe to attest but about what optimistically syncing means.  And the answer is that optimistic sync only ever happens when the EL explicitly returns `SYNCING`.  That's very important from a safety perspective as otherwise you may import the block with an incorrect execution payload block hash and it won't later be validated, potentially causing a chain split.",
        "created_at": "2022-03-04T03:03:02.134000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Alright I agree with this. Then with this perspective in mind it's true that only very rarely on short forks succeeded by probably a long block we should see SYNCING as reply to our head (assuming we were synced before), and then I also agree that probably it's better not to vote",
        "created_at": "2022-03-04T03:09:33.406000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Yep.  And I do think that ELs should be judged on how often they wind up having to reply `SYNCING`  to `forkChoiceUpdated` same as CL clients are judged on their attestation accuracy because it ultimately takes the CL \"offline\" and so will affect validator rewards. It's not the only consideration and there will be good reasons to do it but definitely a factor to be considered in designs and optimisations.",
        "created_at": "2022-03-04T03:18:10.099000+00:00",
        "attachments": null
    }
]