[
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Am seeing a few people post in our channels about what if the merge fails and yada yada. Is there going to be/has there already been a test of what happens when it fails and chain reverts to continuing to mine the PoW fork? I recall it being said that PoW continues and then merge tries to happen again later. Am talking to the news in a bit so figured I better brush up on my knowledge too.",
        "created_at": "2022-05-19T04:56:59.366000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "The PoW chain will stop at TTD. PoS takes over from there.  And the PoS chain progresses based on time so slots will continue regardless.  So basically the merge won't fail. If blocks aren't being produced post-merge then that's an issue to fix in the same way we would any other time blocks stopped being produced (ie work the problem, ship a fix). It's theoretically possible the fix would be to roll back to PoW but I doubt it as that would add a lot more complexity to the situation.",
        "created_at": "2022-05-19T05:02:21.648000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Thanks for clearing up my mistaken beliefs! (Dcol says thanks too)",
        "created_at": "2022-05-19T05:24:18.339000+00:00",
        "attachments": null
    },
    {
        "author": "hielcivis6021",
        "category": "general",
        "parent": "",
        "content": "Hello",
        "created_at": "2022-05-19T07:11:58.781000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "Will the eth1_follow_distance decreased post merge? would be great ux improvement for new validators 😇",
        "created_at": "2022-05-19T07:42:04.159000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Think it's in the \"tidy-ups\" bucket.  Which is a big bucket...",
        "created_at": "2022-05-19T07:42:36.235000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "what would the new distance be?",
        "created_at": "2022-05-19T07:44:25.324000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Anything in the blocks up to the last finalized epoch would be one way of doing it.  Not sure if it can be reduced further without introducing some risk (I haven't thought it through).",
        "created_at": "2022-05-19T07:46:02.868000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Deposit process definitely has a way to get improved post-Merge. Ideally, we'd have deposits processed next block. I see two potential ways here:\n1) CL clients learn how to build and verify merkle proofs linking each deposit to a `stateRoot` from the previous block\n2) CL clients use EL to read and verify deposits as a part of a block processing\n\nThese are rough ideas worth more thinking and justification.\n\nI am curious how significant the UX improvement would be if we just reduce eth1 follow distance considering that the voting period remains the same? We could probably reduce the follow distance to 1 block which would cut the time of deposit processing by half (to 7 hours from 14)",
        "created_at": "2022-05-19T08:49:11.044000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "\u003e I am curious how significant the UX improvement would be if we just reduce eth1 follow distance considering that the voting period remains the same? \nRight now, if you deposit, your deposit basically goes into a black hole, and users don't have any immediate confirmation that it will get accepted by the beaconchain for like 8hours -- so, faster feedback regarding deposits is the ux improvement i was thinking of",
        "created_at": "2022-05-19T08:52:36.496000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "There are various UIs that track it as \"pending\", no?",
        "created_at": "2022-05-19T08:55:50.200000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Depending on exactly where it is in the pipeline, it might even show estimated slot of activation.",
        "created_at": "2022-05-19T08:56:29.965000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I think that post-Merge having information that a block with deposit gets finalized is enough to say that it will be accepted by the beacon chain eventually. And it even should give pretty precise estimation of when it's going to happen (empty slots may add a little bit of noise here)",
        "created_at": "2022-05-19T09:23:36.322000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Would we need to vote any more?  I would assume that a deposits UX update would remove voting entirely, in place of a simple hardcoded follow distance.",
        "created_at": "2022-05-19T09:30:12.089000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "We would not but reducing distance to `1` does seem to me is about changing one config parameter, while removing the voting entirely would involve an implementation complexity. Probably, the follow distance reduction won't have desired impact on UX.",
        "created_at": "2022-05-19T09:37:53.702000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "I _think_ I read some developer here say they'd love to get rid of that voting logic, but don't remember for sure. Either way it has led to issues in the past.",
        "created_at": "2022-05-19T10:33:22.786000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "correct, those UIs just tell you to wait, because there is no on-chain confirmation yet",
        "created_at": "2022-05-19T10:33:23.845000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I was just about to say that. I’d love to get rid of voting and the delay. But I’d *really* love to get rid of having to go searching for events and just have the EL return deposit info when a block is imported somehow. Not sure that’s actually doable given optimistic sync but I’d jump through a lot of hoops to get rid of the eth1 tracking we have to do now - it’s crazy complex.",
        "created_at": "2022-05-19T10:43:27.698000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "the whole purpose to having the eth1  follow distance was to ensure that if there was a reorg that it would exceptionally unlikely to impact the deposit...  with the notion of finality in PoS.. we could (not specifically should) make that eth1 follow the last finalized epoch..",
        "created_at": "2022-05-19T11:21:53.294000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Good point! I think full deposit verification is the thing that we must have working during optimistic sync, otherwise, it's an attacking vector as adversary will be able to force someone to follow malicious chain where it controls more and more stake by making fake deposits. So, synchronous verification of `depositRoot` or synchronous deposit processing may not work.",
        "created_at": "2022-05-19T11:55:50.114000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "It can certainly be just 1 slot but you then ahve to make the eth1_data a validity condition on the block. which is fine. It's the least invasive way to fix it",
        "created_at": "2022-05-19T13:42:20.853000+00:00",
        "attachments": null
    },
    {
        "author": "dv8s",
        "category": "general",
        "parent": "",
        "content": "hi mainnet shadow fork 5 ttd should have been hit already? how did it go?",
        "created_at": "2022-05-19T14:34:54.040000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "Went fine",
        "created_at": "2022-05-19T14:37:04.781000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "~~Explorer went down though^^~~ Shows every slot without transactions",
        "created_at": "2022-05-19T14:37:12.806000+00:00",
        "attachments": null
    },
    {
        "author": "dv8s",
        "category": "general",
        "parent": "",
        "content": "great thanks",
        "created_at": "2022-05-19T14:38:08.405000+00:00",
        "attachments": null
    },
    {
        "author": "ethlost",
        "category": "general",
        "parent": "",
        "content": "Is there any reason for moving relatively slowly with the merge of testnets when shadow forks are going pretty smoothly now. If ropsten goes well shouldn't the next two forks happen a bit quicker as everything is looking better. If something breaks or isn't working that would leave more time to fix any issues or am I wrong here? Are the testnets so important that moving more aggressively isn't advisable?",
        "created_at": "2022-05-19T15:41:01.889000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Although, successful shadow forks is a decent prove that clients are ready for the mainnet merge, this is not the only testing efforts that are currently in progress. If by the time of the upgrade on Ropsten everyone we will be in a good place with testing, engineering and some other things then of course we may try to fork Goerly and Sepolia earlier that it has been discussed. But considering coordination efforts it may be infeasible to do.",
        "created_at": "2022-05-19T15:48:35.270000+00:00",
        "attachments": null
    },
    {
        "author": "ethlost",
        "category": "general",
        "parent": "",
        "content": "Ok makes sense. Thanks for clarifying",
        "created_at": "2022-05-19T15:52:36.653000+00:00",
        "attachments": null
    },
    {
        "author": "ethlost",
        "category": "general",
        "parent": "",
        "content": "If ropsten merge goes well what were the timelines discussed for Goerli and Sepolia?",
        "created_at": "2022-05-19T16:50:56.912000+00:00",
        "attachments": null
    },
    {
        "author": "flip3443",
        "category": "general",
        "parent": "",
        "content": "I read the estimate is 3 weeks between each.",
        "created_at": "2022-05-19T17:12:02.030000+00:00",
        "attachments": null
    },
    {
        "author": "ethlost",
        "category": "general",
        "parent": "",
        "content": "Thank you",
        "created_at": "2022-05-19T17:15:34.436000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "For Goerli (and Clique in general) will the current signers need to update their infra to run a beacon-chain alongside their EL, or will the signers halt once TTD is hit?  Or will they keep going and need to be manually shutdown so that anyone who didn't setup a merge-compatible goerli install doesn't keep running on \"goerli classic\"?",
        "created_at": "2022-05-19T18:47:07.912000+00:00",
        "attachments": null
    },
    {
        "author": "wwz0668",
        "category": "general",
        "parent": "",
        "content": "Hi, wondering how will execution layer handle reorgs after the Merge? Before the Merge, when reorg happens, there will be two blocks, same block height but different block hash, and only one of them will be canonical eventually. Will that be the same case post merge? For example, if beacon chain is like slot1 (proposed) -\u003e slot2 (forked) -\u003e slot3 (proposed), how will the corresponding eth1 blocks be?",
        "created_at": "2022-05-19T19:51:32.492000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "I feel like your premise is that subsequent canonical slots can have EL/eth1 blocks that don't build on one another",
        "created_at": "2022-05-19T20:01:10.248000+00:00",
        "attachments": null
    },
    {
        "author": "wwz0668",
        "category": "general",
        "parent": "",
        "content": "It'll be built on previous one, but just want to double check it'll still be continuous, which means the eth1 block of forked eth2 slot will be removed from canonical eventually. For the same example here,  slot1 (proposed) -\u003e slot2 (forked) -\u003e slot3 (proposed)\nwill the eth1 blocks be like\nslot1 (eth1  block_number=1) -\u003e forked slot2 (empty eth1 block) -\u003e slot3 (eth1 block_number=2)\nor\nslot1 (eth1 block_number=1) -\u003e forked slot2 (eth1 block_number=2) -\u003e slot3 (eth1 block_number=3)",
        "created_at": "2022-05-19T20:35:14.224000+00:00",
        "attachments": null
    }
]