[
    {
        "author": "ryg9705",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Is there an agreed TTL for the JWT token issued by the consensus client? The token doesn't include an expiry date/time, but execution engines seem to compare the \"issuedAt\" against the local time and some TTL threshold. I have picked up the minority client middleware from \u003c@206016661470314496\u003e and added more configuration options, http interface which pub/subs the json_rpc methods over their own request and response topics. I'm able to relay the raw http.Request from consensus client and http.Response from execution client but currently struggling that message delivery is not as fast as I had hoped. When  I connect erigon and teku via the middleware erigon responds with 403 \"stale token\".  If I leave the middleware out all is fine. Code is: https://github.com/timjp87/minority",
        "created_at": "2022-06-14T07:18:01.227000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "We use 5 seconds TTL",
        "created_at": "2022-06-14T07:20:58.348000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e - Required: `iat` (issued-at) claim. The EL **SHOULD** only accept `iat` timestamps which are within +-5 seconds from the current time\nFrom the spec",
        "created_at": "2022-06-14T07:21:16.200000+00:00",
        "attachments": null
    },
    {
        "author": "ryg9705",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Thanks. Somehow I missed that. Seems reasonable. I will see how I can speed up the delivery. Currently it seems a bit of a chicken \u0026 egg problem that the topic only exists once a message is published for the first time and the other side has not discovered it yet so tries to identify it at an interval from nsqlookupd. In the meantime the 5 seconds have passed.",
        "created_at": "2022-06-14T07:23:24.109000+00:00",
        "attachments": null
    }
]