[
    {
        "author": "abcoathup",
        "category": "general",
        "parent": "",
        "content": "Goerli testnet merge announcement: \nhttps://blog.ethereum.org/2022/07/27/goerli-prater-merge-announcement/",
        "created_at": "2022-07-28T05:20:15.077000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "Hey all, quick note as the latest Geth release introduced some confusion / behavioral change. If Geth is started in `snap` sync mode (the default), it will reject `NewPayload` payloads until sync completes. This is new behavior in the merge world, but it was always the way Geth worked in Eth1 (rejecting propagated blocks until sync completed). I.e. it was a bug that Geth didn't reject until now post-merge.\n\nThe reasoning behind this requirement is that snap sync does direct database insertions, skipping a lot of validations (like block execution). But if snap sync directly modifies the database and someone concurrently also starts adding stuff to it (block imports), then it will lead to a corrupted chain.\n\nThis can only happen if snap sync and block imports run concurrently, which means a newly joining node being fed block 1 directly, not via the syncer. In a merge setup, that can only happen for a chain that's already merged in genesis (i.e. none of the live networks) receiving a NewPayload with block #1.\n\nWhere this might affect some of you is tests: if you are running integration tests against Geth with genesis-merged test suites, there's a change you'll need to add `--syncmode=full` to the Geth startup params so it reverts it's behavior to the previous one, disabling this initial payload rejection logic.",
        "created_at": "2022-07-28T06:08:53.078000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "What does a reject look like in terms of the engine api? I’m a little unclear on how this wouldn’t affect a fully synced CL sending payloads to a geth that’s still part way through a snap sync.",
        "created_at": "2022-07-28T06:52:33.887000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "But how snap sync can complete if `NewPayload` is rejected? Didn't Engine API method calls mean to inform the sync process on the current head of the chain?",
        "created_at": "2022-07-28T08:13:40.821000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "Yeah, there's a difference between \"not incorporating locally\" and some sort of engine api failure. I would assume geth responds SYNCING as the engine api is defined. \u003c@206016661470314496\u003e is this correct?",
        "created_at": "2022-07-28T12:17:43.410000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "Yes",
        "created_at": "2022-07-28T12:21:36.488000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "And it adds the payload to the downloader? Otherwise, it won't be able to complete the sync process when the network goes 128 blocks beyond the merge transition",
        "created_at": "2022-07-28T12:23:32.810000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "yes",
        "created_at": "2022-07-28T12:25:18.891000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "Only the \"NewPayload\" will be rejected as SYNCING, doing a ForkchoiceUpdate is accepted and will be able to signal sync termination",
        "created_at": "2022-07-28T13:03:41.193000+00:00",
        "attachments": null
    }
]