[
    {
        "author": "polandia94",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The user of the ethereum is coinbase. People who staked on coinbase (or binance as i) are not user from a eth perspective",
        "created_at": "2022-09-19T02:17:58.382000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The harm to the person giving their money away is that they entity you are giving your money away to may not act in line with your interests with your money.",
        "created_at": "2022-09-19T03:02:03.435000+00:00",
        "attachments": null
    },
    {
        "author": "defi_occam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Thanks for the clarification. I'm wondering if we can devise a standard--let's  call it EIP X--for low friction transfers between liquid staking derivatives _at their unlock prices_. So for example, if Coinbase and Rocketpool both implement EIP X, then I should be able to send my cbETH to a smart contract and after some waiting period a little over 18 days withdraw rETH to my wallet. The conversion would happen at the unlock prices of the assets, not their market prices. Importantly, in the event of an exodus out of a liquid staking service, I wouldn't have to wait months to switch LSDs at their unlock prices. \n\nTaking a step back, I'm struck by the ease with which BTC miners can redirect their hashpower if the pool they're currently mining with starts misbehaving. If Ethereum is to be censorship resistant, users of ether LSDs should be able to do same with their ETH. The cost of switching LSDs in an exodus-type event should be non-onerous.",
        "created_at": "2022-09-19T14:59:34.292000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Whoever has the keys for staking *must* retain the ETH until they can withdraw.  This is necessary so the protocol can correctly penalize them for misbehavior after the fact.  If your assets were liquid, then you could attack the network and then quickly sell off your stake before the market noticed.",
        "created_at": "2022-09-19T15:14:49.159000+00:00",
        "attachments": null
    },
    {
        "author": "defi_occam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "That's where the part about \"waiting period a little over 18 days\" comes in (see above).  During this time, ETH that should be slashed can get slashed. The point of EIP X is to reduce/eliminate any *additional* wait, when it is known that the ETH being unstaked will be immediately restaked via a different LSD.",
        "created_at": "2022-09-19T15:25:18.176000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There is no \"additional wait\" in the system right now (other than lack of withdraws of course).  All of the waiting is very intentional.",
        "created_at": "2022-09-19T16:11:03.318000+00:00",
        "attachments": null
    },
    {
        "author": "polandia94",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "there isn't a unlock price of the assets in any point in the code. If coinbase want can airdrop cb-eth to all adresses and use a new system where 1000 cb-eth is 1 eth. And is a proxy contract, so cb-eth could be paused, or have a specific transaction fee, all of that would break that contract",
        "created_at": "2022-09-19T16:44:47.321000+00:00",
        "attachments": null
    },
    {
        "author": "monkeyontheloose.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "gm",
        "created_at": "2022-09-19T17:55:58.202000+00:00",
        "attachments": null
    },
    {
        "author": "monkeyontheloose.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "how does the block proposer market work?",
        "created_at": "2022-09-19T17:56:38.360000+00:00",
        "attachments": null
    },
    {
        "author": "monkeyontheloose.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "is there a centralized place where all the relays propose blocks to?",
        "created_at": "2022-09-19T17:57:26.940000+00:00",
        "attachments": null
    },
    {
        "author": "monkeyontheloose.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "do all the relays pay the miners via an additional txn?",
        "created_at": "2022-09-19T18:05:58.585000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "https://boost.flashbots.net/ answers most questions",
        "created_at": "2022-09-19T21:35:37.831000+00:00",
        "attachments": null
    }
]