[
    {
        "author": "undying1200",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Was there any decision made on how to prevent large drops in hashpower going into the merge? I know there were some solutions discussed here and the ACD channel, but my take away then was we were too far away to predict.\n\nAs we approach the merge now with the tapering off of new hashpower, combined with the now huge surplus of GPUs as miners have stopped buying and are now actively selling. Do we have enough information now to formulate a miner plan for the merge to insure network security and not becoming vulnerable to a 51% attack if hashrate drops precipitously just prior to the merge?",
        "created_at": "2022-04-29T07:30:18.876000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If hashpower drops significantly, we can adjust the terminal total difficulty to compensate.",
        "created_at": "2022-04-29T08:03:56.124000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I am not sure about miners actively selling, at least hash rate looks pretty stable https://etherscan.io/chart/hashrate",
        "created_at": "2022-04-29T08:07:39.485000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yeah I remember this being one of the solutions. But did it ever get put into an EIP? If not can it be added to the ice age extension to auto smooth difficulty for sudden drops over X period of time?",
        "created_at": "2022-04-29T08:07:45.922000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It is in the EIP-3675 already, also, there is `TERMINAL_BLOCK_HASH` override which will be used in case of attacks near the merge and accelerate the merge by picking up an exact terminal PoW block and start building a PoS chain on top of it",
        "created_at": "2022-04-29T08:08:49.400000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "All my farms I have for 6 years are now mining Chia. I know of other veterans who have already taken similar steps.",
        "created_at": "2022-04-29T08:09:02.591000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Moreover, TTD override has been tested in Goerly and Mainnet shadow forks to adjust the moment of merge, and it did work well",
        "created_at": "2022-04-29T08:09:41.027000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Look at Ebay, awash with GPU'S. I know I have been a harsh ASIC critic but if hashrate stays stable and GPUs are being taken offline, something is making up for it.",
        "created_at": "2022-04-29T08:10:28.677000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Ohh I will have to look at that one, missed it. So there is no risk then?",
        "created_at": "2022-04-29T08:11:23.281000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Here is a section in Security Considerations you may want to look at https://eips.ethereum.org/EIPS/eip-3675#terminal-pow-block-overriding",
        "created_at": "2022-04-29T08:12:12.282000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I would not say there is no risk at all, but these safe guards reduce probability and alleviates impact of such a risk",
        "created_at": "2022-04-29T08:14:30.753000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This is interesting. If there are tons of GPUs at sale, where this hashrate does come from? ASICs? 🤔 ASICs should stay till the very end and keep protecting the network from 51% attacks if they behave, can we assume that ASICs hashpower will be enough to keep an attack cost at a high level?",
        "created_at": "2022-04-29T08:17:00.322000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "ASICs have nothing to lose as zero hour approaches. In fact it could be argued all miners have nothing to lose. Remember what happened with ETC. In the end the ASICs got what they wanted after numerous 51% attacks, an ASIC friendly algo change, albeit with firmware update.",
        "created_at": "2022-04-29T08:19:51.862000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "But we digress to the discussions last year",
        "created_at": "2022-04-29T08:21:59.091000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I would assume that all GPUs that are at sale on Ebay or wherever else are still mining. I would also assume that the supply is much hither than demand, probably market will come to an equilibrium at some point but this will require some time and during this time these GPUs will be still securing the network. Not sure how strong these assumptions are",
        "created_at": "2022-04-29T08:36:07.752000+00:00",
        "attachments": null
    },
    {
        "author": "oniks1791",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Can you clarify this please? how are you mining chia with gpu?",
        "created_at": "2022-04-29T08:36:10.011000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Sorry, not with GPUs, with HDDs. Chia uses plotted space that stores proofs ahead of time, better known as POST..Proof Of Space and Time. My partners and I sold GPUs and converted to green mining (Chia) in Q1. 240 HDDs only use 2KW of power.",
        "created_at": "2022-04-29T08:42:45.804000+00:00",
        "attachments": null
    },
    {
        "author": "oniks1791",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Ok now make sense 😂",
        "created_at": "2022-04-29T08:43:25.649000+00:00",
        "attachments": null
    },
    {
        "author": "oniks1791",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If the cards are on ebay it doesn’t necessarily mean they aren’t mining right now. You can also be sure that if there is no gpu coin that is more profitable to dig than eth, everything and one \"small miner\" will remain on eth until the last second of the pow network.",
        "created_at": "2022-04-29T08:43:47.523000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yeah if prices fall low enough for cards then sure. But summer sucks for mining and small farmers. Most of the ones that came on during the winter will get smoked out",
        "created_at": "2022-04-29T08:45:31.135000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "They have no clue about air flow",
        "created_at": "2022-04-29T08:46:04.072000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Just a fun fact, a lot of asics are dropping off august when the dag goes 5+. There are some 6 and 7gb ones but I think 5 are the majority.\n\nI recall a side chain that would go on for a couple hundred blocks was discussed post-merge to avoid people switching off for the final blocks.",
        "created_at": "2022-04-29T13:06:17.785000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Interesting. We have been discussed a side chain approach and came to conclusion that there is no manageable way of keeping it sustainable and guaranteeing that nothing bad will happen",
        "created_at": "2022-04-29T13:45:46.952000+00:00",
        "attachments": null
    },
    {
        "author": "yokem55",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Is it a hard requirement that there be strict 1:1 matching between a consensus client and execution client? Or is it possible for a single consensus client to drive more then one execution client? Or can an execution client take validated blocks from more then one consensus client?",
        "created_at": "2022-04-29T16:59:37.047000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "no, yes, no [or at least, for the third, fcU conflicts are a problem]",
        "created_at": "2022-04-29T18:03:13.913000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "so it's a bit more nuanced than a one word answer ether way",
        "created_at": "2022-04-29T18:03:41.949000+00:00",
        "attachments": null
    },
    {
        "author": "highdensitydevices",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It is ironic role reversal that at the moment Ethereum finally needs the miners, we are now worried the miners have no reason to work with us. It is a shame we never tried to build a good business relationship with them and instead fought them on issues like EIP-1057 that was the only EIP they ever wanted or asked for.\n\nIf EIP-1559 was an example of what to expect when they lose income then I would not make any assumptions about a smooth merge when they have nothing to lose in a relationship that was always one sided. A relationship where they held up their part of the business relationship to keep the network secure only to be asked to take pay cuts as we became more successful. They were never expected to reap the rewards of success like everyone else did.",
        "created_at": "2022-04-29T20:29:11.366000+00:00",
        "attachments": null
    },
    {
        "author": "highdensitydevices",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hopefully going forward we will learn from our mistakes with the miners and come to respect stakers and the important role they play in securing the network. As a fellow staker and previous miner the time barriers to entry and notably exit are extremely low when staking versus mining. I am not all that confident we would keep stakers if we treat them like we did miners as they have no infrastructure or hardware to sell if they are not happy. Unhappy miners stuck with Ethereum all these years in a love hate relationship that would cost them too much to leave. With the click of the button the stakers could be gone in a flash, of course at a limited exit rate. There is much more competition for simple things like earning APR.",
        "created_at": "2022-04-29T21:21:22.133000+00:00",
        "attachments": null
    }
]