[
    {
        "author": "timbeiko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "That wouldn't be it, as it accrues on the beacon chain and not the execution layer. The one thing I can imagine is that a transcation from a flashbots bundle from a previous block got included in this block, and that part of the transaction fees are sent to the block producer via a smart contract call. I'm not quite sure how to verify that on the block explorer, though. Any thoughts \u003c@385978868131168259\u003e ?",
        "created_at": "2022-04-24T09:19:38.152000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think we'd like to see at least one without issues period 😄, and also make sure we have some explicit test coverage for the entire spec, which is something we're working on right now. For this shadow fork, we also want to make sure nodes are still healthy 1-2 weeks after and that new nodes can join the network easily",
        "created_at": "2022-04-24T09:21:42.639000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "And there is still quite a lot of work to be done in ensuring the community is actually ready to run the fork. All validators will need to not only update but upgrade their configuration and guides for this aren’t yet fully written. Then there’s all the other infrastructure providers involved. Some of that work has started but a lot can’t start until the dev teams have settled all the key UX changes for client software. Some can happen in parallel with test net forks too.",
        "created_at": "2022-04-24T09:24:21.069000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Best thing to do if you are a staker/node operator/infrastructure or tooling provider and you want to help the merge happen sooner is still to run Kiln (or join the mainnet shadow fork!), and make sure that your setup works as expected with an EL/CL combo 🔥 🧱",
        "created_at": "2022-04-24T09:26:10.548000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "does the shadow forks process new transactions on mainnet?",
        "created_at": "2022-04-24T09:39:55.815000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yes it keeps mirroring transactions on the canonical network (same for Goerli shadow forks)",
        "created_at": "2022-04-24T10:04:09.645000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Over time, more and more transactions become invalid (e.g. outdated dex swap), but they still land on chain as reverted tranactions",
        "created_at": "2022-04-24T10:04:42.739000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "https://github.com/ethereum/consensus-specs/pull/2875",
        "created_at": "2022-04-24T18:07:14.064000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "When it comes time I’ll tweet and Reddit it and hopefully we can have a hashtag for people to tweet to confirm their ready. Or maybe there can be a checklist on a website of major entities that haven’t confirmed and those who have? That way people can evacuate exchanges and others who don’t confirm.",
        "created_at": "2022-04-24T18:46:45.884000+00:00",
        "attachments": null
    }
]