[
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Regarding https://github.com/ethereum/beacon-APIs/pull/190, it feels like there's a fairly significant change in underlying principals going on that I'd like to check against other team's thinking. Currently Teku's \"primary\" chain head is the fully validated ancestor and we track the optimistic chain head separately. There are then only a few places that specifically ask for the optimistic chain head and everything else uses the fully validated ancestor.\n\nBut with the REST API changing to expose optimistic blocks, I'm thinking that we'll change that to only track the optimistic chain head which would then be the \"primary\" and essentially everything would use that as the chain head. We would just have specific handling to reject creating/publishing blocks, attestations or sync committee messages that reference an optimistically synced block.\n\nDoes this match with what other teams are thinking where our previous multiple heads approach is basically collapsing back down to essentially only caring about the optimistic chain head?",
        "created_at": "2022-02-21T01:13:22.284000+00:00",
        "attachments": null
    },
    {
        "author": "sdfgsdfg0",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "the faucet is not working, can somebody send me beacon chain tokens on Kintsugi",
        "created_at": "2022-02-21T04:24:49.466000+00:00",
        "attachments": null
    },
    {
        "author": "sdfgsdfg0",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "endpoint looks like it's succeeding but explorer shows no transactions",
        "created_at": "2022-02-21T04:25:32.621000+00:00",
        "attachments": null
    },
    {
        "author": "pk910",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "addr? and how much do you need?",
        "created_at": "2022-02-21T04:26:35.970000+00:00",
        "attachments": null
    },
    {
        "author": "pk910",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "*ping*",
        "created_at": "2022-02-21T04:31:28.810000+00:00",
        "attachments": null
    },
    {
        "author": "sdfgsdfg0",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "sending addie",
        "created_at": "2022-02-21T04:31:48.863000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "For prysm, it is flexible to support either mentioned option. Currently, we track head that could be optimistic, and validators, RPC, and p2p act accordingly to that",
        "created_at": "2022-02-21T04:57:11.560000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "As Terence said we haven't changed head logic to fork choice, so a call to get the canonical head will be agnostic to optimistic status. On the other hand we specifically don't track the fully validated head. Getting the last fully validated ancestor of the canonical head would be just an approximation that in fact may not be the validated head. I wonder what are the uses of keeping track of the fully validated head, since we haven't implemented it, perhaps we should but currently I can't seem to find a need/use for that",
        "created_at": "2022-02-21T10:53:42.405000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I don’t think there’s a need for tracking the validated head with the way the optimistic sync spec is going but originally nearly all operations were based on the fully validated head and the optimistic head was basically only used for sending forkChoiceUpdated to the EL. So it made sense to not update the nodes idea of the chain head until it was fully validated and just special case the places that needed the optimistic head.",
        "created_at": "2022-02-21T10:59:00.527000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yeah, so the optimistic head, on its own, still just isn't that useful for CLs",
        "created_at": "2022-02-21T11:04:09.119000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Per spec",
        "created_at": "2022-02-21T11:04:15.819000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yeah in fact I'll contradict \u003c@363800010518822915\u003e in something, with our current approach I think it would be a bit of refactoring if we are required to send the validated head, my first impression would be to send the fully validated ancestor of the current head, but that may not be correct. So I think if that PR doesn't pass we'd have to do two computations to keep both",
        "created_at": "2022-02-21T11:05:40.736000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I know some proposals are around to allow serving opt heads (190 above is one such example) or otherwise loosening restrictions, but unless the whole network is syncing at once, I'm not convinced it's worth the risk of, oops, got to mass-invalidate blocks across a network (because these pushes to make opt sync heads more acceptable between CLs only really matter if some large portion of CLs are in opt sync mode at once, and if so, what went wrong? is that really the best way to for the network to recover?) to let CLs sort-of-quasi-participate a bit earlier",
        "created_at": "2022-02-21T11:07:08.559000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Generically, this kind of optimization where the fast path is fast, but the not-fast-path is increasingly neither tested nor within the same order of magnitude of smoothness, seems questionable in a network part of the point of which is to be robust against motivated attackers.",
        "created_at": "2022-02-21T11:09:14.222000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Optimistic sync already introduced this fork choice poisoning attack, which simply didn't exist in the same way before, and requires potential user intervention in a way very little else in Eth2 does.",
        "created_at": "2022-02-21T11:12:55.212000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hello, I have a question on mergemock: how ancient should the assembled payload be before being discarded",
        "created_at": "2022-02-21T17:58:06.416000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "i imagine in regard to spec we should not keep them forever",
        "created_at": "2022-02-21T17:58:48.084000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "wait go-ethereum is never getting rid of them, is that normal?",
        "created_at": "2022-02-21T18:32:43.283000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "would it not be considered useless memory allocation at some point",
        "created_at": "2022-02-21T18:33:01.290000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "We maintain a queue of payloads and get rid of them once they are pushed out, don't know the size on top of my head rn",
        "created_at": "2022-02-21T19:16:24.740000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "mmmh, was looking at an older branch sorry about that",
        "created_at": "2022-02-21T19:23:11.377000+00:00",
        "attachments": null
    }
]