[
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Hello, I saw timbeikos tweet https://twitter.com/TimBeiko/status/1527077141979901952 where he said you guys wont delay merge if say 'opensea didnt get the memo'. This is a bit concering attitude when OpenSea was estimated to be on Jan 6th 22 a $13.3G (billion) project, and this tweet would  clearly affect other projects too like UniSwap and so on.\n\n I know you are eager to get PoS rolling, but I sincerely hope after your final blockchain version you will give these dapps some time to make sure everything working well on their side too, or it will result in a firesale...\n\nAs an example, this tiny if-statement change in RVN algofork resulted in 310M illegally minted/exploited coins via assets due to malicious dev work, but the consequence was quite hard to see from a simple commit.\nhttps://github.com/RavenProject/Ravencoin/commit/d23f862a6afc17092ae31b67d96bc2738fe917d2",
        "created_at": "2022-05-21T07:20:00.361000+00:00",
        "attachments": null
    },
    {
        "author": "slodkokwasny.",
        "category": "general",
        "parent": "",
        "content": "Surely such a big project took / will take the necessary steps to test their app just as Uniswap\u0026others did. The kiln testnet has been running for a while and there will be at least 10 weeks between Ropsten Merge \u003e Mainnet. I'm not sure if there is anything to be done about some projects. The core devs can't infiltrate OpenSea team and force them to test their app. It's their own duty as a 13 billion project. And after all, the Merge doesn't really affect smart contracts, so there shouldn't be any issues anyway.",
        "created_at": "2022-05-21T10:24:50.514000+00:00",
        "attachments": null
    },
    {
        "author": "catwith1hat",
        "category": "general",
        "parent": "",
        "content": "I do believe some opcodes change in semantics, post-merge, such as \"difficulty\", see EIP-4399. If smart contracts use that opcode and the semantics change, there might be a problem. Any large smart contract ecosystem should test on Kiln.",
        "created_at": "2022-05-21T10:34:17.057000+00:00",
        "attachments": null
    },
    {
        "author": "syentist.",
        "category": "general",
        "parent": "",
        "content": "The Kiln testnet has been up since mid March. If (big if) the merge happens in mid Aug, that's 5 months - 150 days - for dapps to do their testing. That is the opposite of rushing. At this point, if any major dapp has not tested or prepared for the merge, you should take it up with them, not sabotage the entire Ethereum upgrades roadmap with further delays.",
        "created_at": "2022-05-21T12:44:36.726000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Given how many exchanges went down when open eth node had an issue during a fork I doubt it. Participation by dapps and exchanges in testnets is usually minimal to non existent. Plus you can’t really fully test when the spec is still changing and the nodes themselves aren’t finalized. I do hope everyone joins in by the final testnet.",
        "created_at": "2022-05-21T13:00:03.285000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "One of the reasons to migrate all of the testnets is that it pretty much forces everyone to test.  As long as production dapps are present on at least one of the testnets they will get a run-out.",
        "created_at": "2022-05-21T13:05:05.205000+00:00",
        "attachments": null
    }
]