[
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "it's possible to stake in any place with an internet connection, but mining relies on big industrial power connections, all done by registered companies. the time of hobby miners mattering is long gone. it's not possible to hide. PoW is infinitely more suspectible to governmental regulations.",
        "created_at": "2022-06-11T01:15:24.294000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Most eth mining is hobby miners at home actually it’s bitcoin that’s commercial. 90%+ of our hashrate is what I had in my house or smaller. As we’re 5% that works out to around 1 million eth miners.",
        "created_at": "2022-06-11T01:47:01.345000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "PoS switch plan definitely discouraged long term investment so ethereum PoW being more decentralized than bitcoin's definitely makes sense",
        "created_at": "2022-06-11T02:02:23.839000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "A majority client bug in PoS can result in reaching finality under the wrong set of rules.",
        "created_at": "2022-06-11T02:39:50.002000+00:00",
        "attachments": null
    },
    {
        "author": "dcposch",
        "category": "general",
        "parent": "",
        "content": "To expand on what \u003c@301186049323958275\u003e said, client diversity becomes more important post-merge because PoS has stronger finality than PoW.\n\nStrong finality is a plus, but it does make accidental forks (say, due to client bugs) more dangerous.\n\nFor a historical example, I recommend reading about Bitcoin's 2013 hard fork. They had (and still have) no client diversity at all; the entire network ran bitcoind, which had a bug.  The recovery ultimately reorg'd about 4 hours worth of chain history.\n\nWe won't necessarily have that privilege going forward. A finalized chain effectively cannot be reorged (good!). So we avoid getting into that situation in the first place by ensuring that no client implementation has too much stake.",
        "created_at": "2022-06-11T03:33:54.363000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "thats plain wrong. hobbyists cant compete with bitcoin ASICs with their gpus since like 2012, while gpus are still profitable on ETH due to different mining algorithm. there was even plans to move ETH to a progpow (gpu miner focused) variant some time ago; 2019-2020 iirc",
        "created_at": "2022-06-11T06:43:43.181000+00:00",
        "attachments": null
    },
    {
        "author": "thiago_crowdtainer",
        "category": "general",
        "parent": "",
        "content": "Asking specifically about the execution layer:  how is this different in PoW? if today, geth had a bug in the EVM and we discovered it 3 weeks later, it’s the same situation no? Or are you saying the “damage” would be bigger with PoS?",
        "created_at": "2022-06-11T06:53:30.867000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It is *also* a problem under Proof of Work, but at least under Proof of Work.  I will defer to others to describe in more detail exactly *why* it is worse under Proof of Stake, I always forget (but I remember there is a reason!)",
        "created_at": "2022-06-11T07:03:10.499000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "It's worse for validators - if they wind up attesting to the invalid chain after it justified they can't return to the correct chain without creating a surround vote which is slashable.  Ultimately a very large amount of the staked ETH is going to be either slashed or leaked through inactivity penalities to get the chain back to finalizing.",
        "created_at": "2022-06-11T07:05:07.214000+00:00",
        "attachments": null
    },
    {
        "author": "thiago_crowdtainer",
        "category": "general",
        "parent": "",
        "content": "It seems to me if the bug in EL is “bad enough”, in both systems social coordination would be required to do some sort of hardfork, where in PoS not only the fix is needed, but also revert the slashings themselves, which could prove way more complicated - would this be the “extra” burden maybe (in PoS)?",
        "created_at": "2022-06-11T07:06:07.248000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "From a user point of view I'm not sure it's really any different.  If your node follows the invalid chain you may make decisions based on bad data.  And then when you switch back to the correct chain, you'll wind up with a multi-hundred, possibly multi-thousand block re-org.\n\nOf course, the same is true in PoW - if your node follows an invalid chain you're going to have to re-org back to the correct chain.  The only real difference is that with PoW you might automatically re-org back if the correct chain winds up with higher difficulty whereas in PoS you'll have to manually intervene to get back onto the correct chain.",
        "created_at": "2022-06-11T07:07:11.085000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "There are a lot of people who are very strongly against any bail outs for validators who fail to do their job properly and wind up attesting to an invalid chain. I would argue the security of PoS depends on them not being bailed out, otherwise there's no incentive for them to properly validate the chain.",
        "created_at": "2022-06-11T07:08:11.561000+00:00",
        "attachments": null
    },
    {
        "author": "thiago_crowdtainer",
        "category": "general",
        "parent": "",
        "content": "Yeah but it’s similar in PoW right? If people decide for one fork against another, those who have mined in the different fork are essentially “slashed” by having their work not rewarded in the other chain. \nSo for all practical purposes, unless I’m missing something, we do not add any further trust assumptions *at the execution layer* part of the code, with the transition to PoS.",
        "created_at": "2022-06-11T07:11:18.700000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "No. Miners simply don't receive rewards, they don't have anything at stake to be slashed.",
        "created_at": "2022-06-11T07:11:48.706000+00:00",
        "attachments": null
    },
    {
        "author": "thiago_crowdtainer",
        "category": "general",
        "parent": "",
        "content": "I know, what I mean by “slash” there is that they spent electricity yet didn’t get any rewards for it",
        "created_at": "2022-06-11T07:12:27.707000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "That's not going to be anywhere near equivalent to the penalty for validators.  Many will lose the full 32ETH.",
        "created_at": "2022-06-11T07:13:06.426000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Slashing a miner would be the equivalent of destroying their mining rigs.",
        "created_at": "2022-06-11T07:13:35.611000+00:00",
        "attachments": null
    },
    {
        "author": "thiago_crowdtainer",
        "category": "general",
        "parent": "",
        "content": "I see. So the argument goes that since the “slashing” is higher in PoS, we have way more incentives to avoid hard forks than today. OTOH it becomes a bit of speculation since in the event of contentious PoW fork , the value drop of eth itself could make up for the difference between both situations, though this applies additively to PoS slashings (if we consider the hardfork doesn’t make validators whole).",
        "created_at": "2022-06-11T07:17:11.360000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I don't think this really has any relation to hard forks (aka network upgrades). The discussion here is about avoiding chain splits (aka consensus failures). The incentive to avoid them has always been strong and continues to be because of the impacts it has on users.  Miners and validators are just paid to provide a service - they aren't the point of the network and we're not overly concerned if they lose money because they do that job badly.",
        "created_at": "2022-06-11T07:19:17.842000+00:00",
        "attachments": null
    },
    {
        "author": "thiago_crowdtainer",
        "category": "general",
        "parent": "",
        "content": "I think the bottom line I’d take is that under PoS, people (specially client devs) are more afraid of chain splits than in PoW , because of the extra damage potentially caused by slashings ; would you agree with this sentiment?",
        "created_at": "2022-06-11T07:20:34.580000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "This is only true in the case that an invalid chain is finalized.  Other chain split situations will have much lower impact, because they won't be finalized.\n\nThink there was something like this with EIP-1559 went live, with one (minority) client ending up building a different chain because it encoded a field incorrectly or something.  It would be the same level of issue with PoS as PoW in situations like that.",
        "created_at": "2022-06-11T07:27:45.229000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "in PoW this minority client would just need to update their shit to join the main chain, which would be unaffected",
        "created_at": "2022-06-11T07:28:41.034000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Which would be the same situation for PoS.",
        "created_at": "2022-06-11T07:30:01.845000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Well if the minority client is staking and so on there would be a bit more happenings",
        "created_at": "2022-06-11T07:31:29.811000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Not that I can see (unless you are talking about attestation penalties).  Care to expand?",
        "created_at": "2022-06-11T07:33:05.930000+00:00",
        "attachments": null
    },
    {
        "author": "thiago_crowdtainer",
        "category": "general",
        "parent": "",
        "content": "Thinking about trade-offs: \n\nIf we’d go ahead with the merge say in a week (and have only geth+4 CLs), problems in geth would cause big headaches because it would require some sort of contentious hardfork (though this is kind of already the case today, though potentially made worse by slashings, though I see this is a bit subjective)\n\nOther option, waiting 3+ months and proceeding only when all new EL clients feel “confident”: has the theoretical upside that bugs on one EL would be fine because the network “resolves the situation automatically” due the diversity of clients.\nA potential downside of the later option, is that we pay the price of waiting for all new EL to become “confident” for the merge, but then it turns out people still run majority geth because of worry of new software nature of the newer EL’s.",
        "created_at": "2022-06-11T07:35:59.425000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think the TL;DR is that if you are running a validator, it is *strongly* in your best interest to not run a majority client pair, because it could result in you losing a large amount (possibly all) of your stake if there is a bug in your majority client that gets finalized.",
        "created_at": "2022-06-11T07:38:01.267000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If you are a user, and you see/believe that some client is a majority client in the validator set, you want to make sure you *don't* run that client so that you can be more confident in finality not getting rolled back.",
        "created_at": "2022-06-11T07:38:56.761000+00:00",
        "attachments": null
    },
    {
        "author": "thiago_crowdtainer",
        "category": "general",
        "parent": "",
        "content": "OTOH, if I run a minority client, and that happens to have a bug (understandable since it’s not as mature as geth) , I’d also be “slashed” (but to a lower degree), correct?",
        "created_at": "2022-06-11T07:39:14.004000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If there is no majority client validator, then users can be more confident in finality regardless of their client pair, because the validators won't reach finality due to a bug in one client.",
        "created_at": "2022-06-11T07:39:39.682000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "You won't be able to reach finality, so you will just inactivity leak for a while I believe (someone else may be able to answer more confidently).",
        "created_at": "2022-06-11T07:40:15.169000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "IIUC, the penalties for a minority client with a bug forking off are *far* lower than a majority client forking off because the minority client will not finalize an invalid chain anytime soon (takes about 20 days before it starts to finalize the fork chain I think).",
        "created_at": "2022-06-11T07:40:47.561000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "correct, there is no new justified checkpoint on the minority chain to attest to, so you can freely move to the majority/finalized chain again",
        "created_at": "2022-06-11T07:41:13.731000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Their chain won't finalize, because they don't have enough validating weight on it.",
        "created_at": "2022-06-11T07:43:08.487000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "There is definitely an issue of comfort levels here, but then there is a fair bit of time before the merge for stakers to get comfortable with a minority client.  They should really be doing this now.",
        "created_at": "2022-06-11T07:44:15.893000+00:00",
        "attachments": null
    },
    {
        "author": "thiago_crowdtainer",
        "category": "general",
        "parent": "",
        "content": "Very interesting. I feel not enough people know about this. Inactivity leak if I recall ain’t as bad as slashing, but it’s still quite a bit of financial loss. I’d be interested if anyone has resources showing some numbers",
        "created_at": "2022-06-11T07:50:27.839000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Inactivity leak will take you down to 16.75 ETH over a period of around 3 weeks.",
        "created_at": "2022-06-11T07:50:58.271000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "At an increasing rate, right?",
        "created_at": "2022-06-11T07:51:18.361000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "So the first day is almost no loss, while the last day is pretty significant.",
        "created_at": "2022-06-11T07:51:29.479000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Yep",
        "created_at": "2022-06-11T07:52:43.092000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2022-06-11T07:52:55.791000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "leak.png",
                "content": "5b93ce1fa6a4fb984da139f6cf5575e45acf23581ffb292de58829d1b8fee7a7"
            }
        ]
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "We should reach 5gb DAG sometime in august, which will probably decrease the hashrate by \u003e10%, but we can only guess. Maybe TTD should be set after the DAG increase otherwise we might have to wait longer if the hashrate drops a lot. Please correct me if i am wrong 🙂",
        "created_at": "2022-06-11T09:34:29.063000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "The chain adjust to hash rate pretty quickly, so it has little impact on the number of blocks over a longer period of time.",
        "created_at": "2022-06-11T09:36:03.236000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It has a significant impact on the total difficulty though.",
        "created_at": "2022-06-11T09:36:16.654000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "True, sorry mis-read the question.",
        "created_at": "2022-06-11T09:36:37.218000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think now is too soon to spend too much time thinking about this problem though.  When we get closer to time it may or may not matter depending on whether The Merge is before or after the 5GB DAG threshold.",
        "created_at": "2022-06-11T09:36:47.726000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "(Was still in difficulty bomb mode)",
        "created_at": "2022-06-11T09:36:49.377000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "september* according to\n\u003chttps://minerstat.com/dag-size-calculator\u003e",
        "created_at": "2022-06-11T09:40:20.377000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "unknown.png",
                "content": "6e00894cb61fdbeb7b8c4c69c54f1a97bc7d88565df114e44585524a09417d1a"
            }
        ]
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "idk they say both, someone needs to run the numbers 😛",
        "created_at": "2022-06-11T09:46:22.242000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "unknown.png",
                "content": "2f775375f189353954ddc5065dd28f712525346628c49c088b84380ade199a7e"
            }
        ]
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I don’t think it’s a huge concern if we need to reduce the TTD with an override anyway. We’ve been aware that may be required anyway.",
        "created_at": "2022-06-11T09:46:40.311000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "And honestly it would make sense to prep people with the initial merge timing announcement to stay tuned for potential adjustments anyway.",
        "created_at": "2022-06-11T09:47:53.089000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "idk, sounds like an additional coordination task, and additional risk of having lower participation rate",
        "created_at": "2022-06-11T09:48:42.353000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "If we can get it right the first time that’s great but I wouldn’t push back the merge to try and account for this. We have the tools required to deal with large drops in hash rate and that’s a possibility even without the dag increase.",
        "created_at": "2022-06-11T09:49:42.127000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "it only pushes back the merge if the merge happens before august though , which seems unlikely, no?",
        "created_at": "2022-06-11T09:50:25.257000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "If we pick the TTD before august. We’ll see what the timings are like but I’d hope we’d be ahead of that.",
        "created_at": "2022-06-11T09:51:01.322000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "shouldn't clients then just launch with a random TTD and force people to set it?",
        "created_at": "2022-06-11T09:53:02.322000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "In an ideal world, we don't need to override.  However, all users should be *prepared* to do an override.",
        "created_at": "2022-06-11T09:53:52.611000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I don’t think we need to make trouble for ourselves…",
        "created_at": "2022-06-11T09:54:15.907000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "So we do our best to embed what we think will be a correct TTD in all of the clients, and if that ends up being very wrong users are (hopefully) prepared to override.",
        "created_at": "2022-06-11T09:54:21.068000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "at what point do we consider overriding the TTD? if the ttd is \u003e x weeks?",
        "created_at": "2022-06-11T09:54:53.255000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "When the time to TTD is greater than the time to ACD reaching a decision. 😂",
        "created_at": "2022-06-11T09:55:40.112000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "It may be that if there’s no threat we just let it run even if it’s longer than we’d like. Hard to say when talking entirely about theoreticals.",
        "created_at": "2022-06-11T09:56:44.970000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "😂  I mean even if there is a new TTD, how long do you give people time to set it? i believe we'll be better off (UX and time wise) if it's set after dag increase",
        "created_at": "2022-06-11T09:58:30.576000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "My guess is at least weeks.",
        "created_at": "2022-06-11T09:58:52.715000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "But as Adrian indicated, it depends on many factors that we don't know yet.  For example, if miners are actively attacking the network then we may go for much shorter.",
        "created_at": "2022-06-11T09:59:17.110000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "TTD set pre dag incraese = acd decision + time for people to set\n\nTTD set after dag increase = 2-3 weeks",
        "created_at": "2022-06-11T09:59:34.581000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "We’ve made emergency changes with just days notice before (cancelling Constantinople). I can’t see us needing to do that but we could if there was a threat.",
        "created_at": "2022-06-11T09:59:47.416000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "We just need to see when we’re ready to set a ttd and how that relates to the dag change. Then we can make the call.",
        "created_at": "2022-06-11T10:00:23.993000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "both are safe. it's a timing and UX question",
        "created_at": "2022-06-11T10:33:27.271000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "is there a link or a summary somewhere on the implications re the 5gb DAG? thx",
        "created_at": "2022-06-11T11:04:51.249000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "net impact is that it is reasonable to be concerned that significant hash power would drop off around then.. yes ?",
        "created_at": "2022-06-11T12:09:10.960000+00:00",
        "attachments": null
    },
    {
        "author": "enriavil1",
        "category": "general",
        "parent": "",
        "content": "Hello I am  from the erigon team, and I am confused about something here. https://github.com/ethereum/execution-apis/pull/200  If we get asked for finalized block before the merge then do we respond with the latest blockNum-128 or do we return an error?",
        "created_at": "2022-06-11T12:17:50.520000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "Geth will return  `nil` if we don't have a finalized block",
        "created_at": "2022-06-11T12:58:03.480000+00:00",
        "attachments": null
    },
    {
        "author": "enriavil1",
        "category": "general",
        "parent": "",
        "content": "so if not in POW geth is returning nil?",
        "created_at": "2022-06-11T15:57:21.890000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "In PoW geth will always return nil, yes",
        "created_at": "2022-06-11T16:05:41.352000+00:00",
        "attachments": null
    },
    {
        "author": "toad_apestrong",
        "category": "general",
        "parent": "",
        "content": "gm",
        "created_at": "2022-06-11T16:51:14.528000+00:00",
        "attachments": null
    }
]