[
    {
        "author": "paulhauner",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "In early testnets, I recall geth rejecting payloads where the `suggested_fee_recipient` (or w/e it was called then) was the zero-address. Geth didn't like the coinbase being the zero-address. I'm wondering if there are still some \"illegal\" recipient addresses still?",
        "created_at": "2022-01-31T03:57:32.007000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "FWIW, if EL hadn't received `fcU` with `payloadAttributes` which induced a payload build process then `getPayload` would error in response. It looks like `prepare` API call must be called, otherwise, block proposal fails",
        "created_at": "2022-01-31T06:45:12.528000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "CL won't vote if a block isn't fully validated yet. From this standpoint it's an optimisation, i.e. you're optimising CL for faster resolution of \"not yet validated\" status. And in some circumstances this optimisation is valuable e.g. when EL responses with `SYNCING` and needs to execute a couple of blocks that are `VALID` which is doable in a sub slot time interval.",
        "created_at": "2022-01-31T06:49:25.977000+00:00",
        "attachments": null
    },
    {
        "author": "sauliusgrigaitis",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Thanks Mikhail, I think I just interpret the specification slightly different. \"A validator should create and broadcast the attestation to the associated attestation subnet when either (a) the validator _has received a valid block_ from the expected block proposer for the assigned slot...\" - in my understanding this is the moment when EL validates the payload. So in my understanding, in order to implement this spec there should be a way to immediately inform CL that when EL validates the payload (in case of `SYNCING`). Otherwise we have a case where in fact the node _has received a valid block_ and EL knows about it, howerever, CL doesn't know about it. \n\nBut I hear you, it seems that the general idea is that this is just too small detail in the big picture.",
        "created_at": "2022-01-31T10:06:45.130000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Please, meet Kiln specification -- a lean meta-spec for a pre-production sprint of the Merge https://hackmd.io/@n0ble/kiln-spec. Happy coding!\n\nNote that Engine API Auth is expected to be merged soon and will be included in the updated version of the Kiln spec.",
        "created_at": "2022-01-31T14:36:47.663000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Put the lighthouse donation address 😛 ?",
        "created_at": "2022-01-31T19:03:00.742000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It'd be quite useful to have this default to 0x01 credentials unless overridden. There may be a situation where multiple validators with different 0x01 credentials are run towards the same CL. Maybe suggested fee recipient if no 0x01, flag to always use suggested, and default behavior to use suggested for 0x00 and the withdrawal eth address for 0x01",
        "created_at": "2022-01-31T20:57:32.049000+00:00",
        "attachments": null
    }
]