[
    {
        "author": "0x1984",
        "category": "general",
        "parent": "",
        "content": "Considering trade liquidity from Lido \u0026 other top staking services are the ONLY choice for most users before withdraw is enabled, staking concentration can only get worse day by day. ETH Foundation better considers Withdrawals as the central feature included in Shanghai Update, and only adds other features provided they do not delay Shanghai Update release",
        "created_at": "2022-09-18T01:00:40.722000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "The EF does not decide what goes into upgrades. This is a complex conversation amongst client devs, spec writers, community members, stakers (!), and more",
        "created_at": "2022-09-18T01:04:30.448000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "I think only 10% of eth is staked and the common user isn’t staking or uses a staking service with 1-1 tokenization. Given that most tokenized eth is only 1% below value now there isn’t really a great need for withdrawals. They’d be nice but you realize they won’t even be instant for most it’ll be months after enabling before they get their eth anyway.\n\nThat being said withdrawals would be nice to help reduce the incentive for using centralized services.",
        "created_at": "2022-09-18T02:10:08.180000+00:00",
        "attachments": null
    },
    {
        "author": "codeknight",
        "category": "general",
        "parent": "",
        "content": "I think its just as likely that withdrawals supercharge services like Lido by providing reliable pricing.",
        "created_at": "2022-09-18T02:58:21.759000+00:00",
        "attachments": null
    },
    {
        "author": "codeknight",
        "category": "general",
        "parent": "",
        "content": "It is inevitable that one staking derivative takes over most of the market, and right now the lockup time is the only thing holding people back from just shoving all their Eth into them.",
        "created_at": "2022-09-18T02:59:01.880000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "source?",
        "created_at": "2022-09-18T05:12:26.145000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "You realize it’ll still be multi month delays between starting withdrawal and receiving it?",
        "created_at": "2022-09-18T08:18:23.341000+00:00",
        "attachments": null
    },
    {
        "author": "sambacha",
        "category": "general",
        "parent": "",
        "content": "I think this is lost on alot of people too",
        "created_at": "2022-09-18T11:32:36.264000+00:00",
        "attachments": null
    },
    {
        "author": "sambacha",
        "category": "general",
        "parent": "",
        "content": "It will be a queue that will make the Queens queue look small in comparison",
        "created_at": "2022-09-18T11:33:02.725000+00:00",
        "attachments": null
    },
    {
        "author": "sambacha",
        "category": "general",
        "parent": "",
        "content": "yes",
        "created_at": "2022-09-18T11:35:36.251000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "Lido has a fee, it doesn't make sense if you can solo stake and  withdrawals are enabled.\n\u003emulti month delays\nNo. Last I calculated it's 43k eth per day. It may go up by then. Iirc it's min(validators//2^16, 4) per epoch",
        "created_at": "2022-09-18T11:52:30.486000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminion",
        "category": "general",
        "parent": "",
        "content": "Max, not min. But yes.",
        "created_at": "2022-09-18T11:55:04.549000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "Uh, right, lol",
        "created_at": "2022-09-18T11:55:20.168000+00:00",
        "attachments": null
    },
    {
        "author": "0x1984",
        "category": "general",
        "parent": "",
        "content": "if withdraw is allowed, then liquidity market no longer matters as ppl can withdraw freely. By that time, ppl will be happy to stake with small validators",
        "created_at": "2022-09-18T13:27:19.551000+00:00",
        "attachments": null
    },
    {
        "author": "0x1984",
        "category": "general",
        "parent": "",
        "content": "I guess the queue is to enforce stability. But in a normal market, there are ppl staking and withdrawing then the queue will be short",
        "created_at": "2022-09-18T13:28:46.927000+00:00",
        "attachments": null
    },
    {
        "author": "defi_occam",
        "category": "general",
        "parent": "",
        "content": "But if a large staking service starts censoring transactions and many stakers decide, all at once, to unstake from that service and restake with other services, the queue will get long.  \n\nWould be nice if there was a way to skip the queue entirely if one was simply restaking with another service. This would increase censorship resistance without compromising stability. Has anyone done any work on an EIP in this direction? Is it even possible?",
        "created_at": "2022-09-18T15:59:53.290000+00:00",
        "attachments": null
    },
    {
        "author": "defi_occam",
        "category": "general",
        "parent": "",
        "content": "POW miners can simply redirect their hashpower to a different pool if the one they currently use starts to censor transactions. POS stakers shouldn't have to incur multiple months of lost income to do the same with their ETH.",
        "created_at": "2022-09-18T16:07:20+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "The security of the network takes precedence over individual profits. And for security of the network, the churn cannot be too high.\n\nHow easy it is to change providers depends on the staking services. There are those where you provide (or even handle) the validator keys, and then it's easy. Going from one (centralized) pool to another is tougher, mostly when it's an exodus. That's just a risk you take with those centralized providers I would say.",
        "created_at": "2022-09-18T16:15:31.390000+00:00",
        "attachments": null
    },
    {
        "author": "defi_occam",
        "category": "general",
        "parent": "",
        "content": "My point is we should make it as easy as possible for stakers to move their ETH from one staking service to another so as to penalize staking services for bad behavior. Stakers are unlikely to take such (responsible) action if the cost to do so is onerous.",
        "created_at": "2022-09-18T16:32:07.190000+00:00",
        "attachments": null
    },
    {
        "author": "0x1984",
        "category": "general",
        "parent": "",
        "content": "Restaking got to be an unlimited choice",
        "created_at": "2022-09-18T16:34:23.148000+00:00",
        "attachments": null
    },
    {
        "author": "0x1984",
        "category": "general",
        "parent": "",
        "content": "There are multiple chains offering restaking for quite a few years already. ETH can simply copy their pages and run with it. The key is shortest time to allow unstaking. Can be a day or a week, both for chun and fraud detection",
        "created_at": "2022-09-18T16:37:56.553000+00:00",
        "attachments": null
    },
    {
        "author": "0x1984",
        "category": "general",
        "parent": "",
        "content": "All restaking takes are one API",
        "created_at": "2022-09-18T16:39:18.246000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "My point is security of the chain comes first, convenience second. If you can provide unlimited churn without affecting the security of the network, do elaborate.",
        "created_at": "2022-09-18T17:15:09.556000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "Ethereum doesn't have delegated staking enshrined at the protocol level if that's what you're referring to. It's also not a simple copy paste, which should be rather obvious if you know how various (D)PoS systems out there differ.",
        "created_at": "2022-09-18T17:17:47.287000+00:00",
        "attachments": null
    },
    {
        "author": "sambacha",
        "category": "general",
        "parent": "",
        "content": "Why withdraw to begin with",
        "created_at": "2022-09-18T17:53:03.960000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Users shouldn't be doing custodial staking.  It is unhealthy for the network, and the returns are low.  I don't think we should be making things *easier* for those people.",
        "created_at": "2022-09-18T18:20:35.789000+00:00",
        "attachments": null
    },
    {
        "author": "defi_occam",
        "category": "general",
        "parent": "",
        "content": "I read that there's an 18 day waiting period to ensure that the stake of misbehaving validators can be appropriately slashed. I'm not looking to mess with that. Rather I'm talking about the additional time a restaker would need to wait in a queue in the event of an exodus. If the user plans to immediately restake, it seems counterproductive to make him wait in this queue.",
        "created_at": "2022-09-18T19:21:08.746000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "the best way to reduce custodial staking is to allow withdrawals.",
        "created_at": "2022-09-18T19:29:26.382000+00:00",
        "attachments": null
    },
    {
        "author": "codeknight",
        "category": "general",
        "parent": "",
        "content": "Liquidity markets still matter because people will want their stEth to lend out or borrow money against.",
        "created_at": "2022-09-18T19:43:09.356000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "Again, if it's is a validator (32 ETH entity), they should have access to their validator keys and can easily move without withdrawing/redepositing. If they are delegating some small amount of ETH, then no such luck. Then they are not in control of validator keys, and as far as the protocol is concerned there is no way of telling whose ETH is whose (is that English?)",
        "created_at": "2022-09-18T19:44:19.171000+00:00",
        "attachments": null
    },
    {
        "author": "0x1984",
        "category": "general",
        "parent": "",
        "content": "Agree. But most people investing in ETH could not care too much. Except you can point out what would harm themselves(not the chain), they will be happy to delegate",
        "created_at": "2022-09-18T22:04:20.954000+00:00",
        "attachments": null
    }
]