[
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Wait a json rpc failure is meant to mean invalid and not unknown? (Teku was incorrectly going to optimistic sync for failures instead of treating it as unknown status as the expected behaviour changed/was clarified and we hadn’t deployed an update).  \nHaving rpc errors potentially mean invalid seems very confusing as there’s a ton of reasons we could get an rpc error. If we’re meant to treat it as invalid we should just get an invalid response. An rpc error should just be when it can’t be processed (eg can’t parse request at all)",
        "created_at": "2022-01-09T04:10:30.676000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Ah https://twitter.com/vdWijden/status/1479945803871440900 is what I'm expecting. 🙂",
        "created_at": "2022-01-09T05:02:33.417000+00:00",
        "attachments": null
    },
    {
        "author": "bearjew6187",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "What's the intended relationship between beacon blocks and eth1 blocks? IIUC execution of txs happens on Eth1 blocks as before, and beacon blocks point to eth1 blocks. A slot time is 12s while Eth1 block time is ~7s. After how many beacon blocks I can expect to see an update in the Eth1 state? After playing with some explorers I can see \u003e 10 beacon blocks pointing to the same Eth1 block hash.",
        "created_at": "2022-01-09T08:51:25.027000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e What's the intended relationship between beacon blocks and eth1 blocks? \n1 to 1.\n\n\u003e A slot time is 12s while Eth1 block time is ~7s.\nWhere did you read that the current block time is 7 s?",
        "created_at": "2022-01-09T10:12:30.360000+00:00",
        "attachments": null
    },
    {
        "author": "bearjew6187",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Just taking times from Etherscan tbh, nothing sophisticated. So a valid beacon block must link to an eth1 block whose parent is linked in the previous beacon block?",
        "created_at": "2022-01-09T10:43:47.802000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "https://etherscan.io/chart/blocktime ?",
        "created_at": "2022-01-09T10:45:56.405000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e So a valid beacon block must link to an eth1 block whose parent is linked in the previous beacon block?\nSomething like that yes. There's still the possibility of reorgs though afaik.",
        "created_at": "2022-01-09T10:47:03.937000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Invalid is a successful response! As is syncing and valid \n\nError is a failure in normal operation and cannot be conflated with any of those success responses \n\nAnd I think we are in agreement! Just writing it down for others to see",
        "created_at": "2022-01-09T15:04:34.120000+00:00",
        "attachments": null
    }
]