[
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "We currently have a chain split in Kintsugi that's causing non-finality. \n\nThere are currently 3 forks, but we traced it back to the initial fork (so 2 forks) and we are currently figuring that one out. \n\nThe fork occurs @ slot 154542. Lighthouse-geth forks off from everyone else. Lighthouse-geth accounts for about 36% of the network, so enough to cause non-finality. \n\nMarius has written up some information here about the cause: https://twitter.com/vdWijden/status/1479414817551261699\n\nWe found that nethermind-besu have an issue with caching/checks and caused the underlying CLs to fork off.  \n\nThe issue however, can be seen in later slots (for example 154560), where teku CL is reporting exec payload block_hash of `0x03b03e62065543c983e8b68a6e82807b851384d074f1c3a6e2e04eeac67522b7` for block number `0x225c7`, whereas its underlying/connected geth node is responds with `0xbf9f542e640a159c3250b9ff521887b66c408af1cfbeb5c5d380b2a47a40e61f` for the same block. Teku's slot state_root also matches that of the wrong nethermind-besu fork. The exec payload block_hash of `0x03b03e62065543c983e8b68a6e82807b851384d074f1c3a6e2e04eeac67522b7`  is also seen on {lighthouse,teku}-{nethermind,besu}, essentially the \"wrong\" block_hash. \n\nSo the question is, why is \u003c@\u0026836981489430036500\u003e  doing this? \n\nLighthouse and Teku clearly had the \"correct\" information from geth, but the lighthouse CL said NOPE and yeeted off into a fork. Teku however, despite having a healthy EL with the correct information, followed the wrong fork. i.e, So Teku joined the nethermind-besu fork even though it has the same data as lighthouse-geth. In a correct scenario, Teku-geth should have forked off with lighthouse-geth.",
        "created_at": "2022-01-07T12:22:13.623000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "general",
        "parent": "",
        "content": "thanks for the recap \u003c@!199561711278227457\u003e ! taking a look",
        "created_at": "2022-01-07T12:27:34.853000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "thanks!",
        "created_at": "2022-01-07T12:30:54.344000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "potential fix route:\n- find out and fix teku, so it follows the lighthouse fork\n- nethermind/besu cache fix to get them on the lighthouse fork as well\n\nthen we should have a healthy chain again",
        "created_at": "2022-01-07T12:31:50.641000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "what's the expected \"lifespan\" of Kintsugi?  I've seen it referred to as both a devnet and a testnet, is it sticking around longer term?  Are the various EL/CL teams planning on official releases w/ `--kintsugi` style flags?",
        "created_at": "2022-01-07T17:00:26.891000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "Kintsugi is expected to stick around for ~1 month  more, maybe a bit longer. A couple of CL/EL teams have made releases with `--kintsugi` flags, but due to differing release requirements it isn't necessary that every team would do it. We'd try and get configs out earlier for the next testnet, so releases can be planned in advance.",
        "created_at": "2022-01-07T17:22:01.827000+00:00",
        "attachments": null
    }
]