[
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "The EF does not control the relevant \"ties\" here. Individuals and companies have the autonomy to cut such ties if they think it the right action.\n\nThe EF is a large organization made of up many individuals with a diversity of perspective. There is no top-down dictate on this evolving issue. I suspect just as client teams and community members will continue to have a varied response to actions in this evolving landscape, as will individuals at the EF.",
        "created_at": "2022-08-16T00:09:27.239000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Yeah, I guess so, how does extending the TTD, until we solve this problem sounds like then?",
        "created_at": "2022-08-16T00:10:53.346000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "There is some nice discourse here",
        "created_at": "2022-08-16T00:11:01.449000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "And some solutions already out there that we could try to implement",
        "created_at": "2022-08-16T00:11:21.505000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "This is really helpful for example",
        "created_at": "2022-08-16T00:11:33.805000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "If the EF is a big enough organization then it is up to client teams then?",
        "created_at": "2022-08-16T00:12:16.328000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I will go AFK now",
        "created_at": "2022-08-16T00:12:47.424000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Sleepy time",
        "created_at": "2022-08-16T00:12:51.395000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "last thing before i go: when is the next consensus dev call and do you mind if I join?",
        "created_at": "2022-08-16T00:16:04.397000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I will try to collect as much solutions who seems viable and propose them then",
        "created_at": "2022-08-16T00:16:21.327000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "https://github.com/ethereum/pm/issues/598",
        "created_at": "2022-08-16T00:16:40.866000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Thank you",
        "created_at": "2022-08-16T00:16:49.256000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Some EL devs have been joining CL calls for the past year or so 😄 (and vice versa!)",
        "created_at": "2022-08-16T00:16:49.362000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I have joined a couple of times but I was always sent the link either by Andrew or in private",
        "created_at": "2022-08-16T00:17:20.346000+00:00",
        "attachments": null
    },
    {
        "author": "bculberson",
        "category": "general",
        "parent": "",
        "content": "From what I can tell with changes so far, even if flashbots puts their proxy as default in mev-boost, the only censorship is that those in list can't send in a transaction directly to the flashbots proxy. They could still get transactions processed if it was sent into mempool and it was profitable to add to blocks.",
        "created_at": "2022-08-16T00:19:46.942000+00:00",
        "attachments": null
    },
    {
        "author": "bculberson",
        "category": "general",
        "parent": "",
        "content": "I do hope competition comes in, but I think people think this is more than it is... maybe it's showing what further is to come.",
        "created_at": "2022-08-16T00:20:35.657000+00:00",
        "attachments": null
    },
    {
        "author": "dirigible6945",
        "category": "general",
        "parent": "",
        "content": "Sorry, we are considering changing the TTD? Is this an agenda item or just a discussion point?",
        "created_at": "2022-08-16T00:24:12.443000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "general",
        "parent": "",
        "content": "I'm personally strongly against delaying the merge for this. My preference would be to recommend local block building if no censorship-free relays are ready by the time of the merge.\n\nLarge US staking pools are likely going to censor regardless of the decision we make, so our priority should be providing options for regular users. Local block building is always an option, and I think it's quite likely we'll get a censorship-free relay too.",
        "created_at": "2022-08-16T00:25:57.629000+00:00",
        "attachments": null
    },
    {
        "author": "vinnie9190",
        "category": "general",
        "parent": "",
        "content": "It has never been set officially in a release and the discussion brought up by Giulio makes ultrasound sense! I hope we think carefully about this subject...",
        "created_at": "2022-08-16T00:27:59.163000+00:00",
        "attachments": null
    },
    {
        "author": "dirigible6945",
        "category": "general",
        "parent": "",
        "content": "It's in the paris.md file, is it not?",
        "created_at": "2022-08-16T00:28:38.457000+00:00",
        "attachments": null
    },
    {
        "author": "dirigible6945",
        "category": "general",
        "parent": "",
        "content": "Right. A large majority (\u003e60%?) of the staked eth is in the hands of entities that would use censoring relays, or block builders in that vein. Nothing will stop institutions like Coinbase from slavishly adhering to OFAC.",
        "created_at": "2022-08-16T00:30:31.602000+00:00",
        "attachments": null
    },
    {
        "author": "rufusg.",
        "category": "general",
        "parent": "",
        "content": "If that is the case then it is a big improvement, but the relay is still closed source so we can’t tell and they have been pretty radio silent on all this.",
        "created_at": "2022-08-16T00:31:19.160000+00:00",
        "attachments": null
    },
    {
        "author": "dirigible6945",
        "category": "general",
        "parent": "",
        "content": "I don't see changing TTD in response to this to be that viable. (The bomb is starting to activate...) We should treat the date as fixed barring breaking bugs and work for a solution implementable by release date. In particular, what Micah has laid out in the agenda:\n\n\u003e If there are no non-censoring relays as of The Merge, we can launch with clients that have the MEV-Boost integration disabled or removed so anyone wanting to use it would need to run custom software, not something from the Core Devs. If there are some non censoring relays as of The Merge, we can make an effort to promote those (e.g., in documentation, blog posts, etc.) and suppress/discourage the usage of any censoring relays.",
        "created_at": "2022-08-16T00:34:19.337000+00:00",
        "attachments": null
    },
    {
        "author": "dirigible6945",
        "category": "general",
        "parent": "",
        "content": "It has never been necessary to launch with MEV Boost.",
        "created_at": "2022-08-16T00:37:02.474000+00:00",
        "attachments": null
    },
    {
        "author": "_emptymind",
        "category": "general",
        "parent": "",
        "content": "Personally, as a solo staker, I will be waiting until there is a censorship-free relay until I run MEV-Boost 🤷‍♂️ I don't see any point in a delay. We must be careful that we are not censoring relays because we don't like their censorship. It's easy to fall down the rabbit hole when we believe we are doing something that is for the common good. Seeing developers arrested because their code can be used inappropriately is a terrifying wakeup call... we must lead by example, educate people about the issue and support healthy competition when it comes to block production. When we were concerned about a consensus client super-majority we didn't try and prevent people using Prysm, we offered better access to alternatives, guides to switching and helped people understand the problem.",
        "created_at": "2022-08-16T02:24:48.268000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Probably has to be said that flashbots and other entities in ethereum are also owned/partially owned by giant corporations like consensys. Expecting there to be no censorship/agenda like it’s run by an independent computer program is crazy. Likely most big eth PoS pools already have in-house mev solutions or are attached to one of the 4 current major providers. It’ll just be the individual staker that suffers.\n\nGiven that Chun Wang has 35% and growing of PoS it’s likely that we will see the amount of solo stakers go down it’s just the trend of things. Can’t eliminate it. It is nice that eth tries though.",
        "created_at": "2022-08-16T02:52:04.813000+00:00",
        "attachments": null
    },
    {
        "author": "bculberson",
        "category": "general",
        "parent": "",
        "content": "stakefish has 2%.... where are you getting 35%?",
        "created_at": "2022-08-16T03:22:07.925000+00:00",
        "attachments": null
    },
    {
        "author": "avy2515",
        "category": "general",
        "parent": "",
        "content": "I'm not sure accepting censorship is something that should be tolerated. Too much is at stake.",
        "created_at": "2022-08-16T03:30:09.073000+00:00",
        "attachments": null
    },
    {
        "author": "imman6820",
        "category": "general",
        "parent": "",
        "content": "I'm not for a delay but I am for CL clients not defaulting to a censoring relay especially if it's the only relay. This isn't the same as censoring the relay because we're not going to block it. If someone wants to use it, no ones stopping them. But the default configuration shipped by the clients should not be to this.",
        "created_at": "2022-08-16T04:13:16.428000+00:00",
        "attachments": null
    },
    {
        "author": "imman6820",
        "category": "general",
        "parent": "",
        "content": "This cant be compared to the prysm majority issue as easily because there we had other working options. Here we don't. Which is why we wait till better options come out but that doesnt mean we delay the merge.",
        "created_at": "2022-08-16T04:16:13.556000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Lido plus stakefish",
        "created_at": "2022-08-16T04:28:35.257000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "CLs do NOT default to using an external builder. The user must specifically opt in and provide the relay to use.",
        "created_at": "2022-08-16T04:36:52.397000+00:00",
        "attachments": null
    },
    {
        "author": "sauliusgrigaitis",
        "category": "general",
        "parent": "",
        "content": "Was a long read… Does this new regulation mean that it’s “illegal” to vote on the entire branch (not only the tip block) that has sanctioned address at any block in the branch? In this case it’s a complete disaster.",
        "created_at": "2022-08-16T05:32:14.290000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "There was nothing indicating this, this isn't the first address to be sanctioned",
        "created_at": "2022-08-16T05:35:14.003000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The recent sanctions are effectively gibberish so no one knows how to handle them and many orgs are panicking and trying to overcomply as much as they can to avoid DOJ attacks.",
        "created_at": "2022-08-16T05:35:53.434000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "The only way to make that possible would be to make OFAC compliance as part of block validity conditions which becomes ridiculous",
        "created_at": "2022-08-16T05:36:14.320000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Many people have taken up doing ridiculous things in the face of an unpredictable legal and regulatory environment in the US.",
        "created_at": "2022-08-16T05:36:47.454000+00:00",
        "attachments": null
    },
    {
        "author": "sauliusgrigaitis",
        "category": "general",
        "parent": "",
        "content": "Well, at least in my limited legal understanding voting on the branch that has sanctioned addresses is at least a soft support for the sanctioned transactions in the branch. This is going to be horrible…",
        "created_at": "2022-08-16T05:37:55.878000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "How is this different from building on a block that has sanctioned addresses ?",
        "created_at": "2022-08-16T05:38:41.887000+00:00",
        "attachments": null
    },
    {
        "author": "sauliusgrigaitis",
        "category": "general",
        "parent": "",
        "content": "Building a block is very direct action. I’m not expert in law, especially not in US jurisdiction, but law is not code. Is there is even a tiny difference you can always argue and it’s in the hands of the judge does your argument is strong enough.",
        "created_at": "2022-08-16T05:40:56.643000+00:00",
        "attachments": null
    },
    {
        "author": "sauliusgrigaitis",
        "category": "general",
        "parent": "",
        "content": "But I believed  those who are afraid of US regulations won’t vote for the entire branch that has any sanctioned addresses",
        "created_at": "2022-08-16T05:42:38.497000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "This isn't the first time addresses have been sanctioned, miners and validators have continued to build/vote on blocks that have sanctioned addresses. The only place where they actually exert control are the transactions packed into a block.",
        "created_at": "2022-08-16T05:45:30.220000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This is getting a bit off topic for this server, we should probably focus on what actions we want to take based on visible and possible behavior rather than the ideologies and arguments that lead ecosystem participants to take certain actions.",
        "created_at": "2022-08-16T05:45:31.209000+00:00",
        "attachments": null
    },
    {
        "author": "sauliusgrigaitis",
        "category": "general",
        "parent": "",
        "content": "Then this answers your previous question. However, in my understanding voting on the branch could be target of this regulation, not only block construction.",
        "created_at": "2022-08-16T05:51:02.026000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "Nobody really knows what is the target of the regulation, it seems to have been made vague on purpose",
        "created_at": "2022-08-16T05:53:06.956000+00:00",
        "attachments": null
    },
    {
        "author": "imman6820",
        "category": "general",
        "parent": "",
        "content": "Sorry, bad wording. In my opinion, CLs should not have the ability* to connect to external builders when no \"good\" external builders exist. *The ability shouldn't be there by default. The term \"good\" is what is being debated about censorship. It's my opinion that an external builder that censors transactions is bad.",
        "created_at": "2022-08-16T05:53:39.303000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "general",
        "parent": "",
        "content": "I don't think that's the central debate, as (almost) everyone here agrees that censorship is bad for Ethereum. I think the key disagreement is whether we ship builder-api support _even if_ no non-censoring relays exist -- in the hope that some non-censoring relays appear, or that we may mitigate the danger of the existing relay by giving client devs some control over its use (rather than encouraging Flashbots or the staking pools to hack their own clients). IMO it's harm-minimisation with an option for improvement (ship builder support in clients) vs absolute intolerance (delete builder support from clients).",
        "created_at": "2022-08-16T06:07:29.282000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "My general belief is that the majority of proposers won't run non-stock software initially after the merge.  Given enough time, I think *eventually* we'll see more and more people willing to run non-stock software but that will take a while.  My hope is that if we refuse to launch builder API support until there exist non-censoring relays, we'll either see non-censoring relays show up to the party or we'll see PBS implemented with CR lists (or similar) before we see significant adoption of a non-stock validating software stack.",
        "created_at": "2022-08-16T06:13:27.083000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I mean if I’d gone to all the effort to setup a relay and then clients pulled support in a really easy to revert pr right before the merge, I’d just revert that pr and put out custom builds immediately that people could easily use. So I think it’s unlikely that it will take time for people to customise clients to make this possible. \nIt’s possible what will happen is a custom build of only the most popular clients will be provided and then we’ll have a censoring relay *and* reduced client diversity.",
        "created_at": "2022-08-16T06:16:36.248000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think you are not the average demographic of staker.  🙂  I think the vast majority of stakers will just download what is available on a releases page/list somewhere.",
        "created_at": "2022-08-16T06:17:36.334000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I don't think building a custom client is hard, for the reasons you stated, but I think most people won't take the steps required to do it.  Defaults are very powerful.",
        "created_at": "2022-08-16T06:18:08.089000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I also think many stakers are going to be a bit hesitant to trust builds from unofficial sources.",
        "created_at": "2022-08-16T06:18:31.895000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "These are not absolute statements of course, but I think the segment of the staker population that will just use stock software at launch is significant.",
        "created_at": "2022-08-16T06:19:00.386000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "general",
        "parent": "",
        "content": "We already have majority of block producers running `mev-geth` in current Ethereum. I don't see why we wouldn't end up with the same thing rather quickly. Do recall that staking pools make up a super-majority of stakers.",
        "created_at": "2022-08-16T06:19:08.122000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I’m saying the relay builder would just provide that download page. \nAnd most stakers follow guides which already build from source.",
        "created_at": "2022-08-16T06:19:09.164000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "The key thing is not making it a default, if users want to fork clients and add in new changes to it they can. If we know that the current state of feature will bring in more harm than good, the right thing to do would be to disable it. There have been multiple testnets that have run with mev-boost, the only relay that has been running/tested has been flashbots relay",
        "created_at": "2022-08-16T06:19:17.014000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Yes, and it took years to get this adoption and many mining pools actually ran a mix of geth and mev-geth in their farms because they were so hesitant to run unofficial software across their whole stack.",
        "created_at": "2022-08-16T06:19:46.821000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "general",
        "parent": "",
        "content": "\u003e If we know that the current state of feature will bring in more harm than good, the right thing to do would be to disable it.\nAll we need to do is figure out if the feature brings more harm than good 😅",
        "created_at": "2022-08-16T06:20:01.265000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "We’ve been running blox’a relay as well.",
        "created_at": "2022-08-16T06:20:11.971000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Will it be available at launch on mainnet?  Does it censor or is it planning to censor?",
        "created_at": "2022-08-16T06:21:14.906000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "there's multiple relays running right now on sepo, kiln, goerli though?",
        "created_at": "2022-08-16T06:21:14.988000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "The point I’m making though, obviously poorly, is that users wouldn’t have to create a custom client or run unofficial builds. They run the official client released by the relay builder.",
        "created_at": "2022-08-16T06:21:47.255000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I haven't been able to get in contact with any relays other than FB to find out their plans re: censorship at The Merge launch.",
        "created_at": "2022-08-16T06:21:50.304000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "Do we have a list on non-flashbots relays that plan to launch in mainnet ?",
        "created_at": "2022-08-16T06:22:01.710000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The level of trust people have in the relays is significantly lower than the level of trust they have in the core dev teams.  We saw this with the extremely slow and cautious adoption of mev-geth by miners.",
        "created_at": "2022-08-16T06:22:37.090000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "People will download and run without second thought basically anything the Geth team releases, but they are incredibly hesitant and slow to adopt the stuff put out by the FB team.",
        "created_at": "2022-08-16T06:23:04.301000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Funnily enough it was claimed the adoption of flashbots by miners was extremely quick earlier.",
        "created_at": "2022-08-16T06:23:23.148000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "apart from bloxroute I don't think anyone else has announced it formally",
        "created_at": "2022-08-16T06:23:31.413000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "but basically there's at least another 3-4 that I know of",
        "created_at": "2022-08-16T06:23:52.661000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I guess it depends on the timescale you are considering?  I think it was like 1-2 years to get to the 80% or whatever adoption they have now, and during that time there were mining pools that would run partially because they didn't fully trust mev-geth to not break.",
        "created_at": "2022-08-16T06:24:03.503000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "general",
        "parent": "",
        "content": "Well if that's the case then I don't see the concern about allowing people to connect if they want to.",
        "created_at": "2022-08-16T06:24:19.136000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "took two years but it went from like 10% to 80% in the span of 7 months",
        "created_at": "2022-08-16T06:24:28.154000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "general",
        "parent": "",
        "content": "and the MEV cat is very much out of the bag now",
        "created_at": "2022-08-16T06:24:42.251000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "7 months is plenty of time (hopefully) for us to get non censoring relays to join the game.",
        "created_at": "2022-08-16T06:25:08.793000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "general",
        "parent": "",
        "content": "I don't think it's reasonable to assume that the initial adoption curve of MEV is going to be the same as now. It's a completely different environment.",
        "created_at": "2022-08-16T06:25:40.310000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Trusting your CL that controls whether you get slashed or not is quite different from trusting a sidecar and a remote endpoint that can at worst make you miss a proposal.",
        "created_at": "2022-08-16T06:25:50.926000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Why would anyone build a non censoring relay that isn’t supported by any client?",
        "created_at": "2022-08-16T06:26:05.659000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Because they know as soon as they do, the clients will add support and they'll be signal boosted (marketed) for free.",
        "created_at": "2022-08-16T06:26:34.036000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "And the first one to show up has a significant market advantage to the second, so there is a bit of a race to be the first.",
        "created_at": "2022-08-16T06:27:12.352000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "clients don't support specific relays, they support the builder API",
        "created_at": "2022-08-16T06:27:28.576000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This is correct.",
        "created_at": "2022-08-16T06:27:45.872000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "so this isn't really a coherent thing",
        "created_at": "2022-08-16T06:28:05.514000+00:00",
        "attachments": null
    },
    {
        "author": "yokem55",
        "category": "general",
        "parent": "",
        "content": "Even a relay that only built naive blocks out of the mempool would be useful for staking pools that need auditability of their operators.",
        "created_at": "2022-08-16T06:28:16.418000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think Adrian is saying that if we pull the builder API today, a non-censoring relay that launches won't work with anything.",
        "created_at": "2022-08-16T06:28:37.361000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "alright sure",
        "created_at": "2022-08-16T06:28:58.654000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "but the danger here IMO is clients shipping FB as any kind of default, not in supporting some protocol",
        "created_at": "2022-08-16T06:29:46.232000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "yep",
        "created_at": "2022-08-16T06:29:50.637000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "I do't know if any CLs are hardcoding FB relay URLs",
        "created_at": "2022-08-16T06:29:59.765000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "I dont think anyone is",
        "created_at": "2022-08-16T06:30:09.721000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "clients do not ship MEV boost by default",
        "created_at": "2022-08-16T06:30:11.948000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "general",
        "parent": "",
        "content": "We're certainly not.",
        "created_at": "2022-08-16T06:30:13.143000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "I would hope not",
        "created_at": "2022-08-16T06:30:14.725000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "nor is Nimbus",
        "created_at": "2022-08-16T06:30:17.323000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "just support for the API",
        "created_at": "2022-08-16T06:30:21.052000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Option 1: Deliver official clients with the builder API implemented while we know that the only relays available to stakers are actively censoring.\nOption 2: Deliver official clients without the builder API, forcing anyone who wants to use the censoring relay to source their software from unofficial sources.  Once non-censoring relays are available, add builder API support to official client releases and encourage users (socially) to use the non-censoring relay.",
        "created_at": "2022-08-16T06:30:39.990000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "As far as I can tell people are arguing to drop support for the builder api but a huge number of people chiming in with hot takes don’t realise the difference between MeV boost, relays and the builder api.",
        "created_at": "2022-08-16T06:30:45.804000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "And to confirm, teku does not use an external builder at all by default and does not include any relays config in any way.",
        "created_at": "2022-08-16T06:31:16.381000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "that's like a baby bathwater type thing 😦",
        "created_at": "2022-08-16T06:31:19.060000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "If those are the only options (and I don't think they will be), Option #1 is still better",
        "created_at": "2022-08-16T06:32:07.678000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "What other options do you see?",
        "created_at": "2022-08-16T06:32:24.188000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "Official clients with builder API and by launch we'll have \u003e1 non-censoring relay",
        "created_at": "2022-08-16T06:32:53.356000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "there are not other people interested in running a relay except FB? I guess their relay code is not OS either so it would require them to build it from ground up?",
        "created_at": "2022-08-16T06:32:57.173000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "at the same time we should obviously be fighting the idea that the fb relay has to censor at all (i.e. along the lines of argumentation that validators are software providers, not service providers, and not considered facilitators in the sense that money-transmitters are)\n\nUntil there is more clarity here, I think we're being a bit overreactionary",
        "created_at": "2022-08-16T06:34:05.902000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "I think there is definite value in the builder api, anyone wanting to remove it completely doesn't understand why its there in the first place. My main worry is always the fact that despite it is an open standard right now, currently there is only 1 relay that everyone will use during the merge. And given that relay is currently censoring, and we dont yet have non-censoring options (?) , it would be a mistake to have it enabled in clients.",
        "created_at": "2022-08-16T06:34:08.473000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If that is an option that would be great, but at the moment that doesn't appear to be an option and we don't have any control over whether it becomes one.",
        "created_at": "2022-08-16T06:34:42.658000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "general",
        "parent": "",
        "content": "\u003e currently there is only 1 relay that everyone will use during the merge\nThis is an assumption and I don't think it should be treated like fact.",
        "created_at": "2022-08-16T06:34:57.465000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Requires building a relay from the ground up at the moment, and running a relay is non-trivial.",
        "created_at": "2022-08-16T06:35:11.464000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "https://docs.bloxroute.com/ropsten-eth2.0/validators-and-builders#validators",
        "created_at": "2022-08-16T06:35:49.819000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "unless we get FB to opensource their code?",
        "created_at": "2022-08-16T06:35:58.465000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "Fair, how about relays that wont censor then ?",
        "created_at": "2022-08-16T06:36:19.082000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I have reached out to Bloxroute to find out if they are going to be available at The Merge and whether they will be censoring, haven't heard back.  Can try again though: \u003c@532654603238375425\u003e",
        "created_at": "2022-08-16T06:36:21.458000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "basically everyone has asked this and they say they will, let's wait for their announcement to get more clarity about how fast they can do so",
        "created_at": "2022-08-16T06:36:34.799000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "general",
        "parent": "",
        "content": "We know that bloXroute exists and we don't know if it will censor.",
        "created_at": "2022-08-16T06:37:50.862000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Their tentative plan is to open source \"sometime in August\", and it sounded like end of August.  I think we need to make a decision on whether to pull the builder API before the client releases which are happening this week and next, so we can't wait for them on this I don't think.",
        "created_at": "2022-08-16T06:37:52.527000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "would be nice to know what is their stance",
        "created_at": "2022-08-16T06:38:08.729000+00:00",
        "attachments": null
    },
    {
        "author": "dv8s",
        "category": "general",
        "parent": "",
        "content": "I don't know the difference between lots of those, but I intend on learning. What I can say is the recent OFAC action (SDN addition of smart contracts, clearly not **NATIONALS**) is sufficiently vague and leading to tons of questions --- leading to severe out-of-proportion actions/responses. It is unclear what is 'not allowed' when it comes to the chain. Considerations:  Not including potentially blocked transactions into a block you are producing. Another is being banned from not even building on blockchain that has a block with 'illegal' transactions in it **anytime in its history**. Another is not being able to even vote (FFG stuff, or LMDGHOST) on a chain that includes illegal transactions. Some of this is insane.",
        "created_at": "2022-08-16T06:38:09.305000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "if we ship clients with builder API and MEV boost ships without a default relay is that viable in your view? https://github.com/flashbots/mev-boost/issues/246",
        "created_at": "2022-08-16T06:38:36.173000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Not if the only relays available to users at The Merge censor.",
        "created_at": "2022-08-16T06:38:53.304000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "sounds like any defi projects plan to decentralize :p",
        "created_at": "2022-08-16T06:41:55.156000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "What if the relay isn't activated until there's consensus that there are enough desirable relays out there?",
        "created_at": "2022-08-16T06:42:16.453000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "You mean if FB voluntarily agrees to not run their relay if there is no non-censoring relay available?  🤔",
        "created_at": "2022-08-16T06:42:45.866000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "Yeah, i mean i have no idea if they'd agree to that, but it's an idea",
        "created_at": "2022-08-16T06:43:00.442000+00:00",
        "attachments": null
    },
    {
        "author": "quezacoa",
        "category": "general",
        "parent": "",
        "content": "Am I right that a non censoring relay will be able to serve blocks with more MEV than censoring ones? Eventually rational actors outside censoring countries /jurisdictions will shift to use the non censoring relays or connect to both but decide in favor of blocks served by non censoring relays = best paying blocks, right?\n\nI believe we will see more non-censoring relays coming online, especially when they can run more profitable. \n\nIf we can be certain that at least one non-censoring alternative is going online in time for the merge I believe we should ship the API. Otherwise we wait and support actors willing to spin up non-censoring infra. It won't require a hard fork I guess.",
        "created_at": "2022-08-16T06:43:03.677000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It is an interesting proposal.  While I am very much not ethos aligned with FB at this point, I am hesitant to believe they would outright lie or make a promise they are unwilling to keep.  So if they committed to this I would be keen on believing them.",
        "created_at": "2022-08-16T06:43:53.259000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "this depends on how much they are censoring, if they are censoring addresses that don't produce MEV, then there's no difference",
        "created_at": "2022-08-16T06:43:57.161000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "There would still be transaction fees.  However, it may be epsilon difference.",
        "created_at": "2022-08-16T06:44:21.102000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "In terms of releasing source for someone to have enough time to throw up a \"clean\" relay, that would be \"sometime this week\"?",
        "created_at": "2022-08-16T06:50:59.984000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Depends on how turnkey their code is.  If they release the source code but it requires spinning up complicated infrastructure the it is already too late.",
        "created_at": "2022-08-16T06:51:29.932000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "It’s not only about the availability of a non censoring relay. Users also need to trust it.",
        "created_at": "2022-08-16T06:51:49.042000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "that argument goes both ways?",
        "created_at": "2022-08-16T06:52:20.668000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "\"why would users trust the FB relay and use it since it censors\"",
        "created_at": "2022-08-16T06:52:31.471000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If their relay code is all dockerized and swarm ready, then anyone with a docker swarm can just add it and go.  On the other hand, if it is just the code for a single instance and it is left as an exercise for the operator to deal with DoS protection, reverse proxies, networking, setting up and managing databases, etc. then much more time is needed.",
        "created_at": "2022-08-16T06:53:09.432000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "If we only do X if there is a non censoring relay, we automatically legitimize that new non censoring relay. It’s a good setup for potential malicious actors",
        "created_at": "2022-08-16T06:56:46.707000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "worth sending just bundles that pose only small risk for sender",
        "created_at": "2022-08-16T06:57:22.968000+00:00",
        "attachments": null
    },
    {
        "author": "imman6820",
        "category": "general",
        "parent": "",
        "content": "You're right. I dont know all these things. I just want convey the sentiment that I dont want ethereum official clients and teams to support any entity that censors. Providing an api that presently can only be used by a censoring entity is deemed support in my opinion.",
        "created_at": "2022-08-16T06:59:53.140000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "The api is an open standard and can be used by anyone. There are at least two providers already active on testnets (none support MainNet currently). \nA huge part of the problem with making any progress here is that people are making up their minds on what is right and expressing sentiments that aren’t based on the actual facts and without consideration of what the effects of removing the builder api may be. \nI don’t know what the right answer is here, but I’m getting very frustrated at the amount of anguish that’s clearly based on wrong information (eg that flashbots is the only relay).",
        "created_at": "2022-08-16T07:08:45.928000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "That’s not intended to be a personal attack on you btw. Sorry it came across like it was.",
        "created_at": "2022-08-16T07:09:41.450000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "should educate then? If you know the effects and consideredations, why not mention them?",
        "created_at": "2022-08-16T07:11:46.054000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I don’t know them all, people need to actually reason things through instead of just reacting. Many effects have been mentioned in these discussions such as causing centralised staking pools to be more profitable than home stakers thus increasing centralisation (and making censorship easier). Discouraging people from building alternative relays because nothing will support them. Having les control over how MeV is done (it was originally going to replace the local EL entirely and be in control of whether each block is valid or invalid) and a bunch of others",
        "created_at": "2022-08-16T07:14:28.385000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "right, so its a reasonable proposition to propose removal of the API and then discuss what it could cause, what are pro's and con's?",
        "created_at": "2022-08-16T07:15:17.913000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think Adrian is expressing frustration with *some* of the comments in this thread, not with the overarching discussion (please correct if wrong).",
        "created_at": "2022-08-16T07:15:50.734000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "I don't know how that follows?",
        "created_at": "2022-08-16T07:15:52.356000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "\u003c@137094067015122944\u003e",
        "created_at": "2022-08-16T07:15:55.941000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "follows what?",
        "created_at": "2022-08-16T07:16:05.974000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "I think adrian has already mentioned the cons above ^ . There are valid reasons for there to be a builder api",
        "created_at": "2022-08-16T07:16:06.314000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Sure, it's baseline reasonable to propose removing the builder/relay API, but it's not clear how that engages with what Adrian wrote at all",
        "created_at": "2022-08-16T07:17:33.879000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "that was the topic of discussion if you read above",
        "created_at": "2022-08-16T07:18:09.883000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "yes, I've been reading",
        "created_at": "2022-08-16T07:18:16.863000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "okay, I am completely lost :D",
        "created_at": "2022-08-16T07:18:36.015000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We have good reason to believe there will be at least 2 relays at launch, Bloxroute and Flashbots.  Neither have publicly stated whether they will censor or not, but there is very strong evidence to suggest that FB will censor at the least (they have been for the past year), and we haven't heard anything from Bloxroute.  Clients will be cutting their final Merge releases very soon, so we may not have the luxury of waiting to find out the official policy of all the launch-ready relays before making a decision.",
        "created_at": "2022-08-16T07:18:38.563000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "And it's a bit ... hm, not sure... to, in response to Adrian responding to a prompt to educate people, to respond to a comment containing such education with content completely nonresponsive to said education",
        "created_at": "2022-08-16T07:18:43.969000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "It was response to this `A huge part of the problem with making any progress here is that people are making up their minds on what is right and expressing sentiments that aren’t based on the actual facts and without consideration of what the effects of removing the builder api may be. `",
        "created_at": "2022-08-16T07:19:55.953000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Yes, my response holds",
        "created_at": "2022-08-16T07:20:10.304000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "okay, I don't understand your point. But I guess it goes offtopic anyway",
        "created_at": "2022-08-16T07:20:24.047000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "So to be specific, if you want to remove the builder api, explain how you prevent centralisation on large staking pools, how you’ll prevent flashbots from just reverting the original middleware design and how you’ll facilitate other non censoring builders being developed since no client will support them (unless the go the middleware route with all its additional risks).",
        "created_at": "2022-08-16T07:21:59.130000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Also we need to quantify if there will be a non-censoring relay at the merge and if a sufficient proportion of validators will use it to make censorship effective.",
        "created_at": "2022-08-16T07:22:58.260000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "I guess one could use the nuclear option and punish validators for using FB for censoring",
        "created_at": "2022-08-16T07:23:50.747000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Remember that the builder api gives no ability to control which block is built on or affect the validity of blocks so to get around censorship you just need to find a single validator not censoring.",
        "created_at": "2022-08-16T07:24:00.313000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think there may be a miscommunication here.  I'm arguing that we would *accept* all of those problems because it is better than launching with the builder API and all available relays censoring.  I also argue that none of those problems will be immediate, they will all take time to grow, and during that time we can work on addressing the censorship problem (either through PBS/CR Lists or a non-censoring relay being created/operated).",
        "created_at": "2022-08-16T07:24:04.784000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We cannot identify who is using it in consensus.",
        "created_at": "2022-08-16T07:24:20.298000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "How do you actually do that ? and why would you want to do that",
        "created_at": "2022-08-16T07:24:24.801000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Yeah I think you and I just disagree on how long it will take for custom clients to be available and used. And I know first hand what’s involved and how easy it would be so I’m backing myself. 🙂",
        "created_at": "2022-08-16T07:25:07.069000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "why? to protect against censoring",
        "created_at": "2022-08-16T07:25:11.804000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "each proposer can pack any list of transactions into a block, there is no way to verify that they are censoring",
        "created_at": "2022-08-16T07:25:28.989000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I agree with you on how easy it is.  I think what we disagree on is how lazy and un-knowledgeable most people are.",
        "created_at": "2022-08-16T07:25:29.176000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "yeah, has to be community fork, but identifying who is using it after the fact is hard too 🤔",
        "created_at": "2022-08-16T07:25:51.076000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Fair. But I’ve been doing a ton of support for home stakers and it’s amazing what they’ll do if someone just writes a guide for it. I have trouble convincing them to do things the easy way…",
        "created_at": "2022-08-16T07:26:41.564000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I don't think even I would be comfortable with slashing validators after the fact because they chose to leave a transaction out of their block.  Mainly because we cannot prove *why* they left a transaction out (maybe they didn't see it).",
        "created_at": "2022-08-16T07:26:50.835000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Yes, slashing has hitherto been used for very specific, provable protocol violations",
        "created_at": "2022-08-16T07:27:19.347000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "I would strongly oppose (the ironic use of) slashing for suspected censorship.",
        "created_at": "2022-08-16T07:27:53.111000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think we even agree largely here, and where we disagree is how representative the set of people you are supporting are of the broader population.",
        "created_at": "2022-08-16T07:27:59.619000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "My gut says that the majority of people just follow the instructions on ethereum.org launchpad page and most of those don't reach out for support.  The ones that do are the ones that are coloring outside the lines, but they aren't the majority.",
        "created_at": "2022-08-16T07:28:58.751000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "slashing is the wrong term used here, as slashing refers to the protocol, not \"punishing validators for behaving wrong in terms of not defined in the protocol\"",
        "created_at": "2022-08-16T07:29:08.718000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "bad wording I know :/",
        "created_at": "2022-08-16T07:29:18.492000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Ugh, I still fight against co-opting the term slashing to mean that specific thing.",
        "created_at": "2022-08-16T07:29:21.654000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Slashing is an English word with an established connotation that refers to a class of things, not a single specific instance of that class.",
        "created_at": "2022-08-16T07:29:57.999000+00:00",
        "attachments": null
    },
    {
        "author": "imman6820",
        "category": "general",
        "parent": "",
        "content": "No worries, you're right.\nI'd like to see an ACD call on this. Even outside the bi weekly scheduled one.",
        "created_at": "2022-08-16T07:31:29.616000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "Afaik neither the launchpad nor any other official guide mentions the use of mev-boost. Its a completely optional feature that people are free to use if they want to. The default is local block building with your local EL. If that's not made clear, we should definitely do so.",
        "created_at": "2022-08-16T07:31:43.732000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "\u003chttps://github.com/ethereum/pm/issues/592#issuecomment-1214768199\u003e",
        "created_at": "2022-08-16T07:31:57.243000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "there was a merge checklist that referenced it I think",
        "created_at": "2022-08-16T07:32:04.213000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "If you think I’m grumpy now, wait until I have to discuss this on a call at 1am 😂",
        "created_at": "2022-08-16T07:32:31.086000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "This one? https://launchpad.ethereum.org/en/merge-readiness/\n\nDoesn't have it either :\\",
        "created_at": "2022-08-16T07:32:35.646000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "let me try to find it, I remember someone asking me about it",
        "created_at": "2022-08-16T07:33:21.457000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I think I’d object to the builder api being included in any Ethereum.org or launchpad checklists. It’s definitely not required. \nKeeping them focussed on the minimum required seems like an easy choice - partly because of this controversy but mostly to keep things as simple as possible so people are actually ready for the merge.",
        "created_at": "2022-08-16T07:34:11.892000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "Yea I'd agree with that. If someone finds an instance referring to it, especially where it isn't made extremely clear that its optional - I can help get that changed.",
        "created_at": "2022-08-16T07:34:46.776000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "i think this was the one \nhttps://notes.ethereum.org/@launchpad/merge-configuration-checklist\nWas it changed ? Maybe I misread it, there seems to be no reference there now",
        "created_at": "2022-08-16T07:42:30.801000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "Weird, The last change was 21h ago and that adding the fee recipient bit because someone noticed we forgot to mention it there. Afaik there's been no other changes. \n\nIn case someone finds mentions in official docs(esp without warnings), please do raise a flag 😄",
        "created_at": "2022-08-16T07:44:56.634000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003c@199561711278227457\u003e Are you doing merge testnets with MEV-Boost?  If so, are you using bloxroute or flashbots relay for testing?",
        "created_at": "2022-08-16T07:58:18.695000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "The last 3 goerli shadow forks included mev-boost. The first two was just with flashbots. The third one had flashbots and bloxroute.",
        "created_at": "2022-08-16T07:59:24.451000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "How would you feel about no longer testing FB relay for them (if they want to test it themselves they can)?  If the censoring relay has bugs that feels like a win to me.",
        "created_at": "2022-08-16T08:00:23.120000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Though, we don't know if Bloxroute will also be censoring, and if they are this strategy may be a bit unfair.",
        "created_at": "2022-08-16T08:00:44.037000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "The aim of the testing however isn't focussed on ensuring the FB relayer performs well. The testing is focused on the effects mev-boost can have on a network. From that perspective, its immaterial who runs the relayer.",
        "created_at": "2022-08-16T08:01:16.847000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "To put it more broadly: We shouldn't be helping people build censorship software.",
        "created_at": "2022-08-16T08:01:21.392000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "So the issue here is that we, once again, don't know anyone building a non-censoring relay so in order for us to test our side of the integration we must *also* help the bad guys test their side of the integration?",
        "created_at": "2022-08-16T08:02:19.074000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This is certainly a moral quagmire.",
        "created_at": "2022-08-16T08:02:27.079000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "should have a mockup MEV-boost for testing I guess",
        "created_at": "2022-08-16T08:02:46.277000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "That wouldn't be full E2E testing which I think is what we need.",
        "created_at": "2022-08-16T08:02:58.228000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Well, I guess one could *imagine* a mocked relay specifically for testing.",
        "created_at": "2022-08-16T08:03:18.907000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "*Good Guys*: We need to test our laser defense armor.\n*Bad Guys*: We need to test our laser guns.\n*Good Guys*: I guess we will let you shoot at us, since we don't know anyone else with laser guns that need to be tested.",
        "created_at": "2022-08-16T08:04:36.450000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Yeah I don’t think we’re testing relays for their sake - we’re testing them for our benefit.",
        "created_at": "2022-08-16T08:08:03.287000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Yeah, that makes sense.  It is just unfortunate that as a side effect of testing our end of the implementation we must also help test their end of the implementation which we know plans on doing bad things.",
        "created_at": "2022-08-16T08:20:55.090000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Well there are some alternatives to deprecate the Builder APIs which may be preferred. 1)  Integrate local block building using MEV variants of clients, this would require a lot of work and may not be feasible. Could be done after TTD or we could push TTD away. This would make block building independent from builders. 2) All client teams coordinate and publicly deprecate Flashbots relays without removing Builder API support. removing official documentation where we can extend our reach and instead promote alternative block builders which  are not notorious to censor transactions(this requires coordination from both ELs and CLs). 3) Shuttered Beacon Chain: this is off-topic but still could be important in the future (since governments are crazy), and we could fight off a future possible lack of attestations on blocks containing sanctioned transactions, in case OFAC requires nodes to completely erase those transactions from existence by considering them invalid. 4) Removing the Builder's API momentarily in all Consensus clients to make the situation not worse than it already is.",
        "created_at": "2022-08-16T09:35:32.990000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "What do you think about the following points? should we discuss them later on, in an ACD?",
        "created_at": "2022-08-16T09:36:20.391000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "\u003e  1)  Integrate local block building using MEV variants of clients, this would require a lot of work and may not be feasible. Could be done after TTD or we could push TTD away. \nDoesnt really help, except shift the workload back to execution clients. We already have CL clients which have built out the builder APIs. This core problem doesn't change even if we use mev variants of execution clients. \n\n\u003e 2) All client teams coordinate and publicly deprecate MEV-Boost without removing Builder API support. removing official documentation where we can extend our reach and instead promote alternative block builders which  are not notorious to censor transactions(this requires coordination from both ELs and CLs). \n\nMev-boost isn't tied to flashbots, any enitity could run a relay",
        "created_at": "2022-08-16T09:40:43.616000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "yes sorry, let me correct it. was thinking of different things lol",
        "created_at": "2022-08-16T09:41:12.780000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "In any case, I would at least try to get client teams to publicly deprecate flashbots relay, that seems to be in reach.",
        "created_at": "2022-08-16T09:42:06.215000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "I guess a solid replacement for 1. is just not using mev-boost altogether, i.e, just run an EL-CL without the mev related flags(the default basically). I have no real data, but I doubt the locally built mev-blocks would be far better than just using vanilla blocks from the EL. \n\nand for 2., no client team has flashbots built in as a default anyway. They cannot do anything to prevent users from setting it as a relay, since that's a user choice.",
        "created_at": "2022-08-16T09:43:43.863000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "yes, but we can advise against it",
        "created_at": "2022-08-16T09:44:05.063000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "kind of like client diversity",
        "created_at": "2022-08-16T09:44:12.190000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "Yea of course, we should be vocal about the trade-offs",
        "created_at": "2022-08-16T09:44:25.151000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "we slandered against prysm because they were the majority, we can slander against flashbots",
        "created_at": "2022-08-16T09:44:37.329000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "No client is hardcoding the flashbots relay into the client code base. The main issue is there isn't a non-censorable relay available. Bloxroute is an alternative, but they havent given an indicating whether they will censor or not",
        "created_at": "2022-08-16T09:45:08.650000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "we could even have client teams from EL/CL run their own relays",
        "created_at": "2022-08-16T09:45:10.061000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "then why cant client teams run their own relays?",
        "created_at": "2022-08-16T09:45:46.809000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "I dont think it is straightforward to run your own relay",
        "created_at": "2022-08-16T09:46:09.074000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "you will have to write everything from scratch",
        "created_at": "2022-08-16T09:46:22.767000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "and there is 1 week till the merge releases",
        "created_at": "2022-08-16T09:46:31.507000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Wait, arent there open source relays?",
        "created_at": "2022-08-16T09:46:37.332000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "I don't get the point of a client team running a relay. Client teams are not mev specialists and if the aim is to avoid censorship, then just don't use the mev-boost middleware :\\ \nafaik it isnt a default anywhere and not recommended by default either.",
        "created_at": "2022-08-16T09:46:40.234000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "No yet, I dont think flashbots has open sourced theirs",
        "created_at": "2022-08-16T09:47:12.892000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "then i guess we need to wait a BloxRoute response",
        "created_at": "2022-08-16T09:50:41.248000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "btw where are they based?",
        "created_at": "2022-08-16T09:50:47.875000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "US (I think)",
        "created_at": "2022-08-16T09:51:59.118000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "are we 100% sure there are no MEV relayers that are not open source?",
        "created_at": "2022-08-16T09:52:57.017000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "l am not really an expert of the MEV landscape and I think it shows lol",
        "created_at": "2022-08-16T09:53:22.906000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "AFAIK currently there are none (well, specifically MEV-boost relays)",
        "created_at": "2022-08-16T09:53:24.367000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "If they are based in the US and has not answered yet, I think that the odds of them not sanctioning are slim",
        "created_at": "2022-08-16T09:53:57.388000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "No.  FB says they will open source theirs in the future, but it currently is closed source.",
        "created_at": "2022-08-16T09:59:45.364000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Many believe that relayers aren't required to enforce sanctions as they are not a transacting party, they are just a dumb/blind service provider (like CloudFlare).",
        "created_at": "2022-08-16T10:00:26.325000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Given that CloudFlare doesn't attempt to enforce sanctions, I think there is reasonable legal standing.  However, CloudFlare has the money to defend against the US government.",
        "created_at": "2022-08-16T10:01:01.059000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "FB probably got legal advice from a lawyer, I do not see a bunch of engineers opinions stand a chance against a lawyer advice",
        "created_at": "2022-08-16T10:02:44.406000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "you cannot even blame them for it, they are not doing anything inherently wrong from that perspective.",
        "created_at": "2022-08-16T10:03:29.633000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "any alternative to bloxroute and flashbots that you know of?",
        "created_at": "2022-08-16T10:09:26.494000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "not US based",
        "created_at": "2022-08-16T10:09:39.555000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Manifold seemed to hint on Twitter that they were planning on running one, but I haven't been able to reach them for comment yet.",
        "created_at": "2022-08-16T10:10:01.133000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "And they are pretty strongly anti-censorship and have stated that they don't censor in any of their products.",
        "created_at": "2022-08-16T10:10:14.064000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "We could reach out to them and publicly recommend them over the alternatives?",
        "created_at": "2022-08-16T10:11:12.486000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I am trying to reach out to them, waiting on a reply.  I don't know if they will have a relay ready by mid September though, or if they are just planning on building something in the future.  Or maybe I misunderstood their tweets.  🤷",
        "created_at": "2022-08-16T10:12:17.669000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "slow down a bit man some ppl actually sleep",
        "created_at": "2022-08-16T10:14:02.288000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I do think there is some need for urgency here since final releases of clients are being cut this week.",
        "created_at": "2022-08-16T10:14:21.245000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We don't have a lot of time to come to some sort of weak consensus.",
        "created_at": "2022-08-16T10:14:39.504000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "Everyone is feeling the urgency regardless of how much they're communicating about it. Let's be charitable.",
        "created_at": "2022-08-16T10:14:52.791000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "i dont sleep much anyway 🤷",
        "created_at": "2022-08-16T10:15:32.972000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "If there are no alternatives, it seems that deprecating the Builder API for a while might be the most straightforward thing to do. at least , we will limit the damage for a while.",
        "created_at": "2022-08-16T10:18:10.396000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "flashbots can still use a geth fork but so they are doing now",
        "created_at": "2022-08-16T10:18:42.268000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "You should read my rants from earlier this afternoon.  The builder API was introduced to solve some big issues that would occur without it.  Just removing it without addressing those issues isn't  a straight forward obvious win.",
        "created_at": "2022-08-16T10:36:51.701000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "If you want to make the argument for it, you need to actually address the downsides and the problems that led to it being created in the first place.",
        "created_at": "2022-08-16T10:37:14.809000+00:00",
        "attachments": null
    },
    {
        "author": "monkeyontheloose.eth",
        "category": "general",
        "parent": "",
        "content": "i don't get this, can someone explain? i read it like 10 times, how can a minority of hash power create a longer chain then the main chain?",
        "created_at": "2022-08-16T10:39:41.540000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "1) You could argue that centralisation on bigger staking people is a momentary necessary sacrifice to mantain a censorship-resistant chain, and this problem wont probably emerge months into \"The merge\" anyway. 2) The situation will be as it is but at least we wont worsen it. 3) They can still do so on testnets",
        "created_at": "2022-08-16T10:41:58.560000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "You're going to need to flesh out those answers quite a bit more if they're going to be in anyway convincing. I'll give you some time to think on it - I'm off to have a glass of wine before bed. 🙂",
        "created_at": "2022-08-16T10:44:01.666000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "good night ser",
        "created_at": "2022-08-16T10:44:51.456000+00:00",
        "attachments": null
    },
    {
        "author": "slodkokwasny.",
        "category": "general",
        "parent": "",
        "content": "It's simpy better to suffer the consequences of uncontrolled MEV than launch with censoring relays.",
        "created_at": "2022-08-16T10:46:16.540000+00:00",
        "attachments": null
    },
    {
        "author": "monkeyontheloose.eth",
        "category": "general",
        "parent": "",
        "content": "just mev-boost?",
        "created_at": "2022-08-16T10:50:16.820000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "Mev-boost is an implementation of the builder specification, consensus clients only implement the builder api",
        "created_at": "2022-08-16T10:59:21.570000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "https://github.com/ethereum/builder-specs",
        "created_at": "2022-08-16T10:59:31.358000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "You don't need more hashpower to create a longer chain.  You can manipulate timestamps so that the chain progresses faster with less difficulty.",
        "created_at": "2022-08-16T11:00:06.301000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think the primary point of disagreement is:\n1. How bad is the problems of not having MEV-Boost.\n2. How long will it take for an unsupported MEV-Boost alternative to bootstrap without support from core client devs.\n3. How long will it before an unsupported MEV-Boost alternative starts causing the problems in (1).",
        "created_at": "2022-08-16T11:02:24.156000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I tend to be on the side of \"pretty bad\" for (1), but I don't believe that (2) or (3) will occur on particularly short timeframes.  I think that if we delay MEV-Boost integration into CL clients by several months we won't yet be seeing the problems of (1) come to bear.  I think this is especially true if MEV-Boost integration is coming soon, because that discourages people from spending time/effort getting the MEV-Boost alternative built/integrated/running.",
        "created_at": "2022-08-16T11:03:47.010000+00:00",
        "attachments": null
    },
    {
        "author": "0x6c",
        "category": "general",
        "parent": "",
        "content": "Is there room to consider increasing the exit queue throughput? Lido would take \u003e3 months to unwind even in the case where their customers abandon them. Or is it already a carefully considered minimum?",
        "created_at": "2022-08-16T11:17:27.710000+00:00",
        "attachments": null
    },
    {
        "author": "pieterastra",
        "category": "general",
        "parent": "",
        "content": "the exit queue throughput increases/decreases with the total validator set, just like the entry queue. Reasoning is the same, to have relative stability of the set",
        "created_at": "2022-08-16T11:21:12.345000+00:00",
        "attachments": null
    },
    {
        "author": "0x6c",
        "category": "general",
        "parent": "",
        "content": "I get the need to have a churn limit for resisting large swings. Just wondering if the dial is at the optimal place.",
        "created_at": "2022-08-16T11:22:31.828000+00:00",
        "attachments": null
    },
    {
        "author": "pieterastra",
        "category": "general",
        "parent": "",
        "content": "it's a good question. I don't know the rationale for the exact values chosen",
        "created_at": "2022-08-16T11:24:51.641000+00:00",
        "attachments": null
    },
    {
        "author": "0x6c",
        "category": "general",
        "parent": "",
        "content": "The question (obviously? don't know how terminally online the rest of you are) comes from the recent criticism from the Bitcoin folks about \"stickyness\" in cases where the community needs to react to a malicious or ideologically unaligned staking pool.",
        "created_at": "2022-08-16T11:26:39.828000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "that's what social consensus hardforks are for",
        "created_at": "2022-08-16T11:48:29.402000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It is also important that validators cannot exit quickly after they attack the network.",
        "created_at": "2022-08-16T11:55:22.082000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If a 34% of validators launch some kind of attack that we can witness, and it takes us 2 weeks to coordinate a fork, we need to make sure most of the validators are still staked so they can be punished.",
        "created_at": "2022-08-16T11:55:52.346000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "2 weeks is also quite fast to coordinate too",
        "created_at": "2022-08-16T11:56:10.608000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Numbers were just as an example.",
        "created_at": "2022-08-16T11:56:54.875000+00:00",
        "attachments": null
    },
    {
        "author": "johnydony",
        "category": "general",
        "parent": "",
        "content": "Hello Guys. \nI have a question about below log message from the geth \n```\nWARN [08-16|11:58:25.311] Invalid TTD configured                   geth=\u003cnil\u003e beacon=0xfffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffc00\nWARN [08-16|11:58:25.311] Served engine_exchangeTransitionConfigurationV1 conn=10.2.186.186:58236 reqid=1 duration=\"110.455µs\"  err=\"invalid ttd: execution \u003cnil\u003e consensus 0xfffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffc00\"\n```\nI think this is normal when TTD wasn't set up through cli flag , isn't it? \nOr If this log meant something, PLease let me know.",
        "created_at": "2022-08-16T12:00:05.192000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "which version is this ?",
        "created_at": "2022-08-16T12:03:25.265000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "\u003c@915497547437576203\u003e",
        "created_at": "2022-08-16T12:03:28.156000+00:00",
        "attachments": null
    },
    {
        "author": "johnydony",
        "category": "general",
        "parent": "",
        "content": "latest one. \nv1.10.21",
        "created_at": "2022-08-16T12:03:46.828000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "hmm, that shouldnt be an issue afaik",
        "created_at": "2022-08-16T12:04:41.573000+00:00",
        "attachments": null
    },
    {
        "author": "johnydony",
        "category": "general",
        "parent": "",
        "content": "Yeah I think so. \nThese log emits are normal isn't it?",
        "created_at": "2022-08-16T12:05:26.739000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "I think that is expected",
        "created_at": "2022-08-16T12:07:35.638000+00:00",
        "attachments": null
    },
    {
        "author": "johnydony",
        "category": "general",
        "parent": "",
        "content": "Yeah Thank you.",
        "created_at": "2022-08-16T12:08:27.631000+00:00",
        "attachments": null
    },
    {
        "author": "monkeyontheloose.eth",
        "category": "general",
        "parent": "",
        "content": "doesn't the block difficulty fix this?",
        "created_at": "2022-08-16T12:25:43.295000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Block difficulty just makes it so the timestamps on blocks show up *approximately* X distance apart.  The difficulty algorithm will adjust automatically though, so if you fork away and then mine with some tiny fraction of hashpower for a while, the difficulty will adjust way down, then you'll be back to publishing blocks every ~13 seconds.  Once you are, you can then maintain pace with the main chain, and then right at the end crank up your hashpower to publish a large number of blocks in a row to catch up and surpass the block number of the main chain.",
        "created_at": "2022-08-16T12:27:37.217000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It would take a bit of planning to figure out the ideal numbers to execute this attack, but my understanding is that there is nothing about the difficulty algorithm that prevents it.",
        "created_at": "2022-08-16T12:27:58.551000+00:00",
        "attachments": null
    },
    {
        "author": "monkeyontheloose.eth",
        "category": "general",
        "parent": "",
        "content": "thanks, thats a great explanation",
        "created_at": "2022-08-16T12:30:38.089000+00:00",
        "attachments": null
    },
    {
        "author": "monkeyontheloose.eth",
        "category": "general",
        "parent": "",
        "content": "what do you guys think about all the merge delay fud?",
        "created_at": "2022-08-16T12:31:10.938000+00:00",
        "attachments": null
    },
    {
        "author": "monkeyontheloose.eth",
        "category": "general",
        "parent": "",
        "content": "who would have to vote for it to be delayed?",
        "created_at": "2022-08-16T12:31:40.006000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "What fud?",
        "created_at": "2022-08-16T12:33:55.652000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "can you share something on it?",
        "created_at": "2022-08-16T12:34:11.627000+00:00",
        "attachments": null
    },
    {
        "author": "monkeyontheloose.eth",
        "category": "general",
        "parent": "",
        "content": "https://twitter.com/TheEylon/status/1558910615376334848",
        "created_at": "2022-08-16T12:34:35.430000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "IMO that is unlikely to cause a delay, however, it leaves room to implement the shuttered beacon chain design",
        "created_at": "2022-08-16T12:35:46.684000+00:00",
        "attachments": null
    },
    {
        "author": "dirigible6945",
        "category": "general",
        "parent": "",
        "content": "Also I wouldn't characterize legitimate concerns about transaction censorship as FUD 🙂",
        "created_at": "2022-08-16T12:37:05.129000+00:00",
        "attachments": null
    },
    {
        "author": "monkeyontheloose.eth",
        "category": "general",
        "parent": "",
        "content": "yeah, using the wrong word",
        "created_at": "2022-08-16T13:02:51.745000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "I believe this might have some naivety to it\n\nConsider the realitites that surround DeFi in the ETHPoW fork\n\nIt is painfully obvious that DeFi breaks in ETHPoW for a large number of reasons, but one of the more absolute and unreconcilable is stable coins.  Any stable coin backed by off-chain collateral goes to instant 0 cause you can't dupe the collat.  Anything backed by on-chain collat still breaks cause the collat ratio blows up (crazy to think that the ETHPoW fork will maintain enough value to support the collat ratio).\n\nCoinbase and Lido alone represent enough of the Validator Set that the majority of \"good\" validators will have to initiate a soft fork to break away from them.\n\nUSDT and USDC following a fork that does not comply with the laws seems pretty unlikely.  So if Coinbase and Lido continue on the fork where their funds have not been slashed, then it seems pretty reasonable to think that USDT and USDC will support those chains.\n\nThe community will almost certainly be extremely divided here. The market could even go so far as to take something like a 50/50 split on the matter.  This would mean that on chain collateral in both chains could break (since the value of the collateral settles at prices below the necessary ratios in both chains).\n\n\n*Hey guys, thanks for having me, look forward to conversations about this stuff.  I think that most of the conversation surrounding the merge and the current censorship issue hasn't really played out in public conversation yet, and hope that Ethereum can find good solutions now.",
        "created_at": "2022-08-16T13:38:11.477000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "you're only looking into one move in the future, a chain where non-conforming blocks are orphaned tells regulators they can control blockchains. next step is to add full onchain kyc",
        "created_at": "2022-08-16T13:40:16.157000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "I fully agree",
        "created_at": "2022-08-16T13:40:28.129000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "I am in no way shape or form condoning the censoring chain",
        "created_at": "2022-08-16T13:40:38.172000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "I am just detailing very pragmatic realities about what happens to DeFi",
        "created_at": "2022-08-16T13:40:49.501000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "Stables follow the compliant chain",
        "created_at": "2022-08-16T13:40:57.628000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "not certain",
        "created_at": "2022-08-16T13:41:06.868000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "The \"real\" Ethereum that is censorship resistant is going to have to fight through an insanely difficult battle here",
        "created_at": "2022-08-16T13:41:15.667000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "(I hope it does)",
        "created_at": "2022-08-16T13:41:21.226000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "why do you assume tether loves the us government?",
        "created_at": "2022-08-16T13:41:28.439000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "I'm pretty sure they hate it",
        "created_at": "2022-08-16T13:41:35.739000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "Well, I'd love to think that Paolo will support the real deal",
        "created_at": "2022-08-16T13:41:48.593000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "there are no laws that ban stablecoins from being on a non-censored chain",
        "created_at": "2022-08-16T13:42:01.950000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "But the government being able to exert control is a thing that should not be underestimated (clearly)",
        "created_at": "2022-08-16T13:42:03.082000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "assuming everyone yields to the government from the start is the only way to guarantee defeat",
        "created_at": "2022-08-16T13:42:39.361000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "Yeah, I mean if the counter to it is \"I trust Tether to follow the uncensored chain\" then there's not too much to talk about",
        "created_at": "2022-08-16T13:42:43.810000+00:00",
        "attachments": null
    },
    {
        "author": "pieterastra",
        "category": "general",
        "parent": "",
        "content": "agreed, if it comes to that. Your reply is a more fleshed out version of what I was trying to say 🙂",
        "created_at": "2022-08-16T13:42:47.411000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "a fork before withdrawals is another issue, I think withdrawals should be possible before it, as it allows the situation to solve itself by people withdrawing",
        "created_at": "2022-08-16T13:43:41.003000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "I genuinely believe that Ethereum has a chance to do something amazing here.  I do not think that 99.99% of people realize how hard this is about to be to pull off though.",
        "created_at": "2022-08-16T13:43:51.733000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "I totally agree that withdrawls would give people the chance to make more self interested decisions and could help us dodge some of the bullet\n\nI will be honest, I have some opinions about where we should fork and how that most people in Ethereum are probably going to hate",
        "created_at": "2022-08-16T13:45:03.767000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "I was initially worried the ofac censorship issue by flashbots isn't getting enough interest, but it started blowing up. I think it's going to be fine.",
        "created_at": "2022-08-16T13:45:07.832000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "PoS is too soon, we still have a long way to go before Ethereum can risk itself to that play\n\nSmart contract support on the L1 is a mistake.  That should not exist in any way that can be used to complicate the core consensus participation.",
        "created_at": "2022-08-16T13:45:46.010000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "there's no way to have rollups without full smart contract support.",
        "created_at": "2022-08-16T13:46:49.127000+00:00",
        "attachments": null
    },
    {
        "author": "pieterastra",
        "category": "general",
        "parent": "",
        "content": "those ships have sailed, and we would've never gotten to this point without L1 smart contracts. That wouldn't have been Ethereum at all",
        "created_at": "2022-08-16T13:47:32.948000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "There's no way to not turn consensus participants into criminals if you have turing complete contracts with permissionless authoring and censorship resistance",
        "created_at": "2022-08-16T13:47:33.583000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "I fail to see how that's even relevant, bitcoin and ripple addresses have been sanctioned too",
        "created_at": "2022-08-16T13:48:06.456000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "That's a fair take",
        "created_at": "2022-08-16T13:48:24.058000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "There's some legal differentiation between a sanctioned address and something like the government saying that it's illegal to provide services that accomplish something\n\nValidators have to start making guesses about what contracts do or don't follow the law",
        "created_at": "2022-08-16T13:49:15.539000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "I think the real problem starts once american gov clearly declares that yes, making a block with sanctioned transactions is illegal. as right now there's no enforcement except fear. not even ripple is enforcing sanctions!\nso in a way, this is a trial for the real thing.",
        "created_at": "2022-08-16T13:49:17.562000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "not a problem we face right this second",
        "created_at": "2022-08-16T13:49:32.011000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "big problem we defo do face today",
        "created_at": "2022-08-16T13:49:43.122000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "Yeah, I fully agree that anybody who thought you could fire the money makers without a fight was silly",
        "created_at": "2022-08-16T13:50:12.146000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "You can, though, have smart contracts without having permissionless authoring of turing complete smart contracts.\n\nBitcoin has zk rollups.\n\nToday.",
        "created_at": "2022-08-16T14:08:42.799000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "no it doesn't",
        "created_at": "2022-08-16T14:08:58.112000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "Lol ok",
        "created_at": "2022-08-16T14:09:03.277000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "there's not even any way to verify zk-snarks which is the only form that could fit in a bitcoin transaction",
        "created_at": "2022-08-16T14:09:58.149000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "We have been able to verify zk-snarks in Bitcoin since before taproot",
        "created_at": "2022-08-16T14:10:32.055000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "taproot just added schnorr signatures, which are more efficient for multisig.",
        "created_at": "2022-08-16T14:11:35.088000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "Right, we could do it before taproot\n\nMy point is that's been a thing for a while",
        "created_at": "2022-08-16T14:11:56.750000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "no, it's impossible.",
        "created_at": "2022-08-16T14:12:30.270000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "there are no opcodes for elliptic curves",
        "created_at": "2022-08-16T14:12:37.598000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "in extreme theory you could maybe emulate them via other opcodes, but that wouldn't fit in any block",
        "created_at": "2022-08-16T14:13:10.196000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "Yes, it does work much differently than in Ethereum",
        "created_at": "2022-08-16T14:13:10.367000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "it doesn't work at all, you can't verify zk-snarks on bitcoin.",
        "created_at": "2022-08-16T14:13:21.060000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "https://medium.com/coinmonks/zk-rollups-on-bitcoin-ce35869b940d",
        "created_at": "2022-08-16T14:15:47.251000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "that's bsv",
        "created_at": "2022-08-16T14:16:16.631000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "Yes, that is true",
        "created_at": "2022-08-16T14:16:53.595000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "they added opcodes and have gb+ blocks, I suppose it may be possible there",
        "created_at": "2022-08-16T14:17:12.108000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "This is all to a very different point than the original one.\n\nI do think it's pretty valid to say that Ethereum took some extreme risks in allowing the completeness it did for smart contracts in the L1 (and this tornado conversation captures exactly how risky that was)",
        "created_at": "2022-08-16T14:20:48.300000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "Intrinsically, Ethereum has done an obviously wonderful job at enabling the opcodes\n\nThe risks are cause of extrinsics, but pretending like those don't exist only gets harder the bigger the network gets",
        "created_at": "2022-08-16T14:23:02.893000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "This conversation really isn’t on topic anymore, can you please move it to \u003c#595721451651465227\u003e or keep it focused on the actual merge? Thanks",
        "created_at": "2022-08-16T14:30:08.308000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": "Thanks Tim\n\nAny thoughts on the original concern?",
        "created_at": "2022-08-16T14:31:40.766000+00:00",
        "attachments": null
    },
    {
        "author": "postcapone",
        "category": "general",
        "parent": "",
        "content": ".",
        "created_at": "2022-08-16T14:31:53.071000+00:00",
        "attachments": null
    },
    {
        "author": "monkeyontheloose.eth",
        "category": "general",
        "parent": "",
        "content": "is the block proposer network thing going to come right in with the merge?",
        "created_at": "2022-08-16T14:52:38.707000+00:00",
        "attachments": null
    },
    {
        "author": "monkeyontheloose.eth",
        "category": "general",
        "parent": "",
        "content": "or some blocks after it?",
        "created_at": "2022-08-16T14:52:44.879000+00:00",
        "attachments": null
    },
    {
        "author": "tokey1475",
        "category": "general",
        "parent": "",
        "content": "is there a short term solution by using the proposed circuit breaker mechanism?  In addition to a threshold for completely missed slots, could the CL/EL work together to trigger the circuit breaker after a transaction is included in a locally built block over a threshold # of blocks?",
        "created_at": "2022-08-16T16:01:15.927000+00:00",
        "attachments": null
    },
    {
        "author": "tokey1475",
        "category": "general",
        "parent": "",
        "content": "in other words if the same transaction hash appears in a locally built block \u003e x number of times you assume that the builder network is censoring and stop using the relay",
        "created_at": "2022-08-16T16:01:43.761000+00:00",
        "attachments": null
    },
    {
        "author": "tokey1475",
        "category": "general",
        "parent": "",
        "content": "you could even ignore the bottom ~5% of the block if you are worried about transactions repeatedly being pushed out due to 'honest' mev",
        "created_at": "2022-08-16T16:06:39.683000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "Our explorer now tags flashbot blocks.. just in case \u003c:heh:748711956344733696\u003e  https://goerli.beaconcha.in/block/3679437",
        "created_at": "2022-08-16T16:27:46.396000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "lol these guys stole my idea, I ~finished a writeup on that in april ( https://tr3y.io/articles/crypto/bitcoin-zk-rollups.html )",
        "created_at": "2022-08-16T17:12:53.851000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "this is a really dangerous game to play since the network topology is hard to rely on and we can't expect all nodes to store all pending valid transactions forever, they might \"honestly drop\" certain transactions from the mempool depending on fees and such",
        "created_at": "2022-08-16T17:16:31.558000+00:00",
        "attachments": null
    },
    {
        "author": "vinnie9190",
        "category": "general",
        "parent": "",
        "content": "Partecipation dropping below 70% ... 😩",
        "created_at": "2022-08-16T17:20:34.890000+00:00",
        "attachments": null
    },
    {
        "author": "tokey1475",
        "category": "general",
        "parent": "",
        "content": "sure, and it won't be perfect, but assuming we are willing to sacrifice 100% coverage of censored transactions (e.g. low paying ones which are initially censored and then are outpriced), we should be able to prevent relays from censoring with a very short lookback window (i'm thinking single digits # of blocks).\n\nif the censoring relay has low network penetration it will also be missed, but that is probably ok in the short term.  In anycase the risks of over/underfitting are pretty small IMHO especially relative to the risks of ignoring censorship (not just political but also oracle updates etc...)",
        "created_at": "2022-08-16T17:31:12.450000+00:00",
        "attachments": null
    },
    {
        "author": "tokey1475",
        "category": "general",
        "parent": "",
        "content": "One thing I'm not clear on is if right now all EL's are continuously building mempool blocks or if they only build them when asked to by the CL",
        "created_at": "2022-08-16T17:34:52.286000+00:00",
        "attachments": null
    },
    {
        "author": "marioevz",
        "category": "general",
        "parent": "",
        "content": "~~https://discord.com/channels/595666850260713488/910910348922589184/1008980969769938945~~\nAh wait, that is for ropsten nvm",
        "created_at": "2022-08-16T17:39:00.395000+00:00",
        "attachments": null
    },
    {
        "author": "tokey1475",
        "category": "general",
        "parent": "",
        "content": "anyway I will take it to \u003c#874767108809031740\u003e",
        "created_at": "2022-08-16T17:40:25.845000+00:00",
        "attachments": null
    },
    {
        "author": "sagan0399",
        "category": "general",
        "parent": "",
        "content": "\u003c@552133098075193354\u003e",
        "created_at": "2022-08-16T20:03:54.879000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "unknown.png",
                "content": "6b2000d833dd4dbc07039b1608397abd1b2ddbce89890dabd9079551bb321833"
            }
        ]
    },
    {
        "author": "sagan0399",
        "category": "general",
        "parent": "",
        "content": "40K ropstein and you in exchange for Sebelia?",
        "created_at": "2022-08-16T20:11:35.302000+00:00",
        "attachments": null
    },
    {
        "author": "sagan0399",
        "category": "general",
        "parent": "",
        "content": "Can you help me? This is my address 0xaf62072558f7623681b0187241edfeae3f616b0a",
        "created_at": "2022-08-16T20:12:42.822000+00:00",
        "attachments": null
    },
    {
        "author": "monkeyontheloose.eth",
        "category": "general",
        "parent": "",
        "content": "\u003c@301186049323958275\u003e",
        "created_at": "2022-08-16T20:37:19.527000+00:00",
        "attachments": null
    },
    {
        "author": "uri_bloxroute",
        "category": "general",
        "parent": "",
        "content": "Just seeing this - and was actually considering reaching out to you regardless... \nwhere did you ping me? everything on discord drowns out if it's not a DM....\nlet me catch up on the million messages and respond",
        "created_at": "2022-08-16T20:56:25.014000+00:00",
        "attachments": null
    },
    {
        "author": "uri_bloxroute",
        "category": "general",
        "parent": "",
        "content": "\u003c@301186049323958275\u003e \u003c@77492786336636928\u003e \u003c@340345049063882753\u003e \u003c@361447803194441738\u003e - I'm trying to squeeze reading the messages from the past 12 hrs into my work day, so for now let me give you bloXroute's high level, which ill likely make you feel a bit better:\n\n- we *intend* to provide multiple choices to validators, allowing them to choose whether they want to maximize profit, avoid front-running, or avoid specific (e.g. OFAC) addresses.\n\n- We don't think it's our role to choose for validators which Tx to include (as a block-builder), or which blocks to accept (as a relay), and we take no active part in interacting with these addresses.\nwe only help validators to construct blocks efficiently based on their requirements, leaving it for them to propose and attest\n\n- while the max-profit and avoid-frontrunning options are ready for the merge, providing OFAC-compliant might not be (which is probably ok for all of you 😄 )\n\n- like everyone else, we ARE still processing the legal implications, so that's our *intention*. We're more than glad to collaborate with any EL and CL dev teams \u0026 validator, and keep everyone updated where we stand (feel free to DM me, I'll likely miss a @mention)\n\nhope this helps 🙏  I'll go online again in a few hours to try to catch up with the conversation, or answer if anyone has specific Qs",
        "created_at": "2022-08-16T21:45:34.922000+00:00",
        "attachments": null
    },
    {
        "author": "kudeta",
        "category": "general",
        "parent": "",
        "content": "I read the conversations above and understand and support the general sentiment. However, it seems like it’s a bit late to seriously consider removing builder APIs from clients. The timing is one thing, but more importantly the cat is truly out the bag given the code is written and tested, so any large staking operation will likely have the resources (and financial motivation) to simply rebase it right back in, enhancing profitability and driving further economic centralisation of staking in the longer term. While on the other hand leaving the APIs in might feel like you are supporting censorship, the reality is that PoW miners and searchers in general have always had the ability to selectively censor, should they chose to do so. At this stage I’d rather see a heavily resourced alternative relay project formed, combined with some aggressive community mobilisation to highlight the dangers and move people away from flashbots’ relays. Finally, while a UASF  is a good threat to dangle, in the cold light of day slashing many thousands of ordinary ETH holders staking at Coinbase, Kraken etc (if they chose to censor) would be incredibly divisive, until these holders had at the very least been given plenty of time to exit (which I assume means post Shanghai).",
        "created_at": "2022-08-16T22:20:29.449000+00:00",
        "attachments": null
    },
    {
        "author": "slodkokwasny.",
        "category": "general",
        "parent": "",
        "content": "It's probably good to include bloXroute relay as the default for eth clients to counter the already established position of flashbots. Bloxroute was tested in one of the goerli shadows forks so it shouldn't be a technical problem. If clients launch with Builder API, it's better to promote a non-censoring relay than make people stick with more known Flashbots.",
        "created_at": "2022-08-16T22:31:16.695000+00:00",
        "attachments": null
    },
    {
        "author": "protoplanetary",
        "category": "general",
        "parent": "",
        "content": "Speaking as a solo staker, PBS is obviously necessary to prevent centralizing effects at the block proposer level, MEV-boost is obviously the best first step at implementing it, and I plan to run it *if and when* there are at least two independent relays available that verifiably (according to relay monitoring) do not censor, which are the only relays I will personally consider using. I understand that some parties may feel compelled to use censoring relays, and do not blame MEV-boost for the existence of such relays, although I'll strongly encourage all stakers to avoid them. Just my two gwei 🙂",
        "created_at": "2022-08-16T22:34:37.963000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Clients are not including any relay or builder by default. They'll all use the local EL by default which is the most decentralised option. It will be up to the community to pressure setup guides, staking pools and users generally to choose \"good\" relays.",
        "created_at": "2022-08-16T22:37:23.608000+00:00",
        "attachments": null
    }
]