[
    {
        "author": "yolo_otm_calls",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This guy gets it 👆. \u003c@700178771550142474\u003e is just a fucking idiot",
        "created_at": "2022-05-14T00:26:51.235000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The recent aws and multiple crypto website hack makes me wonder if there’s 66%+ of validators on aws and what hack could occur if so 🤔 maybe there should be a provision that only 10% of the vote can come from a single geolocation or 20% max per continent?",
        "created_at": "2022-05-14T02:31:56.424000+00:00",
        "attachments": null
    },
    {
        "author": "senator1",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Aws has datacenters on every continent, and they all have the same provisioning templates, so geolocation wont make a difference really.",
        "created_at": "2022-05-14T04:13:35.308000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "A good point",
        "created_at": "2022-05-14T04:42:18.380000+00:00",
        "attachments": null
    },
    {
        "author": "syentist.",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "there is zero reason to push back the bomb to 2023. That would give more time for grifters to coordinate a PoW fork. It should be as close to the merge release as possible. Which is why making a decision on it as late as possible is good, as that would give an even more accurate idea on when the merge is ready to be pushed out",
        "created_at": "2022-05-14T10:16:56.589000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Every single mining pool has the skill to push back the bomb if they wanted to continue a fork 😅 it’s like changing a tire.\n\nAlso the point of the bomb has always been to hurry development along. It’s never been meant to spike any forks and the principle of being able to disagree and fork is one of eth’s founding ethos.",
        "created_at": "2022-05-14T13:55:35.662000+00:00",
        "attachments": null
    },
    {
        "author": "syentist.",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This needs client releases for the miners to implement no? And if you are advocating for PoW forks after the merge as a reason for pushing back the bomb excessively, one could question if your interests are long term aligned with the Ethereum community, or yet another rent extractive short term mining relationship (ala bitsbetripping dude from the eip1559 early 2021 period)",
        "created_at": "2022-05-14T14:07:40.038000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Almost single mining pool is using their own custom modified version of geth they know how to modify it if needed. \n\nJanuary isn’t excessive and the merge can happen before the bomb it makes no sense to try to time them weeks apart. \n\nIf we didn’t care about ethereum we wouldn’t have submitted prs to correct bugs and would have just kept them to ourselves. We also made gasprice.io",
        "created_at": "2022-05-14T14:09:28.178000+00:00",
        "attachments": null
    },
    {
        "author": "yokem55",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The problem with establishing a pow fork post merge isn't technical, it's the social coordination. The miners sponsoring the fork would have to come to an agreement on whether to kill the ice age or postpone it, whether to change the mining algo to something not asic friendly or not, whether to keep 1559 or not, and decide on a sensible gas limit given the likely low value of the chain and likelihood of spam attacks.\n\nThen the reality would set in that any fiat liquidity for powEth that appeared would be dumped on by pre-merge holders. Which means big decisions about creating a lock or burn on pre-fork holdings.\n\nAll these are solveable problems, given enough time, but it takes far more work then just fixing the ice age.\n\nMinimizing that runway to make those decisions in which there is a functioning but zombie chain is very much in the interests of the developers of the proof of stake chain.",
        "created_at": "2022-05-14T14:33:20.919000+00:00",
        "attachments": null
    },
    {
        "author": "yokem55",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "And small bumps to the ice age dont need to take weeks. The geth update that fixed the evm bug last august was pushed out within a week or so. In my mind, the costs of small ice age bumps are low compared to the costs of a zombie chain hanging out for months.",
        "created_at": "2022-05-14T14:37:01.268000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I really don’t get this irrational fear of a 2nd chain. Pretty much every crypto network has in its ethos that people are allowed to fork and I don’t think a single one actively fights it. Your arguing against a core principle of ethereum that people are allowed to fork. You saw that during the dao when some choose to fork off to reverse the hack.",
        "created_at": "2022-05-14T15:06:46.208000+00:00",
        "attachments": null
    },
    {
        "author": "syentist.",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "And how does having to coordinate disabling the bomb disallow forking? Planning against a zombie chain existing after Eth core moves to PoS doesn't mean that at all, and protects retail from yet more scamming by the inevitable grifters that would make use of this opportunity (seems to be pretty clear who they are)",
        "created_at": "2022-05-14T15:12:00.737000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Pushing back the bomb to more than a few weeks after the expected date the merge will be complete is not crazy. There is a very good chance bugs will come up delaying things and pushing it back further allows for pushing the bomb to not delay the merge further. Development tends to be conservative and deadlines should assume a bad scenario instead of the best case. We're talking 2-3 months here not years.\n\nI'm not sure if your accusing us of being scammers but given that we have 20 mil of mined funds in our account that we haven't rugged I'd say we're trustworthy.",
        "created_at": "2022-05-14T15:17:10.919000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Isn't\n\u003e There is a very good chance bugs will come up delaying things and pushing it back further allows for pushing the bomb to not delay the merge further.\njust a completely generic argument? It's been introduced in this channel in the same vague way before, that, oh, well, who knows, something could go wrong, better to have ${PREFERRED_BACKUP_PLAN}, just in case.",
        "created_at": "2022-05-14T15:18:56.297000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I would suggest, also, that what's going on here isn't assuming so much as inferring from the extensive, ongoing, and continuing tests being conducted, and phrasing it that way risks being slightly disingenuous.",
        "created_at": "2022-05-14T15:22:23.916000+00:00",
        "attachments": null
    },
    {
        "author": "redpill_tw",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "hi \u003c@360491619402776577\u003e is there a guide to joining ropsten merge using lighthouse + geth somewhere please?",
        "created_at": "2022-05-14T15:24:14.239000+00:00",
        "attachments": null
    },
    {
        "author": "adorable_axolotl_54784",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think everyone agrees the merge happening safely is more important than it happening quickly. I think everyone also agrees if it is necessary to delay the bomb it will be delayed. IMO though the constant debate around whether to do it preemptively or not and when is simply unnecessary. There is a chance it won't need to be delayed. If Ropsten goes well it does not seem unrealistic to me to do Mainnet 10 weeks later. So why not just get behind that push and if we have to delay it later then delay it? The constant time and effort spent debating it back and forth just drains time and energy from everything else.",
        "created_at": "2022-05-14T16:08:30.083000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "How bad will diff be in 10 weeks I guess is the question",
        "created_at": "2022-05-14T16:17:36.723000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think we’re looking at 2000+ gwei daily average gas. It’s going to hit l2’s and things that need block space hard.",
        "created_at": "2022-05-14T16:17:37.164000+00:00",
        "attachments": null
    },
    {
        "author": "adorable_axolotl_54784",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "u mean, how bad will the bomb effect be in mid august correct?",
        "created_at": "2022-05-14T16:18:05.609000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yep",
        "created_at": "2022-05-14T16:18:22.365000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Ethereum is a lot busier than back when the bomb was left alone last time.",
        "created_at": "2022-05-14T16:18:35.402000+00:00",
        "attachments": null
    },
    {
        "author": "adorable_axolotl_54784",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "i think there has been data to show we may be at 17-18s block times, lets assume 20 to be conservative",
        "created_at": "2022-05-14T16:18:45.527000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Your talking about increasing daily costs to run a l2 by x10 or more.",
        "created_at": "2022-05-14T16:18:48.266000+00:00",
        "attachments": null
    },
    {
        "author": "adorable_axolotl_54784",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "isnt that a 50% increase?",
        "created_at": "2022-05-14T16:18:54.910000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "A 10% reduction in transaction capacity will lead to a lot more than a 10% increase in gas price",
        "created_at": "2022-05-14T16:19:14.662000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Since higher gas price doesn't mean more capacity. So you have the same # of txs fighting for less space. So your basically kicking 10% of ethereum off the network while making the remaining 90% pay a premium.",
        "created_at": "2022-05-14T16:20:27.174000+00:00",
        "attachments": null
    },
    {
        "author": "adorable_axolotl_54784",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "yes that is true. do we have data on that relationship?",
        "created_at": "2022-05-14T16:20:31.324000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I don't believe there is...but maybe someone else can chime in",
        "created_at": "2022-05-14T16:20:46.171000+00:00",
        "attachments": null
    },
    {
        "author": "adorable_axolotl_54784",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "and then the question is, is 3 weeks of higher gas prices worth it?",
        "created_at": "2022-05-14T16:21:07.346000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "20 sec block times means a reduction of 30% of ethereum's capacity. So when I say expect huge gas prices for daily use I mean it.",
        "created_at": "2022-05-14T16:21:12.360000+00:00",
        "attachments": null
    },
    {
        "author": "adorable_axolotl_54784",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "and also",
        "created_at": "2022-05-14T16:21:29.526000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Its like saying is allowing your employees to work in an office flooded with 2 feet of water worth avoiding the work required to get them portables.",
        "created_at": "2022-05-14T16:21:53.316000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Polygon and others require block space so they can't avoid high gas. So they are going to be pummeled by costs.",
        "created_at": "2022-05-14T16:22:19.720000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "While normal ethereum users are going to quit and may not come back.",
        "created_at": "2022-05-14T16:22:31.652000+00:00",
        "attachments": null
    },
    {
        "author": "adorable_axolotl_54784",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "not necessarily, because there are a few issues, 1. You may be able to merge a couple weeks earlier when its only 16s block times (don't think much impact) and 2. there is a cost with the delay. But the point is we don't have to debate this. There is no downside it getting behind the effort to merge in early august (if block times allow it) and just delaying later if need be. Why kill momentum now for no reason?",
        "created_at": "2022-05-14T16:24:08.358000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I know there's always the discussion about how much pow costs ethereum, but how much income will ethereum lose by deliberately raising gas extraordinarily high for weeks making the network unusable for casual users? How much are customers and business partners worth?  How much money will polygon and other dapps use in lost gas fees and customer base?",
        "created_at": "2022-05-14T16:24:08.364000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm saying why hurt your customers? Just delay it then focus on the merge. The delay is a day or two of distraction not the weeks some claim. Customers are the #1.",
        "created_at": "2022-05-14T16:24:41.006000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Your basically sacrificing 5-10% of your customer base by doing this.",
        "created_at": "2022-05-14T16:25:25.257000+00:00",
        "attachments": null
    },
    {
        "author": "adorable_axolotl_54784",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "it's been opined by others who know much better that its not a day or two, its 3 weeks. and no one is saying to hurt anyone. If it becomes clear that there will be a pain then the bomb will be delayed.",
        "created_at": "2022-05-14T16:25:47.812000+00:00",
        "attachments": null
    },
    {
        "author": "adorable_axolotl_54784",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Also I disgaree youll lose users. There have been many 2 week periods of very elevated gas prices before, this would be no different.",
        "created_at": "2022-05-14T16:26:14.439000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I mean its not 120 hours of work per dev. It's 1-2.",
        "created_at": "2022-05-14T16:26:24.569000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Those 2 weeks cost ethereum a lot of money, and they were nothing compared to how bad it will be",
        "created_at": "2022-05-14T16:26:47.667000+00:00",
        "attachments": null
    },
    {
        "author": "adorable_axolotl_54784",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "But the whole point I am making is why are we even having this discussion, just wait till June (before any block impact) and then you can have this discussion. Having it right now is just a time/effort drain.",
        "created_at": "2022-05-14T16:27:07.151000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "not to mention the risk the merge is delayed and then we got to hurriedly try to delay the bomb before the network collapses",
        "created_at": "2022-05-14T16:27:10.398000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The bomb should be defused before it goes off. Right now it feels like a kid who is already late with their homework.",
        "created_at": "2022-05-14T16:27:35.281000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Letting the bomb go on does nothing but hurts ethereums users and the community.",
        "created_at": "2022-05-14T16:27:46.543000+00:00",
        "attachments": null
    },
    {
        "author": "adorable_axolotl_54784",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It's been shown that there will be no impact until July, waiting to see how Ropsten goes early June, then having the discussion is a 0 downside free option. Just wait till then and then we'll have this debate.",
        "created_at": "2022-05-14T16:29:52.103000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There's already an impact...",
        "created_at": "2022-05-14T16:30:01.951000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e Right now it feels like a kid who is already late with their homework.\n\nHow/why? I know this is a loose metaphor, but \"already late with their homework\" is yet another way of insinuating the same thing you did with \"assume\" before, minimizing the extent to which people have been testing the merge already.",
        "created_at": "2022-05-14T16:30:03.668000+00:00",
        "attachments": null
    },
    {
        "author": "kommstar",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think the Ropsten merge is a solid point to discuss this issue. If the merge goes well there then there is some consideration for not moving the bomb. If the merge does not go well then more consideration should be given to moving the bomb back.",
        "created_at": "2022-05-14T16:30:06.648000+00:00",
        "attachments": null
    },
    {
        "author": "kommstar",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "June 8th is the Ropsten merge",
        "created_at": "2022-05-14T16:30:13.788000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Pointedly: how is Ethereum \"already late with their homework\"? Specifically.",
        "created_at": "2022-05-14T16:30:26.465000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Or does it just \"feel\" like it?",
        "created_at": "2022-05-14T16:30:44.803000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "",
        "created_at": "2022-05-14T16:31:09.472000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "unknown.png",
                "content": "83559493cf16af21c26f40df3a68751947d53d69b1a641235fdf237605f36231"
            }
        ]
    },
    {
        "author": "adorable_axolotl_54784",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "15s block times early July, will hardly make a difference and cause no long term damage.",
        "created_at": "2022-05-14T16:31:25.699000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "In 2017 ethereum allowed block times to get to 30 seconds which would kill the current network.",
        "created_at": "2022-05-14T16:31:27.402000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Thats a 10-20% decrease in capacity likely resulting in a 50-100% increase in gas costs to use the network.",
        "created_at": "2022-05-14T16:31:48.818000+00:00",
        "attachments": null
    },
    {
        "author": "kommstar",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "btc block times are 10 minutes and they are still alive",
        "created_at": "2022-05-14T16:31:54.679000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Tim said they could just move the bomb to sept anyway which would be fine. Making users and dapps pay higher gas is unacceptable.",
        "created_at": "2022-05-14T16:32:39.048000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The gas costs, lost earnings, and lost customers across the ethereum ecosystem will be in the billions. Ask sushiswap or open sea how they feel about 2 weeks of horrendous gas. Or Polygon how they feel about paying 10x more for block space. With ethereum price/demand as weak as it is is this really the time to be making people move to other networks?",
        "created_at": "2022-05-14T16:33:04.342000+00:00",
        "attachments": null
    },
    {
        "author": "adorable_axolotl_54784",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "A 13% decrease in block space is unlikely to cause a 50-100% increase in gas price. Anyway point is, no decision is going to be made until after Ropsten so in my opinion is  waste of effort to have the debate now. Just focus on making as much progress between now and then as possible IMO.",
        "created_at": "2022-05-14T16:39:14.171000+00:00",
        "attachments": null
    },
    {
        "author": "adorable_axolotl_54784",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Wont even be 14s block times by mid June. After Ropsten if there is consensus to delay, then there will be a delay, save the debate for then.",
        "created_at": "2022-05-14T16:39:28.221000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "A 13% decrease will lead to a 13% decrease in txs which means you lose 13% of your business. Any company would find that unacceptable.",
        "created_at": "2022-05-14T16:40:08.234000+00:00",
        "attachments": null
    },
    {
        "author": "adorable_axolotl_54784",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Companies have 13% reduced capacity for a couple weeks all the time, thats nonsense.",
        "created_at": "2022-05-14T16:40:52.849000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Not when they have a choice, but yes good example.",
        "created_at": "2022-05-14T16:41:27.122000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Is there a reason you've avoided commenting on every single suggestion along the lines (but from multiple people) of\n\u003e Anyway point is, no decision is going to be made until after Ropsten so in my opinion is  waste of effort to have the debate now.\n?\n\nNeither substantively addressing it nor explicitly disagreeing with it, except maybe with empty analogies about children and homework.",
        "created_at": "2022-05-14T16:42:04.244000+00:00",
        "attachments": null
    },
    {
        "author": "adorable_axolotl_54784",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "No harm is done by waiting for June. Enough on this. You raise some good points. Well debate it then. 🤝",
        "created_at": "2022-05-14T16:42:18.179000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The bomb has already gone off so to me the decision should be made now asap instead of delayed again. To me customers are already suffering so it would be like Canada's decision to not allow in Ukranian refugees for 3 weeks while they get their act together. Sorry for not commenting earlier.",
        "created_at": "2022-05-14T16:42:48.146000+00:00",
        "attachments": null
    },
    {
        "author": "brandobot.",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This shouldn’t even be a question. As one of the most used crypto platforms, degradation of a service should always be avoided. Can you imagine if a business today makes customers suffer for 3 weeks when it could be avoided? The customer will be pissed and their perception of the company will be changed.",
        "created_at": "2022-05-14T16:43:56.220000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "But, alright, that's an explanation.",
        "created_at": "2022-05-14T16:44:17.574000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Sorry, most recent example that came to mind. Definitely should use a less political one.",
        "created_at": "2022-05-14T16:45:37.361000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Bitcoin is *designed* to be operated with long blocks times. Ethereum is *designed* to operate with short blocks times.\n\nYou can't just compare them like they are the same 1:1 cryptocurrency.",
        "created_at": "2022-05-14T16:56:25.477000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "[citing the opinions against the difficulty bomb that miners would revolt] Also I'm really surprised no one realized during ACD that delaying the difficulty bomb = more profits to miners in form of static block rewards, as there will be more blocks per day.",
        "created_at": "2022-05-14T16:59:21.339000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "And please stop talking about miners like they are the worst people in the world. Put them into your perspective - you are having a steady income on top of which you plan your life spending. And one day some people just \"break into your house\" and say no more mining to you, and just take everything and leave. **Of course they will be upset**.",
        "created_at": "2022-05-14T17:03:53.839000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I know that it has been a trend to hate miners, but seriously start thinking on your own. You are directly insulting people who mine Ethereum.",
        "created_at": "2022-05-14T17:04:41.961000+00:00",
        "attachments": null
    },
    {
        "author": "asd9819",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hello, are there any disputed implementation which were comprised for The Merge?",
        "created_at": "2022-05-14T17:25:03.463000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Not yet, no will publish something next week",
        "created_at": "2022-05-14T17:51:34.055000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminion",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "For those vigorously hand-wringing over increased block times - remember that _temporarily_ increasing the block gas limit to compensate is an option that will not do any long-term damage. As long as miners are happy to follow the devs' guidance on this - and they have generally been very good about this in the past - then there's no reason that overall capacity need drop if block times increase for a month or two. If that buys time to avoid a pre-Merge  bomb-postponement fork, then it's a decent option.",
        "created_at": "2022-05-14T18:03:22.678000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I thought gas limits were set low to avoid unknown attacks that may exist with high gas blocks+avoid the bad publicity of a drop in gas limit post merge?",
        "created_at": "2022-05-14T18:13:00.445000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminion",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Gas limits are set as they are primarily in order not to let state to grow faster than reasonable nodes can handle in the long term. If the network throughput remains the same (gas/second) then no problem.",
        "created_at": "2022-05-14T18:17:02.894000+00:00",
        "attachments": null
    },
    {
        "author": "yolo_otm_calls",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Covid lockdowns?????",
        "created_at": "2022-05-14T18:18:16.853000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Ah, learn something new everyday thanks.",
        "created_at": "2022-05-14T18:18:32.087000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I appreciate that the merge is obviously tightly coupled with the bomb, but just want to highlight that huge convos about the bomb are a bit tangential and distract from coordinating on actual merge work in this channel. \n\nWe don't have a great alternative, but just be mindful about whether it's worth it to ping everyone working on the merge with a comment before you make it 😅",
        "created_at": "2022-05-14T19:12:15.909000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think this channel is super valuable for non-client contributors to be able to chime in given that \u003c#892088344438255616\u003e is whitelisted, so I don't want to restrict it, and the bomb stuff isn't spam obviously, but the past ~12h are definitely much higher volume \u0026 lower signal for client + testing teams.",
        "created_at": "2022-05-14T19:13:50.187000+00:00",
        "attachments": null
    },
    {
        "author": "asd9819",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "any lead?",
        "created_at": "2022-05-14T19:15:26.811000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm not sure I undersrtand your question",
        "created_at": "2022-05-14T19:16:34.340000+00:00",
        "attachments": null
    },
    {
        "author": "asd9819",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "How do you intend to resolve implementation disputes that might need a compromise?*",
        "created_at": "2022-05-14T19:29:06.482000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "We use a set of common specifications which we consider a \"source of truth\" and then test the various implementations not only against that, but also against each other. If we do find a 'dispute' that is basically a bug and our goal is to find all of these before we go to mainnet.",
        "created_at": "2022-05-14T19:32:51.042000+00:00",
        "attachments": null
    },
    {
        "author": "evanvanness",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "this channel is too noisy, I would argue that it is time to limit participation to an approved list",
        "created_at": "2022-05-14T19:47:35.612000+00:00",
        "attachments": null
    },
    {
        "author": "asd9819",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Thank you!",
        "created_at": "2022-05-14T20:02:52.438000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Slow mode would help as well",
        "created_at": "2022-05-14T20:19:05.427000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Or, you could just create a channel dedicated to the difficulty bomb discussion",
        "created_at": "2022-05-14T20:19:38.124000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This is the best option",
        "created_at": "2022-05-14T20:19:51.228000+00:00",
        "attachments": null
    }
]