[
    {
        "author": "benjaminchodroff",
        "category": "general",
        "parent": "",
        "content": "Contesting required submitting a different BLS withdrawal address signature and submitting evidence on chain such as a signature made with the deposit address. We did have four validators get contested recently, but the attacker was not in possession of the validator seed phrase - only the deposit address seed phrase.",
        "created_at": "2023-04-02T00:46:57.894000+00:00",
        "attachments": null
    },
    {
        "author": "schone_wizard",
        "category": "general",
        "parent": "",
        "content": "I mean as for as myself the end user, how would I know besides looking at the latest submissions under the `mainnet` directory?",
        "created_at": "2023-04-02T13:04:22.689000+00:00",
        "attachments": null
    },
    {
        "author": "schone_wizard",
        "category": "general",
        "parent": "",
        "content": "i'm also curious about volunteering, why do we submit the change-operations.json before hand if it would be more advantageous to submit right after the hard fork happens?",
        "created_at": "2023-04-02T13:05:00.688000+00:00",
        "attachments": null
    },
    {
        "author": "schone_wizard",
        "category": "general",
        "parent": "",
        "content": "i should say that I think what you guys are doing is 👍",
        "created_at": "2023-04-02T13:06:36.462000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminchodroff",
        "category": "general",
        "parent": "",
        "content": "We really appreciate the support! The only way to see if you are compromised (highly unlikely) is to look at the CLWP mainnet directory in GitHub. While this is not ideal, it is far better than waking up on the day of Capella and finding out your validator has silently been set to a withdrawal address that you do not control. \n\nWe encourage other people to volunteer to help those of us out that are confident have a compromised seed phrase. The more people who help set their node with our CLWP submissions, the harder it becomes for an attacker's message to propagate to new nodes. Once a node has a submission received for a given validator index, it will no longer gossip any new messages. We greatly appreciate anyone who wants to volunteer: https://github.com/benjaminchodroff/ConsensusLayerWithdrawalProtection/#volunteer\n\nIf you are 100% confident that your validator seed phrase has been stored securely offline, there is no need to rush to set a withdrawal address at Capella. However, we do recommend anyone who has not generated and stored their validator seed phrase securely to start looking into setting their withdrawal address to a secure address before Capella. Ensure that this process is done on a secure offline machine using utilities such as ethdo (which can handle the signing while completely offline) and consider using an Ubuntu live USB as a way to ensure no malware is running your computer. Then, you can either use your own node (recommended for fastest broadcast at Capella) or https://beaconcha.in/tools/broadcast (simple and effective) to broadcast the message.",
        "created_at": "2023-04-02T13:25:02.847000+00:00",
        "attachments": null
    },
    {
        "author": "schone_wizard",
        "category": "general",
        "parent": "",
        "content": "I was under the impression that messages broadcast before the hard fork, could be processed anywhere from 1-5 days after the hard fork, while messages transmitted at the hard fork have a greater chance at being processed faster.  Does that not affect the timing of when to submit the change operations for CLWP?",
        "created_at": "2023-04-02T14:30:29.571000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminchodroff",
        "category": "general",
        "parent": "",
        "content": "It is not possible to gossip before the hard fork, however, I think your point is there will be an initial delay at the hard fork due to many people trying to broadcast immediately. Only 16 BLS changes can happen per slot... so we very well could see 1-5 days in delays before these changes are fully committed to chain. Regardless, broadcasting early for anyone who did not securely store their validator seed phrase is recommended. Even if not committed on chain, having the message heard by other beacon nodes helps statistically prevent an attacker from having their attack message be heard by other nodes. If your validator seed phrase is compromised and you are racing, the winner is entirely down to chance... but the more nodes that hear your message over an attackers can help improve your chances of winning.",
        "created_at": "2023-04-02T14:37:45.910000+00:00",
        "attachments": null
    },
    {
        "author": "schone_wizard",
        "category": "general",
        "parent": "",
        "content": "I guess point (6) here in \u003c@755590043632140352\u003e doc is what's making me ask what i'm asking",
        "created_at": "2023-04-02T14:42:09.302000+00:00",
        "attachments": null
    },
    {
        "author": "schone_wizard",
        "category": "general",
        "parent": "",
        "content": "https://hackmd.io/@potuz/H1P8X5xZn",
        "created_at": "2023-04-02T14:42:10.831000+00:00",
        "attachments": null
    },
    {
        "author": "schone_wizard",
        "category": "general",
        "parent": "",
        "content": "however I see that point (1) emphasizes what you're saying, so it's better to submit those before hand to essentially 'lock' nodes to a validator index and change operation tuple",
        "created_at": "2023-04-02T14:42:48.411000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Ok Ive no clue what just happened but I'm tagged in a channel that has a million unread messages and I didn't even know existed. The name also suggest there's a non-public channel",
        "created_at": "2023-04-02T16:27:47.250000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "Yes interop is the non-public channel (its read only for the public)",
        "created_at": "2023-04-02T16:28:42.087000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "\u003c@489217181104734219\u003e you're confusing the two issues described in my post. For the purposes of the CLWP submitting before the fork is imperative as clearly stated in that doc under \"if you think your keys were hacked...\". For essentially every one else, it's better to submit after",
        "created_at": "2023-04-02T16:31:50.792000+00:00",
        "attachments": null
    },
    {
        "author": "schone_wizard",
        "category": "general",
        "parent": "",
        "content": "me being confused is about normal",
        "created_at": "2023-04-02T17:26:23.183000+00:00",
        "attachments": null
    }
]