[
    {
        "author": "mixy1",
        "category": "general",
        "parent": "",
        "content": "Hi guys, could anyone explain to me why this https://beaconcha.in/block/18028057 shows an eth1 block that's like 8 hours older than the beacon chain block?\n\nI've been trying to wrap my head around the beacon chain and although I've been able to answer quite a couple of my questions from: https://notes.ethereum.org/@vbuterin/SkeyEI3xv, https://eth2book.info/capella/ and https://github.com/ethereum/annotated-spec I'm still finding it to be a really hard time to understand everything in a clear way.",
        "created_at": "2023-08-31T08:00:32.842000+00:00",
        "attachments": null
    },
    {
        "author": "mixy1",
        "category": "general",
        "parent": "",
        "content": "I sorta thought it would be because the deposits are done in batches so that it doesn't congest the network but at the same time I fail to see how this will link into EIP 4788 where each block in the execution layer chain should have 1 block in the beacon chain accompanying it.",
        "created_at": "2023-08-31T08:00:37.169000+00:00",
        "attachments": null
    },
    {
        "author": "pk910",
        "category": "general",
        "parent": "",
        "content": "I think the eth1 block you're looking at is the eth1 voting block.\nThat's a leftover from pre-merge times and is part of the deposit process. It is expected to be 6-8h older than the head.\nThe ETH1_FOLLOW_DISTANCE / ETH1_VOTING_PERIOD is responsible for the \"delayed\" view on the deposit head.\nIt was done that way because of reorgs on the PoW chain. The delay ensures that deposits are not reorged out.\n\nThe actual EL block which is linked to the block is the execution payload. \nThat one is forced to be at the same timestamp than the CL block.",
        "created_at": "2023-08-31T10:28:24.586000+00:00",
        "attachments": null
    },
    {
        "author": "mixy1",
        "category": "general",
        "parent": "",
        "content": "Oh okay, that makes sense. However lets say eth2 block 100 has the deposit block for block 10, would it's actual deposit block be in the future?",
        "created_at": "2023-08-31T10:34:00.495000+00:00",
        "attachments": null
    },
    {
        "author": "mixy1",
        "category": "general",
        "parent": "",
        "content": "and also so geth would talk with the consensus client and ask it for the beacon block root and then start using it when executing transactions (i.e. the initial transaction to inject the beacon block root into the eip4788 contract)",
        "created_at": "2023-08-31T10:35:19.162000+00:00",
        "attachments": null
    },
    {
        "author": "pk910",
        "category": "general",
        "parent": "",
        "content": "the eth1 vote is just a \"vote\", so clients can agree on the block hash. it's not the whole block included in there.\nthat was available since the beacon chain launched. The votes are always for blocks 6-8h ago - never in future? (don't really get that question)\n\nsince merge, each CL block must have a execution payload. \nBasically the voting stuff is no longer needed since then, because there are no more EL-only reorgs. \nHowever, it's still there and works well (most of the times)\nThere are plans to get rid of the voting stuff (eg. eip6110)",
        "created_at": "2023-08-31T10:46:49.284000+00:00",
        "attachments": null
    },
    {
        "author": "mixy1",
        "category": "general",
        "parent": "",
        "content": "Ohhh okay that makes more sense. \n\nI thought that the vote is for the block that will include the rewards that the validators will get.",
        "created_at": "2023-08-31T11:03:37.428000+00:00",
        "attachments": null
    }
]