[
    {
        "author": "fresnel.lens",
        "category": "general",
        "parent": "",
        "content": "Hi team! I'm not sure if this is the right place to post - apologies if it is not. I'm getting the following error from the mekong RPC:\n```\ncurl -s https://rpc.mekong.ethpandaops.io/ -X POST -H \"Content-Type: application/json\" -d '{\"id\":1,\"jsonrpc\":\"2.0\",\"method\":\"eth_chainId\"}'\n{\"jsonrpc\":\"2.0\",\"id\":1,\"error\":{\"code\":-32603,\"message\":\"no upstreams found for network\"}}\n```\n\nHelp is much appreciated 🙏",
        "created_at": "2024-12-09T02:58:59.076000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "general",
        "parent": "",
        "content": "should be working again, we are looking how to make the endpoint more robust. Thanks for reporting",
        "created_at": "2024-12-09T09:02:58.508000+00:00",
        "attachments": null
    },
    {
        "author": "n0price",
        "category": "general",
        "parent": "",
        "content": "I have a few question regarding the MaxEB\n\n1. Validators with a 0x02 withdrawal address can set or adjust a custom MAX_EFFECTIVE_BALANCE below the proposed upper limit of 2,048 ETH (in multiples of 32), correct?\n\n2. Once a validator (with a 0x02 withdrawal address) surpasses this set balance, any excess (CL rewards) is automatically sent to the withdrawal address, correct?\n\n3. To use MAX_EFFECTIVE_BALANCE, validators must switch to the 0x02 withdrawal credential prefix. This can be done using one of the following options:\n\nEIP-7804: Update the existing withdrawal address from 0x01 to 0x02 (no loss of rewards). However, this doesn't seem to be included in the first Pectra upgrade, correct?\n\nEIP-7002: Perform an EL exit for the existing validator and create a new validator with 0x02 (no loss of rewards), correct?\n\nNormal exit: Exit normally and create a new validator with 0x02 (results in a loss of rewards), correct?",
        "created_at": "2024-12-09T17:29:25.520000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "general",
        "parent": "",
        "content": "1. Not correct. There are no custom max effective balances.\n\n2. Yes, excess balance will be \"swept\" into the withdrawal address.\n\n3a. Not sure about the EIP numbers, but to convert a 0x01 validator to a 0x02 validator you would submit a consolidation request where the source and target public keys are the same. There should be no lost rewards this way. See here: https://github.com/ethereum/consensus-specs/blob/dev/specs/electra/beacon-chain.md#new-is_valid_switch_to_compounding_request\n\n3b. I believe you will be able to exit \u0026 create a new 0x02 validator too. And yes, I would expect some lost rewards if you went this route.",
        "created_at": "2024-12-09T19:33:50.374000+00:00",
        "attachments": null
    }
]