[
    {
        "author": "_tachyonic",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Thinking about it some more - a staker has a couple options to mitigate these risks: consolidate to 64 validators so they have liquidity from automatic skimming in the event that the exit queue goes parabolic (assuming they have this many!), consolidate some validators but not all (so that some consensus earnings are not at risk of the exit queue), keep a buffer of cash and/or unstaked ETH to insure against the liquidity tail-risk of the exit queue. By my estimate if 35% of 1m validators tried to unstake at the same time it would take ~4 months for consolidated validators that are under the 2048 ETH mark to get their earnings through the exit queue. Given that some share of total earnings are on the execution layer and fully liquid, for stakers with many validators some combination of these various options means that the cash/unstaked ETH buffer does not have to be a significant proportion of the total staked, assuming the maximum the queue ever reaches is something like ~4 months. However, even with a solid cash/unstaked ETH position to ensure liquidity during an exit queue crunch, the variability of MEV rewards plus a significant price rise in the underlying ETH at the same time as the exit queue expansion could create a liquidity crunch for smaller validators. Hopefully custom ceilings are implemented eventually.",
        "created_at": "2024-04-15T13:37:34.795000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Interesting. What events that can trigger exit of such big number of validators do you consider?",
        "created_at": "2024-04-15T18:58:21.942000+00:00",
        "attachments": null
    },
    {
        "author": "0x1984",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This could argue for large validators to keep a good number of validators so the withdraw will be continuous. If one only got 2 consolidated validator, either you exit right away or wait for 4 months in extremely situation.",
        "created_at": "2024-04-15T19:13:20.136000+00:00",
        "attachments": null
    }
]