[
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Keeping this out of \u003c#892088344438255616\u003e , as that's busy and not the place for this, but...\n\nThere needs to be a statement about what happened, and what will happen.  Is anyone in the EF working on this?\n\nFrom my point of view, I think the main bullet points should be:\n\n- explanation of what happened (bug affecting multiple clients on holesky, and \u003e2/3 of the validators)\n- explanation of its impact (holesky has forked, bad chain is justified so not easy to return to the good chain, difficulties syncing nodes due to lack of validators (and hence blocks) on the good chain)\n- explanation of what is being done to address this (syncing on a minority chain, rejecting blocks know to be on the bad chain, etc.)\n- commentary for holesky (attempting to restart, other options also being explored)\n- commentary for sepolia (smaller validator set, bugs have been addressed and node operators will update their clients, upgrade will go ahead as planned)\n- commentary for mainnet (upgrade on hold until we have a good way to handle this sort of situation?)\n\nObviously the commentaries will need input from the core devs as to each of the sets of actions, but I believe that this roughly is the current state of play.\n\nIs someone taking the lead on this from the EF?  I think that it will help a lot to have a statement sooner rather than later.",
        "created_at": "2025-02-25T14:42:34.700000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "cc \u003c@552133098075193354\u003e",
        "created_at": "2025-02-25T14:43:29.248000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Yes, I can own this. Thanks for the outline, \u003c@144468805697929216\u003e 🫡",
        "created_at": "2025-02-25T14:59:54.189000+00:00",
        "attachments": null
    },
    {
        "author": "rnicoll",
        "category": "general",
        "parent": "",
        "content": "Adding a clear \"What you can do\", even if that's just shutting down nodes and waiting, would be good. It's unclear if it's useful to try launching nodes with working clients (and what the correct combination would be), so there's more correct peers, or if that adds noise, for example",
        "created_at": "2025-02-25T15:28:56.814000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Right now, most observers can't do much. Even though Holesky allows anyone to run a validator, the vast majority of the network's validators are run by a relatively small group (client teams, infra providers, etc.), as there is no incentive to run testnet validators long-term. \n\nPretty much everyone who should be paying attention is following \u003c#892088344438255616\u003e and when we have clearer instructions we'll share them with the Holesky validators directly as well as here 🙂",
        "created_at": "2025-02-25T15:43:07.516000+00:00",
        "attachments": null
    },
    {
        "author": "lavabyrd",
        "category": "general",
        "parent": "",
        "content": "\u003c@552133098075193354\u003e - just to clarify, it might be best to just shut down VCs for now but if we have Beacon Nodes up, we can leave them as is until we hear more about rebuilding/redeploying? There was also a post that anti-slashing DBs should be wiped too before the VCs are brought back up, is this correct?",
        "created_at": "2025-02-25T16:40:35.258000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Sorry for the delay here. If you have BNs up with the wrong version, please shut them down as they make it harder for updated peers to connect",
        "created_at": "2025-02-25T20:49:52.583000+00:00",
        "attachments": null
    }
]