[
    {
        "author": "kudeta",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm surprised that it should take more than a week to come to the inevitable conclusion: we need a new long term testnet. The shadow fork options are all rather messy. From here on in, i hope it would be reasonable to propose a new policy:  as soon as we see a failure event where finality is lost with an unknown (or unacceptable) estimate for recovery, the distraction; lost productivity and ultimately cost this generates is itself enough to justify the up front investment in moving on. The work to establish a successor testnet should begin immediately. This seems like a decision the EF could take unilaterally - it doesn't need to go through several rounds of ACD calls. \n\nAs others have mentioned, there is a whole ecosystem of staking related infrastructure that uses Holesky as it's primary test environment (with good reason). I totally appreciate the engineering and academic interest in working through the problem for insight and opportunities to improve the protocol - and have enjoyed watching that play out. But it's a somewhat tangential concern to almost everyone else.",
        "created_at": "2025-03-06T02:12:28.280000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This is true but we also need a good process for how to do mainnet DR if it ever happens, and that's why the shadow fork option (as messy as it is) may need to be a precursor of developing full fledged rollback scenario testing.",
        "created_at": "2025-03-06T13:54:09.249000+00:00",
        "attachments": null
    },
    {
        "author": "kudeta",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If we are determined to organise a DR test, we appear to know how to reliably break things ;). That can be a planned process with a big team - i don't think it needs to happen in the midst of trying to ship a large upgrade.",
        "created_at": "2025-03-06T14:00:39.927000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yes that's fair. Just given pressures to \"go faster\" + \"do more\" I don't know if we'll realistically get a chance",
        "created_at": "2025-03-06T14:01:17.249000+00:00",
        "attachments": null
    },
    {
        "author": "kudeta",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I guess another alternative is that the staking community take it on themselves to organise another long term testnet. But that may actually reduce the value of holesky (or it's successor), and is more expense to maintain.",
        "created_at": "2025-03-06T14:04:51.401000+00:00",
        "attachments": null
    },
    {
        "author": "0xsantito",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hey, has anyone been having issues with nethermind on sepolia? Around 2:30 Pm UTC my node stopped working and asking around, it seems I'm not the only one with this problem. I believe it is being caused by a long reorg",
        "created_at": "2025-03-06T15:42:26.424000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "cc \u003c@\u0026652918665943056397\u003e are you aware of any issue?",
        "created_at": "2025-03-06T16:05:33.944000+00:00",
        "attachments": null
    },
    {
        "author": "kamil_chodola",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Looking at our nimbus validators on sepolia everything looks relatively good now - using Nimbus.\nCan you check the CL as well?",
        "created_at": "2025-03-06T16:07:23.393000+00:00",
        "attachments": null
    },
    {
        "author": "0xsantito",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm using nimbus. The EL node seems to stop before enabling the engine connections so nimbus is never able to contact the EL node. I left the logs and more info on the nethermind discord",
        "created_at": "2025-03-06T16:12:56.451000+00:00",
        "attachments": null
    },
    {
        "author": "nanlenathaniel",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "can some one refer me to any comprehensive material on 'Ethereum upgrade pectra' and the \"Bug on Holisky testnet\"",
        "created_at": "2025-03-06T19:56:03.119000+00:00",
        "attachments": null
    },
    {
        "author": "marekm3498",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I believe this node was not upgraded with the coordinated upgrade and has been undergoing a long reorg since then. We are in contact with \u003c@413153745682300938\u003e.\n\nAll other nodes in our infrastructure are functioning properly.",
        "created_at": "2025-03-06T20:25:34.186000+00:00",
        "attachments": null
    }
]