[
    {
        "author": "tobiwo",
        "category": "general",
        "parent": "",
        "content": "Hi everyone, I have a question with regards to the EL request system contracts. How does the queue length stuff exactly work?\n\nI'm currently working on a cli-tool to make it easy to send e.g. multiple consolidation requests at once. In the first try (currently main) I sent one request per block. This works fine. Now I try to optimize this while batching multiple requests to one block. The code can be seen here: https://github.com/TobiWo/eth-validator-cli/blob/feature/batch-el-requests/src/service/domain/request.ts\n\nUnfortunately this does not work. I tested with consolidating 5 source validators to 1 target validator (on mekong). However, only 2 trx went through e.g. this one https://explorer.mekong.ethpandaops.io/tx/0x9d646b0445237f42124759a1cd9e00d0ea532f37909604368793aa657550a5cc?tab=index . The others are running out of gas like here: https://explorer.mekong.ethpandaops.io/tx/0x45ac5e12ae65655c30e0b72ecc8c46b565ed91d17d1cad2053c0469289f20b36?tab=raw_trace . I re-tried with the remaining 3 trx and again, 2 work but the last one does not. That is why I wonder what I exactly receive when there are requests in the queue. \n\nMy fee calculation workflow is currently as follows:\n- fetch the current consolidation queue before sending any request\n- add the number of requests I want to sent as a tip to the fee calculation logic (https://github.com/TobiWo/eth-validator-cli/blob/feature/batch-el-requests/src/service/domain/request.ts#L22)\n\nThe only thing I can imagine is that the consolidation contracts queue fills up when the first 2 requests arrive and it does not return 2 as I would expect but return different values. I can't read assembly unfortunately 🫠  and it would be nice to understand how it works exactly.",
        "created_at": "2025-01-06T14:42:12.591000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "the fee only changes after the block, so all txs intra block get same fee for the requests.\n\nfor consolidations, there is a max number per block, which you are running up against: 2 (see MAX_CONSOLIDATION_REQUESTS_PER_BLOCK in the EIP)",
        "created_at": "2025-01-06T14:45:49.816000+00:00",
        "attachments": null
    },
    {
        "author": "tobiwo",
        "category": "general",
        "parent": "",
        "content": "This makes a lot of sense. Thank you so much 🙏",
        "created_at": "2025-01-06T14:48:00.060000+00:00",
        "attachments": null
    },
    {
        "author": "tobiwo",
        "category": "general",
        "parent": "",
        "content": "Can you elaborate why there is this limit for sending consolidation requests?",
        "created_at": "2025-01-06T15:02:26.911000+00:00",
        "attachments": null
    },
    {
        "author": "pk910",
        "category": "general",
        "parent": "",
        "content": "\u003e the fee only changes after the block, so all txs intra block get same fee for the requests.\nIs that right?  So you could submit something like 1k consolidation requests in the same block and all pay the same fee?\nI assumed that the fee grows based on the number of queued requests?\n\n\u003e for consolidations, there is a max number per block, which you are running up against: 2\nit's about the enqueue side,  that limit is the dequeue rate",
        "created_at": "2025-01-06T15:03:07.722000+00:00",
        "attachments": null
    },
    {
        "author": "tobiwo",
        "category": "general",
        "parent": "",
        "content": "But dequeue mean that 2 requests per block will executed, no? So lightclient should be right, or?",
        "created_at": "2025-01-06T15:09:24.070000+00:00",
        "attachments": null
    },
    {
        "author": "tobiwo",
        "category": "general",
        "parent": "",
        "content": "So the queue gets 2 requests smaller per block",
        "created_at": "2025-01-06T15:09:42.503000+00:00",
        "attachments": null
    },
    {
        "author": "tobiwo",
        "category": "general",
        "parent": "",
        "content": "I'm confused now 🤪",
        "created_at": "2025-01-06T15:11:28.801000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "yes everything in the same block pays same fee",
        "created_at": "2025-01-06T15:27:01.458000+00:00",
        "attachments": null
    },
    {
        "author": "pk910",
        "category": "general",
        "parent": "",
        "content": "yea,  got it now 🙂  storage slot `0x01` is the trick, so all calls within the same block pay the same fee - very neat 🙂\nthat also explains the fluctuating gas usage. The first request of each block has to pay the initialization fee for storage slot 0x01, as the value goes from `0` to `1`.  All subsequent calls consume less gas.\nThat's why the gas estimations might be too low when doing batch deposits and some transactions slip into the next block.\n(I had the same issue as TobiWo with dora when submitting requests quickly without waiting for confirmation)",
        "created_at": "2025-01-06T19:50:57.972000+00:00",
        "attachments": null
    }
]