[
    {
        "author": "cskiraly",
        "category": "Execution Layer",
        "parent": "",
        "content": "As we are working on scaling blob capacity, one of the questions that came up is the handling of **nonce gaps** (handling transactions which are after a discontinuity in the nonce sequence for a specific address).\n\nIn Geth we have a quite strict policy, especially for blobs:\n- First of all, we never propagate or announce transactions which are behind a nonce gap.\n- Second, we also limit how many of these we store (waiting for the gap to be filled). For blobs, we don't even allow gaps at the moment, dropping transactions that are not in order. This can create inefficiencies, since when pulling from multiple sources, blob transactions can easily arrive out-of-order. I have a PR to change this in Geth, allowing a reorder buffer. I'm also thinking whether we should have more metadata in announcements, adding sender address and nonce.\n\nI'm curious how other clients handle this at the moment, also to understand potential cross-client inefficiencies.",
        "created_at": "2025-10-08T08:51:27.887000+00:00",
        "attachments": null
    },
    {
        "author": "fab_10",
        "category": "Execution Layer",
        "parent": "",
        "content": "In Besu, blob txs can have gaps like any other type, and any _gapped_ tx is kept in a special _layer_ called Sparse, that is limited by then amount memory it can occupy, and the eviction is by oldest seen first, this layer is a kind of buffer where gapped txs stays waiting for the gap to be filled (and usually that should happen during receiving out of order burst from the same sender), it is also lightweight, and can be quite large, since it does not impact the main ordering, that is only applied in the first an small Prioritized layer that as no gaps and only txs that can be actually executed.\n\nThe only, configurable, difference for blobs, is that in the Prioritized layer, we keep only a number of blob txs that can be included in a single block, since this first layer is limited by the number of txs (ideally only the max number of txs allowed in a single block)",
        "created_at": "2025-10-08T14:12:39.713000+00:00",
        "attachments": null
    }
]