[
  {
    "author": "jochembrouwer",
    "category": "Execution Layer",
    "parent": "",
    "content": "<@194432762315407360> regarding eth/70 I was wondering, EIP states:\n\"Partial receipt lists cannot be verified against the block header, so in responses with lastBlockIncomplete = 1, the last receipts list must be validated in a different way:\"\n\nWhy can't we verify partial receipt lists? We can do so by reconstructing the trie and just attaching a range proof there. We don't need a left proof  because we assume that all values requested before or on \"firstBlockReceiptIndex\" are known.\nIf we want we can even extend this to omit the hashes already known by the receiver.\n\nThe downside of this is obviously that we have to reconstruct the trie, which might be somewhat expensive for the tries in question (> 10 mb data because we have to split them up).\n\nI'm thinking if there is a smarter way to do this, because we can derive the trie size (amount of transactions), and because we know the trie structure we could maybe use that to lower the data size required, or maybe even the trie calculation necessary (need specific nodes to prove it, so might not need to compute the entire trie)",
    "created_at": "2026-02-15T03:52:09.130000+00:00",
    "attachments": []
  },
  {
    "author": "jochembrouwer",
    "category": "Execution Layer",
    "parent": "",
    "content": "And actually this would be mitigated too then: \n> For a Receipts message, each block receipts list is validated by checking the full list against the tree root stored in the block header. When downloading a paginated list across multiple requests, the client must potentially buffer more than 10MB of unvalidated input. This cannot be avoided, since the protocol allows receipt lists of such size at a high block gas limit. However, we can at least bound the input size by applying sanity checks as recommended in the specification section.\n\nWith the proof we would directly validate it",
    "created_at": "2026-02-15T03:54:03.048000+00:00",
    "attachments": []
  }
]