[
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think we wouldn't need the proposer to pay upfront since we know the proposer has stake. Essentially, we would just process the EL payload, look at the `proposer_penalty`  value (or it's hash and have the actual value in the BeaconBlock) and deduct that from the stake. So, there is no back an forth. Similar to execution requests.",
        "created_at": "2025-04-23T09:31:46.333000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "but you don't know what the value is until new payload finishes",
        "created_at": "2025-04-23T13:12:16.648000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "right yeah, this is a good point. You'd again rely on some form of optimistic attesting where the next proposer would reorg the block out if the value is validated and perceived as wrong.\n\nRight now, I think some form of pre-charging the full tx.gas * gas_price pre-transaction and then having blocks reorged out if they turn invalid during execution. This would allow us to not have anyone (excpet the transaction senders) being charged. not relying on the proposer or the coinbase.\nThe downside here is that you'd not be able to fund an account and send a transaction from that same account in the same block (which is/was a common pattern in \"wallet resuce\" missions).",
        "created_at": "2025-04-23T13:31:53.957000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Optimistic attesting isn’t a concern here since validators can’t attest to an optimistic block in the first place. The bigger change is that the consensus state transition function now depends on the result of the new payload, whereas today they operate independently",
        "created_at": "2025-04-23T21:08:07.996000+00:00",
        "attachments": null
    }
]