[
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "You can find the EIP for delayed execution here:  \nhttps://eips.ethereum.org/EIPS/eip-7886  \nSome annotated specs:\nhttps://nerolation.github.io/delayed-execution-docs/\nAnd an initial research post discussing the idea here:  \nhttps://ethresear.ch/t/delayed-execution-and-skipped-transactions/21677\n---\n### One open question:  \n**How do we prevent free data availability (DA) usage?**\n\nCurrently, the EIP proposes that the **coinbase address** pays upfront for the inclusion costs of each transaction—this includes calldata, blobs, and EIP-2930 access lists (AL). If a transaction can’t be executed at execution time—e.g., due to insufficient balance, incorrect nonce, or block space limits—it is skipped.\nHowever, skipped transactions still consume gas, and this gas is paid by the coinbase. For transactions that *do* get executed, the inclusion costs are refunded to the coinbase, so ultimately the sender pays. \n\nThis approach raises some concerns:\n- It requires the EL to verify signatures.\n- The coinbase must be pre-funded (not a problem for most blocks built via MEV-Boost, where the builder *is* the coinbase).\n- It might require a coinbase setup similar to CL validators, with signing and withdrawal keys (e.g., via [ERC-1271](https://eips.ethereum.org/EIPS/eip-1271)).\n\n### Alternative ideas to manage \"free DA\":\n- Use the **proposer's stake** as collateral.\n- Allow **consecutive proposers to reorg** the block out..\n\nI outlined more of the design space here:  \nhttps://hackmd.io/@Nerolation/BkdlrYGyll",
        "created_at": "2025-04-22T09:46:42.765000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Nice post! one note, the implementation complexity for (2) proposer upfront looks like this:  \ntoday, consensus and execution can run in parallel and once both succeed, we update the canonical chain view  \nwith proposer upfront, this changes, because after execution runs, we need to process consensus since proposer balances might change, breaking the assumption that consensus doesn't depend on execution",
        "created_at": "2025-04-22T21:27:27.246000+00:00",
        "attachments": null
    }
]