[
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "🚨  PLEASE READ THE FOLLOWING BEFORE GETTING STARTED  🚨 \n                      (failure to do so may result in a kick / ban)\n\n👋  Welcome to the Eth R\u0026D server! We're excited to have you join us in exciting, technical conversations about all things core Ethereum. Your account does not become active until 10 minutes after joining, so please take a moment to read the following.\n\nGetting Started Resources\n+ Channel Guidebook: https://github.com/tvanepps/EthereumDiscordGuidebook\n+  EthResearch: for deeper research posts \u0026 async dialogue http://ethresear.ch/\n\nThis server is dedicated to:\n✅  Items actively affecting Ethereum mainnet ( \u003c#745077610685661265\u003e )\n✅  R\u0026D aimed toward enhancing Ethereum mainnet ( \u003c#688075293562503241\u003e )\n✅  R\u0026D pushing toward a major upgrade to Ethereum's core consensus ( \u003c#598292067260825641\u003e )\n\nThis server is not for:\n❌  Solidity education / feedback. check out the CryptoDevs discord: https://discord.gg/5W5tVb3\n❌  Basic support / technical questions. There are many resources to get you up to speed:  https://ethereum.org/en/learn/\n❌  Governance discussions. While the line can get blurry, try to err on the side of technical debate.\n❌  Promoting one's business, proprietary solution, or token: we have a zero tolerance policy on this.\n\nIf you are just getting started, please lurk and get a feel for how things work. Just watching conversations and following threads can be incredibly enlightening! Please be civil and respectful. If you'd feel uncomfortable saying something in person, that's a sign you shouldn't say it here.\n\nThank you for joining! Do your part to keep our corner of the internet awesome \u003c:eth2:595693639913570305\u003e",
        "created_at": "2020-08-18T00:27:07.348000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2020-08-18T00:28:35.583000+00:00",
        "attachments": null
    }
]