[
    {
        "author": "dapplion",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Would adding the \"change withdrawal credentials\" operation require significant changes to the spec?",
        "created_at": "2020-09-07T15:05:21.137000+00:00",
        "attachments": []
    },
    {
        "author": "dapplion",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If I understand correctly the entire withdrawal process (both for regular BLS and hipotetical smart contract addresses) is quite unknown. The problem with the latter is that since you are commiting to a specific smart contract code your future-proof maneuverability is reduced.",
        "created_at": "2020-09-07T15:36:11.391000+00:00",
        "attachments": []
    },
    {
        "author": "dapplion",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I imagine all solutions would require some jump of faith. So that exists an implementation in the future to make the solution work. If a sound scheme is proposed here, how much research and testing do you think it would be necessary before adoption?",
        "created_at": "2020-09-07T15:38:45.583000+00:00",
        "attachments": []
    },
    {
        "author": "okyne",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Can I also jump in here and weigh against the 'edit withdrawal address' option if it's to be the validating key that has this power? I'm developing centralised staking as a service tooling for eth2, and an important design constraint is that clients will generate and mind their own BLS withdrawal addresses, and the centralised staking party will only control the validating key. That means the centralized validator can either continue to stake, or exit staking, they cannot otherwise screw around too much with a clients funds (bar getting intentionally slashed, which triggers an exit). If the ability for a validator to change it's withdrawal address was added, the staking pool could now exit scam with users funds by updating the withdrawal address to a key they (or a hacker) controls. This increases the risk of a hack and also increases the custodianship of the system which can have legal complications too. \n\nI would vote for defining a push-based system from eth2, where the withdrawal would call a known function method with a known set of params (validator details), and allow the Eth1 side to handle the complexity of it. If we wanted to go further, we could copy things like the ERC721 safe receiver pattern, and add spec to the deposit verification work underway that if the `withdrawal_credentials` prefix is 0x1, the contract address is checked to have interfaceID `safeWithdrawFrom(address, data)` or whatever it would be. That said, I don't see this as feasible before the current Phase 0 go live, so I would suggest it be added in a fork when it's ready. Mainly, I just don't want the edit withdrawal address option added, as this adds more trust to the validators, not less, despite it making things more adaptable.",
        "created_at": "2020-09-07T15:50:50.643000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e Can I also jump in here and weigh against the 'edit withdrawal address' option if it's to be the validating key that has this power?\n\nIt would require the existing withdrawal key to sign such an operation, otherwise it wouldn't be very secure.",
        "created_at": "2020-09-07T16:17:31.696000+00:00",
        "attachments": []
    },
    {
        "author": "dapplion",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The eth1 address in the withdrawal crendentials could also be an upgradable DAO governed by the depositeers. When the withdrawal mechanism is defined, then upgrade to a contract with the required interface and functionality.",
        "created_at": "2020-09-07T16:21:18.326000+00:00",
        "attachments": []
    },
    {
        "author": "okyne",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@144468805697929216\u003e just making sure 🙂 That's quite a bit different than how the deposit contract currently works.",
        "created_at": "2020-09-07T16:36:09.683000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The deposit contract doesn't bother with a signature related to the withdrawal credentials, because if a user isn't happy with them they simply won't sign the ETH1 transaction.",
        "created_at": "2020-09-07T16:38:15.440000+00:00",
        "attachments": []
    },
    {
        "author": "okyne",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Agreed. And to keep the withdrawal address as cold as possible I suppose. Either way, withdrawal key driven or validator key driven, I think the ability to edit a withdrawal address reduces the determinism of the staking system and thus makes it harder to tokenise and trade the derivatives of the staking rewards, so I would lean away from the ability to update, and target having the ability to specify an eth1 contract address only when it's good and ready to go in. What about Eth2 contract addresses while we're on the topic? No need to require contract withdrawals to go only to the eth1 shard when we have 63 other execution enabled shards they could go to. Would the regular BLS address suffice for those shards or would it need a third prefix type? Not sure if there is an EOA vs Contract address distinction in Eth2.",
        "created_at": "2020-09-07T16:50:04.374000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There's nothing I'm aware of that is defined well enough to be able to confirm that a particular set of withdrawal credentials will point to a particular contract, given the open questions still around phase 2.",
        "created_at": "2020-09-07T16:52:47.427000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e I think the ability to edit a withdrawal address reduces the determinism of the staking system and thus makes it harder to tokenise and trade the derivatives of the staking rewards\n\nWhomever holds the private key is going to be able to do whatever they want with the funds.  The point of having the ability to change withdrawal credentials would be to hand over control of the funds to a smart contract, once the appropriate interfaces are defined.  So it doesn't increase the risks, but does give a method that could reduce the risks.",
        "created_at": "2020-09-07T17:01:01.535000+00:00",
        "attachments": []
    },
    {
        "author": "okyne",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e So it doesn't increase the risks, but does give a method that could reduce the risks.\nOkay I can agree with that. How I see it is right now you can assume a withdrawal address cannot change, but with the transferable withdrawal address in place, you would need to go further to assume it cannot change, first you would confirm the withdrawal address is in fact a contract, then you must look at the source code of this contract to be assured that it doesn't have any proxy pattern in place nor the functionality to execute the transfer of a withdrawal address a second time (perhaps by an `onlyOwner` method that could be used as an exit scam), you would also need to confirm that there are no selfdestructs in the contract to make sure you're not being fooled by a `create2` contract. More work to confirm the immutability of a contract, but it can still be confirmed, and in that case, can be trustlessly used for derivatives on the rewards. I retract my objection to transferable withdrawal addresses. 🙂",
        "created_at": "2020-09-07T17:23:45.673000+00:00",
        "attachments": []
    },
    {
        "author": "eduadiez",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Does anyone know what was the reason why \"change withdrawal credentials\" wasn't part of the specs from the beginning? simplicity? As \u003c@!688748669268132001\u003e has mentioned I believe this requires significant changes to the specs. \u003c@!144468805697929216\u003e Have you evaluated what changes this would mean?",
        "created_at": "2020-09-07T17:32:02.434000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!437235496071069698\u003e not sure it was ever considered.  It's only being brought up now to bridge the potential gap between the launch of phase 0 and a secure definition of requirements of the contract at the supplied ETH1 address.",
        "created_at": "2020-09-07T17:55:47.631000+00:00",
        "attachments": []
    }
]