[
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It seems unlikely that we would ever go down the road of rewards being *continuously* pushed to an address. Beacon chain exits (\u0026 so presumably withdrawals) are all-or-nothing - you would just send the entire final balance one time, whether it's push or pull, right?",
        "created_at": "2020-11-24T00:01:34.957000+00:00",
        "attachments": null
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Totally agree, but even a dirt simple solution makes assumptions about how a lot of this stuff works under the hood (e.g. that validator withdrawals to the eth1 chain can take the form of a simple tx). As \u003c@!636950487089938462\u003e said, setting a solution now dictates how the implementation will look in future, and we need to know that what we commit to will be possible.",
        "created_at": "2020-11-24T00:09:18.569000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sorry I'm super late on this. Promised it last week but been a busy one",
        "created_at": "2020-11-24T00:51:48.010000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "https://ethresear.ch/t/simple-eth1-withdrawals-beacon-chain-centric/8256",
        "created_at": "2020-11-24T00:51:48.668000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It is not incredibly refined, but gets the general structure I've been thinking across. \nCommitting to something like this is the absolute simplest commitment we can make that will allow for a large portion of withdrawal contracts to be designed today",
        "created_at": "2020-11-24T00:52:55.318000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The commitment in the eth2 spec would be simply to the structure of `Eth1AddressPrefix` type withdrawal credentials and to the minimal send that ETH would arrive to withdrawal addrs.\n\nThis could easily be done in a minor release in January\n\nI'm keen to hear withdrawal contract / pool designs that are not satisfied by this simple structure",
        "created_at": "2020-11-24T00:54:24.133000+00:00",
        "attachments": null
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I can't think of any reason that this wouldn't work for us. Looks great!",
        "created_at": "2020-11-24T01:29:00.459000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!291925846556540928\u003e  Do you use the `withdrawn_epoch` explicitly somewhere or would it be enough to have a `is_validator_withdrawn()` that returns true if `(current_epoch \u003e withdrawable_epoch) and (validator.withdrawal_credentials[0] == Eth1AddressPrefix)`  ?",
        "created_at": "2020-11-24T01:57:58.537000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "withdrawn_epoch serves as a flag to ensure only one withdrawal happens per validator and to allow cleaning up and reusing validator indices in the future\n\nI think even if we use vitaliks mod, we'd still need the field to ensure the withdrawal doesn't happen twice. \n\nYou might be able to get rid of the field depending on the fine details chosen in actual implementation, but its probably clean to have it and its at least good for illustrative purposes in the post",
        "created_at": "2020-11-24T02:04:49.934000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!291925846556540928\u003e looks great! I had just one question (posted in the thread as well). \nHow is the withdrawal initiated on the beacon-chain? what key/ tx?",
        "created_at": "2020-11-24T05:54:23.955000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "so the actual withdrawal for 0x01 prefixed withdrawal credentials happens automatically once the validator is exited and enters into the \"withdrawable\" state",
        "created_at": "2020-11-24T15:02:05.223000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "for 0x00 withdrawal credentials, the BLS key behind those credentials has to signal the eth1 addr before the withdrawal will automatically occur",
        "created_at": "2020-11-24T15:02:30.061000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "the *exit* of a validator happens with the active pubkey",
        "created_at": "2020-11-24T15:02:45.419000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So for 0x01 prefix it's just on interaction? exit with the validation key and fund land in your eth1 account?\nFor 0x00 you need to exit and then transfer with the withdrawal key?",
        "created_at": "2020-11-24T15:11:56.991000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It also means it's an all or nothing transfer? i can't move earned ETH?",
        "created_at": "2020-11-24T15:12:25.682000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!291925846556540928\u003e",
        "created_at": "2020-11-24T15:12:30.631000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Buterin remarked that it's equivalent to arbitrary transfers",
        "created_at": "2020-11-24T15:13:15.850000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Since you can exit to a contract that mints futures",
        "created_at": "2020-11-24T15:13:32.448000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Transfers are a separate issue, but one that needs to be addressed.  The trick is doing it without flooding the beacon chain with value transfers.",
        "created_at": "2020-11-24T15:14:40.816000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "(Been considering this, will write something up when I have a chance)",
        "created_at": "2020-11-24T15:14:51.974000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And there it is: https://ethresear.ch/t/simple-transfers-of-excess-balance/8263",
        "created_at": "2020-11-24T21:54:14.204000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Perhaps I'm the only one that feels this way but I think we should be looking for ways of allowing withdrawals so that trustless pools may eventually be a thing, but at the same time discouraging ( or even make them unviable ) excess transfers. This proposal in particular would help a  any large pool/staker to immediately compound their income while diluting small stakers. I understand this may be something inevitable, but I'd love to see some effort to actually prevent this.",
        "created_at": "2020-11-24T22:41:43.655000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Once Ether leaves the beacon chain it is free.  Any new deposit cannot be considered \"good\" or \"bad\" based on if it was previously used for validating.  If withdrawals are possible then users can compound through an \"exit-withdraw-deposit\" cycle, but that has ramifications for the short-term security and long-term health of the beacon chain.\n\nGiven that, I think that putting in transfers before, or at the same time as, withdrawals is something that needs to be done.",
        "created_at": "2020-11-24T22:49:10.353000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Oh I do understand that either  \u003c@291925846556540928\u003e or \u003c@695019898274840626\u003e's proposals both allow for these transfers to happen. I just think that we should be looking for modifications of those such that these excess transfers become more difficult or less profitable, rather than just providing a channel that makes them easier. Specially when you have validators proposing often rather than once every 20K slots",
        "created_at": "2020-11-24T22:53:21.462000+00:00",
        "attachments": null
    },
    {
        "author": "emansipater",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I just don't think this is a realistic goal. Digital currency is liquid. People are going to do whatever they want with it. If you're concerned about differences in compounding between large multiples of 32 ETH and people who only have one or two 32 ETH slots, the correct way to solve that is with trustless pooling. Which should in any case arrive long *before* any of these withdrawals are actually enabled. Provided we don't gum up the withdrawal standards with impossible to achieve design goals, like stopping liquid currency from being liquid.",
        "created_at": "2020-11-24T23:03:22.885000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I agree, if this is the way things are going to go i think you'd have to be crazy to be a solo small staker. I'll withdraw my validator as soon as possible and join a pool. But at the same time solo stakers are the ones providing decentralization and scale, which were the main sales pitch of this whole transition.",
        "created_at": "2020-11-24T23:06:17.494000+00:00",
        "attachments": null
    },
    {
        "author": "emansipater",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "That's not what I said at all",
        "created_at": "2020-11-24T23:06:43.433000+00:00",
        "attachments": null
    },
    {
        "author": "emansipater",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "In fact, the ability to withdraw just the excess is perfect for a solo validator, because they can keep withdrawing their extra income and investing it in pools or anything else until they have enough for a second validator, and so on.",
        "created_at": "2020-11-24T23:09:06.039000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Not if you withdraw only on proposals",
        "created_at": "2020-11-24T23:11:22.825000+00:00",
        "attachments": null
    },
    {
        "author": "emansipater",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I don't understand your claim",
        "created_at": "2020-11-24T23:13:53.926000+00:00",
        "attachments": null
    },
    {
        "author": "emansipater",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Each individual validator slot is in the same situation, with the same frequency of proposals, etc.  The only gains to scale here are that someone with more validators earns enough for a new validator sooner, plus hardware/administration costs.  Larger stakers aren't getting easier withdrawals *per validator*.",
        "created_at": "2020-11-24T23:17:33.282000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The gain is linear, if you are compounding on every other slot by withdrawing your excess and forming new validators you approximate an exponential way better than someone just withdrawing whenever his only validator proposes. If you are a solo validator and both proposals here pass, the right approach is to withdraw and join a pool that will be compounding faster",
        "created_at": "2020-11-24T23:20:28.499000+00:00",
        "attachments": null
    },
    {
        "author": "emansipater",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "False",
        "created_at": "2020-11-24T23:20:48.148000+00:00",
        "attachments": null
    },
    {
        "author": "emansipater",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Withdrawing just the excess to put in a pool is better because there will be very slight additional overhead to trustless pooling. On a per-slot basis, running your own validator will be cheaper than getting someone else to do it, that's just economics. Besides, there is a giant difference between saying that someone can gain .001% by doing something and saying that they always will. The point of this design is to make solo validating financially feasible for those who want to help the network stay decentralized. It's a very hobbyist type thing, like running your own node is in general. There simply is no way to ensure that no other opportunities will exist to make more money elsewhere.",
        "created_at": "2020-11-24T23:25:57.668000+00:00",
        "attachments": null
    },
    {
        "author": "emansipater",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And with decentralized pooling you have to run a node anyways. So it's not clear that a given person contributes less to decentralization by running trustless pooled nodes instead of dedicated solo nodes anyways. As long as they actually have control proportionate to their deposit size, their contribution to decentralization is the same. Perhaps better if they are helping improve liquidity for other trustless pooled stakers.",
        "created_at": "2020-11-24T23:30:05.549000+00:00",
        "attachments": null
    }
]