[
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!695019898274840626\u003e Great initiative! \nI think my only worry is that is_final bit, I’d be hesitant to use it without knowing what a future contract will look like. Of-course you could always have an upgradable proxy contract but that complicates thing.\n\nIt seems to me that a lot will choose to stick with a non final address until things are more set and tested which kind of misses the point because now the user will need to maintain 3 keys instead of 1.",
        "created_at": "2020-11-15T05:52:44.469000+00:00",
        "attachments": null
    },
    {
        "author": "emansipater",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There is no need for users to use the withdrawal contract at all if they just want to keep their existing deposit and withdrawal keys.  But obviously the is_final bit is needed to grant binding control over withdrawals for validators who have already been deposited.",
        "created_at": "2020-11-15T11:00:23.155000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Say i bind my validator to some eth1 address and deploy a contract to that address for future use. If i made a mistake or a bug was discovered in later time i have no way of changing that contract. \nI could make it a proxy contract but that adds complexity and risk.\n\nThe idea, originally, behind setting up an eth1 address is to serve pools and other applications with the ability to fix a withdrawal method. I'm a little hesitant about that as it seems risky when you don't know and can't test the end result. \n\n(this goes to any implementation that sets a non changeable address)",
        "created_at": "2020-11-15T11:51:22.542000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We develop a staking pool network which means i'm first in line waiting for this binding but it also comes with risk which i'm not sure i'd like to have",
        "created_at": "2020-11-15T11:52:15.387000+00:00",
        "attachments": null
    },
    {
        "author": "emansipater",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Wouldn't the same concern hold for literally any programmatic pooling method that has control over funds? The advantage of DSWC as I see it is that the interface is kept to the literal minimum. You can never make it impossible to write bad smart contracts. But setting the requirements to be as simple as absolutely possible, and giving as much runway as possible to develop them, is the best way to permit good and safe contracts to be developed.",
        "created_at": "2020-11-15T11:55:40.205000+00:00",
        "attachments": null
    },
    {
        "author": "emansipater",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And I should add that with the DSWC it is very easy to test your contracts by just sending real ETH to them (or GoerliETH on Goerli)",
        "created_at": "2020-11-15T12:20:31.763000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e And I should add that with the DSWC it is very easy to test your contracts by just sending real ETH to them (or GoerliETH on Goerli)\n\u003c@!695019898274840626\u003e We don't necessarily know how a eth2-\u003eeth1 transaction will look like.",
        "created_at": "2020-11-15T12:29:41.472000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e Wouldn't the same concern hold for literally any programmatic pooling method that has control over funds? The advantage of DSWC as I see it is that the interface is kept to the literal minimum. You can never make it impossible to write bad smart contracts. But setting the requirements to be as simple as absolutely possible, and giving as much runway as possible to develop them, is the best way to permit good and safe contracts to be developed.\n\u003c@!695019898274840626\u003e That's what i'm saying. It's committing to some futuristic thing that we don't yet know how it will look like.\nNot sure if there is anyone working on the eth1\u003c\u003eeth2 merger here, maybe they did could shed some light on how the actual transaction will look like.\nMaybe it's just me over thinking it, if we can commit to a simple value transaction than it could bee ok. Can we?",
        "created_at": "2020-11-15T12:31:50.758000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There is work being done in this area, but nothing concrete regarding solving this problem.  Best thing at the moment would be for people to clearly state requirements, as that way a solution would have a better chance of meeting them.",
        "created_at": "2020-11-15T12:36:41.371000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!144468805697929216\u003e i think you had a good draft in terms of requirements:\n\n  - the amount of Ether sent (should be in msg.value)\n  - the validator from which the Ether was sent (index?  pubkey?)\n  - if the validator had been slashed\n  - if the validator exited/ drained all the stake? \n  - some sort of chain identifier from Ethereum 2, in case of forks (fork_version is a possibility, although that changes so the smart contract would need to be kept up-to-date)",
        "created_at": "2020-11-15T13:09:25.082000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think most can get behind that.",
        "created_at": "2020-11-15T13:10:11.284000+00:00",
        "attachments": null
    },
    {
        "author": "emansipater",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e \u003c@!695019898274840626\u003e We don't necessarily know how a eth2-\u003eeth1 transaction will look like.\n\u003c@636950487089938462\u003e in the DSWC is included the specification that ether will be sent as a standard ether transfer to eliminate this uncertainty. I'm certainly open to the possibility of committing to something that includes more metadata, however the point of the DSWC is to minimize complexity so that development can begin immediately. My suggestion is that we do the DSWC first and then spend time developing the metadata version after that. That way those use cases which need more metadata can wait for that spec to be finalized, but those which do not will not be further delayed.",
        "created_at": "2020-11-15T16:53:01.888000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I suggest we write in a single channel so the conversation will be in 1 place :)\n\nI think that without a minimal metadata like suggested above it won't serve pool like applications which, if I read the conversations correctly, is the main reason for this in the first place.\nI suggest we start from the use-case/ spec as suggested and then can specify what a solution would look like.",
        "created_at": "2020-11-15T17:29:43.205000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "What does metadata enable that simple transfer fails at?\n\nIf the pool needs to operate with more granularity, it can create child contracts that are tied to individual vals or sets of vals",
        "created_at": "2020-11-15T18:15:32.269000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "When merge, the notion of chain identifier will be merged",
        "created_at": "2020-11-15T18:23:12.994000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I see the desire for is slashed\n\nThat will be readable from beacon chain state when merge so contracts eventually can use this natively. I would say over engineering and passing in meta data or specifying how to read right now is too much of a commitment to an uncertain future",
        "created_at": "2020-11-15T18:24:41.207000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Without is-slashed, the user or pool essentially just gets the remaining amount and can distribute as normally. \n\nI suppose you could have special logic in the future to not reture slashed funds at all or something but given being slashed is already punished by the protocol this seems unnecessary in the majority of cases we might design for initially",
        "created_at": "2020-11-15T18:26:22.842000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Regardless of source contract, just assuming that eth comes in from somewhere via normal transfer to the spec'd 0x01 prefixed eth1 addr seems like it will give us 80% of what we want today and doesnt attempt to design and commit to things we cant predict before going down the merge rabbit hole for 3 or 4 more months",
        "created_at": "2020-11-15T18:29:05.133000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The way i see it, given this option i'd probably use some proxy contract on that 0x01 address to have the ability to change things. That's equal to not using the is_final flag which is equal to having 3 keys to worry about rather than 2.",
        "created_at": "2020-11-15T18:30:38.646000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think what people expect is the ability to tie without a validator to an eth1 address for good but since we don't know what the future will hold i think most will set it to some placeholder which kind of misses the point.",
        "created_at": "2020-11-15T18:32:16.399000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I dont see how this doenst allow to \"tie without a validator to an eth1 address\"",
        "created_at": "2020-11-15T18:33:05.386000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!291925846556540928\u003e when do you think we can commit to the points above and bee sure it's implementable during the merge? are we talking a year? or 6 months. I think it can change the way we can approach it",
        "created_at": "2020-11-15T18:33:22.157000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I just assumed what this contract might do.  I think I was assuming wrong. Let me review first",
        "created_at": "2020-11-15T18:34:48.958000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "😬",
        "created_at": "2020-11-15T18:35:00.036000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e Maybe i'm overthinking it and we can make do with a simple value tx and that's it but i'm worried we are losing some important functionality. If say we can well define this transaction + make sure it's implementable during the merge i think it's worth waiting aa bit.",
        "created_at": "2020-11-15T18:38:44.234000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Ah, so this contract lets you change your credentials. Im not sure if there is a lot of value there. Pretty much, dont deposit if you arent comfortable with bls withdrawal creds, the ability to change them doesnt really signify trustlessness in any meaningful way\n\nInstead, we need a new withdrawal prefix 0x01 signifying an eth1 addr\n\nI think there are two things to do:\n\n- specify how ether will be transferred somewhere when withdrawal (push  vs pull, etc)\n- specify the opcodes to read about the beacon state or some sort of  meta data tied to the withdrawal tx\n\nFor the former, we can probably come to an agreement on this and do something very simple in the near term. Im pretty convinced this will open up a huge design space for pools and other custody options\n\nFor the latter, I dont really feel comfortable specifying this until much closer to merge\n\nIf we try to add meta data  to be carried by the withdrawal tx, similarly I dont see us be able to concretely commit to a design until nearer the rest of the merge is specified",
        "created_at": "2020-11-15T18:45:44.254000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I might be totally wrong, but I'm fairly convinced a majority of designs here can be handled with the simple tx method",
        "created_at": "2020-11-15T18:46:41.180000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Mm ok so the second suggestion is really interesting. You saying let’s do a simple value tx but open up op codes to read data about it? Separate the two things?",
        "created_at": "2020-11-15T18:48:36.413000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If so it still means anyone who wants to tie to a contract doesn’t know how those op codes will look like which makes it harder to actually set a 0x01 address",
        "created_at": "2020-11-15T18:49:23.102000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Im saying you can design many withdrawal contracts that dont care about those calls and you can do that today",
        "created_at": "2020-11-15T18:50:48.040000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Then nearer the merge, you can design contracts that do care about those calls using the opcodes",
        "created_at": "2020-11-15T18:51:20.088000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Using child contracts that a parent configured per validator, you can get pretty solid granularity  on withdrawal info",
        "created_at": "2020-11-15T18:52:01.039000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If thats what you need",
        "created_at": "2020-11-15T18:52:05.584000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Ok.",
        "created_at": "2020-11-15T18:52:41.008000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I’ll do some thinking how it fits in our design.. there are some challenges here. \n\nOther than pools, what other use cases people need this for?",
        "created_at": "2020-11-15T18:53:46.076000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There are probably a lot better custody options for eth1 addrs in general so I could see many just wanting a standard addr with final control\n\nSmart contract wallets are increasingly used for security and functionality. Ability to have more sophisticated rules other than bls multisig and threshold  (e.g. gnosis safe)\n\nAnd beyond that, better options for pools and multi-party setups",
        "created_at": "2020-11-15T18:57:38.119000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Chew on it. Would love to better understand the challenges sometime this werk",
        "created_at": "2020-11-15T18:58:00.960000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e There are probably a lot better custody options for eth1 addrs in general so I could see many just wanting a standard addr with final control\n\u003e \n\u003e Smart contract wallets are increasingly used for security and functionality. Ability to have more sophisticated rules other than bls multisig and threshold  (e.g. gnosis safe)\n\u003e \n\u003e And beyond that, better options for pools and multi-party setups\n\u003c@291925846556540928\u003e  for all that a simple value tx is probably enough.",
        "created_at": "2020-11-15T18:58:31.757000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Btw, how will that tx happen? \n1) gained eth above 32\n2) when actually exiting and withdrawing.\nIs the eth1 address just passively receiving? Or is it a pull and if so with what key (eth1 or 2?)",
        "created_at": "2020-11-15T18:59:48.037000+00:00",
        "attachments": null
    },
    {
        "author": "emansipater",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e Ah, so this contract lets you change your credentials. Im not sure if there is a lot of value there.\n\u003c@291925846556540928\u003e one scenario this is extremely useful for is when multiple parties share a BLS key via some form of keysplitting.  So they can agree on a contract to divide funds and individual parties are assured of a secure outcome even if the others disappear. Meanwhile the parties can change the contract they have assigned so long as they all agree to the change.  You might say, the same is possible by just permanently setting a multisig contract or similar. But the main difference is that the EVM currently can't use BLS signatures. So this effectively gives BLS capability to the withdrawal contract before the EVM supports it",
        "created_at": "2020-11-15T22:11:03.632000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So there are two problems\n\n(1) being able to initiate staking with an eth1 withdrawal addr (and thus contract / trustless support)\n(2) being able to control the destination address with an 0x00 bls credential\n\nI've always considered (2) as something that would happen via a message further down the line. This attempts to solve (2) in an immediate and dynamic fashion, right?\n\nBut it does not really aim to solve (1) directly, right?",
        "created_at": "2020-11-15T22:48:50.837000+00:00",
        "attachments": null
    },
    {
        "author": "emansipater",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "~~Correct, no attempt to solve (1).~~ Exits still have to be initiated with BLS sigs on beacon chain, and deposits still have to be initiated as normal. I think any other strategy would take longer to implement (unless someone else can think of a very simple way that I'm missing). *edited to clarify since yes it does basically solve 1, just with an extra step of having to pre-submit a final withdrawal address as noted in the message below.*",
        "created_at": "2020-11-15T22:53:47.121000+00:00",
        "attachments": null
    },
    {
        "author": "emansipater",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Note however that one can commit to a final withdrawal address via the DSWC prior to making the deposit, which is almost as good imo",
        "created_at": "2020-11-15T23:23:43.592000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I see. yeah the pre-commit makes sense!\n\nI have some notes on a different path. I'm afk for the rest of the evening, but will try to share them by mid tomorrow",
        "created_at": "2020-11-15T23:33:40.747000+00:00",
        "attachments": null
    }
]