[
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Looks like this would effectively eliminate the incentive for performing \"exit-withdraw-deposit\" loops (and cluttering the beacon chain), while also being limited enough to make it unreliable as a means for arbitrary value transfer. The fact that the entire excess is transferred and the validator can't specify an amount is a nice touch. Seems like the negligible data impact would cost far less than the potential churn \u0026 bloat of having to deal with \"exit-withdraw-deposit\" loops 👌",
        "created_at": "2020-11-25T01:04:11.144000+00:00",
        "attachments": null
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Will add this to the ethresearch thread, but I think it's important that transfers can only be performed with a message signed by the withdrawal key. Decentralized staking pools' validators will be using a validator key controlled by the node operator and withdrawal creds controlled by the pool (preferably an eth1 contract). If the validator key can be used to transfer balance, that will cause problems.",
        "created_at": "2020-11-25T01:15:41.708000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It gets complicated if the withdrawal address is an eth1 contract.",
        "created_at": "2020-11-25T07:16:22.456000+00:00",
        "attachments": null
    },
    {
        "author": "daodesigner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "https://c.tenor.com/SdiiDPoxJUgAAAAM/richard-ayoade-it-crowd.gif",
        "created_at": "2020-11-25T07:31:58.417000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "haha.. Well  I think any validation of an eth1 transaction on the beacon-chain complicates things as we need to include smart conntract txs in that.\n\nThe proposal made by \u003c@!291925846556540928\u003e just pushes the balance to an eth1 address as a value tx so it does't really matter what's behind that address.\nIf we want to have a pull mechanism of any sort (withdrawal or transferring access ETH) than somehow the beacon-chain needs to know that the request is valid. \nIf the requester is an eth1 address than we need to somehow parse those txs and validate them on the beacon-chain.",
        "created_at": "2020-11-25T07:36:32.606000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If the validator key is a composite held by multiple parties that requirement is fulfilled automatically by the process of signing the block proposal.",
        "created_at": "2020-11-25T07:41:19.526000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "But then the validation key is controlling \"withdrawal\" actions",
        "created_at": "2020-11-25T07:50:41.901000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I read the proposal again and it seems the validation key also specifics the destination which breaks the assumption that the withdrawal destination is not controlled by the validation key.",
        "created_at": "2020-11-25T07:58:12.155000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It does somewhat change the definition of \"validator\" key to be more administrative.  Note that a transfer isn't a withdrawal",
        "created_at": "2020-11-25T08:37:10.399000+00:00",
        "attachments": null
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!144468805697929216\u003e what if it just initiates a transfer like Danny suggested? \nIf it's an eth1 it will send the assets. If it's a BLS key it will require completing the transfer with the withdrawal credentials?",
        "created_at": "2020-11-25T13:22:44.406000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The destination is a validator index, not a key or credential",
        "created_at": "2020-11-25T13:24:21.552000+00:00",
        "attachments": null
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "On a technical level, yes. A transfer of balance is a lot like a withdrawal conceptually though, from the point of view of users of the beacon chain. It seems unintuitive to me for validator keys to have control over that operation (in addition to causing problems for us and any staking pools with similar architectures).",
        "created_at": "2020-11-25T21:53:18.182000+00:00",
        "attachments": null
    }
]