[
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!144468805697929216\u003e I initially had similar thoughts around automatically pushing the validator balance to the ETH1 address when the validator becomes withdrawable.\n\nHowever, I think this method could make it difficult for dApp developers to reliably discern whether the validator balance has actually been withdrawn to their contract and handle the event appropriately. If the contract balance simply updates at some point, how do you know where it's come from? It could just as easily have come from a contract with an ETH balance which has been self-destructed to your contract's address.\n\nIn contrast, a \"pull\" method gives the dApp developer complete control over the mechanism, so they can be certain that a validator withdrawal has actually been processed.",
        "created_at": "2020-08-31T00:03:22.658000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": ".\nAlso, my 2c on a \"change withdrawal credentials\" op - this is a pretty interesting idea, but I think (at least for our use case), a commitment to a specific ETH1 withdrawal method carries a lot more weight and is an important piece of the puzzle - as opposed to a mechanism which only allows for such a method to *maybe* be implemented in future.\n\nIf there is no guarantee of / commitment to ETH1 withdrawals being supported, nobody can build platforms which take advantage of that concept for trustless validator pool withdrawals. You would always need to build with the assumption that they won't be supported, and implement some centralized / custodial withdrawal system first.\n.",
        "created_at": "2020-08-31T00:11:49.494000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e standard BLS withdrawals will need this thought through to a certain extent as well\n\u003c@!291925846556540928\u003e Pardon my ignorance, but how are standard BLS withdrawals affected by this concept? I assumed that a different withdrawal prefix would flag a completely separate / unrelated withdrawal method and the beacon clients would (presumably) check this byte and run entirely different logic depending on its value. Is this not the case?",
        "created_at": "2020-08-31T00:18:10.692000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!332037095482720256\u003e no reason the transfer couldn't trigger a call to the relevant contract with well-known parameters.\n\nAs for the commitment to an ETH1 withdrawal method, the problem isn't making the commitment as much as defining the method.  2 months or so before mainnet launch, seems like a very short time to work through all of the various possibilities, interaction with how phase 1.5 is likely to work, fallbacks in case it changes, _etc._ and have something set in stone.  The point of being able to change withdrawal credentials is that it would allow whatever is worked out in the future to become available to all, without the time pressures to build it right now.",
        "created_at": "2020-08-31T07:19:43.238000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!144468805697929216\u003e Cool, wasn't sure if it was possible to trigger a call using that method but if so, that sounds good :)\n\nRe: the withdrawal method, as long as there is a commitment to supporting eth1 withdrawals, wouldn't the credentials basically look the same regardless of the implementation? I figured it's basically a given that they would consist of a specific prefix byte followed by 20 bytes for the eth1 address, plus padding. Am I missing something which would potentially make this more complex?",
        "created_at": "2020-08-31T07:22:38.090000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Well what would the ETH1 address be for?  A deployed smart contract?  Without knowing the requirements for the smart contract how would it be deployed?",
        "created_at": "2020-08-31T07:25:20.058000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Right, sorry I see what you mean yes. I was picturing a \"push\" method with no call / opcode etc, but that doesn't really make sense given the requirements",
        "created_at": "2020-08-31T07:36:03.439000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If you have any ideas about your requirements for this, it would be great to note them down here.  At current I think this is more of a \"wouldn't it be nice if...\" and some specific use cases would allow this to be firmed up",
        "created_at": "2020-08-31T07:46:36.082000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I suppose that depends on your perspective. It probably isn't necessary for most use cases, but for a truly decentralized staking pool it's basically mandatory. Trustless withdrawals split between multiple parties aren't viable using BLS withdrawals as per the current spec. So without something like withdrawals to smart contracts, we get forced into centralized solutions like professional custody providers or similar.",
        "created_at": "2020-08-31T07:55:01.330000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Granted, a \"change withdrawal credentials\" mechanism would at least allow us to move to a decentralized withdrawal mechanism at some point in the future, but probably doesn't inspire much confidence in our user base for phase 0",
        "created_at": "2020-08-31T07:55:58.811000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I suppose it would be a matter of bringing that possibility forward rather than having to wait until phase 2, when BLS pubkeys could (afaiu) represent smart contracts on eth2 shards",
        "created_at": "2020-08-31T07:56:50.686000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sure, sorry my point was more that this has more been discussion around an idea, rather than something that is being drive by concrete requirements.  I'm all for seeing this as soon as practicable, but it's hard to consider the implications of it without having a firmer idea of what it's trying to achieve.\n\nI guess I could start off with some off-the-top-of-my-head thoughts.  I'll leave the method of triggering the smart contract, and consider the function signature.  We'd want:\n\n  - the amount of Ether sent (should be in `msg.value`)\n  - the validator from which the Ether was sent (index?  pubkey?)\n  - if the validator had been slashed\n  - some sort of chain identifier from Ethereum 2, in case of forks (fork_version is a possibility, although that changes so the smart contract would need to be kept up-to-date)\n  - anything else?",
        "created_at": "2020-08-31T08:00:58.739000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sorry, I'm with you now, yep 🙂",
        "created_at": "2020-08-31T08:01:34.715000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "that sounds like a pretty comprehensive list to me, although I'm coming at this primarily from the POV of a dApp developer, so I'm not as intimately familiar with the eth2 internals as probably most others in this channel",
        "created_at": "2020-08-31T08:03:03.519000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "validator pubkey makes the most sense to me, although I suppose there would be no harm in passing index as well",
        "created_at": "2020-08-31T08:03:29.491000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "possibly for the sake of being thorough, `withdrawable_epoch` might be useful to some as well? but can't imagine that we would use that ourselves.",
        "created_at": "2020-08-31T08:05:30.546000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If it's cheap then a dump of the validator struct may be a good idea.  Basically gives the history of the validator as it moved through its lifecycle, which may be useful to some.",
        "created_at": "2020-08-31T08:06:51.122000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "yeah that makes sense",
        "created_at": "2020-08-31T08:07:13.930000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "perhaps it would also be useful to have genesis_fork_version as well as current fork_version too",
        "created_at": "2020-08-31T08:07:30.604000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Genesis validators hash has become the defacto identifier of eth2 chains.",
        "created_at": "2020-08-31T08:31:23.870000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Are we locked in with a particular BLS withdrawal scheme? If not, we could use `withdrawal_credentials` to authorise the withdrawal whatever withdraw scheme we end up with.",
        "created_at": "2020-08-31T12:25:56.234000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The idea is to lock the withdrawal recipient to be an Ethereum 1 smart contract, so the withdrawal credentials would have to reflect that.",
        "created_at": "2020-08-31T12:30:21.203000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "why is it important for withdrawal credentials to reflect that?",
        "created_at": "2020-08-31T12:49:11.807000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If the Ether is guaranteed to be returned to a smart contract then its distribution is defined by the rules of that smart contract, allowing for trustless staking pools (for example).",
        "created_at": "2020-08-31T12:50:54.222000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "what if this smart contract would be specified in the withdraw operation?",
        "created_at": "2020-08-31T12:52:46.693000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "That would require trusting the holder of the withdrawal credentials to enter the \"correct\" address in the withdraw operation.",
        "created_at": "2020-08-31T12:55:34.073000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "doesn't trusting to a staking service already implies that?",
        "created_at": "2020-08-31T12:58:11.858000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Pooling doesn't necessarily imply a service, or trust.\n\nYou could have two people with 16 Ether each.  One runs the validator, so they hold the validator key.  But the funds return to the smart contract, where the first 16 Ether plus 1/3 of the value above 32 Ether goes the the person not running the validator, and the rest goes to the person running the validator.\n\nJust an example, but the type of thing that this would enable (to be fair, I run a service to which the above doesn't apply so I may be misrepresenting something).",
        "created_at": "2020-08-31T13:04:50.381000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I am not sure about the example. It seems that we would need a pair of withdrawal credentials to implement it. We need a particular destination, this is reasonable. What I was thinking about is to have a flexibility in at least contract address if we're talking about Eth1 withdrawals. Though, if it were a system contract processed by Eth1 node then this flexibility doesn't make much sense.",
        "created_at": "2020-08-31T13:17:13.788000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "What I was thinking about is since we can't foresee now how the exact scheme looks like then let's just keep it flexible. Probably, we can submit Eth1 address in withdrawal credentials but it's hardly possible to add anything other than that before we have a prototype for exact Eth1 withdrawal scheme.",
        "created_at": "2020-08-31T13:22:33.546000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sure, we discussed allowing the withdrawal credentials to be updated as a separate operation and that would tide us over until we had a full specification.  But that wasn't going to be helpful to those who want to deposit early in phase 0 but still have some amount of surety that the current holder of the withdrawal credentials won't run off with their funds.",
        "created_at": "2020-08-31T14:41:37.697000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Which key is going to be used to sign withdrawal credentials update?",
        "created_at": "2020-08-31T14:51:09.594000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "if we did that as an operation type, it would have to be withdrawal keys",
        "created_at": "2020-08-31T14:51:31.619000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "in this case, don't we face with the necessity of trusting to the holder of withdrawal key?",
        "created_at": "2020-08-31T14:53:30.462000+00:00",
        "attachments": []
    },
    {
        "author": "schone_wizard",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Excuse me for asking the same question I did on \u003c#598292067260825641\u003e but what was the technical reason withdrawal to eth 1 chain weren’t possible with eth2 phase 0?",
        "created_at": "2020-08-31T14:56:55.985000+00:00",
        "attachments": []
    },
    {
        "author": "schone_wizard",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Like how did that decision come about",
        "created_at": "2020-08-31T14:57:10.988000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Early phases of eth2 do not require consensus changes on the existing chain. This allows us to bootstrap the new consensus mechanism without encumbering the existing tech. Only when its ready to drive the consensus of the current chain will breaking changes need to be made",
        "created_at": "2020-08-31T14:58:35.283000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This allows for eth2 to move rapidly while derisking the existing infrastructure",
        "created_at": "2020-08-31T14:58:50.566000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!425572898787426305\u003e May be worth summarising where we are so far:\n\n  - having withdrawal credentials being an ETH1 address allows smart contracts to receive validator funds on withdrawal\n  - to do so, we need to define (at a minimum) the function that would be called on withdrawal, the method of withdrawal (manual or automatic), and ensure that it will work with whatever ETH2-\u003eETH1 integration we end up with\n  - because this isn't fully defined as yet, the idea of allowing withdrawal credentials to be updated was mooted to allow the second point to be fully fleshed out without the pressure of requiring it before phase0 goes live\n\nThat's pretty much it.  As of the point that we can have an ETH1 address suppplied as part of a validator deposit that would obviously be the preferred way to go, but until then the ability for users to decide if they want to trust the withdrawal credentials holder short-term until the ETH1 interface is finalised could be a half-way house.",
        "created_at": "2020-08-31T15:01:05.191000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Thanks for the summary \u003c@!144468805697929216\u003e An op to change withdrawal credentials looks like a temporal solution then until we have withdrawals to Eth1 settled down. Am I right?",
        "created_at": "2020-08-31T15:12:45.137000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yep",
        "created_at": "2020-08-31T15:14:16.864000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "What worries me for a little bit is that after this operation removed there is no room for a bug in withdrawal scheme cause withdrawal credentials will be tightly coupled with the scheme. And if any vulnerability or bug is found at some point in time there will be no way to switch the scheme other than hard fork",
        "created_at": "2020-08-31T15:20:22.066000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "* to switch the scheme for already made deposits",
        "created_at": "2020-08-31T15:21:24.910000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We don't need to do implement the \"change withdrawal credentials\" operation until we've finalised the scheme (or at least, there will not be a lot of use to carry out the operation until we've finalised the scheme).  And yes, if there's a bug in the scheme that's a problem, but then that's always going to be the case and as long as we the time to work through it we should be able to reduce the risk.",
        "created_at": "2020-08-31T15:56:56.873000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Automatic withdrawals could potentially add more risk in that regard",
        "created_at": "2020-08-31T17:19:41.829000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yep",
        "created_at": "2020-08-31T18:13:13.940000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "would automatic withdrawals also involve more complexity wrt paying gas fees etc? intuitively it seems like it could be difficult to figure out how gas is paid when an automatic withdrawal hits some  `eth2receive` method. e.g. do we subtract the gas cost from the validator balance and give that to the miner who includes the block (... if so, I assume this has implications on using `msg.value` for the withdrawn balance)?",
        "created_at": "2020-08-31T23:08:43.494000+00:00",
        "attachments": []
    }
]