[
    {
        "author": "darcius",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e This does have the downside of the contract not \"knowing\" if the ETH received is actually from a withdrawal or not. This may limit some designs, but I'm not immediately seeing the particular downsides.\n\u003e Does anyone have an instance of a withdrawal contract design that would be limited by not knowing if the funds received were from a withdrawal?\n\u003c@!291925846556540928\u003e \n\nIf memory serves, this is the way it was in the old Casper contract if you registered a contract address as the withdrawal address and that worked fine back then. Only addition to that which ties into what \u003c@!332037095482720256\u003e said above, is that back then you could use a smart contract to determine if that validator had indeed finished staking and you could naturally assume that the received ETH was from it. Currently a smart contract wouldn't be able to do this, so if that contract received ETH from anywhere, it wouldn't know if that ETH was sent from the validator exiting and then how to act accordingly since it doesn't know if it was from ETH2 or another user trying to trick the contract.\n\nI think an interface method or even as \u003c@!332037095482720256\u003e suggested, a from address that is known to be from ETH2 would be ideal and still quite light to implement from a dapp perspective. Honestly whatever is the easiest and quickest from both sides would get a huge thumbs up from me given how majorly helpful this would be for ETH2 \u003c:simpsonhappy:405668432147775488\u003e",
        "created_at": "2020-09-16T05:00:31.561000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Designing anything at this point that involves any firm commitment to the eth1 scheme other than \"ETH ends up in the addr specified by the withdrawal credentials\" would require much more thought/time than I think people are willing to take to make this useful before mainnet.",
        "created_at": "2020-09-16T20:56:50.665000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I personally haven't been able to give this the time it needs. For it to get some more serious consideration, one of the interested parties should probably write up a design doc detailing the few methods discussed and the apparent trade-offs at this point in time",
        "created_at": "2020-09-16T20:57:44.923000+00:00",
        "attachments": null
    }
]