[
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e What does metadata enable that simple transfer fails at?\n\u003e \n\u003e If the pool needs to operate with more granularity, it can create child contracts that are tied to individual vals or sets of vals\n\u003c@!291925846556540928\u003e\n\nThe other consideration is being able to verify that transferred ETH is in fact coming from the beacon chain / is equal to the validator's deposit. If this was implemented as a simple tx, would it be possible to verify this? Or could arbitrary addresses send txs to the withdrawal contract which are indistinguishable from the real thing?\n\nE.g. Say a staking pool wants their validator withdrawal contract to disseminate the received ETH to the appropriate parties and then destroy the associated validator contract on the eth1 chain - it would be extremely helpful to have some way to verify that the amount received is correct *on chain*. Not sure what the alternative would be, but seems like it would necessitate some kind of oracle system to commit beacon chain data to the eth1 chain to \"confirm\" the received amount?",
        "created_at": "2020-11-17T00:30:59.100000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Or would there potentially be some special `msg.sender` value for txs originating from the beacon chain, say `0x000...000`?",
        "created_at": "2020-11-17T00:32:10.923000+00:00",
        "attachments": []
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So i'm running ways to do basic creation/ liquidation/ withdrawal for a pools network having an eth1 as the withdrawal credentials. \nI think it's important to discuss who initiates the actual transaction? \n- In case of a simple transfer (say liquidating rewards) \n- In case of an exit/ slashing will the ETH move automatically or by pulling?",
        "created_at": "2020-11-17T09:53:31.050000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e So i'm running ways to do basic creation/ liquidation/ withdrawal for a pools network having an eth1 as the withdrawal credentials. \n\u003e I think it's important to discuss who initiates the actual transaction? \n\u003e - In case of a simple transfer (say liquidating rewards) \n\u003e - In case of an exit/ slashing will the ETH move automatically or by pulling?\n\u003c@636950487089938462\u003e\n\nI think it would be preferable if the mechanism was the same regardless of whether the exit was voluntary or forced (and this probably fits better with the beacon chain anyway since exits are processed the same way regardless).\n\nImo pull looks more useful than push, since it allows the contract to run arbitrary logic in the same tx which is sent to claim the reward.",
        "created_at": "2020-11-17T19:47:32.926000+00:00",
        "attachments": []
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If it's pull than what key initiates the transaction? the eth1 key?",
        "created_at": "2020-11-17T20:45:53.090000+00:00",
        "attachments": []
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If so it means we need mapping between validator \u003c\u003e eth1 address",
        "created_at": "2020-11-17T20:46:15.433000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e If it's pull than what key initiates the transaction? the eth1 key?\n\u003c@!636950487089938462\u003e Yeah that's what I would imagine\n\n\u003e If so it means we need mapping between validator \u003c\u003e eth1 address\n\u003c@!636950487089938462\u003e Probably, although perhaps there are potential impls where this isn't the case - if running a beacon node alongside an eth1 node becomes a requirement there might be some async way to withdraw validator balance over to the eth1 chain within the scope of a tx 🤷 ?\n\nAt any rate, what I was picturing was something like:\n- A global withdrawal contract at a fixed address on each network (similar to the validator registration contract)\n- When a validator's `withdrawable_epoch` passes, if it's using eth1 withdrawal creds, the beacon chain pushes its balance to the eth1 withdrawal contract\n- A mapping of `address =\u003e balance` on the withdrawal contract is updated somehow\n- The eth1 address calls a `withdraw` method on the withdrawal contract to pull its balance (and if the eth1 address is a contract, it can do so in an internal tx and then run any additional logic it needs to)\n\nI don't really know enough about eth1 internals and how the eth1 \u003c\u003e eth2 link will work to know how realistic an impl like that would be - just my take on what would be most beneficial for those using it.",
        "created_at": "2020-11-17T22:44:59.690000+00:00",
        "attachments": []
    }
]