[
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'm not really fully paying attention to this conversation, but I am very adamantly against validator key having any transfer ability.  Doing so would give it the power to steal deposits via validator key compromise.",
        "created_at": "2020-11-26T02:28:05.180000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Trouble is, if withdrawal keys are required to carry out this type of transfer it will result in the withdrawal keys being hot, or intermittently hot.  So they'll end up with the same combination of protection+availability that validator keys have, and that's just made the problem worse.\n\nAt some stage people are going to want to move the Ether they have been rewarded around.  Finding some way of doing that with minimal disruption to the chain is something that's going to need to be tackled.",
        "created_at": "2020-11-26T02:51:37.215000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\"Hot\" withdrawal keys definitely sounds like something to be avoided at all costs (although from my perspective, is less problematic than giving validator keys transfer ability).\n\nIs this definitely the case in any implementation, or does it depend on the contents of a transfer operation? E.g. would it be possible to sign transfer messages in advance and have a validator simply hold them until they propose a block and include them at that point?",
        "created_at": "2020-11-26T03:53:08.297000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e intermittently hot\nIntermittently hot is *way* better than \"key on a server\"",
        "created_at": "2020-11-26T04:06:32.243000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I can use a hardware wallet or multisig, for example.  And I can (hopefully) roll keys.",
        "created_at": "2020-11-26T04:06:41.952000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "From a security standpoint, the ability to transfer is effectively the same as the ability to withdraw.  If someone has your transfer key they can do an equal amount of harm to you as if they have your withdraw key (steal all your money).",
        "created_at": "2020-11-26T04:08:24.274000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So I think it isn't accurate to argue that these should be different keys.",
        "created_at": "2020-11-26T04:08:39.843000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e bear in mind that thie proposed transfer is only for funds above 32 Ether, so the principal is always protected.  There is higher risk to the principal from losing the validator key, as it can be used to trigger a slashing event and burn some/all of the funds.",
        "created_at": "2020-11-26T07:32:39.983000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e there is higher risk to the principal...\nDepends on how long the person has been validating for, right?",
        "created_at": "2020-11-26T07:33:28.773000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If you have 32 ETH principal and 50 ETH worth of interest accumulated over the years, someone would benefit more from attacking the interest.",
        "created_at": "2020-11-26T07:33:57.648000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e burn some/all of the funds.\nMy understanding is that the burn is pretty limited in most cases (though I still would like to see a better breakdown of how much burn happens).",
        "created_at": "2020-11-26T07:34:54.849000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think the other aspect is that if you steal a validator key, you can harm the person but profits are pretty minimal (shared among all not-attacked validators).  If you steal the transfer key, you can profit.  This means theft of the transfer key would have much higher motivation than of the validator key.",
        "created_at": "2020-11-26T07:35:49.733000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!332037095482720256\u003e there are options.  The simplest would be to allow the withdrawal key to assign rights to the validator with a simple set bit operation on the validator struct.  A more detailed option would be to allow the withdrawal key to specify which index to allow transfer to.  But each of these comes with additional chain bloat and (probably) attack vectors.  The point of the proposal was to find a balance between functionality and complexity.",
        "created_at": "2020-11-26T07:36:25.974000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e slashing penalty is ~0.3% of funds, plus negative rewards for ~1 month, plus additional penalty of x% of your funds where x% is the percentage of other validators slashed in the same period as you (+/- 18 days)",
        "created_at": "2020-11-26T07:37:57.612000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Happen to have some example numbers for \"one slashed validator\" vs \"1% validators slashed\" vs \"32% validators slashed\" vs \"49% validators slashed\" or something?  Just to get an idea of scale/scope.",
        "created_at": "2020-11-26T07:39:05.717000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Thing is, we need to enable transfers somehow.  Making them mini-withdrawals will be painful in different ways to allowing a simple transfer of excess, we aren't going to be able to this for free.\n\nThis would move \"validator key\" to \"administrative key\", but _something_ is going to change.",
        "created_at": "2020-11-26T07:42:09.938000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "1% of validators slashed =\u003e 0.3% + ~2% (at genesis; in general, dependent on number of active validators) + 0 = ~2.3%\n32% of validators slashed =\u003e 0.3% + ~2% + 32% =\u003e ~34.3%\n49% of validators slashed =\u003e 0.3% + ~2% + 49% =\u003e ~51.3%\n\n(Bear in mind that the first and last number are /3 for the start of the chain, and are expected to go back to their full amounts once the chain settles down)",
        "created_at": "2020-11-26T07:44:02.989000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'm fine with 3 keys.  As long as validator key can be different from withdraw and transfer keys.",
        "created_at": "2020-11-26T07:48:49.218000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I don't see how another key helps.  It would in all likelihood be held by one of the existing holders, so pretty much reduces to that.\n\nThe other issue with keys is that if we require a signed operation to carry out the transfer then it will fail for smart contracts.",
        "created_at": "2020-11-26T08:43:20.072000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "A user can *choose* to use the same key for validating, withdrawing, transferring.  I definitely don't think we should have strict enforcement at the protocol level that those things are different.",
        "created_at": "2020-11-26T08:47:08.319000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "However, since the risks differ for each of the operations, I think there is value in making it *possible* to have a different key for each task.",
        "created_at": "2020-11-26T08:47:35.276000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "* Validator key risks are pretty low, 2.3% pragmatically, but can be higher.\n* Transfer key risks increase as you earn. They start out at 0% but increase unboundedly. These risks can be mitigated by withdrawing more frequently.\n* Withdraw key risks are high, you can suffer 100% losses if your withdraw key is compromised.",
        "created_at": "2020-11-26T08:49:28.839000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e The other issue with keys is that if we require a signed operation to carry out the transfer then it will fail for smart contracts.\nAs I have mentioned before, I'm actually against keys for everything if possible.  I think you should be able to use a contract address for validation, transferring, and withdraw.",
        "created_at": "2020-11-26T08:50:29.715000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "However, I recognize that contracts for validation adds notable complexity to the system as you need to deal with something similar to gas, state synchronization, etc.  For transfer and withdraw though nothing is immediately obvious as \"contracts don't work\".",
        "created_at": "2020-11-26T08:51:35.612000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This was why my proposal was purely on the beacon chain, to other validators, and bounded to rewards.  A general-purpose transfer mechanism on the beacon chain isn't the aim.\n\nThere are other ways that this can go, but there is going to be almost immediate pressure for rewards to be made useful (not only for stakers, but for the network).  Making the merge a pre-requisite would stall this, hence trying to work with what we have.\n\nFor problems like \"the validator can run off with the rewards\", this only matters if we have two separate key holders.  And for something like Rocketpool it should be possible to handle that with accounting when the validator exits, in the same way that it is done for slashing or other loss.",
        "created_at": "2020-11-26T08:58:08.052000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "My concern isn't that \"validator will run off with rewards\", it is that I don't trust myself to secure a private key on a physical host that is using the key to run some software.",
        "created_at": "2020-11-26T11:42:31.929000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I expect to have the same keyholder for all 3 keys, but they will utilize different security systems for each, since they have varying levels of risk.",
        "created_at": "2020-11-26T11:43:10.316000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If we have a separate key then we're back to a separate operation to those which the validator undertakes, and a much more complicated system to carry out the transfer.  It is, of course, possible, but would probably not happen due to the added complexity and level of similarity to withdrawals.",
        "created_at": "2020-11-26T12:00:55.235000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Allowing the withdrawal key to assign transfer rights to the validator sounds like a good solution, assuming that the resulting bloat (sounds pretty minimal but maybe im missing something) is acceptable. Making tbat opt-in removes any nasty surprises for those who don't want it to have those rights",
        "created_at": "2020-11-26T20:34:08.974000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Depends how it's implemented.  If the withdrawal key can give carte blance to the validator to transfer excess balance to whichever index it wants that can be pretty minimal.  If the withdrawal key has to give explicit permissions for each target index it would be a little more ugly (and would require the withdrawal key more often).",
        "created_at": "2020-11-26T20:37:58.736000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Perhaps along similar lines, a one time operation which sets the transfer index and \"enables\" the excess transfers, then from that point on, its always done automatically when the validator proposes blocks?? Idk if that makes sense",
        "created_at": "2020-11-26T20:38:28.059000+00:00",
        "attachments": []
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "True. I don't think I have a good enough picture of all the possible use cases to know if option 1 covers everyone's needs... but it sounds good to me",
        "created_at": "2020-11-26T20:39:37.751000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I have a fair few bits of feedback to cover, will try to get around to that tomorrow and will update the ethresear.ch post with the options with their pros and cons as discussed so far.",
        "created_at": "2020-11-26T20:43:25.159000+00:00",
        "attachments": []
    }
]