[
    {
        "author": "tsudmi",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hi guys, I think the idea is awesome, and having something in place before phase 0 would be great. I also think that getting provenance of the funds is possible without sending additional data about the validator to the contract. \n\nOne possible way is to deploy a minimal proxy contract (see https://eips.ethereum.org/EIPS/eip-1167) for every validator and use the proxy address as a withdrawal destination for that specific validator. This way we can keep the implementation of validator withdrawal to ETH1 address very simple (just call `receive` function of the contract).",
        "created_at": "2020-09-08T15:11:22.905000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The simplest commitment that could be made today to this scheme is that the ETH and a gas allotment would be passed along to the eth1 addr specified in the withdrawal credentials. The actual destination addr/contract would not have any sophisticated functionality/knowledge about it being an eth2 withdrawal. The entry point immediate prior would handle such complexity (e.g. a TX to a system \"contract\" that consumes a withdrawal and forwards the ETH/gas to the destination addr).\n\nIn such a case, due the gas accounting, a \"pull\" would make most sense. As in some external account on the eth1 shard chain would trigger the withdrawal TX that then hits the destination ADDR.\n\nIf account abstraction exists, the withdrawal ETH could actually pay for it's own gas, but that is neither here nor there on this proposal",
        "created_at": "2020-09-08T16:05:43.307000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This does have the downside of the contract not \"knowing\" if the ETH received is actually from a withdrawal or not. This may limit some designs, but I'm not immediately seeing the particular downsides.\nDoes anyone have an instance of a withdrawal contract design that would be limited by not knowing if the funds received were from a withdrawal?",
        "created_at": "2020-09-08T16:34:23.478000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!291925846556540928\u003e would a pull system be able to complete the withdraw operation within the scope of the transaction _i.e._ end the call with the relevant funds on its balance?  Or would it take a few slots for the state on the beacon chain to be updated and the funds released?\n\nRegarding not knowing if the funds were received from a validator, I think the question is more _which_ validator.  Validators aren't going to be directly fungible: validators can start at different times and have different performance, resulting in them having   different balances.  A staking pool contract would keep track of who put what in to a given validator so that it can apportion the funds back the users on return.  For it to do that, though, it would need to know for which validator it is receiving funds.",
        "created_at": "2020-09-08T21:11:55.994000+00:00",
        "attachments": []
    }
]