[
    {
        "author": "trztn",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I wonder if there's not a world where the application layer is encouraged to design keeper incentives to only be sent into the coinbase? And design optimized methods for value extraction that only go into the coinbase? I realize this is outside the scope of the protocol... but if there were hypothetical \"best practices\" for applications to participate in network decentralization, it seems to me like developers would be willing to do their part and 0x02 opens that door.",
        "created_at": "2021-06-09T04:04:55.831000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "On the security side of 0x02. Please, correct me if I am wrong:\n\nHacker gets access to the machine that runs the execution client and it changes the coinbase to its address.\nIn this case we get either block rewards go to hacker's address in case of 0x01 or failed block proposal in case of 0x02.\nIn both cases staker loses its potential block rewards.\n\nHacker may also change clients code to the one that allows for randomly picking malicious coinbase from time to time.\nTaking in account frequency of block proposals made by solo stakers it doesn't leave any incentives for hacker to do it this way.\n\nAlso, we assume that this machine does not run consensus client and hacker is not able to send `SetWithdrawalCredentials` to change BLS creds to its own 0x01 address. And then initiate exit.\n\nTaking in account the above I don't see a big value of 0x02 in terms of protecting inexperienced solo stakers from hackers with any level of experience.\nIt would only work if following assumptions are held:\n- Only the machine with execution client is hacked\n- Hacker is looking at validator withdrawal credentials and leaving execution client alone if sees 0x02 kind of creds\n\nOtherwise, we could get even worse result of attack or loss of block proposal rewards (including transaction tips).",
        "created_at": "2021-06-09T09:14:36.581000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\"leaving execution client alone if sees 0x02 kind of creds\"\n\nassumption is slightly weaker. Even if they wish to tamper, they need to establish a sidechannel for MEV. Can't use flashbots as long as flashbots relies on coinbase address",
        "created_at": "2021-06-09T09:26:04.862000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e Hacker gets access to the machine that runs the execution client and it changes the coinbase to its address.\n\u003e In this case we get either block rewards go to hacker's address in case of 0x01 or failed block proposal in case of 0x02.\n\u003e In both cases staker loses its potential block rewards.\nYes but in case 1 the hacker gets something and with 0x02 the hacker gets nothing, therefore the hacker has less incentive to do this under 0x02 (the only incentive here is to create pain for the node operator).\n\u003e Also, we assume that this machine does not run consensus client and hacker is not able to send SetWithdrawalCredentials to change BLS creds to its own 0x01 address. And then initiate exit.\nFair but in rocketpool this will be addressed (withdrawal address changes must be signed by the current withdrawal address to take effect). Does not apply to solo stakers though",
        "created_at": "2021-06-09T09:38:30.094000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e Yes but in case 1 the hacker gets something and with 0x02 the hacker gets nothing, therefore the hacker has less incentive to do this under 0x02 (the only incentive here is to create pain for the node operator).\nRight, but before getting access to the machine the type of creds used by execution client on it won't be known. And fair argument would be that in case of 0x02 hacker will have to use execution client that uses externally set coinbase address over the one that is sent from consensus client. Modifying execution client this way is worthless because it doesn't bring any positive outcome to hackers (block proposals will be invalidated). So, all that hackers could do with this kind of setup is to break execution client with no profit.",
        "created_at": "2021-06-09T10:01:51.733000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "yes agreed (this is what i meant by the \"create pain for the node operator\" sentence but you explained it much more clearly).",
        "created_at": "2021-06-09T10:09:45.649000+00:00",
        "attachments": null
    },
    {
        "author": "vgr2774",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "From a solo staker perspective, if he gets hacked:\n\n- If he used 0x01, he'll have lost his rewards to the hacker, but there's a bigger chance of him not knowing about this potential loss of \nrevenue since nothing actually went wrong. (at least not on the surface) The block was successfully proposed and \nthe chances of the solo staker finding out at a later time are increased which could lead to more loss of revenue.\n\n- If he used 0x02, neither the hacker or the solo staker will have gotten any rewards, but since he had a failed block proposal,\nthere's a bigger chance of the solo staker taking notice and fixing any potential security risks in his setup. Personally,\nI'd be salty if this occured, but at least the hacker didn't get any reward \u0026 on the bright side I can do something about it sooner so that\nI don't miss out on future revenue.\n\nIf enough stakers follow this reasoning, hackers will have less incentive to perform these kinds of attack because:\n\n- Their target audience becomes smaller due to stakers increasingly fixing their security leaks, denying hackers access.\n- Their target audience becomes smaller because they'll be less interested in stakers that have 0x02 set because it's a waste of time for them.",
        "created_at": "2021-06-09T10:10:27.475000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Solo stakers' block proposals are gonna be rare, thus, easy to monitor malicious coinbase address in the recent proposal and fix it long before the turn of the next proposal.",
        "created_at": "2021-06-09T10:20:19.963000+00:00",
        "attachments": null
    },
    {
        "author": "vgr2774",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I agree that the chances of a solo staker finding out are increased due to rarity of a proposal. But doesnt the argument still stand? Having a failed block proposal would imo increase the chances of a solo staker finding out and taking action even more, all while denying a malicious party any revenue.",
        "created_at": "2021-06-09T10:29:53.359000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Right, they won't be able to extract MEV if MEV extraction is coinbase-based. There are arguments that 0x02 incentivizes side-channel MEV extraction schemes to appear. If hacker will be able to replace the address in this side channel scheme with its own then the node operator will be damaged, stakers has already been cheated by the operator.",
        "created_at": "2021-06-09T10:30:06.651000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I am not arguing against 0x02 has *some* security benefits. I am trying to make a point that they are not that big as it could seem at the first glance.",
        "created_at": "2021-06-09T10:31:12.473000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I am curious how decentralized pools will establish relationships between searchers and node operators to allow for convenient communication for both parties?",
        "created_at": "2021-06-09T10:32:27.388000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!425572898787426305\u003e how big is the problem of possible attacks where hackers somehow arrange multiple rejected blocks in a row by using this 0x02 mechanism?",
        "created_at": "2021-06-09T10:33:07.005000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "it depends on the pool but rocketpool probably just intends to work with flashbots and offer preconfigured clients as options in the docker package",
        "created_at": "2021-06-09T10:33:35.763000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Under convenient way I meant the following scheme: searcher sends its bundles to a pool once instead of sending it multiple times to each operator separately. So, there is a kind of aggregator, right?",
        "created_at": "2021-06-09T10:35:02.428000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "As it is currently I think a pool-specific centralized and permissioned aggregator/relayer was excluded from the possible design (I can't speak to future plans of the RPL team but in general personally I'm not a fan of permissioned relayers)",
        "created_at": "2021-06-09T10:35:59.499000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "ing eneral the way that it works currently via flashbots is that everything goes to the flashbots relayer",
        "created_at": "2021-06-09T10:36:29.667000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "if node operators wanted to use another relayer (or do their own MEV crunching), they would be allwoed to do so, provided that they shared the rewards",
        "created_at": "2021-06-09T10:37:06.112000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I thought searchers and miners have direct communication channels as it was outline in the flashbots scheme 🤔",
        "created_at": "2021-06-09T10:38:27.835000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "they \"can\" but AFAIk the normal process  is that it goes via MEV-relay",
        "created_at": "2021-06-09T10:39:13.935000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e can speak to this as he's in the weeds on all the flashbot stuff",
        "created_at": "2021-06-09T10:39:22.343000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "By hacking only one instance? Or by hacking multiple execution clients with 0x02 and forcing them to produce invalid blocks?",
        "created_at": "2021-06-09T10:39:32.707000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "multiple, one instance i would assume is quite low impact",
        "created_at": "2021-06-09T10:39:55.546000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Then it is similar to shutting down those execution clients. 0x02 doesn't increase an attacking surface in that regard",
        "created_at": "2021-06-09T10:40:46.945000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There are a number of intermediary providers, and it does appear that some searchers have formed direct relationships with block producers, or perhaps they are the same person (there appears to be collusion).",
        "created_at": "2021-06-09T10:46:56.178000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "but basically if you form direct relationships you don't \"need\" the flashbots infra right?",
        "created_at": "2021-06-09T10:50:56.975000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Correct.",
        "created_at": "2021-06-09T10:52:45.574000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "One argument against appearing side-channel extraction schemes is that not using the coinbase requires direct communication between searchers and proposers which is more complicated. But it is doable in case of large centralized pools. Moreover, large pools are incentivezed to avoid coinbase schemes to extract more value for themselves and not share it with its stakers.",
        "created_at": "2021-06-09T10:53:45.973000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Though, we can imagine an MEV scheme where node operators of decentralized pool are connected to a \"dark\" relayer and keep extracting MEV this way while being enforced to pay transaction tips to the proposers' withdrawal address.\n\nIn this world 0x02 guarantees only tips being paid to proposer but not the extracted value.",
        "created_at": "2021-06-09T10:57:29.761000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hi, I’m only mobile so it’s a bit hard to get my point across. I believe hackers (criminals) would not want to establish side channels for MEV. Because: 1. it would be noisy, and increasing chances of shutting down operations. 2. We can leverage this to inflict pain (monetary loss) to the attacker: the attacker has to trust the validator. I can register validators to the attackers botnet, and receive its bundles. Let’s assume those bundles are sandwich attacks. Now I can do the following: Create a buy transaction in front of the original transaction (that the attacker was frontrunning), put the original buy transaction, put the attackers buy transaction, DROP the attackers sell transaction",
        "created_at": "2021-06-09T11:09:14.884000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Attacker has lost money",
        "created_at": "2021-06-09T11:09:42.046000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It’s also much more difficult to maintain persistence on the network. The attackers backdoored clients have to survive software upgrades, breakage etc.",
        "created_at": "2021-06-09T11:10:58.358000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Ir can expand on this later if you wish so",
        "created_at": "2021-06-09T11:11:14.579000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Regarding “only compromising only the execution client machine”. I believe that, for solo stakers, it’s more likely there’s only machine. You compromise one machine, you comprise them all",
        "created_at": "2021-06-09T11:13:42.754000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "not sure i agree with this :p withdrawal should be cold wallet (maybe a hardware wallet), signing is hot. or maybe i didnt get you",
        "created_at": "2021-06-09T11:16:45.889000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I agree. For those who use 0x02 type of creds the worst hackers can do is to enforce this stakers to produce bad block or initiate exit; with no profits to hackers.",
        "created_at": "2021-06-09T11:16:47.023000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sorry I don’t follow.",
        "created_at": "2021-06-09T11:17:44.835000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Won't they be able to upgrade execution client to a version that connects to some dark MEV pool?",
        "created_at": "2021-06-09T11:26:13.015000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "not entirely like this. While true that it's a bigger barrier, for a hacker to be able to modify coinbase (or try in the case of `0x02`) he needs to have access to the way the execution engine is being run. If that's the case he could simply run geth-mev instead configured to send profits to his own addresses. This way the user doesn't see any change in his coinbase earnings (in case 0x01) or doesn't get invalid proposals (in the case of 0x02). I'd expect 0x02 to not stop hackers from trying to enter as it's being sold, since most attacks (if not all) will come from crawlers looking for eth stakers signatures on the common ports and then automatically trying to bruteforce those boxes regardless of what kind of credentials they have. I doubt they will automate the switch of coinbase since that's box-dependent. And anything that requires manual shell interaction is just as bad for them, so if they took the time to see what the credentials are, chances are that they will go for the higher rewards that are involved in running a flashbot rather than just the tips",
        "created_at": "2021-06-09T11:27:46.354000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Correct. The question is kind of an argument of complexity/convenience. Like \u003c@!221806905243205633\u003e mentioned above, if we make it as easy as possible for NOs to get MEV rewards and fairly distribute, and make it somewhat harder to defect by adding 0x02 (because of the increase in complexity in creating the dark relay and sidechannel payment), is the \"somewhat harder\" an appreciable difference vs making it \"not hard at all\" to do so? I would argue in general yes",
        "created_at": "2021-06-09T11:28:58.867000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "AFAIK, Flashbots' scheme uses `COINBASE` opcode which enforces extracted value to be charged to the coinbase. So, there need to be another MEV scheme that allows to set an arbitrary address not equal to the coinbase",
        "created_at": "2021-06-09T11:31:35.954000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I don’t agree with this. Coinbase address change can be easily automated. Either through: 1. listing processes, find names of relevant ones, check open files, determine which js configuration file, change it. 2. Find list of processes, ptrace them, change coinbase in memory. Coin base is a value with high entropy and easily findable in memory",
        "created_at": "2021-06-09T11:31:54.254000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There’s just a number of limited clients. Attackers do this all the time.",
        "created_at": "2021-06-09T11:32:28.891000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e I’m sure you can script this easily",
        "created_at": "2021-06-09T11:32:52.318000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sure, but it’s much more fragile, and those channels may get detected",
        "created_at": "2021-06-09T11:33:51.239000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Regarding MEV: MEV can be used to harm the attacker",
        "created_at": "2021-06-09T11:34:29.602000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It’s risky, for many reasons: fragility, chances of detection, upfront costs, risk of validator double cross (it’s interesting that Vitaliks proposal for MEV would help attackers)",
        "created_at": "2021-06-09T11:35:48.103000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You can cook a block to send arbitrage earnings to any address. Coinbase will still be getting the transaction fees, but those are minimal in turbulent market times",
        "created_at": "2021-06-09T11:37:09.637000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This MEV pool could be owned by anybody other than attacker. And what would be detected is the address attacker uses to collect value",
        "created_at": "2021-06-09T11:39:57.124000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Right, this is what is meant under MEV scheme that doesn't involve coinbase",
        "created_at": "2021-06-09T11:41:03.135000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Could you expand on this? How would it work? What happens after the validator frontruns the MEV bundles?",
        "created_at": "2021-06-09T11:42:10.005000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "yeah, so my reply to you was that 0x02 will not really be stopping any attacks as most are automated and it's more profitable for the hacker to not even change the coinbase and go for the bigger rewards",
        "created_at": "2021-06-09T11:42:54.718000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If there is an incentive (and we assume it is) to create MEV scheme that doesn't use coinbase then this scheme will appear at some point in time. I was thinking about a scheme with a \"dark\" MEV pool that relays bundles and share fees between its participants anyhow as *one* of potential ways of getting rid of coinbase. \n\nWith any such scheme value extractor provides its address to either searchers or relayers to get the value. This is what hacker will do. And this is what \u003c@!755590043632140352\u003e is also pointing at.\n\nDo you suggest that we can leverage from this situation by attacking this dark relayer even though it belongs to attacker? What about value already extracted by attacker by the time we discover this relayer and striking back?",
        "created_at": "2021-06-09T11:47:49.103000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sorry to ask again, are you asserting that changing coinbase cannot be automated?",
        "created_at": "2021-06-09T11:47:55.047000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I’m suggesting that that a MEV value chain is built on trust. Ultimately you have to trust the proposer. As the proposer can reorder/add/drop transactions. And ultimately you cannot trust the validator. In order for any of this to scale, you have to automate it. The attacker hand configuring compromised machines, upgrading software after a legitimate software upgrades breaks their own software, etc. In order to trust a validator you have to ensure that it was not comprised by another actor, or that someone did not register itself to an attackers C\u0026C server in order to get bundles",
        "created_at": "2021-06-09T11:54:47.840000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "No, I agree with you that it may be, but then installing a flashbot can be as well",
        "created_at": "2021-06-09T11:54:49.502000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And not changing coinbase is better in that case",
        "created_at": "2021-06-09T11:55:30.498000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Are we sure it is?",
        "created_at": "2021-06-09T11:56:07.842000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And again, are attackers willing to risk detection?",
        "created_at": "2021-06-09T11:56:22.478000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I’m assuming that these side channels are chatty / latency sensitive and will show on the radar",
        "created_at": "2021-06-09T11:57:15.553000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And upgrade them",
        "created_at": "2021-06-09T11:57:35.617000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Só upgrades imply more noise. More downloads",
        "created_at": "2021-06-09T11:59:06.755000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I’m not saying that attackers won’t try. But it doesn’t seem to align with how typical botnets work",
        "created_at": "2021-06-09T11:59:58.817000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Botnets are downloading BTC miners and running them on the background, I'd say they will go for the bigger easy profit instead of calling attention generating bad blocks or stealing the proposers rewards",
        "created_at": "2021-06-09T12:01:30.956000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So you’re saying that they would just install geth-MEV and be done with it? Or use this dark MEV network?",
        "created_at": "2021-06-09T12:03:42.631000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Could it be the case where there is an appealing MEV relayer that appears to be an attackers' relayer afterwards? Would it matter that much if it would be discovered after some value had been extracted already?",
        "created_at": "2021-06-09T12:04:17.821000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We don’t know. That are a few unknowns (and costs) in the proposed MEV operation that I’m not sure if attackers would risk it. Maybe they will. But not having a dynamic coinbase seems like a big deterrent to scale this “criminal enterprise”",
        "created_at": "2021-06-09T12:08:42.019000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Just the fact that we are discussing all of this (which I love btw) indicates that things will not be just copy/paste and without  risks for the attacker. Or for an attackers partner",
        "created_at": "2021-06-09T12:09:55.309000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "All the while, these side channels will give blue teams a fighting chance. MEV will force the attacker to expose itself",
        "created_at": "2021-06-09T12:11:16.119000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The status quo has two benefits for the attacker: 1. easy to scale 2. Almost silent operation",
        "created_at": "2021-06-09T12:12:41.309000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And the dynamic coinbase doesn’t even seem to have benefits for stakers. All we can find are negatives",
        "created_at": "2021-06-09T12:14:45.230000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Are you implying that it's noticeable easier to change coinbase than to run a searcher? Is there a benefit for an attacker that has taken a host to change coinbase over running a searcher?",
        "created_at": "2021-06-09T12:21:00.696000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "How come you're comparing complexity of changing coinbase to running a searcher?",
        "created_at": "2021-06-09T12:22:54.753000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "IIRC these are activities on different ends of the whole MEV process (searchers propose bundles, coinbases are set by the bundle executors i.e. block proposers)",
        "created_at": "2021-06-09T12:23:07.632000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "or by searcher do you just mean \"DIY MEV\" basically?",
        "created_at": "2021-06-09T12:23:25.841000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Regarding 1. Can you please detail a bit how would the MEV support network work? What’s its architecture? Regarding 2., Yes. Less resource usage (no additional processes running all the time), no network activity (I.e. side channels)",
        "created_at": "2021-06-09T12:24:54.230000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "the general benefit of just changing a coinbase is that it's very un-invasive as a procedure and it requires none of the extra rigamarole of becoming a trusted bundle executor",
        "created_at": "2021-06-09T12:25:02.796000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "i.e. you take advantage of the fact that the block proposer is already proposed blocks as a part of a trusted group and all you're doing is redirecting the rewards",
        "created_at": "2021-06-09T12:25:32.147000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I’m asking about the architecture because I have the feeling we are talking about different kinds of attackers, with different sophistication levels, funding, etc",
        "created_at": "2021-06-09T12:28:40.791000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "this is a good point. Perhaps we need to lay all of these out in a document somewhere clearly",
        "created_at": "2021-06-09T12:29:06.977000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You do not need side channels nor bundle providers nor any dark network to search for arbitrage and you use the fact that the proposer will be proposing a block anyway. I am assuming that running a simple searcher is comparable to running a BTC miner that have gone undetected forever. This is less detectable than changing coinbase since the proposer does not lose anything. You can get more involved setups where the attacker runs the searcher himself and the modified geth contacts him only when `AssembleBlock` is requested. Which would be essentially undetected",
        "created_at": "2021-06-09T12:29:27.692000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Context /requirements -\u003e attack vector -\u003e possible rewards -\u003e pros/cons",
        "created_at": "2021-06-09T12:29:30.170000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "how would that be undedected?",
        "created_at": "2021-06-09T12:31:12.416000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "we're in a scenario where a nod eoperator is already running something like mev-geth because they're executing MEV-bearing blocks and sharing with the rest of the pool",
        "created_at": "2021-06-09T12:31:39.867000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "From the proposer side there's no change",
        "created_at": "2021-06-09T12:31:41.318000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'm talking about the solo staker that you guys have been claiming that he gets a benefit of security from 0x02",
        "created_at": "2021-06-09T12:32:28.556000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "ok same can apply",
        "created_at": "2021-06-09T12:32:40.990000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We have started to talk about security implications for solo stakers, not only node operators",
        "created_at": "2021-06-09T12:32:44.791000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I can’t answer on the resource usage (or effectiveness) of a local searcher. I was under the impression that it’s not super effective. Regarding the modified geth: this is not necessarily true. The validator may be behind a firewall that whitelists access to a specific beacon client and execution client. This can raise alarms on the network. Again, this gives defenders a chance to detect anomalies. And again: more complexity, more fragility",
        "created_at": "2021-06-09T12:33:16.363000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "ok so in this scenario there's 2 cases right: either the solo staker is already running mev-geth for the chance to produce an MEV-bearing block or they're running plain ol' geth let's say",
        "created_at": "2021-06-09T12:34:00.749000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "in case 1 the attacker would have to replace/overwrite their existing setup, in case two they would have to replace geth with mev-geth",
        "created_at": "2021-06-09T12:34:44.828000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "now the question becomes which bundles the attacker will execute and how",
        "created_at": "2021-06-09T12:35:11.531000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "is the attacker goign to use the local machine to find MEV and execute it or are they going to search for bundles on their own machines (or using pwnd net) and then send them to the targeted machine for execution (in this case it pretty much only makes sense to use a side-channel for pmt), or the \"least evident\" option which would be to run like mev-geth with the payout going to the coinbase and just modifying the coinbase",
        "created_at": "2021-06-09T12:35:53.790000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The original argument was to protect inexperienced solo stakers. If we're starting to talk about users that can make sophisticated setup with firewall and monitor traffic then hacking this kind of users might be infeasible",
        "created_at": "2021-06-09T12:36:48.820000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I agree. What I’m saying is that this increases chances of detection overall. A more experienced company (or solo staker) might detect the attackers operation. This could result in a takedown, and this would benefit everyone",
        "created_at": "2021-06-09T12:39:11.568000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It’s basically about having a chance of detection or not",
        "created_at": "2021-06-09T12:40:06.381000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I can only see the current protocol helping attackers",
        "created_at": "2021-06-09T12:40:31.798000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "In my experience on Discord, missing a block proposal raises an alarm on users. Firewall logs doesn't",
        "created_at": "2021-06-09T12:40:37.278000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And also will be the case of proposing a block and not seeing rewards",
        "created_at": "2021-06-09T12:41:46.455000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We are talking about maybes. Maybe the user will detect missing block rewards, maybe it won’t detect suspicious network activity. Not everyone will be looking at network activity. I’m sure it will be a minority. But If a single entity detects this operation, this will help everyone.",
        "created_at": "2021-06-09T12:44:19.231000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Maybe the user won’t detect a searcher using CPU",
        "created_at": "2021-06-09T12:44:52.064000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Maybe it will",
        "created_at": "2021-06-09T12:45:01.025000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Forcing attackers to go to more complex setups is a win.",
        "created_at": "2021-06-09T12:45:48.457000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Another good thing about the coinbase address being dynamic is that is will also work even the attacker network has been takedown. It will work offline, forever. If the attacker relies on MEV, taking down that part of the network, stops attackers profits",
        "created_at": "2021-06-09T12:49:31.461000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Without 0x02, they can be in jail, and making profits",
        "created_at": "2021-06-09T12:49:44.912000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I see how 0x02 can protect transaction tips earned by staker. I don't see how it can protect extracted MEV that could potentially be earned by staker, neither in the case of break-in nor in the case of node operators misbehaviour. I do agree that it might be more difficult to seize extracted value in case of 0x02 but not impossible. Especially, the possibility is higher if there is non-coinbase MEV scheme in game.",
        "created_at": "2021-06-09T12:50:32.083000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "At the risk of repeating myself, I will say that 0x02  not only helps exposing attackers and making their operations more brittle, but it also protects stakers in case of the MEV network being taken down. This would stop all compromised stakers.",
        "created_at": "2021-06-09T12:56:20.769000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And more, imagine this:",
        "created_at": "2021-06-09T12:56:27.981000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Attacker network is taken down. Attacker bot detects that MEV relayer is gone. What can it do? It can fallback to changing coinbase and steal tips. No chance of stopping this. Running a local searcher might not be desirable if the CPU load / RAM usage results in missed proposals and/missed attestations/OOM errors if running all the time. Moreover, even if running a searcher was viable, wouldn’t this require the attacker to keep an hot wallet locally to create transactions? E.g. for sandwich attacks",
        "created_at": "2021-06-09T12:57:21.975000+00:00",
        "attachments": null
    },
    {
        "author": "lame.eth",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "What im struggling with to understand is, does 0x02 even have to be a huge security upgrade in every aspect? To me the discussion so far seemed pretty fruitful and while i understand 0x02 would not be a heavy weight update it would provide some security benefits that makes it less attractive and more tedious for hackers, while the extend surely is up for debate. The main point was that this small update, as it stands will likely make or break the competitiveness of decentralized pools vs centralized hosting services. I feel like it is currently just accepted that solo operators will be sufficient to outweigh centralized staking services but watching the massive draw of the latter over the last months i have a hard time believing it.",
        "created_at": "2021-06-09T12:57:23.467000+00:00",
        "attachments": null
    },
    {
        "author": "pospam",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Centralized staking has the potential to far outweigh solo staking, decentralized staking can outweigh both",
        "created_at": "2021-06-09T15:26:43.474000+00:00",
        "attachments": null
    }
]