[
    {
        "author": "dmitriishmatko",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "it requires update of the message if there is a fork in the middle, but it's better than nothing",
        "created_at": "2021-01-27T10:19:49.687000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Trouble with this is it basically forces the exit.  So if, for example, there was some sort of bug resulting in exits losing funds then a malicious user could run the transaction and force the exit.\n\nOne option for this could be to have a pre-agreed fork version at which exits will be available (e.g. `0x00100000`), and publish the signed exit for that fork version.  That way, the exit will be invalid until internally everything is ready to go, then we have a HF that 'enables' such transfers.",
        "created_at": "2021-01-27T10:50:49.734000+00:00",
        "attachments": []
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hi Danny, I asked \u003c@!405158743920345128\u003e about this earlier on the Rocket Pool server and here was his response: https://discord.com/channels/405159462932971535/704196071881965589/801246003562676234\n\n\u003e What did you think about his sticking point with it (that you can't make an ETH1 contract tell an ETH2 node to exit validation)?\n\u003e \n\u003e darcius01/19/2021\n\u003e Oh I think that's fine for us, it's ultimately up to the node operator how long they wish to stake for. If they score a high commission 16ETH block from the network, they'll probably want to stake that for a while. So long as the withdrawal ETH ends up on a smart contract, that's all we really need.",
        "created_at": "2021-01-27T14:19:44.262000+00:00",
        "attachments": []
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'll let him know that you're looking for feedback when he gets on later tonight",
        "created_at": "2021-01-27T14:20:26.887000+00:00",
        "attachments": []
    },
    {
        "author": "ghosts_in_the_code",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!332037095482720256\u003e",
        "created_at": "2021-01-27T17:49:47.831000+00:00",
        "attachments": []
    }
]