[
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Note: I haven't thought *at all* about this problem.  Has anyone brought up the idea of withdraws going to an L2 instead of L1?",
        "created_at": "2021-12-07T05:49:04.122000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I guess one could argue that the beacon chain *is* an L2 of sorts in that regard.",
        "created_at": "2021-12-07T05:49:34.448000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I guess what is bumping around in my head is the idea that you would have a payment network L2 (zkRollup of some kind) that sits between L1 and Beacon Chain.",
        "created_at": "2021-12-07T05:50:04.944000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So people can withdraw and deposit into that ETH payment network L2 before moving it over to Beacon or back to L1.  This would allow consolidation and/or distribution to happen on that L2 without clogging up L1, and has potential to allow for utilizing that L2 as a payment network for other things so the ETH can usefully stay within it.",
        "created_at": "2021-12-07T05:51:39.968000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I’d say that core protocol operations like this should stay on eth1 - otherwise the L2 becomes critical to the functioning of the chain and the ability for L2s to compete and innovate is hampered.",
        "created_at": "2021-12-07T05:57:53.421000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This would be a very special purpose L2, not a general purpose L2, so I think that there would still be a ton of room for competition.",
        "created_at": "2021-12-07T06:01:20.840000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'm thinking of something like https://ethresear.ch/t/springrollup-a-zk-rollup-that-allows-a-sender-to-batch-an-unlimited-number-of-transfers-with-only-6-bytes-of-calldata-per-batch/ which essentially allows for ETH transfers only (no contract logic, no ERC20 support, etc.).",
        "created_at": "2021-12-07T06:02:01.618000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Seems like a lot of complexity to add both for the protocol and for users who then almost certainly wouldn’t want their funds on a specialised L2 anyway.",
        "created_at": "2021-12-07T06:03:19.258000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "(not exactly that design, as it depends on a privileged sequencer, but the rest of the concepts I think are reasonable)",
        "created_at": "2021-12-07T06:03:36.434000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It allows for consolidation without going all the way back to L1.  And it *can* be used as a low-cost payment system (e.g., transfers to/from CEXs or physical goods/services merchants).",
        "created_at": "2021-12-07T06:04:27.953000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I guess the key question is how common withdrawals will wind up being. If they’re a significant amount of traffic it may be worth it but hopefully it’s a small amount and there’s no real advantage.",
        "created_at": "2021-12-07T06:04:40.738000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So I think it would be \"useful enough\" that there is value in having it, but not so useful that there isn't room for competition from other rollup solutions.",
        "created_at": "2021-12-07T06:05:00.177000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I feel like profit aggregation is likely to be fairly common?  Maybe I'm overestimating though?",
        "created_at": "2021-12-07T06:05:25.106000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If my math is correct, there are around 40 new validators worth of ETH minted every day.  In the absolutely most pathological case where all 266,427 validators are compounding profits into new validators every day, that is 266,000 withdraws and 40 deposits each day.  Of course, reality is *far* different from that pathological case.  Do we have any guesses on how many individual validating actors there are?",
        "created_at": "2021-12-07T06:08:02.796000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Or perhaps more interestingly, do we have ideas on how big the biggest actors are in terms of number of validators?",
        "created_at": "2021-12-07T06:08:21.451000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If a single actor has ~6700 validators under their control they could compound daily into a new validator.  So that would be 6700 withdraws + 1 deposit per day just for compounding purposes.",
        "created_at": "2021-12-07T06:09:21.861000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think the more important question is how we do withdrawals. If you can only add a withdrawal to the block you create then you have at most one withdrawal per block and it’s an insignificant amount of the transaction space. \nIf you can fit arbitrary withdrawals into a block (ie they’re just some kind of special transaction) then potentially it could start taking up too much space.",
        "created_at": "2021-12-07T06:11:04.125000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Thinking more on this, I think the answer to the question of \"how common withdrawals will wind up being\" is a function of \"how expensive are withdraws and deposits\".  If they are to L1, then they will be very expensive and thus less common than if they are to an L2.",
        "created_at": "2021-12-07T06:11:05.389000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Only withdrawing for blocks you create is rough from a UX standpoint, and I worry may push people even more toward pooling (pooling gives liquidity).",
        "created_at": "2021-12-07T06:12:17.552000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If my math is right, that comes out to a ~50% chance each month that you can withdraw at a *random time during the month* (assuming you only have one validator).  75% chance you'll be able to withdraw once randomly within 2 months, 87.5% within 3 months, etc.",
        "created_at": "2021-12-07T06:13:20.768000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "My suspicion is how frequent they are is largely a function of how accessible they are",
        "created_at": "2021-12-07T07:32:33.716000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The easier you make it to pull rewards out regularly, the more frequent they'll be pulled",
        "created_at": "2021-12-07T07:33:06.208000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I agree with all of these points",
        "created_at": "2021-12-07T07:37:14.238000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "One thought based on this point from #2759: \n\u003e A 0x00 -\u003e 0x01 change-of-credentials operation is required to trigger a withdrawal for existing 0x00 validators (new operation to come in subsequent PR)\n\nIf withdrawals require migrating to `0x01`, then one option could be a \"reverse deposit\" where there's another contract on the EL, like the deposit contract, where you can send \"withdrawal requests\" from whatever address is stored in the `0x01` credentials",
        "created_at": "2021-12-07T07:44:50.461000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Perhaps they could be batched up the same way deposits are after the follow distance has passed, and distributed all at once to prevent congestion",
        "created_at": "2021-12-07T07:52:48.647000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I suggested an \"accounting super-epoch\", where (e.g.) every 1024 epochs *all* Ether over 32 was transferred.  Avoids the overhead of user transactions, avoids the randomness of transfers on a per-proposer basis.\n\nIf that would be too much of a spike, then perhaps every epoch of the super epoch all `validator index%1024 == super epoch offset` could be transferred.  Every validator would know when they would expect their excess funds to be made available, and the beacon node workload would be pretty much constant.",
        "created_at": "2021-12-07T09:00:10.252000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Note that withdrawal consists of two operations: 1) burn ETH on CL side be deducting from CL account and issue a receipt, this is specified in the PR 2) burn receipt on EL side and issue ETH that is added to EL account\n\n(2) should be handled inside of privileged code by utilizing privileged EVM operation and doing basic checks of the receipt. And this should be handled by L1. One of the solutions is to have a privileged contract or a precompile that tracks wasted receipts and issues ETH by sending the corresponding transaction to it. Tx call data may include receipt and a proof linking the receipt to the beacon block/state root, contract/precompile verifies that the receipt is valid and hasn't been wasted and then issues ETH.",
        "created_at": "2021-12-07T11:15:58.166000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I am thinking about the case when say you have 10 validators and wanna batch partial withdrawals to reduce operational costs. Probably this contract/precompile should accept multiple receipts at a time",
        "created_at": "2021-12-07T11:17:35.119000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Would it be possible for receipts to be automatically acted upon/burned as part of the execution layer block transition?  Given the burning of receipts will be deterministic (_i.e._ to an execution address already defined in the receipt) why require a transaction to trigger them?",
        "created_at": "2021-12-07T11:30:08.353000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Transaction allows for additional logic to be triggered. For instance, withdrawn ETH may be issued on the pool account which is a smart contract and then split between pool operator (fee) and user.",
        "created_at": "2021-12-07T13:09:26.564000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "True, but it doesn't have to be triggered individually with every receipt (and will not be required for every receipt as many recipients will be EOAs).\n\nGiven that anyone that is doing this is likely to already require such functionality to be in place for splitting transaction rewards, and as such is going to have a function in their smart contract to divide the balance in some way, it seems like the chain doing the same thing for both tx fees and consensus layer rewards is a simpler and less surprising way to go.",
        "created_at": "2021-12-07T13:14:10.066000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It could be as follows. Burn a receipt + Issue ETH by adding the amount to the account, then user claims own funds from pool's contract. The question is how EL becomes aware about the receipt. Is this gonna be a separate operation in addition to transactions on EL?",
        "created_at": "2021-12-07T13:24:11.289000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We need a transaction for receipt to cross the layers boundary. Introducing another type of operation on EL for this only purpose seems superfluous.",
        "created_at": "2021-12-07T13:30:46.489000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We're passing back some sort of data from the CL to the EL (a root or other rollup of receipts; sounds like it isn't yet finalized) which I assume would end up as part of the execution payload.  If the EL processes them as part of the block transition that would seem to be a least-effort approach; there needs to be code to process the root/rollup regardless, but this wouldn't require any additional logic in the EVM (whereas anything that was triggered by a transaction would).",
        "created_at": "2021-12-07T13:33:15.240000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This is a new operation and it requires additional logic in the EL clients, probably the complexity of implementing privileged/precompile contract is higher than implementing withdrawal operation on EL side. Processing cost of this operation is basically verifying the receipt (the proof linking it to the beacon block/state root and that it hasn't been wasted), updating the bitfield with receipt indexes and accessing account tree in order to increase the balance. But this scheme loses information about what validator has been withdrawn which might be important for rewards distribution to be done in a trustless way.",
        "created_at": "2021-12-07T13:41:59.316000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The original design brief for a `0x01` address was for nothing more than it being capable of receiving Ether.  If there is now a contract call required to claim the Ether then if anyone already deployed a contract it may render their rewards unobtainable.",
        "created_at": "2021-12-07T13:45:26.176000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "(And using tx rewards as a comparator there is already no information about the validator that generates them, so rewards distribution would have to be handled in a different manner.)",
        "created_at": "2021-12-07T13:46:41.930000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You don't have to claim your funds via transaction from your withdrawal address. It could be done from any address, but the issuance will happen only to the withdrawal one",
        "created_at": "2021-12-07T13:46:53.182000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Aren't we back to the same thing, then?  If a \"claim rewards\" transaction is totally deterministic why are we forcing users to generate transactions to do so, rather than just incrementing the (already known) address balances?",
        "created_at": "2021-12-07T13:47:39.481000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "For what it's worth, this is how we designed our 0x01 contracts - they just assume the ETH will show up, and the user will call a function on them to do the splitting and distribution manually when they're ready",
        "created_at": "2021-12-07T13:47:56.359000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "(If we care about provenance then a transaction can look them up after the fact.)",
        "created_at": "2021-12-07T13:48:07.133000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It depends on what data you put into receipt. There could be a validator index in it. And I agree, there are definitely trade offs. Complexity of adding another operation to EL + CL feeding these operations into a block + Potentially additional logic on top of claiming the receipt **vs** Complexity of implementing a contract that issues ETH + claim costs (tx fees) + UX.\n\nDoing this in automatic fashion allows for pruning the receipts tree and use index instead of bitfield on EL side as well. Cause in the contract scheme, the bitfield can't be pruned for sure as claiming is non-deterministic.",
        "created_at": "2021-12-07T13:55:11.687000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "A smart contract that has access to the beacon root can always be given a proof that validator _x_ withdrew to address _y_ at epoch _z_.  So if a smart contract wants to do something clever with some of the Ether it has received it is still capable of doing so, even if it has no knowledge of the receipt at all.\n\n(It may be that the proof is relatively expensive, but I suspect that for the majority of cases: solo stakers will receive funds directly, custodial pools will have control of the withdrawal address, non-custodial pools will have their users control the withdrawal address; it seems that the only question is really for decentralized pools, and from what \u003c@!784446040073175040\u003e says above they already have a splitting smart contract in place so will handle it themselves.)\n\nJust seems that we're creating additional work for no gain by requiring user-initiated transactions to trigger a deterministic process, both for users themselves but also for the EL.",
        "created_at": "2021-12-07T14:01:45.914000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Well, in part that's a reason for my PR, making it cheap to compound without the need to do any withrawal. This should also make it cheaper to do general withrawals or at least not queue",
        "created_at": "2021-12-07T14:10:38.140000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e from what \u003c@!784446040073175040\u003e says above they already have a splitting smart contract in place so will handle it themselves.\n\nYep, as long as the ETH gets put into whatever the validator's `0x01` address is, we can take it from there",
        "created_at": "2021-12-07T14:25:40.514000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'll offer that your super-epoch idea (validators with `0x01` just get their balance above 32 ETH sent automatically to the `0x01` address every 1024 epochs) is obviously awesome from a UX perspective",
        "created_at": "2021-12-07T14:26:40.919000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The Beacon balance is essentially just a buffer for a few days in that case",
        "created_at": "2021-12-07T14:27:07.331000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Off the top of my head, once possible concern if you do this is slashing - it means there's less available to be slashed, though slashing over 32 ETH is pretty hard to do",
        "created_at": "2021-12-07T14:28:49.256000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And also in this situation #2763 helps, you just delegate 9 of your 10 validators and withraw the tenth",
        "created_at": "2021-12-07T14:29:29.913000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If we're slashing over 32 Ether per validator we have bigger things to worry about!",
        "created_at": "2021-12-07T14:30:11.232000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hahaha",
        "created_at": "2021-12-07T14:30:16.612000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Do you have the super-epoch proposal written up anywhere?",
        "created_at": "2021-12-07T14:31:11.413000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I've been out of the loop for a while and I'm just getting back into the swing of things",
        "created_at": "2021-12-07T14:31:25.556000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "No, the withdrawal stuff is still quite nascent.  I'll perhaps make a note in to the withdrawal issue tracker.",
        "created_at": "2021-12-07T14:57:00.937000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Happy to +1 it and help flesh it out",
        "created_at": "2021-12-07T14:58:00.464000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "A quick poll of our community suggests that it's a popular plan",
        "created_at": "2021-12-07T14:59:14.689000+00:00",
        "attachments": null
    }
]