[
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!291925846556540928\u003e couple of questions:\n\n1) I assume that merging this PR into the `dev` branch does not constitute a commitment to 0x01; for that it would need to be merged into master correct?\n\n2) Re: this statement:\n\u003e IMO, 0x01 functionality is very similar to 0x00 functionality (that is, 0x00 key will have to sign a message specifying an eth1 addr for ultimate withdrawal) so the code paths to support this additional credential are minimal\nOnce this PR is merged in, validators should also be able to (safely) deposit to the VRC using 0x01 withdrawal creds straight away (rather than signing a message using BLS key later), correct?",
        "created_at": "2021-02-17T02:41:00.533000+00:00",
        "attachments": null
    },
    {
        "author": "dkdkdkdkdkdk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e After the merge of eth1 into eth2, withdrawals to eth1_withdrawal_address will be normal ETH transfers (with no payload other than the validator's ETH) triggered by a user transaction that will set the gas price and gas limit as well pay fees. \n1. who will sign the transaction?\n2. what happens if the transfer amount is different from the validator's balance?",
        "created_at": "2021-02-17T18:43:47.047000+00:00",
        "attachments": null
    },
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "1. I believe the intent is that any ethereum address can send a tx to the system withdrawal contract for a validator, to cause that validator's balance to be transferred to its designated withdrawal address (thus, whoever sends the initial tx signs it, pays gas, etc). Might need confirmation of that though.\n\n2. It sounds like if that happened it would be the result of a bug in the implementation of the eth1 \u003c\u003e eth2 bridge, or the SWC. I think if we assume that the implementation is ok then the transfer amount should always be correct??",
        "created_at": "2021-02-17T23:17:11.209000+00:00",
        "attachments": null
    }
]