[
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This is reasonable question. Suppose, EL moves to a separate shard, an execution payload will contain the root of a beacon block it's built upon. Which already implies some dependency, even minimal, but it seems unavoidable. And verifying this root implies running a beacon chain node, potentially a light client node. And we might want to avoid dependencies going beyond the light client -- this sounds like a reasonable boundary for how far we want to go with tying two layers.",
        "created_at": "2021-12-11T07:20:03.226000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Could you please point me to the forum where this kind of recovery mechanism has been proposed?",
        "created_at": "2021-12-11T07:24:07.388000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "August:\nhttps://ethresear.ch/t/preparing-withdrawals-for-compromised-validator-or-withdrawal-keys-fao-zilm/10453\n\nMostly just discussions/questions around \"is it possible (to save my funds)?!\":\n\nA somewhat long discussion on this server on the 24th/25th of September\nhttps://discord.com/channels/595666850260713488/748530848470663208/890887578335707146\nhttps://discord.com/channels/595666850260713488/748530848470663208/891170083819372604\n\nIn April over in the Ethstaker discord:\nhttps://discord.com/channels/694822223575384095/749027200837353512/795692435492831252\nand yesterday:\nhttps://discord.com/channels/694822223575384095/694822223575384099/918681969280290827",
        "created_at": "2021-12-11T09:29:38.507000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "(There's probably more instances of people asking/worrying about this, but those are the ones I could find in a few minutes)",
        "created_at": "2021-12-11T09:34:33.651000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Thank you so much for this thorough answer",
        "created_at": "2021-12-11T09:36:18.877000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I like this. The work for people who are worried would be to propose a mechanism that allows them to verify they are legit, maybe by showing control of the deposit wallet. And then the dot txt could be restricting the 00-\u003e01 change to just the eoa of the deposit wallet.\nSomeone who lost control of both deposit wallet and validator mnemonic, I don’t know a reasonable way to prove ownership.",
        "created_at": "2021-12-11T18:11:03.588000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!397389662085185547\u003e Are you in contact with people who are impacted? I am thinking they need to form a group; propose a solid way to prove ownership (anything signed by validator key is sus); fund dev of tools to prove ownership and maintain secured dot txt (dot json more likely :)); fund audit of those tools; fund consensus client integrations. And then do an outreach push to convince node runners to deploy this, including big outfits like coinbase, kraken, lido, rocketpool, Blox, allnodes, etc etc",
        "created_at": "2021-12-11T18:16:37.684000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If it’s two doods with two validators each the required funds may be out of reach; if the impacted group is larger and/or has more funds staked, they may well jump at the chance to secure those funds",
        "created_at": "2021-12-11T18:18:10.862000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e The work for people who are worried would be to propose a mechanism that allows them to verify they are legit, maybe by showing control of the deposit wallet. And then the dot txt could be restricting the 00-\u003e01 change to just the eoa of the deposit wallet.\nHmm, this is sort of the opposite direction of my original thinking. You're saying to set up a website where people can submit \"I own pubkey X, deposit address Y, and this is the tx hash of my deposit\" messages? I'd like to avoid a central website if at all possible, but it's going to be hard to make a single txt/json out of these messages otherwise. And also everyone that runs the file should still check with their EL client that the tx is correct.",
        "created_at": "2021-12-11T18:53:43.851000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I am not in private contact with any no, but you can see from the links I posted they exist. Many I assume are just not sure if they lost sole-ownership, not necessarily that they _know_ they did. So I'm mostly just trying to work out what a possible solution would look like that they could center around. My thinking was a little different to yours though:\n\n1a) There is a period of time where 0x00 -\u003e 0x01 messages are being accepted by CL clients, but before they can be included on-chain and/or\n1b) There is a (low) limit to the number of 0x00 -\u003e 0x01 credential switches in a block.\n2) CL client have to rebroadcast **and store/cache** (important assumption!) these messages for later inclusion.\n3) CL clients have to do _something_ locally when multiple competing message arrive  (even it is just \"pick the last one\" or \"ignore all but the first\")\n4) Have a json map/dict of _all_ pubkey -\u003e deposit addresses, and then the CL client can have an eviction strategy like \"overwrite unless existing messages matches json file\"\n\nThe latter can be generated by a script that everyone can run against their own EL client.",
        "created_at": "2021-12-11T18:55:17.714000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Well the challenge I see is that 1) this needs to be seamless for node operators and 2) it needs to function in such a way that an attacker is at a distinct disadvantage.",
        "created_at": "2021-12-11T18:59:46.315000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "What that looks like exactly is the work that hypothetical group of impacted people would work on / fund.",
        "created_at": "2021-12-11T19:00:14.074000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The biggest challenges I see is that this all has to work _before_ credential changes are accepted on the beacon chain, and that node operators have to be convinced to use the option (because it's opt-in). Especially the latter might deter those affected from trying to tackle the first challenge.",
        "created_at": "2021-12-11T19:03:57.368000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yep",
        "created_at": "2021-12-11T19:30:08.343000+00:00",
        "attachments": null
    }
]