[
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I suspect that there are people who have less than 32 ETH and value the trust minimization offered by rocket pool and will choose it over CEXs, even if block production rewards aren't shared.",
        "created_at": "2021-06-06T03:35:59.852000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It is also possible that CEXs will keep the block production rewards, like we see mining pools doing today in PoW with MEV.",
        "created_at": "2021-06-06T03:36:28.968000+00:00",
        "attachments": null
    },
    {
        "author": "a35u",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "is there any indication what the CEXs will do about MEV? is there any communication with them?",
        "created_at": "2021-06-06T03:57:21.765000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "My guess is extract and pocket.",
        "created_at": "2021-06-06T04:01:00.731000+00:00",
        "attachments": null
    },
    {
        "author": "greg7mdp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It is possible that CEXs will keep the block production rewards, yes. If that happens, being a rocketpool node operator will be very profitable, I think, because you'll be able to run double the amount of validators vs a solo staker and keep all the block rewards. It doesn't seem quite fair to me, but I guess you are right it is not that different from the current state with PoW. I personally would benefit from this. But then there would be little incentive for small eth holders to stake with RP, unless RP took your suggestion and removed the commission altogether, relying on the block rewards to compensate the node operators. \nOn the other hand, if the block rewards were fairly distributed by RP, it would make staking via RP very attractive for small holders, esp. if exchanges do not share the block rewards as you expect (because RP would then provide  significantly better returns). So the eth may flow away from centralized exchanges, towards decentralized nodes operated by RP node operators, reversing the current trend. Seems desirable to me, especially since if RP is not successful, it seem that higher and higher staking centralization is just about guaranteed.",
        "created_at": "2021-06-06T04:02:18.792000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I will note that Dave said removing the commission is not realistic, it is used for other mechanics behind the scenes so it has to stay",
        "created_at": "2021-06-06T04:03:18.405000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I very much think RP should remove the commission.  I think the benefits of being a block producer for twice as many blocks significantly outweigh any commission you may get.",
        "created_at": "2021-06-06T04:03:24.923000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Where can one get details on these other mechanics?",
        "created_at": "2021-06-06T04:03:41.075000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Your best bet is to probably interface with him tomorrow directly",
        "created_at": "2021-06-06T04:04:03.742000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Note: I'm not making an actual proposal with the following, mostly just contemplating/thinking out loud.\n\nProof of Stake gives us a new ability to slash bad actors after-the-fact via social consensus.  I wonder if we, as the Ethereum community, could just go into Proof of Stake with the general understanding/agreement that centralized staking is disallowed and if we (the community) notice a centralized staking pool we will slash it via hard fork?  In theory, not all rules need to be hard coded anymore because of the delay in withdraws.\n\nWe obviously wouldn't be able to stop all centralized staking, but we would be able to limit their growth a bit by forcing them to operate in the shadows and not publicly market their services (thus making them hard to find).",
        "created_at": "2021-06-06T04:04:45.917000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'm personally a proponent of natural selection; if all options have a fair seat at the table, we will hopefully see a migration towards a more decentralized option organically",
        "created_at": "2021-06-06T04:06:50.290000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "That seems very unlikely without incentive mechanisms driving that.",
        "created_at": "2021-06-06T04:07:34.731000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "One such incentive mechanism is punishing people who behave against the interests of the protocol.",
        "created_at": "2021-06-06T04:07:56.407000+00:00",
        "attachments": null
    },
    {
        "author": "dybsy",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This presumes everyone is operating with the same ultimate incentive; however, we would effectively be pitting the ethos of decentralization against personal (and corporate) economic interest. It would be great to believe natural selection would tend toward decentralization, because that's what most of us want, but history and common sense suggest otherwise.",
        "created_at": "2021-06-06T04:08:54.455000+00:00",
        "attachments": null
    },
    {
        "author": "greg7mdp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e  if we (the community) notice a centralized staking pool we will slash it via hard fork?  \nCould we use such a threat to try to prevent some MEV? I'm not sure if it can be proven that transaction manipulations occurred though.",
        "created_at": "2021-06-06T04:09:06.255000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Possibly, but that is a bit more fuzzy and harder to come to social consensus on.",
        "created_at": "2021-06-06T04:09:34.116000+00:00",
        "attachments": null
    },
    {
        "author": "yokem55",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Right now Coinbase is using different addresses for each of their validators. Unless there is a good way to identify which ones are part of a pool and which aren't , a social fork slashing won't work.",
        "created_at": "2021-06-06T04:09:45.065000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "My concern with force-slashing a known centralized pool's validator is it will turn into an endless cat-and-mouse game and won't have the desired effect",
        "created_at": "2021-06-06T04:09:50.189000+00:00",
        "attachments": null
    },
    {
        "author": "avy2515",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "just make sure the rules are crystal clear before slashing anyone",
        "created_at": "2021-06-06T04:10:16.718000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I also don't believe a decentralized option would need an additional incentive over a centralized one to gain appreciable market share if they provide the same benefits to the \u003c32 ETH stakers",
        "created_at": "2021-06-06T04:10:35.832000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yeah, that is certainly possible, maybe even likely.  I brought it up merely as a thought experiment, with a weak hope that maybe it would spark some better idea.",
        "created_at": "2021-06-06T04:10:39.161000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I believe we need CEX. People again and again have demonstrated they don't care about decentralization (look at BSC). And they will stake on their exchange unless the benefits of other methods are significantly higher to justify moving the funds. I believe that if we ban CEX what will happen is we'll see big chunk of that ETH being converted to other coins and staked in the CEX anyway",
        "created_at": "2021-06-06T04:14:50.688000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think this is a realistic view of how it would play out",
        "created_at": "2021-06-06T04:16:51.968000+00:00",
        "attachments": null
    },
    {
        "author": "greg7mdp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Maybe there would be support for accepting the 0x02 proposal, if the RP DAO committed to only match the distribution % of block rewards done by the exchanges. So in effect we keep the system balanced. If the exchanges don't distribute block rewards to small stakers, RP doesn't either. If exchanges provide a higher APR (say 15%) by using the block rewards, RP matches that higher percentage to stay competitive (by using up to 1/2 the amount captured in the coinbase address). That last possibility may discourage solo stakers from switching to being RP node operators.",
        "created_at": "2021-06-06T04:17:49.374000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "To make sure I understand, you're saying that a decentralized option would need some kind of economic advantage to outweigh the simplicity of one-click staking that CEX's provide?",
        "created_at": "2021-06-06T04:18:12.164000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This isn't a general argument (which I try to stick to with respect to 0x02) but in Rocket Pool's case, it does have a website that provides similar one-click staking functionality (provided you know how to use a web3 wallet, which admittedly is its own barrier to entry)",
        "created_at": "2021-06-06T04:20:53.226000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I would suggest that the tokenized staking provides such an economic advantage",
        "created_at": "2021-06-06T04:21:11.667000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Perhaps not, I'm not an expert in that area - I just build stuff",
        "created_at": "2021-06-06T04:21:30.966000+00:00",
        "attachments": null
    },
    {
        "author": "gator__1",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think a lot of mining pools do give out MEV. Here is ethermine announcing it: https://www.coindesk.com/ethermine-adds-front-running-software-to-help-miners-offset-eip-1559-revenue-losses. flexpool: https://www.reddit.com/r/EtherMining/comments/m0wswe/flexpool_celebrating_1000th_block_with_beta_mev/ Sparkpool: https://www.reddit.com/r/EtherMining/comments/mvbv3b/sparkpool_shares_mev_rewards/ Here is random people talking about their MEV rewards: https://www.reddit.com/r/EtherMining/comments/nm294b/mev_income_doubled_since_10_days_ago/ . I think it'd be very unlikely that a big chunk of pools and every person crunching the numbers is lying no? Btw Lido which is a permissioned staking pool is working on pooled MEV for eth2 already: https://github.com/flashbots/raytracing",
        "created_at": "2021-06-06T04:27:25.160000+00:00",
        "attachments": null
    },
    {
        "author": "gator__1",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "sorry for link overload",
        "created_at": "2021-06-06T04:27:44.395000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "That is fine.  Our goal here shouldn't be to pump our bags, but rather to build a secure censorship resistant execution platform.  If we lose some people who have no interest in those things and gain security from it, that is OK with me.",
        "created_at": "2021-06-06T04:28:19.693000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I would prefer a data-first approach personally.  Launch RP with block production benefits going to the operator of the execution client and remove the commission, and see how that works out, what the user feedback is, how participation compares to CEX, etc.",
        "created_at": "2021-06-06T04:29:55.109000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Another option would be to have a *negative* commission to offset the benefits of block production rewards.",
        "created_at": "2021-06-06T04:30:11.653000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think we are evaluating with different degrees the risk of losing ETH on CEX. I think that iF ETH currently on CEX is liquidated that could be a mortal blow to ETH as whole",
        "created_at": "2021-06-06T04:30:13.794000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "How so?  Just because we'll lose some holders?",
        "created_at": "2021-06-06T04:30:54.515000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Because of the loss in liquidity will imply lose of value which will imply lose of developers and the ball continues",
        "created_at": "2021-06-06T04:31:40.638000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "A lot of mining pools say they are giving out MEV rewards, and do give out *some subset* but then \"secretly\" pocket a large portion.",
        "created_at": "2021-06-06T04:31:55.581000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Mining pool operation is not the most honest field from what I have seen.  Some pools are more honest than others, but there is a *lot* of sketchy/scammy stuff that goes on.",
        "created_at": "2021-06-06T04:32:23.147000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "What are centralized non custodial services going to do with block rewards. I mean services like blox?",
        "created_at": "2021-06-06T04:32:49.597000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think most Ethereum developers are more resilient to market fluctuations than that.  This argument is essentially, \"we need to pump our bags for Ethereum to succeed\", which I disagree with pretty strongly.",
        "created_at": "2021-06-06T04:33:10.293000+00:00",
        "attachments": null
    },
    {
        "author": "gator__1",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "well as long as CEXs/centralized staking providers give out a significant enough portion to counteract even -100% commission of RP, we have the same issue. They don't have to give out all MEV",
        "created_at": "2021-06-06T04:33:39.740000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "My understanding is they have to manually track the rewards they earn, which validator they belong to, and send them out accordingly - they have expressed interest in 0x02 forcing the execution client to do this automatically (see https://discord.com/channels/595666850260713488/692062809701482577/847367811096903680)",
        "created_at": "2021-06-06T04:34:00.053000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yes, Alon left comments in the PR was well, that is why I ask",
        "created_at": "2021-06-06T04:35:05.279000+00:00",
        "attachments": null
    },
    {
        "author": "greg7mdp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e  negative commission to offset the benefits of block production rewards.\nI think this assumes that all RP node operators are sophisticated enough to extract as much block production rewards as possible. That is very likely not the case. If a RP node operator was not extracting block rewards, then RP staking (with a negative commission) would be a losing proposition.",
        "created_at": "2021-06-06T04:35:30.323000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Extracting MEV today is not particularly hard, you just run MEV-Geth instead of Geth.",
        "created_at": "2021-06-06T04:36:30.711000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I assume that will be fairly similar under Proof of Stake.",
        "created_at": "2021-06-06T04:36:40.080000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You can certainly do better than that, but just running MEV-Geth gets you a good portion of the way there and you can then tune/maximize from there.",
        "created_at": "2021-06-06T04:37:11.779000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I was under the impression that pools would be more likely to receive bundles than a random solo staker",
        "created_at": "2021-06-06T04:37:22.608000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The goal of Flashbots is to \"democratize\" MEV, which means making it so anyone can run a searcher and anyone can run a custom miner.  There have even been talks about weakly integrating some of this directly into the Ethereum protocal.",
        "created_at": "2021-06-06T04:37:51.802000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If the mev opportunity would be just running geth-mev and the same for solo stakers than pool operators, then I don't see much reason in switching",
        "created_at": "2021-06-06T04:38:16.485000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "For Proof of Work at the moment there are some risks with allowing any miner to participate, but a lot of these risks go away with Proof of Stake, and there are privacy solutions being developed that will fully mitigate them.  I am optimistic that by the time PoS launches, FB will allow any staker to participate.",
        "created_at": "2021-06-06T04:38:50.170000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "In that case the benefit of switching to pools is only the socialization of this reward and avoidance of the time risk. Not the reward itself.",
        "created_at": "2021-06-06T04:41:03.364000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "That makes me happier",
        "created_at": "2021-06-06T04:41:19.248000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The situation is not as bad as I thought",
        "created_at": "2021-06-06T04:41:29.241000+00:00",
        "attachments": null
    },
    {
        "author": "gator__1",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "btw flashbots is also working with RP on MEV client stuff so I don't think ease of access will be an issue either. The big question is will any negative commission (can't go past -100% because we can't access their coinbase obv, only normal staking rewards) be able to offset MEV?",
        "created_at": "2021-06-06T04:42:00.326000+00:00",
        "attachments": null
    },
    {
        "author": "greg7mdp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So what is to stop the exchanges from distributing a small percentage (say 15%) of the block rewards to small stakers, like current POW pools do? This will be enough to make RP unattractive, and push all small stakers towards pooling their ETH in exchanges. Don't we want RP to survive to fight the centralization trend?",
        "created_at": "2021-06-06T04:43:26.738000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "My understanding is Micah's intention is to make *all* pools unattractive, and this scorched-earth slashing approach is certainly the most direct way to do it",
        "created_at": "2021-06-06T04:45:20.856000+00:00",
        "attachments": null
    },
    {
        "author": "veekta",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "yeah i see the idealogical argument to it, and I'm sure Micah doesnt mean that that will definitely be the way to do it, but I can't think of an actual way that doesnt become a perpetual cat and mouse game",
        "created_at": "2021-06-06T04:46:05.883000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I agree",
        "created_at": "2021-06-06T04:46:22.580000+00:00",
        "attachments": null
    },
    {
        "author": "veekta",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "unless we build in sybil resistance",
        "created_at": "2021-06-06T04:46:32.775000+00:00",
        "attachments": null
    },
    {
        "author": "veekta",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "which is its own can of worms",
        "created_at": "2021-06-06T04:46:36.362000+00:00",
        "attachments": null
    },
    {
        "author": "veekta",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "ultimately what rocketpool enables is a tool for solo stakers to try to win back a portion of users who choose to do pool staking and gain back control away from CEX staking",
        "created_at": "2021-06-06T04:48:35.913000+00:00",
        "attachments": null
    },
    {
        "author": "veekta",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "but it is also at the mercy of becoming a cat and mouse game with CEX where they will continually change their rules in order to be the more attractive option",
        "created_at": "2021-06-06T04:49:02.358000+00:00",
        "attachments": null
    },
    {
        "author": "greg7mdp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "But RP is not really a pool, because each node operator is independent and runs his own software locally. Because the RP stack includes the unmodified validators (prysm, lh, ...), RP nodes are equivalent to solo stakers, so conflating RP and centralized operations is not correct imho.",
        "created_at": "2021-06-06T04:49:41.292000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Keep in mind, I am not an important person so just because I propose a thing doesn't mean Ethereum will do it.  🙂",
        "created_at": "2021-06-06T04:51:42.530000+00:00",
        "attachments": null
    },
    {
        "author": "veekta",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "but you make good points which are worth exploring",
        "created_at": "2021-06-06T04:52:52.905000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "My first choice of solution would be a scortched earth one where we somehow figure out a way to burn anyone who does pooled staking of any kind.  This is probably not possible.\n\nMy second choice of solution would be for RP to launch with no or negative commission and block author gets to keep all block production related rewards and see if that is enough to make RP competitive with centralized systems.\n\nMy third choice of solution I'm much less sure of.  It is not obviously clear to me whether 0x02 will be better overall for decentralization or not for the reasons I have outlined previously.",
        "created_at": "2021-06-06T04:53:51.170000+00:00",
        "attachments": null
    },
    {
        "author": "gator__1",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'm confused by this. Let's assume vitalik's recent proposal to make MEV side channel impossible goes through(I think that's what it does) and 0x02 gets passed. How else would CEXs entice anyone with 16 eth+? they could entice people with just lowering fees at \u003c16 eth but RP can go as low as 5% and CEXs still need margin",
        "created_at": "2021-06-06T04:54:10.515000+00:00",
        "attachments": null
    },
    {
        "author": "veekta",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "what margin do you think they would need?",
        "created_at": "2021-06-06T04:54:53.066000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Block producers can siphon basically all block production related rewards if they want, even with 0x02.",
        "created_at": "2021-06-06T04:55:02.169000+00:00",
        "attachments": null
    },
    {
        "author": "veekta",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "id argue due to the scale of their operation they can cut down the margin to razor thin",
        "created_at": "2021-06-06T04:55:04.602000+00:00",
        "attachments": null
    },
    {
        "author": "veekta",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "and still profit substantially",
        "created_at": "2021-06-06T04:55:11.030000+00:00",
        "attachments": null
    },
    {
        "author": "veekta",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "at least when it becomes apparent that they are losing market share to decentralized pools",
        "created_at": "2021-06-06T04:55:29.394000+00:00",
        "attachments": null
    },
    {
        "author": "gator__1",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "but RP could go just as low theoretically. The DAO can lower the floor afaik",
        "created_at": "2021-06-06T04:55:51.101000+00:00",
        "attachments": null
    },
    {
        "author": "gator__1",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "via side channel? isn't this what vitalik's proposal solves or am I misreading",
        "created_at": "2021-06-06T04:56:53.178000+00:00",
        "attachments": null
    },
    {
        "author": "veekta",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "yeah ultimately we'll see how much competition will squeeze the margins.",
        "created_at": "2021-06-06T04:57:38.323000+00:00",
        "attachments": null
    },
    {
        "author": "veekta",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "it would also be really cool if by squeezing the margins it completely disincentivizes CEX from even running their pools (though there are probably other benefits to them for running validators, such as the stakedETH token they can generate more trade volume with)",
        "created_at": "2021-06-06T04:58:56.768000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Thank you for writing this, it does a good job of summarizing things",
        "created_at": "2021-06-06T04:59:28.169000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Vitalik's recent proposals related to MEV stuff protect searchers from malicious block producers, but they don't stop block producers and searchers from colluding against the protocol's interest.",
        "created_at": "2021-06-06T05:01:41.275000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I will relay your 3 choices to the team when they get back from the weekend, and I'll ask Dave to reach out to you to discuss the commission mechanics",
        "created_at": "2021-06-06T05:02:50.047000+00:00",
        "attachments": null
    },
    {
        "author": "gator__1",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\"In addition to this problem, MEV also complicates decentralized pooling, as in a decentralized pool there would still need to be one entity packaging and proposing the block, and they can easily secretly extract MEV without sharding that revenue with the pool itself.\" from recent proposal: https://ethresear.ch/t/proposer-block-builder-separation-friendly-fee-market-designs/9725",
        "created_at": "2021-06-06T05:04:36.726000+00:00",
        "attachments": null
    },
    {
        "author": "gator__1",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think by sharding he meant sharing here lol",
        "created_at": "2021-06-06T05:04:48.732000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I assume that even with 0x02, a block producer can insert flashbot winning transactions to his own accounts. And socialize only on the tx fees while keeping the principal gain",
        "created_at": "2021-06-06T05:05:08.602000+00:00",
        "attachments": null
    },
    {
        "author": "gator__1",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "but doesn't \"secretly extract\" mean they'd be stopped from colluding",
        "created_at": "2021-06-06T05:05:39.069000+00:00",
        "attachments": null
    },
    {
        "author": "gator__1",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "tbh the technical aspects of this go over my head but I'm going off that paragraph",
        "created_at": "2021-06-06T05:05:58.526000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "No, you can still secretly be a searcher and a block producer.",
        "created_at": "2021-06-06T05:05:59.026000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The proposals make it so searchers don't have to trust block producers, but it doesn't prevent block producers from competing with searchers from an advantaged position.",
        "created_at": "2021-06-06T05:06:34.150000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Right now a searcher can send transactions to a block producer and the block producer can just steal them all and pretend it found them itself.",
        "created_at": "2021-06-06T05:07:09.162000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "What is being talked about in that research post is a way to make it so a searcher can send their transactions (in the form of a block) to a block producer without the block producer being able to steal those opportunities.",
        "created_at": "2021-06-06T05:07:53.516000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The block producer can still find the opportunities on their own though.",
        "created_at": "2021-06-06T05:08:07.075000+00:00",
        "attachments": null
    },
    {
        "author": "gator__1",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "interesting. thanks for the info",
        "created_at": "2021-06-06T05:09:47.545000+00:00",
        "attachments": null
    },
    {
        "author": "jasper.the.friendly.ghost",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I believe the hope was to work with flashbots, given 0x02, such that the default setting (which would theoretically be good enough for many) would allow the rewards to be divided by the protocol. Some people would still steal their funds but it'd take an additional effort to do so.",
        "created_at": "2021-06-06T05:10:03.156000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "First option does seem impossible. The second does not attract any capital less than 16ETH regardless on the commissions. Third I didn't get :)",
        "created_at": "2021-06-06T05:11:38.336000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The point is that 0x02 only deals with tips, if the RP operator is running the node and inserts it's own transactions there's absolutely nothing you can do to prevent this",
        "created_at": "2021-06-06T05:12:58.584000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Can anyone tell me how hardware intensive is to run a searcher? Are we talking rpi possible or are rigs with thousands of processors and T1 bandwidth needed?",
        "created_at": "2021-06-06T05:15:58.993000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Depends on how advanced your searcher is.",
        "created_at": "2021-06-06T05:16:33.341000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Pathfinding optimization algorithms are notoriously difficult for computers, and when you have 50,000-100,000 token pairs on various exchanges and you want to look for any arbitrage paths it can become prohibitively expensive.  However, a subset of those can be found relatively easily/quickly with minimal computing power.",
        "created_at": "2021-06-06T05:17:35.587000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "That is to say, if you are a block producer, you can definitely make money by running a searcher on modest hardware.",
        "created_at": "2021-06-06T05:17:58.543000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You won't make quite as much as someone who has invested millions of dollars into research, development, and operations, but you won't do poorly either.",
        "created_at": "2021-06-06T05:18:22.678000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Thanks but the point is then that for a RP operator, he needs to weigh between tips from a bundle coming from such an advanced searcher vs gains of his own search",
        "created_at": "2021-06-06T05:19:34.289000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I would add that this does add some risk though (see Salmonella)",
        "created_at": "2021-06-06T05:19:37.545000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Right.  Often in the current system it is more profitable for a mining pool to take a smaller opportunity that they found than to take a larger opportunity found by a searcher because they get 100% of it in the former, and a small percentage in the latter.",
        "created_at": "2021-06-06T05:20:58.900000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And also, what's the payment model for those advanced searchers cause I would have expected that they'd pay bulk, off chain to CEX, and then send them all their bundles",
        "created_at": "2021-06-06T05:21:02.376000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This is especially true since the mining pool operator gets to pocket the money when they run the searcher, but they have to share with their constituents when a searcher finds the opportunity.",
        "created_at": "2021-06-06T05:21:21.766000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Some pools today appear to have their own searchers, but it is possible that they actually have a partner.",
        "created_at": "2021-06-06T05:22:01.751000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "One of the things I dislike about 0x02 is that it gives a false sense of security to stakers which I think is disingenuous.  We see this today with hashing power who *think* they are getting MEV when in reality their pool is robbing from them fairly significantly.",
        "created_at": "2021-06-06T05:22:53.240000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Without 0x02 and instead just asserting that RP block producers keep block production rewards, it makes it much more clear to end-users the deal they are getting.",
        "created_at": "2021-06-06T05:23:23.212000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I tend to agree with you. It seems to me that 0x02 only deals with a tiny part of the rewards expected by the block proposer",
        "created_at": "2021-06-06T05:23:53.043000+00:00",
        "attachments": null
    },
    {
        "author": "syresis",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Reading through this I believe there has been one overlooked perspective in regards to the concern of overly incentivizing node operators to use decentralized services instead of solo staking:\n\nA potential node operator with 32eth could solo stake and risk losing approximately 16-17eth from slashing before being ejected from the network\n\nAlternatively they could join a decentralized service which in rocketpools case would allow for 2 nodes of 16eth each where they risk losing all 32 of their eth to slashing. They are effectively doubling the risk of slashing which could be due to a client bug, hardware error, etc\n\nOf course that's rocketpools specific implementation and It's important to zoom out beyond rocketpool for the impacts of 0x02-- but I would argue that any decentralized staking service is going to have to put the majority of the burden of slashing risk on the node operators\n\nTo me at least, this along with smart contract risk gives solo staking enough compelling benefits over decentralized pools to not lose too many would-be solo stakers\n\nWith that in mind having 0x02 would assist decentralized services in disrupting centralized pool dominance (which are currently capturing enough non operator eth to have around 30% of eths validators-- even more if we could track pools using multiple addresses), while not overly incentivizing decentralized pools for users with \u003e= 32eth\n\nCentralized pools are an immediate threat to the integrity of consensus and while decentralized services may multiply a node operator's voting power (by 2 in rocketpools case) a centralized pools voting power is multiplied orders of magnitude higher by their users, with no stake of their own even being required",
        "created_at": "2021-06-06T05:28:18.284000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This brings us back to the original conversation during the PR - we know 0x02 isn't going to solve all of the MEV-related problems like custom searching and side channels, but our stance is that something is better than nothing, and we have no problem making these caveats / drawbacks abundantly clear in our documentation... we're going to have to do that regardless of the solution when it comes to MEV",
        "created_at": "2021-06-06T05:42:08.768000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The argument I understand here is that no, something is *not* better than nothing, which we disagree with",
        "created_at": "2021-06-06T05:43:22.414000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I don't personally know what the ratio of priority fees to MEV-related fees will be, I am not smart enough to grasp that, but we are giving every effort to balance the amount of attractiveness and fairness of the \"default\" configuration, such that it is \"good enough\" for most people who simply want a turn-key solution to running a node, which has historically been the bulk of our beta testing audience",
        "created_at": "2021-06-06T05:45:53.791000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The `coinbase` problem was the biggest thorn in our side towards providing that balance",
        "created_at": "2021-06-06T05:46:26.652000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think \u003c@!144468805697929216\u003e's argument from yesterday summarizes my stance - I'd like to make in-band dealings as fair as possible, with the understanding that out-of-band dealings exist; the spirit of the PoS system has always been that the validator key is the only one allowed to divert funds, and this paradigm should be respected as much as possible",
        "created_at": "2021-06-06T05:50:17.131000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Even if 0x02 ends up redistributing like, 5% of the total MEV value, those principals are upheld and we can say that we've made the system as fair as we could given the state of MEV",
        "created_at": "2021-06-06T05:51:19.131000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e it may be possible to do your options 2 and 3 together, that answer will have to wait for the rest of the team to go into more detail on the commission mechanics and I have made the proper notes for them to discuss it when the work week resumes... but in the case that option 2 is viable, I will still encourage 0x02 - it has several benefits beyond fair distribution of priority fees",
        "created_at": "2021-06-06T05:56:56.218000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I *am* interested in 0x02 if it provides *other* benefits.  If you know of some specific ones I would be interested in hearing about them.",
        "created_at": "2021-06-06T06:10:09.865000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I will name a few:\n\n- Removes the execution client as an attack vector (malicious person inserts their own address into `coinbase` unknowingly and steals profits from a legitimate node operator)\n\n- Automates distribution of priority fees to the validator responsible for proposing a block (desired by Blox, perhaps required for an Infura-like service though I can understand if you'd consider this a *downside* since it supports those services, in which case... oops)",
        "created_at": "2021-06-06T06:13:21.412000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The former was proposed by \u003c@!708348711054344334\u003e in the PR I believe",
        "created_at": "2021-06-06T06:13:41.902000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I have to get up in a few hours so it's time for me to head out, but \u003c@!301186049323958275\u003e \u003c@!755590043632140352\u003e once again I want to thank you for the excellent discussion so far (and everyone else participating, I have learned a lot from it today)",
        "created_at": "2021-06-06T06:25:35.388000+00:00",
        "attachments": null
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I have my actions for the team tomorrow, to be continued",
        "created_at": "2021-06-06T06:26:04.599000+00:00",
        "attachments": null
    },
    {
        "author": "knoshua",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Regarding Vitalik's poposal: \"Instead of the block proposer trying to produce a revenue-maximizing block by themselves, they rely on a market where outside actors that we call block-builders produce bundles consisting of complete block contents and a fee for the proposer, and the proposer chooses the bundle with the highest fee. The proposer’s choice is reduced to picking the highest-fee bundle, an algorithm so simple that in a decentralized pool it can even be done inside an MPC to prevent cheating.\"",
        "created_at": "2021-06-06T07:47:20.124000+00:00",
        "attachments": null
    },
    {
        "author": "knoshua",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Isn't he suggesting that the RP protocol would operate in a way were a node would automatically pick the bundle with the highest fee from a market without any way of intervention from an individual node operator? I don't understand how that would be implemented, but that would solve the MEV side channel issue, right?",
        "created_at": "2021-06-06T07:47:41.154000+00:00",
        "attachments": null
    },
    {
        "author": "knoshua",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "https://ethresear.ch/t/proposer-block-builder-separation-friendly-fee-market-designs/9725",
        "created_at": "2021-06-06T07:47:58.736000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "They aren't *forced* to pick a proposer block.  They just cannot *see* a proposer block until after they have committed.",
        "created_at": "2021-06-06T07:48:19.643000+00:00",
        "attachments": null
    },
    {
        "author": "knoshua",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I guess the forcing would have to happen on the Rocket Pool protocol level?",
        "created_at": "2021-06-06T07:48:45.530000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "To put it another way, a block proposer can always create their own block.",
        "created_at": "2021-06-06T07:48:48.526000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I guess I should be more specific.",
        "created_at": "2021-06-06T07:50:09.482000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "In that thread he proposes two solutions.  The second solution is the one I'm arguing doesn't fix these problems.",
        "created_at": "2021-06-06T07:50:29.434000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The first solution arguably does, but it requires pretty significant consensus changes that seem unlnikeley to land by The Merge.",
        "created_at": "2021-06-06T07:50:49.303000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I do like the first idea and generally support it (though it needs a bit more work around the edges, I don't see any big problems with it).",
        "created_at": "2021-06-06T07:52:04.941000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The second idea is one I have been pushing for a while, but it doesn't solve the problem that Rocket Pool is facing.",
        "created_at": "2021-06-06T07:52:27.828000+00:00",
        "attachments": null
    },
    {
        "author": "knoshua",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Ok, I think I see what you are saying now.",
        "created_at": "2021-06-06T07:53:32.100000+00:00",
        "attachments": null
    },
    {
        "author": "knoshua",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So in a world where the first solution is implemented your concerns about 0x02 go away?",
        "created_at": "2021-06-06T07:58:23.860000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Not entirely, since the block producer can simply ignore submitted bundles.  It does help things a bit though.",
        "created_at": "2021-06-06T08:00:26.466000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And I still have concerns over any solution that improves things for non-solo validators.",
        "created_at": "2021-06-06T08:00:44.538000+00:00",
        "attachments": null
    },
    {
        "author": "knoshua",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yes, doesn't change anything as far as the solo vs. pool argument goes.",
        "created_at": "2021-06-06T08:01:56.423000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Actually, the more I think about it the more I think idea 1 won't help at all.  Block producers can simply lie about the headers they receive and claim to only receive the one they want to include.  I think you would need to go a step further and have some mechanism for forcing block producers to use a header that was agreed on by some other system.",
        "created_at": "2021-06-06T08:06:21.802000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Might be possible, but hard.",
        "created_at": "2021-06-06T08:06:37.899000+00:00",
        "attachments": null
    },
    {
        "author": "vgr2774",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@301186049323958275\u003e , what are your thoughts about the other benefit that 0x02 could have? (Removing the execution client as an attack vector) This would be of benefit for solo stakers too.",
        "created_at": "2021-06-06T08:21:44.212000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I am interested in hearing more discussion on this.",
        "created_at": "2021-06-06T09:12:16.998000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hi \u003c@!301186049323958275\u003e. I currently run a solo validator, but I would also like to run a rocketpool validator. I would prefer, even as a solo validator, that `coinbase` address could be fixed to a trusted address. This reduces (eliminates?) the economic incentive for an attacker to compromise my host. I'm sure that validators will be compromised. Either through remote code execution bugs in services, weak credentials (either in the servers themselves or in the administration consoles of cloud providers), and more attack vectors. If there are sufficient economic incentives, I can even imagine cross-VM attacks / escapes on cloud providers. It's just a matter of being worth it or not. Solo staker compromise is even more likely if we consider that many solo stakers are not professionals. Having the ability to make the `coinbase` address \"static\", aligns with the decision to have different keys (validation vs withdrawal) and have clear separation between validation, and reward handling duties. I fear that, by not having the 0x02 proposal accepted, some stakers that were considering going solo may go to centralized services, because it's yet another thing to be worried about. I have been watching the Rocket Pool discord server for a while now, and there's all kinds of operators. Some are tech savvy, others (many) are not. The RP discord members have been great in helping everyone from simple tasks as installing Linux to configuring the beacon client. The less technical groups is usually anxious/nervous that something  bad might happen to their funds/rewards. If I'm not mistaken, one of Ethereum's goals \"democratize\" staking. E.g.: running a node should not require many resources (cpu, disk, network), and should not require a great deal of technological sophistication. I would argue that, on average, the average devops operator from a CEX / centralized pool is more technological proficient than the average solo staker, by virtue of the former being a paid professional.",
        "created_at": "2021-06-06T10:07:57.027000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I believe that we should strive to help solo operators run as safely as they can. This is better achieved at the protocol level, and 0x02 achieves this.",
        "created_at": "2021-06-06T10:08:55.790000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "TL;DR: 0x02 improves security for all stakers (including solo). If not approved, CEX's will have an advantage over solo stakers, by virtue of having more experienced security teams. This may scare potential solo stakers away.",
        "created_at": "2021-06-06T10:11:30.401000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "For the same reason that 0x02 doesn't solve the trust problem fully for Rocket Pool, I similarly think it will not solve this problem in a meaningful way.",
        "created_at": "2021-06-06T10:31:23.873000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If someone gains access to your physical host and is able to propose their own blocks, they can use the block to extract MEV that they direct to themselves.  Such a block may have no miner premiums.",
        "created_at": "2021-06-06T10:32:07.250000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I considered this point.",
        "created_at": "2021-06-06T10:32:37.285000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Let's assume that all block do not haver the miner premiums. So there's only MEV left.",
        "created_at": "2021-06-06T10:34:27.920000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think it's the difference between a passive vs active attack. Like sniffing vs man-in-the-middle. It's all about cost to the attacker.",
        "created_at": "2021-06-06T10:35:30.970000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Not having the coinbase fixed, allows for a very stealthy operation mode. It doesn't require communication (side) channels, managing infra-structure, and all that. The attacker could just silently backddor the execution client / validator, and wait.",
        "created_at": "2021-06-06T10:36:52.640000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It's very asymmetric (in which the attacker has to expend little resources)",
        "created_at": "2021-06-06T10:38:08.899000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The other question is: is there any advantage for the coinbase to not be fixed?",
        "created_at": "2021-06-06T10:39:23.948000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "At this point I'm only thinking as a solo staker. I feel that I'm unnecessarily exposed for no advantage (to me).",
        "created_at": "2021-06-06T10:43:12.220000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Cost/effort of change is probably the primary argument.  My understanding is that the 0x02 thing is being pushed for a pre-merge change.",
        "created_at": "2021-06-06T10:48:06.486000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If this was just an iterative improvement to the protocol to tighten up guarantees a little bit but there was no rush to implement it soon I would be more inclined to just shrug and move on I think.",
        "created_at": "2021-06-06T10:48:32.089000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We do stuff like that all the time with the execution client for example.",
        "created_at": "2021-06-06T10:49:00.213000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Things that improve overall quality of life or improve security in marginal ways.",
        "created_at": "2021-06-06T10:49:16.210000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hmmm, please correct me If i'm wrong, but I believe the idea was that this could be implemented post-merge. The 0x02 proposal just needs to be in the spec, and implement \"sometime\" after the merge.",
        "created_at": "2021-06-06T10:50:18.551000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Indeed, the desire is ideally for it to be pre-merge but a simple promise/addition to the spec for it to be included sometime in the near future (probably one of the first 2 hardforks post-merge) I think is the realistic expectation",
        "created_at": "2021-06-06T10:51:23.563000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "What the RP is asking is just (and this is my understanding - I can't speak for them): \"If the ETH Core devs allow us to use an 0x02 address, we have no rush to see it implemented - we just need a 'promise', so we can launch now and eventually 0x02 is implemented.\"",
        "created_at": "2021-06-06T10:52:16.856000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "But there's no time pressure for the 0x02 implementation",
        "created_at": "2021-06-06T10:52:44.480000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Also honestly the proposed changes (from what I've seen from on the PR) are quite light. Obviously they'd need to be tested well etc, but it's possible we've spent more time collectively discussing this issue than implementing it would take 😄",
        "created_at": "2021-06-06T10:55:12.159000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "FWIW I agree that solo staking should be incentivized at the protocol level and pooling should be somewhat disincentivized (note that rocketpool somewhat achieves this via the logic explained by \u003c@!240984336713646082\u003e above), but that (the latter) ship has sailed.",
        "created_at": "2021-06-06T10:55:58.544000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If you turn around now and try to ban CEX staking and staking pools at the protocol level, setting aside of how technically feasible a robust solution for this would be, it's going to cause a huge ruckus.",
        "created_at": "2021-06-06T10:56:36.480000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And to incentivize solo staking in a way that isn't gameable you need some sybil-proof mechanism, which we don't have",
        "created_at": "2021-06-06T10:56:59.995000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I *doubt* you'll get a promise from the core devs for a future fork, though you probably *can* get something akin to \"considered for inclusion\", meaning the devs don't have any outright problems with the idea and are open to investigating its inclusion in a future hard fork.",
        "created_at": "2021-06-06T11:22:24.338000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Thank you for considering it. I truly feel this change result in a net positive for all stakers. Attackers are very creative, and can leverage asymmetry in scary ways, **especially if money is involved**. Consider supply chain attacks: a client, or a library dependency that a client/system component uses gets backdoored to change the coinbase address, only sometimes. This could result in devastating results. And, apart from the initial compromise of a dev/repository, requires very little resources on the attacker's part. And you know this has happened more times than we're comfortable with, lately 😦 I'm sure you can think or even more scenarios...",
        "created_at": "2021-06-06T11:30:55.522000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The piece of the argument I'm not fully convinced of is that these attackers are sophisticated enough to takeover staking hardware, but not sophisticated enough to leverage it to extract MEV.",
        "created_at": "2021-06-06T11:56:16.356000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It *does* increase the barrier to leveraging this attack vector, but I'm not convinced it is by a significant amount.",
        "created_at": "2021-06-06T11:56:41.112000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "In my view, the attackers do not have to be very sophisticated, unfortunately. Think about SSH botnets exploiting common credentials. Not a sophisticated attack. Think news of an exploit being published, and looking into shodan to find vulnerable hosts, using a public exploit. Not sophisticated. And the tragedy is that solo stakers are likely the ones more affected by this. They're the ones who will more likely use default/bad credentials, they're the ones who will forget to update software components.",
        "created_at": "2021-06-06T12:17:54.564000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And there is also a difference between someone who exploits MEV, and is operating in a gray area (like selfish Rocketpool node operators exploiting full MEV for themselves). The actions of such actors are dishonest, but they're not criminal. Then there are criminals, that can also extract MEV. But it's a different group, and they will have very different risk profiles. The criminals will want to expose themselves as little as possible, and will prefer stealthy/smaller operations.",
        "created_at": "2021-06-06T12:21:21.895000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'm sure that it's not news to anyone that servers are being exploited, and being used to mine cryptocurrency. Attackers will go for easy targets.",
        "created_at": "2021-06-06T12:29:53.825000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The vast majority of compromises are not really that sophisticated.",
        "created_at": "2021-06-06T12:33:24.756000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I find this to be a fairly compelling argument.",
        "created_at": "2021-06-06T12:33:37.457000+00:00",
        "attachments": null
    }
]