[
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!144468805697929216\u003e  \u003c@!340345049063882753\u003e  \u003c@!755590043632140352\u003e Hi all, I was trying to follow the discussion \u003c@!876973674564030504\u003e initiated and found it very fascinating (and sad too). \nSince the withdrawal feature isn't available anyway, why not release a sanity/clean-up update after the merge (or even before) and before the final withdrawal feature. This clean-up could allow a VoluntaryExitTo that can *only be triggered* from the Eth1 address that initially deposited the funds. Once the final feature ships, we could remove this constraint. IMHO this is a fair solution, since the VoluntaryExitTo feature is something different then the withdrawal feature and nobody has to \"wait\" for anything. Wouldn't this be kind of a fair \"grace period\"? What's missing here?",
        "created_at": "2021-09-16T19:33:52.673000+00:00",
        "attachments": null
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "VoluntaryExit would still be without constrains, so everyone who fears slashing or wants to leave the network for other reasons, can still do it. Since VoluntaryExitTo only makes sense when withdrawal is enabled, it would be a good \"shipping pair\".",
        "created_at": "2021-09-16T19:35:36.356000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Allowing the ETH1 address to control the movement of funds means that the withdrawal address can be overridden.  As this was never stated,  it opens up various issues such as if the private key for the ETH1 address has been made public (due to it apparently having no value), if the address was in fact a contract, and similar.  This results in an reduction in security for those that followed the rules (i.e. secured their withdrawal keys properly), which doesn't seem like a good way to go.",
        "created_at": "2021-09-16T19:57:44.113000+00:00",
        "attachments": null
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "thanks, but how is this different from VoluntaryExitTo, and the fact that very early adopters had to rely on BLS withdrawal credentials only. Didn't they also follow the \"rule\"? I have the feeling that I'm confusing something here....",
        "created_at": "2021-09-16T20:09:41.263000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Everyone was told to look after their BLS keys, and that the address from which the deposit was made was not relevant.",
        "created_at": "2021-09-16T20:10:40.930000+00:00",
        "attachments": null
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Got it. The only thing I don't understand is why having both seeds for the eth1 address and the validator would reduce security for those who followed the rule? I was thinking about a transaction coming from the eth1 address signed with the keys of the validator. This would proof to be the owner of both seeds. Isn't that more secure? If you lost both seeds/keys you're lost anyway. If just the keys of your eth1 address are compromised, you can still withdraw.",
        "created_at": "2021-09-16T20:24:21.556000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Neither the validator nor the ETH1 sender address have access to the funds individually, so should not have access to the funds in combination.\n\nAnd, again, the ETH1 sender address has no relationship to the withdrawal credentials so use of one has no bearing on proof of ownership of the other.",
        "created_at": "2021-09-16T20:28:43.102000+00:00",
        "attachments": null
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "thanks a lot! That explains it very well. I just wonder if telling people that the eth1 address might be important when withdrawal comes would have left us with more options...",
        "created_at": "2021-09-16T20:44:11.903000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "more options maybe, also more vulnerabilities",
        "created_at": "2021-09-16T20:50:09.326000+00:00",
        "attachments": null
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Guess I'm not the only one who had such thoughts: https://github.com/ethereum/consensus-specs/issues/1543#issuecomment-725591556\nMight be helpful to update the issue with all the points.  I guess this is the first place where people will look for answers when they realize their keys got compromised.",
        "created_at": "2021-09-16T20:59:43.569000+00:00",
        "attachments": null
    }
]