[
    {
        "author": "mheuer",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think **any** withdrawal method would be greatly appreciated. For some stakers in some legislations, the possibility to withdraw is extremely important because the accrued dry-income from 2021 can ruin them if they would have to tax it in 2022 before withdrawals are available. I know two stakers that are really worried because of this because they didn't estimate the ETH price increasing that much. Sure, its everybodies own risk but this aspect should also be considered.",
        "created_at": "2021-05-03T08:45:11.438000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I certainly agree that it's something that needs to happen sooner rather than later.  That said, the merge is a pre-requisite before this can be made available.\n\nPersonally I'd like to see a separate team working on the \"merge+1\" hard fork functionality, including withdrawals, but there is very much a limit to the number of people around who could work on it and there is already work on sustaining engineering for the deployed code, near-term work on Altair and London, and of course the merge.  As such I don't see it happening until at least 3rd quarter this year, and that will be dependent on how well the merge work goes through the summer.\n\nThe alternative is to find the ability to change ownership of validators.  Something I'd love to spend a bit more time thinking about, and it would still require a beacon chain hard fork, but could be something that could be built far more easily than a full withdrawal functionality.\n\nNo-one is thinking that the ability to withdraw isn't important, and I do expect there to be increasing pressure as time goes on as more and more people need to free up the Ether they locked in validating for one reason or another.",
        "created_at": "2021-05-03T12:06:45.828000+00:00",
        "attachments": []
    }
]