[
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Guys, I sent a 14 page paper to Ethereum bug bounty as that was what you advised me \u003c@!340345049063882753\u003e  but the reply I just got was \"Thank you for your submission. However, this is not within the scope of the bounty-rules at https://bounty.ethereum.org/.\" I was not after a bounty as I mentioned on twitter!\n\nWhat do you want me to do with the paper, I want to help the network not cause it problems and thought the paper was better off being kept confidential at some kind of security level until you guys have discussed it and decided what you want to do with the info.",
        "created_at": "2021-10-11T10:03:53.614000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "My *personal* philosophy is that once you have tried responsible disclosure via bug bounty program, and the bug bounty program doesn't say \"we were already aware of the issue and are working on a solution\" or \"thank you for the report, we will investigate further and get back to you\" then you have kept up your end of the responsible disclosure side and it is appropriate to post publicly (e.g., ethmagicians).",
        "created_at": "2021-10-11T10:12:58.092000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'm not sure everyone here agrees, but that is what I would do.",
        "created_at": "2021-10-11T10:13:08.992000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If you wanted you could do one reply to the email letting them know you'll be going public with the report in a week.",
        "created_at": "2021-10-11T10:13:32.684000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I don't want to go public because I have taken legal advice from on of the UK's best legal chambers, plus I have my own personal details in the paper and I am pretty sure you guys would prefer it was kept private, maybe they dont want to have anything to do with whats in the paper? I will wait to see what other Devs say, thanks for your advice  though \u003c@!301186049323958275\u003e it is greatly appreciated! The paper explains clearly my intentions are to help protect the network! Its my priority, do any of you guys get access to the bug bounty disclosures, I emailed saying who to send it to, not yet had a reply, also sent a tweet to \u003c@!340345049063882753\u003e  \u003c@!552133098075193354\u003e \u003c@!273808422753796097\u003e and @blockgeekdima however it has only been 3 hours \u0026 not had a reply yet, I will continue to wait to see what you guys think, I dont have a clue who's reading the bug bounty emails, I only emailed it their because I thought it was more secure than public disclosure 🙏",
        "created_at": "2021-10-11T12:10:37.135000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "btw I did also send it to security@ethereum.org",
        "created_at": "2021-10-11T12:25:52.102000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Generally, possible attack vectors and the like are just posted on ethresear.ch no?",
        "created_at": "2021-10-11T16:01:22.981000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "( https://ethresear.ch/t/a-balancing-attack-on-gasper-the-current-candidate-for-eth2s-beacon-chain/8079 , https://ethresear.ch/t/attacking-gasper-without-adversarial-network-delay/10187 , https://ethresear.ch/t/cheons-attack-and-its-effect-on-the-security-of-big-trusted-setups/6692 , https://ethresear.ch/t/fictional-rollup-attack/8549 , https://ethresear.ch/t/nearly-zero-cost-attack-scenario-on-optimistic-rollup/6336 , to name a few )",
        "created_at": "2021-10-11T16:05:32.914000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If it is something exploitable it is good practice to responsibly disclose first.",
        "created_at": "2021-10-11T16:36:01.044000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "its could be exploitable and may have been already, but sadly there are some legal issues intertwined and thats why I would rather discuss it with high level devs privately, someone has received the paper, if they want me to post it publicly they should say so, maybe they dont want to respond because of the legal implications, all I want to do is protect the network, and the paper explained that, maybe they think I am chatting shit, maybe I am, but my Barrister said he was pretty sure he knew the law, all I want to do is find a solution, I dont know, maybe I sent it to the wrong place, why did they send me such a one liner to a 14 page paper backed up by one of the UK's leading Tax \u0026 Financial chambers. The chambers I used advise the British government, they know the law. All I want to do is help, but I understand it could be perceived another way, I have a priority to protect the network as I am a validator, I realise the guys have been busy with the merge tests so lets wait and see if anyone can respond who read the paper, they have my email?",
        "created_at": "2021-10-11T17:39:33.198000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I've said before but I'll reiterate here, I am not the right person to report security vulnerabilities in Ethereum to. For security vulnerabilities in Teku the process is described at https://github.com/ConsenSys/teku/blob/master/SECURITY.md (I get those reports but so do some actual security researchers who work with us who can much better work through all the details).  For Ethereum-wide things it tends to quickly get into crypto-economics which requires quite specialised skills to evaluate well and that's not my forte.\nsecurity@ethereum.org is a good place to report it. I'd give that a couple of weeks and if you don't hear back post publicly. I would be surprised if British lawyers were well equipped to reason about crypto-economic security and British law doesn't affect the security of Ethereum (it may have implications for people using Ethereum if they're under British law but that's not the same thing).",
        "created_at": "2021-10-11T21:08:47.780000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Adrian I did and they said \"Thank you for your submission. However, this is not within the scope of the bounty-rules at https://bounty.ethereum.org/.\" but the point is the reply was sent to me via the email security@ethereum.org I then asked who to send it to and they didnt reply, you would have to read my paper to understand what my Barrister has said, he's not talking about code, he's talking about legalities, do you want me to email you the paper?",
        "created_at": "2021-10-11T21:44:26.395000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I am not after a bounty, I am after solutions to the problems that seem to be getting uncovered as we discuss more here, there has been some things said which, well, best bet is you read my paper, who read it and decided it was not worth forwarding or at the least giving me a contact to go to? I am trying to help, otherwise I would just post it publicly, but I dont think that will help EF, and as you know we're talking about security in a public domain, its not secure?",
        "created_at": "2021-10-11T21:46:57.651000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "DM me your email, if you wish, its a word document, PLEASE understand its intended to help not cause problems, I went to my barrister because some things here were said that I needed to confirm",
        "created_at": "2021-10-11T21:48:45.715000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'm pretty sure this is off topic sadly",
        "created_at": "2021-10-11T21:53:07.344000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!876973674564030504\u003e This is off topic for this channel. The reply sent by the bounty program says clearly that it is not within the scope of the bug bounty program. That means that it did not meet their requirements of it being a security threat to L1 Ethereum. Thus it is up to you to decide what to do with your report",
        "created_at": "2021-10-11T21:53:22.712000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "its not \u003c@755590043632140352\u003e I promise you",
        "created_at": "2021-10-11T21:53:42.863000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I am lost for words, the bug bounty sent it back because they didn't like what they read, and sadly you wont either, because its an uncomfortable truth, but I am honestly trying to help and it is concerning withdrawals and stolen keys, and contracts, how is that off topic? You know I am invested into POS why would I want to do anything other than protect YOU and the network?",
        "created_at": "2021-10-11T22:01:25.160000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!876973674564030504\u003e Again, this is off-topic. Please either disclose your report in an appropriate forum or not, but we will not continue to discuss a not-yet-public report here",
        "created_at": "2021-10-11T22:02:22.787000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "please can some one DM me then you make up your mind, I will not disclose this publicly, its not good",
        "created_at": "2021-10-11T22:03:17.246000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I am guessing Adrian is the man to send it to?",
        "created_at": "2021-10-11T22:03:45.291000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You can send it to whomever you think appropriate, but we are now finished tlaking about it here",
        "created_at": "2021-10-11T22:04:13.646000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I will delete any further messages as it is off topic",
        "created_at": "2021-10-11T22:04:23.469000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Ok Adrian I will DM you sorry",
        "created_at": "2021-10-11T22:04:45.288000+00:00",
        "attachments": []
    }
]