[
    {
        "author": "jakepospischil",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "My understanding (correct me if I'm wrong) is that the existing BLS withdrawal credentials also can't be used to initiate validator exits; this can only be done by the validator pubkey (https://github.com/ethereum/eth2.0-specs/blob/dev/specs/phase0/beacon-chain.md#voluntary-exits). So eth1 withdrawal creds would be no different in this regard, right?\n\nEither way, this should not be an issue for Rocket Pool specifically. To elaborate on \u003c@!405158743920345128\u003e' comment above, user stakes in RP are tokenized as rETH, which has a dynamic exchange rate for ETH based on total network value (this is reported by oracle nodes and includes eth2 validator balances). rETH can be burned for ETH at the current exchange rate, subject to liquidity.\n\nNode operators (who hold the validator pubkeys) are disincentivised from holding validator balances hostage as they are bonded by fronting half of the deposit themselves. If they do so anyway, then they can limit ETH liquidity within RP. However, since user stakes are tokenized, users can easily exit their position on the open market at a marginal discount if this happens. The possibility of *some* illiquidity is basically implied as part of the risk for RP stakers, and is something we're comfortable with.\n\nI can't speak for other staking pools, but I imagine the pattern of tokenizing stakes is/will be fairly common and it seems like this is not a big issue for anyone doing so.",
        "created_at": "2021-01-28T02:02:16.706000+00:00",
        "attachments": null
    },
    {
        "author": "xer0dps",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Jakepospischil is a Rocketpool Dev 🙂",
        "created_at": "2021-01-28T04:44:26.011000+00:00",
        "attachments": null
    },
    {
        "author": "dmitriishmatko",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "there is an epoch in signed message. It could be used only on specific epoch",
        "created_at": "2021-01-28T09:31:10.913000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "On *or after* the specific epoch for exits, no?",
        "created_at": "2021-01-28T09:32:52.643000+00:00",
        "attachments": null
    },
    {
        "author": "dmitriishmatko",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!144468805697929216\u003e Yeah\n\u003e     # Exits must specify an epoch when they become valid; they are not valid before then\n\u003e     assert get_current_epoch(state) \u003e= voluntary_exit.epoch\nI assume if you publish it, you want to exit on this epoch, publishing protects shared stakers from the case when validator operator is not exiting at agreed time.",
        "created_at": "2021-01-28T14:11:34.661000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "is there any restriction on this? like how far into the future you can do it?",
        "created_at": "2021-01-28T14:30:18.600000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "or if you claim one exit, can you make a second claim to prepone it",
        "created_at": "2021-01-28T14:30:47.917000+00:00",
        "attachments": null
    },
    {
        "author": "dmitriishmatko",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "you cannot exit 2 times",
        "created_at": "2021-01-28T15:01:23.278000+00:00",
        "attachments": null
    },
    {
        "author": "dmitriishmatko",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "you are required to have exit_epoch == FAR_FUTURE_EPOCH (endlessness)  of validator to process exit request",
        "created_at": "2021-01-28T15:02:38.665000+00:00",
        "attachments": null
    }
]