[
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So as a client dev, it's not that I don't care - these kinds of stories are heartbreaking for me to hear. The problem is that a lot of the suggested solutions ultimately wind up requiring me to take responsibility for deciding who really owns the funds and we are just not qualified for that. The only thing we have to verify anyone is signatures proving they hold the public keys.  Once they're compromised we just don't have a point of trust we can rely on.\n\nPlus we really don't want to take on the risk exposure that we'd get it wrong at some point and cause someone to lose funds.  Then we'd likely be liable for it or at least be targeted by expensive lawsuits.",
        "created_at": "2021-09-02T00:09:23.550000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!340345049063882753\u003e Hi, thanks kindly for your input I am grateful. With my second proposal, would it not put that risk on to the validator operators hands, I am guessing my host could identify us as we use payments to keep the nodes running, some use credit cards, I use paypal, the point is this should enable the host to identify us. I understand 100% your concern, as I say, I use a non custodial host so they should be able to identify us using our payment details, damn I would fly to California to identify myself if I had to 😄",
        "created_at": "2021-09-02T00:13:27.028000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "How do we know to trust the validator operator or your host? I'd have to look more into the specifics of the details but using anything apart from the private keys to verify identity means establishing a new point of trust and is likely to be problematic.\nI could potentially see some options to recover from compromising one key by signing a request with both signing and withdrawal key which wouldn't introduce new trust, but recovering from both keys being compromised is unlikely to have a viable solution.  And the double signing still requires a lot of work to design and build out which means delaying progress on Ethereum for everyone else so it's a big ask.",
        "created_at": "2021-09-02T00:16:58.854000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "My understanding is the validator key has not been compromised, is it ok I send you a one word dm with my host name so you know who I am dealing with?",
        "created_at": "2021-09-02T00:18:14.911000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!340345049063882753\u003e \"And the double signing still requires a lot of work to design and build out which means delaying progress on Ethereum for everyone else so it's a big ask.\"\n\nYes that is understandably complicated, as I say I would personally be willing to pay, but I understand I cannot speak for everyone, I do not know how many validators my host understands to have compromised withdrawal keys, I could ask, sadly these public chat rooms are not great for sensitive discussions, I have no issue identifying myself in a secure manner, I would go as far to have my solicitor do it if it helped. Thanks for everyones time this evening I am grateful for your time.",
        "created_at": "2021-09-02T00:21:00.727000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think there's zero chance that you'll be able to secure your funds before the moment the fork happens. I think it'd be useful to you to accept this fact and position yourself in the situation that you're on a race against whomever has your keys. The race is won by whomever manages to get a withdrawal message included in a block first. As such your best options are trying to convince as many as possible to broadcast your message in highly peered clusters right before the fork",
        "created_at": "2021-09-02T00:26:50.974000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The point I'm trying to make is that client devs completely want to avoid any kind of special case. It just opens up so many problems for us and we're software developers not lawyers etc and have absolutely no training in how to reliably do secure KYC from scratch etc.\nI'm not against a general solution but it has to weigh up against the other priorities as well unfortunately.",
        "created_at": "2021-09-02T00:29:30.557000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!340345049063882753\u003e could I send you a dm via twitter to let you know my host? I dont know how many of us are compromised but from speaking to the CEO of my host i got the feeling there was quite a few, I know it was the CEO as he emailed me and I initiated the call by ringing their headquarters. I would  happily get my but to Consensys to identify myself with passport and everything that was needed. Again thanks for everyones time this evening, as i said from the start sorry for letting everyone down 😦",
        "created_at": "2021-09-02T00:35:27.038000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Honestly it's not about verifying who you are, it's about never setting up a system where it's up to me to do that verification. I actually believe you, I also believe there are at least a reasonable number of people in the same situation and there will be more in the future.  It's just that I'm not the person who can help here. It's not up to me and I'm not qualified or insured to deal with it.\n\nI really feel your pain, and the pain of people who have eth1 keys compromised and lose money that way, it's awful. But I'm a software developer, I'm pretty clever but I'm not qualified to design and verify a system to help deal with that.",
        "created_at": "2021-09-02T00:44:28.901000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I understand what you are saying \u003c@!340345049063882753\u003e. As this is a decentralised network, who would I need to talk to? Would it help if the CEO of my host spoke to some one like Joseph Lubin, I believe the host I use is one of your biggest partners!",
        "created_at": "2021-09-02T00:49:08.633000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Thanks again for your time, I know you are all extremely busy and your time is very precious 🙏",
        "created_at": "2021-09-02T00:50:28.174000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "No I don't think individuals are going to help here.  Having a proposal for how to recover from one of the two keys being compromised written up and advocating for it makes sense.  It will be hard to get much attention for it right now because the focus is Altair and then the merge but I suspect it would definitely be worth considering as part of planning work for enabling withdrawals.  In the mean time ensuring it is written up as clearly as possible and vetted by experts would help its cause.  It needs to avoid any form of KYC or centralised trust though or it just won't stand a chance.  Signing a change of withdrawal credentials with both keys may make sense but I'm not sure what problems that could cause for setups like rocket pool etc which deliberately separate ownership of the two keys.",
        "created_at": "2021-09-02T00:54:12.331000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "That is a little comforting, at least there is a chance, would this proposal need to go back on ethresear.ch I will talk to my host and then see if I can find a Dev to help me, as you can probably tell I am far too much a newbie to do that myself, but I understand you clearly, thanks so much, I am pulling at straws, but I am determined, and if it can help others which I am sure it can, then it will be more than worth it. I pray I can convince Ethereum Devs and The Foundation.",
        "created_at": "2021-09-02T01:02:26.664000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There are other staking pools that actually invert the roles of the keys and use your validating public key as your withdrawal credentials.",
        "created_at": "2021-09-02T01:02:55.709000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Holy shit \u003c@!755590043632140352\u003e wow, if that is possible you might have just saved my ass BIG TIME, I would owe you for many years if that is the case.",
        "created_at": "2021-09-02T01:05:12.235000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You cannot change this after you've deposited",
        "created_at": "2021-09-02T01:05:39.905000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There are some pools that invert the roles so that the user keeps the \"withdrawal keys\" in the json that the deposit-cli gives them as validating keys",
        "created_at": "2021-09-02T01:06:51+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sorry, to clarify when you say \"after youve deposited\" does that mean its no help to me?",
        "created_at": "2021-09-02T01:07:30.752000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It's no help to you, and moreover I think there's little to no chance that a change in the weight of withdrawal credentials will be accepted in the protocol",
        "created_at": "2021-09-02T01:08:51.726000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I truly think you should be focusing your efforts in broadcasting fast the withdrawal message",
        "created_at": "2021-09-02T01:09:22.342000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "ok, pretty tough I have to admit 😦 I hope those damned scammers are not in here, probably are though 😦 Thanks to everyone for your time this evening, I will go away and see if I can come up with anything, feeling pretty glum, damn, nevertheless I am grateful for everyones time this evening 3.11am here in France. Thanks again everyone",
        "created_at": "2021-09-02T01:12:46.039000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Interesting.  The withdrawal private key isn't written out anywhere by the deposit CLI, as far as I'm aware.",
        "created_at": "2021-09-02T08:09:03.971000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "A general comment on this: the hardest bit, I think, will be designing something that either doesn't disallow other proposals, or be overridden by them.  For example, there is a proposal to allow changing of withdrawal credentials that, at current, is triggered by the holder of the withdrawal key.  If that key has been compromised there is nothing to stop the attacker from changing the credentials to something they desire, and the original owner being locked out.  But that brings added security for users that have not been compromised, so the question becomes one of balancing costs and losses.",
        "created_at": "2021-09-02T08:16:38.841000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yeah so what they do is they generate an independent set of keys and use that as validating keys, so the ones that a normal user gets from the deposit cli is used as withdrawal credentials and this way a user does not need to trust them with the withdrawal keys.",
        "created_at": "2021-09-02T09:35:36.025000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sounds a bit convoluted to me (unless the idea is to obtain some sort of public key from the seed, but if the user is giving the pool their deposit data then they are also handing over their encrypted private key so their security is reduced to the strength of their password)",
        "created_at": "2021-09-02T09:44:00.451000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I hope you dont mind me popping back to this discussion, I am grateful you are continuing to consider the issue \n\n\u003c@144468805697929216\u003e does your solution #1543 not resolve the issue? as you said last night it is the same proposal as what I made the other day to Zilm with less steps, if you have already had your withdrawal key breached, you would have nothing to lose by trusting the host, personally I trust my host 100% to help me in this situation, while they do not use KYC, they can identify me and I guess most of their clients by signup email addresses, and monthly payment details and ongoing support tickets etc.\n\nI understand that I am not qualified to have a strong opinion, but your solution makes sense to me, as stated earlier my host is very concerned about allowing key rotation because they know that it will be game over for anyone hoping to try and get their funds out as advised by Potuz, it puts the power in the hands of the bad actor.\n\nIf your proposal was implemented, surely it is a good thing for validators, either self hosting or using a host, either way it gives a second chance, and protects those who may not have lost their key, but gives them more security.\n\nIf any of you watched this years WEF Cyber Polygon, one of the points they made is that all IT systems should take a view that their systems have already been breached, so in effect your proposal takes this into account and gives users an extra layer of security if they so choose. I highly recommend watching Cyber Polygon if you have not already. Over \u0026 Out.",
        "created_at": "2021-09-02T09:58:54.316000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So what they ask is only the validator public key, I don't remember if they ask to get the full json. But yeah you get the idea, it's about getting a public key from the user, without needing to get any private key, and then they generate the validating key. It's a neat business model cause it has some level of trust (they can slash you or not exit and hold your funds) but they can't divert your withdrawal and on top you're not allowed to move somewhere else",
        "created_at": "2021-09-02T09:59:50.043000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The question is how the interactions take place.  If a user has already changed their withdrawal credentials using a different transaction, then the exit and transfer operation would not be allowed to override it.  So any attacker would just change the withdrawal credentials at the first opportunity to something they control exclusively.\n\nThe fundamental issue is that the original design was based on the idea that the holder of the withdrawal private key should have sole and ultimate control of their funds, and anything that changes that would have significant impacts on proposed functionality as well as a change that could be seen as hostile to users who have not had their private key exposed.",
        "created_at": "2021-09-02T10:05:15.762000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "but if the host could not use your proposal #1543 without it being signed by the withdrawal key, the host would not be able to use VoluntaryExitTo \n\nAt this stage I have nothing more to lose and everything to gain by working with my host. My host has 4257 ETH validator nodes, and they host and stake for most other crypto assets, in total they have a combined value of $1,892,482,909 with 18531 nodes, I am sure they do not want to risk their business reputation with any shady business, their priority is to protect their customers, they were very concerned with my case, which was kind of them, I was pretty shocked to get a phone call from the CEO",
        "created_at": "2021-09-02T10:12:48.968000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "No, but they would be able to ask you for a payment to release sign a VoluntaryExitTo that would be valid.",
        "created_at": "2021-09-02T10:14:23.867000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "i would pay a lot to save this node, imagine what the value could be by time of withdrawals",
        "created_at": "2021-09-02T10:15:10.196000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Whatever it is worth you could be blackmailed for a significant portion of it.\n\nI'm not trying to be awkward or dismissive of the problem, but any system that allows the withdrawal key holder _plus_ the validator key holder to have more power than the withdrawal key holder itself has to be considered in the situations where either or both of the key holders are malicious (or just self-interested).",
        "created_at": "2021-09-02T10:20:06.098000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And as I mentioned above there are entire pools where users do not have access to the validating key and were correctly set up under the assumption that the withdrawal key had complete control. Any change in this regard will undermine those users/pool operators",
        "created_at": "2021-09-02T10:23:33.957000+00:00",
        "attachments": []
    },
    {
        "author": "svq",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "As a validator node, I think it is important that we can choose a withdrawal address as soon as possible. I trust more in the seed of my ledger wallet (it has never been online) than in the seed of my node that it was.\n\nThe new nodes can choose a withdrawal address when creating the node, but the old ones have to continue using the old mechanism. At least I hope we are given that opportunity to choose our withdrawal address when the merge occurs and not have to wait until withdrawals are enabled.",
        "created_at": "2021-09-02T12:02:53.848000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "this somewhat assumes that old nodes had their seed online which is not necessarily the case. My seed has never been online and it won't be even when I sign the message to change address.",
        "created_at": "2021-09-02T13:47:30.392000+00:00",
        "attachments": []
    }
]