[
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sorry, just getting to this - we draw the line at 16 ETH for node operators, because we don't want to encourage a situation where you can have over 100% leverage to attack the network",
        "created_at": "2021-06-05T04:11:52.538000+00:00",
        "attachments": []
    },
    {
        "author": "vgr2774",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If we look at the actual data regarding validators (Solo, CEX related, Others) we can already see that CEX related validator market share is high. There are lots of people who can't afford to run a solo validator or don't want to go through the effort to run a node but still want to stake their ETH. Like it or not, these people look at the options available and will mostly put financial incentives before the health of the network. Assuming that RP launches as-is, CEX'es would only have to share a fraction of the MEV/coinbase rewards to have a serious advantage over decentralized pools. 0x02 partially solves this problem because at least there's a fair distribution of the coinbase rewards to all actors in the pool. Wouldn't we rather have these people consider joining a decentralized pool as a node operator or as a regular staker where we have 1 human per validator instead of 1 company for all validators?",
        "created_at": "2021-06-05T08:31:29.645000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There are some serious tax considerations here.  Swapping one asset (ETH) for another (staked ETH) is considered a disposal in many jurisdictions.  Lots of people have ignored this, in a \"they kind-of look the same if you turn your head sideways and squint\" manner, but it's going to cause some major problems when the tax authorities come calling.\n\n(This isn't a problem for everyone, but _e.g._ long-term holders will not want to expose themselves to this.)",
        "created_at": "2021-06-05T08:35:54.590000+00:00",
        "attachments": []
    },
    {
        "author": "zwit",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "capital efficiency dictates that this locked ETH will be - and is -  tokenized by pools to allow defi plays, this is a greater threat than decentralized exchanges like RP diverting people from solo staking, as it will generate more yield",
        "created_at": "2021-06-05T14:57:32.569000+00:00",
        "attachments": []
    },
    {
        "author": "paniczone",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There are strategies which may enable a large ETH holder to gain exposure to tokenised eth but still avoid that taxable event. They will begin to emerge as the market matures imo, most notably it will be possible to use a platform such as aave to borrow staked ETH using ETH as collateral. One could borrow most of the value of their regular ETH collateral as staked ETH, paying a small premium to those who are willing/able to take the regular taxable route to obtain their staked ETH",
        "created_at": "2021-06-05T16:34:42.883000+00:00",
        "attachments": []
    },
    {
        "author": "paniczone",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "FWIW I think the cost of this strategy may be very low as eventually a defi lending platform will tokenise the staked ETH deposits similar to how aave has tokens for interest bearing ETH that can be traded",
        "created_at": "2021-06-05T16:55:02.259000+00:00",
        "attachments": []
    },
    {
        "author": "vgr2774",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think we need to focus our arguments around 2 topics; \n\n- why decentralized pools are of benefit to the network without harming decentralisation.\n\n- the security risk/attack vector that exists by allowing the coinbase to be set by an address that is not related to the address related to the withdrawal address of the validator.",
        "created_at": "2021-06-05T18:19:55.534000+00:00",
        "attachments": []
    },
    {
        "author": "peter.davies",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'm not convinced that converting ETH to rETH (or whatever form of staked ETH) is likely to be a taxable disposal. Generally tax law is only concerned with beneficial ownership and I can't see how that counts as a change in beneficial ownership. I go from owning 1 ETH to owning 1 ETH, just through a more circuitous route.",
        "created_at": "2021-06-05T19:12:12.737000+00:00",
        "attachments": []
    },
    {
        "author": "greg7mdp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Not really. I have over 32 ETH but I'd rather run two rocketpool nodes than a solo node. I believe that the 32 eth that complement my 32 eth will most likely come from people who would stake on CEX otherwise, so really in that case me running two rocketpool nodes instead of a single solo one just takes 32 ETH from CEX staking, and does make the network safer.",
        "created_at": "2021-06-05T20:08:32.018000+00:00",
        "attachments": []
    },
    {
        "author": "greg7mdp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Except that if the RP node operators pocket all the coinbase, and CEXs share some of it with their stakers, it will be more attractive for small holders to stake with CEXs, thereby killing RP staking (as the RP node operators won't get the 16 eth needed to complete their node).\nFor the system to remain in balance, RP staking has to be at least slightly more attractive than staking on CEXs for small holders, because it is less easy. Without 0x02, RP is at the mercy of the first CEX who decides to share some of the coinbase revenue in order to kill RP, and this would remove the only possibility for small holders to stake in a decentralized way.",
        "created_at": "2021-06-05T20:33:17.484000+00:00",
        "attachments": []
    },
    {
        "author": "tedsteen",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I plan to run a RP node and I don't intend to pocket all the coinbase.",
        "created_at": "2021-06-05T21:02:03.993000+00:00",
        "attachments": []
    },
    {
        "author": "greg7mdp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Neither do I. I'll be happy to get my share (maybe 50% + 5-20% of the other 50%). Would seem a fair reward for the node operator.",
        "created_at": "2021-06-05T21:10:21.264000+00:00",
        "attachments": []
    },
    {
        "author": "gator__1",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I don't think we should assume NOs are irrational (go against their economic incentives) tho",
        "created_at": "2021-06-05T21:13:52.811000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I agree on the second point: having the coinbase on the execution client makes it a target unnecessarily.  \nI disagree on the first point: any advantage to any form of pool over solo stakers harms decentralization. Perhaps you can sell it as the less of two evils. But true decentralization lies with users running nodes, and if there's incentive to have the few users that are technically apt to run nodes and economically solvent to do so, to move to pools (decentralized or not) then we're doing something wrong",
        "created_at": "2021-06-05T21:16:18.721000+00:00",
        "attachments": []
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Regarding the first point, it's fair to say that the current PoS architecture does not support the participation of people with less than 32 ETH, and until it does so, this will remain a problem",
        "created_at": "2021-06-05T21:19:31.078000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "That's fair, those users will look for pools regardless. The problem is having incentives for myself to run 64 ETH  on a pool instead of two nodes",
        "created_at": "2021-06-05T21:21:20.918000+00:00",
        "attachments": []
    },
    {
        "author": "greg7mdp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e if there's incentive to have the few users that are technically apt to run nodes and economically solvent to do so, to move to pools (decentralized or not) then we're doing something wrong\nYou are missing half of the equation I think. We are not talking just about moving solo stakers to a decentralized pool. \nWe are talking about moving solo stakers + equivalent ETH amount of CEX stakers to decentralized staking.",
        "created_at": "2021-06-05T21:21:51.626000+00:00",
        "attachments": []
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "But that's what I mean, and what \u003c@286614389061058561\u003e made apparent - those people with less than 32 will stake one way or another, and that cannot be ignored",
        "created_at": "2021-06-05T21:22:16.544000+00:00",
        "attachments": []
    },
    {
        "author": "veekta",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There's also the fact that rocketpool decentralized pools are more like a collection of solo stakers who now have 100% more leverage rather than a pool controlled by rocketpool only",
        "created_at": "2021-06-05T21:22:56.129000+00:00",
        "attachments": []
    },
    {
        "author": "veekta",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The lesser of two evils argument is pretty strong imo when the alternative favors cex so heavily",
        "created_at": "2021-06-05T21:23:43.939000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This diverts from my reply: \u003c@357606845965139975\u003e  statement literally said that decentralized pools do not harm decentralization to which I answer they do: incentivizing those that may stake solo to move to pools (any kind)! Harms decentralization",
        "created_at": "2021-06-05T21:25:27.335000+00:00",
        "attachments": []
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I agree with you, and I agree with the lesser of two evils assessment",
        "created_at": "2021-06-05T21:26:08.741000+00:00",
        "attachments": []
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I am simply offering that until the protocol itself supports first-class staking with an arbitrary amount, one of those evils will exist",
        "created_at": "2021-06-05T21:27:11.203000+00:00",
        "attachments": []
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I do not know of a solution that removes them both",
        "created_at": "2021-06-05T21:27:38.086000+00:00",
        "attachments": []
    },
    {
        "author": "greg7mdp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e  incentivizing those that may stake solo to move to pools (any kind)! Harms decentralization\nnot if they prevent an equivalent amount of ETH from staking on cex.",
        "created_at": "2021-06-05T21:30:16.088000+00:00",
        "attachments": []
    },
    {
        "author": "veekta",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "it'll be interesting to think of how ultimately rocketpool may be \"copied\" in the future with different parameters.. giving pool stakers the ability to increase leverage with other economic incentives (maybe higher % return for the tagalongs) such that we end up with a sliding scale of pool stakers with varying degrees of power over a pure 32 eth solo staker",
        "created_at": "2021-06-05T21:31:34.101000+00:00",
        "attachments": []
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This is the lesser evil argument IMO, which implies that the ideal situation is one in which the people with less than 32 ETH simply do not stake",
        "created_at": "2021-06-05T21:31:47.456000+00:00",
        "attachments": []
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I don't know why that picture was there, I blame android haha",
        "created_at": "2021-06-05T21:32:39.293000+00:00",
        "attachments": []
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sorry",
        "created_at": "2021-06-05T21:32:40.954000+00:00",
        "attachments": []
    },
    {
        "author": "greg7mdp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e the ideal situation is one in which the people with less than 32 ETH simply do not stake\nClearly some people with less that 32 eth *do* stake",
        "created_at": "2021-06-05T21:34:08.656000+00:00",
        "attachments": []
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yes",
        "created_at": "2021-06-05T21:35:01.697000+00:00",
        "attachments": []
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "That brings us to the situation today",
        "created_at": "2021-06-05T21:35:13.741000+00:00",
        "attachments": []
    },
    {
        "author": "greg7mdp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So reasoning as if these don't matter makes little sense, especially if we are bothered by CEXs grabbing the lion share of staking and centralizing the consensus mechanism",
        "created_at": "2021-06-05T21:36:28.437000+00:00",
        "attachments": []
    },
    {
        "author": "vgr2774",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "In a world where some people don't have 32 eth and still want to help run nodes without actually running nodes \u0026 people who want to run nodes but don't have 32 eth I would say that these kind of people (\u0026 by extension ethereum) are better off if a decentralized pool option exists, definitely if we see that these people currently go to centralized options.",
        "created_at": "2021-06-05T21:42:37.440000+00:00",
        "attachments": []
    },
    {
        "author": "greg7mdp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The way I see it, currently a few large exchanges have a very large share of staking. Solo node operators are not keeping up with the growth in exchange staking.\nThe only chance we have to prevent CEXs controlling the Ethereum consensus mechanism if if small holders have a decentralized alternative to CEXs. Currently all that ETH is flowing to exchanges.\nAs far as I know rocketpool is the only such solution. \nSo it seems very important - possibly critical - that the ethereum protocol allows such decentralized staking solution to exist and flourish.",
        "created_at": "2021-06-05T21:43:25.821000+00:00",
        "attachments": []
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yes but even if it weren't, a different solution would still be negatively impacted by not having 0x02",
        "created_at": "2021-06-05T21:44:40.168000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I am not opposing to 0x02 per se. If you scroll back in the server you'll find that I suggested this essentially a while ago:\nhttps://discord.com/channels/595666850260713488/692062809701482577/847417670466011156\nHowever I tend to agree with \u003c@301186049323958275\u003e's concerns about dissincentivising solo stakers",
        "created_at": "2021-06-05T21:47:12.558000+00:00",
        "attachments": []
    },
    {
        "author": "veekta",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "i guess it's just the issue that we currently face regarding the state CEX validators",
        "created_at": "2021-06-05T21:48:23.433000+00:00",
        "attachments": []
    },
    {
        "author": "gator__1",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I agree with potuz in regards that any pool will take over solo stakers but I don't personally see a future where solo stakers can have as much power as centeralized entities unless you somehow ban centeralized entities even if RP doesn't launch",
        "created_at": "2021-06-05T21:48:52.248000+00:00",
        "attachments": []
    },
    {
        "author": "greg7mdp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Without affirming that 0x02 is absolutely required, I wonder if all can agree that the CEXs having a larger and larger share of staking is a problem, and that we should strive to encourage and enable any solution which allows small stakers (just a couple eth or less) to stake on nodes not controlled by a large, centralized entity.",
        "created_at": "2021-06-05T21:48:58.301000+00:00",
        "attachments": []
    },
    {
        "author": "veekta",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "minor semantics, but more like we are trying to disincentivize CEX stakers as much as possible",
        "created_at": "2021-06-05T21:50:53.525000+00:00",
        "attachments": []
    },
    {
        "author": "jcrtp",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This is my opinion as well, damage to solo staking is not desirable but may be unavoidable",
        "created_at": "2021-06-05T21:50:58.052000+00:00",
        "attachments": []
    },
    {
        "author": "veekta",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "this still requires the economics of rocketpool or other decentralized pools to be more attractive to \u003c32 eth stakers than CEX staking",
        "created_at": "2021-06-05T21:51:23.848000+00:00",
        "attachments": []
    },
    {
        "author": "gator__1",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Btw keep in mind as Langers stated above, the current trend is for CEXs/centeralized entities gaining market share over solo stakers so this is not a hypothetical situation. It's happening already",
        "created_at": "2021-06-05T21:53:22.350000+00:00",
        "attachments": []
    },
    {
        "author": "jasper.the.friendly.ghost",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The world in which there are only solo stakers or centralized pools is a losing one for solo stakers, *even without MEV.* Clearly economies of scale support centralized pools if MEV is allowed. However, as others suggest, economies of scale with liquid staking will create opportunities for centralized pools to offer higher returns per ETH. I contend that in these universes, solo staking falls to pools. We can think of the pool stakers (\u003c32 ETH) as just capital looking to go somewhere. This capital has no option for staking except for DeFi (providing limited ETH security) or CEX staking (undesirable security).  This capital going to CEXs is bad for solo stakers as it increases the power of liquid staking further.",
        "created_at": "2021-06-05T21:53:33.071000+00:00",
        "attachments": []
    },
    {
        "author": "vgr2774",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And that can't be the case if we can't share the coinbase rewards with every actor on the decentralized pool. Because if CEX solutions have this option \u0026 offer better rewards (e.g. sharing part of the extracted MEV) then decentralized pools won't stand a chance.",
        "created_at": "2021-06-05T21:53:55.883000+00:00",
        "attachments": []
    },
    {
        "author": "vgr2774",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If people have to choose between having X(X)% less rewards but helping decentralise the network or having more rewards and go with a CEX option, you can be sure that most of them will be choosing the CEX option. I can't see CEX staking going away any time soon. So if there's a chance to level the playing field for the decentralized option, I think less people would choose the CEX option. This is only valid if the attack vector for the decentralized pool is limited. For Rocketpool, it's 16 eth to run a node but that's still a large investment for a lot people and every validator is actually run by a human being. While every eth staked on CEX alternatives is an eth more that 1 company/entity can potentially use to attack the network. I agree it's the lesser of 2 evils but imo it's still decentralized. Every validator on RocketPool is up because someone put in the effort to make it up \u0026 running, maintain it, guarantee uptime and put in a sizable amount of capital.",
        "created_at": "2021-06-05T22:08:45.744000+00:00",
        "attachments": []
    },
    {
        "author": "paniczone",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think \"moving to pools\" may be an inadvertently misleading phrase, in proof of work pools are all centralised by nature with only one entity in the middle observing the blockchain and posting blocks, thats not how a \ndecentralised pool works under proof of stake at all. An individual with 64 ETH instead deciding to run 4 rocketpool nodes isn't \"moving to a pool\", the pool is moving to him and his political power over the network is increased with ETH that otherwise would have gone to the centralised pool which can be more thought of as a traditional pool",
        "created_at": "2021-06-05T22:44:26.914000+00:00",
        "attachments": []
    },
    {
        "author": "paniczone",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "While decentralised staking may multiply the political power of individual centralised staking pools who decide to use it, it does not multiply the political power of centralised staking as a whole, as most decentralised staking depositors would deposited to a centralised solution otherwise. \nOn the other hand, decentralised staking does multiply the political power of individual stakers as a whole, as they are able to spin up more nodes with the ETH that would have been on a centralised pool otherwise\nThis is what \"moving to a pool\" means in this case and I think it should be encouraged",
        "created_at": "2021-06-05T22:59:12.071000+00:00",
        "attachments": []
    }
]