[
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Dear ETH Devs,\n\nI must confess that I have let you all down, I let myself down and my brilliant non custodial host down, sadly I got caught up in an elaborate hoax and let one of my two nodes withdrawal key and wallet key get compromised, yes it has made me feel sick to my stomach, I would never have let it happen, but I had previously sent a business proposal/letter to my host, but before they replied I had broken my phone and was locked out of the control panel due to no 2FA, I had asked the admin to contact me via Telegram and was then promptly contacted by the Admin via a Telegram phone call, I swear it was the admin, I checked his status and name and it was exactly the same, but it was not him 😦 I was refusing to disclose info but the bad actor was pressurising me and I was worried I was about to fall out with the admin and was confused and I let my guard down. Sadly the rest is history.\u2028\u2028\n\nLuckily withdrawals are not yet possible and so since then I have been trying to find a solution to my mess, I spoke to the CEO of the non custodial host, they were brilliant and said they will do everything to stop the withdrawal, I spoke to Vitaliks dad Dmitry, Tim Beiko and just the last couple of days Zilm, who I must thank for inviting me to this Discord group.",
        "created_at": "2021-09-01T23:21:34.839000+00:00",
        "attachments": null
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "My first proposal was https://ethresear.ch/t/preparing-withdrawals-for-compromised-validator-or-withdrawal-keys-fao-zilm/10453 and Zilm informed me it was not workable, but as I am pretty desperate I did not give up, thankfully Zilm said my second proposal had legs but could be complicated.\n\nTo be clear, I am willing to invest $ into this proposal and I imagine there are many more like me, if we could get 100 people to stick in 10k each we could raise $1m towards this proposal, it would be worth it, not just for me and others like me, but it would be useful for those who are yet to find themselves in a similar situation, while it is true what I did was stupid, it makes sense to protect the network and so I hope you will help me find a solution to this problem of “compromised withdrawal keys”.\u2028\u2028\n\nI am not trying to pull on your heart strings, I just want to be honest, I lost both my parents a few years back and used my inheritance money to invest into two validator nodes, €1900 per ETH, I was a BTC maxi but when I learned about Ethereum and then heard about POS I flipped all my BTC on May the 19th and went heavy into ETH to become a validator, I have not regretted a moment of this ride until the day I stupidly got conned.\u2028\u2028\n\nThe second proposal I made to Zilm was this:\u2028\u2028Could we make an optional switch, for those who need it, which could be enabled and would only allow withdrawals to be made server side? I trust my host 100% and if it was possible to block an external withdrawal, when we get to phase 1.5 my host could do one of two things for me, rotate the key to a new one, or withdraw, send me the ETH and I setup new nodes with new keys.",
        "created_at": "2021-09-01T23:22:14.392000+00:00",
        "attachments": null
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I am in this for the long haul, I do not wish to withdraw, while I only have two nodes it makes me incredibly proud that I can support the development of ETH POS and help secure the network, I would be eternally grateful if you could help me secure my nodes.\n\nThe switch could be optional, but could save quite a few of us some serious money, please help all those who are in a similar situation to me, I know my host would be very happy for this optional switch they are one of the largest non custodial hosts and they have already expressed their thoughts to me on allowing keys to be rotated, they think it would get a lot of people indefinitely locked out of their validators.\u2028\u2028Sorry for the long post, such a long post would be more suitable in a forum but Zilm said this was the place to discuss this, thanks kindly for reading and thanks for all the amazing work you are doing. I am praying you can help me.\u2028\n\nTIA\n\n\u2028Tobes",
        "created_at": "2021-09-01T23:22:22.094000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There was a (now quite old) issue regarding something similar to this at https://github.com/ethereum/consensus-specs/issues/1543  I haven't thought through if it is something that would work with the current state of the spec, but I think it would be possible to have an enhanced VoluntaryExit message that also set the withdrawal address and was signed by both parties.",
        "created_at": "2021-09-01T23:30:25.928000+00:00",
        "attachments": null
    },
    {
        "author": "alby80",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sorry for your loss. But your proposal does seem a little centralized, when you start talking about KYC to withdraw. This is a very isolated case, and I would say most people kept their seed phrase very safe after clicking the multiple disclaimers when signing. The only thing I thought that would have been good, is that you could have had to sign a message from the eth 1 depositing address as well as have the withdrawl keys. But since none of this was announced before people signed up, so it would be unfair to change it now",
        "created_at": "2021-09-01T23:33:56.035000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I have often wandered about the abstract underlying problem: I myself support human intervention and good sense, there are some handles in this server in which I trust, regardless if they are some form of AI or a group of scammers writing as one person or not , there's something human in me that makes me trust them. I think there are legitimate situations in which we, as a group of human beings, can act irrationally. In this particular case such an act would be to hardcode the withdrawal keys change on clients (by the way, you may have more chances appealing to team devs directly \u003c@876973674564030504\u003e) . I wish there was a way of formalizing this feeling into a protocol rule, but unfortunately there isn't one",
        "created_at": "2021-09-01T23:38:08.631000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The problem with any sort of special case is that it opens the door for all of the others, including the fake ones, the accidental ones, the careless ones... it quickly becomes a very complicated area to attempt to address, and not one which developers are, in general, qualified to handle.",
        "created_at": "2021-09-01T23:44:09.184000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I understand this obviously, still, there is a feeling that something should be done",
        "created_at": "2021-09-01T23:45:14.449000+00:00",
        "attachments": null
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!144468805697929216\u003e Thanks, the topic you posted is similar to my first proposal, I would be elated if ETH devs could make this possible, I do worry that some Devs look at my issue as a bit \"tough luck\" but I think they would feel differently if they were in my position.\n\nJust to be clear, my second proposal was to allow a switch to block external withdrawals, if this was possible I could pass my Keys to my host, they would then withdraw and send me my ETH so I could fire up two new nodes, this second proposal would no interfere with any validators, in fact they would not even need to know it was possible, however, should anyone have their keys stolen, this switch could be anlabled and may save a lot of people a lot of money. I believe in ETH POS and hence I am hoping you can understand how bad it makes me feel to be in this position, if there is a way, please help me and others in this situation.\n\n\u003c@!712394671959048244\u003e sadly my wallet key was also compromised hence I would need to withdraw to a new wallet 😦\n\n\u003c@!755590043632140352\u003e it sounds like my case is not isolated, but maybe they are less determined than me to find a solution, please dont give up on us, me personally I have put all I own into this project, thanks for reconsidering.",
        "created_at": "2021-09-01T23:46:15.067000+00:00",
        "attachments": null
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "and sadly, yes I have learned the hard way, trust no one in these public chat rooms 😦 hindsight is a bitch but if only I never used the Telegram group uurgghh",
        "created_at": "2021-09-01T23:47:57.180000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "By the way \u003c@876973674564030504\u003e if I'm in your shoes here's a list of things that can help you:\n1) contact client devs to let you know in advance of their release so that you can sign and distribute the message to change address as much as you can. \n2) try to get them to hardcode yours (you most probably will fail)\n3) contact pools to try to hardcode in their clients this message, you only need it to appear in a block, if you are willing to pay, perhaps a pool operator is willing to take your message first. \nWrite your own script (I can do that for you in time) and spam the network before the hard fork with the message.",
        "created_at": "2021-09-01T23:49:35.456000+00:00",
        "attachments": null
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!755590043632140352\u003e Thanks kindly for your post and advice, I cannot divulge to much here but I am working on some options, obviously if it were possible to influence a proposal that mitigates my other hopeful options, it would firstly stop me from suffering from anxiety up to phase 1.5, but could save many if not hundreds of other validators.\n\nIs my second proposal not doable? it would not interfere with any previous contract agreements, if it was possible, in my opinion it would add an extra layer of security and could be helpful for many validators now and in the future, I know my host wold welcome this, as previously stated they voiced concern to me with Key rotation, while they did not specify a number, it was clear they know of many people in my situation, thank god withdrawals are not yet possible.",
        "created_at": "2021-09-01T23:57:23.631000+00:00",
        "attachments": null
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "BTW, when I mentioned KYC I understand that does not make everyone feel comfortable, the point is my host can identify me personally as I have used the same Paypal details since I launched the node so they could 100% identify me this way!",
        "created_at": "2021-09-01T23:59:40.166000+00:00",
        "attachments": null
    }
]