[
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "One issue with this could be that a sole validator can try to fill the caches with contradicting messages and Dos the challenge system",
        "created_at": "2021-12-12T00:54:05.596000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "But I do support an effort towards human, non rational intervention in case of lost keys",
        "created_at": "2021-12-12T00:55:12.109000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Could you elaborate further? How would this open up a DoS vector that isn't already there?",
        "created_at": "2021-12-12T09:40:12.596000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "By sending several valid and different changes. Clients would have to keep them all under this system. \n\u003e That isn't already there\nI don't know, since there's no system in place nor proposed for this.",
        "created_at": "2021-12-12T10:26:38.451000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Why would clients have to keep all of them? I might be missing something, but there is only ever a requirement to store _one_ no? It's just that the eviction/rebroadcasting policy is different. Only rebroadcast if it's a credential change message for a validator:\n1) that is not yet in your storage _or_\n2) already in your storage, but the message is different from the one you stored and its credentials match those of the json/txt file \n\nIn case 1 you add it to your storage of course, and in 2 you overwrite the entry in the storage with the new one.",
        "created_at": "2021-12-12T10:41:02.255000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Ah I missed the objective of your scheme. Yeah if you only allow for withrawing to the deposit address this works. The issue though is that at least two of the biggest depositors that have been adamant for losing keys for ~100 validators, deposited from an exchange. This may not be an uncommon scenario",
        "created_at": "2021-12-12T10:44:20.962000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This scheme is definitely not for those that lost their mnemonics, just for those that lost sole-ownership of them. And then of course assuming they used a different mnemonic for the deposit address, otherwise it's rather pointless anyway. So yeah, only to resolve a potential dispute when two entities are in possession of the validator and withdrawal keys, but only _one_ can prove ownership of the deposit address.",
        "created_at": "2021-12-12T10:47:39.633000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Those two large stakers I mention above didn't lose their keys but where hacked and are in the situation you describe. The problem is that they do not have access to the depositing address as it came from an exchange",
        "created_at": "2021-12-12T11:02:23.309000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Well, I'd say it's hard to verify that claim for anyone but the exchange itself. So in that case the best bet might be to force a transfer back to the exchange address with the above scheme (if implemented of course), and take it from there.\n\nI am curious how one would make a deposit from an exchange though... Do some exchanges allow contract calls?",
        "created_at": "2021-12-12T11:11:37.361000+00:00",
        "attachments": []
    },
    {
        "author": "benjaminchodroff",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "My 10 eth2 validator seed+keys were compromised (confirmed contact with hacker), but I still hold my eth1 deposit address. My ETH2 withdrawal credentials start with 0x00 - so they were randomly generated since I used the v1.1.1 eth2 client. I would greatly appreciate a feature that allows those of us who started validating early to request a \"forced return to (eth1) sender\" feature that would allow a one time finalized changed to the original eth1 deposit address prior to withdrawals being allowed. I am certain there must be others who are eth2 compromised and don't even know it, that may wish to use this feature.",
        "created_at": "2021-12-12T13:48:18.506000+00:00",
        "attachments": []
    },
    {
        "author": "benjaminchodroff",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Evidence of my claim:\nethdo signature verify --data 0x5f24e819400c6a8ee2bfc014343cd971b7eb707320025a7bcd83e621e26c35b7 --signature 0xa2965dfd099dd0e44535c443d90c3b38016e43283a5aec5c0c7c04e94af89c0878bbc18b9f3f1bd5428ddd319c5d296717f741ce0e24fbbce1ae8fa77ba4a9f015a611bddf58f713e9a7aff022b87964a66cc26c3e8388c3707b10cc2ced4974 --signer 0xa03c5ea17b017cfad22b6030575c4452f20a4737393de16a616fb0a8b0555fe66472765720abec97e8922680204d3866\n\nETH1 Deposit Signature:\n{\n  \"address\": \"0x06f2e9ce84d5e686428d361d91b437dc589a5163\",\n  \"msg\": \"0x455448322052657475726e20546f2053656e646572\",\n  \"sig\": \"e1e393e6dd403e05b2f7d8e234d0dc226551b21f61fe9b655d7b1792d4bc2e955aeb04c3de876d044ac7d6b9bed505fb6bde47f83ea3dce96aae13067e7c519e1c\",\n  \"version\": \"3\",\n  \"signer\": \"MEW\"\n}",
        "created_at": "2021-12-12T13:49:56.110000+00:00",
        "attachments": []
    },
    {
        "author": "benjaminchodroff",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I can put some funds towards this. I'm just an individual, but if others are willing to join me... perhaps we can help with this funding.",
        "created_at": "2021-12-12T15:07:01.517000+00:00",
        "attachments": []
    },
    {
        "author": "benjaminchodroff",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I would be fine with a one time finalized request to say “send it back to my eth1 deposit address”. I really doubt anyone sent from a centralized exchange (and if they did, it’s way better to sort it out with them, than a hacker group using flashbots on withdrawal day)",
        "created_at": "2021-12-12T15:50:59.891000+00:00",
        "attachments": []
    },
    {
        "author": "yorickdowne",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yeah not sure, some digging in order. Those 100+ validator people would have the funds and incentive to get work going on the design and get exchanges / large staking outfits on board.\nBecause if just a few home stakers load the list out of altruism, that doesn't help. Also, hackers can and will run nodes and run their own lists, which benefit only themselves.",
        "created_at": "2021-12-12T15:56:22.371000+00:00",
        "attachments": []
    },
    {
        "author": "benjaminchodroff",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Nobody can be sure their eth2 hasn’t been compromised because withdrawals are blocked. We all have reasonable certainty our eth1 has not yet been compromised because our funds are still there. How much funding is required to make this feature happen? I’ll try to help.",
        "created_at": "2021-12-12T15:58:18.330000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e Because if just a few home stakers load the list out of altruism, that doesn't help. Also, hackers can and will run nodes and run their own lists, which benefit only themselves.\nThat is indeed a risk, assuming the hackers run a decent amount of validators themselves. But I think I'm not the only one rather reluctant to make these special-case 0x00 -\u003e 0x01 messages (/prioritizing) part of consensus.",
        "created_at": "2021-12-12T16:00:05.225000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I would say it's not about the funding, it's about coming up with a solution that the client teams can be convinced of implementing. And from that perspective I would say elegant and opt-in solutions that do not affect consensus are easier to get in, but of course leaves you with convincing most stakers to actually opt-in (and hackers with validators will certainly not opt-in, as \u003c@!219015859182632960\u003e rightfully pointed out).",
        "created_at": "2021-12-12T16:05:03.504000+00:00",
        "attachments": []
    },
    {
        "author": "benjaminchodroff",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Agree. Simple works for me - signed transaction on eth2 (only helps if you still have your key) which forces a one time (final) 0x00 to 0x01 which must be set to the validator eth1 deposit address. It doesn’t solve people who lost their eth2 keys…",
        "created_at": "2021-12-12T16:10:38.339000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "To repeat myself, the beacon chain doesn't have information on the deposit address so it would have to be provided through a social mechanism (hence the mention about having some sort of \"community list\" that individual beacon nodes could adhere to, or not).",
        "created_at": "2021-12-12T16:13:40.560000+00:00",
        "attachments": []
    },
    {
        "author": "benjaminchodroff",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Ah, good to know. Thanks.",
        "created_at": "2021-12-12T16:14:15.754000+00:00",
        "attachments": []
    },
    {
        "author": "benjaminchodroff",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Won’t the beacon chain have the deposit address data once merge happens, yet before withdrawals are allowed? \u003c@144468805697929216\u003e",
        "created_at": "2021-12-12T16:18:43.439000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "https://discord.com/channels/595666850260713488/748530848470663208/918926763877343242",
        "created_at": "2021-12-12T16:19:24.376000+00:00",
        "attachments": []
    }
]