[
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!291925846556540928\u003e what will be the next step in terms of implementation?",
        "created_at": "2021-03-07T11:53:41.136000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There are no current implementation steps for client teams. Tools could move to support it (e.g. the deposit cli)",
        "created_at": "2021-03-07T14:23:32.238000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "One question regarding ETH1 withdrawal credentials: are they going to be considered \"first class citizens\" in all future operations?  Specifically, for any future operations that require a signature from the withdrawal credentials holder will a valid ETH1 signature be acceptable in the same way that a valid ETH2 signature would be accepted?\n\nTo make that question a little more concrete: Dankrad put forward a proposal that the withdrawal credentials could be used to sign an exit transaction.  If this were to go forward, would it allow an ETH1 signature in the case that the withdrawal credentials were an ETH1 EOA?",
        "created_at": "2021-03-07T14:38:56.195000+00:00",
        "attachments": []
    },
    {
        "author": "dkdkdkdkdkdk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "that wouldn't work if it's a contract, right? I assumed that's the main use case for ETH1 withdrawal credentials",
        "created_at": "2021-03-07T16:03:07.826000+00:00",
        "attachments": []
    },
    {
        "author": "dkdkdkdkdkdk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "why would you set the withdrawal credentials to an ETH1 EOA? it seems you're just narrowing your options with no gain",
        "created_at": "2021-03-07T16:06:21.643000+00:00",
        "attachments": []
    },
    {
        "author": "alon.ssv.network",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "That would be more complicated as a future merge would need some eth1 \u003e beacon op code for that.",
        "created_at": "2021-03-07T17:30:55.218000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "A better question would be why wouldn't you use an ETH1 address?  Benefits include:\n  - better tooling for address generation and confirmation\n  - fuller hardware support\n  - checksumming of address when creating deposit transaction\n  - easier to provide proof of ownership if required\n  - ability to set withdrawal address to a smart contract without requiring its immediate deployment\nand that's just off the top of my head.  As it stands, use of the BLS withdrawal credentials is an anachronism.  The only thing that would change that would be if future validator-related operations required BLS credentials to operate, hence the question.",
        "created_at": "2021-03-07T21:40:12.784000+00:00",
        "attachments": []
    }
]