[
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hey, following up on my thoughts on withdrawal again:\nCould we treat withdrawal differently for stakers with `0x00` vs. `0x01` (ETH1 address) withdrawal credentials.\nStakers with `0x00` need a method to set the ETH1 withdrawal address anyway. Since `0x00` stakers were mostly very early adopters, why not verify that the withdrawal transaction comes from the initial deposit address. We could have this for a grace period before the final feature ships. If we limit this possibility to `0x00` withdrawal credentials, I don't see downsides security wise + those stakers were never told anything in regards to how the mechanics of withdrawal works.",
        "created_at": "2021-09-24T08:07:13.636000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "They were told that the deposit address doesn't matter",
        "created_at": "2021-09-24T08:08:27.230000+00:00",
        "attachments": []
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sure, and that is correct. It doesn't matter if you don't want it to matter. If you have your BLS keys for your validator + your keys for your ETH1 address, how can this be less secure then having just your BLS keys for your validator? As I said, this should only be there for a little while and only for stakers with `0x00` credentials. There is no risk for people who no longer have access to their initial ETH1 address. They just wait for the final feature to ship and can set their withdrawal address as they want. I don't get why we should not support early adopters for a very short period that causes no harm to anyone.\nTo be straight: Nobody was told that `0x01` withdrawal credentials will be introduced in less then 3 month after genesis. If people would have known that, they might have waited for that feature to ship since this protects you from loosing all your funds. Why not be fair to the others?",
        "created_at": "2021-09-24T08:20:19.247000+00:00",
        "attachments": []
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "btw: I wonder how many stakers knew about this. Personally, I have never read anywhere that the initial deposit address doesn't matter and you could throw it away. \nThe only thing I knew was that deposit is not possible and that the mechanics is under discussion. \nWas it stated in the specs or in an EIP? Just out of curiosity...",
        "created_at": "2021-09-24T08:23:19.573000+00:00",
        "attachments": []
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "To be clear: I have both keys in a secure place, but I feel like I should lobby for people like \u003c@!876973674564030504\u003e since I can fully understand their frustration and their thoughts.",
        "created_at": "2021-09-24T08:25:55.931000+00:00",
        "attachments": []
    },
    {
        "author": "_emptymind",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There could be a wider issue than just people who know their keys are compromised. It's been a long time. There will be a large number of people who may simply be concerned in CASE their keys may have been compromised. The only logical thing to do is to race to withdraw as a PRECAUTION. This worries me because I imagine lot's of people trying to exit destabilising the network or at least flooding it. The problem is exascerbated by concerns about what effect this sudden increase in liquidity might have on price, which in turn could incentivise people to exit ASAP and cause a snowball.",
        "created_at": "2021-09-24T08:36:55.668000+00:00",
        "attachments": []
    },
    {
        "author": "_emptymind",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "One thought I had was that maybe we could begin to get people to pre-register who already know they wish to exit. Then we would know the scope of the problem. Another thought I had was to only allow batches of exits in the order in which they first started validating. Still another idea might be to have a window after a withdrawal request is made to see if you get additional conflicting requests. Although this does not itself actually solve the problem, it at least signals that something is wrong with that set of keys and that some kind of compromise must have occurred. And it allows us to know how many are affected. What to do with it is a seperate problem.",
        "created_at": "2021-09-24T08:41:44.327000+00:00",
        "attachments": []
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "+1. \nWouldn't my suggestion help here too? People with `0x00` credentials could sign a message from their initial deposit address and set any ETH1 address. This would give them confidence that even if their BLS keys are compromised, the worst thing that could happen is slashing. Maybe this causes some validators to exit the race because they know they won't loose everything...",
        "created_at": "2021-09-24T08:44:39.453000+00:00",
        "attachments": []
    },
    {
        "author": "_emptymind",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Withdrawal is definitely my biggest Ethereum worry as a validator. I am slightly nervous about Altair, Prysm code rewrite for V2 and client diversity, quite concerned about the Merge being successful and taking so long, but properly worried about withdrawal and it's overall impact.",
        "created_at": "2021-09-24T08:48:16.986000+00:00",
        "attachments": []
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Again, +1! Good thoughts. \nI'm kind of surprised that the community is very quite on this. The large increase in ETH price since the launch of phase-0 made some people very nervous. I have the feeling that the amount of solo stakers would be much lower given todays price level and no clear plan for withdrawal.",
        "created_at": "2021-09-24T08:51:12.379000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I have, and I have told people as such.",
        "created_at": "2021-09-24T08:51:17.891000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It's less secure, because all of a sudden there's an alternative method of withdrawing that wasn't strictly possible before. You're potentially opening up some people to getting their funds drained.",
        "created_at": "2021-09-24T08:52:30.674000+00:00",
        "attachments": []
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It's good to educate people! I was going with a non-custodial staking service and can't remember any note on this. I know, it is a DYOR thing, but I wonder how many were aware of this in the first place.",
        "created_at": "2021-09-24T08:52:59.969000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There's also batch deposit contracts that were used, multisigs, or other types of fancy \"sources\". Not sure what you would do with those then.",
        "created_at": "2021-09-24T08:54:32.531000+00:00",
        "attachments": []
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'm not in the position to have a strong opinion, but I don't get how this is less secure. It's just for a short period of time and it requires both access to your keys and your eth1 deposit address.",
        "created_at": "2021-09-24T08:54:47.353000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\"short amount of time\" is all an attacker needs, not sure how that makes it better",
        "created_at": "2021-09-24T08:55:04.427000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "you're still assuming that everyone that deposit has sole ownership of their validator keys and their eth1 withdrawal address no? I'm saying that that's not necessarily the case",
        "created_at": "2021-09-24T08:56:16.108000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I might be someone that still has ownership of their BLS withdrawal credentials, but has lost (or never had) sole ownership of the address that made the deposit and the validator keys.",
        "created_at": "2021-09-24T08:57:01.431000+00:00",
        "attachments": []
    },
    {
        "author": "_emptymind",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I was an early adopter and I was validating in time for genesis. I have to say it was not clear to me whether or not the eth1 address I was depositing from would be needed to receive the funds back at withdrawal. I made the (false) assumption that this was why people were trying to deposit from hardware wallets. I don't think there was any narrative on the launchpad or in the somer esat guides - only that withdrawal had simply not been designed yet.",
        "created_at": "2021-09-24T08:57:31.978000+00:00",
        "attachments": []
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You're right! That's what I assume, and I guess this is what I don't understand. I think this alternative should only be there for a short amount of time (days) before the final feature ships. If you're not the sole owner of your BLS keys after the features ships, then you're lost anyway. If both the eth1 address and your BLS keys are compromised, then what's the point. \nBut I got you! I guess I don't have the more sophisticated deposit scenarios in mind.",
        "created_at": "2021-09-24T09:01:51.047000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "No, my _validator_ keys might be compromised, but the withdrawal keys might not be",
        "created_at": "2021-09-24T09:02:33.691000+00:00",
        "attachments": []
    },
    {
        "author": "_emptymind",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I have a mnemonic which I have safe, and no matter how complicated everything else gets, I cling on to the promise that it will be all I need to exit \"somehow\", \"one day\". I think that is the basis for most people to assess whether or not being a validator suits their risk profile.  Hopefully not too many people try to do clever things to protect themselves from loss. Simplicity is the best thing IMO. It is human nature to put things in a \"safe place\" and forget where it was. This is like that but on a terrifying scale 😂",
        "created_at": "2021-09-24T09:07:58.537000+00:00",
        "attachments": []
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Right, but you will never know that until it is too late. That's why I lobby for a way to set a withdrawal address before the exit + a way to do it from your eth1 deposit address first, before this limitation falls. This way we can keep some people in and not just exit because of precaution, and we support some very early adopters who by mistake got their seed(!) compromised (and know about it).\nThanks for all your thoughts, anyway! I've learned a lot and you have very valid points.",
        "created_at": "2021-09-24T09:09:10.566000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I disagree with \"never knowing unless it's too late\". You could know, or at least know that there's a high likelihood of those being compromised. E.g. a combination of:\n- someone broke in and stole my staking system; I can safely assume my validator keys are compromised. \n- I used a different mnemonic to generate those validator and withdrawal keys than the one of the eth address, and the latter happens to be compromised in the meantime. E.g. I drained it fully by depositing, deemed it no longer necessary to keep it safe, and shared it with the world.",
        "created_at": "2021-09-24T09:17:02.356000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'm not going to argue that it's a _likely_ scenario though. But as long as I played by the rules (keep withdrawal mnemonic safe), I don't see why someone else should all of a sudden get access to my validator balances.",
        "created_at": "2021-09-24T09:18:17.163000+00:00",
        "attachments": []
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e I used a different mnemonic to generate those validator and withdrawal keys than the one of the eth address, and the latter happens to be compromised in the meantime. E.g. I drained it fully by depositing, deemed it no longer necessary to keep it safe, and shared it with the world.\n\nThat's interesting, but I wonder how many generated the keys from two different seeds. AFAIK, most non-custodial services and even the standard deposit cli does this from just one seed.",
        "created_at": "2021-09-24T09:21:11.560000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yes, the withdrawal and validator keys are typically generated from one seed.",
        "created_at": "2021-09-24T09:21:41.226000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I mean that _that_ mnemonic is different from the one used for the eth address you deposited from",
        "created_at": "2021-09-24T09:21:55.336000+00:00",
        "attachments": []
    },
    {
        "author": "_emptymind",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I thought it would always be different?",
        "created_at": "2021-09-24T09:24:02.178000+00:00",
        "attachments": []
    },
    {
        "author": "_emptymind",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Are people using the deposit-cli mmemonic to set up a wallet to deposit from?",
        "created_at": "2021-09-24T09:25:15.591000+00:00",
        "attachments": []
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Ah, I see! Yes, sure. But if you lost your mnemonic for the eth1 address only, then still we could debate if you need the validator keys or withdrawal keys to sign a valid message to set the withdrawal address. But I think it dawns on me, and I can imagine a scenario where an attacker gains advantage over you when *you have no more access to the eth1 address*.",
        "created_at": "2021-09-24T09:26:29.723000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Well, you can just use an existing mnemonic with the deposit-cli right? So you can just use the one you have on e.g. your Ledger",
        "created_at": "2021-09-24T09:27:01.214000+00:00",
        "attachments": []
    },
    {
        "author": "_emptymind",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "ah, didn't realise that was possible",
        "created_at": "2021-09-24T09:27:26.250000+00:00",
        "attachments": []
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "yes, that's possible. There is an `existing-mnemonic` switch on the deposit cli",
        "created_at": "2021-09-24T09:27:52.501000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Well, you need both keys. The validator keys are responsible for exiting, and the withdrawal keys for the withdrawal. Possibly a single message signed with both",
        "created_at": "2021-09-24T09:28:40.580000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think that if you _only_ have access over your withdrawal credentials (be it eth1 address or BLS keys), you can't exit and withdraw. You need the validator keys as well. Although with BLS keys it's generally easy, because the validator key is a child.",
        "created_at": "2021-09-24T09:30:04.823000+00:00",
        "attachments": []
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yes, correct! I was just thinking about \"staged\" scenarios, and if there is a clever order that would support some of the cases without the downsides you mentioned.",
        "created_at": "2021-09-24T09:30:19.637000+00:00",
        "attachments": []
    },
    {
        "author": "_emptymind",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The deposit-cli can generate both with the mnemonic though, right? So compromised mnemonic is game over anyway.",
        "created_at": "2021-09-24T09:30:39.579000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If you used the same mnemonic for your eth addresses, and your withdrawal/validator keys, then yes... it's game over if you lose it",
        "created_at": "2021-09-24T09:31:34.860000+00:00",
        "attachments": []
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sure, if you have the mnenomic, you can re-generate both keys again.",
        "created_at": "2021-09-24T09:31:42.827000+00:00",
        "attachments": []
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "btw, the name \"withdrawal\" key always felt wrong to me since you actually can't withdraw without a prior exit that requires the validator key (AFAIK). Maybe this is a bit misleading...",
        "created_at": "2021-09-24T09:33:29.150000+00:00",
        "attachments": []
    },
    {
        "author": "_emptymind",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So the problem can be defined as proof of custody at some specific point in the past (which could perhaps be a block number).",
        "created_at": "2021-09-24T09:34:10.802000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yes, but at least with BLS keys the validator key is easily derived from the withdrawal key (by default anyway), _even_ if you lose access to the mnemonic",
        "created_at": "2021-09-24T09:34:57.451000+00:00",
        "attachments": []
    },
    {
        "author": "_emptymind",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This is difficult and any solution does not seem like it would be retroactive",
        "created_at": "2021-09-24T09:35:09.974000+00:00",
        "attachments": []
    },
    {
        "author": "_emptymind",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "In fact worse, somebody could have keys compromised prior to even attesting. Or even at the point of creation.",
        "created_at": "2021-09-24T09:36:10.771000+00:00",
        "attachments": []
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Is this really correct? I thought that validator and withdrawal keys are childs of the seed and not of each other...",
        "created_at": "2021-09-24T09:36:29.519000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If you used the eth2.0-deposit-cli, then indeed the withdrawal key is the parent of the validator key. I doubt anyone went through the effort of saving all private withdrawal keys though (as that's _not_ a default). Just talking hypotheticals here 😉",
        "created_at": "2021-09-24T09:38:27.903000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "mnemonic is the parent of _all_ withdrawal and validator keys, and that's the one that people were told to keep safe",
        "created_at": "2021-09-24T09:38:48.851000+00:00",
        "attachments": []
    },
    {
        "author": "_emptymind",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Even if you could prove custody at point of creation it doesn't prove ownership. Although it would seem ill-advised to pass on ownership of a validator to another party, they are not explicitly non-transferable.",
        "created_at": "2021-09-24T09:43:58.055000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Just a note on the \"flood of exits\" concern: when exits are enabled we could be up to 5 exits per epoch, so that's 1,125 exits per day.  If we assume each validator has a balance of around 34ETH at the time of exit we're looking at less than 40,000ETH per day, which I doubt is enough to cause a supply shock, even if it was all sold immediately.",
        "created_at": "2021-09-24T09:46:56.831000+00:00",
        "attachments": []
    },
    {
        "author": "_emptymind",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Even if you can prove who everyone is, it doesn't necessarily reveal who should be allowed to withdraw. I don't think any \"rescue\" mechanisms will be possible.",
        "created_at": "2021-09-24T09:48:40.330000+00:00",
        "attachments": []
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sadly. Of course, my thoughts are very newbieish, but I really wonder if nobody comes up with an idea that is both secure and fair. Maybe there isn't one...\nI'm curious how this turns out. Let's see.",
        "created_at": "2021-09-24T09:50:36.045000+00:00",
        "attachments": []
    },
    {
        "author": "ben.affleck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Thank you all for the wonderful discussion! It was a pleasure! 💪",
        "created_at": "2021-09-24T09:51:21.184000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!780814541394935818\u003e I can tell you from the bottom of my heart I am very grateful indeed, I have been following the discussions here but have kept out of it, but one thing that came to mind which upset me, is some members of the Ethereum Devs are willing to leave initial investors into this beta project behind, and a true inclusive team,  no matter of where we come from or how we were able to acquire the ETH to become a validator should not leave those investors behind, to me it is unthinkable that Ethereum would do that to those who put a lot of £ on line to support this project, I put roughly 75% of all my saving to activate two nodes, I have never been more excited about a project in my life, no I dont host the node I live in the countryside the internet is sktchy here, so I use one of the best non custodial hosts there is.",
        "created_at": "2021-09-24T12:08:16.395000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "But I feel like I have joined a family, I feel part of the most exciting cutting edge technology, the hurt both physically and financially if I was left behind would be devastating. I know the Devs can find a solution, as others have said it cannot effect others, but it should not have to, there needs to be a fail safe, a switch, that if an investor needs to flick it, we can protect our nodes, I have been told privately there could be a solution for me, but I dont want to remove the funds from the node, I am in this for the long haul, 10 years minimum but I was hoping this would be a life long investment. I am one of the little guys, I have two nodes, its true I fell for a really stupid con, but I was so convinced I was talking to the admin of my host, I was completely confused and went against everything I teach and preach, but it happened.",
        "created_at": "2021-09-24T12:09:06.931000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "All the devs need to do is create a switch that can be used in case of a breach, it does not need to effect any other users, and if its deemed to be abused, slash the servers, but my host can 100% identify me, while they dont use KYC they know the email I used to sign up with, they know my payment details, they can and are 100% aware of my identity. Please DEVS, dont let me down, without us how would POS get to where its going, I am truly part of the decentralised system Ethereum urns for, I am a little guy with a dream, Im no crypto expert but have Microsoft certs and studies a degree in IT, when I studied Ethereum intentively, I understood the power and shift to humanity it will bring, I couldnt be more proud to be part of the team, all my T shirts and jumper are ETH clothes, I am a walking talking Ethereum crew and could not be prouder, if the foundation left me behind I would feel betrayed and I am sure the Devs dont want that?",
        "created_at": "2021-09-24T12:10:01.226000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I know there is a way to resolve this issue, and I know I am not the only one, we just need a way for the two keys, server key and withdrawal key to be used directly from the server, a way to block external connections if needs be, it cannot be that complicated to stop an external withdrawal, I trust my host 100% to protect me if they had an option to do that. They dont want to see me lose my investment, they were devastated because they felt bad because they knew the con was well thought out and I truly thought I was talking to the admin. One of the reasons I fell for it, was when I originally setup the nodes I used the Launch pad, but my host said use this script it will be much faster, at the time I was very wary and in no way used their script to initiate the contract, in my head I thought it could be a con, after working and talking with this company trust was built, so when I thought I was talking to the admin, even thought he asked me such a crazy request, and I did say no at first, but he made me feel so bad that I was accusing him of being a thief I thought I was about to have a massive fallout with the company, and so stupidly looking back at the time they said to use their script and not the launch pad, I just thought, ah shit, maybe I should trust them",
        "created_at": "2021-09-24T12:10:31.010000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "yes i F'ed up Big time, I let everyone down, Ethereum, my host, myself and my family, please ETH Devs, be prepared for a massive attack on the system and come up with a solution if needs be to activate something that stops external withdrawals, that way you have to be server side to withdraw/skim and the bad actors cannot use the keys, it only has to be used if the client can identify himself which if they are with a host that will be easy, and if its their own hosted node, they dont need to be identified, external withdrawals could allow a huge hack, Im no pro but please think this out, if a competitor or something more sinistar wants to destroy the project, think this out and put a switch in place to protect the nodes, if you dont, if might not be just me whos crying, it could take the whole project down. I love you guys, wish I could help more, I dont need a job I have one already,, but am so excited I would work for free to help the cause. Over and out ❤️",
        "created_at": "2021-09-24T12:10:40.397000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I used a company email to sig up with my host, I use a paypal address to pay for my hosting, they can 100% identify me, why wouldnt Ethereum allow such an initiation if both parties agreed it was needed, this doesnt have to effect anyone but those who are concerned their keys were stolen or breached somehow, if we can flick a switch to make withdrawals server side only, I would fly to california with my passport and keys, identify myself with bank statements etc, and together the host and I can resolve the issue, the worst part about it is I dont want to withdraw the funds, I may be interested in skimming, but the purpose fo these nodes was a life long investment that I could pass to my daughter, I have my nodes registered under an IT company and she can inherit it tax free. Please Devs, dont let those investors down, we are part of the team. POS for life ❤️",
        "created_at": "2021-09-24T12:19:27.379000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This isn't how permissionless systems work.  Permissionless means both the good and the bad.  It means that no one can arbitrarily create, destroy, or transfer ETH that isn't theirs, which stops both bad actors and good actors.  There is no one you can convince to make this work, the entire system is designed very explicitly to prevent anyone from being able to do what you want.  It has nothing to do with proving your identify to anyone.",
        "created_at": "2021-09-24T12:22:26.194000+00:00",
        "attachments": []
    },
    {
        "author": "_emptymind",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I am truly sorry for your situation. The point of my comment was to illustrate that no matter how much you can prove who you are and what you did, it doesn't prove ownership. Imagine a situation where you are invited to your host's house for drinks. You spot a painting on the wall and you both get talking and he says \"yeah, I bought that for £10K. But if only I could prove its provenance, it would be worth ten times that!\" You tell him that you believe you have some information that proves its provenance, so you offer to buy it. You have sunk all your free capital into your validators, so you offer to hand over the keys. Your host considers this for a moment. You have both had a few drinks but he accepts and a verbal contract is made. You hand over the keys and leave with the painting. Next morning you wake up with a headache and an ugly painting. You want out of the deal but your host declines. Now what? You see how easily identity and custody can fail to establish ownership? I agree with others that you should spend your efforts on being first-to-the-post when withdrawals are enabled. I don't think devs are intentionally letting down early adopters, it's just that this issue represents the heart of what a blockchain is. Trustless and immutable.",
        "created_at": "2021-09-24T13:05:31.572000+00:00",
        "attachments": []
    },
    {
        "author": "_emptymind",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "For that matter, \u003c@876973674564030504\u003e there is nothing stopping you from selling your validators for a reduced price to someone who is willing to take on that risk. And use the funds to set up one new validator with a different seed. At least you still HAVE the keys. The attacker has the same problem you do.",
        "created_at": "2021-09-24T13:14:18.051000+00:00",
        "attachments": []
    },
    {
        "author": "_emptymind",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Perhaps another approach to mitigation against loss or theft of keys is simply insurance? Is anyone offering this already?",
        "created_at": "2021-09-24T13:20:54.755000+00:00",
        "attachments": []
    },
    {
        "author": "ghosts_in_the_code",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "One suggestion - not necessarily a good one - would be if two people issue request with same key, then burn the ETH",
        "created_at": "2021-09-24T14:28:56.398000+00:00",
        "attachments": []
    },
    {
        "author": "_emptymind",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This would at least disincentivise key theft I guess",
        "created_at": "2021-09-24T15:10:05.526000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "But of course I can prove ownership, I purchased ETH using KYC at Coinbase, transferred the ETH to my cold wallet air gapped, then sent it to the contract while at the same time signing up to a host using my company email and payment details, the servers are graffitied with my company name! the host knows who I am 100%, I do find this decentralised attitude a bit ridiculous because what you guys are saying is your happy to turn a blind eye to fraud which is the worst way to run any institution, you have investors who have speculated on this project, are you telling me the owner of a node who has it in his possession at his/her house for example cannot prove he/she is the owner of the node, sorry but that is just a bit ridiculous, if the Ethereum foundation is not even willing to consider an option to protect not only the true owners of the keys, I believe your being blind sighted to the fact that your not fully prepared for a full on attack. How does the foundation know that not all the keys have been compromised? If you dont have a plan for such an attack, the network is a sitting duck, imagine 50% of the nodes were compromised and an attack occurs on the day/weeks the withdrawals are allowed, this attack could compromise the whole project and take Ethereum down with it.",
        "created_at": "2021-09-24T23:51:21.666000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Those who run their own nodes have two keys and a node, without an agreement in place with a 3rd party they in possession of the node and the two keys are the owners of the node. I use a non custodial host, so between us we share the keys, the foundation must not undermine the relationship between the host and the customers, you have a duty to protect your investors and the network, I feel really let down by some of the comments from Devs, until its your key or node compromised you will not understand what its like from my standpoint, but if you was in my position you would be looking for solutions, and there is a solution, you allow server side withdrawals where the two key holders can agree to activate this service to block a bad actor, you cannot just say tough luck lad, its absolutely unfair, you don't go to war and leave the wounded behind, you risk your ass to get the whole team back home over the line!",
        "created_at": "2021-09-24T23:56:58.088000+00:00",
        "attachments": []
    }
]