[
    {
        "author": "dmitriishmatko",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e When the beacon chain calls the execution engine to generate an ETH1 block it also provides the list of operations that are active this block.  The operations are the explicit ones (partial withdrawals as above) and implicit ones (the automatic withdrawals as per the document).  The execution engine alters the balances of the ETH1 addresses as per the list of operations as part of its block processing.\nThere are a  lot of issues with such approach. It's not general, not proof-verified, it requires non-native eth1 execution logic. I really don't like it. Could you document it a bit maybe I'm missing something.\n\n\u003e Withdrawal requests would be signed by the validator key\nYeah, signing with validator key could resolve `0x01` targets issue, let me think about it",
        "created_at": "2021-05-17T13:43:14.159000+00:00",
        "attachments": []
    },
    {
        "author": "dmitriishmatko",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "what if, simply, some of these transactions are not consumed in this block",
        "created_at": "2021-05-17T13:49:54.396000+00:00",
        "attachments": []
    },
    {
        "author": "dmitriishmatko",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "how are you going to handle it?",
        "created_at": "2021-05-17T13:50:01.197000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I agree it isn't general, but I don't see that being an issue because this will all be for the single requirement of moving Ether from the beacon node to the execution chain.\n\nRegarding not being proof-verified: surely if there are proofs they must be against a root supplied by the proposers, so doesn't this still reduce to \"trusting the proposer\", which in turn means trusting the beacon chain (as the proposer's block will be attested to only if it is considered valid).",
        "created_at": "2021-05-17T13:50:18.615000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Under what situation would this occur?",
        "created_at": "2021-05-17T13:51:15.933000+00:00",
        "attachments": []
    },
    {
        "author": "dmitriishmatko",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "- we want it pulled, not pushed, so smb is paying for it and it cannot be overused, in this case withdraw and consumption is always detached\n- even with push we cannot put any number of withdrawals in one block, it could be a potential threat",
        "created_at": "2021-05-17T13:54:07.439000+00:00",
        "attachments": []
    },
    {
        "author": "dmitriishmatko",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "plus we tied here to one consumption system",
        "created_at": "2021-05-17T13:56:27.864000+00:00",
        "attachments": []
    },
    {
        "author": "dmitriishmatko",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "if we want to have later l2 withdrawals or whatever it would be ugly hack over it",
        "created_at": "2021-05-17T13:56:46.388000+00:00",
        "attachments": []
    },
    {
        "author": "dmitriishmatko",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "shards, whatever",
        "created_at": "2021-05-17T13:57:04.131000+00:00",
        "attachments": []
    },
    {
        "author": "dmitriishmatko",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "it's monolith system",
        "created_at": "2021-05-17T13:57:20.814000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Gas fees could be taken from the tx value, or a hardcoded value (or percent) could be taken if it proved to be difficult to manage.  When you say pull, do you mean pulled from the execution layer?  Because that would be a pain.",
        "created_at": "2021-05-17T13:57:28.055000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And we can easily limit the number of withdrawals per block, if that's necessary.",
        "created_at": "2021-05-17T13:57:49.749000+00:00",
        "attachments": []
    },
    {
        "author": "dmitriishmatko",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I mean someone initiates consumption of withdrawal",
        "created_at": "2021-05-17T13:59:12.595000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "As for being a monolith: well, yes.  But given the rest of the ETH architecture I don't see requiring withdrawals of validators to go direct to the ETH1 chain being a massive long-term issue.  And if it is then I suspect it'll be in the queue with lots of other similar issues we'd face today if somehow layer 1 became unusable for the average person.",
        "created_at": "2021-05-17T13:59:26.778000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So there is a three-stage process of \"mark withdrawal available for consumption\" on the consensus layer, which is somehow reflected to the execution layer, and can then be retrieved by a consensus layer transaction?\n\nIf this is just to ensure that gas accounting happens on the execution layer it does seem a lot easier to have an operation on the consensus layer that just pushes the ETH to the execution layer at the supplied address, and either make it a 0 price transaction (with gas limits if required) or a fixed fee deducted from the amount withdrawn (perhaps burned at the consensus layer).",
        "created_at": "2021-05-17T14:05:01.066000+00:00",
        "attachments": []
    },
    {
        "author": "dmitriishmatko",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "it's monolith again",
        "created_at": "2021-05-17T14:05:59.354000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We already require the existing execution layer to create validators, so if we're already in that world is it such a burden to have an equivalent system to finish their lifecycle?",
        "created_at": "2021-05-17T14:12:32.157000+00:00",
        "attachments": []
    },
    {
        "author": "dmitriishmatko",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We are not creating Validators in application layer (eth1), we have existing option of depositing funds for them there and consume this info in BeaconChain (eth2). It's not monolith tie and could be easily modified to add more deposit options. And it's one-way flow",
        "created_at": "2021-05-17T14:19:54.881000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "By that reckoning, could we not have different withdrawal credentials that provide different information as to where to send the withdrawal values? A `0x02` withdrawal credential could send directly to a shard, for example?\n\nIt would require different logic in the beacon chain for each type of withdrawal credential, but that's going to be the case if we have different options for deposits as well so it seems analogous.",
        "created_at": "2021-05-17T14:23:32.630000+00:00",
        "attachments": []
    }
]