[
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Right. But if we follow the new EL operation path as we have recently discussed then batching doesn't save any costs.",
        "created_at": "2021-12-08T09:37:47.679000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!144468805697929216\u003e I keep thinking on the new operation. It could be as follows:\n* There is a ring buffer with withdrawal receipts in the beacon state. The speed of withdrawal processing should be greater or equal to the re-writing speed of the buffer\n* CL generates a list of `Withdrawal(receipt: WithdrawalReceipt, proof: MerkleProof)` operations and adds them into execution payload\n* CL adds previous beacon block/state root to the payload which has a lot of use cases beyond withdrawals\n* CL increases the `withdrawal_index` in the state and verifies that withdrawal operations in the payload are valid with respect to the order of unspent receipts in a similar vein to `deposit_index` functionality\n* CL adds a `latest_withdrawal_index` with the proof linked to the previous beacon block/state root to the payload alongside withdrawal operations\n* EL runs over the list of withdrawals, verifies the proof for each withdrawal receipt and that receipts haven't been spent yet, then adjusts account balances accordingly. EL doesn't need to keep the state with spent receipts -- this is done by proving `latest_withdrawal_index` and verifying receipts against it\n\nProofs is needed as we want to make this scheme future compatible with CL/EL separation. Otherwise, the scheme could look even more simple. The size of the buffer could be adjusted over time.",
        "created_at": "2021-12-08T09:58:48.095000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Initial thoughts at https://github.com/ethereum/consensus-specs/pull/2759#issuecomment-988803796",
        "created_at": "2021-12-08T13:13:35.684000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Still thinking through this, but it looks good.  Some comments:\n  - having the state root available on the execution layer is highly useful, and although I know the merge is minimal I think it's a great shame it didn't make it in to the first cut.  I'd love to see this turn up on the EL (and be made available through an opcode) in one of the clean-up forks\n  - I'm wondering what is in the withdrawal receipt, and if we can get away without it.  Assuming we have the state root available, would adding a couple of fields like `LAST_SKIM_EPOCH` and `LAST_SKIM_GWEI` to the Validator definition be enough, and also avoid the concerns about sizing the ring buffer appropriately?\n  - regarding verifying that the receipt hasn't been spent yet: if the validity of the execution payload depends on all receipts being spent during block processing then this wouldn't be necessary (although this may be more an optimization than a simplification)\n  - do we need to make this compatible with CL/EL separation today, or have this plan available for deployment if/when separation occurs and use the simplified version for now (I assume that there is a list of things we may need to do for CL/EL separation, and so making a subsection of the chain capable of separation without all of it being so capable is additional complexity now without any real benefit)?",
        "created_at": "2021-12-08T13:24:28.804000+00:00",
        "attachments": []
    }
]