[
    {
        "author": ".paulharris",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There was some interesting discussion around not having a queue at all, which would also be attractive, but I agree that it's probably close to time that we just get on with it...",
        "created_at": "2022-10-29T00:00:28.320000+00:00",
        "attachments": []
    },
    {
        "author": "realbigsean",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think if we do sweeping withdrawals the non-queue implementation seems really nice. I think I'd still slightly prefer the original 2 loop implementation because I think the prioritization of the full withdrawals is really nice because those are voluntary (ignoring slashing) and just larger sums locked up - and there's a tangible cost there. I also haven't been involved in the actual implementation for us so I'll also have to defer on the technical implications of each a bit here \n\n+1 for not wanting to delay capella regardless though",
        "created_at": "2022-10-29T00:04:15.832000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Just because it was on telegram but i feel like this is a better place to capture everything\n - there was never a stated requirement to prioritise full over partial, i did ask specifically\n - the single loop was more around offering a minimal viable solution... but the lack of queue would make that simpler again\n - was pretty much an agreement around not getting into the 'fairness' discussion as thats not really my wheel house\nAnd now Im onto reading \u003c@755590043632140352\u003e PR https://github.com/ethereum/consensus-specs/pull/3068  on same topic",
        "created_at": "2022-10-29T00:29:44.349000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "POLL: Should it be considered a 'requirement' that full withdrawals be prioritised over partial withdrawals when processing withdrawals?\n\nPlease react with ✅ (Tick mark) = Yes, ❌ (Cross) = no",
        "created_at": "2022-10-29T01:00:29.568000+00:00",
        "attachments": []
    }
]