[
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "opened a PR to add some prose/instruction around making a `BLSToExecutionChange` like we do with guiding a validator to make deposits\n\nhttps://github.com/ethereum/consensus-specs/pull/3084",
        "created_at": "2022-11-07T22:24:11.838000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "PTAL, feedback around wording etc is appreciated",
        "created_at": "2022-11-07T22:24:28.958000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I've been thinking more about the issue of tooling, I'd be nice if tooling can in the same process of creating the message, check (under a flag) that these credentials can be recovered from a given private key. For example in my case I'm using the same mnemonic for my validator and my eth1 addresses, using simply different paths. It'd be nice to in the same command be able to specify the change and be sure that I own the new eth1 credentials",
        "created_at": "2022-11-07T23:06:54.135000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "A generic \"do you have the private key to this execution address\" question isn't easy to answer.  I considered adding in a requirement to provide a signed message from the new withdrawal address, but there still isn't a widely-adopted way to create signed messages.\n\nIt's not a common case to use the ETH2 mnemonic to create ETH1 addresses (commonly the former comes from the deposit CLI and the latter from a hardware key, at least from those I have been talking to).",
        "created_at": "2022-11-07T23:14:29.393000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yeah I can see it could be a problem but for validators in particular, many may want to do the same as me and use the same mnemonics.  True that signatures are an issue. To sign the message to beaconcha.in I had to do some magic to convince them that the geth signature was good",
        "created_at": "2022-11-07T23:18:47.397000+00:00",
        "attachments": null
    }
]