[
    {
        "author": "yokem55",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The DOS vectors can be probably be mitigated if the beacon root is available on the execution layer. The TX to initiate the exit could probably include a proof against that root that the validator whose exit is being requested is still active and that the sender is authorized to request it. Or if that isn't available, a refundable 'exit deposit' could be required and probably make dos attempts not worth it. \n\nThe bigger thing to sort out is what credentials need to be on the beacon layer to authorize a force exit from the execution layer. Some folks would just like to reuse existing 0x01 credentials. If the sender on the execution layer is the EL address in the credential, then the the exit is considered authorized.\n\nThe problem with that approach is that there are quite a few validators using 0x01 credentials who may not have full control over that exit address, and may not feel they should have to give up arbitrary exit authority just because they setup the validator with a 0x01 credential in the past. It overloads the previous purpose of 0x01, which at the time was to only ensure funds went to a certain address when the validator was exited and withdrawn. \n\nSo, now there could be another can of worms around adding more credentials to the beacon chain and determining how those credentials get added.",
        "created_at": "2022-09-09T16:07:06.765000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "no on the smart contract triggerable withdrawals -- i believe the actual feature you would want is smart contract triggerable *exits* and honestly i'd just consider another EIP for that",
        "created_at": "2022-09-09T19:51:51.427000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "(and im happy to work with you on that if i can be helpful)",
        "created_at": "2022-09-09T19:52:09.329000+00:00",
        "attachments": []
    },
    {
        "author": "gakonst",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "At the highest level,  I'd like the ability of a staker to specify programmatic rules on when the corresponding validator is exited",
        "created_at": "2022-09-09T19:52:38.755000+00:00",
        "attachments": []
    },
    {
        "author": "gakonst",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Is that something that's desired?",
        "created_at": "2022-09-09T19:52:44.600000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "there was a suggestion from lido a few months ago for a \"generalized message bus\" implementation but i think less flexibility is better given the high security requirements of this part of the stack",
        "created_at": "2022-09-09T19:52:59.303000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "so then we could do something like that but just for exits",
        "created_at": "2022-09-09T19:53:09.742000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "i think there is desire for it, this is the only part of the validator lifecycle that is not currently processed either automatically or already triggered from the EL",
        "created_at": "2022-09-09T19:54:00.302000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "so it unifies things",
        "created_at": "2022-09-09T19:54:05.497000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "right, so just this alone has quite a big design space already along w/ some considerations that \u003c@474028048551772160\u003e brings up",
        "created_at": "2022-09-09T19:57:35.156000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "i think the first step is just a concrete spec and then we can go from there",
        "created_at": "2022-09-09T19:57:50.148000+00:00",
        "attachments": []
    },
    {
        "author": "gakonst",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "i'd be happy to help kick that work off",
        "created_at": "2022-09-09T21:35:38.702000+00:00",
        "attachments": []
    }
]