[
    {
        "author": "benjaminchodroff",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We have launched Consensus Layer Withdrawal Protection EIP-4736 website https://clwp.xyz to help explain how this *optional* protection can be enabled, and how we intend to use Kleros curated lists to collect validator withdrawal address signatures and broadcast these requests once supported, and screen invalid requests using this list. No change to consensus is required. CLWP can optionally be used by every validator as the fastest as safest way to set their withdrawal address as the earliest available block height - and may even help compromised consensus layer seed phrases from being withdrawn to the attacker's execution layer address. I would greatly welcome any feedback on this proposal under development.",
        "created_at": "2022-07-20T23:32:59.507000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminchodroff",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "",
        "created_at": "2022-07-20T23:33:32.547000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "CLWP-5-2-3-2-Simple.drawio.png",
                "content": "423cbfab60690df210077fdd49c8813c96c967bedf9cf7398bd81bbb2837fe52"
            }
        ]
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Just a couple of comments:  the website and the graph mention Kleros in a principal role, the EIP does not. I wouldn't mix these. \n\nAnother one:\n\u003e Client teams and node operators may verify these claims independently and are suggested to include “Uncontested and Verified” claims enabled by default in their package.\n\nFor node operators I can't say much. I myself may be inclined to include this feature in my personal node. But I think there's no way on Earth that client teams will include this \"by default in their package\"",
        "created_at": "2022-07-20T23:57:22.806000+00:00",
        "attachments": null
    }
]