[
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think we should not make a decision for every future fork and every time make a decision depending on the fork. It can be (I am actually not sure how) that with some changes we will have to *not* support the previous fork. Today I would not make any remarks in the spec that would restrict us in the future",
        "created_at": "2022-11-18T09:53:52.583000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We already have a field in the method/structure suffix. The only difference is that we would like to deprecate old methods. But I'd argue that we should not support forks that are two forks further from the current one. EL that is syncing from scratch doesn't need this information from CL, for EL that has abandoned for 2 forks and recently started would be easier to make to sync from scratch by wiping out the database. Also, CL should be started from the WS checkpoint where there is no blocks older than 2 forks ago",
        "created_at": "2022-11-18T09:57:57.869000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Backwards compatibility up to `V1` is what we can avoid in our design. This is the thing that we would like to get rid of from EL with EIP4444 (requirement for client software to be capable of running blocks from all forks). I do not understand why would we want to follow this philosophy in Engine API.\n\nI thought having `V2` supporting `V1` semantics is good because it reduces complexity on CL side:\n* CL sees that EL started to support `Vn+1` method after another `getCaps` call\n* CL switches to `Vn+1` and never falls back to `Vn` onwards as CL is sure that `Vn+1` is backwards compatible with the previous version\n\nIf we would like the version leaking to EL then I would prefer to do this by strictly calling old method before, and advanced method after the fork. Or, we can remove version in the suffix and always send version as a field",
        "created_at": "2022-11-18T10:13:16.237000+00:00",
        "attachments": []
    },
    {
        "author": "yperbasis",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "What happens to withdrawals if a slot misses attestation or EL block?",
        "created_at": "2022-11-18T11:23:04.741000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If slot is empty the same withdrawals will be swept in the next non-empty slot. What do you mean by missing EL block? EL payload with empty transactions and withdrawals? If the latter then this block will be deemed invalid by CL",
        "created_at": "2022-11-18T11:47:22.771000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "from the current spec https://github.com/ethereum/execution-apis/blob/main/src/engine/specification.md#specification-3\nit sounds like pre-shanghai, null is ok, post shanghai would need to be empty list? is there that distinction in rlp?\nand if theres a list (empty or not) pre shanghai, thats invalid, and if its null post shanghai, thats invalid... thats what it sounds like in that description anyway...",
        "created_at": "2022-11-18T12:23:23.177000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Anyway this is basically the sticking point for us to join test networks by the looks, will check on the flip side (it's late at night) and see - would like some kind of resolution so that we can talk to non teku nodes...\nwill check the logs i got and see what else i can fix in the meantime",
        "created_at": "2022-11-18T12:24:50.080000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We don't need to have this distinction in RLP, this is only for Engine API which uses JSON. On EL side it will be two different block body and header structures",
        "created_at": "2022-11-18T12:25:04.568000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "ah ok that makes sense",
        "created_at": "2022-11-18T12:25:15.948000+00:00",
        "attachments": []
    },
    {
        "author": "ethdreamer",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e We already have a field in the method/structure suffix\n\nI might be interpreting you wrong, but I believe what you're saying here is that the suffix of the method/structure is used to identify the fork.\n\nThis is **NOT** true. Even if we stop supporting old forks as you suggest. Every method/object version will support **at least** two forks. So the suffix alone will not differentiate which one\n\nAs currently written, the fork appears to be decided by the presence or absence of a `null` in a field. I'm saying this is bad design. It prevents us from adding fields in the future which could reasonably be nullible.",
        "created_at": "2022-11-18T19:48:02.307000+00:00",
        "attachments": []
    },
    {
        "author": "ethdreamer",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We should instead be explicit about the fork.",
        "created_at": "2022-11-18T19:48:51.232000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "My understanding is the fork is determined by the shanghai bock configuration item, and what the spec is saying is 'you can use v2 before shanghai, but the withdrawals field needs to be null'... further, if it's null post fork, then it'll also be rejected...",
        "created_at": "2022-11-18T20:09:39.219000+00:00",
        "attachments": []
    },
    {
        "author": "ethdreamer",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yes. This is what I meant by:\n\u003e As currently written, the fork appears to be decided by the presence or absence of a null in a field",
        "created_at": "2022-11-18T20:13:31.186000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The point I was trying to make, is the fork is not determined by the field being null or not, but it's a validation on the object that would need to pass",
        "created_at": "2022-11-18T20:15:43.190000+00:00",
        "attachments": []
    },
    {
        "author": "ethdreamer",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Indeed.",
        "created_at": "2022-11-18T20:18:41.180000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "another option is being more tolerant like json sometimes is, but it'll lead to silent bad data which in this case is probably very sub-optimal",
        "created_at": "2022-11-18T20:20:41.637000+00:00",
        "attachments": []
    }
]