[
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I know the onus on people to set their withdrawal credentials properly (i.e. to an EOA/smart wallet they own), but of course some people decided to set it to an address at e.g. Binance or Coinbase. They don't detect withdrawals (as they're a balance increase), so that leaves the funds in limbo. I know it's a long shot, but it'd be great if there's someone in here that knows anyone at CEXes that can make it work for withdrawals. Or can help spread the word to users to _not_ do this, or at least educate Coinbase support on what exactly is going on as they don't quite seem to understand [0]. \n\n[0]: \"While the block explorer shows that the transaction was successfully completed, the funds were not received by Coinbase because we don’t currently support this crypto via that network.\"",
        "created_at": "2023-04-18T16:37:24.231000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This is pretty par for the course when working with a large faceless company, especially ones where Ethereum/stakers aren't their primary business/revenue stream.",
        "created_at": "2023-04-18T17:23:18.658000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I agree though, if anyone has contacts at exchanges it would be valuable to find out if they are aware of the problem and if they are working on a plan to resolve it or not.  Similarly, would be great for any exchanges listening in to publicly announce acknowledgement and/or plans to resolve the issue.",
        "created_at": "2023-04-18T17:24:02.853000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Isn't requiring deposit address ownership enough for this? I still think it's unlikely this'll ever get anywhere, but still, out of curiosity.",
        "created_at": "2023-04-18T19:11:10.553000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I would imagine that staking with a pool goes something like user =\u003e pool_contract =\u003e deposit_contract, so \"deposit address\" would be the staking pool, not the user.",
        "created_at": "2023-04-18T19:45:34.525000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I vaguely remember that not being the case, and if it is, it's still a single transaction originating from user. I assume we're talking about hosted (32 ETH) validators here, not \u003c 32 ETH ones (where you pool assets, and the staking service can already steal your funds).",
        "created_at": "2023-04-18T19:50:34.432000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "One could easily imagine a pool that lets you (or even requires you) deposit in one transaction and execute in another.",
        "created_at": "2023-04-18T19:51:41.849000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I believe some of the staking pools are designed such that they cannot steal your funds, but I don't follow pool design closely.",
        "created_at": "2023-04-18T19:52:16.731000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think the worst they can usually do is burn your funds or use them to launch an attack?",
        "created_at": "2023-04-18T19:52:40.156000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "In the case of Rocket Pool I believe the design is that the pool operator cannot burn/attack with your funds but a 16+ ETH holder can?",
        "created_at": "2023-04-18T19:53:01.342000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think \u003c@755590043632140352\u003e is just talking about pools that have your validator keys (or generated them for you), but you have the withdrawal BLS keypair or the validator has an associated withdrawal address that's yours. Not Rocket Pool, not any other fancy thing out there.",
        "created_at": "2023-04-18T19:54:03.257000+00:00",
        "attachments": []
    },
    {
        "author": "sansar57",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e as you mentioned, if the validator_key isn’t challenged by the withdrawal _key for let’s say a year, a case can be made for signing BLS changes with the validator key. For guys who have their mnemonics, this shouldn’t be a problem and by that time, most of the addresses are changed to execution layer addresses already and it can be done only once. For all remaining people with lost mnemonics, the validator_key can be an option out, after exiting validator duties. Does it really matter for one who lost his mnemonics and has no access to his funds, if the pool operators trying to steal it? At this point, they are useless anyway, besides earning fees. I might miss some other points, i am no dev.",
        "created_at": "2023-04-18T20:06:52.717000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The argument is that the same rule change that would allow recovery for lost mnemonics would also allow for theft by pools.",
        "created_at": "2023-04-18T20:20:22.950000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This I think is a no go immediately cause the huge number of deposits that came from cex, also technically it's very hard to implement as it mixes consensus with execution. Don't think that will gain much",
        "created_at": "2023-04-18T20:24:04.785000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "How did people deposit from a CEX?",
        "created_at": "2023-04-18T20:24:45.710000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I don't know at all how cex even work, but have a bunch of people on our discord saying that their deposit came from a cex",
        "created_at": "2023-04-18T20:25:47.834000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Perhaps it's impossible? If they don't provide a UI to send the deposit data",
        "created_at": "2023-04-18T20:26:18.233000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'd say so, but there are weird things out there",
        "created_at": "2023-04-18T20:26:30.241000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yeah I was guiding myself from hearsay but a quick look and the major ones at least did not provide a way to deposit",
        "created_at": "2023-04-18T20:46:16.015000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Still, I think it's  very hard to implement and may have tons of problems itself",
        "created_at": "2023-04-18T20:48:21.341000+00:00",
        "attachments": []
    }
]