[
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hey \u003c@453386940490711054\u003e \u003c@144468805697929216\u003e, regarding CLWP, would it be sufficient for clients to support a pre-loaded list of `SignedBlsToExecutionChange`s? This would be a lot simpler for us to implement as all our code already deals with and understands `SignedBlsToExecutionChange`s. The file formats defined currently in EIP-4736 are more bespoke and would be less clean for us to implement (referring to the formats defined here: \u003chttps://eips.ethereum.org/EIPS/eip-4736#1-change-withdrawal-address-acceptance-file\u003e).\n\nOn the CLWP side, I think it would just require users to submit their `SignedBlsToExecutionChange` to the CLWP Github repo. The messages could be checked against the Kleros-verified claims and the signatures could be checked by your tooling. The CLWP tool could output a `.json` file with a list of `SignedBslToExecutionChange`s that is agreed on by the community before the fork. This format would also match up with the `POST` method on the beacon API, meaning that clients actually don't need to do _any_ extra work to support CLWP: users could just POST the agreed file to the HTTP endpoint ahead of the fork: \u003chttps://ethereum.github.io/beacon-APIs/?urls.primaryName=dev#/Beacon/submitPoolBLSToExecutionChange\u003e\n\nApologies if you've already come to the same conclusion and I've missed it. Seems like this would be a good way to get lots of clients compatible",
        "created_at": "2023-01-20T04:46:59.974000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "nvm, just found your latest YouTube video on the CLWP Discord 😁",
        "created_at": "2023-01-20T04:55:17.798000+00:00",
        "attachments": []
    },
    {
        "author": "benjaminchodroff",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We are looking forward to supporting the common format of staking-deposit-cli/ethdo (and we expect other clients to generate a compatible format). Suggestions welcome 🙂",
        "created_at": "2023-01-20T09:03:07.915000+00:00",
        "attachments": []
    },
    {
        "author": "superlouis.eth",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hello all, quick question: the withdrawal address can be any address (like a smart contract)? or does it have to be an EOA with a signing key?",
        "created_at": "2023-01-20T11:07:03.292000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Any address works",
        "created_at": "2023-01-20T11:09:17.394000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "However, care must be taken since there is no EVM involved, so if the contract relies on being triggered by the EVM or no one has access to releasing funds from it, that ETH will be locked",
        "created_at": "2023-01-20T11:10:49.608000+00:00",
        "attachments": []
    },
    {
        "author": "superlouis.eth",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "good point, I was just thinking of a gnosis safe wallet, so it should be fine",
        "created_at": "2023-01-20T11:28:51.750000+00:00",
        "attachments": []
    }
]