[
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Do you have an idea of how many keys will there be in that list? Will you make an effort to make sure people in that list have a credible reason to be in that list? We will implement a system where the latest message in the pool will be the first one included in a block, so it will be in the interest of pools to broadcast their messages as late as possible",
        "created_at": "2023-01-26T12:11:37.032000+00:00",
        "attachments": []
    },
    {
        "author": "benjaminchodroff",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If we encourage late block submissions, it delays crucial time during the block for P2P gossip - which impacts far more nodes than a single node’s last message received via http, right? Just trying to think through this game….    We have a lot of people (“hundreds of validators”) who had seed phrases in password managers like lastpass that are just “concerned” but only a small handful of individuals (less than a hundred validators, so far) that are certain they have a compromised seed phrase and have contacted us via white hat submission route (not GitHub). We are allowing anyone to submit to GitHub and may have thousands of uncontested validators. Appreciate the help.",
        "created_at": "2023-01-26T19:28:26.078000+00:00",
        "attachments": []
    },
    {
        "author": "benjaminchodroff",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Let me know if I can provide any more details",
        "created_at": "2023-01-26T19:29:11.063000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'm interested in a number of keys that you think you'll have in your list",
        "created_at": "2023-01-26T19:30:24.261000+00:00",
        "attachments": []
    },
    {
        "author": "benjaminchodroff",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "~100 validators confirmed compromised, but it wouldn’t surprise me if we see over 1000 validators in mainnet submitted to CLWP as it offers convenience and security (set on many nodes via community) to set withdrawal address. Best guess at this time.",
        "created_at": "2023-01-26T19:58:07.106000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Thanks. ~100 keys or 100 operators. Cc \u003c@361447803194441738\u003e",
        "created_at": "2023-01-26T20:00:45.891000+00:00",
        "attachments": []
    },
    {
        "author": "benjaminchodroff",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Validator == single withdrawal key",
        "created_at": "2023-01-26T20:02:15.886000+00:00",
        "attachments": []
    }
]