[
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think a case can be made in the future. One such system could be that validating keys are allowed to send messages to change the bls address. These messages can stay on chain for say 1 year. If they aren't challenged by the withdrawal key (or the same validating key) then the bls change takes effect",
        "created_at": "2023-04-15T01:22:31.255000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This adds a bunch of complexity to the protocol but if there are enough lost keys it may be acceptable IMO",
        "created_at": "2023-04-15T01:23:19.819000+00:00",
        "attachments": null
    },
    {
        "author": "sansar57",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "That would be awesome. I hope related persons are reading this.",
        "created_at": "2023-04-15T03:09:59.519000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'd say that is _very_ dangerous still. Only yesterday there was someone being surprised about partial withdrawals not being opt-in, that's how much people are paying attention to changing rules. It's _less_ dangerous (not perfect, but a lot better) if you require the depositing address to somehow sign the message as well.\nUnless hundreds if not thousands of people are affected, not worth the risk to the protocol imo. And even then we'd be setting a precedent similar to an irregular state change, and I don't think anyone wants to reminded of the drama around \"recover funds\" initiatives like EIP-999.",
        "created_at": "2023-04-15T08:25:11.966000+00:00",
        "attachments": null
    },
    {
        "author": "sansar57",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Fee-recipient-address can be set with the validator keys, so …",
        "created_at": "2023-04-15T10:45:55.501000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Your point being? The fee recipient address doesn't have control over the validator balance",
        "created_at": "2023-04-15T10:46:39.884000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Anything you add or change to the protocol to retrieve your validator funds goes against the security mechanism implemented (separation of concerns with keys). Simply put, whatever you have to add to get your validator balance back means that _others_ might be put at risk of getting theirs stolen (by not paying attention or whatever other reason). This is strictly _worse_ in consequence than some irregular state change (e.g. EIP-999), and even that couldn't get in. And that was about 500k ETH!",
        "created_at": "2023-04-15T10:52:20.462000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It fucking sucks having lost your mnemonic, but I would advise against getting your hopes up of ever retrieving those funds.",
        "created_at": "2023-04-15T10:53:00.364000+00:00",
        "attachments": null
    },
    {
        "author": "sansar57",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It’s like letting few guys alone to their own fate in a community /society, because they have made a mistake. In order to protect the majority from things which probably will never happen.  Whatever risk you guys are seeing in allowing deposit keys to sign that damn bls-change……",
        "created_at": "2023-04-15T11:01:17.919000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Again, you say \"probably will never happen\". That's already worse than consequences of previous \"recover fund\" proposals (where it was \"definitely\"), and those also didn't get through.",
        "created_at": "2023-04-15T11:04:27.990000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "What is the actual danger here? That some unsuspecting party has BLS prefix and some hacker claimed a new address and for over a year the unsuspecting party didn't do anything?",
        "created_at": "2023-04-15T11:18:58.332000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yes",
        "created_at": "2023-04-15T11:30:08.724000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think this is minimal if not zero if done at the right time and with the right parameters, as I said in my post, a case could be made in the future. And the parameters can easily be changed: two years lockup, require the validator to be exited for over a year before accepting the bls change, etc.",
        "created_at": "2023-04-15T11:33:46.800000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And as i said, similar (although on the EL) proposals have failed, where \"minimal if not zero\" was not even question. I'm not _against_ recovering funds to rightful owners if it's clear who owns them, but i do think that is a much harder case for lost withdrawal BLS credentials than e.g. some contract errors.",
        "created_at": "2023-04-15T11:59:22.999000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think the comparison with EIP-999 is unreasonable. In that case that was about treating a single contract differently than any other contract that may have lost funds. In this case this would be a criteria that would apply to every single one and only someone that has exited his validator for over a year and didn't hear all the warnings that his key has been claimed to change for another year could fall victim of this. While every one that actually lost their mnemonics could honestly recover their funds. It's not about benefiting some vs others, nor treating them separately. Other than protocol complexity I don't understand any pushback against such movements",
        "created_at": "2023-04-15T21:12:14.245000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think that this would open up some serious issues.  The protocol is pretty clear that the private key related to the withdrawal credentials are required to access funds.  If we change it in this situation, what about all of the other situations where keys have been lost?  I don't think that it would be a good look for core devs to be picking and choosing which lost funds they are choosing to create a mechanism to access.",
        "created_at": "2023-04-15T21:18:01.007000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This is not about core devs deciding anything but we as a community doing so, and yes, if there are other situations where keys are lost, can be proven beyond reasonable doubt (and I claim that the setup described above goes beyond anything that is reasonable to doubt) then by all means, we should always pick to recover those funds, it's not me advocating for one case vs others, I would always chose to recover in these cases",
        "created_at": "2023-04-15T22:13:28.996000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Here's a dumb thought experiment: validators with lost withdrawal keys could sell their ability to double-vote to the highest bidder. The highest bidder could use the double vote to attack the chain in the traditional way (probably ineffective), or to attempt an unbundling attack on a MEV relay.  The validator has \"nothing to lose\" in a sense because their 32 ETH is already de-facto burnt, so the attacker only has to pay them in excess of the expected value of future proposed block fees (minus running costs). The attacker could also recoup some of the locked 32 ETH by including the slashing themselves in the next slot (if patient/sophisticated).\n\nHowever, I think the risk to the protocol in this scenario is very minimal, so this doesn't lend any weight to either side of the debate. Could be an interesting strategy for someone to try to recoup their capital though 😳",
        "created_at": "2023-04-15T23:33:53.091000+00:00",
        "attachments": null
    }
]