[
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003c@!543900561460822016\u003e Any idea what this failure means?\n\u003chttps://travis-ci.org/github/ethereum/EIPs/jobs/730646206\u003e\n\u003chttps://github.com/ethereum/EIPs/pull/3001\u003e",
        "created_at": "2020-09-27T06:39:14.051000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I suspect the issue isn't with that PR since it just changes the value of two constants.  Seems like a more general failure of EIPV",
        "created_at": "2020-09-27T06:39:49.717000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003chttps://github.com/ethereum/EIPs/pull/3000/files\u003e this feels like squatting to me.  I'm very tempted to assign that user some old but otherwise free EIP number to discourage this behavior.",
        "created_at": "2020-09-27T07:55:18.102000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "There are a bunch of numbers we could use from the past here people mistakenly opened an issue or PR when they didn't mean to.",
        "created_at": "2020-09-27T07:55:43.793000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003c@!543900561460822016\u003e Actually, it appears that the validator is generally broken.  I'm seeing it fail on a bunch of PRs with the same error.",
        "created_at": "2020-09-27T08:59:28.840000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003c@!191378736254287874\u003e \u003c@!642887713246150666\u003e For context regarding some comments I have made recently in discussions with you, this kind of EIP is why I am generally against Meta/Informational EIPs that aren't technical standards: https://github.com/ethereum/EIPs/pull/3005.  I worry that there is no clear line for \"this should be in the EIPs repository\" and \"this should be a blog post\".  By hardlining at \"Ethereum technical standards\", it is much easier for editors to draw a line and say \"this isn't an EIP\".",
        "created_at": "2020-09-27T09:06:12.966000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "Hmm, that’s unfortunate. Let me dig into it a bit.",
        "created_at": "2020-09-27T15:29:46.444000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e fixed with this PR: https://github.com/ethereum/EIPs/pull/3007",
        "created_at": "2020-09-27T16:19:34.014000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "Regarding EIP-3005, what do you consider an \"informational\" EIP? Although I would've liked to see 3005 be more focused on general purpose meta-txs, I think it provides valuable insight for all smart contract writers that batched meta-txs are cheaper than independent EOA txs. To me, that means it makes sense as an informational EIP. The category is woefully underutilized as it is, I think that we should continue to encourage this method of information dissemination, rather than discourage it.",
        "created_at": "2020-09-27T16:24:52.026000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I don't like the whole concept of informational EIPs.",
        "created_at": "2020-09-27T16:56:50.305000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I don't think the EIPs repository is the right place for \"good ideas\".  I think it should be explicitly for technical *standards*, which means only things that actually need to be standardized, and only technical specifications of such.",
        "created_at": "2020-09-27T16:58:29.154000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "That puts a very nice and clear constraint on what is appropriate for the repository and what isn't, while informational EIPs open the door to \"whatever you feel like putting in here, up to and including your latest blog article\".",
        "created_at": "2020-09-27T16:59:17.255000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "I guess I have a very different opinion of this. I think there are lots of things that don't fit the \"technical standards\" mold that are valuable to be curated and preserved by the ethereum standards org. For example, Turbo Geth has discovered a superior database layout for ethereum state. This isn't a standard per se, but it is definitely something that is valuable for new clients in the future. I think it is a prime candidate for the informational category. IMO, editors should not just be rule enforcers, but should be curators of the standards body and help direct memos in a way that is beneficial for the community. I think the constraint is fairly clear with that assumption. If every developer in the community were forced to read an informational EIP, does it provide utility for the majority of them?",
        "created_at": "2020-09-27T17:14:07.840000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Being a curator is exactly what I don't think editors should be.  The power to curate is the same as the power to censor, and one person's curation is another's censorship.  By keeping curation out of the job, it allows editors to remain politically neutral.",
        "created_at": "2020-09-27T17:18:40.893000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "Curation has historically been a major part of an editor's duties across both journalism and standards organizations. It's important for there to be doctrine (EIP-1) and multiple active editors to avoid censorship. Editors already curate EIPs by deciding if they make sense as a core, ERC, interface, etc EIP. I think if we spend a little time to better codify what an informational EIP is, it won't be as political. Editors will likely always have the most power over informational EIPs because they are much less rigid than technical specifications and the most prime candidates to be subjective. I think this is okay (especially since, to date, we only have 4). If editors simply don't want to deal with them, then I think there should be a role(s) within the EIP org should be dedicated to reviewing this type of EIP.",
        "created_at": "2020-09-27T17:41:40.882000+00:00",
        "attachments": []
    }
]