[
    {
        "author": "3esmit",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e I see your concerns in regarding the EIP rules. Maybe we need to specify the scope of things that can be part of EIP scope, to don't allow EIP becoming a dapp-general EIP.\n\nSupposedly EIPs are only related to the EVM, p2p networking, than things like ERC20 should be moved out of EIPs, as ethereum is agnostic to this standards. Then in this case, the \"application layer\" stuff should be moved into a separate documentation library. \n\nI like how EIPs are right now, because it allows this common layer for interoperability between dapps",
        "created_at": "2020-10-07T12:57:33.017000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I have long wanted ERCs to move out of the EIPs repository, but it is a pretty minor concern for me and I don't feel particularly strongly about it.",
        "created_at": "2020-10-07T12:58:52.565000+00:00",
        "attachments": null
    },
    {
        "author": "3esmit",
        "category": "Cross-layer",
        "parent": "",
        "content": "Understand my current use case of Informational EIPs:\n\nCurrently Ethereum ecossystem have a problem, this problem its caused by a documentation on the EIP site, ERC20 approve and call have a design which is not natural for users, or the wallets UX leads to user errors. This is all related to ERC20, however adding all this rules to an existent standard is not good, so an Informational EIP is a good choice because it allows to aggregate optional documentation for the ERC20.",
        "created_at": "2020-10-07T13:02:48.530000+00:00",
        "attachments": null
    },
    {
        "author": "3esmit",
        "category": "Cross-layer",
        "parent": "",
        "content": "I could instead of making an EIP, kept this as documentation of Status Wallet, however this is not a problem just for Status Wallet, currently a bad UX for ERC20 user interface is standard practice in ethereum ecossystem. \n\nStatus Wallet users essentially are Ethereum users. Not only they are Ethereum users, but also user of the DApp token they are using, and user of the other DApp they are trading that token. \nUltimately this is ethereum, the interoperability layer of DApps. \n\nSo therefore, I concluded that this documentation should be as an EIP, so everyone interested to this ERC can agree in a resolution.",
        "created_at": "2020-10-07T13:10:06.282000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "What you are describing sounds like a great blog post to me.",
        "created_at": "2020-10-07T13:21:00.461000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I *think* what you are looking for is a way to make Good Ideas more discoverable.  I don't think the EIPs repository is good for that sort of thing because there is no filter in the EIPs repository that limits it to Good Ideas.  There are a *lot* of EIPs that I think are *terrible* ideas, yet they are EIPs.",
        "created_at": "2020-10-07T13:22:33.706000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't believe anyone goes looking through the EIPs repository to learn, and in fact I would hope they don't because there is a lot of bad stuff in there!",
        "created_at": "2020-10-07T13:23:08.415000+00:00",
        "attachments": null
    },
    {
        "author": "3esmit",
        "category": "Cross-layer",
        "parent": "",
        "content": "I see, then perhaps we can make a ETH carbon vote for any EIP, only for signaling support?",
        "created_at": "2020-10-07T13:31:40.019000+00:00",
        "attachments": null
    },
    {
        "author": "3esmit",
        "category": "Cross-layer",
        "parent": "",
        "content": "e.g. snapshot.page did a very nice gasless voting.",
        "created_at": "2020-10-07T13:32:21.247000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Democracy is not a great mechanism for selecting quality.  See current world politics.  🙂",
        "created_at": "2020-10-07T13:35:41.392000+00:00",
        "attachments": null
    },
    {
        "author": "3esmit",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's one way, whoever looks on it should be aware of the biases of self interest of rich.",
        "created_at": "2020-10-07T13:40:40.916000+00:00",
        "attachments": null
    },
    {
        "author": "3esmit",
        "category": "Cross-layer",
        "parent": "",
        "content": "Other ideas like a one-head one-vote and using brightid could be used instead.",
        "created_at": "2020-10-07T13:42:58.691000+00:00",
        "attachments": null
    },
    {
        "author": "3esmit",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ideally we would like to have both, one head one vote and one ether one vote.",
        "created_at": "2020-10-07T13:43:29.380000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Cross-layer",
        "parent": "",
        "content": "EIPIP meeting in 1 hr\n\nJoin Zoom Meeting\nhttps://us02web.zoom.us/j/81275794893?pwd=RmY4c29zbjVMd1Bmam82UDVBdXluQT09\n\nMeeting ID: 812 7579 4893\nPasscode: 246256\n...",
        "created_at": "2020-10-07T14:01:49.389000+00:00",
        "attachments": null
    }
]