[
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e And by the way, I am with Micah on what should be considered “official”.  Just because Geth and Trinity are both under the same hierarchy, or they are deemed official by some permissioned page, does not make them ‘official’ in my view.\n\nAgreed.\n\n\u003e In a non-permissioned, bottom up win/win systems, what is ‘official’ is determined by popularity, as in the next rising start rapidly growing in popularity (if you have the ability to track and measure that.)\n\nNo.  Popularity has nothing to do with it.  The core developers come to consensus on what the  protocol is.  Clients need to implement the protocol to participate on the mainnet.",
        "created_at": "2020-11-27T15:13:58.092000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e Consensus shouldn’t be forced.  Bottom up win/win organizations don’t need politics or governance, they just need good communication about what everyone wants.  That, by definition, is consensus.\n\nIndeed.  Still, consensus -- like most any concept -- is not amenable to simple definitions.  I'd suggest Resnik's classic on decision-making in the Internet Engineering Task Force -- \n-- https://tools.ietf.org/html/rfc7282 --  as required reading on the concept of \"rough consensus.\"\n\n\u003e Almost every IETF participant knows the aphorism from Dave Clark's 1992 plenary presentation regarding how we make decisions in the IETF:\n\u003e \n\u003e     We reject: kings, presidents and voting.\n\u003e \n\u003e     We believe in: rough consensus and running code.\n\u003e \n\u003e That is, our credo is that we don't let a single individual dictate decisions (a king or president), nor should decisions be made by a vote, nor do we want decisions to be made in a vacuum without practical experience.  Instead, we strive to make our decisions by the consent of all participants, though allowing for some dissent (rough consensus), and to have the actual products of engineering (running code) trump theoretical designs.\n\u003e \n\u003e Having full consensus, or unanimity, would be ideal, but we don't require it: Requiring full consensus allows a single intransigent person who simply keeps saying \"No!\" to stop the process cold.  We only require rough consensus: If the chair of a working group determines that a technical issue brought forward by an objector has been truly considered by the working group, and the working group has made an informed decision that the objection has been answered or is not enough of a technical problem to prevent moving forward, the chair can declare that there is rough consensus to go forward, the objection notwithstanding.",
        "created_at": "2020-11-27T16:20:25.960000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "The question then becomes consensus of within and among what groups?  When it comes to specifying the Ethereum protocol, the relevant working group are the core developers.  It is currently up to each of us as  individuals to decide how to incorporate input from the rest of the community.  My own take, to quote myself from elsewhere:\n\n\u003e If anyone who doesn’t indemnify me can to tell me what to do as a Core Developer I will have to quit that role. If I wind up in a courtroom I’m willing to argue that I acted on my best technical judgement to support the health of the network. I’m not willing to argue that I followed the sentiments – feelings – of an ill-defined community.\n\u003e \n\u003e That doesn’t mean I don’t care about the community. Just that in the end the core developers alone are responsible for their decisions and their consequences. If the community wants to get organized enough to collectively make decisions about the protocol they will have to get organized to enough to take responsibility for those decisions and protect the core devs from their consequence.\n\u003e \n\u003e Better, I think, that the community get organized enough to provide useful guidance to the core devs, and mature enough to respect our decisions.",
        "created_at": "2020-11-27T16:31:55.358000+00:00",
        "attachments": null
    }
]