[
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I wish there was a way to make it so when someone changes the status of an EIP every line in the file is touched so I can give inline PR feedback on the whole EIP, rather than having to just create a bunch of comments that point at various lines manually.",
        "created_at": "2020-10-22T03:08:40.791000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003c@!642887713246150666\u003e Regarding your desire for a more clear decision making process for EIPs, I was thinking about it more and I think the root of the issue is that it is far easier to capture a clearly defined decision making process than it is to capture an ill-defined or dysfunctional decision making process.  The obvious downside to an ill-defined/dysfunctional decision making process is that legitimate participants in the process *also* struggle to get decisions made.",
        "created_at": "2020-10-22T04:20:44.811000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I think a lot of the Ethereum community (especially on the dev side of things) has seen what happens when governance/decision making processes are captured and they are trying very hard to avoid that happening to Ethereum.  I think many would *rather* have a dysfunctional process than a captured process, which is why there is so much resistance to process formalization and having clear rules.",
        "created_at": "2020-10-22T04:21:48.613000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "This problem is much easier when there is a single benefactor in charge of things (like a CEO of a company), but that tends to not go well in the crypto-currency space because it paints a giant red target on the back of that person for state actors (regulatory agencies, etc.).  I *suspect* this is why those who may have the opportunity to seize power have historically refused to accept or delegate a leadership role beyond \"influencer\".",
        "created_at": "2020-10-22T04:23:24.945000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I think the term Cat Herders is quite appropriate, because you are essentially trying to get a group of people who all naturally resist centralization to follow the same path (a centralizing process).  This is very much like trying to get cats, who instinctively do not cluster when moving, to cluster while moving.",
        "created_at": "2020-10-22T04:25:16.496000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e\n\u003e I think many would *rather* have a dysfunctional process than a captured process, which is why there is so much resistance to process formalization and having clear rules.\nI like clarity, but I also like a simple and flexible process.\n\u003e This problem is much easier when there is a single benefactor in charge of things (like a CEO of a company), but that tends to not go well in the crypto-currency space because it paints a giant red target on the back of that person for state actors (regulatory agencies, etc.).  I *suspect* this is why those who may have the opportunity to seize power have historically refused to accept or delegate a leadership role beyond \"influencer\".\nNot only regulators - private litigation.  It's also part of why the Magicians, Core Devs, and Cat Herders aren't membership organizations - no organization to sue.",
        "created_at": "2020-10-22T15:00:26.660000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003c@!642887713246150666\u003e I had time to  put my issues on the meeting agenda.  But, as usual, not to attend.  I'm hoping we can discuss them here and pick them up at the meeting, which I will  have make a priority on my schedule.",
        "created_at": "2020-10-22T15:17:39.777000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "We discussed some of your thoughts, though attendance at this weeks meeting was generally quite low so we weren't able to come to any big conclusions.",
        "created_at": "2020-10-22T16:24:18.104000+00:00",
        "attachments": []
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "Thanks for sharing your thoughts \u003c@!301186049323958275\u003e \nIMO a clear understanding of a process is always helpful, and documentation is important, not only for educating someone new joining in but also to refer at the time of need. In absence of documentation, the chances of getting lost in the weeds are very high leading to discussions, most of which remain inconclusive.",
        "created_at": "2020-10-22T18:28:08.862000+00:00",
        "attachments": []
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "I totally agree that power shouldn't be centralized but that doesn't mean that decisions can not be made.  The process should govern power and power must be with the process which is not dependent on an individual but a group, an entity selected for decision making or governance for specific tasks.",
        "created_at": "2020-10-22T18:29:02.140000+00:00",
        "attachments": []
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "In Ethereum, one of the groups, \"The core developers\", take responsibility for running the network and make sure features helpful for the growth of the network should be added. I've no problem giving them my vote (power) to decide which EIP should go in the upgrade. Whether we accept or not, they are spending their time doing something in the best interest of the community at large. Moreover by giving power to the core developers does not mean giving power to an individual. It's a group and individuals may vary. So, ultimately power remains decentralized even if it is with a single group.",
        "created_at": "2020-10-22T18:30:32.210000+00:00",
        "attachments": []
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "Similarly, thinking of EIPs, the first few help are EIP-1, EIP editors. I think we should empower them. The EIP editors, with other responsibilities, perform the duty of screening the best proposals for core and other dapp developers and put their effort without any incentive. I've respect for their time and I'd support process that may relieve their load.",
        "created_at": "2020-10-22T18:31:34.539000+00:00",
        "attachments": []
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "Having Cat Herders engaged with the process improvement group, my hope is to keep herding cats by following the best practices (of course some of them are inspired by the conventional industry) 🙂",
        "created_at": "2020-10-22T18:32:18.737000+00:00",
        "attachments": []
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e \u003c@!642887713246150666\u003e I had time to  put my issues on the meeting agenda.  But, as usual, not to attend.  I'm hoping we can discuss them here and pick them up at the meeting, which I will  have make a priority on my schedule.\n\u003c@!683653554631868440\u003e Really appreciate your taking out time and adding agenda items and leaving your thoughts on some. We did discuss a few but would be happy to include more in the next meeting, if you'd like.",
        "created_at": "2020-10-22T18:34:43.900000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "Thanks \u003c@!642887713246150666\u003e One of things I care about a lot is the proliferation of EIP statuses.",
        "created_at": "2020-10-22T19:02:44.265000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e In Ethereum, one of the groups, \"The core developers\", take responsibility for running the network and make sure features helpful for the growth of the network should be added. I've no problem giving them my vote (power) to decide which EIP should go in the upgrade. Whether we accept or not, they are spending their time doing something in the best interest of the community at large. Moreover by giving power to the core developers does not mean giving power to an individual. It's a group and individuals may vary. So, ultimately power remains decentralized even if it is with a single group.\n\u003c@!642887713246150666\u003e  I don't think it's so much a matter of the community giving the  core devs power as them simply having the power.\n\nFor myself - as I say often - the community  doesn't pay me or indemnify me, so they have no right to tell me what to do.  It's not that I don't care about the  community, but that as a core dev I try to keep my decisions as technical as possible.\n\nThe EIP process and the Magician's forums are established means for providing technical input to the core developers.  I'd be happy to see people organize other means.\n\nOther devs may of course disagree as to who the community is, how to know what they want, and how much weight to give that in their discussions.",
        "created_at": "2020-10-22T19:22:10.304000+00:00",
        "attachments": []
    }
]