[
    {
        "author": "gcolvin",
        "category": "Cross-layer",
        "parent": "",
        "content": "Not much immediately, sorry, but it's been off and on for years now, and I'd like to keep it that way.  And if we can't give me back write permissions, how can we give them to anybody new?",
        "created_at": "2021-10-27T00:11:41.945000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Write permissions are not required for editing, so it really isn't a big deal for new editors.  As long as someone has them to override the bot when necessary, they are almost never needed.",
        "created_at": "2021-10-27T06:02:32.074000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Cross-layer",
        "parent": "",
        "content": "I disagree - editors should have write permissions.  Regardless, I wasn't happy about losing mine, and I really do want them back.  As it is, nobody even seems to know why I lost them, or who can turn them back on.",
        "created_at": "2021-10-27T18:41:38.387000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm pretty sure the GitHub owners were doing a general cleanup of permissions which is why the permissions went away.  For security reasons, only people who need permissions should have them and I am *guessing* that they noticed that you haven't done any EIP editing in quite a while so assumed you no longer needed the permissions.",
        "created_at": "2021-10-27T18:51:37.294000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "There is even an argument to be made that not all editors should have write permission to the repository since write permission is necessary only once in a while, and one or two people with that permission is enough (it doesn't have to be everyone).  I'm not sure I agree with this argument, since editing is a time consuming enough job as it is, it is not clear that the security benefits of only giving write permissions to 1-2 people outweighs the annoyance of only those people having override powers.",
        "created_at": "2021-10-27T18:53:09.728000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Cross-layer",
        "parent": "",
        "content": "You may recall that for a while I was the only person actively editing, and was staying up very late to help you get your EIPs in.  We are most all of us volunteers, and no one of us can be counted on to be available when needed.  But again, regardless, _I want my permissions back_.",
        "created_at": "2021-10-27T19:08:17.676000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yep, I very much remember and the work you did was a boon to the Ethereum community.  🙂  I don't think that makes for a compelling argument that you should have write access indefinitely though.  I fully expect that when I stop doing EIP editing my access will be removed, and potentially even before that.  I believe *many* people lost write access when you did as part of a general permissions cleanup.",
        "created_at": "2021-10-27T19:10:24.906000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "It may help to better understand why you want write access.  I think the only thing that you can do with such access is override the bot, which these days works pretty well for most tasks (so overrides are rarely necessary).",
        "created_at": "2021-10-27T19:10:56.688000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Cross-layer",
        "parent": "",
        "content": "I haven't stopped. I've taken a break. For a long time having those permissions almost defined being an editor.  I don't want to argue about this any more.",
        "created_at": "2021-10-27T19:14:28.634000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e this kind of gatekeeping is not a good look.",
        "created_at": "2021-10-27T22:10:10.702000+00:00",
        "attachments": null
    }
]