[
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Which kind of gatekeeping?",
        "created_at": "2021-10-28T02:51:32.377000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "If you are referring to deciding who gets write access to the EIPs repository, the extremes are:\n1. No one has access.\n2. Everyone has access.\nIt seems obvious that there exists some process for deciding who gets write access to the repository and who doesn't.  IMO, for this specific repository a reasonable deciding factor is \"people who are actively editing EIPs have write access\".  One could make the argument (and perhaps you are) that anyone who *ever* edited EIPs should have access and I think this wouldn't be a completely unreasonable stance, but I think most security experts would agree that it is an unnecessary security risk to give people write access who don't actually need it.",
        "created_at": "2021-10-28T02:54:28.092000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "To be clear, I have advocated heavily for more people to actively take part in the EIP editing process.  I would love to see Greg or other ex-editors return and help out and if they did I would advocate for them to gain write access like I have for other active editors in the past.",
        "created_at": "2021-10-28T02:55:35.630000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Also, to be clear, I am not the one who updated permissions nor was I involved in that process in any way.",
        "created_at": "2021-10-28T02:56:19.786000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "First of all, I’ve a lot of respect for all the present and emeritus EIP editors for the work they have done in getting us to where we are today.\nI made a pull request recently to update the EIP editors list https://github.com/ethereum/EIPs/pull/4394",
        "created_at": "2021-10-28T15:40:28.104000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "In Jan 2020, EIPIP working group was started with a goal to streamline the EIP process and that we educate people of the process so the EIP process can be decentralized and anyone who is interested, can contribute by following some guidelines. \n\nSince then, many community contributors (Ethereum client devs, EIP editors, and ECH) meet twice a month and discuss issues and potential solutions to the problems being faced in the process, especially around EIPs. These meetings are open and always announced on this channel.",
        "created_at": "2021-10-28T15:41:17.314000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "I am one of those contributors who showed up in almost every meeting and been a part of every discussion and hope it’s okay to share my thoughts on the topic of “Admin” access to EIP GitHub.",
        "created_at": "2021-10-28T15:42:16.695000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "I can’t imagine seeing the organizing in the process without people who took out time to be there and participated in discussion of their interest. We couldn’t thank enough to people who volunteered and showed up just to help out with the process, whether or not of their interest. And I’ve sincere respect for them.",
        "created_at": "2021-10-28T15:42:44.944000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "\"write access\" is a more correct term.  I think I used \"admin access\" above incorrectly a few times, I tried to edit them but I probably missed a few.  😖",
        "created_at": "2021-10-28T15:43:02.945000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "In the last meeting we discussed updating the EIP editors list and get permissions to the repo because it has been reset recently. And the general agreement came down to  “Micah Zoltu” and “Matt Garnett” having the “Admin” access for now. \nThough “Axic” has been back to eip editing work and started contributing more than it was a while ago, so he could be the next ideal candidate for getting the permission, if needed. \nAs we discussed in the meeting Greg could also be nominated for having the permissions if significant increase in contribution is observed.",
        "created_at": "2021-10-28T15:45:38.705000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "I'd request to take it with a grain of salt and we can always update the permission as needed.",
        "created_at": "2021-10-28T15:47:20.231000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "Please join us in the EIPIP meetings with any issue/concerns and we hope to come to a workable solution.",
        "created_at": "2021-10-28T15:48:41.299000+00:00",
        "attachments": null
    },
    {
        "author": "gregthegreek",
        "category": "Execution Layer",
        "parent": "",
        "content": "when are meetingS?",
        "created_at": "2021-10-28T16:13:53.741000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "every other tuesday 4:30 utc",
        "created_at": "2021-10-28T16:35:06.003000+00:00",
        "attachments": null
    },
    {
        "author": "gregthegreek",
        "category": "Execution Layer",
        "parent": "",
        "content": "is this a piblic thing or only for edditors?",
        "created_at": "2021-10-28T16:41:20.394000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "The next one is planned on Nov 03. Feel free to add items to agenda https://github.com/ethereum-cat-herders/EIPIP/issues/90",
        "created_at": "2021-10-28T16:59:18.745000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "Open to everyone.",
        "created_at": "2021-10-28T16:59:49.189000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "Recording of earlier meetings are available here https://www.youtube.com/playlist?list=PL4cwHXAawZxpLrRIkDlBjDUUrGgF91pQw",
        "created_at": "2021-10-28T17:00:44.703000+00:00",
        "attachments": null
    }
]