[
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "The debate about whether the EIP process is a change control process or a standardization process seems to be growing.",
        "created_at": "2021-05-07T10:04:39.439000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm getting more and more pushback from people who want it to be a change control process, rather than a standardization process.",
        "created_at": "2021-05-07T10:05:07.980000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "This usually surfaces as people want to include discussion, arguments, history, etc. in the EIP rather than keeping it focused on standardization.",
        "created_at": "2021-05-07T10:05:46.753000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think if we were to move to a reference specification with pull requests against it, the pull requests could be the change control process and the specification could be the standard.",
        "created_at": "2021-05-07T10:06:39.306000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "However, as we have discussed, that is a long way off right now and the pressure from EIP authors to use the EIP system as a change control process *today* is growing at a faster rate than we are approaching a unified reference specification.",
        "created_at": "2021-05-07T10:07:40.636000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think that is more in line with how the eth2.0-specs repo is organized? Although I'm afraid that the latter will also end up without a reference specification/implementation (as it's speccing incremental changes only for Altair)",
        "created_at": "2021-05-07T10:08:53.313000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "The long term goal is similar (but not exactly) like ETH2 specs.",
        "created_at": "2021-05-07T10:09:35.794000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "The idea is that we have a branch for mainnet that specifies mainnet by way of very readable/documented python code.  The different test networks would each have a branch specifying them as well, and people can open PRs against mainnet to propose and discuss specification changes.",
        "created_at": "2021-05-07T10:10:40.184000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Short term options:\n1. Give up on having EIPs be standards and pivot to having them be change control documents like some people want.\n2. Be firm and tell people if they want a change control process they should go design and build one.\n3. Greatly accelerate work toward a reference specification.\n4. Some other middle ground I'm not thinking of?",
        "created_at": "2021-05-07T10:11:04.392000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "cc \u003c@543900561460822016\u003e \u003c@552133098075193354\u003e to get the conversation started.",
        "created_at": "2021-05-07T10:22:50.743000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "Why do you feel the debate is \"growing\"?",
        "created_at": "2021-05-07T13:39:08.835000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "I suspect (4) is \"Slowly put together a change control process and harmonized Ethereum spec\"",
        "created_at": "2021-05-07T13:39:43.738000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e Although I'm afraid that the latter will also end up without a reference specification/implementation (as it's speccing incremental changes only for Altair)",
        "created_at": "2021-05-07T13:40:06.306000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's still possible to \"run the spec\" to execute post-Altair beacon blocks",
        "created_at": "2021-05-07T13:40:22.085000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "but realistically this will happen over, say, the next 12-18 months, not 3-6, because we'll probably end up \"doing the merge\" before the EIP + eth2 + upgrade specs is all harmonized 😅",
        "created_at": "2021-05-07T13:40:31.722000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Cross-layer",
        "parent": "",
        "content": "I would be in very strong support of a spec for Eth1 that mirrored the format of the eth2-specs.  I think it is something that could be done collaboratively and incrementally, but we'd need someone or some team to really *own* that process.",
        "created_at": "2021-05-07T13:43:37.661000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm not very familiar with that functionality the (executable) spec provides. I'm personally speaking more of  \"how does this part work\", and checking the spec to figure that out (and referring other people to it). It is very convenient to have all functions in one (possibly annotated) document like the Beacon Chain specs. With Altair (and later forks) changing some functions, updating, adding, or removing them, it becomes quite a bit harder to figure this out if there's no single coherent document anymore. I might have missed something though, or it may still be planned for a later date (like after the fork).",
        "created_at": "2021-05-07T13:55:14.739000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm getting more and more pushback from core developers on my Core EIP reviews.",
        "created_at": "2021-05-07T14:02:54.708000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Cross-layer",
        "parent": "",
        "content": "what kind of pushback?",
        "created_at": "2021-05-07T14:03:19.428000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "My reviews strongly push EIPs toward standards and away from change control documents.",
        "created_at": "2021-05-07T14:03:26.986000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "People wanting to include more discusionn, debate, arguments, history, etc. in EIPs.",
        "created_at": "2021-05-07T14:03:45.633000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think people really want a single document collects *everything* about a change (which is a reasonable desire).",
        "created_at": "2021-05-07T14:04:05.008000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "EIPs have historically been a standardization process though, which isn't really a great fit for that IMO, and managing a change control process is a bit harder and we are understaffed.",
        "created_at": "2021-05-07T14:04:37.201000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm pretty sure there  are \"releases\" which are easy to browse back to that version of the spec to find previous definitions of the protocol.",
        "created_at": "2021-05-07T14:11:32.989000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Cross-layer",
        "parent": "",
        "content": "That's the other way around, and sort of what I want I guess. From what I can tell, there is no single beacon chain spec document that includes all the Phase 0 functionality with the Altair changes applied.",
        "created_at": "2021-05-07T14:14:48.341000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "If you are curious about this contention, feel free to join the London Readiness call where it is coming up again.  🙂",
        "created_at": "2021-05-07T14:24:27.365000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "What concerns me with the current situation, and why I would like to find a short term solution, is that there are EIPs that are being blocked from moving forward (by me) because of this disagreement.",
        "created_at": "2021-05-07T15:06:13.496000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "So either I need to back down and stop curating the EIPs repository so diligently, allowing people to merge kinda whatever (from my point of view), or authors need to accept my unbridled authority and directional control over the EIPs repository.  😬",
        "created_at": "2021-05-07T15:07:31.561000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "If I back down, I think the long-term outcome is that quality of EIP will decline because the most likely strategy I'll switch to is to be less diligent about EIP quality overall.  The reason for this is because it is generally easy to \"let everything through\" or \"follow a very strict set of rules\".  It is *much* harder to do this sort of editing with a large amount of nuance and fuzzy rules, and I don't have the time for that (and I'm essentially the only EIP editor at the moment, with some help from lightclient from time to time).",
        "created_at": "2021-05-07T15:09:36.795000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Right now I follow the \"strict rules\" strategy, but these rules seem to be bothering EIP authors quite a bit lately.",
        "created_at": "2021-05-07T15:10:27.717000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "At the same time, I *don't* want the EIP process to be a hindrance to progress, and I feel like at the moment it is starting to become that for some people.",
        "created_at": "2021-05-07T15:11:13.702000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e \u003c@!364458974906548225\u003e \u003c@!543900561460822016\u003e I'm late to this party, but I can say that from way back EIPs were indeed intended as a pure standardization process, modeled on the IETF process.  Myself, \u003c@!191378736254287874\u003eand \u003c@!194433073394352129\u003e put a lot of effort into that, building on the work already done.\n\nCore EIPs amount to diffs on the Yellow Paper, which get applied after the fact by \u003c@!340233327258632194\u003esavers and others.  So the Yellow Paper is the spec, and I'd as soon see it remain the spec - improved, not superseded.  But that's just my opinion, and I don't see the Yellow Paper editors participating here.",
        "created_at": "2021-05-07T16:53:16.803000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks for that link to the Yellow Paper! I had no idea that it was kept up-to-date. I don't think the eth2.0-specs have an ever-updating spec like that (for now?).\nAlso interesting to see the much more mathy/computer sciency approach compared to the eth2.0 specs, although the executability of the latter (and its target audience) probably played a role there. Eventually makes sense to merge/unify the two approaches I think.",
        "created_at": "2021-05-07T17:07:16.420000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah, there have been a lot of discussions about having a re-write of the YP which follows the Eth2 specs format.",
        "created_at": "2021-05-07T17:09:24.514000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "I doubt we'd do the opposite, write Eth2 in a math-y YP format",
        "created_at": "2021-05-07T17:09:39.021000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "As for your main concern, \u003c@!301186049323958275\u003e I agree that's hard. It does feel like \"strict set of rules\" is not working perfectly for London, but I totally see how \"apply your best judgement\" makes a 20 min review become a 2h one.",
        "created_at": "2021-05-07T17:12:40.750000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also, reading the handful of EIPs which have been active lately, I see how the \"standard\" vs. \"canonical document\" conflict keeps arising.",
        "created_at": "2021-05-07T17:23:19.455000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "My hunch is _if_ we had a proper Eth1 spec which was actively maintained and approachable by core devs, we could have a model where the EIP is the standard only, and the PR to the spec adds the context, links, etc.",
        "created_at": "2021-05-07T17:24:25.276000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "My view is that core EIPs are frustrating to write and read because they constantly have to redefine the entire system they rely on it. I think if we can move the process to *any* system where we are actually producing a diff of specification is going to be better. I think the yellow paper is rather difficult to read, but producing diffs against it would be much clearer and avoid constantly redefining things.",
        "created_at": "2021-05-07T17:25:05.053000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "Until then, I don't know. I agree just lowering the bar all around is not great, but that may be less worse than (1) burning you out, (2) having endless debates on pre-merged EIPs and (3) not having _something_ to link.",
        "created_at": "2021-05-07T17:25:13.911000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm very much in camp 1). I think it has caused a lot confusion and I don't see how we are benefiting from it. Until we get to a point where we have a spec to diff against, I think we should allow EIPs to embody the idea just being a diff and a coordination tool.",
        "created_at": "2021-05-07T18:05:16.024000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Cross-layer",
        "parent": "",
        "content": "The Yellow Paper is absolutely required reading for anyone doing core development - it *is* the canonical specification of the Ethereum protocol.   It's widely cited in the popular and academic literature, referred to frequently by developers, and I think there is no going back.\n\nIt's badly presented, but the math itself is not that hard - pretty much just the algebra and set theory most of us learned in school.  Whereas Python is a computer language that many people - including me - can read badly if at all.\n\nSo. I would see a Python reference implementation as a very good thing to have, but don't see it becoming the canonical specification.\n\nBut I'm not volunteering to do the work, so this is only my opinion.",
        "created_at": "2021-05-07T18:51:26.467000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e It's badly presented, but the math itself is not that hard - pretty much just the algebra and set theory most of us learned in school.  Whereas Python is a computer language that many people - including me - can read badly if at all.\nPut me in the opposite camp 😉",
        "created_at": "2021-05-07T19:21:17.889000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Cross-layer",
        "parent": "",
        "content": "I just don't like to read Python 😉 \n\nSeriously, the necessary math isn't difficult - all it does, in essence, is describe a state transition function on sets of objects.  And mathematics is a long-established, widely-understood language.  That means that mathematicians,  logicians, cryptographers, computer scientists, engineers and others will be able to understand and maintain the specification for years into the future.  And we intend for Ethereum to last indefinitely. \n\nBut again, in the end someone has to do the work of creating an annotated  reference implementation before there is a choice to make.",
        "created_at": "2021-05-07T22:44:06.809000+00:00",
        "attachments": null
    }
]