[
    {
        "author": "poojaranjan",
        "category": "Cross-layer",
        "parent": "",
        "content": "Considering the Merge interop and less availability of meeting participants, the EIPIP meeting has been cancelled.",
        "created_at": "2021-10-06T12:34:50.117000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Cross-layer",
        "parent": "",
        "content": "The next meeting is scheduled for Oct 20, 2021 at 15:00 UTC.",
        "created_at": "2021-10-06T12:35:19.707000+00:00",
        "attachments": null
    },
    {
        "author": "gregthegreek",
        "category": "Cross-layer",
        "parent": "",
        "content": "Post-merge will core cover execution and consensus, or do we plan to categorize EIPs based on what they touch?",
        "created_at": "2021-10-06T14:41:02.250000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Is this correct?  It isn't the normal day or week (alternating) for EIPIP meeting?",
        "created_at": "2021-10-06T14:59:55.757000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks for pointing. It's 20th October, the next scheduled meeting.",
        "created_at": "2021-10-06T15:01:50.384000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'd be OK renaming \"Core\" to \"Execution\" and adding a \"Consensus\" category (or even having both as sub-categories of \"Core\" post-merge). My dream is that we use EIPs to describe changes at a high level, but keep the technical specs in https://github.com/ethereum/execution-specs/ and https://github.com/ethereum/consensus-specs/. I think it's a bit harder to talk about upgrades without EIPs (e.g. I wish Altair had 3 EIPs describing the 3 changes at a high level), and also think that EIPs tend to be a poor format to describe complex technical changes (as we saw with 1559). \n\nThen, we can just use branches on the specs: `main` == what's on mainnet right now, when we plan a new upgrade, we create a new branch (ex: `shanghai`). When an EIP is proposed for an upgrade, the author opens a PR against that branch, and when the EIP is included in the upgrade, the PR is merged. If the EIP is pushed back to the next upgrade, champions need to rebase on the \"new\" master.",
        "created_at": "2021-10-06T16:37:15.085000+00:00",
        "attachments": null
    },
    {
        "author": "gregthegreek",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thats actually quite elegant, my only concern is fragmentation of the information. If someone re-did the specs folders then it breaks every link",
        "created_at": "2021-10-06T16:56:06.305000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ahh, good point. Perhaps the EIP could instead link to the original PR (which should stay hosted on Github... although that's not 100% satisfying), so at the very least you can dig for the changes in the repo.",
        "created_at": "2021-10-06T18:26:12.482000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "Curious what \u003c@!689161464829050960\u003e thinks about this, as he's been leading the execution spec 🙂",
        "created_at": "2021-10-06T18:26:39.327000+00:00",
        "attachments": null
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Cross-layer",
        "parent": "",
        "content": "For complex technical changes, what do you think could be a viable alternative?",
        "created_at": "2021-10-06T18:42:29.537000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "Having the change as a PR to the spec, because we can clearly identify every impacted area vs. trying to infer it from a semi-spec, as in 1559",
        "created_at": "2021-10-06T18:46:54.672000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "I like parts of the EIP process as it stands now, but I dislike that it doesn't maintain a \"current\" version of the specification. You can only assemble mainnet as a series of diffs from frontier.\n\n---\n\nI think, going forward, we should treat EIPs as \"annotated diffs\" with two parts: the descriptive portion, and the technical portion.\n\nThe descriptive portion describes the motivation, security considerations, and such, as those sections are defined currently, and would be encoded into a markdown file inside the spec repo (maybe in an `eips/frontier` -style directory.)\n\nThe technical portion would literally be a diff against the relevant spec repo, and would be encoded as the actual changes in the commit.\n\n---\n\nAs for the actual repository/branching structure, I think it's pretty obvious that the default branch on GitHub (whether it's `main` or `master`, or whatever) should track mainnet.\n\nIt's tempting to track each hardfork as a branch, and proposed EIPs as PRs into the corresponding hardfork branch. The downside to this approach is that there's an information availability trade-off: either we merge EIP-PRs early, but lose the link between the technical portion and the descriptive portion as EIPs are edited; or we hold off on merging EIP-PRs until the EIP is final, but don't get overall picture of the hardfork's diff until _all_ the EIPs are final. I don't really have a better solution for this though.",
        "created_at": "2021-10-06T20:30:34.988000+00:00",
        "attachments": null
    }
]