[
    {
        "author": "timbeiko",
        "category": "Execution Layer",
        "parent": "",
        "content": "Generally agree with all of this 😄",
        "created_at": "2021-10-07T06:48:50.642000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e we hold off on merging EIP-PRs until the EIP is final, but don't get overall picture of the hardfork's diff until all the EIPs are final. \n\nTo be fair, I don't think we always have that now 😅",
        "created_at": "2021-10-07T06:49:44.153000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Execution Layer",
        "parent": "",
        "content": "Very true 😛",
        "created_at": "2021-10-07T16:34:01.390000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Execution Layer",
        "parent": "",
        "content": "One option I haven't really thought about is a super custom workflow, managed by a bot.\n\nFor shanghai, for example, you'd have a bunch of EIPs in branches with PRs into the `shanghai` branch, and the bot would maintain an up-to-date merged version for preview purposes.",
        "created_at": "2021-10-07T16:35:35.838000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e The technical portion would literally be a diff against the relevant spec repo, and would be encoded as the actual changes in the commit.\nCurrently the relevant spec is the Yellow Paper, and editing that is non-trivial.  Do we actually plan to replace the YP?",
        "created_at": "2021-10-07T19:54:56.494000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "That is my hope, that the execution specs repository replaces the YP.  Someone may keep it up to date altruistically, but my hope is that we move maintenance commitments to the execution specs repository.",
        "created_at": "2021-10-07T20:14:10.828000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "There has been much past discussion of replacing the YP, but nothing has come of it.",
        "created_at": "2021-10-07T20:16:03.597000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I'm optimistic this time around since we have great people actively working on writing an executable spec and making meaningful progress.",
        "created_at": "2021-10-07T20:16:26.125000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "Python?",
        "created_at": "2021-10-07T20:16:57.761000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Also, I am a bigger fan of the strategy being taken this time vs previous times.  I like a human readable executable spec over a provable spec (which I think is what was tried in the past).",
        "created_at": "2021-10-07T20:17:00.229000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Heavily documented python, yes.",
        "created_at": "2021-10-07T20:17:07.026000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "More specifically though, written in a way so as to prefer readability over utility.",
        "created_at": "2021-10-07T20:17:19.143000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "Damn.  I'm much better at English and math.",
        "created_at": "2021-10-07T20:17:39.549000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I would be fine with some other language, but the critical piece is leaving out optimizations and strongly preferring readability over performance.",
        "created_at": "2021-10-07T20:17:52.753000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Most code is (and all current Ethereum clients are) written with at least some amount of preference for performance, and often with a secondary goal of maintainability, with readability coming in third.  Unfortunately, maintainability often decreases readability.  When authoring code *specifically* for readability (as a specification), sometimes the trade-offs you make in terms of maintainability are different.  This requires much more testing and test coverage to get right, and changes are harder, but it can yield great benefits when it comes to readability, especially for casual observers.",
        "created_at": "2021-10-07T20:19:43.926000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "Sometimes the whole point of a change is performance.  Setting that aside, I know how to write technical English.  I have little skill at reading or writing Python.",
        "created_at": "2021-10-07T20:20:40.322000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "For most changes, I suspect the English part will still dominate.",
        "created_at": "2021-10-07T20:21:21.515000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "For many changes to Ethereum, the actual code change is quite small.",
        "created_at": "2021-10-07T20:21:31.325000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e Sometimes the whole point of a change is performance.\nFor consensus changes, we can still represent the behavior change regardless of *why* the change was made.  The key is that the executable spec is written to be readable, but it still **MUST** fully represent an Ethereum client and be able to pass the full consensus test suite.",
        "created_at": "2021-10-07T20:22:28.553000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "So my most recent EIPs are expressed mainly declaratively -- here are the rules valid code must follow.  I don't know whether Python is good for that.  Then there is an algorithm for checking the rules.  It doesn't matter what it is, just that there is one that can run in linear time.  I have it in Go now. First, because I need to test it in a real client for  correctness.  And second because I need to test it in a real client for performance.  To do that in Python I'd need to learn yet another computer language and how to work in yet another client.  And I fear any performance gains would not be apparent in such a slow language.  Pain for a demonstrable lack of gain.",
        "created_at": "2021-10-07T20:27:33.636000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "I guess I'd pretty much want to write them the way I do now -- English plus code for whatever client I tested the code in -- and let someone else translate to Python if the devs think it is worth doing.",
        "created_at": "2021-10-07T20:32:25.661000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I think that this is just a matter of finding a co-author.  I'm a big fan of collaborative EIPs and I think this could be a great opportunity for the apprenticeship program or people who are interested in contributing but aren't sure how to start.",
        "created_at": "2021-10-07T20:39:43.821000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e Know python, want to get into Ethereum?  Join #looking-for-group channel in the specs Discord server.",
        "created_at": "2021-10-07T20:40:15.077000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Then you can define the EIP (in English) and maybe write an initial implementation in Go, and someone with some Python background who wants to dip their toes into Ethereum can port that over to the spec.",
        "created_at": "2021-10-07T20:40:50.643000+00:00",
        "attachments": null
    }
]