[
    {
        "author": "brent.allsop",
        "category": "Cross-layer",
        "parent": "",
        "content": "The cat herders would like to help improve eips.ethereum.org.\nSorry to bother \u003c@!425279588009246720\u003e, again, but he is the only person I know of that could give us access to that.  I’ve sent him a Discord DM, and sent him e-mail but haven’t received a response.\nDoes anyone else have any ideas of who I might contact, to help improve eips.ethereum.org?",
        "created_at": "2021-03-04T19:33:32.651000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@!396163506757435403\u003e what are you interested in doing?",
        "created_at": "2021-03-04T19:34:19.794000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "the website template is all available in the EIPS repo and you are free to make any changes and put up PRs for those changes",
        "created_at": "2021-03-04T19:35:04.678000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e will review them within a few hours, and if somehow they slip through the cracks, i usually get to them after a week or two",
        "created_at": "2021-03-04T19:35:29.319000+00:00",
        "attachments": null
    },
    {
        "author": "brent.allsop",
        "category": "Cross-layer",
        "parent": "",
        "content": "Basically, there currently isn’t one canonical source of EIP information.  We’re trying to clean this up and make a single source of EIP info that is definitive, and easy to find.\nSome of the changes we’d like to make are quite significant.  For example, @Mica wants to pull the EIP meta information out of EIP 1, and move it into a page on eips.ethererum.org.\nSo, I’m thinking it would be a good idea to get more review, than just a few people, if only for a heads up about changes, like moving EIP-1, about to happen.\nTowards that end, I’m hoping there might be some kind of a staging version of eips.ethereum.org, on which we can put together a proposal, and make sure everyone is on board, with such significant changes, before doing a pull request for all that.\nIf there isn’t a staging system, I might be able to set one up, myself.\nWe’re putting together a proposal of what we want to do in this google doc:\nhttps://docs.google.com/document/d/1hUpMQh9gA5z3WSDvXKqU_CS6g3Y0hugJZHDYQdKxot8/edit?usp=sharing",
        "created_at": "2021-03-04T19:48:19.707000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "You can fork the EIPs GitHub repository, which is the source for eips.ethereum.org.",
        "created_at": "2021-03-04T19:55:25.516000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "You could also run a mirror of the website, though I don't personally know how to do that bit.",
        "created_at": "2021-03-04T19:55:45.389000+00:00",
        "attachments": null
    },
    {
        "author": "brent.allsop",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yea, that's what I'm thinking, if that doesn't exist, yet.",
        "created_at": "2021-03-04T21:48:30.014000+00:00",
        "attachments": null
    }
]