[
    {
        "author": "brent.allsop",
        "category": "Execution Layer",
        "parent": "",
        "content": "Yes, you guys are pointing out all the problems everyone is so aware of.  I believe there are solutions to all these problems.  You just need to get down to the first principles, then design solutions around those.\n\nI am working on a “Governance is the problem” paper, pointing out how we are all bread to work in hierarchical, authoritarian ways.  With hierarchies, it is all about focusing on what the “authority” at the top wants, and everything else is the enemy, to be consumed or destroyed.  “Governance” is where you say YES to one thing, and no to everything else, the same old win / loose game you find in all hierarchies.\n\nBut network-based bottom-up systems, like the internet, are different.  The internet just treats censoring or any “no” of any kind as failure, and routs around it.  Ether should work the same way.  If some governance is saying no, to what you want, you just find some other way to get it.  The goal of networks should be to find out what everyone wants and seek to get it all.  Win / Win.  If you are asking how do we get authority, or how do you do governance, you have already lost to the hierarchies.\n\nIt is not about governance, it is about consensus building.  You just need to build (and track) enough consensus, to get enough people/resources, to get what you want.  All problem become easy once you have enough people to work on it.  The only important moral issue is you want to make sure you don’t get in the way of what anyone else wants.\n\nDiscovering solutions to all these problems, along these bottom-up lines, is what we are working on at Canonizer.",
        "created_at": "2021-03-21T00:23:20.696000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003c@!687535760965894191\u003e I don't know that that 1559 is in fact being pushed through in the way you describe - I was (very snarkily) saying other proposals have been been scotched due their being controversial when there was less technical or economic reason for controversy than for 1559 -  which looked like politics to me.  And they were scotched _after_ we worked for years to reach consensus and published decisions to move ahead  - which looks like incompetence to me, \u003c@!396163506757435403\u003e. The result being chaos leading to more politics.  That 1559 keeps moving forward anyway does surprise me.\n\nAnd yes, my interpretation is biased by having gotten burnt a few times by all this.  But I don't think that a better EIP process, canonizer, or other such will help.\n\nAnd an aside that's too deeply philosophical to get into tonight - in this world win-lose is not always (probably not even often) necessary, but win-win is not always possible.",
        "created_at": "2021-03-21T03:15:28.605000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "And looking again today, I was beyond snark and into very harsh criticism.  Partly self criticism,  but even so ... my apologies to those who likely have taken offense.",
        "created_at": "2021-03-21T19:22:39.317000+00:00",
        "attachments": []
    }
]