[
    {
        "author": "margulus",
        "category": "Execution Layer",
        "parent": "",
        "content": "where can I find the github for eip-1559? Looking for more information into the code",
        "created_at": "2021-03-20T01:26:58.939000+00:00",
        "attachments": []
    },
    {
        "author": "margulus",
        "category": "Execution Layer",
        "parent": "",
        "content": "is this is? https://github.com/ethereum/EIPs/blob/master/EIPS/eip-1559.md",
        "created_at": "2021-03-20T01:28:41.371000+00:00",
        "attachments": []
    },
    {
        "author": "brent.allsop",
        "category": "Execution Layer",
        "parent": "",
        "content": "That's the eip, yea.",
        "created_at": "2021-03-20T01:29:00.775000+00:00",
        "attachments": []
    },
    {
        "author": "margulus",
        "category": "Execution Layer",
        "parent": "",
        "content": "ty \u003c@!396163506757435403\u003e",
        "created_at": "2021-03-20T01:29:32.653000+00:00",
        "attachments": []
    },
    {
        "author": "brent.allsop",
        "category": "Execution Layer",
        "parent": "",
        "content": "It looks like some people think there is going to be an ether split over 1559 and mining issues:\nhttps://dailyhodl.com/2021/03/17/crypto-trader-tyler-swope-predicts-ethereum-will-split-in-two-begins-buying-eth-over-bitcoin/\nWould it make sense to discuss ways we might be able to help avoid such in an eip ip, or cat herders meeting?",
        "created_at": "2021-03-20T01:33:06.532000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "This has been a major topic of discussion for a couple months now.  😄",
        "created_at": "2021-03-20T04:20:55.516000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "You can read the #1559-* channels in here if you want to follow along with the live discussion.",
        "created_at": "2021-03-20T04:21:32.826000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003c@!396163506757435403\u003e  I think we have set strong precedents that we should not move forward with controversial EIPs without the \"broad support\" of \"the community\", especially in the face of a threatened chain split.  Witness EIP-1057.  And that it's never too late in the process to back out of an EIP, no matter how much work or prior consensus has gone into it.  Witness EIP-1057 again, and EIP-2315.  Even if only one affected party has expressed any objections.  Witness EIP-2315, again.  (And these are just the ones that have hit me personally.)\n\nOn that basis I should think EIP-1559 would be dead in the water, but it appears to be unstoppable.\n\nI don't think there is anything the EIP editors or the Cat Herders by way of can do in the face of that much chaos, politics, and incompetence.\n\nBut it's the first day of spring, and clear and sunny here, and I've got a birthday party to go to.  So I'll leave Ethereum to its own self-destruction for now.",
        "created_at": "2021-03-20T14:54:28.840000+00:00",
        "attachments": []
    },
    {
        "author": "definitelynotcharles7176",
        "category": "Execution Layer",
        "parent": "",
        "content": "I don't think Micah's suggestion is great, as these channels don't illuminate the issues:\n\n\u003c#692078615269212180\u003e and \u003c#749160974506000444\u003e are basically \"dev\" channels, which in \u003c@!683653554631868440\u003e 's interpretation/narrative aboove, basically have devs pushing out the 1559, ignoring all contention.\n\n\u003c#798586271445680129\u003e  is a poor representation of the miner's perspective, unfortunately. \n\nBasically it's a bunch of \"miners\" whose skill set is converting their emotions into keystrokes on discord. \n\nTo get a sense of this, a young undergraduate student decided it wasn't worth their time to be in there.\n\nThis isn't due to design or bad faith of the mods, but basically the channel serves as a sort of live-action strawman. \n\nEvery few days or people go in and get entertainment from mocking the hapless people in there. As someone who financially benefits from mining revenue,  me and others are annoyed these \"miners\" probably skunked progress toward fee burn mitigation.",
        "created_at": "2021-03-20T19:01:33.613000+00:00",
        "attachments": []
    }
]