[
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I would prefer a new system, as I see the EIP process as a standardization process, and a design document is not a standard but more like documentation.  I'm generally not a fan of \"using EIP process because it already exists\", and would rather build a process that is specific to our needs.",
        "created_at": "2022-07-02T04:34:48.920000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "I understand. You have a much more constrained view of things than I do.  My take is that \n* establishing a new process is much harder than evolving an existing one\n* maintaining design documents has a big editorial component\n* design documents are going refer to a set of EIPs anyway\n* the EIP number sequence is well engrained by now",
        "created_at": "2022-07-02T14:00:11.362000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "If we had an abundance of EIP editors I think I would be inclined to agree more.  My issue is that it is easy to just shove new work on a group who is already overtaxed, but that isn't a healthy long term solution.  By spinning up a new process, it forces people to think about and solve the editorial problem.",
        "created_at": "2022-07-02T14:02:11.121000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "If we just bend an existing process, it is easy to just pretend that the manpower will magically expand to handle the new load.",
        "created_at": "2022-07-02T14:02:46.955000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "We need to leverage peer review and to take the load off.",
        "created_at": "2022-07-02T14:03:22.199000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "(hint: manpower won't magically expand, and too much expansion will likely lead to a contraction in manpower as people quit from burnout as we have seen in the past)",
        "created_at": "2022-07-02T14:03:27.059000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "This has been explored in a few places, but -- the bot could be changed to not reject drafts with misspelling, just provide report.  But reject Drafts that don't fit basic formatting issues.  Most of the time no human needed to get things in as Drafts.\n\nAND a Draft somehow should (must?) have a Magician(s) to volunteer as a peer reviewer to work with the authors.  Then the main task of the Editors is coming to consensus that a draft is ready for status changes -- to Review, Last Call, and Final.",
        "created_at": "2022-07-02T14:12:40.474000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Teaching the bot to do things requires work, which is precisely what we are short on.",
        "created_at": "2022-07-02T14:13:14.265000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "I understand.  Of course once taught it saves work.  We can also allow Drafts to have more problems at first -- with only warnings for most things .  I think that means a simpler bot-- and deal with them later.\n\nMost important point is that editors are taking on too much work.  Like academic journals we need to push that work onto peer reviewers.  The Magicians exist for that explicit purpose.",
        "created_at": "2022-07-02T14:18:01.927000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "By the time a proposal gets to an IETF editor I think much of what we are trying to do is already done.",
        "created_at": "2022-07-02T14:19:29.409000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "As for the top level design documents, an alternative:  It is common to maintain a single living document that explains and specifies an entire system.  A good example is the Wasm repo, which holds both the formal specification and the reference interpreter.\nhttps://github.com/WebAssembly/spec",
        "created_at": "2022-07-02T14:56:48.336000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "I'd love to see the reference client presented as a document in the form of Knuth's Literate Programming.  \u003c@689161464829050960\u003e \nhttps://en.wikipedia.org/wiki/Literate_programming\nThis document, or collection of documents, could serve as the design document and top-level spec, and could subsume the relevant EIPs by reference.",
        "created_at": "2022-07-02T16:22:27.528000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "https://nbdev.fast.ai",
        "created_at": "2022-07-02T17:07:05.405000+00:00",
        "attachments": null
    }
]