[
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "The file name was originally missing the .md extension, not sure if that is related.",
        "created_at": "2022-07-17T04:40:06.066000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "The commit it checked out was `d768349edc60fa38c0c4d3b66fcee3602fb1a083`, but the latest commit from the PR was `15da963a87310a6bee2ff5291f1d607d4897e336`.\n\n`d768349` is from a completely different PR.",
        "created_at": "2022-07-17T05:59:56.567000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Instead of pulling from the pr, it's pulling from the base branch... so either we can comment but don't get the correct pr, or we get the correct pr and can't comment.",
        "created_at": "2022-07-17T07:53:54.584000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "I put up a revert to get back to useful lints for now.",
        "created_at": "2022-07-17T07:54:11.170000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "What you are saying doesn't make sense to me.",
        "created_at": "2022-07-17T08:57:05.137000+00:00",
        "attachments": null
    },
    {
        "author": "hrkrshnn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Re EIP-5000: I do admit to using a script that used the Github API to submit the PR once 4999 was available. This is something entirely my doing, and axic and chfast were not involved in this. However, the adjoining spam was unrelated to this, and I had nothing to do there.\n\nIn the end, I disagree with the renumbering: The EIP-1 does not forbid 'sniping', nor is there a precedent here (No merged EIP was renumbered due to sniping: see https://gist.github.com/hrkrshnn/9417b2f9d1ecc4365e39db3ec13a7513 for some data). There is a conflict of interest with Sam and 5000--he admitted to wanting 5000 for one of his own EIPs.",
        "created_at": "2022-07-17T09:58:15.306000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Normally we tell the author \"no\" before merging the draft, as Sam did.  The problem here is that lightclient and the authors (unclear which of you) made some kind of private deal to overrule Sam's comment and the defacto policy of disallowing sniped numbers.",
        "created_at": "2022-07-17T13:25:47.583000+00:00",
        "attachments": null
    },
    {
        "author": "hrkrshnn",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e Normally we tell the author \"no\" before merging the draft\n\nIf the data above is correct, no merged EIP was renumbered due to sniping so far.\n\n\u003e the defacto policy of disallowing sniped numbers. \n\nThis policy is not documented in EIP-1, nor is it  enforceable. What is the minimum amount of time that has to pass between two issues for the second one to be not considered 'sniping'?\n\n\u003e made some kind of private deal to overrule Sam's comment\n\nThere were no private deals made here.",
        "created_at": "2022-07-17T13:41:36.626000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "See https://discord.com/channels/595666850260713488/746566142700814426/997128214298234901",
        "created_at": "2022-07-17T13:43:39.019000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "We have rejected many author attempts at number sniping in the past, and all of the editors know this which is why Sam told you no when you first submitted the EIP.  The problem here is that this EIP was given special treatment (for some reason), and one of the authors is an editor and the special treatment was agreed to in a private discussion (not public discussion like other authors who try to appeal).  The EIP process **must** remain credibly neutral first and foremost because it is a core part of the Ethereum governance process.  Even if everything that happened was completely innocent, the public record (which is all we have to go by) paints a pretty disturbing story that significantly damages the credible neutrality of the EIP process.",
        "created_at": "2022-07-17T13:47:46.679000+00:00",
        "attachments": null
    },
    {
        "author": "hrkrshnn",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e We have rejected many author attempts at number sniping in the past, and all of the editors know this which is why Sam told you no when you first submitted the EIP.\n\nAgain, no evidence of an EIP in eips.ethereum.org that was renumbered due to sniping. Lack of precedence, and an ill-defined problem overall--should one wait an hour from the previous issue before it's sniping? Is the GitHub's centralized UI the only way to submit a proposal? \n\nThere were also no private deals here. I did have a real life conversation with lightclient about `muldiv`, among other things. If you are comparing this to 'corruption in governments', 'attack', and 'bullying', you need concrete evidence of these 'deals'. If anything, it looks like the editors samwilsn and pandapip1 were bullied by you into approving https://github.com/ethereum/EIPs/pull/5255 as evident by their initial disagreement with your proposal, and eventual approval after your insistence.",
        "created_at": "2022-07-17T14:17:00.486000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "See https://github.com/ethereum/EIPs/pull/5222#pullrequestreview-1035115671 for a recent renumbering.  This is a recent one (this week), but this happens pretty regularly as number sniping is not at uncommon and if you dig through history you'll find a bunch.",
        "created_at": "2022-07-17T14:56:47.169000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Credible neutrality is all about perception.  What *actually* happened behind closed doors doesn't matter.  What matters is that the defacto rule we (editors) have about disallowing number sniping was not followed for this EIP while it is followed for many others, and the reasoning and discussion around it was not held in a public place.  You can claim all you want that nothing sketchy happened behind the scenes, but what matters is whether or not the process *appears* to be captured or not.\n\nA process can be neutral, but not *credibly* neutral if external people looking in on the system cannot tell whether it is neutral or not.  Similarly, a process can be credibly neutral while not actually being neutral if one can manage to hide corruption well enough.  We want the EIP process to be both actually neutral and credibly neutral.  At the least this event tarnishes the credibility of our neutrality, at the most it indicates a failure of actual neutrality (e.g., if you were given 5000 because you know lightclient in real life and were able to persuade him in a way that most authors cannot).",
        "created_at": "2022-07-17T15:06:51.336000+00:00",
        "attachments": null
    },
    {
        "author": "hrkrshnn",
        "category": "Cross-layer",
        "parent": "",
        "content": "1. This is a ridiculous example: how is this number sniping? It was made 3 hours 25 minutes after the issue 3221--which coincidentally was opened by another editor. This keeps on showing how these unwritten-rules are so arbitrary.\n2. I've the data on eips.ethereum.org: and none of them indicates a renumbering due to sniping: https://gist.github.com/hrkrshnn/9417b2f9d1ecc4365e39db3ec13a7513 Bringing up new/unmerged and currently open PRs is not adequate precedent.\n2. This seems to showcase an even more dangerous issue here: there is the proposal to auction off EIP numbers: while I'm indifferent to the proposal, all these seem to give the perception that some editors are trying to earmark numbers that they want to be auctioned off in the future. Coincidentally, the number 5000 is also mentioned in the proposal. https://github.com/ethereum/EIPs/issues/5082",
        "created_at": "2022-07-17T16:34:01.472000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Why does your script skip issues?",
        "created_at": "2022-07-17T16:39:57.863000+00:00",
        "attachments": null
    },
    {
        "author": "hrkrshnn",
        "category": "Cross-layer",
        "parent": "",
        "content": "I can try to analyse issues as well.",
        "created_at": "2022-07-17T16:41:39.955000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "The `GITHUB_SHA` environment variable specifies the hash that `actions/checkout` clones from git.\n\nWith a `pull_request` trigger, `GITHUB_SHA` contains the latest commit from the pull request's source branch. Also with `pull_request`, the authentication token only has read-only permissions.\n\nWith a `pull_request_target` trigger, `GITHUB_SHA` contains the latest commit from the pull request's target branch. With `pull_request_target`, the authentication token has read-write permissions.",
        "created_at": "2022-07-17T16:42:12.552000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "I have also been somewhat concerned about the apparent conflict of interest between militantly preserving vanity EIP numbers, and the proposal to sell them.",
        "created_at": "2022-07-17T16:46:55.844000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "The militant opposition to EIP sniping came first, the sale was an idea to address the problem in a way that makes everyone happy.",
        "created_at": "2022-07-17T16:47:48.143000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "So your script looks at the file name, and checks to see if the file name matches or doesn't match a PR?",
        "created_at": "2022-07-17T16:48:06.104000+00:00",
        "attachments": null
    },
    {
        "author": "hrkrshnn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah, fetches all ids from eips.ethereum.org, checks the issue and see if you can parse the file name and if the ids mismatch. For example, for 5222, the script will tell you there is a mismatch.",
        "created_at": "2022-07-17T16:49:08.668000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Two further points:\n\nI don't personally think there's anything wrong with preserving vanity numbers to sell them, I'm just worried about optics.\n\nI don't believe that you, \u003c@301186049323958275\u003e, being militantly opposed to sniping has anything to do with raising more money through the sale of numbers.",
        "created_at": "2022-07-17T16:49:47.548000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Well, the actual order was:\n1. People spamming the repository to snipe numbers.\n2. Editors following a flexible numbering strategy to override the defacto strategy when necessary.\n3. People continuing to try to sneak past the censors and snipe numbers.\n4. More aggressive anti-number sniping and discussions about how to deal with the problem.\n5. Proposal to sell EIP numbers so people who want \"special\" numbers can get them, and we can use the proceeds to hire additional help to combat spam and generally provide better service.\n6. More number sniping, and the first known successful petitioning of an editor to get away with a known snipe of a number.",
        "created_at": "2022-07-17T16:50:33.505000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Interesting. Besides 5222, I only remember one other EIP that was renumbered. I haven't been here that long though.",
        "created_at": "2022-07-17T16:51:44.733000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "Cross-layer",
        "parent": "",
        "content": "About the optics part: if Micah is concerned about the optics of corruption, this should actually be a massive concern. Editors being arbitrarily harsh about obviously non sniped numbers like 5222 combined with the sale easily give bad optics",
        "created_at": "2022-07-17T16:52:13.535000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I am pretty confident I have done it a few times at least.",
        "created_at": "2022-07-17T16:52:16.163000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "_is a strong proponent of not picking an EIP number until the merge commit is created._",
        "created_at": "2022-07-17T16:52:58.056000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "What would that change?",
        "created_at": "2022-07-17T16:53:37.545000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's much harder to control when an editor approves and the bot happens to run vs. the sequential issue number from GitHub",
        "created_at": "2022-07-17T16:54:11.361000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "How would the number be selected?",
        "created_at": "2022-07-17T16:54:37.950000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@301186049323958275\u003e you're not the one who renumbered 5222 but you defended it",
        "created_at": "2022-07-17T16:54:39.811000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "_left as an exercise to the reader_ 🤣",
        "created_at": "2022-07-17T16:54:59.400000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "Cross-layer",
        "parent": "",
        "content": "That renumbering was completely arbitrary plus accused the poor authors of sniping even though there was zero evidence of it. That was basically bullying",
        "created_at": "2022-07-17T16:55:23.843000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "IMO it is less obvious to me that editors utilizing a scarce resource that they have to raise funds to actually pay people to do a job that is currently purely volunteer is not credibly neutral.  I can kind of see the argument, but I think it is fairly weak.",
        "created_at": "2022-07-17T16:55:45.006000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Completely arbitrary -\u003e allowed\nImplying sniping -\u003e ehhh, probably unnecessary IMO",
        "created_at": "2022-07-17T16:55:56.020000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "For example, if we just asserted that \"any number that is purely sequential, or a palindrome, or has two numbers in a row is not automatically assigned\" I think that would be a reasonable and credibly neutral policy.",
        "created_at": "2022-07-17T16:56:52.850000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "If I want to assign an EIP the number `2**256-1` I think I'm allowed, rules as written 😛",
        "created_at": "2022-07-17T16:56:53.971000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I would politely request that you don't do that and you discuss with the other editors before going *that* far astray from our usual pattern.  😬",
        "created_at": "2022-07-17T16:57:27.362000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Who exactly spammed the repo?",
        "created_at": "2022-07-17T16:58:31.105000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "If that is credibly neutral, then it is a small step to \"if an editor thinks your number looks special in any way, they can assign a different number\".  I can appreciate that is *slightly* less credibly neutral (anything that isn't autonomous is less credibly neutral) but as long as we apply the rule to everyone equally then I think we can maintain almost all credible neutrality.",
        "created_at": "2022-07-17T16:59:09.397000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Spammers.  They are usually bot accounts, not people's real accounts.  For example, 4998 and 4999 were both spam issues/PRs (I forget which) that have since been deleted, and 5000 was sniped in the same minute that 4999 was created (which was within a minute of 4998).",
        "created_at": "2022-07-17T17:00:13.472000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "We cannot, of course, assert whether the author of 5000 was also the spammer or just waiting for 4999 to be taken with a bot and then quickly submitted the PR automatically, but if we allow that behavior then the obvious strategy here for number sniping is to run a spam bot to drive the number up to where you want and then snipe it and claim that you didn't run the bot.",
        "created_at": "2022-07-17T17:01:29.538000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "You can do a bit to obscure that, like running the bot for a bit *after* your snipe so it isn't totally obvious, or only run the bot for a small number of issues.",
        "created_at": "2022-07-17T17:02:19.060000+00:00",
        "attachments": null
    },
    {
        "author": "hrkrshnn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Issues 2531 until 2534 were spam created by a top 10 contributor to the repo (in commits).",
        "created_at": "2022-07-17T17:02:53.372000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Diamond was spammed by the author himself and still got the number",
        "created_at": "2022-07-17T17:03:35.512000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "Cross-layer",
        "parent": "",
        "content": "And that's a provable spam. 5000 and 5222 are not even close to that",
        "created_at": "2022-07-17T17:04:01.655000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "We don't catch everyone.",
        "created_at": "2022-07-17T17:04:09.022000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "I am just baffled with the process and discussions here, and really confused by the motivations. Want to first and foremost, with the strongest tone, reject the stark accusations made here about any of the EIP authors performing an \"active attack\".\n\nI don't care about EIP numbers much. I do care about the direction this group is heading, and I am really worried about the direction.\n\nAs a side-note, https://github.com/ethereum/EIPs/pull/5270 is suggesting renaming to \"5159\", which actually is a number used by something else already (https://github.com/ethereum/EIPs/pull/5159). It seems the point here is to cause disruption and to make a point, at all costs.\n\nAdditionally this \"5159\" number seems to be selected on the basis that search engines would show \"1559\" instead of it (https://discord.com/channels/595666850260713488/746566142700814426/997141344294281286). The goal seems to be making the proposal obscure and forgotten. Is the aim for personal \"punishment\" more important than improving Ethereum?\n\nAlso refuting the claim of it being \"advertised\". Tweeting once, without even referring to the number beyond the URL (as that cannot be avoided), is far from advertising using the number.",
        "created_at": "2022-07-17T17:04:12.057000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Which is why I argue we need to be more harsh when we *do* catch people.",
        "created_at": "2022-07-17T17:04:17.516000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "5159 isn't an EIP, which is all that matters for a valid alternative number.  That was just a PR someone submitted to make a change to an existing EIP.",
        "created_at": "2022-07-17T17:05:30.938000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "Potentially the editors have changed opinion and are willing to issue EIP numbers which were used as an issue or PR, but *did not create an EIP*. This may be the decision reached by the group, but I think it is a bad direction to go.",
        "created_at": "2022-07-17T17:05:38.920000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "When the numbering scheme was designed, it was clear that one could find the original PR by just going to the number.",
        "created_at": "2022-07-17T17:06:09.907000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "This will cease to be the case and people will be directed to random content if conflicting numbers are assigned.",
        "created_at": "2022-07-17T17:06:23.723000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "And then people started spamming and sniping to get special numbers.",
        "created_at": "2022-07-17T17:06:31.940000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "Do you have a list of spamming, and a separate list of \"confirmed sniping\"?",
        "created_at": "2022-07-17T17:06:49.092000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is considered very acceptable.  You can look at GitHub history quite easily, and it doesn't really matter.",
        "created_at": "2022-07-17T17:06:53.736000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "And also define what sniping means?",
        "created_at": "2022-07-17T17:06:53.931000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "5000 was sniped, already admitted to by your co-author above.",
        "created_at": "2022-07-17T17:07:03.064000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "I want to be on the same page understanding the term.",
        "created_at": "2022-07-17T17:07:20.619000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "2535 was spammed and sniped (I think maybe before my time, or I missed it).",
        "created_at": "2022-07-17T17:07:34.191000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sniped meaning you sit around waiting for `next-eip-number` to be the one you want and then you quickly swoop in to create your EIP so you get that number.",
        "created_at": "2022-07-17T17:07:59.435000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sniping means posting a pull request with the intent to snag a particular issue number.",
        "created_at": "2022-07-17T17:07:59.605000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "You are correct, 5159 is intentionally chosen as punishment in order to regain credible neutrality since 5000 was acquired through sniping and private petitioning and against the suggestion of another editor in public.",
        "created_at": "2022-07-17T17:10:06.736000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "Can you explain objective issues with this? Assuming the persons are not disrupting the process spamming?",
        "created_at": "2022-07-17T17:10:27.045000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "It incentivizes spamming.",
        "created_at": "2022-07-17T17:10:47.400000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "Do you have this data?",
        "created_at": "2022-07-17T17:11:04.237000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "No, we don't keep track of it because historically all of the editors have agreed (more or less) on this topic and have followed the same set of loose rules.",
        "created_at": "2022-07-17T17:11:35.407000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "Can you remember at least 2 cases for each?",
        "created_at": "2022-07-17T17:11:55.684000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "2525 was brought up above as an example of both spamming and sniping.  5000 is spamming and sniping (though the author claims it they were not the spammer, but we cannot verify this claim).",
        "created_at": "2022-07-17T17:12:26.962000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "If someone wants to dig through history you will find more I think, only a few hundred EIPs to look at history for and the script above should help narrow the scope.",
        "created_at": "2022-07-17T17:12:55.186000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "Cross-layer",
        "parent": "",
        "content": "I find it quite problematic that you keep implying that the authors also spammed it, especially when connected to your apparent wish to be a dictator",
        "created_at": "2022-07-17T17:13:21.439000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I am stating that the fact that we can't know is *exactly* the problem.",
        "created_at": "2022-07-17T17:13:43.035000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's a quite serious accusation imo, which you don't seem to have any intention of actually finding the correct information",
        "created_at": "2022-07-17T17:14:17.011000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm not accusing, I'm stating we cannot know so we have to design incentives around that fact.",
        "created_at": "2022-07-17T17:14:35.995000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Innocent until proven guilty",
        "created_at": "2022-07-17T17:14:47.338000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "It doesn't matter _who_ is spamming, allowing sniping creates an incentive to spam.",
        "created_at": "2022-07-17T17:14:54.334000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Dictators might indeed go around that",
        "created_at": "2022-07-17T17:15:07.174000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "* We cannot know *who* a spammer is if they use a new account.\n* Creating a GitHub account is quite cheap/easy.\n* If someone wants to snipe a number they can create a new GH account, spam, and then snipe the number they want.\n* By disallowing \"special\" numbers, we disincentivize the spamming behavior (which we know people will do to get a number).",
        "created_at": "2022-07-17T17:15:48.777000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "If we were using violence to enforce our rules, I'd agree with this principle, but since all that is at stake is a handful of digits, I think we can allow more false positives 🤣",
        "created_at": "2022-07-17T17:16:15.578000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes, the general premise here is that if *nobody* gets a special number then we don't have to worry about people spamming to get special numbers.",
        "created_at": "2022-07-17T17:16:46.032000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Even when there's zero evidence like in 5222?",
        "created_at": "2022-07-17T17:16:48.974000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "What is your criteria of \"special number\" because it is not stated anywhere in EIP-1. One may find that a lot of numbers can have special meaning to people.",
        "created_at": "2022-07-17T17:16:59.405000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "You could have the bot hold a counter and whenever an maintainer approves an EIP, the bot chooses the current counter number or the next one. So even if maintainers collude, they have a 50% chance of getting a particular number.",
        "created_at": "2022-07-17T17:17:14.242000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "It is intentionally vague to prevent gamification.  I *personally* do a bit of digging if I see a palindrome multiple consecutive digits, or repeated pairs.  I have some other criteria that I choose not to share specifically to prevent people from gaming the number selection process which is defined as \"Editors pick the number\".",
        "created_at": "2022-07-17T17:18:19.724000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah, there's a ton of options for that. You could even just pick a random `N` digit number, and re-roll on collision. If it's done at merge time, there's no way two Pull Requests will collide (unlike picking randomly when the PR is created.)",
        "created_at": "2022-07-17T17:18:50.939000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "We have discussed changing the way number selection works, but up until today our existing strategy was super simple and worked well.",
        "created_at": "2022-07-17T17:18:59.769000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Given that all EIP editors are volunteer and we already have way more work than time, we have opted to go with \"simple\" rather than \"good\".",
        "created_at": "2022-07-17T17:19:40.661000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "I thought that the sequential property was desired? Since it implies that one EIP came before another?",
        "created_at": "2022-07-17T17:19:50.949000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Tim likes it for that, I don't personally care about sequentiality.",
        "created_at": "2022-07-17T17:20:15.284000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Maybe we go with a `eip-yyyy-mm-dd-x.md` naming scheme lmao",
        "created_at": "2022-07-17T17:20:27.724000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "(also don't change the numbering format, I just wrote a bunch of lints for it.)",
        "created_at": "2022-07-17T17:20:49.602000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "With time of merge as the date?  Given how slow EIP editors are to merge, this would definitely address the problem.  😛",
        "created_at": "2022-07-17T17:20:52.330000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "Btw \u003c@301186049323958275\u003e, could you explain how happened that your retained force-merge rights, but every single EIP editor got it revoked without notification in 2021?",
        "created_at": "2022-07-17T17:20:55.202000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Lightclient and I both have them.  The idea was that we were (at the time) the most active editors and a security best practice is to *not* give privileges to everyone if you don't need to.",
        "created_at": "2022-07-17T17:21:48.767000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "That was one point which made me consider that the EIP editorship has some people as \"more equals\", and pushed me to the side of reducing my workload.",
        "created_at": "2022-07-17T17:21:51.031000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "As a counterpoint, I've had to explicitly reject getting write-access to the repository.",
        "created_at": "2022-07-17T17:22:50.985000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "Security best practices may dictate that, but courtesy with the editor group would have dictated a discussion, but at the bare minimum notifying other editors about this \"behind the door\" discussion.",
        "created_at": "2022-07-17T17:22:53.557000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Several times",
        "created_at": "2022-07-17T17:22:55.790000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "You have passed up lightclient recently for contribution rate, so we may force it on you.  😆",
        "created_at": "2022-07-17T17:23:15.299000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "There was discussion, in the meetings that lightclient and I regularly attend and many of the others who were removed don't attend.",
        "created_at": "2022-07-17T17:23:38.260000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "(this was at the time the decision was made, now more editors attend which is good)",
        "created_at": "2022-07-17T17:24:06.969000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think that is a bad excuse. Notifying other editors here, prior to the decision, would have been a burden?",
        "created_at": "2022-07-17T17:24:30.514000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "I have just brought this point up, because it shows there are some weird dynamics here.",
        "created_at": "2022-07-17T17:24:59.362000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm not sure why you are bringing this up now.  Greg brought it up quite a while ago and we engaged with him at the editor meetings and in here quite a bit on the subject.  It feels entirely unrelated to the discussion at hand regarding number sniping, spammers, and PR 5000.",
        "created_at": "2022-07-17T17:27:19.534000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "If your thinking that I'm trying to take over the EIP process and PR 5000 is somehow related to that, it is probably worth a reminder that I have been actively seeking someone to replace me for quite a while, and have been advocating heavily to reduce the scope of the EIP process as much as possible and transfer most of the content I care about to new locations (like the executable specs repository and JSON-RPC specs).",
        "created_at": "2022-07-17T17:29:07.389000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "I am not sure what to think, but there are various things happening in EIPs which I find curious.",
        "created_at": "2022-07-17T17:30:00.882000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I only do EIP editing because I care about Ethereum, I care greatly about it remaining credibly neutral (non-compromised/captured governance and no appearance of capture) and no one else has stepped up to the task sufficiently for me to walk away and be confident things will continue to get done.",
        "created_at": "2022-07-17T17:30:15.034000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "We do have some new editors that have really helped a lot, and I'm optimistic that I can walk away \"soon\".  😬",
        "created_at": "2022-07-17T17:30:45.515000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I strongly encourage you to come to the EIPIP meetings and engage more here.  That is the best way to both understand why we do what we do, and to influence the path taken.",
        "created_at": "2022-07-17T17:31:58.273000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "I have stated since they started that it is in conflict with my other meetings.",
        "created_at": "2022-07-17T17:32:13.227000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hmm, I don't remember that.  We might be able to move it to another day though.  I recommend talking to Pooja about that.",
        "created_at": "2022-07-17T17:32:44.972000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "To be honest, my motivations levels have plummeted especially since the tone of these accusations.",
        "created_at": "2022-07-17T17:33:18.688000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "To the point that I am not even sure anymore this is the right community for me trying to submit EVM improvements to.",
        "created_at": "2022-07-17T17:34:02.079000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "If you tell me that you weren't engaged in the number sniping, nor were you engaged in the spam, nor were you aware of the private petition to keep number 5000 I'll believe you.  It doesn't change anything in my eyes though because the issue here is in the credibility of our neutrality, and since your name is still on the editors list the standard needs to be set very high (above reproach) for EIPs you are an author on.",
        "created_at": "2022-07-17T17:34:57.993000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "The point here being that it doesn't matter if *I* believe you.  What matters is what a third party who doesn't know you or your motives thinks when they see visible behaviors (like your name on editor list, and your name on an EIP that received special treatment).",
        "created_at": "2022-07-17T17:35:51.797000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think what you wrote kind of feels like what a prosecutor and a judge would say 😅",
        "created_at": "2022-07-17T17:39:38.820000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "If by that you mean it is dispassionate, then that is the intent.  The goal here is to try to ensure that Ethereum governance (and by extension the EIP process) remains credibly neutral, regardless of my feelings on the matter or my connection with any of the parties involved.",
        "created_at": "2022-07-17T17:47:45.429000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Cross-layer",
        "parent": "",
        "content": "I mean it in a way where the trial is only held by the prosecutor and a judge, without anyone else on the accused's side.",
        "created_at": "2022-07-17T17:50:13.400000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Cross-layer",
        "parent": "",
        "content": "https://github.com/ethereum/EIPs/pull/5255#issuecomment-1186534390",
        "created_at": "2022-07-17T21:10:23.011000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Cross-layer",
        "parent": "",
        "content": "I've lost track of all of this, but would like to acknowledge that everyone has reasons to be upset, and then just drop it with the understanding that we need to do a better job of reaching consensus before acting and that we need to stay civil.",
        "created_at": "2022-07-17T21:26:44.860000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Cross-layer",
        "parent": "",
        "content": "On the issue of PR numbers, they should simply be the PR number of the first Draft.  The only reason an editor should need to set them is if a bot can't.  And even then the editor has to use a PR# to maintain a *chronological* sequence of numbers *without duplicates*.  Making sham PRs to get to a nice number is obviously not OK.  (Keeping things chronological also precludes selling off unused numbers from the past.)",
        "created_at": "2022-07-17T21:27:03.410000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e Making sham PRs to get to a nice number is obviously not OK\n\nThat is not what happened, both in 5000 and 5222.",
        "created_at": "2022-07-17T21:32:17.607000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm not talking about what happened.  I'm suggesting a  strong and simple policy to prevent problems going forwards.",
        "created_at": "2022-07-17T22:05:18.927000+00:00",
        "attachments": null
    }
]