[
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "What do you think we should do when people do spam the repository to get a desirable number?  What do you think we should do when people engage in not-quite-spam tactics to get a desirable number (like submitting unrelated but not entirely spam PRs to drive the number up)?",
        "created_at": "2022-07-18T06:00:07.189000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "Use policy (and a bot?) to prevent the problem happening in the future and move on.  We Editors have survived far more consequential battles.  Thus the bot in the first place.",
        "created_at": "2022-07-18T06:04:21.106000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "If we automate the checks, people will just figure out ways to game them.  For example, if you disallow PRs within `n` minutes of a previous PR/issue, then people will just set their spam bots to wait `n` minutes.  If you disallow people from submitting multiple PRs in a row, they will just use multiple accounts.",
        "created_at": "2022-07-18T07:02:33.913000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I don't think there is any specific policy we could come up with that cannot be gamed, which is why I favor the vague policy of \"editors pick the numbers, not the authors\" and then we trust editors to block any *perceived* attempts at sniping/spamming/gaming (it doesn't really matter if they are actual attempts, since false positives are not a problem as it just means someone gets a number other than the PR).",
        "created_at": "2022-07-18T07:03:54.068000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Of course, that suffers its own problems as editors can choose when to enforce the policy and when not to, which is the failure that occurred here.  The standing policy of not allowing sniping/gaming was overridden by an editor because of what appears to be favoritism for the authors.",
        "created_at": "2022-07-18T07:06:01.698000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "So either we create a strict policy that prevents editors from playing favorites but enables authors to game the system, or we create a loose policy that allows editors to play favorites but prevents authors from gaming the system.",
        "created_at": "2022-07-18T07:07:05.556000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Up until this incident, we had been going with the latter and it was working well (though we did miss some).  This incident created uncertainty that we can trust editors not play favorites, which complicates matters greatly because if we can't trust the editors to not play favorites then I feel like we have bigger problems.",
        "created_at": "2022-07-18T07:08:13.332000+00:00",
        "attachments": []
    },
    {
        "author": "killari.",
        "category": "Execution Layer",
        "parent": "",
        "content": "Picking numbers at random, or merge timestap could be ones",
        "created_at": "2022-07-18T16:01:07.945000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Execution Layer",
        "parent": "",
        "content": "How hard would it be to improve the EIP-Bot to create merge commits (a la bors)? My preferred policy is to only assign an EIP number at merge (either randomly or sequentially), followed by \"editors can pick arbitrarily to disincentivize sniping\".",
        "created_at": "2022-07-18T16:33:55.742000+00:00",
        "attachments": []
    },
    {
        "author": "killari.",
        "category": "Execution Layer",
        "parent": "",
        "content": "hmm, I dont even know what EIP-Bot does or how its written",
        "created_at": "2022-07-18T16:35:42.389000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Execution Layer",
        "parent": "",
        "content": "Oh, yeah. That was more a question for those that work on it, following up on your comment",
        "created_at": "2022-07-18T16:36:41.108000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Execution Layer",
        "parent": "",
        "content": "It decides who are the required approvers for any PR",
        "created_at": "2022-07-18T16:37:07.204000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Execution Layer",
        "parent": "",
        "content": "It's TypeScript, as far as I know.",
        "created_at": "2022-07-18T16:37:26.861000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "It is TypeScript.  Having the bot actually do commits is harder than having it comment/merge.",
        "created_at": "2022-07-18T17:10:27.462000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I think it is possible, but more complicated than what we have right now.",
        "created_at": "2022-07-18T17:10:46.612000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "One option would be to have the bot pick a random unused number +/- 100 of the current PR, so you can't snipe with any amount of reliability and it is definitely credibly neutral.",
        "created_at": "2022-07-18T17:11:56.424000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "At this point though, I think the bigger issue is the process that allowed this specific EIP to get merged rather than the actual number sniping problem (though it seems like we need to solve the number sniping problem since it seems to be getting worse).",
        "created_at": "2022-07-18T17:12:35.410000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003c.\u003c\n\u003e.\u003e\n\nThat's why `eipw` stays _far_ away from that",
        "created_at": "2022-07-18T17:52:35.319000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Execution Layer",
        "parent": "",
        "content": "Have we not solved that? Don't unilaterally take actions you know to be controversial, and discuss such actions in public channels rather than private ones. I think \u003c@543900561460822016\u003e has agreed/will agree to those rules going forward.",
        "created_at": "2022-07-18T17:55:07.199000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I don't think that will repair our credibly neutrality at all.  We see this in modern governments all the time where some politician or other person in a position of power will do a bad thing, then publicly apologize and promise not to do very specific bad thing again, then just do some other slight derivation of bad thing again in the future.",
        "created_at": "2022-07-18T17:56:40.376000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I think to restore our credible neutrality we need to correct the \"bad thing\" at least, not allow it to stand and just apologize and move on.",
        "created_at": "2022-07-18T17:56:56.586000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Execution Layer",
        "parent": "",
        "content": "Repairing is another issue. Yes, I think we need to renumber EIP-5000.",
        "created_at": "2022-07-18T17:57:12.261000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Execution Layer",
        "parent": "",
        "content": "(delete, renumber, whatever)",
        "created_at": "2022-07-18T17:58:28.626000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I *also* think that there would be value in ensuring we (editors) are ethos aligned on whether treating certain authors different than others is acceptable behavior or not.  This has come up in many contexts in the past (like Peter wanting to skip Last Call for ancient EIPs).",
        "created_at": "2022-07-18T17:59:04.675000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "Allowing a group of authors who followed the correct procedures for creating an EIP use the number they opened their PR under does not affect the credible neutrality of the EIP process. It is an open and fair system - anyone can obtain an interesting number if they desire. At the end of the day, the actual number is insignificant and only meaningful to the small number of people who follow EIPs religiously. This is turning into a much bigger deal than it actually is, and I request that you accept my acknowledgement that approving the EIP and overriding Sam without more public discourse was not appropriate and we move on.",
        "created_at": "2022-07-18T18:09:38.667000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I think the root of our disagreement here is that you seem to hold the belief that a process can be credibly neutral while those in power exercise favoritism while I believe a process where favoritism is exercised by those in power is credibly non-neutral.",
        "created_at": "2022-07-18T18:14:58.691000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "(please correct me if my representation of your position is incorrect)",
        "created_at": "2022-07-18T18:16:17.452000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "I think the root of our disagreement is actually on the significance the number on an EIP carries. I think you're substantially overstating it. Your reaction seems more reasonable if an EIP was tacked onto a hard fork as a ride along for another favor.",
        "created_at": "2022-07-18T18:18:02.615000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "While the number sniping is what initially *triggered* my response, the significance I am placing on this issue is weighted very little by the number sniping and almost entirely on the rest of the process and the people involved.",
        "created_at": "2022-07-18T18:19:59.821000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "For example, I'm annoyed that 2535 got their number but I don't think there was a significant failure of credible neutrality on that one because it appears that it was just that none of us noticed the problem at the time.",
        "created_at": "2022-07-18T18:21:08.805000+00:00",
        "attachments": []
    },
    {
        "author": "leonardoalt",
        "category": "Execution Layer",
        "parent": "",
        "content": "I guess you mean 2535, aka diamonds? Honestly it's not possible that that one was missed, everyone knew about the spamming back then. It was just decided to give the author a reprimand and go with it (I don't know who decided what)",
        "created_at": "2022-07-18T18:33:05.749000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I don't believe we reprimanded them?  I looked through it recently and didn't see any indication that any editor noticed it until sometime after the fact.",
        "created_at": "2022-07-18T18:34:12.722000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "And yes, 2535 (edited).",
        "created_at": "2022-07-18T18:34:29.449000+00:00",
        "attachments": []
    },
    {
        "author": "hrkrshnn",
        "category": "Execution Layer",
        "parent": "",
        "content": "This seems to be going in circles around three things: allegation of spam, number sniping and credible neutrality. Do you really think the EIP process is *credibly* neutral in the first place? The reviews are not even double-blind.\n\nIf you look at the issue 5222 in particular, the authors were accused of number squatting and had their EIP renumbered, despite no indication of the authors performing this. It's only after our protest that this decision was overturned. They seem to be two students and a professor trio, bullied by editors with arbitrary allegations. They were first time contributors and likely new to the space itself. \n\nTo an outsider, all these sound deeply problematic. With calls for firing two other editors, bullying new contributors, renumbering / deleting EIPs, number policing, calling for a coup, and auctioning off numbers for profit.",
        "created_at": "2022-07-18T19:01:49.568000+00:00",
        "attachments": []
    },
    {
        "author": "killari.",
        "category": "Execution Layer",
        "parent": "",
        "content": "I dont think he agrees on that. As he is fine in giving some people prefential treatment",
        "created_at": "2022-07-18T19:39:25.599000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I think that is a separate point from the ones Sam listed?",
        "created_at": "2022-07-18T19:40:29.769000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "We need to move on.   I hope we all agree that it won't happen again.  I hope we can agree that EIP numbers mostly were and going forward should be PR numbers.  Yes, people can still game that a little.  So be it.",
        "created_at": "2022-07-18T19:45:47.345000+00:00",
        "attachments": []
    },
    {
        "author": "killari.",
        "category": "Execution Layer",
        "parent": "",
        "content": "cant they game it fully, and not a little?",
        "created_at": "2022-07-18T19:46:43.346000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "How?",
        "created_at": "2022-07-18T19:48:41.060000+00:00",
        "attachments": []
    },
    {
        "author": "killari.",
        "category": "Execution Layer",
        "parent": "",
        "content": "spam pr:s to get any number they like higher than current one",
        "created_at": "2022-07-18T19:49:25.305000+00:00",
        "attachments": []
    },
    {
        "author": "killari.",
        "category": "Execution Layer",
        "parent": "",
        "content": "and someone needs to delete the spammed ones",
        "created_at": "2022-07-18T19:49:45.085000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "Yes.  If it happens we have to deal with it.  If a little more (or less) automation would help, fine.  But we don't need to build a fortress that can repel all possible attacks, even rare ones.  Clean up the mess and block the user.",
        "created_at": "2022-07-18T19:55:25.608000+00:00",
        "attachments": []
    },
    {
        "author": "killari.",
        "category": "Execution Layer",
        "parent": "",
        "content": "thats what happening in the current situation too?",
        "created_at": "2022-07-18T19:56:22.281000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e  Do you really think the EIP process is credibly neutral in the first place? The reviews are not even double-blind.\nIn an open-source word  reviews are not blind, they are open.",
        "created_at": "2022-07-18T19:57:07.819000+00:00",
        "attachments": []
    },
    {
        "author": "killari.",
        "category": "Execution Layer",
        "parent": "",
        "content": "or are you saying we should block ppl involved with the sniping and move on?",
        "created_at": "2022-07-18T19:57:41.798000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "I don't. much care about the current situation anymore, except wanting the dispute to end.  Going forward, yes, if somebody is causing problems with spam PRs, issues or other github abuse we can block them if need be.  But we can deal things as they arise.",
        "created_at": "2022-07-18T20:04:29.638000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Things *have* arisen, and you are saying that we should ignore it and wait until things arise.",
        "created_at": "2022-07-18T20:05:23.523000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "We have not ignored it.  We've been hashing over it for days.  I think the first Draft PR requires Editor approval, so people won't be in a position to start spamming PRs until they are already part of the community, as it were.  If they behave badly we deal with it.",
        "created_at": "2022-07-18T20:09:27.227000+00:00",
        "attachments": []
    },
    {
        "author": "hrkrshnn",
        "category": "Execution Layer",
        "parent": "",
        "content": "That is completely fair. I wouldn't call it credibly neutral though. Here's a fun story: Donald Knuth once sent a paper under a woman's name to get more honest reviews. (See page 3 in http://www.math.upenn.edu/~wilf/website/dek.pdf)",
        "created_at": "2022-07-18T20:09:32.299000+00:00",
        "attachments": []
    },
    {
        "author": "killari.",
        "category": "Execution Layer",
        "parent": "",
        "content": "thats because theres no single person that can just make a call how to deal with it. I guess theres no process in coming into consensus on what should be done here",
        "created_at": "2022-07-18T20:11:09.882000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Anyone can create spam PRs/issues.  I know no one notices, but that is because I clean them up and report them every day of the week.",
        "created_at": "2022-07-18T20:12:28.820000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e no process in coming into consensus\nSeems to be the real issue.  There used to be only three of us and the process was pretty informal.",
        "created_at": "2022-07-18T20:13:00.395000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "In this case, someone spammed the repository with issues using a brand new account immediately prior to PR 5000 being created.",
        "created_at": "2022-07-18T20:13:23.134000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e Anyone can create spam PRs/issues\nWe could start drawing EIP numbers off another sequence starting where we are now, so that at least the spam doesn't affect the EIP numbers.",
        "created_at": "2022-07-18T20:14:17.020000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "We can do a lot of different things to address the sniping issue in the future.  None of it will address the credible neutrality issue that is present here where the authors of PR 5000 were given special treatment that others are not given due to their connection to the EIP editors (this has been admitted to by the parties involved).",
        "created_at": "2022-07-18T20:15:10.556000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "What's past is past.  Let's just establish a more neutral process going forward.",
        "created_at": "2022-07-18T20:16:14.674000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "We had a neutral process, and it was overruled by editors who don't think a neutral process is necessary.",
        "created_at": "2022-07-18T20:16:41.496000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "Do they still think that?",
        "created_at": "2022-07-18T20:17:04.247000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Yes.",
        "created_at": "2022-07-18T20:17:07.500000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "Then that is what we need to discuss.",
        "created_at": "2022-07-18T20:17:34.289000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Lightclient believes that it is acceptable behavior to give preferential treatment to well known members of the Ethereum community (as defined by the editor making a decision against the desire of other editors).",
        "created_at": "2022-07-18T20:17:36.960000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I believe that is very unacceptable behavior.  Which is the impasse we are at now.",
        "created_at": "2022-07-18T20:17:54.434000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "My latest suggestion makes spamming EIP numbers very difficult --  just take them sequentially as they come.",
        "created_at": "2022-07-18T20:19:43.801000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "As I mentioned, the number sniping isn't the real issue here IMO.  It is a combination of a disagreement on what is acceptable behavior for an editor, and (if it is decided that this was unacceptable behavior) whether it is important to \"make it right\" or a simple apology and pretend it didn't happen is appropriate.",
        "created_at": "2022-07-18T20:20:50.498000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "To accept an apology is not to \"pretend it didn't happen.\"",
        "created_at": "2022-07-18T20:22:27.717000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "I have already acknowledged that not discussing publicly my preference for accepting the EIP with the number under which the PR was made was a mistake on my part that I do not plan to repeat.",
        "created_at": "2022-07-18T20:24:12.590000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "However, I don't feel like the credible neutrality of the process has ever been up for debate. The authors contacted me about the number to contest Sam's decision, because they felt it was fairly obtained. I agreed that it was fairly obtained and approved it. I am easily reachable by anyone interested in contesting a decision made on their EIP, but I think we all prefer to discuss these things on the PR itself.",
        "created_at": "2022-07-18T20:30:30.187000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "This acknowledgement would ring more true IMO if it was accompanied by a willingness to agree to changing the number.  Just saying \"muh bad\" while continuing to lobby for your preferred outcome makes it come across as disingenuous.  To an outside observer, undoing the action reinforces the understanding that backroom dealings won't get you anywhere because even if you do get your PR merged, it'll just get reverted once it comes to light what happened.",
        "created_at": "2022-07-18T20:31:30.236000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "Because I still don't think there is anything wrong with the EIP getting the number it was opened under.",
        "created_at": "2022-07-18T20:32:12.558000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I still think this is the real issue underlying this all.  You are OK with favoritism and preferential treatment which I consider to be wholly unacceptable for the any credibly neutral process.",
        "created_at": "2022-07-18T20:32:22.588000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Sure, and this would be a relatively minor disagreement that we would discuss in the editor meeting if you were the one to originally review and merge it.  However, you weren't, Sam was, and he clearly and publicly assigned them a different number which you ignored after private discussions with them.",
        "created_at": "2022-07-18T20:33:42.306000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I don't see how someone can see the process as credibly neutral when one editor just ignores editor number assignment without discussion because they think a particular EIP is \"worthy\".",
        "created_at": "2022-07-18T20:35:14.743000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "Please, please.  Let us move on.  It's done. \n\nIf PR numbers are problematic then I am proposing that the bot start assigning numbers from its own sequence.  I think we Editors agree we that we don't mess with the sequence - however derived -  or accept spam  PRs.  OK?",
        "created_at": "2022-07-18T20:42:37.258000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "If we do nothing we are incentivizing people to spam the repository (this is not a hypothetical, people have done this on multiple occasions in the past).  Also, this still doesn't address the core ethos disagreement on whether editors should be treating friends/well known authors differently from everyone else.",
        "created_at": "2022-07-18T20:47:48.936000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "I really just want to find consensus on a policy going forward.",
        "created_at": "2022-07-18T20:49:00.040000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "A policy that precludes that behavior.",
        "created_at": "2022-07-18T20:49:32.278000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I have several problems with that strategy:\nA. We had a policy (editor assigns the number, which Sam did) but it was ignored.  Creating a new policy doesn't stop editors from ignoring the policy again in the future.\nB. If every time someone games the system we allow them to get away with it and then develop new rules going forward, we just incentivize people to game the system and we spend all of our time playing cat \u0026 mouse with them.  It would be much simpler to just not allow people to game the system in the first place (which is what our policy did previously by saying editors assign EIP numbers).\nC. Ignoring the underlying ethos disagreement still leaves us in a situation where some editors think it is acceptable to treat friends/well known authors differently from unknown authors and this is very likely to cause tension again in the future.",
        "created_at": "2022-07-18T20:53:16.902000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "This isn't game theory, it's people.   There were some unpleasant incidents and the people involved don't agree.  I don't care.",
        "created_at": "2022-07-18T20:56:54.511000+00:00",
        "attachments": []
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "I'm suggesting a mostly automated system we agree to use and let the \"ethos\" question be.  Let the bot assign the numbers.  It's just a d@mn sequence already.",
        "created_at": "2022-07-18T20:59:05.663000+00:00",
        "attachments": []
    }
]