[
    {
        "author": "abcoathup",
        "category": "Execution Layer",
        "parent": "",
        "content": "Given EIP7212 is already in review (https://eips.ethereum.org/EIPS/eip-7212), I think we should issue a new number for this clone as a RIP.\nhttps://github.com/ethereum/RIPs/pull/5\n\nUpdate: I assigned RIP7576",
        "created_at": "2023-12-13T03:52:45.675000+00:00",
        "attachments": []
    },
    {
        "author": "carlbeek",
        "category": "Execution Layer",
        "parent": "",
        "content": "So I don't necessarily agree that we need to carry over the exact processes here. I think the RIP process is still in enough flux that it doesn't make sense to just adopt the exact protocols used in EIPs/ERCs. For example, adding statuses when we may need different ones \u0026 editors files are used for CI which we currently don't have on the repo. Furthermore, it is not a given that they should be exactly the same as EIPs. Therefore, merging this now seems like unnecessary files to maintain.  If there is a desprate need for a list of editors, i think we can just pop it in the README",
        "created_at": "2023-12-13T05:36:43.932000+00:00",
        "attachments": []
    },
    {
        "author": "carlbeek",
        "category": "Execution Layer",
        "parent": "",
        "content": "I think this is a mistake, maintaining multiple copies of the same file across different repos seems like unnecessary busy work. Furthermore, we would then have to start talking about different numbers for referring to the EIP vs the RIP (do we refer to both?). Porting over the EIP to an RIP seems like a much better process for all involved, it just requires updating the EIP process to allow for moving these things over.",
        "created_at": "2023-12-13T05:40:47.702000+00:00",
        "attachments": []
    },
    {
        "author": "abcoathup",
        "category": "Execution Layer",
        "parent": "",
        "content": "My thoughts:\nIf the EIP is being moved (removed from EIP repo and created in RIP repo) then it should keep the same number.\nIf the EIP is being created also as a RIP, with potential for divergence in the spec now or in the future between EIP and RIP, then it should have a different number.\nSame goes for a RIP moving to become an EIP.\n\nNot trying to make busy work.  Trying to avoid confusion.\n\nUpdate: discussion continues in RIP comments: https://github.com/ethereum/RIPs/pull/5/files#r1424823634",
        "created_at": "2023-12-13T05:50:46.853000+00:00",
        "attachments": []
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "I'd like to avoid having exceptions unless we have a strong reason to allow them.  \nThe EIP number **once allocated should be retained** and should not be reallocated unless the proposal is re-starting with `Draft` . \n\nChanging type/category is not new to Ethereum standards. It has happened with multiple EIPs in the past and we have always retained the same number \neg. \nhttps://github.com/ethereum/EIPs/commit/ab6113b0443a26953eae5e79032fd6213dfbe8fb\nhttps://github.com/ethereum/EIPs/commit/dfc23554cb84cafb5c34a2a5d213647450741f1f",
        "created_at": "2023-12-13T11:48:52.775000+00:00",
        "attachments": []
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "I am in favor of updating README to provide required information about the repo to help authors and the community to understand how to proceed. It was my recommendation in the last EIPIP meeting to avoid having Meta proposal 1 as the replica of EIP-1 and update EIP-1 to include RIPs / ERCs information back-linked with respective README files. \n\nI'd also be open to update RIPs Editors to EIP-1 just as ERCs Editors are listed.",
        "created_at": "2023-12-13T11:54:35.268000+00:00",
        "attachments": []
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "Agreed, we may not necessarily need to follow the exact process for RIPs as EIPs. The specifics may change depending on the repo/community's decision. \n\nHowever, if a proposal is proposed to https://github.com/ethereum repo to be an Ethereum Standard, the process must look uniform from a high level irrespective of type/ category.\n\nTo provide standards for projects to follow, it is a good idea to have a standard process for following. If there is any good practice on any standard repo, others may follow the lead. Like, CL is now having EIPs. \n\nThus recommeding keeping the eip-preamble \u0026 eip-status same and create rules for when to move in that status as per the respective community agreement. \n\neg. \"Last Call deadline\" can be today + 14 days for Networking/Interface/ERCs but  for the Core it will be the mainnet upgrade date. \n\nRIPs supporting community may specify their “Last Call deadline” but, it will be nice to keep this field in the preamble.",
        "created_at": "2023-12-13T12:07:59.043000+00:00",
        "attachments": []
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "I'd support having \"Purpose and Guidelines\" added to README rather than having a Meta for RIPs as EIP-1, which may accidentally include mention of \"RIP-5757\" (that will never exist)\n\nhttps://github.com/ethereum/RIPs/pull/2/commits/e0ce6e9614d5bf152df9f34aee361b2456b3c752\n\nIf we must create a RIPs Meta, it should NOT duplicate the text of EIP-1 but SHOULD include that is specific to RIPs and EIP-1 (being a standard document across repositories) may not include.",
        "created_at": "2023-12-13T12:16:58.015000+00:00",
        "attachments": []
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "EIPIP meeting starting in ~20 mins\n\nhttps://us02web.zoom.us/j/82357016731?pwd=V0hLUWIvU2V2UTdUd216WHdGNFBKUT09",
        "created_at": "2023-12-13T15:41:45.404000+00:00",
        "attachments": []
    },
    {
        "author": "smartprogrammer",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003c@689161464829050960\u003e",
        "created_at": "2023-12-13T16:41:49.880000+00:00",
        "attachments": []
    },
    {
        "author": "danceratopz",
        "category": "Execution Layer",
        "parent": "",
        "content": "Many thanks for the chance to present our EIP Versioning idea in the meeting today.\n\nI have a quick question about the PR's failing EIP Walidator Github Actions. Is it necessary to remove the external links from the EIP text pointing to ethereum/EIPs PRs? These are very useful in the Case Study sub-section. Thanks!\n\nhttps://github.com/ethereum/EIPs/pull/8034",
        "created_at": "2023-12-13T17:12:36.584000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003c@226589605816696832\u003e \u003c@547171287831805972\u003e Hey! Like I said on the call, I'm 100% on board with author-maintained semantic versions for EIPs up until Final. Personally, I won't have time to work on this until after I get my working groups proposal finished 😅 \n\nLove your Meta EIP. Thanks so much for putting that together. One thing to note is that these kinds of EIPs don't have to follow the sections the same way as non-Meta proposals. Security considerations, for example, doesn't make any sense. You can remove it. As for the links to GitHub pull requests, you will need to remove those. We're pretty strict about not depending on GitHub any more than we need to.\n\nSince you mentioned wanting to help get this implemented, we'll need a few outputs: a document that other Editors and eventually authors can read describing the process (your EIP covers this perfectly), tooling upgrades in [eip-review-bot](https://github.com/ethereum/eip-review-bot) (TypeScript) and [`eipw`](https://github.com/ethereum/eipw) (Rust), and finally a Call for Input to officially make the change.\n\nHow would you like to co-ordinate this? Here? Telegram group?",
        "created_at": "2023-12-13T18:02:09.675000+00:00",
        "attachments": []
    },
    {
        "author": "joeysantoro",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003c@343796045895172102\u003e et all, is there a reason ERC-1191 isn’t final? is it being adopted?",
        "created_at": "2023-12-13T20:53:05.030000+00:00",
        "attachments": []
    },
    {
        "author": "smartprogrammer",
        "category": "Execution Layer",
        "parent": "",
        "content": "I believe the way to move forward is to first merge the EIP draft so we can present it to the EIP Authors and make sure they are in support of it  and collect feedback (probably in ACD). Moving forward we will try to help implementing the needed checks in the eipw. once we start with that we put the EIP in review. when we are done with the linter implementation we let the authors know and we mark the EIP as final signaling it is now required in any future edits. What do you think?\ncc, \u003c@547171287831805972\u003e",
        "created_at": "2023-12-13T21:02:55.647000+00:00",
        "attachments": []
    },
    {
        "author": "poojaranjan",
        "category": "Execution Layer",
        "parent": "",
        "content": "Summary EIPIP Meeting 96 \nhttps://github.com/ethereum-cat-herders/EIPIP/issues/300#issuecomment-1854852064",
        "created_at": "2023-12-13T23:31:49.225000+00:00",
        "attachments": []
    }
]