[
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "The bot has suddenly decided that the DOI example that's been there since sometime in 2022 has an error that must be fixed.  I didn't change it and can't fix it.  Could one of the first-class editors kindly push this PR past the bot until a botmeister can figure this out?",
        "created_at": "2023-07-21T11:26:41.225000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "As a piece of engineering I find the proposed refactoring ugly --it clearly favors EIPs over ERCs, with the ERC repo becoming a strange half-zombie I don't really understand.  So part of my block is yes, to please clean that up.  If the other editors were enthusiastically supporting that change I could live with it, but they are not.",
        "created_at": "2023-07-21T11:38:06.804000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "But what is literally giving me nightmares is that \"the split\" debate has never really been about the split.  It's about governance.  But the split proposal doesn't say a word about changing governance.  So what I get is, \"Lets do major surgery to the repo to get the ERCs out of it and _then_ we can go back to disagreeing about governance.\"",
        "created_at": "2023-07-21T11:44:10.310000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "My proposal attempts to resolve the governance issues, by clarifying that the Editors and the Core Devs are distinct organizations with their own governance and areas of responsibility.  And it provides a fail-safe for the core developers -- they are allowed to push PRs past the editors.",
        "created_at": "2023-07-21T11:51:17.628000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "Having resolved the governance we can worry about how to arrange the repos to best support our work.  If we can't resolve the governance issues we have bigger problems.",
        "created_at": "2023-07-21T11:53:10.017000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e \"the split\" debate has never really been about the split.  It's about governance\nNot sure why you say this. I don't think it is about governance. The core devs aren't anticipating taking over the process. They want github notifications to work correctly like it does in every other repo they watch and they want to have more say in the process.\n\nERC devs need to take ownership of their process. We don't really allow them much because the editor set has never been terribly ERC focused. This is what the split is about. The editors still have the ultimate responsibility of ensuring a high quality collection of standards",
        "created_at": "2023-07-21T13:07:21.898000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "When the split is done will there remain a single Editor organization responsible for both EIP and ERCs?",
        "created_at": "2023-07-21T13:12:34.295000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "there will be editor orgs for both",
        "created_at": "2023-07-21T13:40:28.266000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "That is what I find unacceptable.",
        "created_at": "2023-07-21T13:53:22.323000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "if the world were perfect, i would also agree that both should be under the same umbrella and we should have a larger, more sophisticated organization + working group collective around standards",
        "created_at": "2023-07-21T13:57:37.877000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "the reality is that we don't and likely won't for the foreseeable future - the space is anti-establishment, hyper capitalistic. standards bodies don't fit so nicely into that picture. if we don't try to meet the community where they are at, we'll be left behind regardless",
        "created_at": "2023-07-21T13:59:51.839000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution Layer",
        "parent": "",
        "content": "To allow the ERC process to grow it needs to not be under the shadow of the EIP process. The EIP process needs to change significantly to align with how core development has been done in the past 3 years.  A third, parent, organization that both groups can push PRs through over the parent orgs objection is just a figurehead organization that provides little value.  If there is a third org we need to re-think it’s relationship to two independent orgs.",
        "created_at": "2023-07-21T14:29:32.576000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution Layer",
        "parent": "",
        "content": "+1 to that, but I also think \"organization\" makes it sound bigger than it is. It's not like we are talking about separate legal entities, staff, etc. It's basically just another repo, and that's it. Over time, maybe the processes diverge enough that it makes sense for each side to have separate coordination meetings or whatnot, but for now we can keep the overhead structure basically the same, and just have one more repo",
        "created_at": "2023-07-21T14:43:27.244000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003c@683653554631868440\u003e what do you think of this as a \"single editor organization\"?\n\n\u003e and then maybe having another repo for editors-pm (or maybe just keep EIPIP?), either under ethereum or perhaps the ethereum-cat-herders? \n\nI don't want to create useless overhead, but your proposal frames the editors as \"above\" the ERC+EIPs processes, which I think is wrong. Both these repos should be \"first class citizens\", but I'm not opposed to having a third more logistics-focused repo, which I think is effectively `eipip` today. \n\nThat said, in practice the list of editors on each side will likely diverge, and so will some of the repos' policies. If _that's_ what you want to keep unified, I don't see a way where it's coherent with what client teams want.",
        "created_at": "2023-07-21T16:04:33.468000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Execution Layer",
        "parent": "",
        "content": "may be there is a group which has oversight over both repos regarding meta processes",
        "created_at": "2023-07-21T16:10:46.140000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Execution Layer",
        "parent": "",
        "content": "imo it seems to me that the governance is about such rights (and responsibilities) which could be meaningful to only a handful of editors (not really a bad thing) but irrelevant to the community at large ... so editing complexities can be hidden from the general community.",
        "created_at": "2023-07-21T16:16:03.768000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "It's technical English.  Spelling, grammar, Markdown syntax, citation format.  The fields of the header the bot uses.  Basic format like having an Abstract and a Security section.  Sequential document numbers.  These are things that don't need to be at all different for ERCs and EIPs, and that for the most part nobody but the Editors cares to manage.  If the Editors are doing much more than that we have overstepped our role.",
        "created_at": "2023-07-21T16:51:51.540000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "A serious problem has been that Core work can be (and has been) delayed by small disagreements between the Author and the Editors or our bots.  So the Editors can wind up with a veto over the Core Developers publishing their work.  I've proposed to let them override the veto.",
        "created_at": "2023-07-21T16:55:06.652000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "So nothing in my actual proposal requires a split -- it just cleans up things like link rules that I and others have been complaining about for a long time, and tries to clarify the responsibilities and powers of the Editors and our users.",
        "created_at": "2023-07-21T17:03:09.922000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "The proposal does make it easier for any person or group to publish their proposals as EIPs while doing most of the editing in their own repo.  I've informally laid out a refactoring that moves working drafts into separate WGEIP and WGERC repos so that the original EIPs repo can remain as the place where the Editors work together, and the Core Devs can manage their docs and workflow in the WGEIP repo.",
        "created_at": "2023-07-21T17:07:22.229000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "I think something like this meets the needs that I have been hearing.",
        "created_at": "2023-07-21T17:09:09.796000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Execution Layer",
        "parent": "",
        "content": "imo most important role of editor is to make sure that the EIP is semantically correct meaningful and relevant. (at least thats what interests me, may be these roles can mean different things to different people)\n\neverything else can be eventually done by bots (barring an AGI in which case we can just party) which is what you are proposing. But repo split is cleaner imo (and might  still end up using your proposed lint rules)\n\nAlso  having separate repos for drafts is worst of both worlds.\n\nPublishing of the two repos can still be done under same url why do they have to stay in same github repo",
        "created_at": "2023-07-21T17:15:59.848000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Execution Layer",
        "parent": "",
        "content": "A decent compromise is that two repos have the same meta process repo , or same group of people governing the process in both repos however way one wants to implement it",
        "created_at": "2023-07-21T17:18:47.844000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e semantically correct meaningful and relevant\nFor Core EIPs we lean very much on the Developers for that.  We are only editors. And we do use bots where we can, but they can't do the whole job yet.",
        "created_at": "2023-07-21T17:20:37.537000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e Also  having separate repos for drafts is worst of both worlds.\nI don' t think so, and I have to work in them.  Currently there is one repo where every EIP is maintained for its entire history.  Every single commit to every single file.  It's overwhelming in a number of ways.  But most of those commits the editors shouldn't need to care about -- it's just the authors fine-tuning their work, perhaps moving it through through the stages of the core development workflow from 'considered-for-inclusion' to 'mainnet'.  And the ERCs, being more numerous, create even more churn.  So I think it would be real improvement if the core devs and the ERCs had their own repos to work in, and used the EIPs repo only for publishing the major stages.",
        "created_at": "2023-07-21T17:28:45.999000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "The only stages that are truly critical in the Editors repo are Draft and Final.",
        "created_at": "2023-07-21T17:30:41.457000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Execution Layer",
        "parent": "",
        "content": "for core EIPs we also have core editors\n\nand this is why split is meaningful as editing the core EIPs might mean different thing. \n\neditor is the final peer reviewer of the proposal. one may lean on devs for clarity or for critique but if a core editor cant judge the technical merits of the EIP he/she has no purpose being core editor (at least for that EIP).",
        "created_at": "2023-07-21T17:34:39.578000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Execution Layer",
        "parent": "",
        "content": "why is there a need for merging approved proposals in a github repo when they can be auto published under same url --- essentially for community consuming proposals/EIPs -- thats what they be looking at (published url)",
        "created_at": "2023-07-21T17:40:25.286000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution Layer",
        "parent": "",
        "content": "Don’t expect this to last long.  We need to adopt the ACD workflow (draft/EFI/CFI/devnet/testnet/final) as well as adding “fork” metadata flags on the ACD side. Changes which are meaningless to the ERC side.",
        "created_at": "2023-07-21T17:42:02.674000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Execution Layer",
        "parent": "",
        "content": "process can be different but process oversight committee can be same",
        "created_at": "2023-07-21T17:42:46.063000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution Layer",
        "parent": "",
        "content": "In the past month my opinion of the value of oversight has fallen.",
        "created_at": "2023-07-21T17:43:37.016000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Execution Layer",
        "parent": "",
        "content": "i understand, there can be churn and chaos anywhere there are humans involved (or as a matter of fact chatGPT as well 😆  - recent significant fall in correctness as per twitter lol)",
        "created_at": "2023-07-21T17:46:48.305000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Execution Layer",
        "parent": "",
        "content": "hopefully we can bring back meaningful oversight to the entire editing process",
        "created_at": "2023-07-21T17:47:40.524000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e Don’t expect this to last long.  We need to adopt the ACD workflow (draft/EFI/CFI/devnet/testnet/final) as well as adding “fork” metadata flags on the ACD side. Changes which are meaningless to the ERC side\n\nI'm saying that the editors need to get out of the workflow business and let the devs handle their own workflow in their own repo.  For the editors it should be just a flag in a header.\n\nIt seems like you want to kick the ERCs out of the EIPs repo so that it can be made into the repo that the devs want it to be.  If so, can't go with that.",
        "created_at": "2023-07-21T18:08:32.106000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e why is there a need for merging approved proposals in a github repo when they can be auto published under same url\n\nIt's at the point of merging into the Editors' repo that editors care about following the rules that we enforce, including with bots.  Changes to a file outside of our repo don't need our approval.",
        "created_at": "2023-07-21T18:12:08.929000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Execution Layer",
        "parent": "",
        "content": "essentially a bot/worflow (from individual repos) can publish PRs to editors repo for status change whch can be manutally approved. so no one has to hop across repos unless they want to (or bot malfunctons)",
        "created_at": "2023-07-21T18:21:11.036000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Execution Layer",
        "parent": "",
        "content": "i am ok with this",
        "created_at": "2023-07-21T18:21:38.052000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "Yes, we can manage what gets displayed at what URL when however we like.  But I'd much prefer that what goes to https://eips.ethereum.org/ has been run by the Editors first.  Currently, the act of merging it to the EIPs repo does that automatically.",
        "created_at": "2023-07-21T18:25:18.964000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e It seems like you want to kick the ERCs out of the EIPs\n\nIf that was the goal we wouldn't be going through the processes, we would just ask the EF for the admin rights to the repository.  I want two different healthy processes running at the end of this.\n\nHaving two fundamentally different workflows in the same repository presents programming problems for the bots.  There will be too may \"if EIP do this if ERC do that\" clauses that will slip into each others workflows at some point.  And if we want to add even more gatekeeping relating to client preparedness (don't progress this EIP past CFI until there is a link to each client's PR or a link to a releases with it implemented, for example) then that's more headache to keep ERCs out of it and whole swaths of EIP 1 that is specialized for one set of working groups.\n\nAnd then the working groups, they will be significantly different on the ERC side.  I don't expect standing working groups, and WG membership mediations could become a task the editors may need to wade into for hot community ERCs, especially separating out contributors with real value to add from the people only looking for a trophy seat to add to their resume and conference bio.",
        "created_at": "2023-07-21T18:39:51.713000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution Layer",
        "parent": "",
        "content": "These concerns are too divergant to keep in one repo.",
        "created_at": "2023-07-21T18:40:00.660000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "I feel like we are talking past each other completely, Danno.  Yes, the people and groups creating EIPs are highly divergent.  But I still can't see that their _editorial_ needs are so different as to need two teams of editors, (who will then need to coordinate on all that they have in common) and don't see why the _workflow_ of a group should concern the editors much at all.",
        "created_at": "2023-07-21T18:46:14.735000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution Layer",
        "parent": "",
        "content": "I don't think we are talking past each other.  We are asking for a significant workflow change and an editor is vetoing it and blocking consensus.",
        "created_at": "2023-07-21T18:46:52.999000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "I'm not vetoing, I'm just not consenting.  I'm trying we can find a solution we can all live with.  I agree -- the default editing workflow is an impediment to the Core Devs.  To us its just a field in a header.  Why does it not suffice (for that problem) to just get rid of that impediment and not put more back?\n\n It's not hard to say in EIP-1 that, \"This is the default workflow.  Working groups are free to define their own.\"  So if you really want the stages of your workflow to be in a document managed by the Editors, why does that need a split?",
        "created_at": "2023-07-21T18:54:57.465000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution Layer",
        "parent": "",
        "content": "If you are not vetoing why did you say on ACD \"I veto this\" why did you say \"I block consensus\" why did you say \"If this happens I'm resigining\"?  Those are not \"I don't consent\" statements, those are active and aggressive statements of blocking.  You cannot minimize your role and what you have been doing to this process.\n\nIt may not be hard to say it in EIP-1, but history has shown that editorial vetos can and will happen for less principled reasons that what is going on right now.  In theory it works, but in practice it has been shown to fail.",
        "created_at": "2023-07-21T18:58:23.313000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution Layer",
        "parent": "",
        "content": "if you were simply not consenting this would have passed three weeks ago.",
        "created_at": "2023-07-21T19:00:47.569000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "If I said \"veto\" I mispoke.  I'm blocking consensus.  It's not the same: the other editors are free to move on without me.  My proposal specifically grants the Core Devs the right to override the Editor's lack of consensus (which yes, does act as a veto on them).",
        "created_at": "2023-07-21T19:04:00.992000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution Layer",
        "parent": "",
        "content": "Can we optimize the loop, invoke that override now, and proceed with the split?",
        "created_at": "2023-07-21T19:04:35.212000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "Well, you would need to get consensus from the other Editors on that 😉",
        "created_at": "2023-07-21T19:05:26.463000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "But really, if you split the repos you will still have a team of editors who can refuse to merge a core PR.",
        "created_at": "2023-07-21T19:06:27.399000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution Layer",
        "parent": "",
        "content": "I'm expecting you will honor your statement you will resign if that happens.",
        "created_at": "2023-07-21T19:07:31.882000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "I reserve the right to lift my block before that happens.",
        "created_at": "2023-07-21T19:08:10.402000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution Layer",
        "parent": "",
        "content": "Such statements should not be said lightly.",
        "created_at": "2023-07-21T19:08:48.836000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "Believe me, they are not.  Had your PR been merged last week over my objections I would already be gone.",
        "created_at": "2023-07-21T19:09:41.373000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution Layer",
        "parent": "",
        "content": "It was merged.  Do you mean lightclient's PR?",
        "created_at": "2023-07-21T19:10:09.883000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution Layer",
        "parent": "",
        "content": "Yes, excuse me.",
        "created_at": "2023-07-21T19:10:22.259000+00:00",
        "attachments": null
    }
]