[
    {
        "author": "abcoathup",
        "category": "Cross-layer",
        "parent": "",
        "content": "EIP # query: https://github.com/ethereum/EIPs/pull/6682#issuecomment-1469126479\nI can't wait to see EIP #s automated.\n\n[UPDATE]: Sam assigned a number",
        "created_at": "2023-03-15T01:33:02.652000+00:00",
        "attachments": null
    },
    {
        "author": "kdenhartog",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm in agreement with EIP-1. My question is more around what should we do about references to them? For example, we've got 3 EIPs that currently cite ISO 8601. EIP-1 (for date created template), EIP-4361 for various time related aspects for the message being signed, and EIP-6596 also for various time related aspects.\n\nI'd propose that we change the date time format to reference RFC 3339 anytime we reference ISO 8601 specifically since that's a free RFC that's nearly the same. The alternative is to let people keep referencing ISO specs, but not link to them, which effectively the same as linking to it because the reader would still have to go buy a copy of the ISO spec if they want further details about how to remain compliant with it.",
        "created_at": "2023-03-15T14:40:47.224000+00:00",
        "attachments": null
    },
    {
        "author": "kdenhartog",
        "category": "Cross-layer",
        "parent": "",
        "content": "Other examples I see citing ISO without linking are: EIP-3475 (assets/metadata.md), EIP-2019, EIP-2020, EIP-2021, EIP-5773. Looks like none of these have reached final call status yet either, so we still have a chance to update these.",
        "created_at": "2023-03-15T14:47:25.470000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "For dates, yeah, I think switching to RFC 3339 is a good plan.",
        "created_at": "2023-03-15T14:48:44.102000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "For other ISO standards... I think we can encourage people to find alternatives.",
        "created_at": "2023-03-15T14:49:14.580000+00:00",
        "attachments": null
    },
    {
        "author": "kdenhartog",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ok, I'll work on the EIP-4361 to get that changed and I can drop a message in EIP-5773 which is in final call to suggest changing it. All the 20** are stagnant and the EIP-3475 is final, but it references ISO country codes in the assets so I believe that's fine to update is that correct?",
        "created_at": "2023-03-15T14:53:00.177000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "If it's final we generally don't allow changes unless they're to fix errata.",
        "created_at": "2023-03-15T15:01:25.452000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "Cross-layer",
        "parent": "",
        "content": "In this case, I don't believe that was a mistake at the time, just a result of changing rules.",
        "created_at": "2023-03-15T15:01:39.735000+00:00",
        "attachments": null
    },
    {
        "author": "kdenhartog",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ok, I'll leave that external asset alone then. EIP-1 could be updated to RFC-3339 as well (without a breaking change all the breaking changes occur with the time zones and more precise timing), thanks for the help in figuring out what to do with this",
        "created_at": "2023-03-15T15:13:34.938000+00:00",
        "attachments": null
    },
    {
        "author": "kdenhartog",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also, I can't find the EIP that defined the exceptions for linking that you wrote in alignment with 5757. Do you remember what number it was so I can copy it to write one to register IETF, W3C, and WHATWG so they can be added to the exception list",
        "created_at": "2023-03-15T15:15:11.997000+00:00",
        "attachments": null
    },
    {
        "author": "kdenhartog",
        "category": "Cross-layer",
        "parent": "",
        "content": "Scratch that, just realized it's 5757 itself I must've been getting confused with a few of the other processes defined in alternative proposals",
        "created_at": "2023-03-15T15:17:36.634000+00:00",
        "attachments": null
    }
]