[
    {
        "author": "poojaranjan",
        "category": "Cross-layer",
        "parent": "",
        "content": "**EIPIP Meeting 96**\nDate and Time: Dec 13, 2023 at 16:00 UTC\nAgenda: https://github.com/ethereum-cat-herders/EIPIP/issues/300",
        "created_at": "2023-12-12T16:10:13.678000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Cross-layer",
        "parent": "",
        "content": "Please add items for discussion in comments.",
        "created_at": "2023-12-12T16:10:28.607000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hi all! As you probably know, \u003c@550420431744794624\u003e and I are working on creating an RIP (R for rollup) working group as part of our RollCall rollup EVM standardization effort. So far, we have created a barebones repo at https://github.com/ethereum/RIPS\n\nThe first small RIP we want to move through the process to get some experience is the secp256r1 precompile. As this was proposed before RIPs existed, it was initially proposed as an EIP: https://eips.ethereum.org/EIPS/eip-7212\n\nWe coordinated with the EIP authors and agreed that the best way forward would be to move the EIP to the RIPS repo, similar to what was done with ERCs. Do you think that would be reasonable here? Of course there are further long-term questions to be answered about the relation between EIPs and RIPs, but for now this seems like a pragmatic approach.\n\nAlso, as the authors feel some urgency around the EIP, if at all possible we would ideally move the EIP before the monthly RollCall tomorrow, so that we can then set it to last call on there.\nWe'd appreciate your feedback!",
        "created_at": "2023-12-12T17:05:31.052000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@415548822983278593\u003e \n\nThanks for sharing about RIP GitHub.\n\nIn order to advance any proposal to RIPs GitHub, we'd need related folders and editors to be able to merge them along with tooling support to ease reviewing/merging. I have opened a PR to add statuses \u0026 editors file in respective folders (https://github.com/ethereum/RIPs/pull/4).\n\nHappy to see \"RIP editors\" listed in agenda for RollCall #1 meeting. I'll update the PR in case of any change from the meeting discussion.",
        "created_at": "2023-12-12T17:37:34.402000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Cross-layer",
        "parent": "",
        "content": "If eip-7212 has to be moved to RIP GitHub repo, it's better to do it now given updating proposal will not be ideal after moving to `Final` status. \n\nMy recommendation will be to change \"Category\" to `RIP` instead of `Core` while keeping \"Type\" = `Standard Track`.\n\nStandard 14 days wait can be applied to the `Last Call` unless other duration is decided in the Roll Call meeting.",
        "created_at": "2023-12-12T17:37:44.315000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Cross-layer",
        "parent": "",
        "content": "Furthermore, we can include RIP proposals for editorial review and promoting to different statuses in bi-weekly **EIP Editing Office Hour** lead by \u003c@689161464829050960\u003e .  (Proposals can be added here https://github.com/ethereum-cat-herders/EIPIP/issues/301)\n\nBut, it will make sense only if one of the RIP editors join the meeting or Sam agrees and he will be added as RIP editor to be able to merge proposals.",
        "created_at": "2023-12-12T17:38:05.774000+00:00",
        "attachments": null
    }
]