[
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "ok so if i crystallize discussion what can/should be acceptable to all parties:\n\n1. 3 repos, one for core, one for erc and the merged one  for editor's\n2. core and erc repos have their own draft acceptance ruleset (with shared numbering system)\n3. all changes in  core and erc repos are upstreamed by bots/workflows to editor's repo via auto PRs \n4. post drafts core and erc repo also applies editor's ruleset for PR acceptance - this way authros will never have to hop across different repos and can just work/focus/track their repos\n5. editor's repo publishes to the eip url\n6. core/erc editors are seeded to the editors of the core and erc repo respectively",
        "created_at": "2023-07-23T07:29:10.285000+00:00",
        "attachments": null
    },
    {
        "author": "rudolf6",
        "category": "Cross-layer",
        "parent": "",
        "content": "To add a slightly different version of \u003c@792822129019584562\u003e’s suggestion above.. It sounds like a variation that might achieve most of what everyone wants is:\n\n1. Fork out ERCs, so there are two repos total (as in Lightclient’s PR)\n\n2. “EIP editors” and “ERC editors” are both made part of a larger “ethereum editors” group (using placeholder names). This can be under a 3rd repo such as Tim suggested (editors-pm or EIPIP)?\n\nSo after the split is done, there is a single “umbrella” editor organization that all editors are a part of. This mitigates Greg’s concern:\n\u003e When the split is done will there remain a single Editor organization responsible for both EIP and ERCs?\n\nBut also allows for things like unique lists of editors on each side, and supports other ways the repos may need to diverge, while still maintaining some unification for editors themselves and the editing process across all repos. (Since these should be mostly transparent to core devs anyways, and policies around spelling, grammar, link rules etc can be the same across both repos?) \n\nThis would also address Danno’s concern of:\n\u003e We need to adopt the ACD workflow (draft/EFI/CFI/devnet/testnet/final) as well as adding “fork” metadata flags on the ACD side. Changes which are meaningless to the ERC side.\n\nBut I’m neither an editor nor a core dev. This is just my 3rd party (and possibly naive) take 😛",
        "created_at": "2023-07-23T09:52:04.772000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "we need third party voices to find netutral ground, so very much appreciated 👏. \n\nyea something like this should be workable, aim of the third repo is unification post drafts (99% of authors work should be done by the time EIP moves into review) where content of EIP isn't supposed to change much and is about status tracking (and enforcing stricter quality rules which can still be targeted based on if its core or erc eip)",
        "created_at": "2023-07-23T11:16:34.916000+00:00",
        "attachments": null
    },
    {
        "author": "rudolf6",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks! So I was imagining the purpose of the 3rd repo would mostly be as a logistics and coordination-focused repo specifically for the editors. (As opposed to a “publication repo”). The EIPs/ERCs would be 100% completed in each of their respective repos. \n\nBut I can see how this “publication repo” version could make more sense.",
        "created_at": "2023-07-23T11:34:37.644000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "EIP/ERCs can still be completed 100% in their repos (thats where authors will propose state change from for e.g. review to final) and respective editor group will be notified and once they approve, the bot can auto PR updates in the editor's repo",
        "created_at": "2023-07-23T11:37:25.782000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "I mean its all details which we can figure out once we have  consensus on high level structure (and its purpose)",
        "created_at": "2023-07-23T11:39:15.490000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Cross-layer",
        "parent": "",
        "content": "One concern about the \"third\" editor group by a core dev (not me, but I support) is that it would make it hierarchical. i.e. there should be no power over ERC or EIP editors or authors from this third group. If this can be done without a third group I think it would be an easier sell to ACDC and ACDE.",
        "created_at": "2023-07-23T23:07:02.815000+00:00",
        "attachments": null
    },
    {
        "author": "rudolf6",
        "category": "Cross-layer",
        "parent": "",
        "content": "That’s very fair. Is the concern that EIP editors would have some amount of “control” over ERC editors, and vice versa? \n\nIf so, perhaps that need not be a bad thing if the roles/responsibilities of all editors are scoped appropriately? (E.g. EIP/ERC editors agreeing on shared rules around grammar/links/etc)\n\nFwiw, rather than a *hierarchical* 3rd group (that sits above the other 2 groups), I view the 3rd group as more of a *unifying* group that simply brings the EIP and ERC editors together for coordination/communication purposes. The 2 editor groups could choose to operate as independently or collaboratively as they see fit within that structure.\n\n(But I’m also a non-editor sitting here assuming this setup would make sense to the editors)",
        "created_at": "2023-07-23T23:48:09.599000+00:00",
        "attachments": null
    },
    {
        "author": "rudolf6",
        "category": "Cross-layer",
        "parent": "",
        "content": "I suppose in a sense it would accomplish this.. but maybe I’m misunderstanding what you mean here 🙏 \n\n\u003e if this can be done without a 3rd group",
        "created_at": "2023-07-23T23:53:39.700000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Cross-layer",
        "parent": "",
        "content": "Here's an Idea i drafted last week.  I was going to wait until the EIP/ERC settled to share this but given the desire for a \"third group\" it seems relevant.  A new group, Ethereum Community Archives, would aggregate and republish standards and document.  It would have no authority into anyone else's process.  Charter processes would be EIP and ERC.\n\nhttps://hackmd.io/@shemnon/ECA",
        "created_at": "2023-07-23T23:58:40.227000+00:00",
        "attachments": null
    }
]