[
    {
        "author": "paulhauner",
        "category": "Testing",
        "parent": "",
        "content": "I'm working on the optimistic sync specification and could use some input from execution devs please 🙏  Optimistically syncing the terminal block is dangerous for the consensus node at times and I'm trying to figure out how to work around this.\n\nI understand that consensus nodes need to perform optimistic sync so that the execution nodes can see the head of the chain and do a state sync (e.g., snap sync) between the head and genesis (or whatever starting point).\n\nWhat would it be like if the execution node was asked to do a sync between genesis and the terminal block, then it was asked to sync from terminal block to head? I.e., two state syncs rather than one. I'm unsure if the modern sync algorithms can tolerate a sync between two ancient blocks (rather than an ancient block and a recent block).\n\nFYI, I'm not necessarily proposing this, I'm just trying to feel around the design space.",
        "created_at": "2021-12-14T07:22:55.335000+00:00",
        "attachments": null
    },
    {
        "author": "yperbasis",
        "category": "Testing",
        "parent": "",
        "content": "For Erigon sync we are planning exactly this: first sync PoW blocks using our current algo, and then sync PoS blocks from the tip provided by CL.",
        "created_at": "2021-12-14T08:06:30.497000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "I would expect that the world state for the terminal block would wind up being pruned from most nodes and so becomes essentially unavailable on the p2p network. You could still do a full sync (which is what Erigon does) but a snap or fast sync probably won’t work for anything further back than about 1000 blocks.",
        "created_at": "2021-12-14T09:39:13.512000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Testing",
        "parent": "",
        "content": "\u003ctersec\u003e Is the time on the block explorer off? https://beaconchain.merge-devnet-3.wenmerge.dev/blocks suggests it's perpetually set about 5 minutes fast",
        "created_at": "2021-12-14T18:22:29.082000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Testing",
        "parent": "",
        "content": "\u003cparithoshj\u003e please use this explorer instead, its based on the newer tooling: https://beaconchain.devnet3.themerge.dev/",
        "created_at": "2021-12-14T18:25:13.269000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Testing",
        "parent": "",
        "content": "\u003ctersec\u003e oh, and its time is correct too",
        "created_at": "2021-12-14T18:26:00.491000+00:00",
        "attachments": null
    }
]