[
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "Hey everyone! We're planning on launching the Kintsugi testnet next tuesday(planned, can be delayed if required) and wanted to collect some information beforehand. \n\n1. Would all the CL clients have full CL spec v1.1.6 support? Including proposer boosting and all API changes implemented? If not, please start a discussion so we can figure out what features everyone has in common and use that as the minimum requirement for the public testnet.\n\n2. Would all the EL clients have full support for execution-apis v1.0.0-alpha.5 release? (please correct me if this isn't the latest release, still getting used to the EL world). If not, what would be the minimal feature/api support that the ELs can agree on for the public testnet?\n\n3. Have all clients implemented the entire Kintsugi v3 spec? (https://hackmd.io/@n0ble/kintsugi-spec) (or atleast all the features that are required for interoprability)",
        "created_at": "2021-12-10T13:23:37.492000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "1. lodestar will be able to have full CL spec 1.1.6 support by end of next week, Tuesday would be cutting too close. 2. EL interop with v1.0.0-alpha5✅  3. Optimistic sync: lodestar wouldn't attest/publish block/sync contribute on syncing head",
        "created_at": "2021-12-10T14:13:18.473000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "1.) Yes. The later the week, the better. We will not have time to get to the proposer boost. This will take a few more weeks.\n2.) Prysm can interop with v1.0.0-alpha5\n3.) Yes to all the features that support interop",
        "created_at": "2021-12-10T14:26:24.372000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Testing",
        "parent": "",
        "content": "\u003ctersec\u003e 1) Yes, though proposer boost might not happen.\n2) Yes\n3) Yes. with an optimistic sync currently on the more-optimistic side, but that's in flux",
        "created_at": "2021-12-10T14:37:10.913000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "thanks!\nLooks like consensus so far is that we shouldn't include proposer boost as a required feature for the Kintsugi testnet. That should leave us with a very similar testnet to `merge-devnet-3`, which has been stable so far.",
        "created_at": "2021-12-10T16:33:17.436000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "Teku has \"full\" 1.1.6 support.  We have proposer boost though its toggled off by default, the quotes around \"full\" is because optimistic sync is a very moving target currently - we do support it but there are plenty of gotchas and there are changes still being worked out to make optimistic sync fully safe.",
        "created_at": "2021-12-10T20:55:28.919000+00:00",
        "attachments": null
    }
]