[
    {
        "author": "bridge-bot",
        "category": "Testing",
        "parent": "",
        "content": "\u003ctersec\u003e Nimbus and Geth have been stably synced on devnet-1: https://beaconchain.merge-devnet-1.wenmerge.dev/blocks?q=nimbus-geth",
        "created_at": "2021-11-26T01:07:08.684000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "I think we were expecting this but optimistic sync on devnet-1 went very, very poorly.  Both Geth and Besu report INVALID for executePayload when they don't have the parent block. Geth did log that it was requesting headers at one point but it didn't seem to actually do it.",
        "created_at": "2021-11-26T01:11:40.653000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Testing",
        "parent": "",
        "content": "\u003ctersec\u003e Given that https://hackmd.io/xsk9_feiQ3SIYz2yRa1z7Q lists several use cases, all of which suggest using either neither head or the verified ancestor head, what uses are proposed for the optimistic head?",
        "created_at": "2021-11-26T01:31:32.887000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "forkChoiceUpdated calls should use the optimistic head when sending info to the EL is the main use case.",
        "created_at": "2021-11-26T01:34:01.072000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "You'd also likely want to use optimistic head as a starting point when finding a common ancestor for syncing.  But I haven't done that yet in Teku - we'd just wind up re-downloading blocks from the last finalized which is fine as long as your not switching sync targets in the middle of a long period of non-finalization.",
        "created_at": "2021-11-26T01:35:35.281000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "Testing",
        "parent": "",
        "content": "Nice, (that we can at least test it now) do you have a branch or script or documentation for the teku-geth optimistic sync?\nWill try to fix it",
        "created_at": "2021-11-26T08:54:18.879000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "Need to get https://github.com/ConsenSys/teku/pull/4707 merged to make Teku work without setting your CPU on fire.  You could use that branch or we should get it merged into master early next week.  Using --initial-state will make it use optimistic sync since it will jump ahead.  I'll write up some proper instructions for it.",
        "created_at": "2021-11-26T08:58:36.188000+00:00",
        "attachments": null
    },
    {
        "author": "sunil8059",
        "category": "Testing",
        "parent": "",
        "content": "Hey Guys, , I need help if anyone have implemented zkProof verifier in cosmWasm , Just like the verifier.sol which is genrated by snarkjs. We are trying to implement it so can do signature verification. and can submit its proof on chain.",
        "created_at": "2021-11-26T09:05:27.945000+00:00",
        "attachments": null
    },
    {
        "author": "sunil8059",
        "category": "Testing",
        "parent": "",
        "content": "We are trying to put light client inside a circom circuit",
        "created_at": "2021-11-26T09:06:40.606000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "This is not the right channel",
        "created_at": "2021-11-26T09:08:49.129000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Is the enr for the CL in \u003chttps://github.com/eth2-clients/merge-testnets/tree/main/merge-devnet-1\u003e correct? I'm trying to sync on merge-devnet-1  and can't find peers",
        "created_at": "2021-11-26T09:09:59.156000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "Will Teku keep proposing blocks and attesting if there is fully verified justified checkpoint but the head is yet optimistic?",
        "created_at": "2021-11-26T09:10:00.279000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "That's what I was trying to get right with that PR. \nWe're happy to create blocks and attestations so long as the block parent root or the attestation head root is a fully validated block. Since we don't update our chain head for optimistically sync'd blocks (currently we only use the optimistic head for sending forkChoiceUpdated), yes we can continue producing blocks and attestations.\n\nIn the PR I linked above we're deliberately stopping block production if the justified checkpoint is optimistic since at that point we're pretty much guaranteed the block will be orphaned anyway.  We also stop while we're syncing (ie we have peers that have blocks we haven't even optimistically imported yet) because otherwise we try to create a fork from genesis to the current slot at startup and the CPU catches fire. 🙂",
        "created_at": "2021-11-26T09:19:13.120000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "Ok this doesn't really count as proper instructions, but on the assumption you already know how to run geth, here's the teku commands for full sync and optimistic sync:\nhttps://hackmd.io/4wxPMpTcRuqm03j1p0tGpg",
        "created_at": "2021-11-26T09:31:05.864000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "Yea they are correct, its the same i've got configured. I just checked up on the bootnode and its still up and running, logs indicate its getting requests.",
        "created_at": "2021-11-26T09:34:55.732000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Thanks, it must be an issue with my configuration and the baked genesis file, will have to wait for Terence to wake up",
        "created_at": "2021-11-26T09:35:39.427000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "Arguably, CL shouldn't attest and propose while EL is syncing in a normal case, see the discussion here https://github.com/ethereum/consensus-specs/issues/2735\n\nPotentially, it may result in attesting to or proposing on top of invalid block",
        "created_at": "2021-11-26T09:59:02.826000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "We only ever attest to or propose on top of fully validated blocks.",
        "created_at": "2021-11-26T10:01:09.376000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "I see. With `latestValidHash` accompanying `INVALID` status canonical chain blocks that have been considered as fully validated may potentially be invalidated in the edge case scenario. For example, this may happen when EL changes its mind about not yet justified block after it has been upgraded to the version that is containing a bug fix.\n\nI am not sure that attesting to fully verified block while sync isn't finished yet is always safe. Especially, in long period of non-finality there could be 10,000 optimistic blocks on top of fully verified one and they may maliciously influence attestation data.",
        "created_at": "2021-11-26T10:08:28.513000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "I'm not sure it's particularly viable to deal with blocks that were valid suddenly becoming invalid and visa versa. It may be possible to do when restarting, but while running it would create a ton of complexity to handle.\n\nIf the beacon node doesn't believe it's in sync, then it wouldn't attest or produce blocks because it's likely wasting its time, but I'm not sure I see what's dangerous there (unhelpful for the network definitely, but not sure I see danger).  But if we wait until all the payloads can be validated then we run into the problem where the merge block builds on a terminal block that isn't actually available on the network and the chain stalls.\nBasically there's a difficult balance between risking a chain stall by refusing to produce on too old a block or wasting time and resources by creating a fork off that really old block when we just weren't in sync.",
        "created_at": "2021-11-26T10:13:56.356000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "Long periods of non-finalization do tend to create complete chaos with huge numbers of different forks because nodes incorrectly believe they're now in sync when they aren't.  That's what made the Medalla problems so hard to deal with whereas more recent coordinated non-finality hasn't had the same challenge because there was still just one chain.",
        "created_at": "2021-11-26T10:15:14.576000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "I think this question definitely worth discussing. Even though we consider EL changing mind as the case we don't want to deal with, there is difference between attesting to a local head that is far from the canonical one (as for some reason CL went out of sync and thinks that the sync process has finished) and attesting to the fully verified head that is far from the optimistic one. Probably, doing so doesn't weaken the security but this worth discussing and thinking through",
        "created_at": "2021-11-26T10:21:12.153000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "\u003e But if we wait until all the payloads can be validated then we run into the problem where the merge block builds on a terminal block that isn't actually available on the network and the chain stalls.\n\nYes, this is exceptional case, where despite of EL went `SYNCING` upon receiving transition block, CL must keep attesting and proposing.",
        "created_at": "2021-11-26T10:26:41.202000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "Probably I am overestimating the power the optimistic block tree has to influence the fully verified head, hmm 🤔  optimistic chain may influence fully verified head by containing attestations voting for this head but as long as these attestations are valid it should be fine. Attestations and blocks (when proposer boost will take an effect) after fully verified block doesn't have retrospective power to affect fully verified head, right?",
        "created_at": "2021-11-26T11:16:45.412000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "Currently the fully verified head is always a descendant of the optimistic head. So we're finding the optimistic head and then walking backwards to find the most recent fully valid block. Otherwise we'd have to maintain two separate protoarray's and life gets far more complex.\n\nSo yes, votes for blocks that we haven't fully validated yet do influence fork choice and the verified chain head. I think that's part of why the original plan was to not produce or attest if the optimistic head was different to the verified head - effectively that's a sign that the node is not yet in sync, but then we found the potential liveness issue if the merge block winds up being built on a PoW block that isn't actually available.",
        "created_at": "2021-11-26T19:21:16.630000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "I must admit, optimistic sync and all these fun merge corner cases are starting to keep me up at night. The basic idea is good but wow are there ever a lot of little details.",
        "created_at": "2021-11-26T19:27:48.566000+00:00",
        "attachments": null
    }
]