[
    {
        "author": "paulhauner",
        "category": "Testing",
        "parent": "",
        "content": "For Lighthouse \u003c:lighthouse:771417295008432198\u003e\n\n1. Our unstable branch is at v1.1.6, for all things except changes to fork choice (e.g., proposer boost). We expect to have the fork choice changes merged within 24hrs (we are in final review mode).\n2. Yes, full support for execution-apis v1.0.0-alpha.5\n3. Yes, we have all the Kintsugi v3 changes. As mentioned by \u003c@!340345049063882753\u003e, opt sync isn't full specified but we have a *good enough* implementation for now.\n\nWe are planning a release (potentially a beta) later this week, which should make things easier for users (pre-built binaries, etc).\n\nTL;DR: we are on-track for Tuesday but not opposed to a delay.",
        "created_at": "2021-12-13T04:10:29.637000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "The plan for the Kintsugi testnet is basically to run it over the Christmas period right? Asking because I think there's value in having a testnet running over Christmas and not keep trying to spin up new weekly devnets since there will be lots of holidays taken etc.\n\nBut I also don't think we're at the point where we need a \"forever\" public testnet.  Unsurprisingly most of the problems we're getting are either areas of active research/specification like optimistic sync which we know about or around the merge point itself.  Otherwise we seem to be running uneventfully. So testing-wise continuing to spin up short lived devnets and just keep running the merge over and over seems like what's going to flush out the most problems. Can do both of course, just confirming we aren't all thinking this is nearly ready to ship. 🙂",
        "created_at": "2021-12-13T04:24:55.845000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Testing",
        "parent": "",
        "content": "\u003cdannyryan\u003e Yes, kintsugi persistent over holidays so people can play with it. Think Thursday is launch but will defer to @parithoshj.\nAnd yes, spinning up and syncing are the hard parts. Weeklys after the holidays probably makes sense but hive and other testing scenarios that catch stuff before hitting the nete will highly aid stabilizing the hard parts  as well",
        "created_at": "2021-12-13T05:08:36.702000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "Sounds good.  Spinning up a whole new testnet is pretty heavy-weight so definitely good to keep building out tools to make it easy to repeatedly test the transition easily and ideally to control the details of it at the same time to make sure we repeatably hit all the corner cases. I know there's a number of endeavours in this area which is great.",
        "created_at": "2021-12-13T05:10:18.408000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "Hey everyone! \nWe decided to delay Kintsugi by two days (from tuesday to thursday) to give all the teams enough time to push out bug fixes and tests. \n\nLooks like the agreed upon requirements to join would be CL 1.1.6 support (minus proposer boosting), EL v1.0.0-alpha5 and Kintsugi v3 (without \"stable\" optimistic sync).\n\nSo far the participating clients would be: \nEL: Geth, Nethermind\nCL: Teku, Lighthouse, Lodestar, Nimbus, Prysm \n\nGenesis for the testnet should tentatively happen post lunch CEST on the 16.12 (thursday). Expect TTD to be set high to allow users to join in pre-merge. \n\nIn case any other client team is ready, please do let me know. In case any client team wants to run a couple of their own validators this time around, lemme know and i'll set aside a mnemonic for you. \n\nTo make it a bit easier to collect info on versions and images, I've made a small table here: https://notes.ethereum.org/@ExXcnR0-SJGthjz1dwkA1A/HkJ8Aolct/edit\n\nPlease edit the relevant information for you client - we'd use this information for the public guides, etc",
        "created_at": "2021-12-13T10:01:59.839000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "We'd take a break post Kintsugi for the holidays. So people can use the time over holidays to test and play around with it. We'd get back to weekly devnets in Jan, we'd adjust how public it is depending on what features need to be tested.",
        "created_at": "2021-12-13T10:04:31.972000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "Note that proposer boost is out of the scope of persistent Kintsugi devnet",
        "created_at": "2021-12-13T10:42:36.407000+00:00",
        "attachments": null
    },
    {
        "author": "sauliusgrigaitis",
        "category": "Testing",
        "parent": "",
        "content": "Grandine should be ready to join this or next week.",
        "created_at": "2021-12-13T10:44:50.251000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Testing",
        "parent": "",
        "content": "\u003cdannyryan\u003e Yeah, proposer boost is to be rolled out by CL clients prior to merge mainnet but can be on/off on these current nets\nI believe some teams are independently testing on prater currently",
        "created_at": "2021-12-13T15:49:29.841000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Testing",
        "parent": "",
        "content": "\u003cethDreamer\u003e Hey everyone!\nIf you're hacking away with changes on your client and you want to quickly spin up a local multi-client testnet - I've been building this tool for the last couple weeks that makes it (hopefully) really easy. You just need to point to the binaries for the clients you're testing:\nhttps://github.com/ethDreamer/lighthouse-kintsugi-interop",
        "created_at": "2021-12-13T18:59:25.882000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Testing",
        "parent": "",
        "content": "\u003cethDreamer\u003e Strangely enough, my testing is showing no issue with Besu (which appears to be fully v3 compliant) but I AM seeing issues with Nethermind",
        "created_at": "2021-12-13T19:01:22.048000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Testing",
        "parent": "",
        "content": "\u003cethDreamer\u003e this appears to be the opposite of what @parithoshj is seeing?",
        "created_at": "2021-12-13T19:02:31.795000+00:00",
        "attachments": null
    },
    {
        "author": "marekm3498",
        "category": "Testing",
        "parent": "",
        "content": "Yeah, it looks like the opposite of merge-devnet. I am working on the fix",
        "created_at": "2021-12-13T20:02:17.822000+00:00",
        "attachments": null
    }
]