[
    {
        "author": "sky.cactus",
        "category": "Testing",
        "parent": "",
        "content": "It would be better if the consensus client didn't rely on receipts existing forever to function.  😢   We have been telling dapp developers to not rely on receipts for a long time because not all clients keep them indefinitely as they take up a lot of space.  It makes me sad that the CL decided to ignore this advice (or that somehow the advice never made it to the CL designers).",
        "created_at": "2022-08-30T03:44:36.402000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Testing",
        "parent": "",
        "content": "Some sort of receipts snap sync would be significantly better, so the client only needs receipts to track head, but not to initially sync.",
        "created_at": "2022-08-30T03:45:32.417000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "I think ultimately the plan should be to get rid of the need for these deposit receipts entirely and just make them a system operation the EL returns via the engine api. Then we won’t need the eth1 voting process or long follow distance either.",
        "created_at": "2022-08-30T04:13:29.435000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Testing",
        "parent": "",
        "content": "Where would the deposit tree be stored?",
        "created_at": "2022-08-30T04:48:27.971000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Testing",
        "parent": "",
        "content": "Or is the idea to get rid of the tree entirely and just make it so the beacon state balances is all that matters?",
        "created_at": "2022-08-30T04:49:06.532000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Testing",
        "parent": "",
        "content": "These system operation deposits would need to be callable from a contract IIUC, which complicates things I suspect.",
        "created_at": "2022-08-30T04:49:31.778000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "There’s an EIP around for it somewhere I think. Deposit tree isn’t required because the EL becomes the source of the deposit and we trust it to verify it really happened on chain. \nThe EL would just listen for the existing deposit log events when importing a block and create deposit operations from those. I’ll have some of these details wrong as it’s all from vague memory but the EIP held together well when I was actually reading it.",
        "created_at": "2022-08-30T04:56:46.344000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "There is no EIP yet, the proposal is outlined here https://hackmd.io/@n0ble/HkOfKgH_c\nMain issue with any change of this kind is reorg handling on CL side, CL clients will have to invalidate validator's cache entries if those are affected by a reorg that changes deposits order",
        "created_at": "2022-08-30T09:39:59.211000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Testing",
        "parent": "",
        "content": "Can we sidestep that problem by making it so deposits aren't available in the CL until finality?",
        "created_at": "2022-08-30T10:11:24.002000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Testing",
        "parent": "",
        "content": "\u003cn0ble\u003e \u003e \u003cn0ble\u003e  then we would have to maintain deposits queue while one of the goals is to get rid of this complexity (re @amphora_interop_bot: \u003cMicah\u003e Can we sidestep that problem by making it so deposits aren't available in the CL until finality?)",
        "created_at": "2022-08-30T10:52:48.227000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Testing",
        "parent": "",
        "content": "Is it more complexity to delay deposits until finality, or to deal with reorgs in the CL?",
        "created_at": "2022-08-30T10:55:59.393000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Testing",
        "parent": "",
        "content": "\u003cn0ble\u003e \u003e \u003cn0ble\u003e  good question, i think the only part affected by this change is validators cache that is needed for optimisation, no special handling is expected in the protocol itself (re @amphora_interop_bot: \u003cMicah\u003e Is it more complexity to delay deposits until finality, or to deal with reorgs in the CL?)",
        "created_at": "2022-08-30T11:12:02.126000+00:00",
        "attachments": null
    }
]