[
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Did you ever dig into why the long forks didn't just resolve faster? I didn't analyze your data yet (and to be honest with myself I probably won't and I should, so as to look with different eyes) but I analyzed our own dump an Epoch before the finalization after Nimbus went online and I didn't see anything wrong but a bunch of LMD forks as if the network was fragmented, only seeing messages from other forks later",
        "created_at": "2022-08-12T00:39:19+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "I'm still discovering some users with nodes that were affected by the besu bug that caused some besu instance to incorrectly reject a valid block. Those nodes wouldn't have been able to follow the canonical chain and so would have been off on their own fork. When the chain finalized those forks would have all then been invalidated and pruned for nodes following the canonical chain but they would have remained viable if unpopular options until then.",
        "created_at": "2022-08-12T00:48:07.974000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Hmm, but I'm in the case where we had already finalized post merge and was worried about the oscillations in participation cause I can't explain it just by the number of offline nodes. My thesis would be that there were plenty of empty slots and this exacerbates network clusters that are typical in prater with teams running thousands of keys",
        "created_at": "2022-08-12T00:59:19.406000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Testing",
        "parent": "",
        "content": "I haven't looked into the oscillations in participation after the merge finalized. I've only looked at the time between the merge and finalization.",
        "created_at": "2022-08-12T00:59:56.331000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "I right, I misunderstood the \"before the finalization\" bit. Yeah once we finalised the actual merge block, the besu issue won't be relevant anymore as all those nodes would have just been completely knocked off the chain.",
        "created_at": "2022-08-12T01:01:28.619000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I'm not concerned but it's one of those instances where I wish I had seen these dumps in previous forks. I don't see anything that explains the forks except the voting itself. Besides a few obvious ones that were isolated or very late orphaned blocks I don't see why some nodes kept voting for 4 blocks straight on a branch before switching to the one that eventually finalized. Being self peered or close to it would explain it",
        "created_at": "2022-08-12T01:32:48.734000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "it does re-enforce it might be all hands on deck for mainnet in case i guess...",
        "created_at": "2022-08-12T01:34:09.781000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "I'll be taking down goerli-shadow-fork-6 today, do let me know if someone wants it up for testing",
        "created_at": "2022-08-12T08:50:25.069000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "I took a closer look at proto array dump from Paul. All tips are 1-block forks from the canonical chain, except for one: \n`Root: 0x9efd99`, which is a fork of length 4 with no transition, but it has 6% only. I guess it might come from one machine which EL has been misconfigured (or whatever else has happened) and missed the transition\n\nHow frequent are 1-block forks in the healthy network? What is the rate of such forks on Goerli now?",
        "created_at": "2022-08-12T10:35:51.677000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Testing",
        "parent": "",
        "content": "I don’t have firm numbers but I get an email whenever there’s a mainnet reorg. My guess is maybe once/twice every couple of days.",
        "created_at": "2022-08-12T11:19:06.629000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "We have an alert for if \u003ex% of our nodes experience more than 2 reorgs in a span of 5mins - mainly cause we didn't want to get spammed with alerts on shadow forks. \n\nFrom just looking at the dashboard, there have been no reorgs since goerli merged that all nodes have seen. There have been reorgs in a small set of nodes.",
        "created_at": "2022-08-12T11:23:05.505000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "Did these re-orgs occur after the transition was finalized?",
        "created_at": "2022-08-12T11:28:43.431000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "I can send you a link to our dashboard",
        "created_at": "2022-08-12T11:29:20.336000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "Testing",
        "parent": "",
        "content": "FWIW I just scanned our goerli geth logs for `reorg` after the merge timestamp and see a) quite of bit of variance in the output and b) quite a few reorgs common to most/all of our nodes.  I'll try digging in more later, but here's output from 3 different nodes: https://gist.github.com/ryanschneider/54d5d449e8423e82c084c4ae5f9da8aa",
        "created_at": "2022-08-12T16:46:16.689000+00:00",
        "attachments": null
    }
]