[
    {
        "author": "funnygiulio",
        "category": "Testing",
        "parent": "",
        "content": "Hello, Erigon survived the transition and we are now on the tip of the chain, we noticed one thing though, when we sync up post-transition we are spoon-fed each block one by one by the beacon chain and we are thus unable to start reverse downloading the chain, is this normal behaviour?",
        "created_at": "2022-03-16T12:26:07.122000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Testing",
        "parent": "",
        "content": "CL clients are supposed to use optimistic sync towards that end: https://github.com/ethereum/consensus-specs/blob/v1.1.10/sync/optimistic.md",
        "created_at": "2022-03-16T12:47:53.197000+00:00",
        "attachments": null
    },
    {
        "author": "jlokier",
        "category": "Testing",
        "parent": "",
        "content": "That sounds potentially very slow for EL-side post-merge bulk sync, due to lack of pipelining/batching imports, and if it forces a `stateRoot` calculation every few blocks before it can even get the subsequent blocks to start calculating their EL state transition function in parallel.",
        "created_at": "2022-03-16T13:25:21.717000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "What is the trigger for Erigon to start downloading the chain in the PoW network?",
        "created_at": "2022-03-16T16:06:59.167000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "Testing",
        "parent": "",
        "content": "in the POW network we download them by default because it is proof-of-work. in the proof-of-stake, if we get a forkchoice updated and we do not know the head, we reverse download",
        "created_at": "2022-03-16T16:10:01.554000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "Testing",
        "parent": "",
        "content": "i think i know what might be wrong though",
        "created_at": "2022-03-16T16:10:24.842000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "Ah, right. You may reverse download headers in PoS based on the most recent finalized checkpoint. But when the sync is in progress this checkpoint will be updated constantly and it needs to be considered",
        "created_at": "2022-03-16T16:14:57.889000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "Testing",
        "parent": "",
        "content": "Well it needs to be considered for the snap sync, not for the reverse header sync. \nYou can reverse header sync from the snapshot and then forward header sync until head.\nAnd then import the blocks corresponding to the header chain",
        "created_at": "2022-03-16T16:16:24.270000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "Is this possible to specify which chain to download from for a forward header sync? Like by setting a hash of the head of the chain?",
        "created_at": "2022-03-16T16:19:11.973000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "Testing",
        "parent": "",
        "content": "Yes, well we don't forward sync the headerchain, we just include the heads into our existing headerchain and sync in reverse until we find a header that we already have in the db",
        "created_at": "2022-03-16T16:42:16.905000+00:00",
        "attachments": null
    }
]