[
    {
        "author": "paulhauner",
        "category": "Testing",
        "parent": "",
        "content": "Proposal to allow successful transition config exchange before the TTD has been decided: https://github.com/ethereum/execution-apis/pull/285",
        "created_at": "2022-08-10T03:59:51.633000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "I thought we agreed to make this into implementations without the change to the spec. But if the change is required then I am fine with it",
        "created_at": "2022-08-10T08:11:50.713000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Testing",
        "parent": "",
        "content": "Oh I forgot that. It doesn’t seem to have happened yet and it’s a little difficult to create issues on EL repos if I don’t have something to reference.",
        "created_at": "2022-08-10T08:23:41.972000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "Mind raising this on tomorrow's call as well?",
        "created_at": "2022-08-10T08:25:18.718000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "I suspect the next release of ELs will have the MainNet ttd at this point anyway. At least I hope so.",
        "created_at": "2022-08-10T08:29:13.145000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "Probably still worth making it clear in case setting TTD is delayed though (or for the benefit of future testnets that start pre merge for some reason)",
        "created_at": "2022-08-10T08:30:32.698000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "If you think this one is possible to be implemented as it currently suggested by this PR https://github.com/txrx-research/TestingTheMerge/pull/12 then please approve the PR and I will merge it",
        "created_at": "2022-08-10T09:14:52.575000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "Configs for mainnet-shadow-fork-11 are now out: https://github.com/eth-clients/merge-testnets/tree/main/mainnet-shadow-fork-11\n\nTTD is planned to be hit next week thursday (18th Aug).\n\nTooling links:\nhttps://ethstats.mainnetshadowfork11.ethdevops.io/\nhttps://forkmon.mainnetshadowfork11.ethdevops.io/\nhttps://beaconchain.mainnetshadowfork11.ethdevops.io/\nhttps://explorer.mainnetshadowfork11.ethdevops.io/",
        "created_at": "2022-08-10T10:48:16.838000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Multiple forks is the main issue in fact, but several different flavors of it, with the right post pruning head being in the same branch, in the second, in the third, etc. Also with things like proposer boost being applied to the pruned branch and the others etc. The combinations for this test are endless, with pulled tips playing it becomes a very large testsuite in itself",
        "created_at": "2022-08-10T12:19:37.229000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "\u003c@602753420033785856\u003e I was pointed to your \u003chttps://github.com/sigp/lighthouse/pull/3447\u003e pessimistic sync branch. I am very curious how do you recover from ELs that return ACCEPTED or SYNCING on non-canonical blocks when you call `notify_newPayload`?  I was thinking on disabling all optimistic sync paths (specially dealing with invalid blocks) on regular sync but keeping them on initial sync on prysm. But thought that a node that doesn't execute even a shallow fork will be offline until it reverts to init sync and then sync back up to head.",
        "created_at": "2022-08-10T20:40:13.706000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "My hope is that if the EL gets provided the same block _again_ via `notify_newPayload` then it will return `VALID`. So the flow would be something like:\n\n1. CL gets the re-org block on gossip, sends it to the EL\n2. EL says SYNCING\n3. Pessimistic CL stops importing the block\n4. CL sees other peers with that block as head (or attestations to that block), and requests it via RPC\n5. CL provides the block to the EL and it returns VALID\n6. Block is head now, forkchoiceUpdated proceeds as normal\n\nThe potential slow part is step 4, which almost guarantees that validators attached to the CL will miss head on that slot. This might be an acceptable trade-off for now, or could be accelerated by trying to cache the payload explicitly for this purpose. It would be kind of nice if the EL had a callback for when it finished syncing 😅 \n\nAs I mentioned in the PR description this is also guaranteed not to work with any EL that doesn't process forks on `newPayload`, i.e. Erigon.",
        "created_at": "2022-08-10T23:27:58.100000+00:00",
        "attachments": null
    }
]