[
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "\u003e I am unsure why it didn't throw an error with other clients, perhaps they handle that field differently?\nnot sure - we have a pretty strict check on startup to prevent config/database mismatches (ie starting prater with a mainnet database) but I believe the exact semantics of non-phase0-genesis simply hasn't been written down in the spec since it doesn't happen in the wild - we could loosen the check as well, but I'd rather have more \"natural-looking\" genesis states - I guess one could argue this particular issue both ways though and the important thing would be to settle on one approach and write it down somewhere",
        "created_at": "2022-11-11T07:26:56.748000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "basically, if there's no test case in the spec repo, there's no right or wrong 🙂",
        "created_at": "2022-11-11T07:27:52.711000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "\u003c@412614104222531604\u003e \u003c@360491619402776577\u003e  \u003c@792822129019584562\u003e this channel is better for devnets. The bad blocks you got on Geth were with Prysm or you were trying only lodestar? We haven't switched yet to the new version of my PR merged in the specs. Will do tonight. But also we're hitting a bad blockhash on slot 72 that I haven't been able to diagnose yet. Will try tonight",
        "created_at": "2022-11-11T20:11:02.237000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "Testing",
        "parent": "",
        "content": "It was \u003c@360491619402776577\u003e ‘s mess as he thought shanghaiBlock was renamed to ShanghaiTime",
        "created_at": "2022-11-11T20:14:55.956000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "Testing",
        "parent": "",
        "content": "Which it wasn’t",
        "created_at": "2022-11-11T20:14:58.909000+00:00",
        "attachments": null
    }
]