[
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "what would be nice is to settle relatively soonish on a JSON format for this message, something as simple as \n```json\n{\n  \"message\": {\n    \"validator_index\": 7654,\n    \"from_bls_pubkey\": \"0x...6f8e2ae4008e867\",\n    \"to_execution_address\": \"0x....ab973\"\n  },\n  \"signature\": \"0x912ab4f...\"\n}\n```\nWould probably do, but having a standard that these tooling generates would be nice so that clients just implement importing a file and not the signing itself",
        "created_at": "2022-10-28T09:21:49.169000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "That's a simple JSON representation of the spec, and makes sense.  Only thing I would add is to make it an array.\n\nAlthough note that most clients won't even need to import the JSON through a file, as there will be a REST API endpoint for it.",
        "created_at": "2022-10-28T09:32:47.625000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Yeah but whatever CLI command we do it needs to be fed something, the UX should be you run `ethdo` or `staking_cli` airgapped, it outputs *something* and then you run `teku withdraw something` on your staking machine. That something makes sense to me that it's a JSON as above. I'm happy if it's a different something, but whatever it is I'd like it to be defined in the next week so that we can implement the full endpoints right now.",
        "created_at": "2022-10-28T09:35:33.336000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "You can run `ethdo` on your online computer to send it, although frankly if you have generated the file already the same job could be done with `curl` and a bit of scripting.\n\nThe API is defined at https://github.com/ethereum/beacon-APIs/pull/248/",
        "created_at": "2022-10-28T09:39:20.573000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "yeah that I want to avoid: it's fine if `ethdo` can send the messages, but clients need to implement this too and users shouldn't need to depend on one or another tooling to send their messages. And yes, a user with a JSON or ssz representation of the message should be able to do a curl, but I don't want to have to rely on users having `curl` in their systems (most Windows users don't) nor know how to POST, etc.",
        "created_at": "2022-10-28T09:44:31.098000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I can give you a branch that will work with 3024 implemented for testing next week, on your end it shouldn't make a difference, but on the CL side it's a consensus break from the current specs",
        "created_at": "2022-10-28T09:46:51.843000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "Fair enough, I think we should go with the array of signed messages then as our _de facto_ standard, unless anyone has any objections.\n\n(For voluntary exits `ethdo` does add other information, but that's mainly because they can hang around on the filesystem for a while and expire.  Not sure that this is relevant for the credential change operation so keeping it simple seems like the best option.)",
        "created_at": "2022-10-28T09:55:43.311000+00:00",
        "attachments": null
    }
]