[
    {
        "author": "marekm3498",
        "category": "Testing",
        "parent": "",
        "content": "We're curious if it is a problem for other EL implementations. Any thoughts from other EL devs?\n\nContext:\nDuring sync we need information about peers - what is their current block ect. We use this information to decide which messages send to which peers. For now in eth protocol we use NewBlockMessage and NewBlockHashesMessage to trigger refreshing of this data (when we get hashes we can DL the BlockHeader if needed).\n\nSo now those messages won't be broadcasted, so I wonder how other clients handle it, is that a problem for them?",
        "created_at": "2022-04-15T10:54:02.838000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "Just catching up with the ACD call now, just to clarify none of the EF validators are on any internal network. They're in principle the exact same as any other client team running a node/validator on the network. I agree that it was useful to have a more \"centralized\" set for quick testnets, but we're at a stage now that we can distribute keys more widely on different types of infra.  \n\nIt's a bit last minute, but in case any client teams want to run validator keys on the goerli shadow fork 4, do reach out. Its too late to change the genesis validator set, but we can perform deposits or I can transfer some EF keys 😃 \n\n`mainnet-shadow-fork-2` doesn't have a genesis validator set defined yet, so reach out now if you want to be a part of it (client teams/advanced users only please).",
        "created_at": "2022-04-15T18:48:00.024000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Testing",
        "parent": "",
        "content": "is this the same deposit contract as goerli-sf-3? are do we need to re-queue",
        "created_at": "2022-04-15T23:03:41.261000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Testing",
        "parent": "",
        "content": "Anyone know if the geth console can give me a transaction receipt in RLP? Need it to prove a receiptsRoot",
        "created_at": "2022-04-15T23:06:46.763000+00:00",
        "attachments": null
    }
]