[
    {
        "author": "mariusvanderwijden",
        "category": "Testing",
        "parent": "",
        "content": "\u003c@340345049063882753\u003e \u003c@892053833121923094\u003e Found and fixed the issue here: https://github.com/ethereum/go-ethereum/commit/62470eeaf8c6d4b360cb228b25941cef2a98e1cf",
        "created_at": "2022-07-04T09:06:57.200000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "If want to have optimistic sync tests incorporated into CL test suite then we'll have to make Optimistic Sync spec a part of consensus specs which is something that makes the spec too opinionated about implementation. So, Hive seems the only place to have optimistic sync tests + lvh implemented.\n\nWe have a very basic one in the list, not sure if it's been already implemented (see `SYNCING` with invalid chain here https://github.com/txrx-research/TestingTheMerge/blob/main/tests/engine-api.md#cl-client-tests)",
        "created_at": "2022-07-04T11:50:03.674000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I disagree with this, optimistic sync is part of the consensus spec already, just that it's optional. We're requesting that optional testvectors for this optional feature be provided. I don't see why there would be a pushback against this, if you don't like you just don't implement them and no harm done. I'd feel better if I new that prysm passes the same testvectors as other clients, the more clients participate in this scheme, the better I'd feel.",
        "created_at": "2022-07-04T11:59:57.438000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "The core consensus spec isn't aware of optimistic sync and Engine API statuses, the dependency is in the opposite direction. \n\nHaving a separate optional test suite would require maintaining a modified version of the spec with at least `VALID/INVALID/SYNCING` statuses in response to `notify_new_payload/notify_forkchoice_updated` methods. I really feel like Hive is a better place for such test scenarios, though, it might be hard to implement these tests with Hive",
        "created_at": "2022-07-04T12:10:31.284000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "We do not need the core consensus spec to pass these tests, it is also optiional for the python implementation 😄",
        "created_at": "2022-07-04T12:55:00.097000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "We could probably do this off-spec and coordinate some testvectors with the same format among client teams, but it kind of defeats the purpose of having a central specification repo. This is something very useful to have.",
        "created_at": "2022-07-04T12:55:59.290000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "from CL's perspective, optimistic sync affects the fork choice immensely, and having spec tests for them in the current consensus spec format would be a immensely valuable (without having to spinup an EL) and have `engine` shenanigans , and as \u003c@755590043632140352\u003e pointed out the form factor of the tests will allow adding some complex scenarios, does not matter which repo they are located (as long as it is coupled with forkchoice spec tests)",
        "created_at": "2022-07-04T12:56:25.500000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "just an example of the kind of test vectors i am looking for (work in progress): https://github.com/ChainSafe/lodestar/pull/4182/files#diff-1b00b93efb9907b2a84ed5a94b2acba3deab93c83f5f659a8606668a5b96a7bd",
        "created_at": "2022-07-04T13:01:11.421000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "\u003c@425572898787426305\u003e I know this has been endlessly discussed, but perhaps we can change this phrase\n```\nwhere validHash is the block hash of the most recent valid ancestor of the invalid payload. That is, the valid ancestor of the payload with the highest blockNumber\n```\nIn \u003chttps://github.com/ethereum/execution-apis/blob/main/src/engine/specification.md#payload-validation\u003e to explicitly state that the child of the LVH has to be INVALID. Something like\n```\nwhere validHash is the block hash of the unique block satisying\n- It is a VALID ancestor of the invalid payload\n- Any ancestor of the invalid payload with higher blockNumber is INVALID.\n```\nI know that all ELs can't return INVALID without having validated the whole chain, but still, this assumption is used on all CL and it's not explicit in the spec is it?",
        "created_at": "2022-07-04T15:03:35.814000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "TBH, I don't see the difference between these two statements. It sound more like a clarification to me. Am I missing anything?",
        "created_at": "2022-07-04T15:12:57.411000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "In principle the child of the LVH could be optimistic still. We have the explicit assumption that a block being VALID implies that all the ancestors are valid, but I don't  think there is an explicit mention that a block being INVALID implies that all the ancestors are either VALID or INVALID",
        "created_at": "2022-07-04T15:14:50.780000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I know this means zero changes to any implementation, but still it's a little more clear to me at least.",
        "created_at": "2022-07-04T15:15:14.319000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "Do you mean that in the current spec it might be read as an ancestor with a higher blockNumber is either INVALID or SYNCING?",
        "created_at": "2022-07-04T15:25:05.646000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "yep",
        "created_at": "2022-07-04T15:25:17.961000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "One could mistakenly think that the unique child between the LVH and the invalid payload is too premature to prune it as INVALID",
        "created_at": "2022-07-04T15:26:11.001000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "I am not opposed to this kind of clarification, would you mind to submit a PR?",
        "created_at": "2022-07-04T15:26:43.008000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I don't, finishing a document on optimistic sync right now (that's why I went reading those sentences) and will submit one right after",
        "created_at": "2022-07-04T15:27:19.383000+00:00",
        "attachments": null
    },
    {
        "author": "lukaszrozmej",
        "category": "Testing",
        "parent": "",
        "content": "\u003c@425572898787426305\u003e in `newpayload` there is `Client software MUST validate the payload if it extends the canonical chain and requisite data for the validation is locally available. The validation process is specified in the Payload validation section.`\n\nWhat is `extending canonical chain`? Is it parent == head, or ancestor == head and we have one branch only or consider this branch probably canonical (main state branch)",
        "created_at": "2022-07-04T15:47:44.717000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "`ancestor == head`, the other part of this statement is that the state is available which must be the case when `parent == head` but might not be if e.g. `grand_parent == head`",
        "created_at": "2022-07-04T15:56:46.394000+00:00",
        "attachments": null
    }
]