[
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "10k Teku validators up and running. 🚀  Proposer boost at 40% enabled on them as well since they're running the latest develop build.",
        "created_at": "2022-05-24T00:32:52.395000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "And I'm seeing Lighthouse peers as well. Not sure who's running those but it's a good sign the config is right if it's finding other clients. 🙂",
        "created_at": "2022-05-24T00:33:27.331000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Testing",
        "parent": "",
        "content": "They're probably our nodes 🙂 Hi neighborino 👋",
        "created_at": "2022-05-24T00:38:03.939000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "we just merged the 40% change as well as the new spec tests, they should be baked in and Taran should have the nodes up today/tomorrow.",
        "created_at": "2022-05-24T00:38:48.960000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "Will there be another release of teku with this config change in it before genesis?",
        "created_at": "2022-05-24T04:56:17.273000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "No we aren't planning to do another release for this. It's not a consensus breaking change so no harm in it being different.",
        "created_at": "2022-05-24T04:57:21.773000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "This parameter is supposed to be changed as a part of client distribution change. A release of new client versions with this parameter set to agreed value is what we kept in mind while introducing this type of override. Though, clients may have support of CLI arg that overrides this value, also, note that CL client does also have `TERMINAL_BLOCK_HASH_ACTIVATION_EPOCH` parameter that must be set if terminal block hash override is activated -- otherwise, it won't work on CL side.\n\nEL side must have `TERMINAL_BLOCK_HASH` + `TERMINAL_TOTAL_DIFFICULTY` overridden, and these two must point to the same block. TTD override in this case is also required because of EL clients specifics (EL clients has TTD as a fork trigger, TBH doesn't trigger a fork but whitelists the chain that EL is allowed to follow).\n\nConsidering the complexity of overrides on both layers I would supposed we rather have a release cut of all clients with correctly overridden parameters to avoid misconfiguration issues. It might worth having CLI args to make these overrides into tests tho",
        "created_at": "2022-05-24T09:43:45.051000+00:00",
        "attachments": null
    }
]