[
    {
        "author": "tersec",
        "category": "Testing",
        "parent": "",
        "content": "This being implementation-specific is problematic with regard to checkpoint sync, or rather, it might not be an `eth_getBlockByFoo` issue but a question of whether `engine_newPayload` is defined in a way that it's safe to use speculatively to check for the presence of a previous block that the CL never, itself, might have seen.\n\nCurrently, there are multiple standards for whether a block or payload \"exists\":\n1. literally, for any reason, did it manage to land in the execution client's database (but it might be, in engine API terms, blatantly `INVALID`)\n2. should be a sane-looking block in isolation but might or might not be part of any valid chain (something like `SYNCING` or `ACCEPTED` in engine API terms, though they don't guarantee any immediate `INVALID` in case 1 as far as I can tell)\n3. known to be part of a chain because it's known to be an ancestor of a block known to be part of a chain\n4. known to be part of a chain because a variation of (3) plus having state synced\n5. known to be part of a chain by standards of (3) but not (4)\n\nAnd I'm sure there are other case I've missed.\n\nThe general theme here is that the engine API basically works [yes, I saw the discussion before, and I stand by this] for optimistic sync and exclusively optimistic sync, and as a result, Nimbus is implementing it and there's a PR right now, but this isn't a great situation.",
        "created_at": "2022-06-27T11:16:08.217000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Testing",
        "parent": "",
        "content": "`eth_getBlockByFoo` is... not well-defined in these terms currently, and nothing implementation-specific can be trusted in this context.",
        "created_at": "2022-06-27T11:17:30.819000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Testing",
        "parent": "",
        "content": "Also -- in light of https://github.com/ethereum/go-ethereum/pull/25166 Nimbus is removing use of `net_version` in lieu of `eth_chainId`: https://github.com/status-im/nimbus-eth2/pull/3804",
        "created_at": "2022-06-27T11:19:13.195000+00:00",
        "attachments": null
    }
]