[
    {
        "author": "robocopsgonemad",
        "category": "Testing",
        "parent": "",
        "content": "how are people doing on peers on ropsten? we are floating between 10-20, can't maintain a solid 25.",
        "created_at": "2022-06-15T16:00:24.790000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "Execution layer or consensus layer?",
        "created_at": "2022-06-15T16:06:55.567000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Testing",
        "parent": "",
        "content": "execution",
        "created_at": "2022-06-15T16:07:58.825000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Testing",
        "parent": "",
        "content": "i have been unable to find incorrect disconnections to far, so maybe its a discovery problem...",
        "created_at": "2022-06-15T16:08:38.650000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "Testing",
        "parent": "",
        "content": "almost all of our geth/teku pairs have a solid 50 peers, one recently restarted and has slightly less, I don't have any other pair combination running on ropsten.",
        "created_at": "2022-06-15T16:54:13.554000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "I have limited our execution nodes to 30 peers, and they are sitting happily at that +/- 1",
        "created_at": "2022-06-15T17:41:45.980000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "Just checked, and last time I restarted a besu node it took around 1 hour to come up to 30 peers, and this was roughly linear over the hour.",
        "created_at": "2022-06-15T17:43:24.486000+00:00",
        "attachments": null
    },
    {
        "author": "raulj",
        "category": "Testing",
        "parent": "",
        "content": "Hi all, in Prysm we're planning on not storing full bellatrix blocks in our db but rather blinded ones. We have been testing this out on Ropsten and using blockByHash requests to the EL client when we need to reconstruct full blocks. We are wondering why we need full bellatrix blocks over p2p rather than just blinded ones ?",
        "created_at": "2022-06-15T20:53:04.867000+00:00",
        "attachments": null
    },
    {
        "author": "raulj",
        "category": "Testing",
        "parent": "",
        "content": "Our approach has been working well in local testing",
        "created_at": "2022-06-15T20:53:13.176000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Testing",
        "parent": "",
        "content": "\u003cdannyryan\u003e you definitely need to be able to pass the full block over p2p (both gossip and historic block retrieval) so that other nodes on the network can get the full block and because CL is the only perspective on cryptoeconomically correct/valuable payloads\n\nin the normal case, EL doesn't have to go to p2p for getting a block, it is just inserted from the beacon node. Only in failure cases (or not-in-sync) cases does EL resort to it's p2p layer to try to fill in the gaps.\n\nIf instead, just a reference to the block was passed to EL, then in *every* case, the EL would have to do a round trip request to the network to get the payload and validate it which would put a very high latency on this task.\n\nadditionally, a payload couldn't be annouced/gossiped on the EL p2p alone, without the consensus layer/beacon block. This is because there is no crypto-economic seal on the payload (no pow or pos signature) that EL can independently validate to actually forward the block along. This means that (1) the CL must gossip the block to disseminate it in the first place and (2) if it didn't then there'd be no node to request it from in the example I give in the previous paragraph",
        "created_at": "2022-06-15T22:07:09.989000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Testing",
        "parent": "",
        "content": "\u003cdannyryan\u003e deduplicating in your local CL+EL node is very fine, but I don't tihnk we can remove the requirement of sending these loads over CL p2p.\n\nlighthouse has a similar approach to what y'all are doing and there is an open proposal to more systematically enable this deduplication through a getPayloads type request on Engine API. I think we are waiting on some addiitonal input from EL clients before merging the proposal",
        "created_at": "2022-06-15T22:10:13.610000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Testing",
        "parent": "",
        "content": "link to proposal?",
        "created_at": "2022-06-15T22:31:29.193000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Testing",
        "parent": "",
        "content": "\u003cdannyryan\u003e https://github.com/ethereum/execution-apis/pull/218",
        "created_at": "2022-06-15T22:31:56.079000+00:00",
        "attachments": null
    }
]