[
    {
        "author": "philngo",
        "category": "Testing",
        "parent": "",
        "content": "Lodestar has just released `v0.41.0` which supports the Goerli/Prater merge. Many additional inclusions like mev-builder. More information on the action packed release on our Lodestar announcements channel in ChainSafe:\nhttps://discord.com/channels/593655374469660673/741761870033191013/1000188435086200863\n\nFull changelog here: https://github.com/ChainSafe/lodestar/releases/tag/v0.41.0\n\nWe also just released our `lodestar-quickstart` scripts (previously called merge-scripts) which automates spinning up Lodestar BN/VC + Besu/Erigon/Geth/Nethermind Docker combinations with minimal configuration and 1-line startup. You can use the setup guide here: https://hackmd.io/@philknows/rJegZyH9q  \n\nTestingTheMerge 🐼 with minority CL/EL clients for Goerli and then... mainnet! 🚀",
        "created_at": "2022-07-23T00:00:55.864000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Sending FCU to the transition block in this scenario is also possible on our side since we have imported that block. And this will solve this issue as well.  I don't see any huge blocker on our side to do so, but it will be a somewhat major change to our block processing logic that I would be very opposed to carrying so close to the merge.",
        "created_at": "2022-07-23T10:31:54.884000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "By the way, \u003c@361447803194441738\u003e even if importing the merge block when it's ACCEPTED is deemed safe, this will also be a headache for us cause it will force us to separate the SYNCING from ACCEPTED responses",
        "created_at": "2022-07-23T10:35:22.813000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Testing",
        "parent": "",
        "content": "How do you send an fcU for a block that returned ACCEPTED/SYNCING but was not safe to import optimistically? It should never enter the fork choice tree. \n\nThe problem is when the EL won’t sync a chain unless it gets an fcU. IIIC, this is how Erigon works. If CL won’t import and send fcU until EL syncs, but EL won’t sync until it gets an fcU then we get stuck.",
        "created_at": "2022-07-23T11:20:24.774000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I  mean the transition block as in the TTD block, not the merge one",
        "created_at": "2022-07-23T11:21:35.933000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "If we do that and send new payload immediately that solves this issue",
        "created_at": "2022-07-23T11:22:14.518000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "We can in theory do this now, but it would be rather a big refactor IMO... And a buggy one",
        "created_at": "2022-07-23T11:22:48.446000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Testing",
        "parent": "",
        "content": "I agree it would work. I also agree it’s tricky.",
        "created_at": "2022-07-23T11:24:00.908000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "You'd already have to send a FCU with the TTD block as head if you're going to propose the merge block since that's how you get the EL to create the merge block payload. Teku is actually sending FCU with the TTD block as head even if it's not proposing if the current head isn't merged yet. But it's the terminal block that Teku picked, not necessarily the one required for the fork that we can't import yet so I don't think it would help.\n\nYou'd specifically need to send FCU with the parent payload hash of a block that you rejected importing which sounds potentially dangerous. Probably could be made safe if you confirmed the parent hash was known to the EL first though I guess.",
        "created_at": "2022-07-23T21:40:08.570000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I'm completely lost here, the solution mentioned above is:\n1) CL gets terminal A (VALID, imported)\n2) CL gets terminal B (ACCEPTED, imported) \n3) CL gets C, child of B -\u003e FCU to B then newpayload (C). \nNo block is ever rejected to be imported",
        "created_at": "2022-07-23T22:10:16.303000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "But you can’t import terminal B because it’s within the safe slots to optimistically import period. At least that was my understanding of the issue. The CL can’t import optimistically because of safe slots and the EL won’t execute it unless it’s made canonical. It will never be canonical because the CL can’t import it.",
        "created_at": "2022-07-23T22:19:22.251000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "But maybe I’ve misunderstood something. This conversation spanned a few days. 🙂",
        "created_at": "2022-07-23T22:19:47.342000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Ah I may be misremembering the spec and also our implementation but ( I think) we import any block that is not execution enabled. I will have to review our implementation but if we do and this goes against spec we can fix this but I don't see anything wrong with this since the problem with forkchoice poisoning happens only when importing optimistically post merge blocks. It's always good to import pre merge blocks",
        "created_at": "2022-07-23T22:25:07.002000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Actually, perhaps I'm misremembering here, but I think we don't even send the new_payload until the block is execution enabled.",
        "created_at": "2022-07-23T22:35:45.722000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "so the above about VALID/ACCEPTED is already misleading",
        "created_at": "2022-07-23T22:36:12.591000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Testing",
        "parent": "",
        "content": "\u003cdannyryan\u003e If ACCEPTED actually means the chain is well-formed and it's ancestors exist, then sending a FCU shouldn't have the fc poisoning issue",
        "created_at": "2022-07-23T22:39:13.500000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Testing",
        "parent": "",
        "content": "\u003cdannyryan\u003e But ACCEPTED and SYNCING have not been necessarily used with the expected semantics iiuc",
        "created_at": "2022-07-23T22:39:33.319000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Testing",
        "parent": "",
        "content": "\u003cdannyryan\u003e If sending a FCU to ACCEPTED means it would respond with INVALID or VALID then I believe no issue. But some clients don't necessarily operate like that",
        "created_at": "2022-07-23T22:41:41.054000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "The issue here is that we won't send that FCU to the TTD block, we would only send to the child but to get there we need to import it first. What I'm saying is that we can prevent this by actually sending an fcu to the TTD block before sending the new payload for the merge block",
        "created_at": "2022-07-23T23:00:24.897000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "cc \u003c@363800010518822915\u003e perhaps this is not as bad as I originally thought since we validate the terminal block before it reaches `onBlock`. Seems we can just call FCU right there without touching forkchoice (in particular not doing anything to our head)",
        "created_at": "2022-07-23T23:18:20.241000+00:00",
        "attachments": null
    }
]