[
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "It's hard to have the case when PoW block is invalid and is coming from a remote peer because remote peers doesn't serve invalid blocks. But with recent modifications to the simulator it might be possible.",
        "created_at": "2022-07-11T08:52:52.597000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "Why would CL consider validity of PoW blocks anyhow? PoW blocks are in EL's area of responsibility. In this case CL should remove the branch in question starting with a transition block",
        "created_at": "2022-07-11T08:54:39.528000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "That's right, and that's what we would do. Just pointing that nothing would prevent us from importing another merge block from the invalid terminal block in that branch",
        "created_at": "2022-07-11T10:41:52.442000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "EL should say that another block is invalid too. So, EL should be preventing from importing anything on top of invalid terminal block",
        "created_at": "2022-07-11T10:49:02.079000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "The reason I think this test is reasonable is because I suppose a possible bug is for the EE to return the powhash. In which case we will only remove the tip of the branch",
        "created_at": "2022-07-11T10:50:11.561000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Also, my understanding from \u003c@792822129019584562\u003e' s messages above is that there' s a chance that Lodestar will simply fail hard in this situation.",
        "created_at": "2022-07-11T10:55:16.671000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "I've submitted a PR with this test: https://github.com/txrx-research/TestingTheMerge/pull/8",
        "created_at": "2022-07-11T11:28:32.495000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "correct, in this scenario we would have failed hard to process a pow block hash (of a block pre-merge/pre-terminal) which we  obviously would not find in our forkchoice. \nBut i took your wisdom about being as forgiving as possible, so we would also just invalidate the execution payload which evaluated to invalid with a LVH pre-terminal. \nStill its anyway cleaner to give `0x00..00` so that CL doesn't find itself in a bad place. so +1 from my side for the test!",
        "created_at": "2022-07-11T15:43:47.791000+00:00",
        "attachments": null
    }
]