[
    {
        "author": "radekkapka",
        "category": "Testing",
        "parent": "",
        "content": "Hi guys, I have an idea for an interop test scenario. I think it would be worthwhile to assess if all clients keep working properly when the client distribution changes so that one client gains the majority of the network, e.g. 70%. I propose to start with 25% each and then turn off some amount of validators for each client except the client under test so that this client's participation rises to 70% (or something similar, we can even experiment with different values). This will show if a client can handle such load. We can run this test 4 times, once for each client.",
        "created_at": "2022-01-24T12:33:18.460000+00:00",
        "attachments": null
    },
    {
        "author": "marioevz",
        "category": "Testing",
        "parent": "",
        "content": "Hi all, I'm currently working on a network-partition test case for the merge in hive, I'm currently using Lighthouse and having a bit of trouble reconfiguring the --enr-address to a different network IP after the initial configuration, is there a way to modify this during runtime? (in order to obtain the appropriate ENR value from /eth/v1/node/identity)",
        "created_at": "2022-01-24T22:21:41.219000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Testing",
        "parent": "",
        "content": "We don't have a direct way to modify the ENR IP address at runtime. It might be modified if enough nodes indicate that it's IP has changed. You can try deleting the `beacon/network` directory if you want a \"fresh start\" from an ENR perspective. I would expect `--enr-address` to modify the ENR, though. Would there be a bunch of peers on the network telling the node that the initial IP address is still the one?",
        "created_at": "2022-01-24T22:48:22.544000+00:00",
        "attachments": null
    },
    {
        "author": "marioevz",
        "category": "Testing",
        "parent": "",
        "content": "Yes, they are actually connecting via the original network, the docker \"bridge\", instead of the new network created to simulate intermittence, because this later network is only created after the LH node has already started",
        "created_at": "2022-01-24T22:54:30.189000+00:00",
        "attachments": null
    },
    {
        "author": "marioevz",
        "category": "Testing",
        "parent": "",
        "content": "can --boot-nodes be fed with IP addresses instead of ENR ?",
        "created_at": "2022-01-24T22:55:05.448000+00:00",
        "attachments": null
    },
    {
        "author": "marioevz",
        "category": "Testing",
        "parent": "",
        "content": "I'm trying Multiaddr now, it seems to be working 👍",
        "created_at": "2022-01-24T23:18:39.388000+00:00",
        "attachments": null
    }
]