[
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "Vouch is not a builder, it acts in a similar way to MEV-boost. It does not have the execution payload, and cannot send it to the execution layer (until the payload has been unblinded, then it sends a full signed beacon block to all beacon nodes).",
        "created_at": "2023-03-12T00:21:50.445000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Ok so this is different than what was said above. So you need someone to build a payload right? In that case to use our local payload and return it blinded to vouch we would need to implement also the full builder API and return the full block when you request it right?",
        "created_at": "2023-03-12T00:32:19.400000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "Sorry my bad for overloading the mev-boost vs relay vs builder role. From Lighthouse’s perspective Vouch is the “builder” (mev-boost) because that’s what we point the BN at with `--builder-url`\n\nRather than Prysm implementing the builder API this is where I was imagining the local-builder would fit it, it could be configured as one of the builders that Vouch calls out to",
        "created_at": "2023-03-12T01:15:59.064000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "Doing what Lighthouse does (returning the local payload as a blinded block) is insufficient because Vouch wants to choose the payload prior to calling the BN",
        "created_at": "2023-03-12T01:16:50.134000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "nice writeup 👍 , may be a an independent censorship module can be developed which can give censorship score with an overall analysis, it doesn't need to like in EL",
        "created_at": "2023-03-12T05:16:44.707000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Talking about reorgs. What does local execution do in this case? We sent a newPayload for N+1 but didn't send fcu for it. We then send fcu to our previous head N with attributes to build on top of it. Will the EL include transactions that were in N+1? Cc \u003c@360491619402776577\u003e",
        "created_at": "2023-03-12T17:22:40.408000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "Will the withdrawals be based on N or N+1? I'd think EL will complain if the withdrawals are based on N+1",
        "created_at": "2023-03-12T17:27:16.930000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "it should include the txs from N+1 as per my understanding of how txs are picked from txpool in ethereumjs (selection is based on setting the head state and then checking nonces etc). Any tx pruning should be based on finalized\n\nEL doesn't care about withdrawals, they come in the fcU, so it just applied it on the state",
        "created_at": "2023-03-12T17:30:11.708000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "Isn't withdrawals part of attribute field?",
        "created_at": "2023-03-12T17:43:58.628000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "yes, EL just applies what withdrawals comes in fcU on the head state (from headBlockHash) as provided by fcU to build block on",
        "created_at": "2023-03-12T17:44:48.161000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "so its CL's job to send withdrawals ~~based on~~ for N+1 (for the reorged N+1) if N is the headBlockHash in fcU",
        "created_at": "2023-03-12T17:46:31.111000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "there are no checks in EL for what withdrawals should be as its unaware of the CL state (and they can change based on reorg because of the ~~nextWithdrawalValidatorIndex~~ changed blsChanges or rewards penalities in the validator set of expected withdrawals )",
        "created_at": "2023-03-12T17:49:42.676000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "Vouch takes a payload using the relay API, for example from one of the well-known relays.  To use your local payload we would indeed need prysm to implement the relay API, but this does seem to be overkill compared to prysm just not overriding the request to obtain the payload from the supplied builder URL.",
        "created_at": "2023-03-12T21:33:56.415000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Withdrawals are based on N",
        "created_at": "2023-03-12T22:15:14.457000+00:00",
        "attachments": null
    }
]