[
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Along the same lines as this one. I'll  most probably will open another one tomorrow for GetBlindedBeaconBlock beacon API. We hit a problem that I'm not sure what we should do. Vouch is failing with Prysm because of the way we deal with blinded blocks  We refuse to return a blinded beacon block when the bid is lower than the local payload, in which case we would use the local payload. Now if we return the blinded version that would be useless to vouch. I very strongly oppose disabling prysm behavior of falling back to local execution so the only options I see is either a) we implement the full builder/relay combo and use our local execution as builder or b) we allow the get_blinded_beacon_block endpoint to return a full block. Neither is nice, the first one we simply don't have the time/energy to do, the second one is just ugly. \n\nBut I'm pushing to have more circumstances in which we fall back to local execution, would rather not fix this issue and be incompatible with vouch than allowing the builder to bypass these protections.\nSo I'm thinking of proposing b) above in the beacon API repo\nCc \u003c@144468805697929216\u003e",
        "created_at": "2023-03-11T00:20:01.088000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "Another solution is to return the blind block as it is without checking for value. This is also ugly for Prysm since we have to duplicate entire code path between prysm api and builder api",
        "created_at": "2023-03-11T00:22:40.464000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "You mean the blind block from the builder? I am very very much against this",
        "created_at": "2023-03-11T00:23:13.534000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "This is not an option if it was up to me to decide",
        "created_at": "2023-03-11T00:23:45.386000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "And I'm hoping it will never be on other clients as well",
        "created_at": "2023-03-11T00:23:57.895000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "Without implementing the override flag",
        "created_at": "2023-03-11T00:24:03.900000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Well that would be overriding by default on the beacon API",
        "created_at": "2023-03-11T00:24:23.242000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "Beacon api has two get block end points . 1.) Get full block and 2.) get blind block",
        "created_at": "2023-03-11T00:25:15.955000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "Their argument would be get blind block should always return blind block from builder",
        "created_at": "2023-03-11T00:25:34.183000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "So the caller can call 1 and 2 next to each other and choose which to use",
        "created_at": "2023-03-11T00:26:09.123000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "So if I run a prysm beacon with a lighthouse vc with mev boost I'll override our protection",
        "created_at": "2023-03-11T00:26:35.816000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I think this is unacceptable",
        "created_at": "2023-03-11T00:26:42.194000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "You wouldn't call get blind block tho. You would call get block. The normal end point",
        "created_at": "2023-03-11T00:27:28.773000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I don't know what lighthouse will call 🙂",
        "created_at": "2023-03-11T00:27:46.773000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "Right it's not clear to me what the default behavior should be for get full block and get blind block end points",
        "created_at": "2023-03-11T00:28:35.979000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I think there is something basic here: the whole point of the protection is that the local EL is saying that the builder is censoring. This is the only reason we fall back to local execution to begin with. Returning that builders block is by definition returning a block that we ourselves have deemed censoring. This is just wrong",
        "created_at": "2023-03-11T00:29:55.341000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "I hear you",
        "created_at": "2023-03-11T00:32:48.281000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "The only useful case I see here is the validators want to compare the values themselves",
        "created_at": "2023-03-11T00:33:15.128000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "So they call two end points back to back and choose which block to use",
        "created_at": "2023-03-11T00:33:29.355000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "The Lighthouse VC will call `get_blinded_block` when configured to use builders. The Lighthouse BN will return either a builder block or a blinded local block (your option (a)) depending on chain health \u0026 block profitability.\n\nTo maintain compatibility with Vouch we just added a BN flag that disables the profitability check. There's some discussion about this on our issue tracker: \u003chttps://github.com/sigp/lighthouse/issues/4040\u003e.\n\nI can understand the hesitation _not_ to implement such a flag, but I'm also hesitant to outright ban this because blocks from \"builders\" aren't necessarily non-local: one could be running a builder locally that produces blocks in any number of ways, e.g. big blocks for testnets (gakonst), empty blocks for blockprint (me), or blocks from an ensemble of local ELs (someone?). In other words, the builder API is very generic, and there are multiple reasons one might want to use it",
        "created_at": "2023-03-11T01:11:41.055000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Thanks for confirming \u003c@602753420033785856\u003e . That's what I was suspecting. I'm am very very very much against disabling that check. And if the above PR I linked pass I will be very very against sending a builders block if my local El says there's censoring. I started in this field when teams were preparing to a situation where you were forced to have your El ready or wouldn't be able to participate after the merge. We then moved to a situation where we serve blocks to sign that we haven't produced nor validated. Then we are moving to a place where we will serve blocks that not only we didn't validate but that the relayer hasn't validated and now we want to serve blocks that our own heuristics say they are bad? What are we going to rationalize later? Probably we will end up front running transactions at the protocol layer",
        "created_at": "2023-03-11T01:25:51.723000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "Are you equating \"local block has a higher value\" with \"censoring\" here?  It is commonly nothing more than a simple race condition:\n\n  - Vouch  selects the best execution payload\n  - (new transactions arrive at the execution node)\n  - Vouch asks BN for a proposal\n  - BN asks EL for an execution payload\n  - EL returns updated payload with new transactions\n\nThe issue linked wasn't about censorship-resistance, but about avoiding the case where the beacon node contains returns information that then relies on beacon node state within that node alone.",
        "created_at": "2023-03-11T07:58:28.103000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I'm lost here, does vouch use each node local execution client as builders or this is about the local node providing a higher pay than the external builder (eg flashbots)",
        "created_at": "2023-03-11T09:05:47.799000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "Vouch uses whatever builders it is given.\n\nThe issue is about the beacon node having its own state, which means we can't use the proposal.",
        "created_at": "2023-03-11T09:07:32.252000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I understand, but then I do correlate (not equating but yes taking it as indication) that if the local node has a higher pay than the builder chances are that the builder is censoring transactions. The mempool on Sepolia is most probably not comparable to mainnet and I believe this race can cause an issue to vouch there",
        "created_at": "2023-03-11T09:09:26.724000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "That doesn't seem like a great assumption, to me.  Plus you are using \"builder\" singular when in production many people use multiple builders to obtain the best payout, including specifically non-censoring relays.",
        "created_at": "2023-03-11T09:13:49.343000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Thus more of a point that the external builder should always (and does always) pay more than local execution unless something is odd",
        "created_at": "2023-03-11T09:16:56.459000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Hopefully we can use better heuristics in the figuring l future, but now that's the best we have",
        "created_at": "2023-03-11T09:17:35.611000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "Again though: the issue is about the beacon node having its own state, which means we can't use the proposal.  Which means that the network loses out if prysm has generated the best proposal.",
        "created_at": "2023-03-11T09:19:55.968000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "What if we return you the full block instead of the blinded one",
        "created_at": "2023-03-11T09:23:29.841000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "You should be able to give that to your proposers",
        "created_at": "2023-03-11T09:24:02.464000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "Please, no.  The API endpoint is asking for a blinded block and the spec states that a blinded block is returned.\n\nI believe there is discussion about a new endpoint that may provide either blinded or unblinded blocks, but let's not break the existing APIs.",
        "created_at": "2023-03-11T09:24:53.279000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I know what the spec states, and I'm hoping to either change it or refusing to return a block that we have heuristics that says it's bad",
        "created_at": "2023-03-11T09:25:51.349000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "It would be more honest to return a 503 rather than return something different (and save bandwidth and processing time, as well).",
        "created_at": "2023-03-11T09:34:06.265000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "That may be doable",
        "created_at": "2023-03-11T09:46:12.454000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "Note that this still wouldn't help particularly, in that we still wouldn't have a prysm proposal, but at least it would be cleaner in terms of understanding what was going on.",
        "created_at": "2023-03-11T09:55:29.109000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Yeah it also has some bad implications to when we move to use our REST validator. I don't see an easy way of solving this",
        "created_at": "2023-03-11T10:05:19.180000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "Adding a flag to allow the users the ability to configure this themselves? 🙂",
        "created_at": "2023-03-11T10:13:03.889000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "This is very simple if people within prysm agree to it. I would be strongly against it, even knowing that this provides incompatibility with vouch and RocketPool's algorithm cited in Paul's PR",
        "created_at": "2023-03-11T10:23:25.997000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "i also agree that beacon should do least \"magic\" and let validator make decisions about what flow to choose (blinded/unblinded) for execution and what block to select (builder/execution) (https://github.com/ethereum/beacon-APIs/pull/302#issuecomment-1464243281)\n\nIn that same spirit, any override flags suggested by the EL (which sounds like a good idea) should just be propagated via response flag ({data,version,priority}) to VC, which has to also consider the proposal timelines rather than just returning 503.",
        "created_at": "2023-03-11T11:26:04.721000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "i guess i am unaware of the consideration for vouch/rocketpool here, a short tl-dr would be helpful",
        "created_at": "2023-03-11T11:43:51.381000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "It seems like some concerns could be mitigated if we had an easier way to provide local blocks via the builder API. If it were trivial to run a local builder then Vouch/mev-boost could connect to it and choose its blocks when they are more profitable. Vouch could even have a builder designated as local which it could give some preferential treatment to\n\nThis feels like the best option from a composability PoV but does give validators scope for setting things up “wrong”, which I suspect \u003c@755590043632140352\u003e would still be hesitant about.",
        "created_at": "2023-03-11T11:46:37.590000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "Vouch (weakly) requires the BN to return the payload from the builder API when it requests a blinded block, because it wants to be able to compare blocks from different BNs. It acts like mev-boost and chooses the payload for all of the BNs to use.\n\nRocketPool requires validators to use certain relays (not sure which) in order to prevent MEV hiding/stealing via unvetted relays and local hacks. Notably Lido doesn’t have the same issue because they assume that local blocks are not hiding MEV",
        "created_at": "2023-03-11T11:51:07.368000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "understood, so seems like (if i read the situation correct): \n1. allowing execution block be requested from blinded route (by way of query param like `block_source` will allow vouch to also compare local block in similar fashion\n2. and BN shouldn't do any replacement on builder flow but rather only propagate priority on execution to validator/vouch/rocketpool\n\nshould be a workable solution",
        "created_at": "2023-03-11T12:00:54.241000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Actually this was my first reaction as a solution to this problem. I'm not really concerned about users screwing up cause I suspect only highly trained ones would use this. The problem is timeline: I don't think we can implement this fast enough",
        "created_at": "2023-03-11T12:34:26.931000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Returning the full block as an optional result from the blinded block endpoint would be easier to implement and downstream can do whatever they want with it",
        "created_at": "2023-03-11T12:36:05.316000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "Vouch couldn't do a lot with it unless the value of the execution payload was also included.",
        "created_at": "2023-03-11T12:44:25.211000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "ahhh we in lodestar have been returning blockValue from the produceBlock and produceBuilderBlock, i forgot that this wasn't standardized https://github.com/ChainSafe/lodestar/blob/unstable/packages/api/src/beacon/routes/validator.ts#L196",
        "created_at": "2023-03-11T12:46:59.004000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "https://github.com/ChainSafe/lodestar/blob/unstable/packages/api/src/beacon/routes/validator.ts#L207",
        "created_at": "2023-03-11T12:47:19.553000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "this allows our validator to cleanly choose, and may be this can be included in the beacon apis as we find this a very clean way to make block selection by validator (https://github.com/ChainSafe/lodestar/blob/unstable/packages/validator/src/services/block.ts#L196)",
        "created_at": "2023-03-11T12:48:05.293000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "It certainly makes it easier to compare the blocks.\n\nIt does feel like it's reaching the stage where we need to take another pass at the API to fetch the proposal (blinded or not) from a beacon node, with additional query parameters on the way in and additional metadata on the way out.",
        "created_at": "2023-03-11T12:51:55.089000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "yes a clean relook is necessary as of now it seems",
        "created_at": "2023-03-11T12:52:27.084000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I think this is also doable and it makes sense to have the endpoint return either a blind block or a full block with its value",
        "created_at": "2023-03-11T13:45:09.183000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Even with a justification as to why it's returning it would be fine",
        "created_at": "2023-03-11T13:45:44.473000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I truly think we need to also use the mempool to make these decisions so blockValue should not be the only trigger for this",
        "created_at": "2023-03-11T13:47:20.030000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "so gasLimit usage of the block be compared as well?",
        "created_at": "2023-03-11T13:57:18.366000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "local block's gas used should be a good estimate of txs that **should be** packed",
        "created_at": "2023-03-11T13:58:01.118000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I am not sure what the right balance is here. A single censored transaction can do a lot of damage, and gas usage would not see this. I trust there are other heuristics the EL can use. But sure, if the builder is producing an empty block and the local block is full I'd expect to fall back to local execution",
        "created_at": "2023-03-11T15:01:36.668000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "so `blockValue` of the local execution block has to reflect the `age` of the transactions, whatever are the `salient` features of a censorship resistance they have to condense into a single metric(which could be improved and iterated upon depending on what censorship behavior is seen on the network)",
        "created_at": "2023-03-11T16:07:16.918000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I think there are a lot of different heuristics that could be used, we could keep the blockvalue on the CL as a check, but we can use arbitrary heuristics on the EL, for example those listed here https://github.com/ethereum/execution-apis/pull/388",
        "created_at": "2023-03-11T16:21:18.692000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "\u003c@602753420033785856\u003e I'm testing the reorg feature on Prater. How do you guys deal with the builder not providing you a blocks based on the parent?",
        "created_at": "2023-03-11T18:21:50.329000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "Wouldn't you just use the local block here? I guess the question is what else can you do",
        "created_at": "2023-03-11T18:37:57.080000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Well if we're absolutely certain that the builder will send the wrong block we could avoid even calling. But I want to know if LightHouse has a way of triggering the right block from the builder",
        "created_at": "2023-03-11T19:09:32.330000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Or if they avoid the call altogether",
        "created_at": "2023-03-11T19:09:49.388000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "You could make a case that if you make a bet and lose right at the start of the slot, you use the local block because a builder may not be building blocks in parallel. But really, you should try anyway. If the builders are smart and are submitting parallel heads, their block will be far more profitable than local ones even when bets are lost",
        "created_at": "2023-03-11T19:58:24.209000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "Here is a fun validator mode. Only use the builder block if you lose a bet at the second 0 or 10. Default to local block for happy case",
        "created_at": "2023-03-11T20:01:51.984000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "I’ve found that usually builders will provide a payload for the re-org, so we ask for one and if we don’t get it we fallback to the local payload.",
        "created_at": "2023-03-11T20:23:48.674000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Ah nice, so they are building in parallel then?",
        "created_at": "2023-03-11T20:24:57.438000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Even without the event stream",
        "created_at": "2023-03-11T20:25:07.597000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "Yeah, at least the ones running the Flashbots stack (almost all of them)",
        "created_at": "2023-03-11T20:25:26.391000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Have you tried requesting the usual head in conditions where you would reorg? I wander if there's a split among builders where some see the previous head and others the incoming one. Depending if they're running lighthouse or not",
        "created_at": "2023-03-11T20:33:18.419000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "Haven’t tried that but it would be interesting to analyse by builder and not just by relay!",
        "created_at": "2023-03-11T20:34:12.647000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "I think you can directly hit the relayer API and dump all the bids and compare the split",
        "created_at": "2023-03-11T20:35:02.754000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Right, the question is if you get different builders to win one or the other",
        "created_at": "2023-03-11T20:35:08.495000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "Maybe we could ask one of the mev data sites like mev-boost.pics to display this",
        "created_at": "2023-03-11T20:35:12.992000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "Why do we need to return the full block _or_ a blinded block and not just a blinded version of the local block?\n\nIs it for latency (no need to unblind)? Or because the full block acts as proof of locality?",
        "created_at": "2023-03-11T20:42:04.776000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "The blinded version of local is the best option if you implement the full builder API",
        "created_at": "2023-03-11T20:43:09.741000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "you can return the blinded version of the local block but when the validator submits the blind block later the beacon node must know if it's using builder path[1] or local path[2], We don't have [2] today",
        "created_at": "2023-03-11T20:43:20.461000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I guess that's not so hard to do probably, you need to store one or two blocks and compare the execution payloadhash",
        "created_at": "2023-03-11T20:45:16.062000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "Yeah we do this already with a small cache",
        "created_at": "2023-03-11T20:45:39.215000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "oh interesting, for this exact same use case? or doing it to save bandwidth / message size over the wire",
        "created_at": "2023-03-11T20:46:22.195000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "both! It kinda just seemed like the best way to do it so we’ve had this since we added builder support",
        "created_at": "2023-03-11T20:47:00.501000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "So why do you need to override the flag then?",
        "created_at": "2023-03-11T20:48:36.868000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "Potuz always with the hard question 😂",
        "created_at": "2023-03-11T20:49:07.499000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "because we’ll (sometimes) return the blinded local block instead of the builder block, but vouch needs the builder block",
        "created_at": "2023-03-11T20:49:31.632000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Because vouch will try to get directly from the builder? I don't understand",
        "created_at": "2023-03-11T20:50:11.252000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Or vouch will choose a beacon to ask",
        "created_at": "2023-03-11T20:50:32.606000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "Vouch _is_ the builder, it chooses the payload and will check that you give it the payload it gave you",
        "created_at": "2023-03-11T20:50:43.713000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "And fill the consensus side from some other beacon?",
        "created_at": "2023-03-11T20:50:47.852000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Oh I see",
        "created_at": "2023-03-11T20:51:01.255000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Ok I don't see any way out of this then unless vouch can maskerade itself as our local execution",
        "created_at": "2023-03-11T20:51:44.817000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "Or there’s the local builder connected to the local EL which Vouch connects to",
        "created_at": "2023-03-11T20:52:28.048000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Right",
        "created_at": "2023-03-11T20:52:42.250000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "I think \u003c@539495253418180618\u003e has a suitable builder that intercepts the EL control messages",
        "created_at": "2023-03-11T20:52:52.615000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "If vouch feeds their blocks directly to our EL we will get the same block on both paths",
        "created_at": "2023-03-11T20:53:03.490000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "But I believe this problem is solved downstream, not by us.",
        "created_at": "2023-03-11T20:53:31.774000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "But this will definitely hit us if any user wants to run a different validator client (even our own rest client) on a prysm beacon",
        "created_at": "2023-03-11T20:54:15.889000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "I like this solution! I hadn’t thought of this",
        "created_at": "2023-03-11T20:55:15.243000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "If you return an error code on the blinded blocks endpoint when you want to use a local block that should be an OK stop-gap. It adds latency, but the Lighthouse VC will re-request a full block if the blinded HTTP endpoint fails",
        "created_at": "2023-03-11T20:56:12.865000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Ah we would request both always cause we check against the value, I'd assume you do the same",
        "created_at": "2023-03-11T21:02:43.445000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Unless that flag is overridden",
        "created_at": "2023-03-11T21:02:53.160000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Or probably you request the blinded block and return the locally blinded one because you already have built that support",
        "created_at": "2023-03-11T21:05:14.150000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Yeah that'd make sense",
        "created_at": "2023-03-11T21:05:24.668000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "We should probably implement the same",
        "created_at": "2023-03-11T21:05:32.864000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "yeah that’s what we do",
        "created_at": "2023-03-11T21:43:39.037000+00:00",
        "attachments": null
    },
    {
        "author": "siladu",
        "category": "Testing",
        "parent": "",
        "content": "The updated EF blog post still says prysm v3.2.2-rc.3, but looks like v3.2.2 is available - presumably the full release is OK to use for goerli?",
        "created_at": "2023-03-11T22:10:23.435000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Testing",
        "parent": "",
        "content": "Correct. it's the same commit",
        "created_at": "2023-03-11T22:16:24.589000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "\u003c@602753420033785856\u003e this seems to be the first succesful reorg from prysm https://goerli.beaconcha.in/slot/5172000, couldn't find any failures yet. Got that block at 6 seconds in our clusters.",
        "created_at": "2023-03-11T22:22:50.618000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "will surely release this on the next release, but most probably not by default yet",
        "created_at": "2023-03-11T22:23:48.829000+00:00",
        "attachments": null
    }
]