[
    {
        "author": "barnabasbusa",
        "category": "Testing",
        "parent": "",
        "content": "Hey guys, as devnet-5 doesn't seem to be going anywhere, we were thinking to just keep pushing further, and look ahead for potential launch of devnet-6. I have created a small doc (https://notes.ethereum.org/@bbusa/dencun-devnet-6) about the potential specs that we thought could be present in devnet-6. The idea is to have another 4844 specific testnet before we involve other dencun specific EIPs in the devnet. Please feel free to comment/provide some feedback about the listed EIPs and let me know what you think. We were thinking that we should aim at merging the open PRs by end of this week, and hopefully have a launch of devnet 6 by end of next week (the earlier the better!). \nIf this timeframe is too soon for some client teams, its also possible to join in later on, and we would have a genesis with a limited set only. \nHowever, I would not launch anything if we only have a single client configuration only.",
        "created_at": "2023-05-23T11:35:26.897000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Testing",
        "parent": "",
        "content": "Prysm will probably need 2-3 weeks after the spec has finalized and merged but feel free to start the Devnet without us. We can join after",
        "created_at": "2023-05-23T13:06:37.548000+00:00",
        "attachments": null
    },
    {
        "author": "hsiaowei",
        "category": "Testing",
        "parent": "",
        "content": "https://github.com/ethereum/consensus-specs/pull/3359 is also required. new spec release is coming soon ™️",
        "created_at": "2023-05-23T16:23:09.886000+00:00",
        "attachments": null
    },
    {
        "author": "roberto.bayardo",
        "category": "Testing",
        "parent": "",
        "content": "Agree we need another devnet (probably 4844 specific) but would be good to understand the issues that are breaking devnet-5 (I assume they'll also be problems for devnet-6)",
        "created_at": "2023-05-23T16:58:23.801000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "Testing",
        "parent": "",
        "content": "An alternative approach would be to relaunch devnet 5 with the previously set specs and see if we can stay in sync until we can launch devnet 6 with the new specs.",
        "created_at": "2023-05-23T20:45:32.036000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "Testing",
        "parent": "",
        "content": "Thanks for the feedback, I’ll add it to the list",
        "created_at": "2023-05-23T20:46:04.181000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "Why cant we bring back devnet5 tho? You just have to identify a fork that you think is correct and checkpoint sync the others onto that fork, network should finalize after that",
        "created_at": "2023-05-23T20:54:43.588000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Testing",
        "parent": "",
        "content": "i think that depends on the assumption Roberto is trying to clarify. If what broke 5 is irrelevant to 6, then don't waste time on 5 and move on to 6. otherwise, it's likely worth everyone making adjustments to get 5 right.",
        "created_at": "2023-05-23T20:58:34.142000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Testing",
        "parent": "",
        "content": "i.e. if 5 broke because of SSZ related stuff, don't waste the time fixing it",
        "created_at": "2023-05-23T20:59:34.798000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Testing",
        "parent": "",
        "content": "is devnet5s brokeenhood still under investigation? how can I help?",
        "created_at": "2023-05-23T21:07:48.995000+00:00",
        "attachments": null
    },
    {
        "author": "roberto.bayardo",
        "category": "Testing",
        "parent": "",
        "content": "Last I heard there was concern lighthouse was somehow rate limiting / dropping non-lighthouse peers.",
        "created_at": "2023-05-23T22:02:39.718000+00:00",
        "attachments": null
    },
    {
        "author": "roberto.bayardo",
        "category": "Testing",
        "parent": "",
        "content": "\u003c@491624610215886849\u003e \u003c@363800010518822915\u003e \u003c@792822129019584562\u003e should we try this?",
        "created_at": "2023-05-23T22:06:03.350000+00:00",
        "attachments": null
    },
    {
        "author": "inphi",
        "category": "Testing",
        "parent": "",
        "content": "Would be good to know if the devnet 5 breakage is fairly reproducible. If so, then there's a good chance it'll occur again on devnet 6. Itll be better to root cause it then if that where the case.",
        "created_at": "2023-05-23T22:11:56.596000+00:00",
        "attachments": null
    },
    {
        "author": "pawandhananjay",
        "category": "Testing",
        "parent": "",
        "content": "sorry this slipped my mind. I have a PR that adds a flag that disables rate limiting. can add it to our main devnet branch. Was that the main reason devnet 5 is dying or are there other issues as well?",
        "created_at": "2023-05-23T22:21:56.770000+00:00",
        "attachments": null
    },
    {
        "author": "roberto.bayardo",
        "category": "Testing",
        "parent": "",
        "content": "cool thank you; I am not sure if we're aware of other issues, but others can chime in if I missed any.  Once we can disable rate limiting in LH sounds like we should restart devnet-5 to see what happens?",
        "created_at": "2023-05-23T22:24:25.317000+00:00",
        "attachments": null
    }
]