[
    {
        "author": "dapplion",
        "category": "Testing",
        "parent": "",
        "content": "We can't be blind to the fact that each implementation is at different distances to being capable of handling bigboy. Would be good to get a dump from each team on:\n1) do you understand the root causes of a specific impl bad performance?\n2) is there a feature / refactor that would alleviate the issue with high probability?\n3) if possible, is there a rough timeline for it (1m, 6m, 1y, +)?",
        "created_at": "2023-08-09T06:22:32.614000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "Testing",
        "parent": "",
        "content": "Devnet-7 nodes basically filled up, we didnt expect the blob size correctly. Since the images are old at this point and branches unmaintained, we'd like to tear down the network and plan devnet-8 instead. If I don't hear any pushback, expect it to be gone by end of today. (Approx 8h from now).",
        "created_at": "2023-08-09T08:49:13.932000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "For Lighthouse it seems like disk usage particularly during non-finality is one of the main problems. This is alleviated by our `tree-states` branch, which we're planning to ship just after Deneb (so users have a way to run Deneb without `tree-states`). For Holesky we will probably encourage users to run a beta release of `tree-states`. More info here: \u003chttps://github.com/sigp/lighthouse/pull/3206\u003e and here: \u003chttps://github.com/sigp/lighthouse/releases/tag/v4.2.990-exp\u003e.\n\nFor comparison, LH stable is using 90GB+ on the 2M testnet, while tree-states is using 1.2GB. Memory usage is also a lot lower: 5GB for tree-states vs 16GB for stable. Although tree-states mem usage is a bit spikier than I would like.\n\nI haven't dug around any of the other metrics on the 2M testnet to know if there are other problems lurking, and unfortunately I'm out of time for the day. I'll be paying closer attention to the next 1.4M testnet.\n\n\u003c@199561711278227457\u003e if you'd like to run a couple of tree-states nodes on the next network, the current `sigp/lighthouse/tree-states` branch should be good to go. It's not schema-compatible with regular Lighthouse though, so would need to run from the start, or with a re-sync.",
        "created_at": "2023-08-09T09:45:37.963000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "awesome, are there any flags we need to set aside from using that branch? or is it all enabeld by default?",
        "created_at": "2023-08-09T09:47:29.107000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "Only `--unsafe-and-dangerous-mode` (it prevents accidents)",
        "created_at": "2023-08-09T09:48:29.503000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "We'll be shutting down the 2.1M validator test in the next ~30mins. Please let us know if we shouldn't. \n\nLogs and some teku profiling results are collected here: https://drive.google.com/drive/folders/1EUMzgv34TZWaqBLzw1w2_URY78S8POQw?usp=sharing\nI'm working on a writeup and will share it soon.",
        "created_at": "2023-08-09T10:10:10.076000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "Initial analysis: https://notes.ethereum.org/@parithosh/bigboi-beaconchain-test-2",
        "created_at": "2023-08-09T10:20:43.082000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "Nimbus is currently undergoing a performance review indeed to address validator set growth in general - the 2M runs don't include this work, but there are significant improvements across the board here including disk access, memory and cpu usage - also, I believe lighthouse is the only client currently running the new attestation subnet strategy meaning that it probably receives a lot less attestation load than other clients for structural reasons (cc \u003c@602753420033785856\u003e ) - as clients implement the 1.4.0 strategy of only 2 stability subnets we should see performance increases across the board",
        "created_at": "2023-08-09T14:49:48.805000+00:00",
        "attachments": null
    },
    {
        "author": "dapplion",
        "category": "Testing",
        "parent": "",
        "content": "Lodestar hit some death spirals due to overloading, but I think we understand by now the bottlenecks. Solutions for a 1.4M are already on the way but 2.1M we would require some more fundamental re-engineering that we are evaluating. Lodestar is already using the 1.4.0 subnet backbone which gives it some nice breathing room.\n\nbigboy issues tracker https://github.com/ChainSafe/lodestar/issues/5855",
        "created_at": "2023-08-09T17:07:07.602000+00:00",
        "attachments": null
    }
]