[
    {
        "author": "mariusvanderwijden",
        "category": "Testing",
        "parent": "",
        "content": "cc \u003c@543900561460822016\u003e",
        "created_at": "2023-07-04T07:35:38.415000+00:00",
        "attachments": null
    },
    {
        "author": "marcinds",
        "category": "Testing",
        "parent": "",
        "content": "We have a bug in calculating length of blob-type txs (we are not including size of actual blobs 😅 ). It is why we are sending huge `PooledTransactionsMessages`. And sizes in `NewPooledTransactionHashesMessage` are also affected. Preparing fix",
        "created_at": "2023-07-04T08:35:03.523000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "I made a tiny issue tracker to keep a log of things we find as well as fixes, especially so that we can include them in some test suite and prevent regressions: https://notes.ethereum.org/@parithosh/dencun-issue-tracker\n\ncould you guys update the tracker with some info on what you found please?",
        "created_at": "2023-07-04T09:11:15.188000+00:00",
        "attachments": null
    },
    {
        "author": "marioevz",
        "category": "Testing",
        "parent": "",
        "content": "Devp2p test for blob txs is up on the latest commit in branch: https://github.com/ethereum/hive/pull/759\nAt the moment it only tests that we get the broadcast of a new pooled  blob tx (with the correct hash, type and size), and that the client responds with proper rlp serialization upon request of the tx.\nRun with:\n```bash\n./hive --client-file ./configs/4844.yaml -client go-ethereum --sim ethereum/engine --sim.limit \"engine-blobs/Request Blob Pooled Transactions\"\n```\nClients are failing due to several reasons but I will continue to debug tomorrow:\n- geth is giving the incorrect value in the size of the full blob tx when broadcasting the new pooled blob txs info\n- nethermind I haven't been able to pair with due to an differing fork id\n- ethjs I haven't been able to pair either because we are not receiving the eth68 support on connection\n\nLast two I suspect are config issues in hive, and I will try to fix tomorrow, but if there is anything obvious I might be missing please let me know 🙏",
        "created_at": "2023-07-04T23:53:34.991000+00:00",
        "attachments": null
    }
]