[
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Hi, got a question about the engine API. If the Payload extends the canonical chain the EL must validate it when it receives it with `notify_NewPayload`. Say it's valid.1) Will the engine automatically update the chain head?  That is, 2) if I send an FCU to this Payload immediately, without attributes, is this a NOOP? \n\nWhat I'm trying to do is to simply avoid the call to FCU in this situation and only call if I need to trigger block production.",
        "created_at": "2023-12-28T16:30:23.493000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "Testing",
        "parent": "",
        "content": "No, the fcu triggers the setHead. At least in geth. The block is executed on newPayload, but the chain is \"reorged\"/the block is set as canonical on fcu.",
        "created_at": "2023-12-28T19:12:58.683000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Thanks, is there some implementation detail that would prevent you to set it as head? I wonder why we decided not to take this as default: any valid block that extends the canonical head is the  canonical head",
        "created_at": "2023-12-28T20:09:22.736000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "Testing",
        "parent": "",
        "content": "We discussed it at some point but decided to not overload the newpayload call, so that cls can execute and test different payloads without assuming them to be valid. If we added the sethead we would implicitly assume a head to be valid (from the cl perspective)",
        "created_at": "2023-12-28T21:28:58.964000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I don't understand this reply, from the CL perspective if you sync a block that extends the canonical chain then it's automatically head, this is a no brainer. There are some implementation details as to when clients process attestations that can hide that statement (eg what you thought was canonical head wasn't really) but for us it would be much easier to simply update head with one call instead of 2. Summoning my Australian colleagues that will be awake soon \u003c@602753420033785856\u003e \u003c@680234424037670912\u003e",
        "created_at": "2023-12-28T23:59:40.489000+00:00",
        "attachments": null
    }
]