[
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "Current state of Pectra testing:\n1. Last week at ACD we agreed to do devnet-1 as basically devnet-0 + removing 3074 and adding 7702. Where are client teams on that? Are there still open questions preventing us from launching a devnet?\n\nCurrent state of EOF devnet:\n1. Is EOF being tested as Pectra + EOF? (This would mean more co-ordination with pectra testing), or as Dencun + EOF fork (Faster and could theoretically be tested without blockers)?\n2. Based on above answer, How EOF is activated: i.e, via pectraTime or via pectraEOFTime\n3. We need an updated version of what spec versions to target, ideally similar to [this](https://notes.ethereum.org/@ethpandaops/pectra-devnet-0) so all EL/CL/MEV teams know what to target and build/test   \n4. Which EL teams are ready-ish and willing to get tested? Based on answer to 1., which CL teams are ready?",
        "created_at": "2024-06-10T09:36:05.357000+00:00",
        "attachments": null
    },
    {
        "author": "daniellehrner",
        "category": "Testing",
        "parent": "",
        "content": "WRT EOF: would it be sufficient to have EOF activated in pectra (via pectraTime) and we simply don't send any txs that trigger it? Or is it necessary to completely remove it for now?",
        "created_at": "2024-06-10T09:39:19.972000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "I guess that's the question for how other EL devs have implimented it as well?\n\nWe can ofc tailor our test cases to suite that requirement, but its a public devnet and someone can cause chaos just for the sake of it by submitting txs",
        "created_at": "2024-06-10T09:40:58.254000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "Testing",
        "parent": "",
        "content": "Current state of peerdas devnet: \nOn the previous ACDC call we have discussed that Peerdas might be activated about the same time as Pectra, but potentially under a different name. I'm not 100% sure what this activation fork would be called. It would be great to have the spec updated according to this\n\n```\n# EIP7594\nEIP7594_FORK_VERSION: 0x06000000  # temporary stub\nEIP7594_FORK_EPOCH: 18446744073709551615\n``` --\u003e Peerdas_activation_epoch ?  And potentially drop the fork version. \n\nOnce this is done, we going to need an update from each CL team to activate peerdas on this specific epoch, and if those client updates are done, we can relaunch devnet 1. This could be triggered with or without pectra. Depends on what client teams are comfortable with.",
        "created_at": "2024-06-10T09:56:47.322000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Testing",
        "parent": "",
        "content": "afaik we only need a epoch value to activate peerdas. The variable name can be discussed but probably want to avoid the suffix of `_FORK_EPOCH` since it's not a fork and there is no need for `_FORK_VERSION`. There will be no fork upgrade happening in that epoch.",
        "created_at": "2024-06-10T12:36:22.656000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Testing",
        "parent": "",
        "content": "\u003e and if those client updates are done, we can relaunch devnet 1\nAre we combining pectra and peerdas in devnet 1?",
        "created_at": "2024-06-10T12:37:17.497000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "Testing",
        "parent": "",
        "content": "Lets use `peerdas_activation_epoch` then? We can combine it, but it depends on client's preference. Let me know\n\nHit thumbs up if you would like to combine peerdas with pectra, e.g activate pectra and peerdas at the same epoch, hit thumbs down, if you want to activate peerdas separately.",
        "created_at": "2024-06-10T12:39:05.053000+00:00",
        "attachments": null
    },
    {
        "author": "sauliusgrigaitis",
        "category": "Testing",
        "parent": "",
        "content": "For Grandine (I believe for other clients too) the standard way to activate features is on a particular hardfork. So we would prefer to activate it on some hardfork. The problem is that peerdas may not be ready at Pectra hardfork. So I'm clickling on thumbs up, but not sure that it's the right answer.",
        "created_at": "2024-06-10T16:13:52.339000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Testing",
        "parent": "",
        "content": "The only way EOF matters is if there are EOF contracts, so if the genesis has none and no create transactions with EOF creations in them hit the chain then EOF won't matter in pectra.  That opens the question on how to enforce the no-EOF-creations rule: on client in the creation logic via a flag or via proxies in front of the nodes or in the builders that filter out such transactions?",
        "created_at": "2024-06-10T16:48:42.374000+00:00",
        "attachments": null
    },
    {
        "author": "somnergy",
        "category": "Testing",
        "parent": "",
        "content": "+ Updated EIPs \n(like 2935, and potentially others)\nMy vote would be to proceed with devnet-1 rather quickly, with updated EIPs(and +EIP7702 | -EIP3074) and then target EOF for devnet-2\nThis gives more clarity and streamlined testing and development flow.\n\nErigon only has a basic implementation of EOF, and needs much more dev work and refinement. This could be true for other clients too, given that EOF only got included last week.\n\nThe fact that this this is a question, is itself a strong indicator that EOF implementation is NOT READY yet, as of this week.",
        "created_at": "2024-06-10T17:07:21.837000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Testing",
        "parent": "",
        "content": "EOF targeting devnet-2 or later was the plan of record when it got included.",
        "created_at": "2024-06-10T17:41:28.975000+00:00",
        "attachments": null
    }
]