[
    {
        "author": "draganrakita",
        "category": "Testing",
        "parent": "",
        "content": "Only besu and reth are close to spinning EOF devnet, Reth still needs to pass eofcreate tests and I need to do review of made code, I will have time at the beginning of next week to look at eofcreate test and start reviewing, so we can spin this rather soonish.\nOn other topics:\n* From reth side it would be best if EOF devnet is on top of devnet-1.\n* For devnet-1, Reth needs to add only EIP-7702 that is in progress.\n* As other clients are working on EOF, having two devnet tracks seems most logical, one for devnet-1 EIPs (Where interaction with CL is tested), and second that has devnet-1+EOF.",
        "created_at": "2024-06-12T11:31:16.719000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "Makes sense, the spec sheet for devnet-1 would be updated and as agreed: devnet-0 + 7702 change. \n\nWhich other clients are ready for devnet-1?\n\nWe can keep the EOF discussion separate for now i guess.",
        "created_at": "2024-06-12T13:19:45.959000+00:00",
        "attachments": null
    },
    {
        "author": "prestonvanloon",
        "category": "Testing",
        "parent": "",
        "content": "Prysm team is waiting on spec v1.5.0-alpha.3 to continue electra work. Our devnet branch is rotten / stale. When v1.5.0-alpha.3 is tagged then we could be devnet-1 ready after a week or so. We're getting a start on some of the recent changes, but it would be helpful to have the new spectests to complete the spec impl",
        "created_at": "2024-06-12T13:36:59.398000+00:00",
        "attachments": null
    },
    {
        "author": "hsiaowei",
        "category": "Testing",
        "parent": "",
        "content": "Sorry! The CL spec release is holding by https://github.com/ethereum/consensus-specs/pull/3768 discussion that I hope to get decision on the ACDC this week. There were some approvals to the PR but then we have new discussions about the design. Could teams help review it by Thursday? 🙏",
        "created_at": "2024-06-12T13:46:12.113000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "Testing",
        "parent": "",
        "content": "For devnet-1, 7702 is not ready, would imagine other client being in same place as it was included last week.\nAgreeing that we can discuss EOF later, probably after devnet-1 gets bootstrapped.",
        "created_at": "2024-06-12T15:29:33.239000+00:00",
        "attachments": null
    },
    {
        "author": "matt.nelson",
        "category": "Testing",
        "parent": "",
        "content": "Besu will have 7702 ready for devnet-1 by end of week",
        "created_at": "2024-06-12T19:24:19.637000+00:00",
        "attachments": null
    }
]