[
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "\u003c@308223150725005322\u003e is this the bug you're hunting? 😄\n```\ntime=\"2024-08-23 09:26:58\" level=fatal msg=\"could not update forkchoice's justified checkpoint: could not update justified balances: could not get justified balances: could not process block: could not process block header: parent root 0x5d13b93211dbb0641775a7315bd1b6c91f48be49c9d3b20b0e428056621d174d does not match the latest block header signing root in state 0xf26114b91db9c7472e9b6a914a891f0bb95a1b4fede474ccf5e8f18c2f71a02c\" prefix=blockchain\n```",
        "created_at": "2024-08-23T09:27:36.165000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "\u003c@504202741933932544\u003e teku-geth-1 failed state transition",
        "created_at": "2024-08-23T09:34:53.655000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "Summary of issues so far:\n- Network is still unhealthy\n- Geth bug patched, but yielding some edge cases with CLs\n\nBugs that need triaging:\n- Geth bug where the CL doesn't switch back to the \"correct fork\" and hence stalling. Lh/Grandine/Nimbus DON'T have this issue. See CL specific issues for more details.\n- Geth question of how the state got corrupted in the first place, why did it try to ever sync this bad block chain and why not reorg onto the main one? Check thread for more details \n- Teku failed state transition, why is teku not switching to the canonical chain and requesting the EL to do so as well?\n- Prysm \"could not update forkchoice justified checkpoint\"? Seems that prysm first stops sending FCUs and then on restart crashes with said error\n- Erigon, stuck in its own fork and needs triaging as to why\n\nPlease use the appropriate threads to keep the main conversation clean.",
        "created_at": "2024-08-23T10:34:13.546000+00:00",
        "attachments": null
    }
]