[
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "There are 3 testnet related PRs setting the Cancun fork time for review here:\n- https://github.com/eth-clients/goerli/pull/178\n- https://github.com/eth-clients/sepolia/pull/61\n- https://github.com/eth-clients/holesky/pull/94\n\nIt'd be great if client teams can have a look by the end of the week, Let us know if anyone's release process is held up because of the PR and we can expedite it 😄",
        "created_at": "2024-01-02T09:18:28.915000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I really think that having a week between Sepolia and Holesky is a bit of a stretch. It doesn't give any time to even start analyzing possible failures. I would have called this into attention at the meeting, but then this was decided during a meeting which many of us were either off or misunderstood that it would be cancelled",
        "created_at": "2024-01-02T11:13:35.247000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "Not sure Sepolia would show much anyway? I wasn't at the meeting so just assuming it was going through the numbers rather than hoping to find anything, but I do agree if anything goes poorly that'll be a problem.",
        "created_at": "2024-01-02T11:31:58.378000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "Testing",
        "parent": "",
        "content": "if anything goes poorly we can always push the timelines.",
        "created_at": "2024-01-02T11:32:23.969000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "yeh but that's going to be 'fun' if releases are already out",
        "created_at": "2024-01-02T11:32:39.704000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "you can't, because you can't have two releases within a week and these are hardcoded numbers",
        "created_at": "2024-01-02T11:32:52.699000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "we'd have to change forks etc and expect a chain split, which is sub optimal",
        "created_at": "2024-01-02T11:33:12.507000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "was it just because sepolia isnt expected to be very interesting do you know?",
        "created_at": "2024-01-02T11:34:45.334000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "imo, sepolia won't be interesting in terms of this upgrade - its more of just getting the fork out on the network. The validators number in the dozens of nodes, the overall network size is small - I'd be surprised if a p2p focussed upgrade on sepolia showed us anything new (Esp something that isn't specific to a small network of its size, i.e - not mainnet). \n\nWe can leave all the PRs open ofc and i guess there'd be a followup discussion on ACD this week. Would most/more devs be present for it? I think if we want to change anything about the plan, we kinda need to do it soon.",
        "created_at": "2024-01-02T13:52:52.818000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Validators are not the risk on Sepolia, that chain *is the chain* we are recommending everyone to switch as the stable execution testnet. We can't really afford to screw that one up. It doesn' t matter that the validator set is permissioned and is small, validators are not the only nodes following the chain",
        "created_at": "2024-01-02T13:54:55.488000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "We can't require big setups to change their deployment with just a couple of days notice in case things go hairy in Holesky",
        "created_at": "2024-01-02T13:55:33.331000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "Isn't the order goerli, sepolia, holesky?  So the short gap is between sepolia and holesky, and we have two weeks between goerli and sepolia.\n\nAlthough the existing dates do look a bit tight, I'd worry more about the goerli-sepolia gap.  Goerli is where we are likely to see real-world issues, and two weeks isn't a long time to turn around new releases with any bugs that show up and be happy that everything is sorted prior to sepolia.",
        "created_at": "2024-01-02T14:05:19.943000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "Yea my argument was that the gap between sepolia and holesky should be small considering we mostly won't find anything on sepolia. \n\nAgreed that goerli -\u003e sepolia can be a bigger discussion",
        "created_at": "2024-01-02T14:06:06.985000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Testing",
        "parent": "",
        "content": "Goerli is also more likely to have issues due to existing low participation. That's what happened in Shapella -- a modest drop in participation, but it took Goerli below 2/3.",
        "created_at": "2024-01-02T14:06:16.234000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Testing",
        "parent": "",
        "content": "temporarily",
        "created_at": "2024-01-02T14:06:19.694000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I think **all** dates are tight, including releasing the first week after the new year's holidays. But yeah, the biggest danger is on Goerli not going well",
        "created_at": "2024-01-02T15:25:19.256000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "Isn't goerli in a good place to take that risk though? Its a deprecated network for a while already and we've been making efforts to get people to not rely on it. \n\nBesides that, is the concern that the fork itself won't trigger or that we put goerli in an irrecoverable state? If its the latter, what tests would you like us to run before there's more confidence?",
        "created_at": "2024-01-02T16:19:01.052000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "it's fine to take a Risk on Goerli, but given that there's non-zero chances of getting that wrong, it's probably best to give time to diagnose those before setting the next testnet",
        "created_at": "2024-01-02T16:32:41.181000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Testing",
        "parent": "",
        "content": "It would make more sense to hold off on setting holesky and sepolia before we can validate that the goerli deneb fork has gone smoothly. If there are any issues with goerli, it will take us a while to be able to correctly patch it either in the client or spec( longer). A 2 week window to investigate and fix any issue that arises in goerli is pretty tight . \n\nAlso some issues take a while to surface (after a few weeks), so by the time we identify it we might already be forking in the other networks",
        "created_at": "2024-01-02T16:33:01.577000+00:00",
        "attachments": null
    }
]