[
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "Now I see where the problem is. Echoing \u003c@539495253418180618\u003e , I think we should move all parts of the spec to `DepositRequest`, `deposit_requests`. Although, this change looks a bit awkward, we have to unify the name. Deposits are have the `Request` semantics as CL runs checks (sig verification at least) -- IMO, this justifies the move to `request` in the name",
        "created_at": "2024-05-06T12:20:05.400000+00:00",
        "attachments": null
    },
    {
        "author": "nordbjerg",
        "category": "Testing",
        "parent": "",
        "content": "fine w that, just unsure how to make CL teams aware of this since they seem to have followed CL spec and not picked up on the engine API naming",
        "created_at": "2024-05-06T12:23:57.898000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "neutral to the receipts/requests semantic here, just should be matching for api/cl spects",
        "created_at": "2024-05-06T12:24:00.185000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "should we take this as a stop gap?",
        "created_at": "2024-05-06T12:33:08.809000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Testing",
        "parent": "",
        "content": "it’s functional for devnet-0 right? so let’s do that for now, and then once we get that devnet up we can align the specs",
        "created_at": "2024-05-06T13:33:39.947000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "execution api's `depositRequests` need to be renamed to `depositReceipts`",
        "created_at": "2024-05-06T13:59:20.476000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "I've opened a PR https://github.com/ethereum/execution-apis/pull/544",
        "created_at": "2024-05-06T15:01:44.405000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Testing",
        "parent": "",
        "content": "i believe the intent was that EIP-7685 wanted a generic, weakly typed notion of \"requests\" which the CL would then translate from and into something more strongly typed, like DepositRecipts. So the EL does not need to be aware of myriad uses of of the mechanic.",
        "created_at": "2024-05-06T15:19:03.042000+00:00",
        "attachments": null
    },
    {
        "author": "rjected",
        "category": "Testing",
        "parent": "",
        "content": "yeah it should be named requests imo, in the short term whatever is actually consistent should work since they need to match",
        "created_at": "2024-05-06T15:26:53.554000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "we decided (for now) that 7685 will not extend to the execution payload section and EL will still return the payload with typed requests.\n\nThe ease of 7685 is that EL doesn't need to create new roots in the header as well as new fields in the body, each time a new request gets added\n\nin my personal opinion I like this quite a lot that el return requests in payload as typed. but am not averse of extending the generic request format to payload/execution api as well and agree that it will be less plumbing each time we add a new request (which i assume will be often)",
        "created_at": "2024-05-06T17:17:14.331000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Testing",
        "parent": "",
        "content": "i am in favor of the later, but am still 🤔 about counterpoints",
        "created_at": "2024-05-06T17:57:08.393000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "CL will need RLP or EL will need SSZ (which might not be a real requirement as each request within the array as of now can be fixed size)",
        "created_at": "2024-05-06T17:58:59.036000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "CL using rlp might not be a big deal unless there is a philosophical opposition to it",
        "created_at": "2024-05-06T17:59:43.553000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Testing",
        "parent": "",
        "content": "i don't follow that, why not just leave the opaque bytes in the payload in json array?",
        "created_at": "2024-05-06T18:00:26.606000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "CL will need to parse to apply the requests, current encoding is RLP, or EL serializes in SSZ",
        "created_at": "2024-05-06T18:01:15.236000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Testing",
        "parent": "",
        "content": "ah I see, per 7002. but that is a choice of the application of 7685. no matter what either layer does with that choice, the other must honor",
        "created_at": "2024-05-06T18:02:47.147000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Testing",
        "parent": "",
        "content": "even for 6110, receipt requests",
        "created_at": "2024-05-06T18:03:34.364000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Testing",
        "parent": "",
        "content": "yes, but i see that as just a function of how the request type was defined. thats actually a feature, not a bug to me.",
        "created_at": "2024-05-06T18:06:13.633000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "I was thinking about 7685 as a simplification on EL side as \u003c@792822129019584562\u003e has mentioned. CL parsing RLP isn't desirable IMO, to avoid the necessity of that and abstract away from many other things we have the engine API.\n\nI think the only decision we should make is to either have each request type in a separate list or have all requests in a single list dynamically typed. I am slightly in favour of the former but not standing strong on it. Separate lists are nice because it would encapsulate 7685 implementation into EL clients. On the other hand, it is in CL's \"interest\" to read all those requests and from that perspective keeping them in a single list sounds like a good middle ground",
        "created_at": "2024-05-06T18:36:36.726000+00:00",
        "attachments": null
    },
    {
        "author": "__kasey__",
        "category": "Testing",
        "parent": "",
        "content": "In the context of 6110, the goal is to make the EL implementation details of deposits more opaque to the CL. EL deals with understanding the deposit contract and presents the next deposits in line to the CL. `CL will need RLP or EL will need SSZ` thanks to the engine API I think that neither of these needs to be the case (edit: this is \u003c@425572898787426305\u003e 's point 🙂 - EL just needs to json encode deposit data in the payload response per the engine spec, correct?",
        "created_at": "2024-05-06T19:55:31.563000+00:00",
        "attachments": null
    },
    {
        "author": "__kasey__",
        "category": "Testing",
        "parent": "",
        "content": "I was missing the context of 7685, after reading the proposal for arbitrary encodings, the discussion about RLP/SSZ etc makes more sense. Anyway, +1  to the above point, and I'll add that from the perspective of the CL I would have a slight preference for separate strongly-typed lists because this way the list name conveys the schema, so you need to transmit less, and it fits cleanly into the open-api schema model, also making it easier to parse and validate.",
        "created_at": "2024-05-06T20:44:49.648000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Testing",
        "parent": "",
        "content": "I don't understand this point? The engine api makes it so neither layer needs the other's serialization scheme. The EL passes the request data back to the CL in the engine api defined format",
        "created_at": "2024-05-06T23:02:50.702000+00:00",
        "attachments": null
    }
]