[
    {
        "author": "tbenr",
        "category": "Testing",
        "parent": "",
        "content": "qq for \u003c@808969530608451584\u003e , is this a consistent view of the deposits? for index 33 especially\nhttps://dora.pectra-devnet-6.ethpandaops.io/validator/71533?v=deposits",
        "created_at": "2025-02-07T09:31:46.720000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "Note that index had an invalid signature on the request, which may be why it shows up slightly strangely in the explorer (and doesn't show up in the validator balance).\n\nAlso note that there were a bunch of no-op consolidations and attempts-to-withdrawal prior to it beign eligible to do so.  And there will likely be more strageness, as it's my test validator for tooling these operations.",
        "created_at": "2025-02-07T09:43:31.156000+00:00",
        "attachments": null
    },
    {
        "author": "pk910",
        "category": "Testing",
        "parent": "",
        "content": "Yea, as jgm said, the first deposit had an invalid signature. \nThe invalid deposit has also been the first deposit for that validator key, so it hasn't been processed and the deposited amount got lost.\nDora doesn't show the signature validity on the per-validator deposits list, so that's a bit misleading and confusing here..",
        "created_at": "2025-02-07T11:19:58.565000+00:00",
        "attachments": null
    },
    {
        "author": "bez625",
        "category": "Testing",
        "parent": "",
        "content": "~~FYI we are getting a 500 from lighthouse with validator registrations on devnet-6. I have added an issue to lighthouse, but raising here for visibility https://github.com/sigp/lighthouse/issues/6951~~ Ignore - this was a config issue on our side.",
        "created_at": "2025-02-07T12:32:12.323000+00:00",
        "attachments": null
    },
    {
        "author": "skylenet",
        "category": "Testing",
        "parent": "",
        "content": "We added a mev-relay ( https://mev-relay.pectra-devnet-6.ethpandaops.io/ ) and enabled mev-boost on around 16% of the validators. Dora also shows up the mev blocks that it gets from the relay: https://dora.pectra-devnet-6.ethpandaops.io/mev/blocks",
        "created_at": "2025-02-07T12:34:58.995000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "none of them contain any execution requests so far, \u003c@808969530608451584\u003e do you want to fire off a round of deposit top ups so we have some requests?",
        "created_at": "2025-02-07T12:58:56.675000+00:00",
        "attachments": null
    },
    {
        "author": "pk910",
        "category": "Testing",
        "parent": "",
        "content": "looks like prysm pairs forked off at slot 27720 on devnet-6",
        "created_at": "2025-02-07T14:10:23.692000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "Testing",
        "parent": "",
        "content": "Speaking about timelines for Testnets and Mainnet, shouldn't we have some sort of procedure where we announce Testnet dates only after the last devnet hasn't had any bugs for, let's say, 7 days? Or at least no serious bugs. Because looking at the convo here, I think there were at least 4 fork-off/stuck issues since Jan 29th. Once we roll out to Holesky, there can be quite a havoc.",
        "created_at": "2025-02-07T16:20:13.346000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Testing",
        "parent": "",
        "content": "This does concern me, as well",
        "created_at": "2025-02-07T16:21:12.315000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Testing",
        "parent": "",
        "content": "It's not even all one CL or EL, it's quite the varied mix, including some major ones",
        "created_at": "2025-02-07T16:21:38.580000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "Testing",
        "parent": "",
        "content": "Yes, Prysm is facing one at the moment. If we had a period of 7 days without issues, I think that would really make everyone calmer",
        "created_at": "2025-02-07T16:22:46.332000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "Testing",
        "parent": "",
        "content": "Shipping the fork a few weeks later is much better than users raging at consensus bugs",
        "created_at": "2025-02-07T16:23:20.477000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "Testing",
        "parent": "",
        "content": "Maybe it's too late for Pectra since we have already announced it, but we could incorporate something like this onwards",
        "created_at": "2025-02-07T16:24:31.697000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "Pretty sure that we did something like this for the last hard fork, it seems we have to review the hard fork release process every time.",
        "created_at": "2025-02-07T16:28:25.331000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "In case anyone needs it, https://github.com/wealdtech/ethereal 2.10.0 now supports electra and has commands `validator compound`, `validator consolidate`, `validator exit` and `validator withdraw` to carry out EL-led validator actions.  Insructions are in the README.",
        "created_at": "2025-02-07T17:51:43.757000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "as made clear at the ACD, its going to take days to get a release produced for many clients, so we do have a period where we're going to be able to observe and change our minds i think... \nchanging our minds given better information should be always an option...\nI'm not sure theres much point trying to have 'strategies' defined for every scenario because its actually kind of impossible in reality to cover every possible outcome.\nIf we're saying 30 days is not enough time, then i'd suggest that the current date proposed is actually more like 34 days, so Im not sure we want to hyper-focus on '30 days' too much...",
        "created_at": "2025-02-07T20:23:35.085000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Testing",
        "parent": "",
        "content": "To provide a constructive example of a pattern which might work well, I'd look at a (shortened version of) Debian's process. In particular, it operates in increasingly firm \"freezes\", and doesn't have specific pre-committed deadlines but rather interactively waits until the goals of each are met",
        "created_at": "2025-02-07T20:27:36.397000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "the release with the date also could change before the hard fork, its just the minimum supported, im not sure the first release for a fork has ever been teh one that we end up with at fork time for teku",
        "created_at": "2025-02-07T20:28:12.044000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Testing",
        "parent": "",
        "content": "There's a frozen (effectively) \"branch\", but until the bugs are figured out it simply does not ship",
        "created_at": "2025-02-07T20:28:12.405000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "i also am not a huge fan of 'what if...' 'this one time we needed...' type crutches built into processes because its a death spiral into not releasing. historically we've set the time straight after fork without more than a week, and thats worked, so this is front running, but we dont know if its worked.\nThe basic idea of 30 days roughly is intact, and the only difference is that we dont have the baseline of 'holesky and sepolia upgraded fine' so lets get that information and reivsit.",
        "created_at": "2025-02-07T20:32:32.453000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Testing",
        "parent": "",
        "content": "Earlier today, devnet-6 didn't finalize for a while, and right now, it's barely finalizing, at 70% participation",
        "created_at": "2025-02-07T20:32:38.112000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Testing",
        "parent": "",
        "content": "One thing to consider is that the \"baseline\" participation of Holesky is approximately 90%, so drops start from there. If the current conditions happened on Holesky, it would still not be finalizing, for hours",
        "created_at": "2025-02-07T20:34:13.070000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "'if' that happens, its a good metric, and we'd have real information and could actually make a better decission. lets get to that point before we are too concerned about mainnet actual dates.",
        "created_at": "2025-02-07T20:35:09.623000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "imo the projection for mainnet fork is on very very thin ice, but it was ok to give a rough idea of how it may shake out.",
        "created_at": "2025-02-07T20:36:56.643000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "think of that date as St Nicolas 🙂",
        "created_at": "2025-02-07T20:37:42.566000+00:00",
        "attachments": null
    }
]