[
    {
        "author": "zhongfu",
        "category": "Testing",
        "parent": "",
        "content": "wiped slashing db?",
        "created_at": "2025-03-01T00:01:11.986000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "most of the bigger twitter ppls have already posted so hopefully ppl are following them... i've messaged stakers that i know are offline (the small ones)",
        "created_at": "2025-03-01T00:03:51.299000+00:00",
        "attachments": null
    },
    {
        "author": "skylenet",
        "category": "Testing",
        "parent": "",
        "content": "We're spinning up more nodes on our side. If anyone is struggling to sync, please reach out to me or \u003c@808969530608451584\u003e and we can provide you with a beacon node API endpoint that you can use with your validator client until you fix yours. \n\nAnd additionally, if you feel comfortable, you can also provide us your keys and we'll run the validators for you until you get your nodes fixed. 🤞",
        "created_at": "2025-03-01T00:15:54.375000+00:00",
        "attachments": null
    },
    {
        "author": "pk910",
        "category": "Testing",
        "parent": "",
        "content": "I had to update the list of IPs, so please update if anyone is using them.\n \none of the nodes (last ip) crashed, which is really not ideal as a lot of validators target those nodes now.  The new IPs can be moved across the vms, so we can redirect them to healthy nodes when needed.",
        "created_at": "2025-03-01T00:36:33.008000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "Dora seems to be pretty accurate with",
        "created_at": "2025-03-01T04:20:06.063000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "there are many slashings with a few validators in it (most of them have a single one), i've looked at a couple of them and noticed that the target epoch of one of the attestations that have a few attesters is quite old, potentially it is from the low participation epochs. My question is why slashings from most recent epochs aren't included in every block? Is this because of attester slashing pools are full of old slashings?",
        "created_at": "2025-03-01T10:52:01.393000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "If there is a queue of slashings either on the slashing pool or slasher sides (i don't know how slashers do work), then slashings with broader intersection should be prioritized",
        "created_at": "2025-03-01T11:00:13.046000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "proposers packing blocks will be prioritising large intersections, but the slasher itself has a hard time computing maximal intersections and will just produce whatever it can",
        "created_at": "2025-03-01T12:59:33.612000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "How many slashings do people have pending in their nodes (ie in the attestation slashing pool)? I have one node with seventy, another with hundreds. If they are poorly distributed that may help to explain why we see some blocks with no shavings in them even though we know there are some out there.",
        "created_at": "2025-03-01T16:55:09.302000+00:00",
        "attachments": null
    },
    {
        "author": "yokem55",
        "category": "Testing",
        "parent": "",
        "content": "How many slashings do people have",
        "created_at": "2025-03-01T17:11:04.296000+00:00",
        "attachments": null
    }
]