[
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Quick development update.  I'm plowing ahead with building out the Alexandria network.  Currently the overlay network is done meaning that  `alexandria` sub protocol over the `TALKREQ`/`TALKRESP` messages implements its own versions of `PING/PONG/FINDNODES/FOUNDNODES` and manages a routing table of only nodes that support the alexandria sub protocol.  Content tranmission is also done.  Content is transmitted in its entirety if it fits within a single UDP packet.  Othrewise it is merklized and transmitted in provable chunks (basically just a special purpose version of bittorrent).  That allows you to concurrently retrieve larger content from multiple peers and re-assemble the pieces locally without everything being verifiable along the way.  I'm now working on the advertisement system which is how you go about locating the nodes that have the content you want.  My guess is that I'll have advertisements fully working in 1-2 weeks.\n\nAfter advertisements are done I'll be implementing the scheme for hostiing the header chain on the network, at which point we'll start a public testnet with the entirety of the header chain hosted and retrievable from the network for people to experiment with.  If anyone is interested in building out support for the alexandria network in their disc v5.1 implementaiton let me know and I can prioritize fleshing out the spec documents.  \n\nRoadmap for what I'm doing is here: https://notes.ethereum.org/fVE9gmeWSryEpYO_Rf5K1g?view#Roadmap\nRough WIP draft of the Alexandria spec is here: https://notes.ethereum.org/oUJE4ZX2Q6eMOgEMiQPkpQ?view",
        "created_at": "2020-11-03T17:58:16.020000+00:00",
        "attachments": []
    },
    {
        "author": ".fjl",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Sounds very cool",
        "created_at": "2020-11-03T21:32:50.824000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If all goes as planned:\n\n- client should be very lightweight compared to an ethereum client.  single CPU, memory footprint under a few hundred MB, low disk io\n- bandwidth usage should be relatively constant.  It'll be chatty, but it shouldn't be as spikey as an ethereum node can be if say, someone is syncing from you.\n- majority of the JSON-RPC API is solved.  Unsolved parts are EVM execution and state reading: `eth_call/eth_estimateGas/eth_getBalance/eth_getCode/eth_getTransactionCount`.  All the other ones that are about reading historical state are well understood and should be servable on demand from the network.\n\nIt's still early, but I'd love to help any of the clients join the network and lean on it for syncing chain history (and in-turn, allow them to *forget* about the ancient chain data and just retrieve it on demand when it's requested).",
        "created_at": "2020-11-03T21:37:48.339000+00:00",
        "attachments": []
    }
]