[
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!453997683431178243\u003e \u003c@!689161464829050960\u003e \u003c@!461762841641484302\u003e I'm interested in scheduling a call for the four of us (and anyone else who is interested) to talk about \"state network\" with the expressed intent of moving towards an agreed upon goal and beginning to execute on that goal in the next 1-2 months.  Gimme a 👍  / 👎  on this if you would like to be apart of this.  To anyone else please give me a ✋ if you'd like to be included on the call (and maybe DM me your email address if you aren't sure I already have it).",
        "created_at": "2020-07-08T17:11:47.851000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "For the call I'm thinking early next week,  Tuesday/Wednesday  I'll leave timezone open for now and will zero in on a time that works for everyone once I know who's going to participate.\n\nIn the meantime, if you have not yet read the \"state network use cases\" forum post linked above, that is a good place to start.  Afterwards, if you have opinions or thoughts on the overall architecture of this network, now would be the time to start gathering your thoughts and writing them down in a way that is consumable by others so that we can all be in a good place to begin evaluating different appraoches/architectures and find a common path forward.",
        "created_at": "2020-07-08T17:14:15.800000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I can add it to the calendar.",
        "created_at": "2020-07-08T17:15:24.082000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "thnkx \u003c@!187490121698770945\u003e if you're willing to do the PM/scheduling for this I would happily delegate that your way.  I'll forward on any names/email-addresses that get DM'd to me.",
        "created_at": "2020-07-08T17:16:09.806000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yep yep 👍",
        "created_at": "2020-07-08T17:16:22.906000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I just got internet up at my new place.",
        "created_at": "2020-07-08T17:16:57.942000+00:00",
        "attachments": null
    }
]