[
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "After taking a look at re-genesis I can see some nice properties that would tie in well with the state network.  At each re-genesis event the entirety of the ethereum state is swept into being \"inactive\".  Subsequent blocks/transactions elevate inactive state to be active state.  This is done by transactions providing proofs.  Users (aka transaction senders) will need access to the inactive state in order to construct these proofs.  We could use the state network to store the static snapshot at the time of re-genesis, a data set that doesn't change or need to be updated, and the state network can then be used to construct the proofs needed to elevate state from inactive \u003e active.  This looks like a really promising approach with allows a very large percentage (initial data suggests \u003e 60%) of the state which is \"cold/inactive\" to be stored in the state network without any need to update it.",
        "created_at": "2020-07-31T16:52:18.778000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There have also been talks of simply seeding the snapshot data via a torrent, which is probably a good and viable way for clients to get access to it, however, we expect access into the inactive state to start off high at the point of re-genesis and to fall off asymtotically towards zero as we get further and further away from it.  Under this model, if re-genesis happened 500k blocks ago, it might make less and less sense for clients to keep the old state around, and be more and more beneficial to have it stored somewhere like the state network where it can be queried without neededing to download the full thing.  I believe this may be especially true in the case where we are doing regular re-genesis events and we have multiple \"layers\" of inactive state.",
        "created_at": "2020-07-31T16:56:00.359000+00:00",
        "attachments": []
    }
]