[
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I just posted https://ethresear.ch/t/explorations-into-using-dht-skipgraph-for-chain-and-state-data-retrieval/7337 which is my write-up from my experimentation with DHT networks and Skip Graphs.  cc \u003c@!461762841641484302\u003e",
        "created_at": "2020-04-29T17:33:41.730000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!692550965856829481\u003e after reading through `https://hackmd.io/-_II-qyQR6OOeS8J7gMVgQ?view1` \n\n1) I'm not sure that the caching mechanism will be effective or sufficient to be useful for stateless clients.\n\nI don't believe there is any global heuristic that can be used to define what should and should not be cached that would be effective across the various different \"shaped\" use cases.  A client might be used for any of:  backend infrastructure, personal use, developer use.  Each of these use cases is going to have different access patterns and even across the same types of use cases, the access patterns may be very different.  Because of this, I suspect that such a strategy is likely to only be useful for a constrained set of use cases and would thus be difficult to roll out new core networking infrastructure to support it.\n\n2) Introduction of a new type of network operator (the Referrer) raises concerns for a few reasons.  It's highly unlikely that we can incentivise these nodes at the protocol level and it is reasonable to expect this network to require incentivisation.  If the assumption is that nodes will pay for access to the Referrer network, then we should probably just focus on the LES protocol because it serves the purpose of providing on-demand data and supports incentivisation payments.\n\nFor these reasons I've been focused on solutions that 1) do not depend on incentivisation **and** 2) does not create networks with asymetry in the types of nodes",
        "created_at": "2020-04-29T18:38:18.948000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Incentives based solutions seem to fall short because we likely cannot provide the incentives at the protocol level which requires the incentives to come from the consumers which limits the use cases where such a solution will help since the use cases where people are willing to pay for data access are in the extreme minority.\n\nAsymetric network based solutions fall short because they depend on maintaining a sufficient majority of \"providers\" to serve the \"consumers\", and unless the network natively implements swarming behavior to allow a large imbalance between \"providers\" and \"consumers\".  Similarly, just like in bittorrent, it seems necessary to ensure that the distinction between \"provider\" and \"consumer\" is thin and that \"consumers\" can easily also be \"providers\".",
        "created_at": "2020-04-29T18:53:22.121000+00:00",
        "attachments": []
    },
    {
        "author": "thiago_crowdtainer",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "“[...]which limits the use cases where such a solution will help since the use cases where people are willing to pay for data access are in the extreme minority.”\nHi \u003c@364458974906548225\u003e ; can you expand in the above ? I mean, everyone today literally *has* to pay for content/internet access, and at the application layer we can see it happening too (think Netflix).",
        "created_at": "2020-04-29T19:19:25.848000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yes, there are examples of people being willing to pay for services that provide value.  There are also a lot of examples of people being unwilling to pay for services that provide value (news? social media? weather?).  Specifically, I don't think there are many examples of people being broadly willing to pay for data.  Wikipedia? Research Journals/Publications? Pirating Movies/Music? Most of the internet....  \n\nI'm skeptical that people will be willing to pay for such a service and I'm additionally skeptical that the subset that would be willing to pay would choose to do so, over the cost of just running a full node.  My thinking here is that if you're willing to pay, it is because you need high quality reliable service, and under this model, the more reliable way to do that is just to run your own full node.",
        "created_at": "2020-04-29T19:23:48.538000+00:00",
        "attachments": []
    },
    {
        "author": "thiago_crowdtainer",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I agree with most of what you said, but, I think we need to be careful with content monetization versus content access. Access to news, social network, wiki, have been Pre-paid by 1-paying the ISP for access and 2- through ads or other means. \n\n I think the topic of state provision is still at “infrastructure” level,  therefore people are likely to be willing to pay, and if they aren’t but value it enough,  they can still get access to it by running their own node (as you mentioned) and potentially paying with exchange of services. So my follow up question is: why is it a problem if people decide to run their own nodes?",
        "created_at": "2020-04-29T19:34:13.428000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e why is it a problem if people decide to run their own nodes?\nI don't think it is a problem.  What I was trying to say is that those who are willing to pay are also probably also more willing to just run their own node which is a roundabout way of saying, I'm not sure who would actually pay for data provision while running a stateless node.",
        "created_at": "2020-04-29T19:35:56.175000+00:00",
        "attachments": []
    },
    {
        "author": "thiago_crowdtainer",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Ah ok, got it. When you say node you’re thinking of a stateless node, and I was thinking of something on the ideas like swarm",
        "created_at": "2020-04-29T19:39:18.486000+00:00",
        "attachments": []
    },
    {
        "author": "thiago_crowdtainer",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Thanks for the clarification. So basically the problem is, who would actually be interested in paying for storage of this specific kind of data.",
        "created_at": "2020-04-29T19:45:46.566000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e So basically the problem is, who would actually be interested in paying for storage of this specific kind of data.\nI would phrase that as: \"Who would actually be interested in paying for **lazy-on-demand-access** to this specific kind of data\"",
        "created_at": "2020-04-29T19:46:55.540000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "👍",
        "created_at": "2020-04-29T19:47:01.527000+00:00",
        "attachments": []
    },
    {
        "author": "benjaminion",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e What I was trying to say is that those who are willing to pay are also probably also more willing to just run their own node\nDoesn't the existence of Infura suggest the opposite?\n\nI'd pay micropayments for access to a decentralised version of Infura for sure. Much less hassle than running a full node.",
        "created_at": "2020-04-29T21:43:04.998000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I would also pay for a market-priced utility over a centralized bundle-priced product.",
        "created_at": "2020-04-29T21:45:09.734000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I need data, I don't need a relationship.",
        "created_at": "2020-04-29T21:45:24.089000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I also would rather not have to trust a third party.",
        "created_at": "2020-04-29T21:45:39.103000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "So if I can get utility priced data without having to trust the provider my life becomes simpler/better.",
        "created_at": "2020-04-29T21:45:55.201000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I am **not** saying nobody would pay.  I'm saying that those who are willing to pay are in the extreme minority and that most people expect to be able to use their ethereum client for free without having to fund a wallet for it to work correctly.",
        "created_at": "2020-04-29T21:47:08.094000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Is this the question you are trying to answer: \"Is there enough demand for trustless utility priced data to make it worth the engineering effort to implement?\"",
        "created_at": "2020-04-29T21:48:49.217000+00:00",
        "attachments": []
    }
]