[
    {
        "author": "__lithp__",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!364458974906548225\u003e sorry it took me a while to respond, I was trying to come up with ideas for what we could do. I really like the ability to run supernodes, and it saves us from having to worry about how much data the average node stores. If data is stored directly on the nodes, and a lot of people join the network and help out as they can, providing 1GB each, then we have to carefully tune the network to make sure less than 1GB of data is mapped to each node. If the DHT is just storing an index then we don't need to worry about the average node size, nodes can offer as much as they'd like to offer and the network doesn't have to be tuned. To be fair, if the DHT is storing an index then we have the same problem, but the index is much smaller than the actual data, so the problem is less of a concern.\n\nThere are some silly ways to get around the advertisement problem: instead of a DHT we could have a set of trackers which are special nodes which accept advertisements and serve the index to anybody who asks. I'm relatively down for this approach because you don't need to trust the tracker to do anything but point you in the right direction, and if there are 20 different orgs running them it seems pretty hard to censor data bybreaking all of them.\n\nThat's not a very clean approach though. Another might be to layers on a gossip protocol? Data lookup would work the same way, FIND_VALUE iteratively asks nodes which are closer and closer to the given value, until it eventually finds a node which has the value. However, data storing is a little slower, to prevent the problem where \"I'm storing all 10M blocks\" means sending 9k messages in the best case (one to every other node). Locally, you keep a partial index, and each \"round\" you pick a random bonded peer and send them a packet with parts of the index which are closer to them than to you. In response they send you parts of their index which are closer to you. Eventually, the index converges.",
        "created_at": "2020-09-03T01:05:27.897000+00:00",
        "attachments": []
    },
    {
        "author": "__lithp__",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I haven't figured out all the details yet but something like this seems like it *should* work. It slows down advertisements a little, but means each peer is only sending 1 packet and receiving 1 packet each time step, which is a great improvement! Before I try to make it work, or try to put numbers to how quickly it would converge, do you have any thoughts or concerns?",
        "created_at": "2020-09-03T01:08:26.172000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I like the \"gossip\" concept.  The direction seems beneficial, and your reasoning about benefits of supernodes is compelling.  I'm gonna ignore this problem for right now (under the assumption that you are focusing on it) and keep my focus on building out the MVP.",
        "created_at": "2020-09-03T01:23:44.044000+00:00",
        "attachments": []
    }
]