[
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!329594653097721856\u003e right now \"Alexandria\" is being built on the v5.1 protocol which uses a diferrent wire protocol than the current eth2 network is using.  I believe the expectation is that once the v5.1 spec is finalized-ish that eth2 would migrate over to the new wire protocol. (v5.1 spec: https://github.com/ethereum/devp2p/pull/157)",
        "created_at": "2020-09-02T00:27:23.696000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!296630428754771968\u003e after chatting with Felix today I think that we can fix the advertisement problem by simply removing it and accepting that content is stored at it's location in the network.  The two biggest downsides that seem to come about with this are 1) it may be easier for an attacker to \"own\" a section of the network and thus censor or otherwise maliciously manipulate access to the data in that section of the network   and 2) running a \"supernode\" that stores lots and lots of data or specific data is no longer effective/viable since you'll be storing a lot of data that people will never ask you for since it isn't located near your node_id.\n\nI think losing the supernodes/specialized-nodes is unfortunate but not a huge deal.  We should assume that 99% of the storage was going to come from broad participation of many nodes offering up 100mb-1GB of storage rather than single nodes serving 100's of GB of data.\n\nThe censorship of a section of the network is a real theoretical problem, and we should look into it and how we could potentially mitigate against it, but I'm not sure it's a deal breaker and the advertisement scheme still suffers from the same problem, just to a slightly lesser extent.",
        "created_at": "2020-09-02T00:42:31.908000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "(Also, dropping the advertisement simplifies the MVP/POC)",
        "created_at": "2020-09-02T00:43:16.093000+00:00",
        "attachments": []
    }
]