[
    {
        "author": "_drinkcoffee",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "In our chat with \u003c@456226577798135808\u003e , we discussed the idea of a \"stateless\" client that can verify block headers AND stores the state for a set of accounts. The act of verifying block headers allows the node to stay up to date for the accounts. I could imagine people considering running one of these nodes in a VM in AWS.",
        "created_at": "2020-04-30T00:29:59.197000+00:00",
        "attachments": []
    },
    {
        "author": "_drinkcoffee",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "How this intersects with the pricing discussion above about micro-payments to Infura / paying for access is, running a VM in AWS is not free. My quick look at AWS's website seem to imply running a small VM would be around US$70 per month. Maybe this could be considered a price point for accessing data.",
        "created_at": "2020-04-30T00:37:52.594000+00:00",
        "attachments": []
    },
    {
        "author": "_drinkcoffee",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "My hope is also that operating one of these nodes wouldn't be as onerous as current nodes, \u003c@!573787335796326400\u003e",
        "created_at": "2020-04-30T00:38:35.164000+00:00",
        "attachments": []
    },
    {
        "author": "_prototypo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Thanks \u003c@!364458974906548225\u003e \u003c@!301186049323958275\u003e \u003c@!700370276713627770\u003e \u003c@!573787335796326400\u003e and \u003c@!636680106630316033\u003e \n\nI generally agree that determining heuristics for what information to cache is non-trivial and may need to be split in several ways. However, the possibilities are very unlikely to be numerous in practice.\n\nIt occurs to me that some use cases could benefit more from the ability to fill a stateless server with just the data you want. For example, what if you are only interested in specific accounts, such as yours and those you choose to trade with? Being able to efficiently cache just those accounts would be useful for that use case.",
        "created_at": "2020-04-30T04:46:41.476000+00:00",
        "attachments": []
    },
    {
        "author": "hmijail",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!636680106630316033\u003e , I've been told that keeping a current archive node in AWS costs about $50/month",
        "created_at": "2020-04-30T11:08:49.008000+00:00",
        "attachments": []
    }
]