[
    {
        "author": "samwilsn",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "What is a `logarithmic subset`?",
        "created_at": "2021-01-08T19:04:35.954000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If there are N nodes that should be interested in something, log2(N) of those through some random selection mechanism",
        "created_at": "2021-01-08T19:35:18.281000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "That's what I thought, thanks!",
        "created_at": "2021-01-08T19:35:55.919000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Alexandria is looking pretty cool, and I really appreciate the name.",
        "created_at": "2021-01-08T19:36:23.393000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Something I've been thinking about with respect to advertisements.  Specifically, they provide a security mechanism and convenience mechanism:\n\n- They make it more difficult/less-effective for someone to mine out an address range in order to eclipse some of the data that resides in that location\n- They allow people flexibility in what they want their node to store (this has not been explicitly proven to be necessary or highly useful)\n\nThis security mechanism is most effective against data which an attacker can predict others would access in a specific part of the address space such as a specific account like the ENR address or specific historical blocks that are commonly acccessed (like the DAO fork blocks??)\n\nOtherwise, the damage someone can do with this attack is less targeted and thus likely less impactful.   For example, if we're talking about looking up transactions by their hash.... transaction hashes are randomly distributed and it's unlikely that eclipsing some segment of the keyspace for transactions is likely to have a significant/detrimental effect on the network...\n\nSo I'm questioning the necessity of this mechanism because it accounts for a significant amount of the network complexity and the main bottleneck the network faces right now.",
        "created_at": "2021-01-08T20:40:35.413000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If I understand correctly, advertisements (and their table) are the indirection between content_id and node_id?\n\nSo if I want to find a piece of content, I ask the DHT for nodes close to the target content_id, then ask those nodes for advertisements, then follow the advertisements for the actual content?\n\nThe alternative without advertisements would mean nodes store content close to their node_id?",
        "created_at": "2021-01-08T22:14:01.890000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "--\nDo advertisements actually mitigate eclipse attacks? Couldn't you just mine out the address range the advertisements would be published to?\n\nI think advertisements actually help mostly with optimizing distribution. If I download a piece of data, unless my node_id is close to that content_id, I will likely never be asked for that data.",
        "created_at": "2021-01-08T22:20:12.495000+00:00",
        "attachments": []
    }
]