[
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I have a follow up question to the discussion around chain history that happened during the workshop. Isn't getting rid of the promise to store the entire block history by every node in the system is one of the goals of Eth1.x research efforts? Isn't it a huge burden of today's Mainnet? cc \u003c@!364458974906548225\u003e \u003c@!206016661470314496\u003e \u003c@!211091239112671234\u003e",
        "created_at": "2021-02-04T09:29:07.843000+00:00",
        "attachments": []
    },
    {
        "author": "holiman",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Wel, it's not insignificant, but it scales linearly with time. It's just a matter of downloading data. The huge beast of a problem that we're battling is state. IMO it's a problem that doesn't need an immediate solution",
        "created_at": "2021-02-04T09:48:49.826000+00:00",
        "attachments": []
    },
    {
        "author": "vorot93",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I very much agree with the sentiment. Looking forward to actually activating reGenesis some day.",
        "created_at": "2021-02-04T09:50:39.145000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "One another related question. What nodes does the fast sync currently rely upon? As it takes some time to download the state there is a risk of the version of the state that is being downloaded to be pruned before the downloading is finished. Is this risk mitigated by maintaining archive nodes?",
        "created_at": "2021-02-04T09:56:31.175000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Doesn’t need to be archive nodes but there is a risk if you don’t download fast enough that you have to move to a more recent block and try again - that’s faster as most nodes are unchanged but it can blow out sync times a fair bit.",
        "created_at": "2021-02-04T10:10:53.683000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Oh, I get it. Pivot block is a moving target for the fast sync. And then it would be good to do garbage collection to clean up orphaned nodes, though, an overhead in size that the garbage gives might not be that big in this case.",
        "created_at": "2021-02-04T10:15:57.749000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "We/I am indeed planning to address this as part of the stateless effort.",
        "created_at": "2021-02-04T15:15:23.876000+00:00",
        "attachments": []
    }
]