[
  {
    "author": "kevaundray",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "Yeah putting it in the last blob would be smarter; we would put how many bytes have been padded in the last blob instead of the total number of bytes in that case though.\n\nNoting: this assumes an access pattern where we only get a specific blob because if we are fetching all blobs, then it doesn't really matter where the encoding is, we would have `get_blobs_data` instead of `get_blob_data` in your example",
    "created_at": "2026-02-12T14:38:25.790000+00:00",
    "attachments": []
  },
  {
    "author": "kevaundray",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "<@402080271563751435> <@792404665068158998> I asked Marios and <@725415098331430932>  (and by virtue fradamt) about the future of the sync blob market -- it may be that payload blobs take up sync blob capacity -- this will likely resolve the ongoing discussion I think",
    "created_at": "2026-02-12T14:41:17.938000+00:00",
    "attachments": []
  },
  {
    "author": "taulepton_",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "do you have any references to share regarding async / sync blobs?",
    "created_at": "2026-02-12T14:57:44.166000+00:00",
    "attachments": []
  },
  {
    "author": "kevaundray",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "Ah not yet, just wanted to note it since it seemed like the root of the current discussion -- if so, we could then just postpone the discussion until theres more clarity on that",
    "created_at": "2026-02-12T15:07:06.830000+00:00",
    "attachments": []
  },
  {
    "author": "taulepton_",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "yep makes sense. From my limited understandign I think that provides a nice resolution to the discussion and fits quite nicely with what we need.",
    "created_at": "2026-02-12T15:08:16.864000+00:00",
    "attachments": []
  },
  {
    "author": "nero_eth",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "yeah, i assumed that each blob would then just be opaque bytes. In that case it doesn't matter where we put the length. My argument for the last blob makes somehow sense to me but not super important (at least for now) I'd say.",
    "created_at": "2026-02-12T15:24:55.024000+00:00",
    "attachments": []
  },
  {
    "author": "nero_eth",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "Like, assuming every blob is full anyway, except the last one",
    "created_at": "2026-02-12T15:26:50.621000+00:00",
    "attachments": []
  },
  {
    "author": "kevaundray",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "Yeah I don't have a strong opinion here after checking both approaches (If you change it to last blob, then also LGTM) -- I think it also makes more sense to encode the amount of padded data instead of the total size of the encoded data in both cases.\n\nSo for example, if the serialized payload is one byte `[8]` and blobs are four bytes.\n\nThen the payload when encoded would look like `[2,8,0,0]`\n\nThe first number lets us know how many bytes we used for padding which is bounded by the `blob size - 2` so we know that the first digit will never be more than 2. \n\nIf we use the total size of the payload then that is bounded by a lot of other external things that affect payload size",
    "created_at": "2026-02-12T15:37:28.733000+00:00",
    "attachments": []
  },
  {
    "author": "nero_eth",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "yeah agree",
    "created_at": "2026-02-12T15:40:01.840000+00:00",
    "attachments": []
  }
]