[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Nothing immediately jumps out at me as a major problem.  Though, I'm not sure it is better than a new chain still since there would be essentially no interoperability between old and new, just the ability to bridge.",
        "created_at": "2021-07-15T05:30:21.535000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And we could construct a new chain that similarly supported that kind of bridging I think.",
        "created_at": "2021-07-15T05:30:35.495000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Or perhaps a second execution shard (post sharding) that supported similar bridging mechanics (and allows us to have an entirely new EVM instructionset).",
        "created_at": "2021-07-15T05:31:00.599000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think it is not comparable to sharding or a new chain. Bridging those is likely async, but at least way more complex. The \"bridge\" in the above document is much more lightweight, and more importantly it is sync, which is the model all dapp devs understand.",
        "created_at": "2021-07-15T08:45:43.090000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Also I think execution shards is not on the agenda anymore, but rather rollup-ization where the data shards are cheap to use.",
        "created_at": "2021-07-15T08:59:52.053000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hmm, you are right that the sync vs async difference is important.",
        "created_at": "2021-07-15T08:59:56.346000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The translation map (aka seemless interaction between the two sides) would be preferable, if it were really seemless without problems.\n\nNext the migration would be the nicest from UX perspective as no bridging/proxying is needed, but this seems to be a hard if not infeasible option.\n\nThe \"bridge\" while could be annoying, it seems to be the least complex and risky on a technical level.",
        "created_at": "2021-07-15T09:11:44.466000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Because I'm sure you need more voices and opinions in this conversation....  🤣 \n\nI'm still catching up on all the material so my fluency with what has been proposed is only maybe 50-70%.  Being able to largely or completely move on from the legacy address at some point seems like a really nice future for us to end up in.  Not clear if this is viable, but if it is.... that would be a big win.  Some version of support for the legacy address space will need to be maintained, some of which can probably be accomplished via pre-compiles.  Maybe this looks like making the legacy address space economically penalized (such as higher gas costs) so that there's a real motivation to migrate the things that *can* be migrated.",
        "created_at": "2021-07-15T15:25:41.052000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We have debated a bit on actively penalizing people for staying in the legacy space, but it would be a move that presents a potentially slippery slope.",
        "created_at": "2021-07-15T15:40:15.799000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Historically, we price everything based on economic cost to the network (e.g., gas prices).  It is a pretty big jump to get into pricing things based on \"stuff the dev teams want you to stop doing because it adds fuzzy complexity to codebases\".",
        "created_at": "2021-07-15T15:41:03.032000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There is an implicit penalty in all the proposals (more with state expiry, but some even without it).\n\nWith the translation map there is additional gas cost accessing it, plus additional witnessess to provide.\n\nWith bridge contracts it is the same, just that those contracts are regular, so no special rules in terms of gas/witnesses for them.",
        "created_at": "2021-07-15T16:40:12.288000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "With state expiry there would be incentive for users to stay in newer epochs, and that should eventually reduce the number of interactions with the legacy space.\n\nWithout state expiry however the incentive may not be there for expanding the new address space, should it remain possible deploying new accounts in the legacy one.",
        "created_at": "2021-07-15T16:44:02.737000+00:00",
        "attachments": null
    }
]