[
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The problem is how to make the new addresses interact with old address contracts. And as far as I kept reading this required one way or another keeping a map on-chain liking the two address spaces",
        "created_at": "2021-11-27T00:11:07.274000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This opinion isn't currently firmly based on a deep understanding of the problem space ... but I lean towards us finding a path that allows us to fully upgrade to 32 byte addresses, even if that path looks difficult or might require some level of concerted effort to tackle the hard parts.",
        "created_at": "2021-11-27T00:14:26.905000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The options that keep us in 20 byte addresses seem to also be problematic in the various collision issues.",
        "created_at": "2021-11-27T00:15:48.344000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Might be interesting to explore using V proposal of setting a 4-5 byte reserved prefix to instead act as a differentiator between legacy 20 byte addresses and \"compressed\" addresses. From reading the documents from the ipsilon team, some issues seem to be based on the inability to differentiate between the two.",
        "created_at": "2021-11-27T00:49:47.506000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "A quick read through the pinned documents seems to suggest that all of the problems with their ASE proposal are indeed more about unfortunate edge cases or tooling failures that could cause loss of funds.  For me, that signals that the path is viable but will require work to identify and mitigate these issues at the tooling layer.",
        "created_at": "2021-11-27T00:55:20.934000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Every path we evaluated had potential catastrophic failures (loss of funds) or complete/total UX failures/breakdowns (like an inability to transact between legacy and new addresses).",
        "created_at": "2021-11-27T03:29:26.878000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We spent a *lot* of time trying to mitigate those edge cases, but every solution just created more/worse problems.  We were never able to figure out a complete set of mitigations/solutions that got us to a place we were comfortable saying \"this could work\".",
        "created_at": "2021-11-27T03:30:19.951000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "https://ethresear.ch/t/what-would-break-if-we-lose-address-collision-resistance/11356/1",
        "created_at": "2021-11-27T05:41:02.394000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "A little more clarity on this.  Some members of the working group were \"sufficiently satisfied\" with some of the solutions, but none of them resulted in everyone being \"sufficiently satisfied\".",
        "created_at": "2021-11-27T05:41:47.114000+00:00",
        "attachments": []
    }
]