[
    {
        "author": "hasu0730",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "do you have an estimate how much $ will be needed?",
        "created_at": "2020-06-27T14:37:37.373000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Very very roughly, we're probably looking at ~10k for the geth implementation work going forward (may vary based on how much the implementation changes), some amount for an eventual audit/formal analysis of the spec (perhaps 10-20k, but I'm very unsure about this), as well as some costs for computation (i.e. if we need to run heavy load testing) and perhaps small bounties (i.e. the moloch grant we had in progress to get mock ups of the transaction flow). \n\n10k felt like it would have been a bare minimum, 20k should cover most things (except perhaps the audit depending on cost/complexity) and 30k should be enough unless there are big unknowns or changes. \n\nI'm surprised by the speed and magnitude of the response to the grant, honestly. We've committed to putting anything that isn't used by the effort back into a future CLR matching pool once the EIP is done. Given how unpredictable Ethereum is, if we have a safety buffer in the grant, I think that's good and will allow us to focus on getting the work done vs. trying to fundraise several times.",
        "created_at": "2020-06-27T15:32:01.936000+00:00",
        "attachments": null
    },
    {
        "author": "hasu0730",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "oh nice, ty",
        "created_at": "2020-06-27T15:57:57.133000+00:00",
        "attachments": null
    },
    {
        "author": "misterbigglesworth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "hey all, I heard back from tim roughgarden. here is part of his response:",
        "created_at": "2020-06-27T22:23:21.266000+00:00",
        "attachments": null
    },
    {
        "author": "misterbigglesworth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\"What would be particularly interesting to me is a deep dive on the mechanism design problem that the different fee mechanisms strive to solve.  This would include: (i) a formal definition of the design space (or at least enough of it to capture the status quo and new proposals like 1559 and 2593); (ii) a formal definition of the objectives/constraints (e.g. incentive-compatibility, throughput, etc.); (iii) a formal model of transactions (rate of arrival, willingness to pay, bidding strategies); (iv) a formal game-theoretic model for miners (specification of utility functions and identification of optimal strategies, at least within a reasonable subclass of possible strategies --- important e.g. for the selfish mining issue that you raised, and missing from the Monnot analysis that you sent me); (v) the identification of formal trade-offs between the competing objectives (e.g., perhaps in certain regimes one cannot achieve full efficiency and incentive-compatibility); (vi) ideally, the identification of an \"optimal\" mechanism (e.g., max efficiency subject to incentive-compatibility).  I think the results would be best described in an academic-style paper (with the model, results, and thorough review of related work, both academic and otherwise); a good example of what I have in mind is Eric Budish's security analysis of Bitcoin (https://faculty.chicagobooth.edu/eric.budish/research/Economic-Limits-Bitcoin-Blockchain.pdf).",
        "created_at": "2020-06-27T22:23:35.488000+00:00",
        "attachments": null
    },
    {
        "author": "misterbigglesworth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As you can see, this would be an ambitious project (my favorite kind), probably occupying me for 2-3 months, and accordingly would be on the costly side.  The benefits would be the thorough modeling of 1559, along with the leading alternative designs; a formal articulation of conditions under which 1559 should or should not function well, possibly with model-backed suggestions about how to tweak it to make it better or more robust; a detailed and accessible writeup for posterity of the major design issues for cryptocurrency transaction fee mechanisms; and, perhaps, newfound celebrity for and appreciation of Ethereum and its challenging economic design problems in the academic world (certainly, I would be keen to lecture widely on the problem and results to both economists and computer scientists).  If I were to undertake this project, I would be happy to act as a resource for the 1559 team as well, with the understanding that my own work would be driven by what I view as the most interesting scientific issues and not by implementation details or other short-term considerations.\"",
        "created_at": "2020-06-27T22:24:27.836000+00:00",
        "attachments": null
    },
    {
        "author": "misterbigglesworth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it seems like this would cover the formal modeling concerns that were raised",
        "created_at": "2020-06-27T22:25:07.540000+00:00",
        "attachments": null
    }
]