[
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e ProgPoW is a pretty large technical change IMO, and it is code that is pretty difficult for most developers to evaluate and audit due to the nature of its design.  It also comes with a whole world of political problems.  1559 is a very simple technical change, which any developer should be able to easily evaluate/audit.  It also comes with a bunch of political problems.\n\nProgPow had few real touchpoint, all in the mining subsystem.  The dag existed and the hash black box existed.  PP just changed the black box. Once it gets a blessing by auditors it can be forgotten about and treated as just another crypto library.  The issues revolving around PP are not technical, they are very political and a little bit economic.\n\nEIP-1559 is simple in principle but has a lot of touch points within the client code and many emergent behaviors.  I don't think we will get the de-fi front running stress that we should expect from filecoin's deployment.  That's the game theory I think that we need to examine while the 1559 testnets are running.",
        "created_at": "2020-09-05T05:41:55.654000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@403707149043105803\u003e Is there an efficient implementation of progpow for all client languages already, or do clients need to implement the library themselves?",
        "created_at": "2020-09-05T05:47:13.301000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "chfast's C based library is quite nice.  Everyone can do C interfaces.",
        "created_at": "2020-09-05T05:47:57.198000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Geth has an unmerged PR,  Parity had a merged PR, so there's go and rust as well.  Tuweni has one in Java (based off a side repo I made), but it's too number-crunchy to be performant in pure Java, you really need to go native.  C# is the missing one, but it wouldn't be hard to fix on the off change it matters.",
        "created_at": "2020-09-05T05:49:59.564000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There was once a testnet, and things never went wrong, the ethash to pp transition was the only thing that needed to be demonstrated.  But for 1559 I think we need to see stuff like basefee spikes, strings of empty blocks, warring miners (one side trying to up basefee one side trying to nix it) . And also how front and back running might be done in those scenarios.  The concerns I have in 1559 are all about how the emergent incetives work.  Hence the need for a game theorist to examine it (IIRC we have one now).",
        "created_at": "2020-09-05T05:53:23.806000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e Everyone can do C interfaces.\nWhile perhaps technically true, not everyone has a build system setup and integrated into CI/CD and calling out to native C libraries is not trivial in all languages.  If there were pre-built binaries for all platforms that would help, but even then depending on the language this may greatly complicate the installer build process.  For example, if you are distributing a pure JS library, adding native C bindings suddenly introduces a huge amount of headache and pain.",
        "created_at": "2020-09-05T06:25:05.587000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e warring miners (one side trying to up basefee one side trying to nix it)\nThis requires miners behaving irrationally.  While I'm not against modeling irrational behavior, I think we need to be clear about what scenarios/behaviors we actually want to be protected against.  PoW doesn't work *at all* if you assume everyone is irrational for example, so we apply constraints on the amount of irrational behavior that we think is \"reasonable\" (interestingly, PoW doesn't actually work when people behave rationally either).",
        "created_at": "2020-09-05T06:27:20.372000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It would be pretty trivial to define a set of behaviors that totally breaks EIP-1559 gas prices.  I just don't think those behaviors make any sense so it seems pointless to me to spend time modeling it.",
        "created_at": "2020-09-05T06:28:02.967000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e Hence the need for a game theorist to examine it\nWe have several game theorists, just none that have a piece of paper that says they are a game theorist.  😉  (note: this is mostly a troll comment, I support bringing in external people with expertise in a specific area)",
        "created_at": "2020-09-05T06:28:37.513000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think my biggest argument against all of the people who say \"we need to do more economic modeling/testing\" is just that:\n* so far no one has brought up a viable attack\n* we have had many people *look* for a viable attack\n* the failure scenario people are most often worried about gracefully degrades to the current system\n* if things don't behave the way we want we *can* hard fork a change (as long as the failure isn't a catastrophic failure)",
        "created_at": "2020-09-05T06:32:08.546000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The above aggregates to make me *feel* like the concerns are mostly just FUD.  So while I support continuing to investigate and look for issues in parallel with development/deployment, I don't think we should be holding back 1559 purely out of fear of \"what if something goes wrong\".  There will *always* be a risk of something going wrong, and we can take steps to mitigate that (e.g., by using simple mechanisms rather than complex ones) but we'll never be 100% confident until we see real humans using it in production and doing real human (irrational) things.",
        "created_at": "2020-09-05T06:34:28.155000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't have a piece of paper that says I am a game theorist but close enough ^^ I agree that 1559 shouldn't be held up by the lack of formal arguments, but as you say that doesn't mean it cannot run in parallel to implementation efforts (I even believe it will be \"completed\" before 1559 reaches mainnet anyway).\n\nthe work on simulations allows to check some assumptions and see whether x or y behaviour a) makes sense b) entails as consequences. formal arguments are nice because they allow us to explore the design space in a bit more structured fashion, which makes it easier later on to understand new behaviour we might not have anticipated, as well as choose/optimise for certain designs (e.g., the escalator vs 1559 debate). this seems to be forgotten when people ask for formal proofs, it's less about \"can we deploy safely yes or no\" and more about \"what is the correct frame of thinking about this in the first place?\" (and the latter informing the former)",
        "created_at": "2020-09-05T12:05:43.142000+00:00",
        "attachments": null
    }
]