[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e 1. Re: the transaction pool/transition period/conversion from legacy txns, I think this is probably the #1 spec issue now. We should aim to have everyone review it prior to the call next week so we can finally make a decision on it then (and merge in @Micah's PR if we go for it, or suggest specific changes).\n\u003c@552133098075193354\u003e I propose we just merge it.  Can always roll back if necessary.  We have given people ample opportunity to review and express concerns and no one has taken up that opportunity.",
        "created_at": "2020-10-03T00:32:00.769000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We keep putting off making a call, and we were supposed to get agreement at ACD but yet again we just received silence aside from Nethermind who expressed very positive remarks about the change.",
        "created_at": "2020-10-03T00:32:58.548000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Essentially, we keep getting either no feedback or positive feedback, never negative feedback, so we should take that as consensus and move forward IMO.",
        "created_at": "2020-10-03T00:33:29.072000+00:00",
        "attachments": null
    },
    {
        "author": "pintail_xyz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It's also not like the status quo is any good! If we were sticking with the dual transaction pool option I hope people would be flagging that it adds a whole heap of complexity. This is just a massive simplification to something which hadn't been fully agreed upon in the first place.",
        "created_at": "2020-10-03T07:03:32.148000+00:00",
        "attachments": null
    }
]