[
    {
        "author": "foobar0x",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Only to the upside. When ETH price is low right now, miners continuously sell ETH. With fee burning, the price will be stabilized without constant selling pressure, reducing downside volatility.",
        "created_at": "2021-03-18T06:20:22.310000+00:00",
        "attachments": null
    },
    {
        "author": "gpuhoarder",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "ETH trading volume: $24B/day. Mining emission: \u003c $45M/day.  Miners selling is not a significant source of price pressure.",
        "created_at": "2021-03-18T12:07:50.252000+00:00",
        "attachments": null
    },
    {
        "author": "shamuzzlik",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "nice napkin math dude, most comprehensive research I've seen in a while.",
        "created_at": "2021-03-18T13:42:31.984000+00:00",
        "attachments": null
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Other than the 'minimum issuance policy' what is the motivation for allowing potential deflation to happen because of this EIP?",
        "created_at": "2021-03-18T16:46:28.024000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It solidifies the monetary policy, and it compensates Ethereum holders for being diluted to pay for security. Holders subsidise the block reward when the fee market is low, but they get \"paid\" when the fee market is high.",
        "created_at": "2021-03-18T17:06:12.554000+00:00",
        "attachments": null
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, I understand that rhetoric. I'm just curious on why there is such an disproportionate emphasis on only one use-case of ETH: 'holding' (store of value). Holders can already stake for additional pay. The burn could be capped at the value of the block reward (the rest, if any, could go to a developers fund, for example). This negates the risk of structural deflation, which could impair another use-case of ETH: as a real-world currency.",
        "created_at": "2021-03-18T17:54:40.282000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "A censorship resistant/decentralized developer fund is non-trivial.  Who would get it?  How would it be managed?  Who is in charge of allocation?   Who has the keys to it?",
        "created_at": "2021-03-18T17:56:02.995000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Separately, I don't know that we have any good examples in history of a currency failing as a currency because it was deflationary?",
        "created_at": "2021-03-18T17:56:45.240000+00:00",
        "attachments": null
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, those are hard to find. Classical currencies, tied to central banks, don't really see structural deflation due to policy (and cryptos usually fail due to other, more severe, reasons...). I was thinking more along the lines of others adopting ETH. Would a mortgage in ETH be viable? (especially if salaries are still paid in fiat). If a country decides to adopt a deflationary ETH (I know, pipe dream, but I'm optimistic) would they not fall victim to the paradox of thrift?\nI guess it depends on which school of economics you subscribe to. I believe excluding deflation would ease adoption.",
        "created_at": "2021-03-18T18:35:48.035000+00:00",
        "attachments": null
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I agree that is not a trivial problem.",
        "created_at": "2021-03-18T18:36:24.870000+00:00",
        "attachments": null
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What also bothers me regarding this EIP is that it not just minimizes paying for security, but also punishes actual users.\nIf fees are consistently high you have deflation. Does that mean that the network is now paying a negative amount of ETH for security? No. The difference comes from those actual users. If you spent ETH in such a market you're essentially punished thrice. Once because you now have less ETH. Twice because you had to pay a fee for using the network. And thrice because that spent ETH (and fee!) is now automatically worth more. Seems unhealthy.",
        "created_at": "2021-03-18T19:20:42.324000+00:00",
        "attachments": null
    },
    {
        "author": "dkdkdkdkdkdk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "gold standard comes to mind",
        "created_at": "2021-03-18T19:46:18.001000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Gold is inflationary supply (it can be mined).",
        "created_at": "2021-03-18T19:48:34.604000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Speaking for myself, whenever I pay a trx fee as a user, the only thing that really upsets me is that the fee ends up in miners' hands and is subsequently sold to pay for mining expenses, thus causing downward pressure on ETH's price. As a user (and ETH holder), I much rather see fees being burned, as it would bring an upward pressure on ETH's price",
        "created_at": "2021-03-18T22:13:57.081000+00:00",
        "attachments": null
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Those are still only arguments from the perspective of a 'holder' (store of value), not from an _active_ user.\nAlso I was not questioning burning the fee, just burning more than the block reward.",
        "created_at": "2021-03-18T22:29:02.276000+00:00",
        "attachments": null
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I still think this would render ETH unusable for certain markets, e.g. lending.\nAre there any good examples of a working deflationary currency?",
        "created_at": "2021-03-18T22:31:14.538000+00:00",
        "attachments": null
    },
    {
        "author": "thinkingbyzantine",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@680781247429214209\u003e ehh I could not think of any non crypto currency that is deflationary and sussesful",
        "created_at": "2021-03-18T22:33:09.808000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I agree that deflationary assets are not good units of account (just like inflationary assets). That’s why we have stablecoins. But I see ETH more as a reserve currency, in which case, being deflationary is a big plus, imho",
        "created_at": "2021-03-18T22:38:36.519000+00:00",
        "attachments": null
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@456226577798135808\u003e If strictly a reserve currency, wholly agree. If ethereum scales well we'll get minor inflation anyway. I just thought it would be nice to cement that in this EIP.",
        "created_at": "2021-03-18T22:54:00.084000+00:00",
        "attachments": null
    },
    {
        "author": "thinkingbyzantine",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@456226577798135808\u003e stable coins are inflationary in nature since they are pegged to the dollar",
        "created_at": "2021-03-18T22:54:13.847000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Not all stablecoins are pegged to the US dollar, only most of them 😊\nAnyway, I totally agree that all fiat currencies are inflationary at the moment. Yet they provide a much better unit of account than crypto assets, which are inherently more volatile (whether inflationary or deflationary).\nWhich brings me to my next point. I think you guys define inflationary as downtrending in price, and deflationary as uptrending in price. Whereas most crypto assets are uptrending in price despite being inflationary",
        "created_at": "2021-03-18T23:06:49.509000+00:00",
        "attachments": null
    }
]