[
    {
        "author": "tirion77",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I am not sure if this has been addressed, but aren’t gas fees more “sticky” with EIP-1559? For example, if gas is 100 GWEI now and ethereum rips through usd and does 2x price in a 12 hours, the prices would in theory go down (assuming no increased demand) to 50 GWEI. But don’t they readjust slower with this EIP, making the gas costs much higher overall, specifically usd value?",
        "created_at": "2021-02-18T01:12:01.756000+00:00",
        "attachments": null
    },
    {
        "author": "tirion77",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In this example they’d remain close to 100 GWEI for longer than needed. Basically, isn’t a lock on gas price volatility an issue when we have volatile ETH prices?",
        "created_at": "2021-02-18T01:13:37.672000+00:00",
        "attachments": null
    },
    {
        "author": "tirion77",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Apologies if this is a newbie question and if it was addressed. Thank you.",
        "created_at": "2021-02-18T01:14:34.870000+00:00",
        "attachments": null
    },
    {
        "author": "definitelynotcharles7176",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "***Warning: Low information comment here:***\n\nSo, 1559's core feature is the buffering using 2x space (which in turn requires the use of BASE FEE).\n\nAs we know, this won't substantively reduce fees in general, but improves bad prices for someone bidding very high \"high bids\".\n\nHowever, I've read the BASE FEE increase is on the order of 10x, which is substantial compared to the delta between \"high bids\" and \"normal bids\". This, combined with a 13 second block time, seems like it could have small benefits in practice.\n\nAre there a set of simulations (ideally with a live test node at production scale, but really even excel is OK) that shed light on the actual quantity the core mechanism improves transactions in practice?\n\nAs an aside, note that I easily can't find where Roughgarden's covers this. This sort of \"how it plays out\" is often the key to these mechanisms.",
        "created_at": "2021-02-18T02:02:14.825000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yes as \u003c@!397389662085185547\u003e said i think it is quite hard. the approach I am focusing on right now is to generate more or less volatile demand processes and basically checking how the excessively low periods take place as a function of the volatility (more volatile =\u003e more periods of excessively low fees). we have some results coming soon in a paper, which doesn't exactly address that question but makes a stab at being more precise about some of basefee's dynamics.\n\nregarding on-chain experiments it's been discussed in some places. my issue is that I don't think you can precisely say \"given the demand (mempool + inclusions) we observed between x and y dates, there would have been z% of excessively low base fees\", assumptions have to be made. first there is the whole business of basefee being a lot more binding than the current situation, where you could be included at any price (usually you aren't but still). then there is the issue of bidding, which is expected to be different behaviour in 1559. so the bids you observe in your dataset are lower bounds of what they could bid, and you could make assumptions on the upper bounds. i don't think making assumptions is unreasonable (this is how to science after all :)), but at some point perhaps you prefer to have the kind of robust bounds the simulations can give, so that's the path I tried lately. but i might still try to write up a methodology if you did want to do this onchain experiment, maybe there are things i didn't think about\n\n(also, any idea if the clubhouse conversation was recorded?)",
        "created_at": "2021-02-18T02:12:59.567000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Fees are a function of demand, and only weakly correlated with USD price.  That being said, 1559 base fee adjustments are quite fast.  10x in minutes.",
        "created_at": "2021-02-18T02:17:28.525000+00:00",
        "attachments": null
    },
    {
        "author": "tirion77",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thank you!",
        "created_at": "2021-02-18T02:18:27.417000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "hey \u003c@!472564705735606272\u003e if you can, check out this report: https://barnabemonnot.com/abm1559/notebooks/transition1559.html, it shows that basefee in general tracks the \"correct\" price very closely. what you ask is the impact of the ETHUSD price on gas prices. i guess this depends on your behavioural model. if as a user you price your transaction in ETH (e.g., you are arbitraging something), you might still want to bid 100 Gwei, though the market price of ETH has 2x'ed. If most users do the same, the price should stick to 100 Gwei, as that is the market price. If most users think in USD terms, their value would be repriced in Gwei terms and basefee should follow.",
        "created_at": "2021-02-18T02:18:30.542000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The base fee adjusts by 1/8 per block.  It can 10x over some number of minutes (I forget how many but it is easy to calculate).\n\n\u003c@486501030046203915\u003e has a whole bunch of simulations and they are linked in that 1559 resources document (sorry, on mobile right now).  The biggest problem with simulations IMO is that we have no idea what user's max willingness to pay is, because first price auctions don't incentivize bidding that.  All we know is how much they did bid.",
        "created_at": "2021-02-18T02:21:47.061000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I totally agree, I think the main use of simulations is to detect and possibly measure tensions between various parameters (update rate, user values, transaction pool behaviour etc) rather than simulate the current state of the demand and extrapolate for a different mechanism (e.g., from the current fee market to 1559). see also this answer: https://discord.com/channels/595666850260713488/692078615269212180/811782287674572852",
        "created_at": "2021-02-18T02:25:00.117000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "thanks for the thoughts\n\n\u003e we have some results coming soon in a paper\nis this paper with roughgarden or others?\n\nyes, it was recorded here, they didn't dive *too* deep into 1559 IMO\nhttps://www.youtube.com/watch?v=sR3pI7Y29IU",
        "created_at": "2021-02-18T02:46:34.982000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "thanks, will check it out!",
        "created_at": "2021-02-18T02:47:54.647000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@486501030046203915\u003e Re: https://discord.com/channels/595666850260713488/798586271445680129/811788694319136827 (moving here because 155-mining is effectively useless for conversation at this point with the slowdown timer).  I believe it is linear with gas used, and I'm not aware of any upper limit.  The one caveat is that as block processing time exceeds average block time then the chain may fail to make meaningful progress forward.",
        "created_at": "2021-02-18T02:54:19.735000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "right so in a sense linear for a while and then basically infinite once you hit that processing time",
        "created_at": "2021-02-18T02:55:56.564000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't think it is a hard cut over.  If block time is 15s and processing time is 14s, then a little under half of blocks will be uncled.  At 16s processing time a little over half of blocks will be uncled.",
        "created_at": "2021-02-18T03:14:55.345000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This continues and approaches 100% uncle rate as time approaches infinity, though it reaches near 100% around 100s processing time I think.",
        "created_at": "2021-02-18T03:15:52.412000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "ah i see ok",
        "created_at": "2021-02-18T03:16:11.633000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If you wanted to model it, you would just look at the poisson distribution of block times and for any given processing+propagation duration, the uncle rate is the percentage of blocks that mine in under that amount of time.",
        "created_at": "2021-02-18T03:20:31.099000+00:00",
        "attachments": null
    }
]