[
    {
        "author": "nav.7",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don’t know of it is possible but one thing that may improve ux is if the base fee for the next block can be known 3 or 4 block ahead. So it is not based on the last block but few blocks behind. At the moment when you try to make a transaction by the time the user send the transaction the base fee has already moved a lot",
        "created_at": "2021-11-22T13:40:20.909000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You are aware that you specify `maxFeePerGas` right? I.e. that you get a refund for the difference (minus `priorityFeePerGas` of course)",
        "created_at": "2021-11-22T13:58:52.852000+00:00",
        "attachments": null
    },
    {
        "author": "nav.7",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes but in the gas is 80 and user only want to pay 85 max then he will put 85 in max fee but by the time the transaction go out the base fee is 100 so how does it help",
        "created_at": "2021-11-22T14:00:49.145000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "How does knowing the base fee 3 or 4 blocks ahead help in that situation?",
        "created_at": "2021-11-22T14:01:32.951000+00:00",
        "attachments": null
    },
    {
        "author": "nav.7",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Because it will give the user time to send the transaction before the gas fee goes above what max he is willing to pay.",
        "created_at": "2021-11-22T14:03:09.205000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My gut feeling is that we just end up with more doubly full blocks, and that it just adds to the frustration.",
        "created_at": "2021-11-22T14:11:49.422000+00:00",
        "attachments": null
    },
    {
        "author": "nav.7",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As i said i dont know the technical and security implications I am just saying from ux point",
        "created_at": "2021-11-22T14:15:24.917000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It's probably not much different from lowering the 12.5% per block rate, i.e. it becomes slower respond and therefore we end up with more doubly full blocks (and more priority fee needed to compensate). Not really better from a UX perspective is my expectation.\n\nFor the base fee to jump from 80 to 100 we need at least 2 full blocks (~28 seconds). In case the blocks are doubly full with the current system, not much will change with knowing the base fee 3-4 blocks ahead. Those blocks will be doubly full as well, and we have a first-price auction with the priority fee.\n\nIf the blocks that take the base fee from 80 to 100 are not doubly full under the current situation (say 3 _almost_ full blocks, ~40 seconds), then I think it's more likely that those 3-4 blocks in your hypothetical system will be doubly full (because more demand at lower gas price). Definitely not better UX.\n\nEither way, I think there are changes to the fee market planned (maybe the Shanghai fork in ~1 year). I'm not sure they'll help on this front. Time sensitive transactions under a fluctuating fee market means you need to be fast if you have a constraint on the gas price you can afford I'm afraid.",
        "created_at": "2021-11-22T14:33:23.308000+00:00",
        "attachments": null
    }
]