[
    {
        "author": "pintail_xyz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Has any thought been put into possible fork choice rule changes that could reduce the chance of success for an attempted miner soft fork to neutralise the basefee? My initial thought is that the PoW weight could be normalised by net issuance. That ensures that the maximum hashrate per ETH issued is what's targeted, rather than raw PoW weight as currently.\n\nThis means if there are two blocks produced at the same height, the preferred one will be that which burns more ETH (i.e. includes more transactions), and if a fork develops with a lower basefee, this will be ignored in favour of a fork with a higher basefee.\n\nIn a pre-1559 world, this change would have little effect since miners can't have much impact on issuance (except minimally through uncle rewards). Post-1559, miners who collude to manipulate the basefee downwards would potentially need much more than 50% of hashrate to defeat a fork that allowed the basefee to rise and significantly reduce net issuance.\n\nThis idea could be encoded as an EIP that would not actually need to be deployed unless miners attempt to attack 1559 (i.e. a deterrent which is much less drastic than an emergency eth2 merge). Alternatively, if this were deemed to be a strict improvement on the status quo, it could be rolled out in the 1559 fork, although I suppose it would need lots of modelling and analysis to identify any new attack vectors it would introduce.\n\nBut maybe there are reasons that are obvious to people here why this is a bad idea. So can anyone explain why this wouldn't work?",
        "created_at": "2021-02-15T16:14:46.055000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This would allow a miner to selfishly mine a sibling head block as they can just include one additional transaction that arrived after the current head block miner constructed their block.",
        "created_at": "2021-02-15T17:59:21.438000+00:00",
        "attachments": null
    },
    {
        "author": "elayne_malachite",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It would lead to a situation with a non-decreasing basefee since any block that isn't double full will be uncled. Otherwise, your block will be displaced by another block that includes 1 additional transaction since the burn will be greater. This could even open up the possibility that the chain suffers a double-spend by picking an arbitrary, non-double-full block and re-basing the chain by constructing a new double-full block.",
        "created_at": "2021-02-15T18:52:27.084000+00:00",
        "attachments": null
    },
    {
        "author": "pintail_xyz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But if they include an extra transaction then they need to start again with PoW. Once they've seen a new block they are better off mining on top of it because by the time they are able to produce a sibling block they will be on a stale chain. Since they don't know in advance how many transactions other miners will include, aren't they best just including all profitable transactions?",
        "created_at": "2021-02-15T23:38:15.026000+00:00",
        "attachments": null
    },
    {
        "author": "pintail_xyz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The rule would still be that it is the heaviest *chain* that is canonical. You can't just rebase the chain at an arbitrary point in the past unless you can generate enough PoW to have a greater total weight than the chain you're trying to replace (as now). It's just that the way competing chains are 'weighed' is altered to take account of issuance.",
        "created_at": "2021-02-15T23:41:39.082000+00:00",
        "attachments": null
    }
]