[
    {
        "author": "cf0009",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Pools used to be 3-4% of daily network tx's before 1559. All of them free. Much better now",
        "created_at": "2021-09-04T00:19:40.919000+00:00",
        "attachments": null
    },
    {
        "author": "cf0009",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "London in general eliminated a lot of spam incentive, including the gas tokens",
        "created_at": "2021-09-04T00:23:03.216000+00:00",
        "attachments": null
    },
    {
        "author": "cf0009",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That being said, I'm glad the fees issue is being recognised. In fact, raising the gas limit was briefly discussed in today's ECD meeting. The network is currently unusable for the 99% and hopefully we see a modest increase to 40mm in the near future",
        "created_at": "2021-09-04T00:27:01.843000+00:00",
        "attachments": null
    },
    {
        "author": "cf0009",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "For reference:  registering an ENS + reverse-record: $290 in fees",
        "created_at": "2021-09-04T00:27:21.890000+00:00",
        "attachments": null
    },
    {
        "author": "_____josh_____",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Of course the fees issue is being recognised. The network is unusable with current fees.\n\nI don't think forcefully pushing the gas limit is the solution. The network has a lot of spare capacity, there just isn't enough incentive for the miners to clear the backlog. \n\nAll network capacity is being hijacked by NFTs. These people don't even care how much they pay in fees. They're happy to bid gas up to 4000 and still pay a priority fee on top of that. There's no competing with them as regular users. The financial incentive of flipping a NFT is just too great. You can't increase the gas limit faster than the NFTs can spam the network. At some point you will also hit the limit where it no longer compensates miners for uncle risk.\n\nI think the base fee stepper is too sensitive at the moment. Panic bidding can send gas higher but there's not enough time for it to come back down.",
        "created_at": "2021-09-04T00:58:49.730000+00:00",
        "attachments": null
    },
    {
        "author": "_____josh_____",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It looked free to the rest of the network but it was basically being billed to the pool's miners",
        "created_at": "2021-09-04T01:00:40.129000+00:00",
        "attachments": null
    },
    {
        "author": "cf0009",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What \"spare capacity\" are you referring to?",
        "created_at": "2021-09-04T01:12:13.577000+00:00",
        "attachments": null
    },
    {
        "author": "bculberson",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Not sure miners would agree to increasing the gas limit, the additional tips would be negligible additional profit per block.",
        "created_at": "2021-09-04T01:26:24.281000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "miners should increase gas limit to 60M+. It will lower fees for their own payouts, and make the bigger mining pools stronger. Also since ETH is switching to PoS the miners probably doesent care about the longer term ramifications of a large blocksize.",
        "created_at": "2021-09-04T07:25:25.912000+00:00",
        "attachments": null
    },
    {
        "author": "eugeen001",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "but it will increase their AWS bill",
        "created_at": "2021-09-04T07:44:31.694000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "so i heard",
        "created_at": "2021-09-04T07:46:57.359000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i will take a increase to 40M tho 😄 better than nothing. But also this NFT bs(!) should be coming to an end soon. And then fees will probably never reach this level for a very long time again.",
        "created_at": "2021-09-04T07:48:14.302000+00:00",
        "attachments": null
    },
    {
        "author": "gwintery",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "OP has been constantly bashing EIP 1559 and finding ways to put it in negative light, some arguments of his even have fundamental misunderstandings of how things work. So take his comments with a grain of salt.",
        "created_at": "2021-09-04T09:05:41.380000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "how about a massive blocksize increase for 7 days just to clear the backlog.",
        "created_at": "2021-09-04T13:36:24.541000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "and reset the algorithm",
        "created_at": "2021-09-04T13:36:45.316000+00:00",
        "attachments": null
    },
    {
        "author": "gwintery",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "what algorithm needs to be reset exactly? Whatever level we are right now is the current status quo",
        "created_at": "2021-09-04T14:05:30.549000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "the algorithm that picks the price you pay. im assuming as long as there is a backlog it will raise the price. but thats a paradox because if it keeps raising the price then the backlog will never clear",
        "created_at": "2021-09-04T14:39:14.295000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm sorry for this but there's a lot of noise in this channel and then there's posts like this from \u003c@486501030046203915\u003e  that implies he has numbers of what users are reporting (there's an explicit \"users reported...\") https://discord.com/channels/595666850260713488/692078615269212180/882384695650844714 so I have a couple of questions: is there really an issue with fees post 1559? I thought there wasn't anything new, namely any issue with fees was already an issue before 1559. And if the answer to the above is yes, what's the problem to be solved? From Tim Beiko's tweets I gather that there's an optimization problem into deciding what's the percentage to increase/decrease given block gas usage, but besides that I haven't seen any actual problem with fees other than people complaining they are high.",
        "created_at": "2021-09-04T14:50:25.613000+00:00",
        "attachments": null
    },
    {
        "author": "gwintery",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think your understanding is wrong\nIf by backlog you mean transactions not included that is below the basefee, then it does not affect the 'fee picker' at all. The next basefee (price) is simply a function of how full the previous block is from my understanding. So a full 30M block will raise it by 12.5% and vice versa.",
        "created_at": "2021-09-04T16:02:55.846000+00:00",
        "attachments": null
    },
    {
        "author": "gwintery",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "as a case study, when EIP 1559 started, basefee started at 1 gwei, and due to people willing to pay more than that, blocks continued to be full and base fee increases accordingly. Hence, clearing the backlog would not affect things at all.",
        "created_at": "2021-09-04T16:04:16.922000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "When the fee picker steps down it discovers enough transactions wanting to be included to create a 30M block and it interprets this as a spike when in reality the transactions could have been waiting for a while and since it interprets it as a spike it immediately raises the price again so the backlog essentially doesn't clear as far as i understand.",
        "created_at": "2021-09-04T17:28:33.180000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is behaving as intended.  The gas target/limit is set to throttle chain throughput, and it is achieving that goal.",
        "created_at": "2021-09-04T17:31:32.030000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Right but the way its designed is resulting in fees consistently trending up even if the activity is the same or even decreasing",
        "created_at": "2021-09-04T17:32:37.168000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As far as i understand.",
        "created_at": "2021-09-04T17:32:50.626000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is incorrect.  The fees will stabilize where supply meets demand.",
        "created_at": "2021-09-04T17:33:52.333000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The fees go up to drive away demand until it matches supply.",
        "created_at": "2021-09-04T17:34:18.954000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This happens regardless. Its just less effecient than a free floating fee for example so the fees are artificially high if you will. they do drive away demand but due to the ineffeciency it doesent drop fees as fast as it drives away demand if you will.",
        "created_at": "2021-09-04T17:36:17.127000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The fees aren't artificially high for any more than a a block or two at a time.",
        "created_at": "2021-09-04T17:40:16.125000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "how so 🤔",
        "created_at": "2021-09-04T17:41:22.073000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If you see a block that is over half full, fees are too low.  If you see a block that is under half full, fees are too high.  It is pretty rare (outside of big events) to see many blocks in a row that are too high or too low.  It tends to oscillate between too high and too low.",
        "created_at": "2021-09-04T17:41:30.467000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Here is recent fullness (over 100% means fee was too low, under 100% means fee was too high):",
        "created_at": "2021-09-04T17:42:32.244000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "unknown.png",
                "content": "050ca8ab2a260e33bae2ed034da75650d25a9eb61054c5d3338c3bcd7f3cc970"
            }
        ]
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We have a 3 block run where fees were too low, a couple of two block runs, and some 1 block oscillations.",
        "created_at": "2021-09-04T17:43:05.345000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I was only referring to the rather imprecise estimation of priority fee, as also discussed here: https://youtu.be/ZmzIHFuwdg0?t=239 but i note again that I believe these effects are getting smaller over time, because the amount of legacy transactions is decreasing. see for instance this chart of the tip over time, notice the big cliff around aug. 19th, when MM rolled out 1559 (actually now the tips are going up again! NFTs?)",
        "created_at": "2021-09-04T20:00:20.919000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "Screenshot_2021-09-04_at_21.58.35.png",
                "content": "54c47fe7506ac89947414d3c65773f6a70252784b2970b69ebe4bd4c67875ccf"
            }
        ]
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "otherwise yes the update rule could be assessed/tuned further",
        "created_at": "2021-09-04T20:02:26.013000+00:00",
        "attachments": null
    },
    {
        "author": "_____josh_____",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "OP is simply frustrated, like regular people who actually need to use the network, with how the average fee is now 3x of pre-1559.\n\nYes there might be more on chain activity since then but spikes faded much faster back then. Single digit gas was a thing for most times. Now the daily low is higher than the max of most days and eth is also 2x higher resulting in double pain to people trying to use the network. It's locking out anyone who isn't using it for NFTs and to be happy about the current status quo just shows which side of the market you're on (the price cheerleader who doesn't care about usability).\n\nTo be dismissing the detrimental effect to transactions on the chain is just sad.",
        "created_at": "2021-09-04T23:12:50.690000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We have had times in pre -1559 history when fees were consistently much higher for very long periods of time.  You cannot compare two arbitrary points in time and assert that demand was the same between them.",
        "created_at": "2021-09-04T23:25:43.890000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "1559 does make it easier to ex.ress willingness to pay, which does mean there is less opportunity to profit from exploiting market inefficiency.",
        "created_at": "2021-09-04T23:26:14.757000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Essentially, there are some people who were previously able to capture sudden drops in demand by paying very close attention who now will struggle to find those opportunities because it is easier for people to now express their desires more clearly to the protocol.",
        "created_at": "2021-09-04T23:27:11.525000+00:00",
        "attachments": null
    }
]