[
    {
        "author": "andi9314",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hoping I am in the right channel for this, I want to raise some concerns about the fact that under 1559, when a block size goes over the target, fees are raised for subsequent blocks but not for the oversized block itself. I see why one might argue that we should charge higher fees to both the oversized block and future blocks. But I do not see how it makes sense to not charge the oversized block at all. Charging oversized blocks is more fair, is more efficient, and will even increase protocol revenue.",
        "created_at": "2021-07-31T20:37:02.984000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think the concerns are noted, but just not important enough to address right now. It makes a lot of sense to gather some data on how EIP-1559 works when real money is at stake, and go from there. If the base fee / gas usage oscillates and differs a lot block to block, it may be one of the first things that'll be improved in a next iteration.",
        "created_at": "2021-07-31T20:42:20.187000+00:00",
        "attachments": null
    },
    {
        "author": "andi9314",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Fair enough. I think it is a rather conspicuous flaw that shouldn't be a part of the mechanism, but I don't think it will break the protocol, so it's not urgent and can be changed in the next iteration.",
        "created_at": "2021-07-31T20:49:06.410000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It is no secret that EIP-1559 is imperfect! I do think it makes sense to already think a bit beyond just this one particular aspect; what would addressing this issue you mention look like as far as possible attacks are concerned, changes in economic incentives for MEV/miners, and implementation complexity for clients (or computational intensity for those running them)? (For the ethresear.ch topic you made on this)",
        "created_at": "2021-07-31T20:52:32.836000+00:00",
        "attachments": null
    },
    {
        "author": "andi9314",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "True, thinking about those issues would take time and effort. I think the starting point may be to figure out exactly what externality we are trying to correct, so that we know who should be paying for congestion (in other words, how long fee increases should last).",
        "created_at": "2021-07-31T20:57:34.090000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm not entirely sure what you mean with \"congestion\", because we're talking about the case where a block is not doubly full right? As in sum of gas of transactions in mempool eligible for inclusion is less than `gas_limit`.",
        "created_at": "2021-07-31T21:01:32.661000+00:00",
        "attachments": null
    },
    {
        "author": "andi9314",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I was using \"congested block\" to mean any block that is larger than the target size, so that the fee is increased for future blocks.",
        "created_at": "2021-07-31T21:07:56.968000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ah, OK. I think I have seen it mostly used to refer to the situation where inclusion reverts to a first-price auction again.",
        "created_at": "2021-07-31T21:11:07.646000+00:00",
        "attachments": null
    },
    {
        "author": "andi9314",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ah I see what you mean. Perhaps we want a different term for the in between case. I would say any block that's larger than the target is \"too large,\" in the sense that we want to increase fees and bring down the size.\nEven when a block is doubly full and there's a first-price auction, I think the basefee should be higher for the block. In fact, I think we should aggressively tax these blocks because as long as it remains doubly full, there's no deadweight loss from taxation (if we ignore the effect of taxation on subsequent blocks).",
        "created_at": "2021-07-31T21:13:08.572000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And tying into your question of \"what externality we are trying to correct\", I think that opinions may differ (or haven't even formed yet). There is something to be said for _not_ pricing slight bursts of capacity, as that is not something that bothers the network much (especially if/while block times are already variable). A sustained high load definitely does, as do _very_ high short bursts (i.e. a very large single block).",
        "created_at": "2021-07-31T21:17:39.934000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'd say, give it time, and poke people every now and then 😉",
        "created_at": "2021-07-31T21:18:38.466000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!806752647088439306\u003e the reason we increase the next block's `baseFee` is because the previous block's usage is the best proxy for current demand that we have, given it is costly to game (need to burn ETH) and cheap to verify (`gasUsed` is in the block header). I think if you want to improve on the 1559 mechanism, you'd need to have convincing data that this current proxy is very wasteful, and an alternative which isn't overly burdensome to implement. \n\nDefinitely agree that the mechanism likely will evolve in the future and that we can't get everything perfect in v1.",
        "created_at": "2021-07-31T21:58:13.517000+00:00",
        "attachments": null
    },
    {
        "author": "andi9314",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Makes sense. Once we have the data, I will do some welfare comparison of different pricing mechanisms and write something up.",
        "created_at": "2021-07-31T22:46:28.304000+00:00",
        "attachments": null
    }
]