[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!329594653097721856\u003e I believe that the argument is that for 1559 it makes more sense for clients to implement incremental block production with 1559 due to the \"rarely full blocks\" concept.",
        "created_at": "2021-02-05T15:25:31.688000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And once you have incremental block production, you might as well *start* with an incremental block build process as well.",
        "created_at": "2021-02-05T15:26:25.436000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "One not ideal aspect of the current base fee adjustment algorithm is btw that it slightly increases average throughput in times of high block size volatility:\nIf you have two perfect on-target blocks, the base fee stays the same. But if you have one empty and one 2x-block (in either order), you end up with a ~1.5% decreased base fee. So to get back to the same equilibrium base fee, you could have slightly above-target average throughput. I think the ideal situation would be either neutral (i.e. 0x and 2x end up back at the same base fee), or even slightly biased in the other direction (i.e. 0x and 2x slightly increases the resulting base fee). The effect is small enough though that I think it doesn't really matter too much for the first version.",
        "created_at": "2021-02-05T15:58:43.140000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(simply put, 1.125 * 0.875 \u003c 1)",
        "created_at": "2021-02-05T15:59:43.298000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah, it is because the algorithm used is the firm term of the taylor series for what would be \"exactly even\".",
        "created_at": "2021-02-05T15:59:56.535000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Oh, why I am telling you this... I think you already know that.  😛",
        "created_at": "2021-02-05T16:00:22.652000+00:00",
        "attachments": null
    }
]