[
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hello everyone. This server is an excellent resource, and having just reviewed some of the recent discussion in here, I wanted to ask for some thoughts on a concept I've been thinking about recently.\n\nI saw it said that the primary reason for burning the base fee as opposed to doing anything else is that some account would need to be in custody of those fees. It is definitely true that these fees must be burnt rather than have a trusted party take custody of it, even a DAO.\n\nBut one thing that I have been considering naively, is what if rather than burning, the base fees are used to subsidize transactions in the block, perhaps a quadratic funding-style approach where smaller transactions in a block have a larger portion of their fee subsidized? This would not make computationally expensive and high-gas transactions any more expensive than they are today—it would simply not subsidize those transactions. \n\nAs I understand it, this would be deterministic and not require any trust, as it would all be settled when the block is mined. Is this entirely not feasible or otherwised totally flawed? Is there potentially some merit to the idea of using the fees which are currently burnt to subsidize transaction costs?\n\nLooking at a random block, I saw ~0.04 ETH collected on 3 transactions and ~0.03 ETH of that was burnt. Could the burned fees somehow be used to reduce the overall deadweight cost by \"quadratically refunding\" smaller txs? Very sorry if this is impractically naive.",
        "created_at": "2021-10-31T17:38:12.850000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I like this idea, my first impression is that this will make the gas intensive transactions more expensive in an indirect way: by reducing the effective transaction fee of subsidized transactions, wallets will have to take into account this subsidy, even if stochastically, and blocks will be fuller and base fee will be higher in general",
        "created_at": "2021-10-31T18:49:40.545000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But the concept of distributing the base fee to users instead of to every holder I think it's an interesting one",
        "created_at": "2021-10-31T18:52:09.142000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Would this incentivize smart contracts to split up work across many transactions?",
        "created_at": "2021-10-31T22:08:03.460000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It also has slightly perverse incentives for rollups and proofs, which are individually expensive but should be cheap on a per-transaction basis (and for which we want to encourage movement to layer 2 where possible).",
        "created_at": "2021-10-31T22:09:46.101000+00:00",
        "attachments": null
    }
]