[
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Is there any research or data on how much this EIP will increase fees for transactions that accept a longer inclusion time for a lower fee?\nNever mind, apparently those transactions become completely infeasible.",
        "created_at": "2021-03-23T06:05:39.132000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i don't think this is true? you will still be able to send tx with fees lower that what is required for immediate inclusion",
        "created_at": "2021-03-23T12:49:08.296000+00:00",
        "attachments": null
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes you can _technically_ still send those transactions post-1559 but the chances of them making it into a block after a reasonable time are infinitesimal.\n\nCurrently a fee of 215 gwei gets you a space on a block. If one wants to make the time/fee tradeoff you could set a fee of e.g. 100 gwei. Bit of analysis shows that this tx would have a decent chance of being included in a block within the next 4 hours. We only need one _singular_ block where the lowest fee dips below 100 gwei for this to work. The chances of this happening randomly are actually pretty good.\n\nNow the same scenario under 1559 with ~200 basefee currently. In order for the same 100 gwei tx to be included _the whole basefee would need to come down to 100_ . This would require a (relatively) prolonged period of low demand so the basefee can slowly adjust downwards. The chances of this happening randomly are basically nil. It would only really happen if fees are going to settle at/below 100 gwei anyway.\n\nI mean the idea works, the EIP smooths the fee spikes. It does it upwards which decreases fees for people that bid too high. But also downwards which increases fees for those that were willing to wait. It removes a degree of freedom this way. Unfortunate, since one could save a lot on fees by planning out transactions.",
        "created_at": "2021-03-23T18:20:47.743000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think you're right in the case that all txs have a relatively stable gas price, as do all other txs in the mempool, and only your tx is a lot lower in gas price. If it's more of a spectrum (various gas prices in the mempool all the way down to yours), then I don't think it will change much with EIP-1559.",
        "created_at": "2021-03-23T18:46:13.223000+00:00",
        "attachments": null
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't know why exactly, but under the current system that spectrum gets 'eaten' by the volatility enough that these transactions _actually work_. I suspect that random faltering of demand for just long enough is statistically guaranteed due to the nature of the auction (maybe in combination with demand vs time of day). There are probably papers on it, I tried to make a simple model on it once without success.\n\nI know it works because I send these transactions regularly. 4 hours was optimistic for the example above, but the point is that it is X _hours_. With 1559 it could be X _months_ , or never. That's just what happens when there is a hard cap on fee movement, the downwards spike needed would have to be of such magnitude and duration that it won't happen. It only really gets there when that is a 'fair' fee. The EIP does very much crush that degree of freedom (time), it's obviously focused on guaranteeing transactions right now only. it's more a feature than a bug.",
        "created_at": "2021-03-23T19:20:54.063000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, 1559 makes it less “useful” to use the global txn pool to store txns which may eventually be executed at a lower price",
        "created_at": "2021-03-23T19:58:45.591000+00:00",
        "attachments": null
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I mean, the basefee auction is obviously better in general. Who wants to actually be forced to plan out transactions for savings? (not me). It's just a coping mechanism for these high fees. After some scaling, time/fee tradeoffs won't matter anyway.",
        "created_at": "2021-03-23T21:01:39.845000+00:00",
        "attachments": null
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "",
        "created_at": "2021-03-23T21:02:06.937000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "fees.png",
                "content": "82faf36b1586d37c11b6d6500ae3e46528ebf7aa21088ae9c0aa4ff9ed6d9496"
            }
        ]
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I hope some of this still holds post-1559, those time periods should be long enough that gas prices actually drop significantly. (Just have to send the txs on sunday morning 😅 )",
        "created_at": "2021-03-23T21:05:35.965000+00:00",
        "attachments": null
    }
]