[
    {
        "author": "elayne_malachite",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Proof of work is a statistical process. The number of possible hashes is incredibly large, so the advantage of narrowing that space isn’t as large as being able to guarantee that your block will be the next block. The change that you’re proposing will raise fees since it optimizes for the chain with the most expensive transactions. Trying to sell it to users will be an incredibly hard sell since it is an objectively worse system for them than pre and post 1559. After all, a collusion from miners to drop basefee to 1 simply means a functional return to pre-1559.",
        "created_at": "2021-02-16T00:40:00.678000+00:00",
        "attachments": null
    },
    {
        "author": "pintail_xyz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "1559 as designed is already optimised for the maximum price at which all gas can be sold - the market clearing price. This proposal wouldn't change that and should have no effect at all unless a majority of miners collude to suppress the basefee. The only way it would be more expensive for users is if miners are incentived to include their own junk transactions to increase burn (because otherwise they're only drawing on genuine demand from users, so reaching the market clearing price is the desired outcome).",
        "created_at": "2021-02-16T01:07:56.671000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There is no advantage in the proposed system to mining on top of head instead of as a sibling to head unless the current head is full (cannot include any more transactions).",
        "created_at": "2021-02-16T02:23:01.683000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You can mine on top of head, then propagate and get picked up by peers as the new head, or you can mine a sibling to head with 1 more transaction, and get picked up by peers as the new head.",
        "created_at": "2021-02-16T02:24:09.501000+00:00",
        "attachments": null
    },
    {
        "author": "pintail_xyz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The advantage of mining on the head rather than mining a sibling is that by mining on head you get a longer/heavier chain so you are less likely to be uncled (as in the status quo)",
        "created_at": "2021-02-16T02:41:13.826000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Not with the system you proposed above.  All you want is to be the current head.  Whether that is head of a longer chain or a shorter chain doesn't really matter.  Either people will mine off the current head (so you taking place of current head will cause people to mine off of you) or people will mine a sibling to current head (in which case it doesn't matter which chain you are part of).",
        "created_at": "2021-02-16T03:05:03.724000+00:00",
        "attachments": null
    },
    {
        "author": "pintail_xyz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Under this scheme, if you're the head of a longer chain then your chain will be preferred over a shorter chain. If it's not clear I'll do a worked example.",
        "created_at": "2021-02-16T03:07:14.611000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That doesn't matter.  At any given point in time you have 2 choice:\n1. Mine on top of current head.\n2. Mine to replace current head.\nThere is no advantage to (1) over (2) because in *either* case as soon as you mine a new block all miners will re-evaluate whether they do (1) or (2).",
        "created_at": "2021-02-16T03:09:15.668000+00:00",
        "attachments": null
    },
    {
        "author": "huntingisland",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "is there an analysis anywhere of fee burn vs. issuance under 1559 given current fees that I can link to?",
        "created_at": "2021-02-16T03:36:39.762000+00:00",
        "attachments": null
    },
    {
        "author": "pintail_xyz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It does matter because the longer you try to mine on top of an old block, the more likely it is that someone else will produce a block on top of the new block and the more likely it is you will produce an uncle - the same is true today.\n\nBut I can see that this proposal does potentially create a new incentive to mine to replace the head in a way that would be less favourable currently (since in the current system the new head would have the same weight as the old one) so perhaps it would make short range forks more frequent.",
        "created_at": "2021-02-16T05:50:26.212000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As soon as someone produces a new head block, you simply start mining a sibling to that.",
        "created_at": "2021-02-16T07:00:45.664000+00:00",
        "attachments": null
    },
    {
        "author": "pintail_xyz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Why? What's the reason to prefer mining a sibling to a child?",
        "created_at": "2021-02-16T07:15:27.995000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Because the sibling may have more gas fees available.",
        "created_at": "2021-02-16T07:49:31.959000+00:00",
        "attachments": null
    },
    {
        "author": "pintail_xyz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ok, thanks, I'll give this some more thought.\n\nIt's worth saying that it may already be profitable at times to mine a sibling rather than a child if the existing head block has exceptionally high fees or other MEV, but this proposal could make that problem worse because miners would be able to ensure (for a cost) that their sibling had a greater weight than a pre-existing head block.",
        "created_at": "2021-02-16T08:17:05.082000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e It's worth saying that it may already be profitable at times to mine a sibling rather than a child if the existing head block has exceptionally high fees or other MEV\nYes, this is the selfish mining problem and a big reason we want 1559.",
        "created_at": "2021-02-16T08:19:06.656000+00:00",
        "attachments": null
    },
    {
        "author": "pintail_xyz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Indeed and if a miner soft fork to neutralise 1559 turns out to be a real problem then a scheme such as the one I've proposed may be worth considering, even if it has deficiencies compared to 1559 with the existing fork choice rule (since that depends on miners not colluding). Just showing that it's a viable option may be a better deterrent than an obviously destructive emergency eth2 merge.",
        "created_at": "2021-02-16T09:05:08.049000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "https://twitter.com/trent_vanepps/status/1361662110699196416?s=20",
        "created_at": "2021-02-16T16:22:39.284000+00:00",
        "attachments": null
    }
]