[
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i dont understand how eip1559 solves the \"Problem\" that if you must get included in the next block you may have to pay x more than if you just waited for the one after that because it seems the 1559 algo will put you in a queue anyway or even cause nodes to reject your transaction if you arent willing to pay x more. Maybe it will just work",
        "created_at": "2021-06-03T03:04:57.942000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "",
        "created_at": "2021-06-03T03:17:57.646000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "unknown.png",
                "content": "1d51b159f98c09f9888b22cf0135301a767203f9ef3a0e995f9e57c4a16761bc"
            }
        ]
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The \"immediate demand\" is a function of cost of inclusion.  Essentially, the increase in the base fee drives demand for blockspace-at-current-price down.",
        "created_at": "2021-06-03T04:08:59.389000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Eventually, the demand-at-current-price decreases until it equals half of the block size limit.",
        "created_at": "2021-06-03T04:09:40.604000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It is *possible* for there to be a rapid (more than 2x) spike in demand-at-current-price, and when that happens you might miss inclusion in the next block and have to wait for a block or two, but the base fee will increase until once again the demand-at-current-price equals half of the available supply.  In times like these (which we expect to be quite rare), you may not make it into the next block despite a sufficient gas premium.",
        "created_at": "2021-06-03T04:10:59.210000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thinking in terms of apples, while everyone in the world may *want* one $0 apple, not everyone in the world wants one apple at any given price.  If you have 5 apples, you can increase the price of the apple until it reaches a point where there are only 5 people left who want it bad enough to buy an apple at that price (e.g., $1,000,000 apples).  We do the same with gas on Ethereum, increase the price until half a block's worth of gas people want to use Ethereum at the moment.",
        "created_at": "2021-06-03T04:12:52.488000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It seems to me that the ultimate solution is to have more smart contracts and tokenized assets developed in such a way that finality on the base layer can always wait. That and getting rid of the hundreds of utility tokens that are just adding an extra step for users where they have to spend gas to exchange to said token, then spend gas to use it, then spend gas to exchange it to the next thing they want to use. Its super wasteful. But that discussion has probably already been had and even belongs somewhere else, sry.",
        "created_at": "2021-06-03T04:39:07.396000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "1559 does not try to nor claim to reduce gas costs.  The proper solution for that is stuff moving to layer 2 and being more efficient with what they do on layer 1.\n\n1559 only tries to address the UX issue around gas cost estimation.",
        "created_at": "2021-06-03T05:29:21.467000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Understood.",
        "created_at": "2021-06-03T05:52:30.093000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Reminder 👋  Tim and I are hosting a **1559 Gas API** breakout call tomorrow, 14:00 UTC (10 ET)\n\nPlease DM me your email if you would like to be added to the invite!\n\nAgenda: https://github.com/ethereum/pm/issues/328",
        "created_at": "2021-06-03T16:35:39.637000+00:00",
        "attachments": null
    }
]