[
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I've been wondering whether \"freedom to reduce uncle risks by producing smaller blocks\" is a valid concern with crLists. I'm not well read on how ommers and attestations work in PoS other than ommersHash being reused somewhere.\n\nIn terms of hardware requirements, the current beaconchain parameters (32 ETH to participate) provide fixed bounds. It feels like crLists imposes a fixed (maximum additional) burden similar to EIP-3382 (although much smaller of course).\n\nPersonally it feels as though there are two \"challenges\" with EIP-3756: \n[1] Trauma from The Blocksize War (Bitcoin).\n[2] High likelihood that the gas limit will immediately rise to the limit (since it'll be seen as \"safe\" or \"endorsed\"), which would then result in more intense politicisation of the gas limit (leading into point [1]).\n\nPrior to EIP-1559 it would've been plausible for gas limits to've been lowered to maximise fee revenue for miners (in the short term). MEV tends to grow with (utilised) blockspace, mempool size and demand for inclusion (especially 'timely inclusion').\n\n**would crLists most likely include a fixed burden rather than a floating burden (e.g. 5% of blockgas)**.\n\nI can understand that imposing penalties on (nearly) empty blocks is similar in nature to the high opportunity costs of missing out on fee revenue and especially MEV. I'd expect most (small or) empty blocks post-merge to arise from late block proposals or connection issues, similar to empty slots / missed proposals, so maybe letting validators publish small/empty blocks isn't too important. \n\n[crLists: https://notes.ethereum.org/@fradamt/H1ZqdtrBF ]\n\nAlso, should crLists be discussed in \u003c#874767108809031740\u003e?",
        "created_at": "2022-05-10T09:26:01.886000+00:00",
        "attachments": null
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(the above was a reply inspired by \u003c@636289909359116290\u003e )",
        "created_at": "2022-05-10T09:26:55.641000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I’m glad I inspired something and wish I understood it better 👍🏻",
        "created_at": "2022-05-10T12:36:03.778000+00:00",
        "attachments": null
    }
]