[
    {
        "author": "roshanroshan",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thoughts on enforcing base fee burn on a block level instead of tx level? Today, each tx has to compulsorily burn the base fee from the sender account. This makes 0 fee txs and associated use cases pretty much impossible. I was considering if the base fee could just act as a _cap_ on the amount burnt from the sender (further capped by the tx's own max base fee which might be 0) and we enforce the burning on the _block_ level. This enables miners to include 0 fee txs and burn the base fee from elsewhere in the block like other overpaying legacy txs, their coinbase reward, etc. Needless to say, such txs would never actually be propagated in the P2P network since nodes would reject a 0 base fee due to spam concerns, but it's at least not blocked on a consensus level.",
        "created_at": "2022-03-11T12:46:54.318000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It was discussed in the past, allowing the block fee recipient cover the costs.  Check out the discussion link on EIP-1559 or perhaps Tim's HackMD page, I think the discussion on that can still be found.",
        "created_at": "2022-03-11T13:01:27.760000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "IIRC, we opted not to mostly because it was marginally more complex and we figured we could add it later if we wanted (maybe we do want 🤷).",
        "created_at": "2022-03-11T13:02:04.383000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Here's the proposal: https://ethresear.ch/t/make-eip-1559-more-like-an-amm-curve/9082",
        "created_at": "2022-03-11T17:22:52.364000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It _could_ still happen, but I think the thing that's likelier to overtake it is the idea of \"multidimensional 1559\", where we price different resources (state, storage, execution) in different fee markets: https://ethresear.ch/t/multidimensional-eip-1559/11651",
        "created_at": "2022-03-11T17:23:47.345000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I doubt that either of them are high near term priority relative to other roadmap items, given how large they are. One \"quick fix\" to 1559 that we might do sooner is this: https://eips.ethereum.org/EIPS/eip-4396",
        "created_at": "2022-03-11T17:24:50.557000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!283445391721234432\u003e ^",
        "created_at": "2022-03-11T17:25:04.140000+00:00",
        "attachments": null
    }
]