[
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "*I might be very very silly here*\nIt could be far more work than it's worth (for humans and validators (even a DoS risk)), but it'd be cool to see EL clients identify \"nearly invariant tx\". \n\nAs in \"this transaction is very unlikely to change from valid to invalid over a span of N blocks, unless it has already been included\".\n\nIf N is small enough this is fairly reasonable for simplesends (Ether sent between EOAs). The accounting mightn't be worth it, but you could check the relative size of the transfer, e.g. \"less than 5% of the account's balance is being sent = chances look better\". \n\nThere can be tricky ERC20s so I'm not sure about them.\n\nAssumption: \"nearly invariant tx\" would be easy to (a) check for validity in parallel and (b) construct a decent block AOT. Of course the validator will check the tx prior to proposing a block, but for low-tip transactions it's plausible you could cheaply build up quite a queue of valid ones.",
        "created_at": "2022-08-25T06:54:33.162000+00:00",
        "attachments": null
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "One downside of implementing this would be that as this strategy gains adoption and as demand for simplesends drop, the feasibility also drops off. \n\nSo it's a little self-defeating, however I could imagine this might improve simplesend inclusion time (for a given tipfee tranche) (hence slightly increase demand). You'd expect low-tip low-gas tx to be included quite a bit: with constant blocktimes you'd expect this to be more reliable too (block packing challenge). \n\nUnder EIP-1559 this changes for pools that have multiple consecutive or near-consecutive proposals (since excluding low-tip low-gas might be worthwhile to increase proportion of tipfees (vs basefees) received in subsequent blocks).",
        "created_at": "2022-08-25T07:01:24.436000+00:00",
        "attachments": null
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The other major categories would be ERC20 transfers between rollup contracts and simplesends between relatively stable-balance contract accounts.",
        "created_at": "2022-08-25T07:03:40.904000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What problem are you trying to solve by identifying \"nearly invariant transactions\"?",
        "created_at": "2022-08-25T07:13:47.896000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Once you have identified them, what do you do with that information?",
        "created_at": "2022-08-25T07:14:03.977000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "there was some research into static vs dynamic state access for transactions and if you have state access witnesses and only a static state access transaction you can just directly tell",
        "created_at": "2022-08-25T15:28:00.070000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "if there is dynamic state access you can use the witness as a guide to know which computations you'd need to re-evaluate to understand change in behavior",
        "created_at": "2022-08-25T15:28:30.223000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Why do we need to know this?",
        "created_at": "2022-08-25T15:55:39.693000+00:00",
        "attachments": null
    }
]