[
    {
        "author": "quasar_win",
        "category": "Cross-layer",
        "parent": "",
        "content": "Copying this over from the other discussion forum to help transition everyone. There was discussion around cost of builder stake getting reduced to 1 ETH. I posted the following due to concern a lower price could cause large builders to race to acquire staked keys if it gives them an advantage:\n\n\nI have an example from the other industry we work in, domain name registration. When domain names expire for good, the domains are “dropped” at a specific hour each day in succession. Each registrar is allowed to register the name the moment it drops. It costs a minimum of $4000 per “registrar” license per year. We used to participate in these drops, but what registrars learned is that each license gave them another connection with the ability to send a register command, and that gave them a tiny latency advantage. \n\nNow only two registrars participate in drops. Each one with several hundred licenses, those licenses were acquired by the registrars via license themselves or “loaning” them from other registrars. No other registrars are able to catch domains anymore. Obviously the system is different, but I think it demonstrates what seems like tiny advantages can quickly lead to very rapid consolidation.",
        "created_at": "2025-12-11T00:58:26.687000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Cross-layer",
        "parent": "",
        "content": "i do think thats a good example of what we probably don't want to encourage.",
        "created_at": "2025-12-11T01:01:51.607000+00:00",
        "attachments": null
    },
    {
        "author": "quintuskilbourn",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is a great example. Of course, market concentration can happen in many different kinds of markets. we should continue to iterate on the market design to move towards a less concentrated market. \n\nThe proposed design seems pretty good because validators still have some say in what endpoints they want to add",
        "created_at": "2025-12-11T01:07:20.011000+00:00",
        "attachments": null
    }
]