[
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "hey folks! Would appreciate some feedback on the specs of the staked builder-api here: https://github.com/ethereum/builder-specs/pull/138 😄",
        "created_at": "2026-01-07T12:51:43.685000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'd like feedback from builders on this comment: \nhttps://github.com/ethereum/builder-specs/pull/138#discussion_r2668385415\n\nWe can send a list of builder indices per endpoint. This is fine for all builders that replying from the same endpoint in case a builder is rotating indices. But also we could send a list of all builders the CL is requesting from. This leaks information but allows the CL to sign only once. I believe replay of those JIT bid requests may not be an issue cause it's a race and the deadlines aren't that short.",
        "created_at": "2026-01-07T13:13:38.734000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "it makes sense to just have a list of builder indices and then have the validator sign over it to authenticate the getBid request",
        "created_at": "2026-01-07T13:19:46.380000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "yes that's exactly what I am saying, the question is if builders find that allowing that list to contain indices that they don't serve on the endpoint is enough of an attack or not",
        "created_at": "2026-01-07T13:20:50.105000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "any one of those other builder indices could replay the request from the validator JIT to find out their valuation",
        "created_at": "2026-01-07T13:21:24.103000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "my thinking is that, i don't expect builders to change their builder index frequently. So if we don't want to send all builder indices at once, the clients could cache the signatures for the individual builders?",
        "created_at": "2026-01-07T13:37:31.269000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "yes, that is going to be the implementation unless we can just sign all of them and just cache one message.",
        "created_at": "2026-01-07T13:38:37.295000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "also dumb q, how will an entity outside the proposer access the signed builder indices list required to send the bid unless the proposer shares it to play the replay attacks?",
        "created_at": "2026-01-07T13:38:44.339000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "but yeah, eitherway is not complicated to cache the signature of the separated object (by the way that is indeed a better design that signing over the full request)",
        "created_at": "2026-01-07T13:39:13.859000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also can I get a discussion about the   \"X-Timeout-Ms\"?  ultimately I think it's fine to have this in the API so that we can tweak according to network conditions/slot times. But can we agree on **not** making this configurable on clients? why in the hell would we be aiding on timing games? this is IMO one of the reasons we're seeing strugling nodes when they don't hit their min-bid on mainnet: they wait an entire useless second to get a bid and then their blob-filled blocks don't get delivered on time. \n\nThe language in the API I think should also be changed, this is the timeout and that's it, honest builders should reply immediately, not use it to delay their reply. Any delay is is off-protocol",
        "created_at": "2026-01-07T13:46:46.336000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "ultimately if we remove this header entirely and allow clients to agree on a reasonable timeout, communicate it with time to builders, it should be more than fine IMO. We should stop the timing-games shenanigans. If we move to 2 seconds attestation deadlines, this timeout cannot be longer than 200-300ms anyway IMO",
        "created_at": "2026-01-07T13:48:36.688000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "so about 2TTL",
        "created_at": "2026-01-07T13:48:50.650000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Left a couple of more comments, there's a mistake in the return type of the bid request and also I believe the `accept_el_payment` boolean should be a uint instead of a bool",
        "created_at": "2026-01-07T13:58:38.952000+00:00",
        "attachments": null
    },
    {
        "author": "serenita_io",
        "category": "Cross-layer",
        "parent": "",
        "content": "timing games",
        "created_at": "2026-01-07T17:53:21.846000+00:00",
        "attachments": null
    }
]