[
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "With ePBS, i believe the circuit breaker logic should change such that when there are a certain threshold of missed slots. The proposer should fallback to p2p bidding rather than just self-building as specified today",
        "created_at": "2026-01-12T08:17:32.136000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "also want to know what ppl think about: https://discord.com/channels/595666850260713488/874767108809031740/1459588869686038650 \nwe could potentially avoid replay attacks by also requiring that the validator registration endpoint be authenticated similar to the get bid endpoint?",
        "created_at": "2026-01-12T08:18:33.736000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think the circuit breaker should be gone on ePBS and just ban/unban individual builders aggresively with different heuristics.",
        "created_at": "2026-01-12T12:50:23.807000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "thats an interesting idea. today we already can ban a builder by removing them off the mev-boost whitelist but thats a manual process. \nI think we can still have fallback when there are missed slots.\nWill per builder ban be global or per validator?",
        "created_at": "2026-01-12T14:48:13.161000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "if a validator bans a builder then will it ban it forever? we could have a cool down logic but if the proposer next proposes after 2-3 months, then how do we define a cooldown? in terms of blocks?",
        "created_at": "2026-01-12T14:49:08.532000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "the most non-invasive change for now to me, seems to have the fallback to local + p2p bidding and then let proposers manually blacklist?",
        "created_at": "2026-01-12T14:50:09.033000+00:00",
        "attachments": null
    }
]