[
    {
        "author": "0w3n6325",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think doing something like this and keeping builder indices lists seperate per endpoint would be prefereable.\n\nA replay attack seems highly likely and a builder couldn't safely ignore already seen requests, as there's no way to tell if the second one seen is the legitamate one arriving out of order.",
        "created_at": "2026-01-08T00:29:52.235000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah this sounds right to me. Not entirely certain if builders will use the functionality of the list of indices (they need to remember every index that they ever used also) or if the simplicity of a single index is better",
        "created_at": "2026-01-08T00:38:20.127000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "when we pass in a list of builder indices in the getBid endpoint, i think we will also have to support receiving bids from the indices specified in the list",
        "created_at": "2026-01-08T10:52:42.817000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "lets say builder A has indices [4, 5, 6]. they could submit 3 `ExecutionPayloadBid`s with indicies 4,5, 6. I am not sure what advantage it gives a builder to do that. They could end up being able to send more bids to the proposer i guess?",
        "created_at": "2026-01-08T10:53:53.561000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "it might make more sense to allow builders to return only one execution payload regardless of the number of builder indices they have registered?",
        "created_at": "2026-01-08T10:54:34.184000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm not sure actually I see pros and cons. It could allow the builder to send different amounts, trusted vs trustless, or other variations of blocks. It could also be exploited for timing games. \n\nStill not sure if adding lists is even worth the extra complexity TBH. No builder has expressed preference for this yet",
        "created_at": "2026-01-08T10:56:39.512000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah allowing builders to produce different variations of blocks makes sense. timing games probably will reduce a bit with ePBS as the attestation deadline goes down to 3s.",
        "created_at": "2026-01-08T11:04:55.068000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "i think with a lack of info from builders, i will specify the need to pass in builder indices as a list and the getBid rpc can get multiple bids corresponding to the builder indices as a response",
        "created_at": "2026-01-08T11:05:31.265000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "going forward, i think it will be nice to have a common tag for builders so we can refer to them at once for any call to action like reviewing a PR in the builder-specs 🙂 its very painful to co-ordinate in private channels! and anyways we are enshrining them in the protocol at this point 🙂 \ntagging a few builders who we can start adding the tags to \u003c@1219236235109859332\u003e \u003c@237562875894431744\u003e \u003c@853943247201370112\u003e \u003c@1359219536271900995\u003e \u003c@177711679977684993\u003e \nplease tag any other folks i would have missed 🙂\ncc: \u003c@199561711278227457\u003e \u003c@731289513942450317\u003e",
        "created_at": "2026-01-08T14:00:21.350000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "i beileve we can do the same for staking pools too",
        "created_at": "2026-01-08T14:01:19.744000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "today i wouldn't know how to reach out to a staking pool if i didn't have a private connection with them",
        "created_at": "2026-01-08T14:01:35.056000+00:00",
        "attachments": null
    },
    {
        "author": "0w3n6325",
        "category": "Cross-layer",
        "parent": "",
        "content": "For this discussion about single index vs index list. Just to be clear. We talking about a mapping from url to index?\nLike even if we go with just a single index per url. We could still have muliple builders e.g.\n```\neu.titanrelay.xyz -\u003e 4\nus.titanrelay.xyz -\u003e 5\ntk.titanrelay.xyz =\u003e 6\n```\nVS\n```\ntitanrelay.xyz -\u003e [4,5,6]\n```",
        "created_at": "2026-01-08T14:17:28.650000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah both are acceptable. It makes sense for clients to support a list of indices corresponding to a url rather than just restricting to 1. \nthe main intent of the indices is to ensure that the request to get the bid is authenticated so that only the proposer is able to request the bid and not other builders. \nWith each request to fetch the bid, we would send in the request body the following object:\n```\nclass SignedBidRequestAuth(Container):\n   builder_indices: List[BuilderIndex]\n   signature: BLSSignature\n```",
        "created_at": "2026-01-08T14:27:30.120000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "i m unsure if we need any other details in the object outside builder_indices? i believe as long as we are able to target the specific builder with their builder indices, we should generally be fine. adding more fields might not add more value",
        "created_at": "2026-01-08T14:28:30.724000+00:00",
        "attachments": null
    },
    {
        "author": "0w3n6325",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah this is nice a simple and meets the need. We can cache sig.",
        "created_at": "2026-01-08T14:36:27.704000+00:00",
        "attachments": null
    },
    {
        "author": "0w3n6325",
        "category": "Cross-layer",
        "parent": "",
        "content": "The only issue is whether the complexity of a list is worth it. The current builder spec makes one request to a builder and gets one signed response back so that seems good enough. But I'll wait to see what other people on my team say. They might be have a good argument in favour of a list.",
        "created_at": "2026-01-08T14:41:23.929000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "it really depends on the builder whether they will have multiple builder indices or not. One thing with having multiple builder indices is that, the builder could return multiple varying bids with different features as potuz mentioned above. it could increase the builders expressivity, but i m not sure if you folks see value in that",
        "created_at": "2026-01-08T14:45:57.854000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "def happy to hear more feedback from you folks 🙂",
        "created_at": "2026-01-08T14:46:27.987000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "not exactly, it woulbe be more like \n```\neu.titanrelay.xyz -\u003e [4,7,8]\nus.titalrelay.xyz -\u003e [5,9,10]\ntk.titanrelay.xyz -\u003e [6,11,12]\n```\nThe reason being that you may have deposited these builders but only return from 4,5 and 6, but if 4 is running out of funds or whatever infra problem you can't run it and you want to rotate it to 7, you can serve bids from 7 on the same endpoint and CL nodes will accept them until you solve the problem with 4 and can rotate back. \n\nFrom the CL client side, these would still mean 3 calls and 3 returns to compare.",
        "created_at": "2026-01-08T14:52:07.469000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I am uncertain if builders **really** want or need this feature of rotation, so perhaps just having a single index per endpoint is best for all as it's specified now",
        "created_at": "2026-01-08T14:52:46.833000+00:00",
        "attachments": null
    },
    {
        "author": "0w3n6325",
        "category": "Cross-layer",
        "parent": "",
        "content": "Actually, yeah in terms of managing balances this might be super useful. A relay then wouldn't need to be staked.\nWe could have one URL for our relay that maps to a list of indices of the builders that submit to us. This way builders manage their own balances.\n\nOr alternatively. If the relay is staked. We could stake multiple indices. Accept collateral from unstaked off protocol \"builders\" that submit to us and manage those balances seperately using our different indices.",
        "created_at": "2026-01-08T15:09:36.125000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "this is interesting. the problem i see with this is that,with the cases you are talking about, the builder indices associated with your url would dynamically change as you onboard more builders. \nCurrently the thinking is that the builder would advertise the builder index along with their url but if the situations mentioned come up, we might need a url which returns the builder indices associated with the builder too?",
        "created_at": "2026-01-08T15:13:40.199000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "it generally seems like a good idea for clients to know the builder indices associated with the builders they have whitelisted since we won't connect with all builders with the builder-api",
        "created_at": "2026-01-08T15:14:38.384000+00:00",
        "attachments": null
    },
    {
        "author": "0w3n6325",
        "category": "Cross-layer",
        "parent": "",
        "content": "How does this builder data get into the CL? config file?",
        "created_at": "2026-01-08T15:16:14.737000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "yes it might likely be through a config file",
        "created_at": "2026-01-08T15:22:02.694000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "https://hackmd.io/@tchain/payment-config could be something like this",
        "created_at": "2026-01-08T15:22:22.705000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "this is fine, as long as the relay only returns one single bid though",
        "created_at": "2026-01-08T15:24:07.504000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "i m mostly concerned about the case where the builder indices for a given url will change over time. We then will need an api to fetch the indices associated with the url",
        "created_at": "2026-01-08T15:31:36.027000+00:00",
        "attachments": null
    },
    {
        "author": "0w3n6325",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah an endpoint would be good. Looking at this config. It would be much better to dynamically retrieve the indices part from an endpoint. CL confirms ownership of the URL by calling the endpoint and receiving the expected response. The builder code can sign the indices. The CL can verify the sigs. No need for some other out of band mechanism to manually provide these signed indices.\n\nAlso, it is very difficult to get all node operators to update their configs when something changes on the builder side. So keeping that to just the endpoint would be better.\n```\n  builders:\n    - endpoint: \"https://relay.alce.eth\"\n      indices:\n        - validator_index: 12345\n          signature: \"0xabc...\"  # Proof builder controls this validator\n        - validator_index: 67890\n          signature: \"0xdef...\"\n      trusted: true\n      bid_boost: 1000000000\n      min_bid: \"0.1\"\n      min_advantage: \"0.05\"\n```",
        "created_at": "2026-01-08T15:47:03.625000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah i think so too. the question also is how frequently will a CL need to update its builder indices list? i.e how frequently it will have to call this endpoint. I believe it will be enough if they call it in the previous slot when they will propose so that they can update the list of builder indices.",
        "created_at": "2026-01-08T15:52:43.474000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "a thought, could we instead sign over the builder URL instead of builder indices? the builder URL will change much less frequently and the signature can be more effectively cached?",
        "created_at": "2026-01-08T15:55:30.886000+00:00",
        "attachments": null
    },
    {
        "author": "0w3n6325",
        "category": "Cross-layer",
        "parent": "",
        "content": "signing over the URL seems good enough to me if the only purpose of this is for proposer to authenticate to the builder",
        "created_at": "2026-01-08T16:33:26.945000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "have documented this over here https://github.com/ethereum/builder-specs/pull/138/files#r2672989533  would love some builder feedback on it(and on the builder-api spec in general). \ni think it might be enough to just sign on the builder url instead of the builder indices if the builder indices are going to dynamically change which i think it might",
        "created_at": "2026-01-08T17:32:37.507000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "this is probably the best idea indeed!",
        "created_at": "2026-01-08T18:28:17.028000+00:00",
        "attachments": null
    }
]