[
  {
    "author": "bharath.vedartham",
    "category": "Cross-layer",
    "parent": "",
    "content": "With ePBS, I think we can remove validator registrations and require builders to receive the validator_index, fee_recipient, proposal_slot, gas_limit via the ProposerPreferences gossip topic. \nWe can just communicate per-builder preferences like `BuilderPreferences` via the the validator registration API. \nThe proposer preferences currently will just include the `max_trusted_bid`.  We could just have a:\n```\nclass BuilderPreferences(Container):\n    max_trusted_bid: Gwei\n```\n\nUnless node operators want to maintain separate fee recipient and gas_limit for bids received via builder-api and bids received via the p2p topic",
    "created_at": "2026-02-10T09:57:52.325000+00:00",
    "attachments": []
  },
  {
    "author": "potuz",
    "category": "Cross-layer",
    "parent": "",
    "content": "Yeah this makes sense to me, someone was arguing that this will lead builders to produce blocks when they won't be contacted by the proposer, but I think this is irrelevant",
    "created_at": "2026-02-10T10:49:02.441000+00:00",
    "attachments": []
  },
  {
    "author": "bharath.vedartham",
    "category": "Cross-layer",
    "parent": "",
    "content": "Builders can listen to the gossip topic for the preferences. I think that should generally be fine by them",
    "created_at": "2026-02-10T10:50:29.312000+00:00",
    "attachments": []
  },
  {
    "author": "bharath.vedartham",
    "category": "Cross-layer",
    "parent": "",
    "content": "I also wrote up an issue on a different way to do request auth here: https://github.com/ethereum/builder-specs/issues/147\n\nI was generally a bit unhappy with requiring the proposer to sign over the builder URL as it feels weird to mix the DNS protocol and Ethereum protocol in a way. And also requiring the proposer to sign over builder index as we either assume a URL has a 1:1 mapping to the index or have a endpoint to fetch the builder indices associated with a builder URL which would make clients handle state in the Builder-API. \n\nA compromise could be to sign over an object like the below:\n```\nclass RequestAuth(Container):\n    slot: Slot\n    parent_hash: Hash32\n    parent_root: Root\n    validator_pubkey: BLSPubkey\n```\nThis is a signature which is unique per slot but common across builders. We want the proposer to sign the requests to have bid privacy. I think having to sign a request per slot which is common across builders along with a proposer deadline to get the bid might not give builders enough to query other builders bids and act upon it?",
    "created_at": "2026-02-10T11:28:50.593000+00:00",
    "attachments": []
  },
  {
    "author": "bharath.vedartham",
    "category": "Cross-layer",
    "parent": "",
    "content": "This could also help with sidecars. We ideally should absorb sidecar functionality into clients with ePBS but having a signature which common across builders but unique in the slot can help sidecars optionally exist without requiring to tap into validator keys. \nMaking sidecars optional might be good for external innovation but the default option of MEV-Boost functionality will exist in clients",
    "created_at": "2026-02-10T11:30:11.684000+00:00",
    "attachments": []
  }
]