[
    {
        "author": "dmitriishmatko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!364458974906548225\u003e Great work! I have several questions regarding your write-up:\n1. did I understand correctly that in skipgraph all intermediate nodes in search act as relays?\n2. Did you tried range queries, how it handles it? How could it work together with hashing of the keys?\n3.  Skipgraph paper points on several not solved issues, especially size of handled links by each node. As skipgraph is set of several skiplist, there are some duplication. Given eth1 numbers like 100m accounts, 10m blocks etc, how much data is expected to be stored for these links?",
        "created_at": "2020-06-02T08:05:23.758000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!449019668296892420\u003e oh, so what we would do is just add some extra data in front of the 'proposal 2' encrypted header?",
        "created_at": "2020-06-02T18:11:45.764000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "yeah, so for proposal 2 we would add a header and shorten the IV - that would let it match naive quic filters but not stateful ones - we'd lose a bit of IV which generally I think is not a big loss",
        "created_at": "2020-06-02T19:16:47.896000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "but the cooler part is really going for the long header and either making every single packet look like a handshake (ie a quic connection attempt) or really use the quic connection handshake to pass the right discv5 params",
        "created_at": "2020-06-02T19:17:41.435000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm just a little bit.. uncertain about that - stuffing connection  tables with quic handshake lookalikes, on balance, might turn out to be a bad idea because you might have equipment that reacts to failed handshakes and shuts it down, creating the opposite effect - it's a bit of a balance",
        "created_at": "2020-06-02T19:19:28.689000+00:00",
        "attachments": null
    }
]