[
    {
        "author": "donschoe",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e 1. Use another format that has the public key info, e.g. Enode, or a multiaddr with extra public key field. No proper ENR can be build from this though.\n\nThis is the part I do _not_ understand. If I connect to a node using IP, Port, and PubKey, then I can do a handshake. Can I?\n\nIn a subsequent step I could inform that node that I want to have a signed ENR. I can easily verify the ENR signature against the known public key. Can I?",
        "created_at": "2020-06-18T13:12:52.119000+00:00",
        "attachments": null
    },
    {
        "author": "donschoe",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e 2. Use a multiaddr with all ENR fields (incl. signature) so the ENR can be fully rebuild.\n\nPlease not. 😄",
        "created_at": "2020-06-18T13:13:18.039000+00:00",
        "attachments": null
    },
    {
        "author": "donschoe",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e 3. Just use ENR.\n\nIMHO ENR is nothing that should be communicated externally. From the way it's desinged it should be used internally only for discovery.\n\nFor everything else, bootnodes, manually connections, first handshakes, we should try to have some straightforward way to do this hasslefree, e.g., enode or multiaddress with pubkey.",
        "created_at": "2020-06-18T13:14:58.415000+00:00",
        "attachments": null
    },
    {
        "author": "donschoe",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e It is not really high on the priority as I see it rather as a nice-to-have as from my understanding  the feature is required mostly for making manual connections to bootstrap nodes  more convenient while testing and such. \n\nI'm mildly opossing this. Experience has shown that nice-to-have will usually not make it in the long run. Just have a look at the ETH1 address format that was only implemented in one client and eventually we still use the raw unchecked addresses in 2020.\n\nI'd encourage to every team to not wave this away. Maybe I'm biased because _making manual connections_ is what I do for a living.",
        "created_at": "2020-06-18T13:18:33.226000+00:00",
        "attachments": null
    }
]