[
    {
        "author": "dmitriishmatko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!364458974906548225\u003e could you share your fork? I'm researching this area too",
        "created_at": "2020-05-30T08:08:45.552000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!425907307621122049\u003e https://github.com/ethereum/alexandria and my write-up: https://ethresear.ch/t/explorations-into-using-dht-skipgraph-for-chain-and-state-data-retrieval/7337\n\nYou should ignore the changes to the the actual protocol that I made (no ENR records, probably slightly different handshake protocol).  Those are just me getting a simple working protocol so my nodes could talk to each other.\n\nThe important parts would be the messages supporting advertising what content you have, figuring out who has the content you want, and retrieving the content from specific nodes.\n\nThe experimental parts are the SkipGraph which allows for *efficient* range queries across the keyspace which when combined with the semantics of how you key content can allow for efficient retrieval of thing likes \"all the transactions for a given block\", or \"all headers in the number range 100-200\".\n\nI'm reasonably confident that the network would allow/facilitate the following even without the skip graph stuff:\n\n- distributed storage of the header chain, block bodies, block receipts. Retrieval should be performant enough for full node syncing.\n- retrieval (and local verification) of the index data like mapping from `BLOCK_NUMBER -\u003e BLOCK_HASH` and `TXN_HASH -\u003e BLOCK_HASH`  which enable serving the JSON-RPC APIs like `eth_getTransactionByHash` without needing to maintain the full indexes locally.\n\nWorth noting that there is no compulsury storage in my model so it's *opt-in* for nodes to choose what content they wish to make available.",
        "created_at": "2020-05-30T14:33:08.508000+00:00",
        "attachments": []
    }
]