[
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!194432762315407360\u003e I just did https://github.com/ethereum/ddht/pull/92 which gets my implementation up to date with the test fixtures you posted here: https://github.com/ethereum/devp2p/pull/157#issuecomment-694171383\n\nIt does **not** appear that those fixtures have been updated to include the reduction of `id-nonce` down to 16 bytes and the inclusion of the `iv` in the signed data.  (can you confirm).  Would it be helpful for me to regenerate those fixtures with that update?\n\nAlso, the `handshake` fixtures there are using a 64 byte ephemeral public key as opposed to the 33 byte compressed version.  Is that intentional?",
        "created_at": "2020-09-23T23:14:13.551000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The only change I had to make to my implementation was updating the handshake header packet to include the `aes_gcm_nonce` field which wasn't previously part of the header.  Are there other changes that I should be aware of (other than the `id-nonce/iv` one I already mentioned)",
        "created_at": "2020-09-23T23:17:34.290000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Another question.  How far are you on your implementation.  Any chance you're at a point where you could spin up a bootnode for us to test our's against?",
        "created_at": "2020-09-23T23:18:05.949000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There was also a suggestion in the spec to restrict the size of `request_id` which I support but doesn't seem to be represented.  4-bytes seems like plenty.  2-bytes is probably enough since request ids can be recycled and we definitely aren't going to have more than 65535 in-flight requests for a single peer at any given time .  I'm 👍 on making this change.",
        "created_at": "2020-09-23T23:27:03.234000+00:00",
        "attachments": []
    },
    {
        "author": "agemanning",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Felix said he updated his version yesterday but still in the process of updating the spec. Its here: https://github.com/fjl/go-ethereum/tree/p2p-discover-v5-new-format\n\nI plan on going through and testing it today. Will let you know if I find any discrepencies",
        "created_at": "2020-09-23T23:53:08.377000+00:00",
        "attachments": []
    },
    {
        "author": "agemanning",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Actually, I might wait for the spec to be updated to the latest few changes before going through inteop testing",
        "created_at": "2020-09-23T23:58:25.285000+00:00",
        "attachments": []
    }
]