[
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "In EIP-2930, it says:\n\n\u003e However, this EIP proposes only a 10% initial discount to access lists, so there is almost no cost to not bothering with access list generation and only making a simple transaction\n\nSince the access list is paid for upfront (part of intrinsic cost) and no refund is given for elements not accessed, isn't there potentially a large cost for bothering with the access list? For example, suppose you provide an access list for a tx that interacts with Uniswap. By the time your tx makes it in, the price has slipped more than what your tx can tolerate and so it reverts. Normally this is fairly inexpensive, but because 2930 txs prepay for state access, this tx may still be rather expensive. If occasionally the tx's access list is off significantly, wouldn't this wipe out any savings and cause almost no one to generate an access list?",
        "created_at": "2020-09-22T15:18:36.246000+00:00",
        "attachments": null
    },
    {
        "author": "0xraino",
        "category": "general",
        "parent": "",
        "content": "\u003c@!543900561460822016\u003e I followed until the \"almost no one\" bit. I see why some txs would be better as original so as not to lose a lot in the case of a revert but wouldn't there be some txs that are quite inelastic to this and almost always prefer the access list? Or are you saying that the latter set of txs exists but is very small so the overall effect of the EIP will be small?",
        "created_at": "2020-09-22T18:16:02.466000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "I suppose that’s true, there probably are a subset of txs that will almost always prefer an access list. It’s not clear to me what % this is, probably need to do some analysis on this. Was curious if I was overlooking something simple",
        "created_at": "2020-09-22T18:20:35.812000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "\u003e Since the access list is paid for upfront (part of intrinsic cost) and no refund is given for elements not accessed, isn't there potentially a large cost for bothering with the access list?\n\nSo for starters, probably the only ones using it would be those that _must_ use it, in order to un-bork a contract flow. Later on, if we do more raises of gascosts, the margin may change, so that eventually _not_ specifying an access list will become prohibitively expensive.",
        "created_at": "2020-09-22T19:26:12.849000+00:00",
        "attachments": null
    },
    {
        "author": "tkstanczak",
        "category": "general",
        "parent": "",
        "content": "https://ethereum-magicians.org/t/eip-2929-gas-cost-increases-for-state-access-opcodes/4558/27?u=tkstanczak",
        "created_at": "2020-09-22T22:32:33.914000+00:00",
        "attachments": null
    }
]