[
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003c@!433705373070000138\u003e  \"relatively competitive to precompiled in the use of elliptic curves\"\nMy take has always been that an extended EVM can be made relatively competitive to native code.  But testing shows it takes a compiler to approach native C, and that optimizing compilers are a DoS vector. And those gas fees have to be counted.  So the EVM will always be at some disadvantage here, but I can't say how much.  I think @axic is in a position to make measurements.   (And I've heard some stuff requires assembly.)",
        "created_at": "2020-08-23T05:40:30.212000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I had a thought - if we raise the cost of SLOAD to 2300 gas now, then we will also raise the cost of SSTORE for non-changing the value to 2300, which is kind of getting closer and closer to what it originally was (5000). So much for the usefulness of EIP-2200 🙂 I feel slightly vindicated 🙂",
        "created_at": "2020-08-23T20:51:46.446000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "the cost of EIP-2200 was quite high, but benefits will be thinned out over time",
        "created_at": "2020-08-23T20:53:43.928000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "next time, we should prefer targeted solutions (like this: https://eips.ethereum.org/EIPS/eip-1153) instead of shoehorning and piggybacking",
        "created_at": "2020-08-23T20:55:54.670000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "And and idea: why don't we make a gas golf competition for the implementation of EIP-2537 for EVM, with and without EVM384. With prizes for all sufficiently different implementations that actually work correctly, and with more prizes for the implementations with the lowest gas cost?",
        "created_at": "2020-08-23T21:27:46.541000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Something I think went a bit amiss at the latest call is that \u003c@!425279588009246720\u003e and his team was not planning to do all that work themselves, and were actually trying to get someone interested in doing that, is that right, \u003c@!425279588009246720\u003e ?",
        "created_at": "2020-08-23T21:29:12.139000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "tangentially, it would also help the progress of EIP-2537 itself, because there will be more people trying to re-implement it",
        "created_at": "2020-08-23T21:30:48.503000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "and we will have more trained eyes that can look at the code",
        "created_at": "2020-08-23T21:31:11.040000+00:00",
        "attachments": null
    }
]