[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "2718 has been stripped down to *only* adding support for typed transactions and their receipts.  It doesn't do anything with legacy transactions and it doesn't introduce *any* new transaction types (not even wrapped legacy transactions).  It also doesn't change the way the transaction root or receipt root is generated *other* than adding support for the new typed transactions as being valid.  It also doesn't mention anything about the networking layer changes.\n\nAll in all, it is now far simpler, and I will be introducing new EIPs separate from 2718 that cover most of the other stuff that 2718 was covering.",
        "created_at": "2020-09-12T09:19:57.973000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Where are Transaction Hashes referred to in the core protocol?  Are they only referenced in the networking and interface layer?",
        "created_at": "2020-09-12T09:55:33.824000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003c@!194432762315407360\u003e When introducing typed transactions into the devp2p protocol, is it reasonable to just define the envelope at the network protocol layer and not define the individual transaction type payloads?",
        "created_at": "2020-09-12T10:20:50.872000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I would rather not have to do a devp2p version update every time we want to introduce a new transaction type, and having the networking layer only care about the envelope would make that possible.",
        "created_at": "2020-09-12T10:21:27.324000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "Yes, I understand",
        "created_at": "2020-09-12T10:21:37.627000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "I think it makes sense to explain the envelope only",
        "created_at": "2020-09-12T10:22:44.951000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "That said, it also makes sense to say that the verification needs to happen, and how to do it.",
        "created_at": "2020-09-12T10:23:34.850000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "Transaction relay is dependent on being able to validate certain aspects of the transaction.",
        "created_at": "2020-09-12T10:24:08.927000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Hmm, should we say that if the transaction type is unknown to the client, then it should drop the transaction and if the transaction type is known it should validate it and then drop the peer if the transaction is invalid?",
        "created_at": "2020-09-12T10:24:59.508000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "This is one of the things that prevented the original account abstraction proposal: there was no way to validate transactions anymore.",
        "created_at": "2020-09-12T10:25:20.199000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Though, I'm not sure what situation we would end up in where it makes sense to be connected to a network that was gossipping transaction types your client doesn't understand.",
        "created_at": "2020-09-12T10:25:29.598000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Maybe if clients start propagating transactions leading up to a fork block that enables their inclusion in a block it would make sense to just ignore transactions you don't yet know how to handle, but not blacklist the peer that sent them?",
        "created_at": "2020-09-12T10:26:19.647000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Though, maybe that introduces problems with peers spamming unknown transaction type transactions as a DoS vector against a peer?",
        "created_at": "2020-09-12T10:26:57.318000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I have created a new EIP (2972) for legacy wrapped transactions.  This was extracted out of EIP-2718 and can be included in the same HF as 2718, or a future hard fork.  It is necessary if we ever want to deprecate legacy encoded transactions in blocks, but otherwise not critical.",
        "created_at": "2020-09-12T10:30:05.493000+00:00",
        "attachments": null
    }
]