[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "As part of the work on 1559, one thing that is starting to come up more is what AllCoreDevs would like to see from the EIP to consider moving it to EFI and eventually Accepted. \n\nLast time it was discussed thoroughly on the call (when \u003c@!332923501079953409\u003e presented the progress), the main objection to it seemed to be the uncertainty around whether Ethereum could handle even short bursts of 2x-sized blocks if there was a large spike of demand or an attack on the network. \n\nAnother concern that was raised by Nick Johnson and supported by others was the lack of a formal analysis for the EIP. Finally, the impact on tools, applications, etc. in the ecosystem was raised recently as a concern. \n\nWe're currently working on those 3 streams to try and address the issues, but I'm curious as to whether people see other potential blockers. \n\nIt feels like there are more urgent things right now to discuss on the live ACD calls, so I wanted to gather people's thoughts here as a first pass.",
        "created_at": "2020-09-10T02:36:50.551000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The lack of formal analysis feels like FUD to me, seeing as how we do not require formal analysis for any other changes that go into Ethereum.",
        "created_at": "2020-09-10T02:41:03.336000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Yes, it would be nice to get some formal analysis, but I think it is unfair to apply that rule to only certain EIPs as it ends up being used as a weapon to block EIPs that some lobby doesn't want implemented (not saying that is the case here, just that that is what ends up happening).",
        "created_at": "2020-09-10T02:41:52.018000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "See ProgPoW where audits were demanded, and then once audits were completed people just found something else to block with.",
        "created_at": "2020-09-10T02:42:14.981000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "To be clear, re: Formal Analysis, what Tim Roughgarden will produce is a comparison between today's fee market and a 1559 one (and I believe the escalator fee also). It won't be a \"proving each line of the code behaves as intended\" as much as \"proving this is game theoretically sound, and at least a net improvement on the current model\".",
        "created_at": "2020-09-10T02:43:16.985000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003e Finally, the impact on tools, applications, etc. in the ecosystem was raised recently as a concern. \nI believe this is resolved by my latest PR (not yet merged).  Curious if people still hold concern here after that is merged.",
        "created_at": "2020-09-10T02:45:25.232000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003e I believe this is resolved by my latest PR (not yet merged).  Curious if people still hold concern here after that is merged.\nI've reached out to a bunch of projects (see: https://twitter.com/TimBeiko/status/1303028695641120770). I think we'll have a better idea once we've spoken with teams across the various types of projects to gauge what exactly they find challenging",
        "created_at": "2020-09-10T02:50:50.523000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "\u003e Is there a chance to get a speedup from Besu for this and converge on something like 40-50 gas?\n\u003c@!381789485777682434\u003e , so Besu answered \"No\":\n\u003e We are engineering constrained right now and that performance issue is not even on our radar at the moment [...]  I'm concerned we will open ourselves up to more \"broken meter\" attacks.\nAnd I totally agree that we shouldn't go lower now. So the answer from both geth and besu is a no. You can of course continue investigating, and I'm grateful for the optimization your PR:ed for geth, but it might be a waste of your time trying to push the limit further, _at this time_.",
        "created_at": "2020-09-10T07:17:55.505000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "I made a new analysis, btw, to check the earlier benchmarking: https://gist.github.com/holiman/7153e088af8941379cf21c0e4610d51f . I stand by not going below `100` at this time",
        "created_at": "2020-09-10T07:49:25.767000+00:00",
        "attachments": null
    },
    {
        "author": "hudsonjameson",
        "category": "general",
        "parent": "",
        "content": "\u003e main objection to it seemed to be the uncertainty around whether Ethereum could handle even short bursts of 2x-sized blocks if there was a large spike of demand or an attack on the network. \n\u003c@!552133098075193354\u003e I think \u003c@!206016661470314496\u003e raised this before and I think it's still something to be looked at deeply. The networking layer in general doesn't get enough love in multiple areas imo and it would be bad if bigger blocks affects the network.",
        "created_at": "2020-09-10T15:04:19.111000+00:00",
        "attachments": null
    },
    {
        "author": "shamatar",
        "category": "general",
        "parent": "",
        "content": "\u003c@!211091239112671234\u003e Yeah, I've seen an answer. Will try to see in my free time what stops Geth and OE from going below, may be this will help other clients too.",
        "created_at": "2020-09-10T18:07:19.533000+00:00",
        "attachments": null
    },
    {
        "author": "shamatar",
        "category": "general",
        "parent": "",
        "content": "Is there a set of \"general\" benchmarks to run for Geth to see if after some changes there is no negative impact \"on average\"?",
        "created_at": "2020-09-10T21:34:32.650000+00:00",
        "attachments": null
    }
]