[
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "We won't ever delete the special case hashing on type 0 transactions (where the hash trims off the wrapper byte).  All the blocks between Berlin and London will have to be re-validated.  A special hashing rule will live forever.",
        "created_at": "2020-11-20T06:35:12.788000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Unless we can regenisis.",
        "created_at": "2020-11-20T06:37:31.292000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Also, a client could decide to just hard code the details of block `n` and not sync history before it, thus not need to actually implement all of the old behavior.",
        "created_at": "2020-11-20T06:38:25.865000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "One can also imagine a client I implementation where each hard fork coincided with a full client fork (of the source code fork variety) where they essentially have a different codebase for each network hard fork, and they all share a DB and have a mechanism of switching clients on network fork blocks.  Such a client would be able to have clean code for their newer stuff as the latest version wouldn't need to understand legacy blocks.",
        "created_at": "2020-11-20T06:43:55.211000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Point here being merely that I think technical debt for code that was used in old blocks has a different cost than code necessary to process/handle new blocks/transactions.",
        "created_at": "2020-11-20T06:44:58.847000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "\u003e Also, a client could decide to just hard code the details of block n and not sync history before it, thus not need to actually implement all of the old behavior.\nBut they won't.  Weak subjectivity isn't good enough for some people.",
        "created_at": "2020-11-20T17:40:49.892000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "\u003e Also, a client could decide to just hard code the details of block n and not sync history before it, thus not need to actually implement all of the old behavior.\n\nI thought about this a while back, but with a caveat: to have an \"coredev approved EIP\" stating the new hash of some recent block, like block 10 million.",
        "created_at": "2020-11-20T18:12:42.770000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "There were two outcomes of that discussion: 1. lets just wait for regenesis to handle this programatically; 2. have something like the flyclient sync in place.",
        "created_at": "2020-11-20T18:14:33.695000+00:00",
        "attachments": null
    }
]