[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I'm confused about 2930.  Allegedly its purpose is to make it so transaction gas cost doesn't spike with Berlin and break some contracts.  However, if I'm reading this right it ends up being *more* expensive to include an access list in some cases (because you need both a storage key and an address read).  In the remaining cases it is only very marginally cheaper.",
        "created_at": "2020-12-18T06:34:54.344000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "In 2929\n```\nCOLD_SLOAD_COST == 2100\nCOLD_ACCOUNT_ACCESS_COST == 2600\n```In 2930```\nACCESS_LIST_STORAGE_KEY_COST == 1900\nACCESS_LIST_ADDRESS_COST == 2400\n```",
        "created_at": "2020-12-18T06:36:09.786000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "So you are saving 200 gas on the SLOAD and 200 gas on the address read, which doesn't seem like enough to solve the problem it sets out to solve.",
        "created_at": "2020-12-18T06:36:34.540000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "The breakage would occur in the call where stuff like the standard stipend and other gas costs are relied on.  You pay for the cost of warming up the accounts before the EVM spins up and account and storage access are at the lower rates.  Otherwise the first touch incurs the warmup cost and contracts may not be prepared for that spike.  It's moving _where_ the spike occurs to a place that is not subject to the EVM.",
        "created_at": "2020-12-18T15:48:10.232000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "If cold access inside the EVM were escalated to a revert instead of an expensive operation the access lists could be used to aid in composing non-conflicting transactions, which we could then presume that witnesses submitted are sufficient for execution, which we could then compose blocks from witnesses without needing to re-execute the code in context of other transactons (which could then be done in parallel)",
        "created_at": "2020-12-18T15:51:06.250000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Ah, I see.  I misunderstood the purpose, but get it now.",
        "created_at": "2020-12-18T16:02:33.496000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Thanks \u003c@!403707149043105803\u003e!",
        "created_at": "2020-12-18T16:02:38.628000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "For some reason I thought the access list was a merkle proof, I think I have been thinking too much about stateless Ethereum.",
        "created_at": "2020-12-18T16:03:10.122000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "Yea, the list is separate from the proof.",
        "created_at": "2020-12-18T16:10:11.296000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "To add to my prior statement about \"Hermetic transactions\" the access list would need to extend to all writes and not just reads to ensure there is no conflict when composing blocks without re-execution.",
        "created_at": "2020-12-18T16:11:05.581000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "You could keep a list as a client yourself, but any read-set violation would imply that the write set needs to be re-considered.  And you would have to execute to get the write set the first time.",
        "created_at": "2020-12-18T16:12:17.361000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "But you would want that one execution yourself or an output witness by someone you trust who has executed it.  So it won't save that much at first.",
        "created_at": "2020-12-18T16:13:41.820000+00:00",
        "attachments": null
    }
]