[
    {
        "author": "wschwab",
        "category": "general",
        "parent": "",
        "content": "Hey, William from the Cat Herders here. We're working on an initiative to interview EIP authors/champions. There are a few different goals, but one of the main ones is to give a sort of breakout room forum for authors and champions to discuss and explain in a way they can't in the All Core Devs call. How can we do this in a fashion that is most beneficial to Core Devs? What would you like to see/here in an initiative like this?",
        "created_at": "2020-08-25T17:13:01.406000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "Not a core dev, so I could be totally off-base here (if so, then disregard). I think it's important for the conversation to be going both ways. I don't think that just a presentation on an EIP is going to be sufficient for core devs. They're going to have questions and often times they'll be able to quickly poke holes in ideas. They typically have a much better intuition about what is possible in clients than EIP authors do. They also usually have a better understanding of what the eth roadmap is and what sort of things are important to work on now and what isn't. \n\nMy proposition is to be respectful of the core devs time and allow them to choose which EIPs they wish to discuss in a longer form (ACD will should always be an open place present ideas). These are EIPs that they believe fit into the near-term roadmap. Then they can spend some time reading the EIP before being presented it by the author. I think just doing this will lead to a strong discussion following the introduction of the EIP. The cadence that this happens is really up to the core devs who wish to participate. Long term, I'd love to see more structure around this via a revival of the Ring working groups. I think the equivalent of this could be happening for ERC EIPs by the ERC/on-chain interface Ring.",
        "created_at": "2020-08-25T18:51:13.820000+00:00",
        "attachments": null
    },
    {
        "author": "wschwab",
        "category": "general",
        "parent": "",
        "content": "We're open to using the forum as a place where Core Devs can discuss with authors/champions if this would be helpful. My (also non-Core Dev) impression is that there are conversations which would be more useful out of the All Core Devs call, either as a preparation that removes miscommunication before the call, or as a continuation of overflow from the call. Would this fit in more with what you're proposing \u003c@!543900561460822016\u003e ?",
        "created_at": "2020-08-25T19:12:48.872000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "My focus is mostly on helping coordinate the deployment of engineering resources. That may not align with your goals for the interview sessions (which imo is still valuable to the broader community). I just am not sure the value it serves to the core devs, other than better preparing authors to present their EIP in the ACD. I suppose that is still a good outcome, but if that’s the goal I think it could also be achieved via a dedicated group of people working in the EIP process to suss out new EIPs and review the author’s presentation points.",
        "created_at": "2020-08-25T19:26:45.648000+00:00",
        "attachments": null
    },
    {
        "author": "shamatar",
        "category": "general",
        "parent": "",
        "content": "\u003c@!425279588009246720\u003e Is there a possibility to run kind of the same simulation for 768 bit modulus (swap the opcodes, operand sizes and run 10k multipicaitons on random data)? It may be 3x overhead for 384 bit modulus, but for 768 bit one it may happen to be tens of percents",
        "created_at": "2020-08-25T19:27:53.251000+00:00",
        "attachments": null
    }
]