[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think there is disagreement about what is important.  Some people belie naming is unimportant, while others believe it is important.  The people who think it is unimportant consider any discussion of it bike shedding, while those who think it is important don't.",
        "created_at": "2021-05-17T07:11:32.707000+00:00",
        "attachments": null
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "Not important at all, but a disadvantage of including both EIP-1559 and EIP-3529 is that it might become harder to see the impacts of each on gas prices short-term. \n\nRemoving gas tokens should drive gas prices down, while derivatives tend to reduce volatility. 1559 will reduce gas price spikes. \n\nIf we were maximising for insight or interestingness, would we rather: \n-- 1559 and 3529 simultaneously\n-- 1559 preceding 3529\n-- 3529 preceding 1559\n\nI’m not advocating it; coordination difficulty outweights the fun.",
        "created_at": "2021-05-17T08:16:12.999000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "there is a strong political pressure to include 1559, and the network needs 3529 yesterday",
        "created_at": "2021-05-17T09:01:33.988000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "so I'm afraid they'll have to go in together in London",
        "created_at": "2021-05-17T09:02:36.026000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I do think that naming of API fields is very important. But let's try to learn the lesson. My suggestion would be to delegate API field naming discussion and decisions to the JSON RPC standardisation group. This group already exists to the best of my knowledge, but perhaps is not yet properly empowered. So an empowering move from ACD would be to defer the naming decision to that group, because that group may (and should) have better bandwidth and more suitable set of participants for the job. While leaving ACD to discuss and decide on topics that cannot be discussed and decided elsewhere, given set of ACD participants and their expertise and ecosystem roles.",
        "created_at": "2021-05-17T09:22:06.160000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "BTW, Turbo-Geth is changing its name, statement here: https://torquem.ch/",
        "created_at": "2021-05-17T09:25:33.424000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "🦦",
        "created_at": "2021-05-17T11:05:58.723000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003c@456226577798135808\u003e I generally agree with you, but I think there are a few particular details that made this hard re: naming. First, we needed agreement quickly given that it was blocking a lot of other efforts. Second, people clearly had strong enough opinions to propose changes, but it seemed like progress had stalled async after most people voiced their view. Third, I think we actually resolved it pretty efficiently on the call, taking ~10 minutes (which is much less than we've spent so far debating whether it was bikeshedding here 😅). \n\nHappy to let the JSON RPC standardization group own more of this, but I don't think this is a \"JSON RPC\" problem as much as a \"different client teams would like to do something differently but that will not be good\" problem. Strongly agree the transaction pool management is also that type of problem, and a more blocking one, but the reason I felt we didn't need to discuss it on the call as much is that good progress seems to be happening async.",
        "created_at": "2021-05-17T14:48:08.287000+00:00",
        "attachments": null
    }
]