[
    {
        "author": "yoavw",
        "category": "general",
        "parent": "",
        "content": "Hey everyone.  I'd like to explore an idea to reduce the risk of post-fork consensus failures.  After Berlin we saw a mainnet consensus failure that caused OpenEthereum clients to drop out.  Recently we saw a similar incident when Ropsten switched to London, leading to a split between (openethereum,besu) and (geth,erigon,nethermind), although this time we got lucky and it was caught on a testnet.\n\nIt would be great if we could incentivize consensus research, prompting security researchers to look for corner cases that could be abused to trigger such splits.  I think it can be done with a permissionless bounty on existing testnets (combined with a mainnet contract), and only requires a minor change in the clients in order to prove success.\n\nIt'll be great if you have a look at this proposal.  Do you think it makes sense to implement something like this?\n\nhttps://ethresear.ch/t/incentivizing-consensus-research-before-forks/9456",
        "created_at": "2021-07-29T20:37:44.744000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Quick announcement (sorry Yoav for posting right after!): we have another London Infrastructure call scheduled tomorrow at 14:00 UTC. \n\n**Agenda**: https://github.com/ethereum/pm/issues/363\n\nZoom to be shared here right before the call. See you then 👋",
        "created_at": "2021-07-29T20:40:24.814000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Bleh, I have a conflicting PEEPanEIP right at that time.  😖 I really wanted to make this call to discuss the gasPrice JSON-RPC field too.  😢",
        "created_at": "2021-07-29T20:45:53.318000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Mayyyybe we could move the call 1h later, but I'm not sure if that would work for most attendees 😅 I also have that PEEPanEIP conflict, and will unfortunately have to watch the recording on that one.",
        "created_at": "2021-07-29T21:03:27.699000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "sorry for the conflicts!",
        "created_at": "2021-07-29T21:04:16.880000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Not a ton of spots that are friendly to most folks 😅",
        "created_at": "2021-07-29T21:04:31.905000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "Interesting idea! Left two questions on the post.\n\nSetting the introduced complexity aside, is the main benefit that\na) issues do not need to be disclosed in a bounty report and the submitted can stay fully anonymous?\nb) and/or the main expectation is that the reward pool can be much higher than what bounty programs offer?",
        "created_at": "2021-07-29T21:18:42.260000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "general",
        "parent": "",
        "content": "Thanks.  I replied to your questions on the post.  I agree we may be better off using a root rather than a list of transactions.\n\nRe benefits:\na) yes.  It makes the bounty anonymous and with no room for disputes.  Either you prove that you broke consensus, or you don't.  Centralized bounties can work well with a trusted arbitrator (e.g. Immunifi), but we love decentralization where possible 🙂  so why add a trusted party if it can be done by a smart contract.\nb) yes.  The reward can come from anyone who stands to gain from Ethereum and lose money if consensus breaks down.  Although initially I assume it'll be EF.\n\nThe bounty could also start high, and gradually decrease as the mainnet fork is approaching.  This creates an incentive for security researchers to prioritize this bounty over other bounties, and reduce the risk of having to hit the brakes shortly before mainnet.  The earlier you expose a consensus bug, the more you gain.",
        "created_at": "2021-07-29T22:07:07.692000+00:00",
        "attachments": null
    }
]