[
    {
        "author": "davegunna",
        "category": "general",
        "parent": "",
        "content": "Guys, sorry if I picked wrong chan for this question, when is London planned for?",
        "created_at": "2021-06-10T10:42:58.828000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "block numbers haven't been chosen yet. likely will target end of July, beginning of August",
        "created_at": "2021-06-10T13:08:12.470000+00:00",
        "attachments": null
    },
    {
        "author": "0xraino",
        "category": "general",
        "parent": "",
        "content": "\u003c@!552133098075193354\u003e Will the wallet devs join the call tomorrow? I suspect it'll be important to hear their answers to certain questions for us to reach consensus about the apis",
        "created_at": "2021-06-10T14:42:01.573000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "I can invite them if it would be helpful",
        "created_at": "2021-06-10T14:47:57.747000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Yeah, I'm not sure we can expect _most_ of them to be there. Trent, myself and others who were on the calls with wallets will be there, though. What specific questions do you think they'll be most needed for \u003c@!213672586264051717\u003e ?",
        "created_at": "2021-06-10T14:55:02.992000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**AllCoreDevs in 23h (June 11, 14:00 UTC)**\nAgenda: https://github.com/ethereum/pm/issues/330\nStream:  https://youtu.be/XYhN26UrJ5o\nZoom: shared here before the call",
        "created_at": "2021-06-10T14:59:28.457000+00:00",
        "attachments": null
    },
    {
        "author": "0xraino",
        "category": "general",
        "parent": "",
        "content": "I don't have a specific question, I see why the historical fee api would be useful. In discussing the behavior of any gas price oracle option I have a feeling someone's going to say \"why don't we do this thing instead?\" and then there'll be silence because the consumers of the api can't opine.",
        "created_at": "2021-06-10T15:06:55.781000+00:00",
        "attachments": null
    },
    {
        "author": "carl0000",
        "category": "general",
        "parent": "",
        "content": "We (status) are aiming for the simplest possible implementation initially. On the last call it was discussed that we'd be able to fetch the base fee of the pending block and a priority fee based on the last X blocks (e.g. lowest 10%ile of last 2 blocks). Having these calls be super lightweight would be brilliant for everybody. Historical api would be useful during times of congestion so we can give solid gas estimates",
        "created_at": "2021-06-10T15:21:41.200000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "On the wallet call the weak consensus in my head (possibly me just hearing what I want to hear) was that clients shouldn't be oracles, they should be data providers.  We want to provide enough data so that any wallet can write their own oracle in a few lines of code with data sourced from a single request (not have to track block history).",
        "created_at": "2021-06-10T19:01:22.051000+00:00",
        "attachments": null
    }
]