[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "You are correct, I don't think it is miners being malicious.  However, that doesn't mean I agree with this statement of yours:\n\u003e We have not had problems with irresponsible gas limits being set by miners",
        "created_at": "2021-04-30T00:13:20.757000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "In this case, I think gas limits are being set irresponsibly by miners, but because they are just listening to certain voices on Twitter not because they are being malicious.",
        "created_at": "2021-04-30T00:13:44.139000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This isn't to say I agree with the proposed solution of a token vote (I'm generally against such things).",
        "created_at": "2021-04-30T00:14:10.271000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "But I don't agree that the current situation is healthy either.",
        "created_at": "2021-04-30T00:14:17.371000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "I'm going to both agree with what you're saying but hold that the intent of my original statement holds, that the token based gas limit proposal is a very complex solution in search of a problem",
        "created_at": "2021-04-30T00:15:24.884000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "I think a token vote for the gaslimit would be *worse* than the status quo",
        "created_at": "2021-04-30T00:15:25.371000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "Basically, the thing with voting tokens is that they heavily favor wealthy concentrated interests",
        "created_at": "2021-04-30T00:15:50.588000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Sounds like we are all in agreement for the most part.  😄  Maybe not on what the gas limit should be, but that the current situation isn't great and the proposal isn't better.  🙂",
        "created_at": "2021-04-30T00:16:04.141000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "If you're 2x bigger, you can have a 2x bigger impact and you can have a 2x larger economic benefit _from each unit_ of impact on the vote you make",
        "created_at": "2021-04-30T00:16:16.498000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "So there's a quadratic factor",
        "created_at": "2021-04-30T00:16:30.843000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "We have something now that's barely a problem if you can even call it that and a very complex proposed solution. I'm strongly against the proposal",
        "created_at": "2021-04-30T00:16:36.536000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "This problem is less bad if it's a hybrid voting token + protocol token where most of the demand is speculation or usage",
        "created_at": "2021-04-30T00:16:50.519000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "But if it's a pure voting token, there's a big risk it'll get bought up by one powerful actor",
        "created_at": "2021-04-30T00:17:03.780000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I don't know I would call the current state growth situation \"barely a problem\", but I agree with the rest.",
        "created_at": "2021-04-30T00:17:12.051000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "(just signaling so that we can avoid wasting time debating the token proposal here if others agree with the signal)",
        "created_at": "2021-04-30T00:17:14.884000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "Also, there will be a set of actors that will be highly incentivized to raise a stink against any attempt to introduce any other form of gaslimit governance",
        "created_at": "2021-04-30T00:17:33.247000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Gas limit doesn't change with The Merge right?  Execution client will still just set it to whatever it wants within range when constructing blocks?",
        "created_at": "2021-04-30T00:18:12.543000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Correct.",
        "created_at": "2021-04-30T00:19:40.331000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "piper was talking about the process of how gas limit changes are signalled, not state growth",
        "created_at": "2021-04-30T01:23:58.402000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I'm curious to get a core dev temperature check on a stuck (not stolen) ETH recovery EIP.  The topic has been discussed at length in the past so we don't have to debate the merits/arguments here, I'm just curious if it would be worth formalizing a proposal at this point, or if that would be a waste of effort.  The idea with the proposal is that it would come in the form of a one-time irregular state change that addresses one or more specific classes of verifiably stuck funds and one or more scripts that anyone can run off-chain to validate that the change is in fact legitimate.",
        "created_at": "2021-04-30T02:12:40.618000+00:00",
        "attachments": null
    },
    {
        "author": "jadler2664",
        "category": "general",
        "parent": "",
        "content": "I disagree for one reason: \"one-time.\" Either never do it, or make it part of the social contract that sufficiently significant provably stuck funds can be recovered via hard forks. While it might be difficult to make repeated instances of unlocking stuck funds fair, doing it only one time is by definition unfair and non-neutral.",
        "created_at": "2021-04-30T03:19:17.314000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Ah, by \"one-time\" I just meant that an EIP that resolved stuck funds would be a one-off thing, not an automatically recurring thing.  I'm not against having multiple instances of these one-off things over time.  I *would* expect that they become more and more rare with time as the expectation is that the community should be learning from mistakes over time.  So maybe we address the JS address truncation stuck funds issue from before, but we wouldn't address that specific instance of stuck funds again in the future.",
        "created_at": "2021-04-30T03:21:16.548000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "My 2c is the community has already signalled that they want it to “become more rare” when The DAO (~15% of supply) went through and the Parity Multisig (~1%?) didn’t. Maybe there’s a middle ground somewhere where people would agree that if \u003e1% of funds are stuck we should unstick them, but IMO the way to go about this is to get broad community buy in before actually proposing the change, and that seems extremely unlikely",
        "created_at": "2021-04-30T05:29:51.265000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The DAO wasn't a recovery of stuck funds, it was a recovery of stolen funds.  I consider that to be an entirely different class from what I'm referring to.",
        "created_at": "2021-04-30T05:37:49.468000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Also, I think that the multisig situation suffered from a tramendous amount of brigading, so I'm not convinced \"the community\" actually weighed in.",
        "created_at": "2021-04-30T05:38:17.448000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I *think* your stance basically reduces to, \"don't bother proposing any changes that are likely to be heavily brigaded\"?  Though, given your support for 1559 this doesn't seem to align with my mental model of Tim.  😄",
        "created_at": "2021-04-30T05:39:24.437000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "I was once in the camp of \"sure, might be doable and ethically acceptable\". Then over time, I saw more complexities. So certain cases are clear-cut: 1) easy to determine rightful owner, 2) easy to on-chain prove the asset-loss (e.g. 0-created contracts, it's easy to verify a sender+nonce against address. 3) easy to restore\n\nMany other cases are not as simple. For example, someone who sent to 0-address. Hard to verify on-chain, but easy off-chain. Or: some people have deployed 'broken' contracts, where, due to some programming error, the funds are stuck. It can can be proven, by static analysis, that the funds are stuck. But non-trivial even off-chain. And many cases where it's hard to know who the owner should be. Like funds in a contract that cannot be emptied. Should they belong to the contract owner or the senders? For the splitter-contract -- the latter, for others, maybe the former. \nAnd lastly, there are all cases of sending to typo-addresses, where someone can prove that \"there's just one byte off here, so it's most certainly meant for me\". \n\nThere are just _so_ many different classes, that I think it's a pandora's box, and we should avoid it. Could have been done three years ago, maybe, but we're not there any longer",
        "created_at": "2021-04-30T07:00:01.237000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I agree that the effort involved in validating claims is high.  I think we could offload the work of \"proof\" and script authoring to others pretty easily (there is definitely enough financial incentive) but I think you are correct that there would be significant burden on core devs to validate the claims/proofs and filter out the dubious ones.\n\nI'm not fully convinced the social good of restoring people with stuck ETH is lower than the verification/filtering cost on core developers, but I definitely appreciate the argument.",
        "created_at": "2021-04-30T07:17:18.374000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "isn't the token to vote the gas limit going to be ETH after merge? so why have another one? 😅",
        "created_at": "2021-04-30T07:17:51.242000+00:00",
        "attachments": null
    },
    {
        "author": "elbeem4277",
        "category": "general",
        "parent": "",
        "content": "Another consideration is that some addresses might be used as burn addresses, where you want to consider the ETH in them to be burned. How do you know the difference between ETH  sent to those by mistake, and ETH  sent with the intention of burning them?",
        "created_at": "2021-04-30T11:05:14.870000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "We propose the **EIP-3541 to be included in London**. It itself is rather simple change, but it is part of bigger EIP-3540.\n\nThe EIP-3540 defines Ethereum Object Format (EOF) and for requires two hard fork to be deployed. The EIP-3541 being the first of two.\n\nThis is going to be discussed on today's ACD, but I can answer questions here before and after the call.\n\nEIP-3540: https://github.com/ethereum/EIPs/pull/3540\nEIP-3541: https://github.com/ethereum/EIPs/pull/3541",
        "created_at": "2021-04-30T11:32:27.138000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "RE: Aleut status: I'd say we are still very early in the test phase of the currently included EIPs on Aleut, triggered multiple consensus bug so far.\n\n(1): Blocks being rejected if cumulative gas used \u003e gas target (is ok to use twice the gas target in a block)\n(2): Nethermind not having EIP 2565 active\n(3): GASPRICE bug on Geth/Turbogeth",
        "created_at": "2021-04-30T11:43:58.786000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "According to the London schedule there's a client freeze on May 19th, so I'd say we need to focus a bit more on testing the EIPs. I will probably send some fun txs to aleut this weekend 🙂",
        "created_at": "2021-04-30T11:52:37.806000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "(These all seem fixed at this point)",
        "created_at": "2021-04-30T12:57:44.836000+00:00",
        "attachments": null
    },
    {
        "author": "0xraino",
        "category": "general",
        "parent": "",
        "content": "I think it's worth looking into ways in which an n-part EIP can be done in 1 part. In this case, could we not just signal ahead of time that a contract with that leading byte might break? If someone trolls us and deploys a contract with that leading byte prior to this EIP, the odds of them also crafting it such that it can exploit an _as yet undefined_ metadata are minuscule.",
        "created_at": "2021-04-30T13:05:38.755000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "The biggest problem is something else: having deployed code with the header before the fork introducing it is enabled. In the timeframe between a final version of the specification is released and the hard fork goes live, anyone can deploy code with such a header and avoid any validation. After the fork those accounts are deemed valid, yet they may not be. With rejecting a starting byte in the first fork it is possible to select a prefix which makes this problem go away. Basically we have not found a reasonable way to have deploy time validation without this two fork approach. (Earlier proposals were suggesting to add a version field into the account instead.)",
        "created_at": "2021-04-30T13:18:52.201000+00:00",
        "attachments": null
    },
    {
        "author": "0xraino",
        "category": "general",
        "parent": "",
        "content": "Ah yes, they could easily watch the spec for it being final and then exploit it with certainty.",
        "created_at": "2021-04-30T13:20:19.088000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "And to clarify the \"we\" here, credit goes to \u003c@456226577798135808\u003e for coming up with the two-fork idea.",
        "created_at": "2021-04-30T13:23:04.173000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "Yeah in this particular case, there's a very compelling reason to to do it in two steps",
        "created_at": "2021-04-30T13:24:26.718000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "And it doesn't hurt that the first step is very very simple",
        "created_at": "2021-04-30T13:24:44.720000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "In other words: we are doing 2 HF to in the end has guarantee that all deployed EOF-prefixed bytecode are valid. For this we freeze first byte of the prefix in HF1. After HF1 nobody can deploy the yet unknown full EOF-prefix. And then we select the remaining magic bytes by inspecting all deployed contracts.\n\nThis is vulnerable to some trolling, but gives us much more welcome property.",
        "created_at": "2021-04-30T13:25:13.014000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "If I'm understanding correctly, this will break any existing contract factory?",
        "created_at": "2021-04-30T13:26:12.364000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "Ah nvm, only contracts starting with 0xEF would break",
        "created_at": "2021-04-30T13:26:46.414000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Only factories that try to produce contracts with code starting with `0xef`",
        "created_at": "2021-04-30T13:26:50.881000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "Iterating the contracts now. Probably won't be finished before the ACD, but some prelimnary numbers: \n```\nContracts examined: 5376433\nStarting with 0xef: 0\nStarting with 0xfd: 1\nStarting with 0xfe: 1\nStarting with 0xff: 4\n```",
        "created_at": "2021-04-30T13:29:48.347000+00:00",
        "attachments": null
    },
    {
        "author": "pauld.9606",
        "category": "general",
        "parent": "",
        "content": "This can be done in a single hard-fork.\n \nChoose special prefix 0xefxxxxxx, where xxxxxx is the smallest big-endian integer such that 0xefxxxxxx is not the initial segment of any deployed bytecode.",
        "created_at": "2021-04-30T13:39:38+00:00",
        "attachments": null
    },
    {
        "author": "0xraino",
        "category": "general",
        "parent": "",
        "content": "Can't someone still deploy a contract with that prefix after it's chosen?",
        "created_at": "2021-04-30T13:40:44.117000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**AllCoreDevs in 20 minutes**\nAgenda: https://github.com/ethereum/pm/issues/302\nStream: https://youtu.be/_QLDhNMwoe4\nZoom: https://ethereumfoundation.zoom.us/j/91348592283?pwd=SnRnL1VTeXNYVE9CaWpBbnJEUXhQZz09",
        "created_at": "2021-04-30T13:41:12.438000+00:00",
        "attachments": null
    },
    {
        "author": "0xraino",
        "category": "general",
        "parent": "",
        "content": "Or are you suggesting a dynamic calculation at upgrade time? Which seems... not great",
        "created_at": "2021-04-30T13:41:35.817000+00:00",
        "attachments": null
    },
    {
        "author": "pauld.9606",
        "category": "general",
        "parent": "",
        "content": "I am just suggesting that it is possible. I don't know the best way.",
        "created_at": "2021-04-30T13:42:20.722000+00:00",
        "attachments": null
    },
    {
        "author": "0xraino",
        "category": "general",
        "parent": "",
        "content": "gotcha",
        "created_at": "2021-04-30T13:44:44.899000+00:00",
        "attachments": null
    },
    {
        "author": "pauld.9606",
        "category": "general",
        "parent": "",
        "content": "Maybe the best way is to do it all in London.",
        "created_at": "2021-04-30T13:45:08.926000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Definitely _not_ the best way 😅   We want to keep the scope fairly small for London given the amount of testing required for 1559 and the fact we are limited in when we can deploy it due to the difficulty bomb. We already pushed back other EIPs on the last ACD because client teams had no appetite to add more.",
        "created_at": "2021-04-30T13:46:29.024000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Not saying we can't do this small first step in London, we'll discuss that on the call, but we agreed that both EIP-3074 or 2537 were too big to be included in this fork, so I suspect 3540 probably also is.",
        "created_at": "2021-04-30T13:47:03.778000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "Yes, trivially so, Which is exactly why that approach is no good",
        "created_at": "2021-04-30T13:47:17.171000+00:00",
        "attachments": null
    },
    {
        "author": "0xraino",
        "category": "general",
        "parent": "",
        "content": "It was a misunderstanding of what paul meant.",
        "created_at": "2021-04-30T13:48:11.025000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "If so, I also misunderstood it, and still am... 😕",
        "created_at": "2021-04-30T13:48:47.516000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "EIP-3540 is not ready for London and we wouldn't suggest it for consideration, but the first step EIP-3541 should have very little impact. There is a geth implementation and tests on ethereum/tests.",
        "created_at": "2021-04-30T13:49:11.638000+00:00",
        "attachments": null
    },
    {
        "author": "pauld.9606",
        "category": "general",
        "parent": "",
        "content": "That approach would choose special prefix 0xefxxxxxx at the hard-fork, and disallow it after the hard-fork.",
        "created_at": "2021-04-30T13:50:12.932000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "As far as I'm concerned, doing 3540 does not mean 3541 is accepted. 3540 is a good step in _any_ direction where we at some point want a guarantee about code, but without modifying the state account object. So if we want to have a guarantee that contracts starting with a certain sequence have no dynamic jumps, or all jumps are validated, or have some data-section. Whatver we want in the future, 3540 makes it possible EDIT: VICE VERSA numbers swapped",
        "created_at": "2021-04-30T13:51:09.109000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "\u003c@!211091239112671234\u003e I think you swapped the numbers 😬",
        "created_at": "2021-04-30T13:51:58.228000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "Oh. Yeah that's problematic, because the clients would have to iterate the entire state, at the hardfork block, to find the magic.",
        "created_at": "2021-04-30T13:52:00.996000+00:00",
        "attachments": null
    },
    {
        "author": "pauld.9606",
        "category": "general",
        "parent": "",
        "content": "They can maintain all prefixes 0xefxxxxxx dynamically, and choose the smallest one at the hard fork. Not saying it is perfect, just possible.",
        "created_at": "2021-04-30T13:55:59.507000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "Ok. Sure, it's not _impossible_, I agree. However, I'd say it's infeasible in practice",
        "created_at": "2021-04-30T14:01:33.931000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "Where's the zoom linnk?",
        "created_at": "2021-04-30T14:05:23.064000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "Oh, doh, rtfm",
        "created_at": "2021-04-30T14:05:32.654000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "When is the next devnet?",
        "created_at": "2021-04-30T15:18:20.900000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "We will know in 5 minutes 🙂 Nothing was planned yet",
        "created_at": "2021-04-30T15:19:59.081000+00:00",
        "attachments": null
    },
    {
        "author": "gregthegreek",
        "category": "general",
        "parent": "",
        "content": "I made a pr the other day to Geth to help stabilise the gas fee's due to MEV based blocks (0 \u0026 1 gas transactions). I spun up this dashboard to track the gas prices being reported by nodes at different blocks on an ongoing basis. Hoping it can shed insights into how the gasprices are fluctuating between clients \u0026 versions to better inform us. Right now i have it only pulling the last 50 recorded gasPrices so some of the table entries may occasionally miss some data, working on smoothing out the calls.\n\nThat being said, if anyone has RPC access to a node or version they may want tracked please let me know, more than happy to have it included!\n\nhttps://eth-gas.chainsafe.io/\n\nHaving someone from my team clean it up next week, its a bit ugly on the eyes",
        "created_at": "2021-04-30T15:28:12.019000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "https://twitter.com/trent_vanepps/status/1388153403432480769?s=20",
        "created_at": "2021-04-30T15:29:43.748000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "Just wanted to quickly clarify why I would say we would need multiple signing clients for the next testnet: there are some valid txs which I send to Aleut, but these txs do not get mined. This might be due to a bug in Besu. I'd like to produce these blocks. If we only use a single signing client then if the clients does not want to sign certain blocks we thus do not have the entire freedom to create these blocks. (Tx in this case is a tx with a few gweis of feeCap and 32 0xff concated bytes for feeTip). I also can't get EIP2930 txs mined for some reason.",
        "created_at": "2021-04-30T15:32:11.225000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "For context, the reason Infura and Chainsafe::Geth-2 sometimes differ is that we are using https://github.com/ethereum/go-ethereum/pull/22752 w/ `gpo.ignoreprice` set to 10gwei.",
        "created_at": "2021-04-30T16:19:04.118000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "\u003c@!552133098075193354\u003e  \u003c@!489256758989029405\u003e So, I was told that it was \"voted\" and decided in previous meetings to not remove the bomb entirely (I would argue that in the current circumstances both reasons of the re-setting the bomb do not apply), so I looked at the meeting #107 from 5th of March, and listened/watched that bit. On the audio, there was no discussion (or I could not find it) about removing the bomb, just about wether to separate bomb delay and London or not. But on the video, I noticed people were chatting, and 2 or 3 people wrote that they agree to keep it in, 1 person said he disagreed, and another person said he is flip-flopping between these. I do not wish to necessary drag it on, but in fact decision to remove the bomb would make London spec simpler and less risky, so it should not be waved away so easily. My arguments that removal is warranted. With the way the merge is planned, it does not really matter whether miners try to stop it or not, so bomb going off later or or not is irrelevant. Also, bomb is supposed to prevent \"stasis\", and what I see now is the opposite of stasis. Removing the bomb entirely will allow us to finalise the London spec entirely quicker.",
        "created_at": "2021-04-30T16:22:32.079000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I feel like we re-discussed it in a later meeting (one that I ran) since then. I can try and dig it up today to share the conversation from that too 👍",
        "created_at": "2021-04-30T16:31:14.471000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "My personal opinion is I would favor keeping it mainly because the social coordination of taking it out  outweighs the technical cost of dealing with it, IMO. It's not just us that has to agree to remove it, we want to get community buy-in for it. I struggle to see how it's possible to do that for London, especially when today we rejected included a change that was proposed for the first time on the call. If make an EIP to remove it and discuss it next call, it will basically be in the same state. I think if you feel very strongly about removing it, then putting together that EIP and getting both clients and the broader community's feedback on it ASAP is essential. Happy to help!",
        "created_at": "2021-04-30T16:33:22.586000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Actually, just checked quickly and I believe you are right: that was the last time we discussed whether we wanted the diff bomb at all or not.",
        "created_at": "2021-04-30T16:43:05.309000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "That's Ok, I just wanted to point out that it rather presumed and not \"decided\" that the bomb will be kept in. As long as it is a copy-paste, I suppose it is not too much damage, to me it is looks more like an obsolete tradition than thing with a strong merit",
        "created_at": "2021-04-30T17:05:27.620000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Baikal spec is up: https://github.com/ethereum/eth1.0-specs/blob/master/network-upgrades/client-integration-testnets/baikal.md\n\nChain ID picked using the lowest point in the trench, as for Aleut 🙂",
        "created_at": "2021-04-30T17:07:51.778000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Can we just make it explicit this time what the network ID is? It is not necessarily the same as chainID, but it was presumed in the Aleut spec",
        "created_at": "2021-04-30T17:09:11.216000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Sure. _Should_ it be the same or not? Happy to set it to whatever makes sense in the spec 👍",
        "created_at": "2021-04-30T17:12:26.953000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "it does not have to be, but if it is, then it should be specified",
        "created_at": "2021-04-30T17:12:47.178000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "with Aleut, I had to watch my node in debug to see why the peers rejecting me",
        "created_at": "2021-04-30T17:13:02.056000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "to find out the network ID",
        "created_at": "2021-04-30T17:13:06.166000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "London spec updated to add 3529: https://github.com/ethereum/eth1.0-specs/blob/master/network-upgrades/mainnet-upgrades/london.md\n\nI also added the EIP to the client tracker. If folks can update it when they have an implementation for the EIP, that would be great. Otherwise, I'll poke around the clients sometime next week to look 🙂",
        "created_at": "2021-04-30T17:13:13.937000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Any objections to making it the same? I can add that now easily. I'm just not sure if this changes the complexity of setting up the devnet or not?",
        "created_at": "2021-04-30T17:13:47.302000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "no objections to making it the same",
        "created_at": "2021-04-30T17:14:57.677000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Done !",
        "created_at": "2021-04-30T17:16:42.842000+00:00",
        "attachments": null
    },
    {
        "author": "gregthegreek",
        "category": "general",
        "parent": "",
        "content": "\u003c@!388751025789468672\u003e cool thanks! My PR might have doen what you're doing but ill have a look!",
        "created_at": "2021-04-30T17:30:57.255000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "I think the ice age being presumed as still being kept in is because one of the original intents was to aid in the PoS transition.  It looks a lot different that it was 5 years ago but the beacon chain merge is IMHO the target now.  It's not a perfect chain killer, but it does require anyone who wants to keep the PoW chain going to invest at least some engineering effort to get at least one client updated. (disclosure: I'm pro ice age because the merge is months, not years away)",
        "created_at": "2021-04-30T18:06:57.685000+00:00",
        "attachments": null
    },
    {
        "author": "uri_bloxroute",
        "category": "general",
        "parent": "",
        "content": "Not sure if you mean the raise to 15M, or being sarcastic, or something else 😅",
        "created_at": "2021-04-30T18:35:36.492000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "The first",
        "created_at": "2021-04-30T18:40:46.936000+00:00",
        "attachments": null
    },
    {
        "author": "uri_bloxroute",
        "category": "general",
        "parent": "",
        "content": "Sorry, literally crashed yesterday so did not answer \u003c@!364458974906548225\u003e \u003c@!301186049323958275\u003e \u003c@!273808422753796097\u003e \u003c@!636289909359116290\u003e \n\u003c@!364458974906548225\u003e - I'm not sure why you think the proposal is complex.\n1. ppl vote with EGL token (weight=amount*lockup)\n2. pools need not follow, but are awarded EGLs depending how close they follow it (carrot only)\nThat's it. We aim for stupid-simple, which is part of the reason \u003c@!273808422753796097\u003e argues against it (vs quadratic for example). I think EGL can be upgraded to something more sophisticated, but it makes more sense to keep it super simple\n\nThe convo between \u003c@!364458974906548225\u003e and \u003c@!301186049323958275\u003e shows the lack of clarity even among core devs what are the different opinions, which is why we thought it makes the most sense to distrbute it to core devs and highlight their different opinions - but allowing the entire community to participate\n\n\u003c@!273808422753796097\u003e I totally agree that larger actors will have more say. is that bad?\nright now I can probably increase the gas limit by bribing pools $5-10M - maybe a tad more, and that's absurd. EGL hardens it by ~$100M\nthe largest actors with $B on the line depending on ETH success are the ETH holders and Uniswap Lps, the likes of Coinbase, and the a16z, Pantera, Consensys polychain of the world.\nright now they don't have any idea what the gas limit should be, because they have no way to participate, and they did not spend any time on it. If they could affect it, some of them already confirmed that they'll be interested to participate, which again, is a good thing.\nwhy do we not want the participation of the heavily-staked?\n\nIf there was a way for someone to buy a large chunk of EGLs for cheap, I would agree with you, but I think a launch without early participants getting a giant discount prevents the issue\n\nsorry - I'm terrible in short form..",
        "created_at": "2021-04-30T18:55:08.148000+00:00",
        "attachments": null
    },
    {
        "author": "uri_bloxroute",
        "category": "general",
        "parent": "",
        "content": "That's super valuable feedback \u003c@!636289909359116290\u003e  🙏 - I'm not sure most core devs understand that the gas limit is effectively decided by sparkpool, ethermine and f2pool, with slight effect from #4-#6\nSparkpool and Babel at least had been trying to increase the gas limit for months now",
        "created_at": "2021-04-30T18:56:58.115000+00:00",
        "attachments": null
    }
]