[
    {
        "author": "jwasinger",
        "category": "general",
        "parent": "",
        "content": "I'm not the authoritative source here but I see no reason why they should not (I would guess the range proofs are fairly size efficient because of the sparseness and high branching factor of the tree?).  I'm not sure what the implications are for snap-sync but with verkle trees an account's code can occupy multiple extension nodes (bottom-most node with 256 32byte values) across the tree if the code is bigger than ~4kb.  and then the account storage will be also be in one or more separate extension nodes.  These are spread across the tree (not siblings)",
        "created_at": "2021-12-13T08:59:16.361000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I assume clients don't have a standardized way to \"access\" historical data files? Meaning that if we had files in a geth-ready format, Erigon couldn't use them? \n\nIf that's the case, then we can either:\n1. Get clients to change how they process historical block data (seems very hard!)\n2. Get clients to \"import\" the blocks (could be very slow, but you only need to do it once)\n3. Have historical data available in many different formats (adds overhead, but might not be too hard to maintain)\n\nWas (3) what you had in mind, \u003c@456226577798135808\u003e ?",
        "created_at": "2021-12-13T16:51:34.796000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Yes, currently, and based on my previous experience with cross-team collaboration, it would be quite hard to steer everyone into the same direction. Because most client code bases are in the different stages of \"transition\" and their transition end-points are also different. So I am assuming that we will not be able to come up with a standard in a short term, and we will have to live with it.",
        "created_at": "2021-12-13T17:09:40.986000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Yeah, that doesn't seem _so_ bad. Also, it's probably something client-adjacent teams can help with.",
        "created_at": "2021-12-13T17:10:24.780000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I think we can agree on some basic principles, of course, but not make them too opinionated",
        "created_at": "2021-12-13T17:11:08.400000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "for example, requirement to \"import\" something is opinionated",
        "created_at": "2021-12-13T17:11:27.622000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "having historical data available in 2 or 3 different formats is not actually that bad",
        "created_at": "2021-12-13T17:12:34.284000+00:00",
        "attachments": null
    }
]