[
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T00:00:03.670000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T00:01:07.643000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T00:01:53.232000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "I pinned a couple of others for people who want to get caught up to speed. If you see any others, or I if I miss something let me know.",
        "created_at": "2021-03-03T00:02:33.071000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "And if any of the pinned authors want to update their statements happy to unpin or pin another",
        "created_at": "2021-03-03T00:03:11.710000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T00:04:18.513000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T00:06:02.354000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "or remove them all. 😄",
        "created_at": "2021-03-03T00:09:14.761000+00:00",
        "attachments": null
    },
    {
        "author": "zkfloof",
        "category": "general",
        "parent": "",
        "content": "if the EIP in question is part of a bigger EVM overhaul, is there a chance that it could still go into a future fork along with related EIPS?",
        "created_at": "2021-03-03T00:57:41.592000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Yes, we could very easily add it to a future fork, the work is already done.",
        "created_at": "2021-03-03T00:58:00.936000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "It is more work now to disable it (bit of work) and test that all clients are still in consensus for everything else but the EIP (medium amount of work).",
        "created_at": "2021-03-03T00:58:32.059000+00:00",
        "attachments": null
    },
    {
        "author": "zkfloof",
        "category": "general",
        "parent": "",
        "content": "perhaps \u003c@!683653554631868440\u003e would feel better knowing that the effort wouldn't have gone to waste but simply delayed then",
        "created_at": "2021-03-03T00:59:57.279000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I'm not sure we can guarantee that, though",
        "created_at": "2021-03-03T01:00:34.418000+00:00",
        "attachments": null
    },
    {
        "author": "zkfloof",
        "category": "general",
        "parent": "",
        "content": "I can understand the need to be extra careful about what goes in as it is easier for features to be added than to be removed",
        "created_at": "2021-03-03T01:01:48.203000+00:00",
        "attachments": null
    },
    {
        "author": "zkfloof",
        "category": "general",
        "parent": "",
        "content": "but i understand \u003c@!683653554631868440\u003e 's frustration",
        "created_at": "2021-03-03T01:02:49.647000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Yeah, on that last point, I do think it's worth thinking about the second-order effects a bit. Removing the change may be beneficial from a technical PoV, but it's really not great to have people spend years working on something, \"think it's in\" and have it removed at the last minute. It also does affect the perception of \"Ethereum governance\" to remove something at the last minute without a very strong rationale to do so (ex: a security risk).",
        "created_at": "2021-03-03T01:20:40.997000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I'm not saying we shouldn't do it, but I do think the second order effects here are potentially more consequential than whether 2315 is in or not: will people want to take on working on large EIPs? How will this change user expectations w.r.t. Ethereum, especially larger \"commerical\" users like dapps, infrastructure, etc.",
        "created_at": "2021-03-03T01:21:59.125000+00:00",
        "attachments": null
    },
    {
        "author": "zkfloof",
        "category": "general",
        "parent": "",
        "content": "Is there anything that can be added to the EIP process that makes it less likely for this sort of thing to happen? Like making it a requirement for affected parties to be present at a Core Dev Call?",
        "created_at": "2021-03-03T01:24:18.484000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Yes, we will definitely do that",
        "created_at": "2021-03-03T01:24:51.429000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I don't think we necessarily need them to come to AllCoreDevs. We did it async for 1559, for example: https://github.com/ethereum-cat-herders/1559-outreach (modulo the contentious aspect, which we did do async).",
        "created_at": "2021-03-03T01:25:25.985000+00:00",
        "attachments": null
    },
    {
        "author": "zkfloof",
        "category": "general",
        "parent": "",
        "content": "Could this have been avoided if the solidity team saw the EIP earlier or had they already seen it but only recently came to light that it would not in fact be useful?",
        "created_at": "2021-03-03T01:25:45.661000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Yes, I think there are two things we probably should do:\n1. Make it part of the EIP process/template to explicitly highlight who wants this and why\n2. Make it part of the ACD process to communicate these changes more broadly earlier on, and potentially catalog objections better.",
        "created_at": "2021-03-03T01:26:31.243000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "One challenge with (2) is that people opposing generally just want to share their objection once and move on, while champions are willing to keep pushing their EIP \"forever\", and have a much higher incentive to keep engaging, in almost all cases, than critics (unless they are _very_ negatively affected).",
        "created_at": "2021-03-03T01:26:53.436000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "For that reason, I feel like EIPs should require the champion to convince others to use the EIP before it can be considered for inclusion. This doesn't work for every core EIP (like 2929), but for things like 2315 and 3074 it is a good baseline to show that the EIP does have proponents who plan to use the EIP on a large scale once it is deployed.",
        "created_at": "2021-03-03T01:33:11.291000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "The Solidity team has been aware of and participated in EIP-2315 since long before it was proposed.  I would like to see their most recent analysis.",
        "created_at": "2021-03-03T01:36:07.633000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "And my intemperate \"bullshit\" is just that we are at the very last stage of deploying an upgrade.  EIP-2315 has been planned for this upgrade for many months now.  It just isn't the time to be asking EIP authors (for any EIP) to re-justify their work.  The only relevant questions at this point are, \"has it been implemented?\", \"has it been tested?\", and \"is it broken?\".",
        "created_at": "2021-03-03T01:40:12.322000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "Like I've said all along, it is very unfortunate that we've found ourselves in this situation, but we are here now. We should make the best decision with the current information and it looks like most agree that given the solidity team does not find this EIP useful and that there are no other projects which plan to use subroutines in the near future, the best decision is to remove the EIP from Berlin.",
        "created_at": "2021-03-03T01:45:51.439000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Those really are the only questions I consider relevant at this point.",
        "created_at": "2021-03-03T01:48:20.369000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "The time for the questions you raise has passed.",
        "created_at": "2021-03-03T01:48:49.661000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T01:49:16.652000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I'm not joking.",
        "created_at": "2021-03-03T01:49:37.814000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "You said previously that it is up to the critics to convince core devs to abandon the EIP, and assuming we can use the same fork blocks without 2315, it appears they agree to abandon the EIP for Berlin.",
        "created_at": "2021-03-03T01:50:54.419000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "There is an unfortunate chicken and egg problem here I don't readily see a solution for.",
        "created_at": "2021-03-03T01:51:08.917000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "People don't build things that require core changes because they don't think it is possible to get them in at all, or in a reasonable time.",
        "created_at": "2021-03-03T01:52:03.540000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Or that, having achieved consensus at getting them in, the consensus process can be re-opened for any reason up until the very last moment.",
        "created_at": "2021-03-03T01:54:31.765000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "At this point - and I'm still feeling rather intemperate - I would not care to participate in further core EIPs - or encourage others to submit them.  All pain, no gain.",
        "created_at": "2021-03-03T01:57:20.942000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "And further discussion should probably go here rather than clutter this channel.\nhttps://github.com/ethereum/pm/issues/263",
        "created_at": "2021-03-03T01:59:42.022000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "The meta-discussion that I do think this raises here is procedural.  At what point in the process of an upgrade can certain decisions be considered done with?  People make plans and spend money based on the decisions we announce.\n\nI still submit that we are at the point that the relevant questions are - \"has it been implemented?\", \"has it been tested?\", and \"is it broken?\"",
        "created_at": "2021-03-03T02:06:41.246000+00:00",
        "attachments": null
    },
    {
        "author": "zkfloof",
        "category": "general",
        "parent": "",
        "content": "1) improve EIP process 2) defer static analysis work for future fork 3) keep berlin on schedule = my 2c",
        "created_at": "2021-03-03T02:44:11.550000+00:00",
        "attachments": null
    },
    {
        "author": "hudsonjameson",
        "category": "general",
        "parent": "",
        "content": "EDIT: See most recent message where I change my mind: https://discord.com/channels/595666850260713488/745077610685661265/816575516907798539\n\nJust caught up on everything. This is a very unfortunate situation and there isn't a good answer. My thoughts:\n\n- a lot of things need to be improved process wise, especially the things \u003c@!683653554631868440\u003e mentioned about when to cut off changes.\n- I do think there is new information in that members of the Solidity team, including their lead, are not in favor of this EIP and multiple people (including myself) were under the impression they were on board when they weren't. That is in part the fault of the Solidity team for choosing not to take part in a process that decides these things.\n- If it were just the fact that the Solidity team didn't think it would be beneficial that would be one thing, but now there is an unanswered question about who will use it. I like what \u003c@!211091239112671234\u003e said:\n\n\u003e Agree it's wonky to remove last minute. It's sooo bad, and I can't understand why ppl wake up now to sth that's been planned for such a long time. I mean ffs. \n\u003e However, adding another dead-on-arrival feature is also pretty useless.\n\u003e Nothing is temporary, anything added is there forever. So if it's not useful, it's a lot better to never have had it",
        "created_at": "2021-03-03T03:47:06.645000+00:00",
        "attachments": null
    },
    {
        "author": "hudsonjameson",
        "category": "general",
        "parent": "",
        "content": "Although we are doing a bad thing in doing very last minute changes, it would be worse imo to have an unused feature which the Solidity team seems to think will not help things. For this reason I'm personally leaning towards  removing it and pushing back the Ropsten fork a bit.\n\nI feel for Greg's position and acknowledge all the hard work that was put into this EIP. It really sucks we are having to deal with this. I think it would be different if there were more people than Greg advocating for this loudly and if it wasn't the Solidity team with objections. Removing it last minute will set a bad ecosystem example and deter people from working on EIPs (at least in the short term). However, leaving it in on principle to follow a broken process that will be improved over time doesn't feel right when multiple people believe, at minimum, it will introduce tech. debt.",
        "created_at": "2021-03-03T03:47:31.066000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I don't think people recognize how bad the precedent is.",
        "created_at": "2021-03-03T03:49:37.842000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T03:50:26.482000+00:00",
        "attachments": null
    },
    {
        "author": "hudsonjameson",
        "category": "general",
        "parent": "",
        "content": "One more thing that got cut out while I was copy/pasting:\n\n\u003c@683653554631868440\u003e I want to respectfully ask that you have more professional decorum. You've requested the same of people like Ameen on ACD calls and I think the same should apply to venues like this. You refused to answer people's questions and called bullshit on people who are trying to figure this out and get questions answered in good faith. I think we should all hold ourselves to high standards when communicating, even when tensions are high.",
        "created_at": "2021-03-03T03:53:59.860000+00:00",
        "attachments": null
    },
    {
        "author": "hudsonjameson",
        "category": "general",
        "parent": "",
        "content": "I believe precedents can be reversed. This process/system is very broken right now in multiple ways and I believe incremental improvements will help. I still believe tech. debt and having features that a prominent EVM related team is saying is bad to add trumps the principle of not making changes after a cut-off date in this instance.",
        "created_at": "2021-03-03T03:56:09.629000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "The precedent is that the Core Devs cannot be trusted to carry through with their announced decisions.  Because we don't.  How many times do you think we can walk that back?",
        "created_at": "2021-03-03T03:58:35.729000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "(I apologize for the cursing.)",
        "created_at": "2021-03-03T04:01:33.946000+00:00",
        "attachments": null
    },
    {
        "author": "hudsonjameson",
        "category": "general",
        "parent": "",
        "content": "Not sure. A factor that may influence that is the merge and how Eth2 dev process combines and influences the process we currently have. I don't think there's a way to know. One thing we do know is that tech. debt can be more accurately measured and can be forever.",
        "created_at": "2021-03-03T04:01:37.534000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Some debt is smaller than others.  Three very simple instructions that Solidity doesn't need but others teams want seem worth it, especially when they have already withstood months of discussion, implementation and testing.",
        "created_at": "2021-03-03T04:04:14.440000+00:00",
        "attachments": null
    },
    {
        "author": "hudsonjameson",
        "category": "general",
        "parent": "",
        "content": "This was under the guise that Solidity team would be one of the primary users of it right? Who are the other people/teams saying they would use it?",
        "created_at": "2021-03-03T04:05:08.931000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "No such guise, though until today I had  no reason to believe they wouldn't.  Again - they are basic primitives for most every other machine I know of - but I'm discussing that on \u003c@543900561460822016\u003e's issue.",
        "created_at": "2021-03-03T04:07:41.377000+00:00",
        "attachments": null
    },
    {
        "author": "hudsonjameson",
        "category": "general",
        "parent": "",
        "content": "Can you link to it again?",
        "created_at": "2021-03-03T04:08:55.675000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "https://github.com/ethereum/pm/issues/263",
        "created_at": "2021-03-03T04:10:12.248000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "On this channel it's the precedent I'm concerned with, and the appropriateness of raising this sort of objection so late in our process.  I don't see a strong enough technical argument here to make it worth setting such a bad precedent.",
        "created_at": "2021-03-03T04:12:50.603000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "It might be good to hear from the Vyper team if we can.",
        "created_at": "2021-03-03T04:14:50.248000+00:00",
        "attachments": null
    },
    {
        "author": "hudsonjameson",
        "category": "general",
        "parent": "",
        "content": "Thanks for mentioning some of the teams who would use it in the thread \u003c@683653554631868440\u003e, that helps.",
        "created_at": "2021-03-03T04:14:52.973000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I just spoke with Bryant, and he confirmed his interest on Twitter.  Will invite him here.",
        "created_at": "2021-03-03T04:16:08.623000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Ugh, I really don't like the idea of bumping the gas limit after Berlin.  While we fix the attack vector, we haven't fixed the state growth problem.",
        "created_at": "2021-03-03T04:24:48.241000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "https://twitter.com/fubuloubu/status/1366949333854277632?s=21",
        "created_at": "2021-03-03T04:37:31.032000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "Seemed relevant",
        "created_at": "2021-03-03T04:37:39.774000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Why am I always asleep for the best debates.  😢",
        "created_at": "2021-03-03T04:46:36.173000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "But surely because the consequences of state growth are delayed, we don't strictly need a state fix now, rather we just need a _commitment_ to a state fix now?",
        "created_at": "2021-03-03T04:47:29.124000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "which is something I fully support btw (see my post on magicians today)",
        "created_at": "2021-03-03T04:47:39.609000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If we had a concrete plan, roadmap, and timeline for state growth reduction I would agree.",
        "created_at": "2021-03-03T04:48:00.283000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "https://ethereum-magicians.org/t/weak-statelessness-and-or-state-expiry-coming-soon/5453",
        "created_at": "2021-03-03T04:48:06.235000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "However, right now we have a vague plan, a fuzzy roadmap, and no timeline.",
        "created_at": "2021-03-03T04:48:11.978000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "I think now is basically the time to start solidifying the plan 😆",
        "created_at": "2021-03-03T04:48:32.948000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "One thing we have to decide at some point is whether to prioritize weak statelessness or state expiry",
        "created_at": "2021-03-03T04:48:48.972000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "And *once* that plan is solidified and we have teams *committed* to working on it I would favor a block size increase.  🙂",
        "created_at": "2021-03-03T04:49:02.369000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "What I'm concerned about is that it will be 3-5 years before we actually implement a stateless plan, and that is a lot of time for state growth.",
        "created_at": "2021-03-03T04:49:41.740000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "So we have a mini-team (Guillaume, with Dankrad and myself advising) working on a Verkle tree implementation, and the regenesis people have been working on state expiry",
        "created_at": "2021-03-03T04:49:41.838000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "I think we're ~1-1.5 years away if we put our feet down and say \"X is the solution, we're doing it\"",
        "created_at": "2021-03-03T04:50:13.893000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This is in the context of our (Ethereum community's) historic sluggishness (for good reason) on implementing major changes (like Proof of Stake for example).",
        "created_at": "2021-03-03T04:50:22.400000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It is that latter part that I fear is going to be difficult to make happen.",
        "created_at": "2021-03-03T04:50:36.852000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I agree with the timeline under that condition, I disagree on the likelihood of that condition being met.  😄",
        "created_at": "2021-03-03T04:50:47.078000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "\u003c@!552133098075193354\u003e thoughts on the best format for a discussion to push this forward?",
        "created_at": "2021-03-03T04:51:13.293000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "More generally, thoughts on a mechanism for doing large changes to Ethereum better.  🙂",
        "created_at": "2021-03-03T04:51:43.152000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Stateless, to be clear?",
        "created_at": "2021-03-03T04:51:43.387000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "Either state expiry or weak statelessness or both",
        "created_at": "2021-03-03T04:51:52.958000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "The first step may well be having a clear decision of which one to prioritize",
        "created_at": "2021-03-03T04:52:06.694000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "Because I think one of our problems is that there are some sub-teams who love state expiry and are kinda meh about weak statelessness, and other teams who love weak statelessness and are kinda meh about state expiry",
        "created_at": "2021-03-03T04:52:33.876000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "There are a number of very big changes to Ethereum that we would like to make.  We currently don't have a great process for making them happen because the client devs tend to work very much in a \"next hard fork\" mindset.  2315 is actually a great example of this, because 615 is useful but it is too big to get through the core devs.  It was broken up to try to make that process go smoother, but that didn't work.  So we need a better mechanism for longitudinal changes.",
        "created_at": "2021-03-03T04:52:48.775000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Got it, I meant _that_ vs 2315. Robert Drost and Joseph Chow have been organizing the recent stateless calls, which have been helpful. The one challenge is core devs don’t engage a ton because it seems like things are still too much in R\u0026D.",
        "created_at": "2021-03-03T04:53:22.289000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "If EIP 1559 happens in London then I am confident that ethereum core dev can do big things",
        "created_at": "2021-03-03T04:53:25.054000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "1559 is a very small change from a core dev perspective.",
        "created_at": "2021-03-03T04:53:40.527000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "It's bigger and more disruptive than many other things we've done!",
        "created_at": "2021-03-03T04:53:57.021000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Stateless is a pretty huge change for client devs.",
        "created_at": "2021-03-03T04:53:57.087000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "As is EIP-615 (actually that one I would call medium).",
        "created_at": "2021-03-03T04:54:04.843000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Disagree, but it has less “argument surface” than stateless for sure !",
        "created_at": "2021-03-03T04:54:14.717000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think from the UX and economics side it is, but the *code* changes are really small.",
        "created_at": "2021-03-03T04:54:18.538000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "Including the network layer stuff?",
        "created_at": "2021-03-03T04:54:30.694000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "This is kind of a tangent, though",
        "created_at": "2021-03-03T04:54:36.022000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "And wallets needing to support new tx types",
        "created_at": "2021-03-03T04:54:37.948000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "1559 is pretty big, probably not as big as stateless, but larger than your typical EIP",
        "created_at": "2021-03-03T04:54:51.504000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Ah, that part doesn't require coordination though.",
        "created_at": "2021-03-03T04:54:52.389000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "So is the first step then figuring out the full list of things that needs to be changed if we do stateless?",
        "created_at": "2021-03-03T04:55:51.420000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "For stateless, we need to find out which approach works best both in theory and practice. Maybe one good first step is to have researchers list what they see as the pros and cons of each and they bring that up on ACD to get feedback? The goal here is to make sure we all at least grok + agree on the trade offs",
        "created_at": "2021-03-03T04:55:54.095000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "What 2315 is teaching us (unfortunately) is that breaking a big change up into smaller iterative pieces doesn't work in the current process.  I think this is a bit of a travesty, sadly.",
        "created_at": "2021-03-03T04:56:29.531000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "(I’m using stateless in the most general sense, to be clear)",
        "created_at": "2021-03-03T04:56:47.459000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It means that we can't do stateless by first switching to kate commitments which bring no immediate value on their own, they only pave the way for stateless in the future.",
        "created_at": "2021-03-03T04:56:53.288000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This 2315 decision kind of boxes us in to do full stateless all in one shot, which I think is asking for failure.",
        "created_at": "2021-03-03T04:57:14.233000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I think it’s more nuanced than that. IMHO 2315 is a bad example because “upgrading the EVM” is not as big of a priority as solving state issues or the merge",
        "created_at": "2021-03-03T04:57:24.928000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "There are other clever things like doing state expiry where the first \"regenesis\" changes the commitment structure",
        "created_at": "2021-03-03T04:57:32.706000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "from patricia to Kate",
        "created_at": "2021-03-03T04:57:37.210000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "I actually like this option more and more 🤣",
        "created_at": "2021-03-03T04:57:54.451000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "So, again, my opinion, there is low likelihood we ever do 2315 Pt II because we’ll have other high priority things",
        "created_at": "2021-03-03T04:57:55.995000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Agree, the scale is different.  However, it doesn't seem ACD *cares* about the long term, they want to know if this immediate change solves an immediate problem and they aren't looking at the future of what problems it *enables* us to solve later.",
        "created_at": "2021-03-03T04:58:35.409000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "ok maybe one thing I could do is write up a proto-EIP for a couple paths that I like",
        "created_at": "2021-03-03T04:58:37.665000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I would rather see a roadmap or two first personally.",
        "created_at": "2021-03-03T04:58:55.883000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "EIPs describe the technical changes, but I think it is still fuzzy in people's head the big picture.",
        "created_at": "2021-03-03T04:59:11.801000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "And having a very clear big picture I think would help a lot.",
        "created_at": "2021-03-03T04:59:17.994000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Personally, something that clearly explains the pros/cons of the various approaches would work",
        "created_at": "2021-03-03T04:59:20.168000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "hmm",
        "created_at": "2021-03-03T04:59:24.428000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "I feel like the docs I've already written try to do that",
        "created_at": "2021-03-03T04:59:33.033000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "But it's not in one place? Or people haven't read those docs yet?",
        "created_at": "2021-03-03T04:59:45.830000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I feel like the roadmap part is covered, yes. I probably need to re-read re:trade offs",
        "created_at": "2021-03-03T04:59:54.918000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "A combination of both.  Plus you don't have enough pictures in your documents.  😉",
        "created_at": "2021-03-03T05:00:04.134000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "ok, fair!",
        "created_at": "2021-03-03T05:00:15.312000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "And also, I don’t think most core devs have had much bandwidth over the past few weeks with Berlin shipping",
        "created_at": "2021-03-03T05:00:17.096000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Need more venn diagrams, flowcharts, etc.  😄",
        "created_at": "2021-03-03T05:00:18.352000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "UML documents as well.  😆",
        "created_at": "2021-03-03T05:00:34.717000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "you're right on diagrams; they really are 3x harder to make but 3x more pleasant to read, and people always seem happy when I make them",
        "created_at": "2021-03-03T05:00:53.719000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I would say 3x harder to make and 10x more effective at engaging people.",
        "created_at": "2021-03-03T05:01:09.511000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I recommend hiring someone to make them if you don't like doing it yourself.  Find an expert UML person on Upwork or something where you can give theme a napkin drawing and they can turn it into a beautiful work of art.  🙂",
        "created_at": "2021-03-03T05:02:05.477000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Back on the topic of EIP-2315...\n\nThe removal of dynamic jumps I believe to be important for static analysis.  In a past life I had to do bytecode analysis/rewriting and dynamic jumps are *by far* the hardest thing to deal with.  If it weren't for dynamic jumps bytecode mutation becomes quite easy.  That is EIP-615.  I agree with the argument that 615 *should* be split into multiple smaller EIPs because it changes too much at once in a single *technical document*.  This is exactly what the author did and then they introduces the first of those EIPs to get the ball rolling.  IMO, this is a very appropriate iterative process and we should be encouraging it, not discouraging it.",
        "created_at": "2021-03-03T05:03:29.843000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "To \u003c@489256758989029405\u003e I think it is reasonable to ask \"who will use this\", and the answer I believe is that it will be used once dynamic jumps are removed in the future and this is a necessary change to achieve that goal.  We *could* wait and include all of the changes at once, but that is a very non-iterative process and iterative processes in software *tend* to be better.",
        "created_at": "2021-03-03T05:04:51.089000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "EIP-615 lays out a clear path to the removal of dynamic jumps and it can be done in steps.  Subroutines is one step, datablocks is another, static jumps is another, and finally the removal of dynamic jumps is the last.",
        "created_at": "2021-03-03T05:06:20.842000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "I think there was a process failure regarding 2315 and we should reassess the situation without a hard fork looming. The lead author of EIP-615 chose to withdrawn it (not updated on the EIP), so it doesn't seem correct to pursue an iterative approach to a withdrawn EIP.",
        "created_at": "2021-03-03T05:11:08.499000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "The process hasn't failed.  Yet.",
        "created_at": "2021-03-03T05:17:56.214000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Do you have details on that withdraw?",
        "created_at": "2021-03-03T05:21:52.061000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I didn't withdraw it.",
        "created_at": "2021-03-03T05:22:20.425000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "sorry, i was referring to chris' post (who is not the a co-author, not lead, my mistake), but you did mention that you were withdrawing 615 from consideration: https://ethereum-magicians.org/t/eip-615-subroutines-and-static-jumps-for-the-evm-last-call/3472/22?u=matt",
        "created_at": "2021-03-03T05:24:52.440000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Excuse me.  \"The lead author here has confirmed to withdraw the proposal from further consideration in this round.\" was @fulldecent's better phrasing.   It remains in Draft status, as that seemed appropriate after further discussion, there and among the editors.",
        "created_at": "2021-03-03T05:28:55.527000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I understand that was confusing.",
        "created_at": "2021-03-03T05:31:00.843000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Reading \u003c@273818081439121408\u003e's comments, it sounds like their primary objection is \"changing the EVM is risky\", and I definitely can appreciate that.",
        "created_at": "2021-03-03T05:31:10.381000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Do we have a proposed mechanism for deprecating dynamic jumps once everything is in place to \"replace\" them?",
        "created_at": "2021-03-03T05:31:27.838000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Yes.",
        "created_at": "2021-03-03T05:31:34.065000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "What is the TL;DR on that?",
        "created_at": "2021-03-03T05:31:46.918000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "EVM versioning?",
        "created_at": "2021-03-03T05:31:49.710000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "We introduce bytecode versioning.",
        "created_at": "2021-03-03T05:32:18.043000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003e primary objection is \"changing the EVM is risky\"\nAt some point the time for discussing objections needs to end.  One can _always_ find objections.",
        "created_at": "2021-03-03T05:33:33.684000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "EIPs:\n1. introduce subroutines\n2. introduce static blocks\n3. introduce data blocks\n4. introduce EVM versioning (disallow new code deployments from being legacy EVM bytecode)\n5. introduce EVM v2 which removes dynamic jumps",
        "created_at": "2021-03-03T05:34:10.248000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Exactly.",
        "created_at": "2021-03-03T05:34:22.461000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "How does EVM versioning work with contracts that deploy code?",
        "created_at": "2021-03-03T05:34:30.857000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "An EVMv1 contract can only deploy EVMv1 code I assume?",
        "created_at": "2021-03-03T05:34:44.738000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Probably.  This is getting way past a TL;DR",
        "created_at": "2021-03-03T05:35:16.215000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We would have the problem that legacy EVMv1 code could perpetually be deployed by routing through an EVMv1 contract deployer.",
        "created_at": "2021-03-03T05:35:41.585000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Long, long prior discussions on Magicians...",
        "created_at": "2021-03-03T05:35:55.718000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "In the 615 thread, or elsewhere?  Is there a summary?",
        "created_at": "2021-03-03T05:36:20.660000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "615 thread.  I could be up all night trying to summarize.",
        "created_at": "2021-03-03T05:36:39.491000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Do we think we would still benefit significantly, despite this, if we always have to deal with EVMv1 code on mainnet?",
        "created_at": "2021-03-03T05:36:42.969000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "We will always have to deal with EVM1 - therefore  - we must never improve EVM1?",
        "created_at": "2021-03-03T05:37:14.581000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This is why every EIP needs a champion IMO.  Someone who has the context and willingness to keep an up-to-date summary of prior discussions.",
        "created_at": "2021-03-03T05:37:20.298000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "For me, the big benefit of removing dynamic jumps is that it enables some things that previously weren't possible.  However, the things I have in mind require that *everything* is free of dynamic jumps.",
        "created_at": "2021-03-03T05:37:49.939000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "That is, the use cases I have in mind don't work in a world where there is still a bunch of code that has dynamic jumps.",
        "created_at": "2021-03-03T05:38:07.699000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "That's impossible to achieve.",
        "created_at": "2021-03-03T05:38:14.240000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I - and others - would be happy enough that it is easy to write code that doesn't need them.",
        "created_at": "2021-03-03T05:38:56.331000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Perhaps possible with sharding?  Could we have an executable shard that perhaps has a \"better\" virtual machine running on it?",
        "created_at": "2021-03-03T05:39:04.359000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Yes.",
        "created_at": "2021-03-03T05:39:11.390000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I think wasm is still intended as one such.",
        "created_at": "2021-03-03T05:40:05.393000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "wasm =\u003e evm?",
        "created_at": "2021-03-03T05:40:17.311000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Tangent: Personally, if I was to build a new EVM I would target zkRollups.  What instruction set makes them easier to do.",
        "created_at": "2021-03-03T05:40:51.721000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "By the way - \u003c@543900561460822016\u003e created an issue for this technical discussion.  And your suggestion is over my head.",
        "created_at": "2021-03-03T05:41:46.979000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Also - EIP-2315 has value on its own.  Computer and complier designers got tired of not having subroutines as primitives decades ago. (As I get tired of repeating.)",
        "created_at": "2021-03-03T05:43:21.797000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "After midnight here.  Good night.",
        "created_at": "2021-03-03T05:45:13.871000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "updated the test suite to remove 2315: https://github.com/ethereum/tests/pull/793",
        "created_at": "2021-03-03T05:48:35.785000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I feel like the vyper maintainer asking for subroutines publicly on Twitter satisfies \u003c@489256758989029405\u003e's request for \"a legitimate use case/user\".",
        "created_at": "2021-03-03T05:49:30.927000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "(it makes me sad that major ecosystem participants engage on Twitter rather than in the appropriate places)",
        "created_at": "2021-03-03T05:50:30.922000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003c@552133098075193354\u003e One major problem with allowing someone to bring up concerns this late in the game and have them change our roadmap is that it doesn't provide ample time for defenders to rally.  This issue was brought up and in under 24 hours tentative decisions were made to remove it.  This isn't *nearly* enough time for defenders to react IMO, especially for anything that isn't a security risk.  As an example, just a mere 2 hours ago we got an answer to the question Thomasz asked less than 12 hours ago (who is a legitimate user of this), which showed up in a different venue than this one *after* the rush decision making process.",
        "created_at": "2021-03-03T05:56:52.763000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "Agreed, what's happening is very problematic. But it's important to separate the past failures from the decision at hand, and IMO the decision is \"Should EIP-2315 go into the Berlin hardfork with mixed feedback from compiler and evm teams?\". I think the answer to that is no.",
        "created_at": "2021-03-03T06:03:43.311000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I agree that we should look at the current situation not what lead to it.  I disagree that the current situation suggests no-go.",
        "created_at": "2021-03-03T06:05:36.250000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Vyper saying that they want this feature is enough for me, given that the code is implemented in all clients and ready to release.",
        "created_at": "2021-03-03T06:06:09.574000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We can give Vyper a feature they want for free essentially (zero engineering cost to add it).",
        "created_at": "2021-03-03T06:06:23.500000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "The fact that it is implemented in clients and is ready to release should not be a relevant factor, we should look at this like this EIP has support from Vyper but strong opposition from Solidity. That should be worked out before moving forward",
        "created_at": "2021-03-03T06:07:39.936000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It is because it affects the engineering cost.",
        "created_at": "2021-03-03T06:08:03.819000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "That should've been worked out before it was slated for release",
        "created_at": "2021-03-03T06:08:04.242000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Given the *current* situation, we have an opportunity to release a feature at 0 engineering cost.",
        "created_at": "2021-03-03T06:08:26.584000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Which changes the calculus to be \"do the benefits of the feature outweigh the non-engineering costs of the feature\".",
        "created_at": "2021-03-03T06:08:43.056000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The non-engineering costs are \"technical debt/complexity\" essentially.",
        "created_at": "2021-03-03T06:09:01.214000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Perhaps I'm missing something, but Solidity is basically just saying \"we won't use this\".",
        "created_at": "2021-03-03T06:09:20.313000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "They aren't saying \"this will break Solidity\" or anything.",
        "created_at": "2021-03-03T06:09:29.123000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "**Vyper**: This would be really helpful for us.\n**Solidity**: We won't use this.\n**Clients**: The technical debt introduced is low.  The engineering cost is 0.\n**EVM remaining 1-byte opcode counter**: -3\n**Future Developers**: Seeing core devs kick out yet-another EIP at the 11th hour decreases my willingness to contribute EIPs.\n**Future Trolls**: Ooh, I can just wait to oppose a thing until the 11th hour and it increases my chance of blocking something I don't like.",
        "created_at": "2021-03-03T06:10:22.205000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "https://discord.com/channels/595666850260713488/745077610685661265/816451310807285761\nthey are also saying that there are optimizations that will no longer be possible for them",
        "created_at": "2021-03-03T06:11:39.199000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "My understanding is that they would be unable to do certain optimizations *if* they implemented subroutines.",
        "created_at": "2021-03-03T06:12:33.258000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Which means they likely won't implement subroutines.",
        "created_at": "2021-03-03T06:12:41.129000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "The cost of bumping 2315 out of Berlin is low and the risk is 0. The cost of including it is low, but the risk is medium that it is not useful. There is not a time crunch to ship subroutines.",
        "created_at": "2021-03-03T06:13:57.203000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003e the risk is medium that it is not useful\nI don't think this is the case given the comments from the Vyper maintainer.",
        "created_at": "2021-03-03T06:14:26.551000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "They should have a document that clearly lays out how they plan to use it and why it is useful",
        "created_at": "2021-03-03T06:15:37.941000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "There are a whole lot of human layer knock-on effects of bumping out 2315 right now.  Communication, delay of Berlin, decreased confidence in future EIP authors, encouraging people to concern troll in the 11th hour, etc.",
        "created_at": "2021-03-03T06:15:46.087000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "They didn't think it was necessary because the loud objection didn't show up until less than 24 hours ago.",
        "created_at": "2021-03-03T06:16:07.701000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "IMO it should have been a prerequisite for the EIP being accepted in the first place",
        "created_at": "2021-03-03T06:16:27.734000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think it is entirely unreasonable to expect them to turn out a formal document in a matter of hours because someone showed up and said \"this isn't useful to us\".",
        "created_at": "2021-03-03T06:16:32.120000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It wasn't though.",
        "created_at": "2021-03-03T06:16:38.825000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I would engage in a debate about a process change to EIPs that had harder requirements for use cases (in \u003c#746566142700814426\u003e).  But that wasn't a requirement previously and no one expected it.",
        "created_at": "2021-03-03T06:17:10.548000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "(afk for a bit)",
        "created_at": "2021-03-03T06:17:13.928000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "I agree with \u003c@!301186049323958275\u003e that it's very unfair to raise a concern and have an EIP nuked out in 10h without most people even realizing it",
        "created_at": "2021-03-03T06:20:47.428000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "And I agree with \u003c@!683653554631868440\u003e that it's unfair to expect new documents now to prove the legitimacy of an accepted EIP. Yeah, would have been nice, for sure, but using it as a reason for removal at a time point when there's obviously no time left to produce it is ... wonky",
        "created_at": "2021-03-03T06:22:07.151000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "I kind of feel the same way as I did yesterday. We should either go ahead with the fork as planned, or we should delay until there's consensus. Agreeing between 3 people who happened to be up at the time is a bit of a weak form consensus",
        "created_at": "2021-03-03T06:24:21.205000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "tbf, Solidity doesn't have a document laying out how subroutines keeps them from possible gas cost optimizations.",
        "created_at": "2021-03-03T06:24:36.844000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "agreed",
        "created_at": "2021-03-03T06:25:24.804000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T06:26:24.533000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T06:26:52.884000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T06:27:02.418000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "it seems like the best way to get consensus is generally ACD, but the main reason for the rush is that as you mentioned - if v1.10.0 is cut then geth won't change course",
        "created_at": "2021-03-03T06:27:38.189000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "We can omit the block numbers from 1.10.0",
        "created_at": "2021-03-03T06:28:03.464000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "If we require it of one, we should require it for both if we are taking the reasoning into account.",
        "created_at": "2021-03-03T06:28:07.523000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Really we need multiple core dev calls, first to raise concerns, then time to gather answers, then a second call to present answers.",
        "created_at": "2021-03-03T06:29:10.135000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This is why changes are slow.  🙂",
        "created_at": "2021-03-03T06:29:21.181000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "Practically, We basically have today to decide, or we wait until ACD.",
        "created_at": "2021-03-03T06:29:24.720000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I am very much not compelled by the arguments against inclusion, which I feel should be very compelling at the 11th hour.",
        "created_at": "2021-03-03T06:29:58.682000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Especially with Vyper coming out saying they would value the feature.",
        "created_at": "2021-03-03T06:30:15.166000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "I don't think there is a way to optimally make this decision without significant delays. Besides going forward as planned.",
        "created_at": "2021-03-03T06:30:19.258000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "Vyper's support is a big difference for me as well.",
        "created_at": "2021-03-03T06:30:30.503000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "Solidity won't use it. Dang... could have had something useful for them, but we didn't know. Vyper can use it, cool. 🦾",
        "created_at": "2021-03-03T06:32:03.221000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "Hopefully both solidity and us learn from this.",
        "created_at": "2021-03-03T06:33:17.586000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T06:33:45.891000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "One thing we don't have is a way that formally teams can signal support of EIPs.",
        "created_at": "2021-03-03T06:35:57.218000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "My view is that the relevant parties did not properly engage in the discussion, development, and inclusion of 2315. At very little cost we can postpone 2315 until it is properly engaged with by its potential users. If we don't, we risk encumbering future changes and technical debt that will always exist.",
        "created_at": "2021-03-03T06:36:42.917000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "We already decided to implement and include it.  If Vyper now signalled support, good, one user. More may follow.",
        "created_at": "2021-03-03T06:37:03.628000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003e At very little cost\nI *suspect* this is where your and my core disagreement lies.  I think the more abstract/fuzzy costs of delay are incredibly high.  I agree that from a technical level, delaying is pretty low cost.  Update a handful of tests and prep a new release is pretty much it.  I just think that there is a whole lot of downsides on the human front like encouraging 11th hour concern trolling, discouraging future EIP authors, context switching costs, thrash, etc.",
        "created_at": "2021-03-03T06:39:05.443000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "These costs are, of course, very hard to quantify unfortunately.  😢",
        "created_at": "2021-03-03T06:39:47.078000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "I am separating the human concerns from what is best technically for the protocol",
        "created_at": "2021-03-03T06:39:54.903000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "but it appears that the geth team is in support for continuing with berlin as scheduled so i will not continue to impede it's progress, i apologize for any disruptions i have caused 🙂",
        "created_at": "2021-03-03T06:40:38.119000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "From a purely technical standpoint (ignoring all of the fuzzy stuff) I tend to agree with you that delay Berlin or cut 2315 from Berlin is \"best\".  I do think we need to consider the fuzzy stuff in decision making though, which is what tips me pretty heavily against either of those options.",
        "created_at": "2021-03-03T06:41:29.323000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "Just want to re-iterate how long Vyper has been waiting for this feature. If there are no technical issues that should prevent it's inclusion, I really don't see how another team saying it is not useful to them should be a blocker to it's inclusion.",
        "created_at": "2021-03-03T07:04:25.902000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "Also wasn't even aware of this channel where ecosystem critical decisions were happening that could change decisions we thought were accepted almost a year ago",
        "created_at": "2021-03-03T07:05:03.995000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "sorry, it is late, but I hope you get what I mean",
        "created_at": "2021-03-03T07:05:38.642000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "say what you want about Twitter, but it's the only place with near global use in our ecosystem",
        "created_at": "2021-03-03T07:06:00.505000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I don't use Twitter.  😖",
        "created_at": "2021-03-03T07:06:12.522000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "I use it for shitposting lol",
        "created_at": "2021-03-03T07:06:19.415000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I guess that is the reason for the \"near\".  😛",
        "created_at": "2021-03-03T07:06:24.204000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "but yeah, it sounds like the discussion has been resolved, and the resolution is \"no need for change, press on\"",
        "created_at": "2021-03-03T07:07:03.633000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "is that correct?",
        "created_at": "2021-03-03T07:07:12.022000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Hard to say given that not all participants in the conversation are in the same time zone.  Nethermind, for example, I believe is sleeping right now.",
        "created_at": "2021-03-03T07:07:55.653000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "If there are technical considerations that should prevent inclusion: heavy client maintaince req'd (sounds like no), security issues (sounds like no), etc. then motioning to remove it seems warranted. All I've heard thus far is \"we don't like it and won't use it\"",
        "created_at": "2021-03-03T07:09:32.268000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "which, considering it's very opt-in, doesn't seem like a good reason to axe it",
        "created_at": "2021-03-03T07:09:58.783000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "In general the reason people opposed new features is that it's easy to add something, but if it interferes later down the line, you can't easily pull it out again",
        "created_at": "2021-03-03T07:10:33.148000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "E.g. state rent: would have been a no brainer to add from start, but now it's an insane effort",
        "created_at": "2021-03-03T07:10:49.864000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "agreed",
        "created_at": "2021-03-03T07:11:04.091000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "is there a long term sustainability issue I'm not aware of though?",
        "created_at": "2021-03-03T07:11:12.861000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "it shouldn't affect state or anything",
        "created_at": "2021-03-03T07:11:21.301000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "Hah, that's the problem 😄 Noone knows the long temr adverse effects until someone hits a brick wall and attributes it to feature X",
        "created_at": "2021-03-03T07:11:43.495000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "I think the only long term effects I can see is if the feature is mis-priced, gas-wise",
        "created_at": "2021-03-03T07:12:19.932000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "otherwise, it's operation is ephemeral inside of a transaction",
        "created_at": "2021-03-03T07:12:41.714000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "By long term effect I meant that if we deploy some contract and then realize we'd need to change the behavior a bit to make it more useful",
        "created_at": "2021-03-03T07:15:30.222000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "if only that were a barrier for most EVM features 🤪",
        "created_at": "2021-03-03T07:17:32.790000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "We could discourage things, like jumping in and out of subroutines, in the name of future compatibility. If we early on say 'may be disallowed later'",
        "created_at": "2021-03-03T07:18:18.863000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "I think there's a natural discouragement, at least from a compiler writer's perspective. Like, why would I mix those two things together?",
        "created_at": "2021-03-03T07:19:04.249000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "Or say 'please do pushx, jumpsub' so it can be considered static. For future compat",
        "created_at": "2021-03-03T07:19:24.507000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "someone can randomly write something in assembly, is there an issue that could cause EVM instability? or is it just a matter of it being ugly",
        "created_at": "2021-03-03T07:19:51.917000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "We don't want to break ppls contracts. But if things are flagged early on, that isn't as big of an issue",
        "created_at": "2021-03-03T07:22:10.178000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Out of curiosity, why was jumping into subroutines allowed?  Just because it is too costly to prevent?",
        "created_at": "2021-03-03T07:22:48.907000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "sure, it's like any feature we plan to deprecate though: analyze impact, push people in the right direction, wait a long time... and then remove",
        "created_at": "2021-03-03T07:22:57.867000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "See my context-post from yesterday. Disallowing it is not trivial",
        "created_at": "2021-03-03T07:23:34.022000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "is there a denial of service issue to this?",
        "created_at": "2021-03-03T07:23:40.387000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "if not, why do I care if someone mixed the two?",
        "created_at": "2021-03-03T07:23:54.774000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "a compiler writer certainly isn't going to mix the two, at least not intentionally",
        "created_at": "2021-03-03T07:24:20.978000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "It complicates the jumpdest analysis quite a bit, adding overhead to every single exec",
        "created_at": "2021-03-03T07:24:21.646000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "does that affect computational speed in a way that could lead to a denial of service issue to the EVM?",
        "created_at": "2021-03-03T07:25:14.529000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "that's the only question that matters here",
        "created_at": "2021-03-03T07:25:21.209000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "No",
        "created_at": "2021-03-03T07:25:31.883000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "tools being unable to do the analysis... who cares, it's not going to be the common case by far",
        "created_at": "2021-03-03T07:25:45.263000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "No security issue as written.",
        "created_at": "2021-03-03T07:25:48.866000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "just some crazy bit bashers having fun with it",
        "created_at": "2021-03-03T07:25:56.680000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "most people use compilers, and compiler teams should pick one or the other basically exclusively",
        "created_at": "2021-03-03T07:26:37.083000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "There is notable value in being able to analyze contracts running on Ethereum.",
        "created_at": "2021-03-03T07:26:50.831000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "unless there is a way to mix code from different compilers into a single contract account, I don't see the issue",
        "created_at": "2021-03-03T07:27:24.502000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "There are many proposed EVM changes in the past where ewe have wanted to evaluate their impact to existing contracts and being able to *easily* analyze existing contract behavior would have greatly helped with that.",
        "created_at": "2021-03-03T07:27:24.891000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "There are 3 types of contracts:\n1. Those written in Solidity (not using subroutines)\n2. Those written in Vyper (using subroutines)\n3. Those written by hand by some crazy person.",
        "created_at": "2021-03-03T07:28:07.431000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "oh, are you basically selling me on the nice parts of subroutines? because I am completely sold 😄",
        "created_at": "2021-03-03T07:28:10.121000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The more contracts we can catch in whole-blockchain analysis the better.",
        "created_at": "2021-03-03T07:28:19.291000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "I would argue that 3. (crazy people) is in the vast minority, and very unlikely to be of consequence",
        "created_at": "2021-03-03T07:28:46.404000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Which is why I am in favor of eventually removing dynamic jump instructions.",
        "created_at": "2021-03-03T07:28:48.752000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The desire for immutability makes negatively impacting those people still potentially harmful to Ethereum ecosystem.",
        "created_at": "2021-03-03T07:29:12.529000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "That is, people have an expectation that a contract written today will keep working in a year or 5 years or whatever.",
        "created_at": "2021-03-03T07:29:28.986000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "how do you feel about deprecating gas tokens? lol",
        "created_at": "2021-03-03T07:29:41.583000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We do not live in an ideal world.  😄",
        "created_at": "2021-03-03T07:29:54.549000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "nope",
        "created_at": "2021-03-03T07:29:58.458000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "None the less, I think we should strive to get to a place where we can minimize damage of changes.",
        "created_at": "2021-03-03T07:30:09+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "I think we all agree that most will use one of the two styles, and no compiler will be mixing styles",
        "created_at": "2021-03-03T07:30:23.754000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Users of Solidity can write assembly (and many do).",
        "created_at": "2021-03-03T07:30:40.014000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "we can say that any use of them mixed is entirely experimental and likely to be rugged over time",
        "created_at": "2021-03-03T07:30:42.580000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I don't like enshrining Solidity/Vyper, or their current patterns, forever.",
        "created_at": "2021-03-03T07:31:02.535000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "also ditto",
        "created_at": "2021-03-03T07:31:11.916000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "logically though, I don't see a good reason to mix the styles together",
        "created_at": "2021-03-03T07:31:35.733000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Is the plan for Vyper to *only* use subroutines for internal calls?",
        "created_at": "2021-03-03T07:31:58.571000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "therefore we can consider that (in most cases) there will only be two styles",
        "created_at": "2021-03-03T07:32:03.835000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "yes",
        "created_at": "2021-03-03T07:32:08.442000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "And (after Berlin) only use jumps for conditionals and switches?",
        "created_at": "2021-03-03T07:32:09.465000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "I think so",
        "created_at": "2021-03-03T07:32:38.635000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "honestly we've just been waiting for the feature, thinking it would never come due to the history of it",
        "created_at": "2021-03-03T07:32:54.212000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "we were happy and surprised to hear it coming in Berlin",
        "created_at": "2021-03-03T07:33:12.879000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "I can't say I was surprised to hear people wanted to remove it for the sake of removing it",
        "created_at": "2021-03-03T07:33:31.124000+00:00",
        "attachments": null
    },
    {
        "author": "hudsonjameson",
        "category": "general",
        "parent": "",
        "content": "My opinion has now changed due to the Vyper team coming forward and saying they would use it. This type of EIP is very niche already so if we have one of the few EVM HLLs saying they want it I say go for it.",
        "created_at": "2021-03-03T07:39:34.470000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "general",
        "parent": "",
        "content": "main reason for late removal was that we couldn't find who will benefit from subrutines after solidity devs said they dont need it, with vyper in mix i dont see reason for removal.",
        "created_at": "2021-03-03T07:40:15.451000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Finally reviewing the EIP since it was *just* moved to Review... I'm sad that `JUMPSUB` still gets the destination off the stack.  😢",
        "created_at": "2021-03-03T07:44:07.874000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Rather than the instruction being `JUMPSUB \u003clocation\u003e`.",
        "created_at": "2021-03-03T07:44:28.998000+00:00",
        "attachments": null
    },
    {
        "author": "chriseth8375",
        "category": "general",
        "parent": "",
        "content": "A small defense for why I only again voiced my opinion this late: I was not aware that 2315 was scheduled for inclusion in Berlin. As \u003c@301186049323958275\u003e says, the issue said \"draft\" until yesterday, that is what I mainly looked at. Also I could not find a clear list of all EIPs scheduled for Berlin either.",
        "created_at": "2021-03-03T08:05:45.075000+00:00",
        "attachments": null
    },
    {
        "author": "chriseth8375",
        "category": "general",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e it would be nice to have a small workshop about the benefits of removing static jumps.",
        "created_at": "2021-03-03T08:06:26.293000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003c@456226577798135808\u003e has more specific and direct experience, so I would defer to him.  My experience with working with bytecode is from... a long time ago.  😬",
        "created_at": "2021-03-03T08:08:00.004000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "There was definitely a failure of process regarding the fact that it is still DRAFT, and going forward I believe the plan is to push authors to move to `Review` before bringing it to Core Devs.",
        "created_at": "2021-03-03T08:08:39.640000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Oh, I didn't notice that. This does not sound ideal. I assume it has been done not to introduce more opcodes larger than 1 byte, but this may actually make less useful later, even if all other parts arrive.",
        "created_at": "2021-03-03T08:18:18.230000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I think this is probably a compromise gone a bit too far",
        "created_at": "2021-03-03T08:18:39.495000+00:00",
        "attachments": null
    },
    {
        "author": "chriseth8375",
        "category": "general",
        "parent": "",
        "content": "The EIP is a big change to the EVM that cannot be undone easily and to me it looks like it has not been properly analyzed. I know it has been years, but \u003c@!659892951006183425\u003e does the vyper team already have code that uses it and did it encounter any problems?",
        "created_at": "2021-03-03T08:20:32.120000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "My story about this EIP-2315 and EIP-615 is this. At the point when I was looking at EIP-615 I was in support, but then I did not know what I know now about static analysis, and I could only trust that \"it is going to be good\". Then I got interested in static analysis and got some help from \u003c@!709470782035722310\u003e (he did the implementation of abstract interpretation to prove that 97% deployed contracts never do invalid jumps, something which I remember \u003c@!683653554631868440\u003e thought was not going to work, but I believed it would). At the same time I saw EIP-2315 moving in, and I felt like it is all moving too fast, and I am still learning, and experts aren't what they seem to be. So it is sad that critique comes that late, but unfortunately we do not really have a lot of people around who can tell about how static analysis will be done in the future. Now we are getting closer to that knowledge, but EIPs is already done, and I feel \"ah, ok, they've done it, fair enough, I am too late again with my learning\"",
        "created_at": "2021-03-03T08:25:10.618000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "That is also my feeling with making turbo-geth - trying to catch up and complete it, while Ethereum is changing. I often think: \"Can we just stop changing EVM for a bit so we can finally catch up?\" 🙂",
        "created_at": "2021-03-03T08:26:17.089000+00:00",
        "attachments": null
    },
    {
        "author": "chriseth8375",
        "category": "general",
        "parent": "",
        "content": "Ah, if I remember correctly then Vyper does not have an optimizer, so you just plug in the opcode and don't run additional analysis on the bytecode, so all of the (potential) properties/restrictions of the opcode (disallow jump over, disallow flowing in etc) are not a problem, right?",
        "created_at": "2021-03-03T08:26:41.477000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I don't believe the EIP disallows jumps into the middle of a subroutine.  It does disallow flowing in.",
        "created_at": "2021-03-03T08:27:22.119000+00:00",
        "attachments": null
    },
    {
        "author": "chriseth8375",
        "category": "general",
        "parent": "",
        "content": "Yes, that's why I said \"potential properties\"",
        "created_at": "2021-03-03T08:27:42.235000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I don't think there is a great solution.  If Ethereum calcifies, eventually new technology will surpass it by *enough* that people move off of Ethereum.  If Ethereum changes too much/too rapidly, it won't ever provide the stability some people want.",
        "created_at": "2021-03-03T08:29:31.282000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "It is not a solution, it is my feeling 🙂",
        "created_at": "2021-03-03T08:30:00.228000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I believe this is essentially why programming languages and various software projects all tend to have a lifetime.  You cannot both offer stability while at the same time offering progress.",
        "created_at": "2021-03-03T08:30:02.274000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I am just saying it is hard to actually to a lot of work and be aware of everything else, even if that everything else is EIPs for the next hard fork",
        "created_at": "2021-03-03T08:30:51.835000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I have a tiny hope in the back of my mind that maybe we can achieve something of both via sharding, where we iteratively build new things on new shards.",
        "created_at": "2021-03-03T08:30:59.166000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "this is in defence of Solidity team when people say \"where have you been before?\"",
        "created_at": "2021-03-03T08:31:10.830000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Oh, yeah.  I totally get the problem of attention.  I don't actually *build* anything, I just \"follow along\" with as much as I can and I probably spend over 40 hours a week on *just that*.",
        "created_at": "2021-03-03T08:31:48.429000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If I had to actually *produce* output at the same time I would no longer be able to follow along.",
        "created_at": "2021-03-03T08:32:02.168000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "In a traditional company, this problem would be solved by project managers, liaisons, team leads, architects, etc.  Basically, throw people at the problem and organize them in a specific way.",
        "created_at": "2021-03-03T08:32:44.397000+00:00",
        "attachments": null
    },
    {
        "author": "chriseth8375",
        "category": "general",
        "parent": "",
        "content": "We spent most of the past 1-2 years getting ready for potentially compiling to webassembly because at some point there was the feeling that this was the future EVM. Fortunately, we found a way to make this also very useful without webassembly.",
        "created_at": "2021-03-03T08:32:48.162000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "e.g., Solidity team would have one full time person who doesn't actually produce anything, they just follow-along with what everyone is doing and feeds back useful information to Solidity team.",
        "created_at": "2021-03-03T08:33:10.779000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Like even talking about this EIP yesterday and today probably delayed turbo-geth beta for couple days 😦",
        "created_at": "2021-03-03T08:33:41.311000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Human coordination is hard.  Our 🤖 overlords cannot come soon enough.",
        "created_at": "2021-03-03T08:34:10.891000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "of course, because you're waiting for our release 😄 😄 😄",
        "created_at": "2021-03-03T08:34:18.032000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "just messing with ya'",
        "created_at": "2021-03-03T08:34:28.560000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Ha-ha. when we are finished with beta, I hope not to write much code anymore, and have other team members do it, then perhaps I can spend more time with you on EIPs",
        "created_at": "2021-03-03T08:36:03.349000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I do not wish that ill fate on even my worst enemy.",
        "created_at": "2021-03-03T08:36:43.605000+00:00",
        "attachments": null
    },
    {
        "author": "tkstanczak",
        "category": "general",
        "parent": "",
        "content": "for me the Vyper team comment closes the entire debate",
        "created_at": "2021-03-03T08:48:18.485000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Given \u003c@!301186049323958275\u003e comment about `JUMPSUB` destination coming from the stack, I think EIP-2315 is going to be less useful for static analysis in the future than I thought yesterday. Because the fact that it takes destination from the stack still means that we cannot do 100% sound analysis even if other things are in place and `JUMP` and `JUMPI` are disallowed. In the current form `JUMPSUB` is also a dynamic jump",
        "created_at": "2021-03-03T08:49:31.284000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Perhaps this problem did not exist in EIP-615, but it might have been introduced during the simplification and adaptation",
        "created_at": "2021-03-03T08:50:11.987000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003c@683653554631868440\u003e probably knows the reasoning for making `JUMPSUB` take its address off the stack rather than as part of the opcode.",
        "created_at": "2021-03-03T08:50:38.986000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "At the least, it has a limited number of landing points, which is better than the current situation.",
        "created_at": "2021-03-03T08:51:04.185000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "However, I can appreciate how that may not help in some cases.",
        "created_at": "2021-03-03T08:51:17.404000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "I don't think this is the time to open up the internals of the EIP for debate",
        "created_at": "2021-03-03T08:52:05.178000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The *hope* would be that any language who implements subroutines would always do so via:\n```\nPUSH \u003clocation\u003e\nJUMPSUB\n``` (which we can notice and analyze)",
        "created_at": "2021-03-03T08:52:08.822000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I *think* it is more just lamenting.",
        "created_at": "2021-03-03T08:52:19.985000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "One of the reasons EIPs now (new thing) have a Review state is to hopefully help make it more clear that \"now is the time to look at this change\", before it is too late.",
        "created_at": "2021-03-03T08:53:13.892000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Perhaps not, but now I think the fate of these opcodes will be just use in Vyper for delineating inter-contract calls, I am afraid",
        "created_at": "2021-03-03T08:53:35.993000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "2315 and 615 were from a time before the Review state unfortunately.",
        "created_at": "2021-03-03T08:53:40.855000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "and also, if we do want to go to disallowing dynamic jumps, `JUMPSUB` will need to be disallowed too",
        "created_at": "2021-03-03T08:55:59.222000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "so we will have to introduce replacement for it anyway",
        "created_at": "2021-03-03T08:56:10.553000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I am fine with all that, BTW",
        "created_at": "2021-03-03T08:56:16.664000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "and unfortunately, the EIP has been accepted before I had the knowledge to say these things 😦",
        "created_at": "2021-03-03T08:56:44.315000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "so I do not suggest you open it up, necessarily, but providing extra input, if it is at all useful",
        "created_at": "2021-03-03T08:57:11.843000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I believe this is the story of every engineers life.  😄",
        "created_at": "2021-03-03T08:57:59.764000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\"If only I had been wiser back then, I would have written it differently or advocated harder, etc.\"",
        "created_at": "2021-03-03T08:58:20.613000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It is just somewhat rare when you \"learn\" enough *just* before a thing goes live so you have to watch it happen before your eyes.  😛",
        "created_at": "2021-03-03T08:58:44.811000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "well, actually if this EIP does go in with the current form and Vyper does start generating code using these opcodes, it becomes LESS likely we will ever switch to no-dynamic jumps",
        "created_at": "2021-03-03T08:59:50.922000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "if this is indeed the goal (switching to no-dynamic jumps), then the EIP does need to be modified and reworked",
        "created_at": "2021-03-03T09:00:19.953000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "In my mind, it doesn't impact that end goal significantly.  At worst it would be 3 more opcodes we have to deprecate when the time comes.  At best, *all* `JUMPSUB` calls on mainnet will be preceded by `PUSH \u003cconstant\u003e` and we can just say that this is a weirdly shaped opcode and enshrine the pattern as a hard requirement.  😬",
        "created_at": "2021-03-03T09:01:11.275000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Well, this is when I said it won't be 100% sound. We will still need to assume that some hand-crafted contracts may compute the jump destination",
        "created_at": "2021-03-03T09:02:08.192000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "anyway, I am disengaging",
        "created_at": "2021-03-03T09:02:17.200000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "We've decided to release Geth v1.10.0 **without** any fork block set for Berlin",
        "created_at": "2021-03-03T10:06:05.266000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "And will release 1.10.1 on Monday morning with whatever is decided",
        "created_at": "2021-03-03T10:06:16.411000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "That way we can have an ACD call to finalize the decision and not screw with people sleeping",
        "created_at": "2021-03-03T10:06:37.535000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "This way there should not be the pressure from our team that we want a release NOW",
        "created_at": "2021-03-03T10:07:16.684000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "But I do want us to decide until Friday evening",
        "created_at": "2021-03-03T10:07:32.395000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "That's a very simplistic way to put it. Client teams also wrote reasons why removing it in case of no users would make sense all the way up the thread, in case you didn't care to read it.",
        "created_at": "2021-03-03T10:30:02.839000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "If it's useful for Vyper it makes sense to have it, imo.",
        "created_at": "2021-03-03T10:32:19.293000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "And fwiw, similarly to \"Solidity didn't raise concerns earlier\", it also looked like most people (at least here) were not aware that this would be useful for Vyper.",
        "created_at": "2021-03-03T10:34:11.433000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "While I agree that both Solidity and Vyper should have been more involved, I also think they should have been asked to do so.",
        "created_at": "2021-03-03T10:35:13.852000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "Just one more thing for the record: Solidity members *did* raise concerns on the magicians thread, and never expressed support. I was aware that EIPs usually need a champion, but following the thread I don't see tools or users claiming to benefit from it, so why is it expected that it should also have an anti-champion?",
        "created_at": "2021-03-03T10:52:15.417000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "I was aware - I asked in the eth security telegram channel, way back, and \u003c@659892951006183425\u003e answered back then that Vyper would use/want it. I reported that to some acd meeting also. So for the record, we did reach out to see if there was any support for it (which there was). I was however not aware if the answer from way back then was still the same - but it seems so",
        "created_at": "2021-03-03T11:04:35.318000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "Right. I'm not questioning that there was support, but only stating that that information was not publicly available persistently, which I think is what caused many people here to question whether there was support.",
        "created_at": "2021-03-03T11:20:56.470000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e  The reason that JUMPSUB _has_ to take it's destination from the stack is that EVM instructions cannot take immediate data as arguments without breaking compatibility.  This was discovered during the EIP-615 work - by \u003c@273818081439121408\u003e I believe - and is why EIP-615 requires EVM versioning.",
        "created_at": "2021-03-03T11:48:32.654000+00:00",
        "attachments": null
    },
    {
        "author": "chriseth8375",
        "category": "general",
        "parent": "",
        "content": "agree",
        "created_at": "2021-03-03T11:56:46.272000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I have been personally aware of the support of \u003c@!659892951006183425\u003e, Wei Tang, and others for years now, and Wei Tang was quite active in the EIP-615 discussions, especially around versioning considerations.\n\nEIP-2315 I discussed at length with Wei Tang at EthDenver.  He has written an LLVM to EVM translator that opens up the EVM as target assembly language for literally any language that compiles to LLVM.  I just asked The Google, which replied that those include \"Ada, C, C++, D, Delphi, Fortran, Haskell, Julia, Objective-C, Rust, and Swift.\"  I'm aware of others.\n\nI discussed EIP-615 with \u003c@!659892951006183425\u003e in Prague, and EIP-2315 at various times since.\n\nThere is no good place in a technical document for this sort of knowledge, but is the sort of background of support that led me to continue work on EIP-2315 despite the fate of EIP-615.",
        "created_at": "2021-03-03T12:07:11.669000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "The discussion of dynamic jumps I think is a red herring.  EIP-2315 can't fix that problem, and is not intended to and does not claim to fix that problem.  But at least is a step towards a solution.  I don't think it makes the problem worse.",
        "created_at": "2021-03-03T12:10:37.869000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003e 3. Those written by hand by some crazy person.\nThere are such people.  They tend to be deeply concerned about performance or security.  The may need to prove the security properties of a program _at the level of the bytecode_,\nhttps://www.google.com/search?q=evm+bytecode+security\u0026oq=evm+bytecode+security\u0026aqs=chrome..69i57.9519j0j4\u0026sourceid=chrome\u0026ie=UTF-8\nor achieve performance than a compiler cannot achieve.\nhttps://medium.com/aztec-protocol/from-zero-to-nowhere-smart-contract-programming-in-huff-1-2-ba2b6de7fa83",
        "created_at": "2021-03-03T12:14:42.325000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "On complexity and technical debt:\n\nThe entire specification of this feature is 21 English sentences.  It could be reduced to 14 sentences by removing some commentary.  The remaining technical content of the proposal is detailed test cases.",
        "created_at": "2021-03-03T12:23:48.842000+00:00",
        "attachments": null
    },
    {
        "author": "chriseth8375",
        "category": "general",
        "parent": "",
        "content": "\u003c@!683653554631868440\u003e are you saying EIP-2315 is a requirement for being able to compile llvm to evm?",
        "created_at": "2021-03-03T12:23:55.882000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Not at all.",
        "created_at": "2021-03-03T12:24:04.765000+00:00",
        "attachments": null
    },
    {
        "author": "chriseth8375",
        "category": "general",
        "parent": "",
        "content": "why did you bring it up then?",
        "created_at": "2021-03-03T12:24:24.911000+00:00",
        "attachments": null
    },
    {
        "author": "chriseth8375",
        "category": "general",
        "parent": "",
        "content": "I mean how is it relevant to the eip-2315 discussion?",
        "created_at": "2021-03-03T12:24:57.830000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I was asked for examples of support for the proposal.",
        "created_at": "2021-03-03T12:25:27.106000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Is the removal of EIP-2315 a requirement for being able to compile Solidity to EVM?",
        "created_at": "2021-03-03T12:26:32.869000+00:00",
        "attachments": null
    },
    {
        "author": "chriseth8375",
        "category": "general",
        "parent": "",
        "content": "no, but a simple EVM is a goal of Ethereum",
        "created_at": "2021-03-03T12:26:59.082000+00:00",
        "attachments": null
    },
    {
        "author": "chriseth8375",
        "category": "general",
        "parent": "",
        "content": "would the llvm-\u003eevm compilation pipeline use eip-2315?",
        "created_at": "2021-03-03T12:27:13.707000+00:00",
        "attachments": null
    },
    {
        "author": "chriseth8375",
        "category": "general",
        "parent": "",
        "content": "I just want to know in which way people who support the proposal would make actual use of it",
        "created_at": "2021-03-03T12:27:29.095000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Last I spoke to Wei Tang, yes.  Over the year since we accepted it, no.",
        "created_at": "2021-03-03T12:27:57.723000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I think it is not right to keep appealing to \"we accepted it\". We should not be the prisoners of our past decisions, if we discover new truths. Ethereum lives through the code and people who run the code, the process is there to help coordinate, not to constrain",
        "created_at": "2021-03-03T12:30:12.665000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I think it is right to appeal to \"follow through on announced decisions.\"  Especially at such a late stage in the process.",
        "created_at": "2021-03-03T12:31:52.187000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "it does not really matter if it is late in the process or not. Process is there to help guide people to the decisions, but not to enforce those decisions. We can always intervene. Code is not law, and the process is not law. Things can and will change, as frustrating as it may be",
        "created_at": "2021-03-03T12:35:18.269000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Sigh.  Process exists to avoid this sort of last-minute chaos.",
        "created_at": "2021-03-03T12:36:50.314000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I don't actually see this as chaos at all",
        "created_at": "2021-03-03T12:37:12.394000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "this is what it is all about - Ethereum lives through these things",
        "created_at": "2021-03-03T12:37:27.466000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I do.  I have work to do.  For you.  Re-engaging in discussions that we finished long ago is a waste of my time and others.  The only new thing here is that Solidity has decided not to use these instructions.  Fine.  So don't use them.",
        "created_at": "2021-03-03T12:39:13.693000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I think enough has been said here and I am not looking into re-engaging you into this. I understand your point of view, and we will have chance to talk about it later. It is good that people who did not pay attention to this now do pay attention, so I see this all as positive development",
        "created_at": "2021-03-03T12:41:51.307000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I'll grant that much yes.  If people have learned from this that is good.  But I've lost time and sleep.",
        "created_at": "2021-03-03T12:46:09.235000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Sorry to hear that. I would agree that the process is supposed to stop last minute interventions, but only if such interventions are bogus and are designed to frustrate the overall development of Ethereum. I do not see so far that there is such intent, so the process should oblige and get out of the way of discussion",
        "created_at": "2021-03-03T12:50:51.098000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It is a very fuzzy line between concern trolling and legitimate.  I suspect this was a case of legitimate concern, but I only say that because I have interacted extensively with those who expressed the concern.  Had I not (e.g., a stranger brought up the concern), I likely would have interpreted the situation differently given the *exact* same debate.",
        "created_at": "2021-03-03T12:55:03.900000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "For me it's that the objection seems weak and arrived very late (announced feature that everyone is ready to ship) from people who participated in the crafting of the proposal all along.  They had plenty of opportunity to object more constructively much earlier.",
        "created_at": "2021-03-03T13:03:14.709000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "What about the objections that *were* made?",
        "created_at": "2021-03-03T13:06:19.736000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "I disagree that the burden is on the people that \"should have objected more\"",
        "created_at": "2021-03-03T13:07:39.010000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "See https://discord.com/channels/595666850260713488/745077610685661265/816553067880775742",
        "created_at": "2021-03-03T13:08:27.143000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e I'm not suggesting to remove it. But saying \"those people should have objected earlier\" is weak, if the behavior is this dogmatic",
        "created_at": "2021-03-03T13:10:31.812000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "After years of discussion?",
        "created_at": "2021-03-03T13:11:23.127000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "Those people *did* object earlier, and were clearly not aware that it was selected for Berlin, otherwise they would have objected again, which they *did* when they found out",
        "created_at": "2021-03-03T13:12:33.646000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "It was slotted for Berlin almost a year ago.",
        "created_at": "2021-03-03T13:12:58.585000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "And their objections were discussed at length at the time, and accommodated to the extent the authors believed possible.",
        "created_at": "2021-03-03T13:14:26.603000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "It is not clear in the magicians thread, where the discussion happened, neither in the EIP page (it says \"draft\") that it was slotted for Berlin. So you expect everyone who could *possibly* have concerns about an EIP to attend all calls or guess the timing it gets slotted? Not everyone who could contribute to an EIP discussion follows all ACD development. That's what I meant with the anti-champion.",
        "created_at": "2021-03-03T13:19:38.640000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "It was clearly published in the Agenda of the ACD meetings.  And until fairly recently recently all Core EIPs remained in Draft status - subject to change - until they were actually deployed on the mainnet.",
        "created_at": "2021-03-03T13:22:18.016000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "Not everyone that might be relevant for an EIP follows the agenda of the ACD meetings, and I don't think they have to, as you seem to be suggesting. For example, we haven't heard from anyone (afaik after reading the thread here and magicians) that works on debuggers, static analyzers and similar tools. IMHO it would be very important to hear their opinion on it. Maybe they were not interested, maybe unaware. Would you expect all of them to just show up instead of being asked?",
        "created_at": "2021-03-03T13:25:28.938000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "If you want to contribute to the Core Devs process then yes, I think you should have some awareness of the process.  In this case those objecting are active participants.  I've personally spoken with a number of people doing debuggers, analyzers, and such, and am aware of that literature.  I would not expect them all to to show up, or that I should curate a list of supporters of the EIP.   I certainly object to being asked to do that at this late date.  I had good reason to think my work as an author was done.",
        "created_at": "2021-03-03T13:32:29.817000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "I agree with your last 2 sentences.",
        "created_at": "2021-03-03T13:33:21.372000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "I have not participated before, but wouldn't \"collecting supporters/users\" make sense as part of championing the EIP?",
        "created_at": "2021-03-03T13:34:48.284000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "At this point I assume it happened during calls, but it would be great if that was also documented in the magicians thread.",
        "created_at": "2021-03-03T13:35:11.741000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "It's a technical proposal, not a political one.",
        "created_at": "2021-03-03T13:35:20.728000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "It would have avoided *a lot* of messages early in this thread.",
        "created_at": "2021-03-03T13:35:29.567000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "Studying who would benefit from your technical proposal is not political at all, it's an obvious thing to do, and it is technical.",
        "created_at": "2021-03-03T13:36:01.519000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I have done that study.",
        "created_at": "2021-03-03T13:36:12.882000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "I believe you. It is however not documented in the thread and I think that's what caused a lot of confusion.",
        "created_at": "2021-03-03T13:36:33.960000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "The main question early in the thread seemed to be \"who wants it?\" and it would be trivial to answer that if the users were clear in the thread.",
        "created_at": "2021-03-03T13:37:09.515000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "Asking \"who wants it?\" does not necessarily imply the person doesn't think there are no users, they are looking for information.",
        "created_at": "2021-03-03T13:37:49.365000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "Refusing to give that information on the basis of \"it was accepted already\" only makes it worse.",
        "created_at": "2021-03-03T13:38:18.331000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Understood.  I prefer that technical proposals be brief and to the point.  And I find it surprising that primitives for subroutine call and return are at all controversial, and that their utility is not obvious.  So I didn't take time to belabor the point in the proposal.  And I did answer \"Who wants it\", though taken aback at first.",
        "created_at": "2021-03-03T13:39:30.786000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "Let's face the reality: the LLVM -\u003e EVM compilation will never happen. Let's move on.",
        "created_at": "2021-03-03T13:43:41.054000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "OK.  Move where?",
        "created_at": "2021-03-03T13:49:08.249000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003c@!659892951006183425\u003e",
        "created_at": "2021-03-03T13:49:33.594000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I definitely don't think you should have put that information in the EIP itself.  🙂  Maybe into supplementary material like the discussions-to if you think it is valuable.",
        "created_at": "2021-03-03T13:56:04.495000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "For sure not on the EIP itself, but the magicians thread could have been a good place.",
        "created_at": "2021-03-03T13:56:40.856000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I don't think that all EIPs necessarily require someone go out and find users.  If someone asks, then sure, go and find them, but such a question (if not immediately obvious to the reader) should be asked much earlier in the process than after fork blocks are set for it.",
        "created_at": "2021-03-03T13:58:42.993000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "On the purely technical side though, https://ethereum-magicians.org/t/eip-2315-simple-subroutines-for-the-evm/3941/87 shows that gas savings are not actually clear, and https://ethereum-magicians.org/t/eip-2315-simple-subroutines-for-the-evm/3941/86 shows that it's slower even without using the subroutines. So I also agree with \u003c@!273818081439121408\u003e and do not find it clear why the EIP is desired.",
        "created_at": "2021-03-03T13:59:04.574000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "There are many EIPs that are \"obvious wins\" to the core developers and thus don't need someone to waste time checking boxes.",
        "created_at": "2021-03-03T13:59:07.882000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e please see the links I just pasted. That's not obvious to me, and I don't see how it could have been obvious when it was accepted.",
        "created_at": "2021-03-03T13:59:36.574000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "That is totally fine, and I think it would be very reasonable for you (or someone else) to request a user story... just not at the 11th hour.",
        "created_at": "2021-03-03T14:00:08.110000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "I agree.",
        "created_at": "2021-03-03T14:00:25.898000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "But how was it accepted without any user tests on the subroutines? I agree that the tests are late, but still...",
        "created_at": "2021-03-03T14:00:55.876000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "From what I have gathered, there *are* users, they just aren't documented/recorded anywhere because it wasn't something that was requested until ~20 hours ago.",
        "created_at": "2021-03-03T14:01:30.100000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "You can say the objection is very late, but it's *definitely* not weak.",
        "created_at": "2021-03-03T14:01:50.947000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "That leads me to believe that no one who read the EIP (or implemented it!) cared to see that information.",
        "created_at": "2021-03-03T14:01:51.007000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The objection is just \"we wouldn't use it\".  Not all EIPs need to benefit everyone.  🙂",
        "created_at": "2021-03-03T14:02:03.415000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "It's clearly making the EVM worse.",
        "created_at": "2021-03-03T14:02:13.403000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "Even if you *don't* use it.",
        "created_at": "2021-03-03T14:02:25.099000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Because it consumes 3 opcodes that some people won't use?",
        "created_at": "2021-03-03T14:02:27.425000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "See the tests in the second link.",
        "created_at": "2021-03-03T14:02:34.569000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "(not ran by me, I'm just interpreting the results)",
        "created_at": "2021-03-03T14:03:14.771000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I believe that is comparing two implementations of a particular pattern, one with subroutines and one without.  If you don't use subroutines you won't be impacted.",
        "created_at": "2021-03-03T14:03:22.640000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "And someone who does use subroutines may be willing to pay the increased cost.",
        "created_at": "2021-03-03T14:03:32.545000+00:00",
        "attachments": null
    },
    {
        "author": "chriseth8375",
        "category": "general",
        "parent": "",
        "content": "If you read the magicians thread at https://ethereum-magicians.org/t/eip-2315-simple-subroutines-for-the-evm/3941/20  then questions about its usefulness are all over the place and never properly answered.",
        "created_at": "2021-03-03T14:03:48.698000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "There are arguments against pretty much *every* EIP that *anyone* makes.  Ultimately, it is up to the core devs to decide whether they want to include an EIP or not in their clients.  They each have a different process for making that decision, but they are the \"filter\".  If this EIP is purely negative, then the question should be posed to each client dev team why they would agree to spend time/resources to implement an EIP that was so obviously bad.",
        "created_at": "2021-03-03T14:05:27.992000+00:00",
        "attachments": null
    },
    {
        "author": "chriseth8375",
        "category": "general",
        "parent": "",
        "content": "I'm totally fine with the decisions made by the core dev teams, I'm not fine with people saying that we only voiced our concerns at the 11th hour",
        "created_at": "2021-03-03T14:06:09.428000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "It wasn't obvious, no one said that. But the discussions and tests do point to that",
        "created_at": "2021-03-03T14:06:11.024000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Ok current statement - \"Over the last 50 years the author has studied the science of and mathematics of machine design and program structure and found that primitives for subroutines are a common, useful, and near-universal feature of programming languages and machines.  Upon beginning work at Ethereum in 2015 I was surprised to find these primitives missing from the EVM and set out to provide them.  Along the way I found support from people too numerous to list here -but count Bob Summerwill, Boris Mann, Brooklyn Zelenka, and Bryant Eisenbach among them.\"",
        "created_at": "2021-03-03T14:06:30.468000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "Hell no. It runs bytecode without subroutines before and after. The overhead is coming from increased analysis work and probably due to increased memory allocation and increased EVM code size.",
        "created_at": "2021-03-03T14:06:53.561000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "So acceptance by authority?",
        "created_at": "2021-03-03T14:06:53.758000+00:00",
        "attachments": null
    },
    {
        "author": "daniel.kirchner",
        "category": "general",
        "parent": "",
        "content": "I just want to say: The point I was trying to make was never more than that *if* the acceptence of the EIP *was* primarily based on the idea of solidity surely using it\nand it obviously saving gas, that that is a problem, because neither of those are de facto the case. And there was little in the documented discussion that pointed elsewhere.",
        "created_at": "2021-03-03T14:06:58.833000+00:00",
        "attachments": null
    },
    {
        "author": "chriseth8375",
        "category": "general",
        "parent": "",
        "content": "I think at this point in time, all concerned parties stated their opinion and it's for the client devs to decide. I hope that this will lead us to an improved EIP process. What I'm worried about is that this leads to a path towards 615 without having properly discussed what the actual goals are (\"other machines have done it since the 70ies\" is not a goal) and if these are worth the cost, risk and effort.",
        "created_at": "2021-03-03T14:09:46.081000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Thinking on this comment, I believe my complaint is more with the core devs for *considering* removal at the 11th hour because they just noticed someone saying \"I won't use this\" at the 11th hour.  While I am not one to be a slave to process, I do think that someone saying \"I won't use this\" at the 11th hour shouldn't be enough to halt our launch schedule and introduce as much thrash as we allowed to be introduced here.",
        "created_at": "2021-03-03T14:10:08.410000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003c@!425274498732916736\u003e Thanks for the results.  It will take some time to even look at them much. It's busy here, and I'm on my first cup of coffee 😉  Do you think these results are final, or that performance can be improved with further work?  Also, do these compare a representative set of programs written with and without the use of these primitives?",
        "created_at": "2021-03-03T14:10:12.344000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "To some extent, yes.  Just as I lean on the expertise of other core devs in their own domains.",
        "created_at": "2021-03-03T14:14:33.494000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "I very much resonate with this",
        "created_at": "2021-03-03T14:14:34.997000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I'm a little surprised by this.  What is the additional analysis being done during execution?",
        "created_at": "2021-03-03T14:17:06.737000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Though, perhaps I'm still misunderstanding the benchmark?",
        "created_at": "2021-03-03T14:18:08.402000+00:00",
        "attachments": null
    },
    {
        "author": "yperbasis",
        "category": "general",
        "parent": "",
        "content": "The additional analysis is to check that JUMPSUB is to BEGINSUB (since JUMPSUB is dynamic).",
        "created_at": "2021-03-03T14:19:13.752000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "But that only crops up if you are *using* JUMPSUB.  It shouldn't affect any code that doesn't use the feature.  My understanding from https://discord.com/channels/595666850260713488/745077610685661265/816672988720136212 was that the benchmark was of the same code run on an EVM both with and without this feature added, but no change in the bytecode (meaning no usage of JUMPSUB).",
        "created_at": "2021-03-03T14:19:42.797000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Had a brief look.  Less than 2% slower in initial tests of our fastest interpreter.",
        "created_at": "2021-03-03T14:22:14.108000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "I don't want to say the performance is totally fucked up. That's why it didn't put any interpretation of the results there. But there is definitely some additional work EVM has to do so the cost will not be 0.",
        "created_at": "2021-03-03T14:22:56.026000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "What is that additional work (for bytecode that doesn't use JUMPSUB)?",
        "created_at": "2021-03-03T14:23:45.062000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "\"Is this opcode BEGINSUB or not?\"",
        "created_at": "2021-03-03T14:23:48.291000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Why does it need to do that?",
        "created_at": "2021-03-03T14:23:57.383000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "`BEGINSUB` should just be treated equal to an invalid instruction when executing code normally.",
        "created_at": "2021-03-03T14:24:22.320000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "Because you are only allowed to jumpsub to BEGINSUB.",
        "created_at": "2021-03-03T14:24:25.257000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "It looks like adding any opcodes increase memory footprint and slow things down.  And any opcodes that require jumpdest-like analysis slow things down.",
        "created_at": "2021-03-03T14:24:29.821000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "general",
        "parent": "",
        "content": "Yes but then it should only be checked ~~during jumps~~, not all the time. Shouldn't the overhead be the same as adding any new opcode?",
        "created_at": "2021-03-03T14:24:43.733000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The only time you should actually care is if you are doing a `JUMPSUB`.  The rest of the time it is just an INVALID.",
        "created_at": "2021-03-03T14:24:51.595000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Not even during jumps.  It can be treated as an invalid opcode (exactly like before) in all cases *except* a `JUMPSUB`.",
        "created_at": "2021-03-03T14:25:24.387000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "It's a trade off - check up front and the calls go faster.  Check later and the calls go slower.",
        "created_at": "2021-03-03T14:25:31.382000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Checking first feels like a bad strategy since it is a programming error to land on a `BEGINSUB`, so should never happen in production.  Since you'll be failing (and IIRC burning all gas, but maybe we changed that) anyway, why waste the effort checking?",
        "created_at": "2021-03-03T14:26:42.554000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I'll leave it to \u003c@!425274498732916736\u003e to explain how his interpreter works.",
        "created_at": "2021-03-03T14:27:43.565000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Regardless, 2% isn't a big hit, even if it can't be improved on, as I suspect it can.",
        "created_at": "2021-03-03T14:28:27.133000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "Agree, to me that's not the main thing. The initial proposed gas decrease which turns out it's actually an increase feels more important",
        "created_at": "2021-03-03T14:29:22.819000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "(the first link I sent)",
        "created_at": "2021-03-03T14:29:29.659000+00:00",
        "attachments": null
    },
    {
        "author": "leonardoalt",
        "category": "general",
        "parent": "",
        "content": "It's weird to me that folks seem to ignore that.",
        "created_at": "2021-03-03T14:31:03.993000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I haven't had time to study https://ethereum-magicians.org/t/eip-2315-simple-subroutines-for-the-evm/3941/87 - it's four hours old.  I know for sure that using BEGINSUB and RETURNSUB gives better results for Forth calling conventions.  I'm not sure for Solidity calling conventions.  It would probably take a days work to fully analyze.",
        "created_at": "2021-03-03T14:32:40.507000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "https://covid19.healthdata.org/global?view=total-deaths\u0026tab=trend",
        "created_at": "2021-03-03T14:44:15.584000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Meanwhile, the world goes on.",
        "created_at": "2021-03-03T14:44:38.536000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "I feel this pretty hard too",
        "created_at": "2021-03-03T14:59:04.362000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "One of the reasons we had not taken the time to implement was exactly this kind of thrashing and indecision from the past where it didn't seem worth it to invest in doing so, when we have more important things we need to accomplish.",
        "created_at": "2021-03-03T15:00:57.557000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "Except for attacks. We are scanning the code for jumpdests (or for translation into internal program representation) so it is better to do also beginsub collection in the same single pass. Otherwise you have to scan code second time on the first `JUMPSUB`. And the cost of the first `JUMPSUB`  definitely does not reflect this.",
        "created_at": "2021-03-03T15:01:54.081000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "Is this scanning that needs to happen in the core EVM so it can see production use?",
        "created_at": "2021-03-03T15:03:43.345000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "It has to happen by the spec.",
        "created_at": "2021-03-03T15:04:14.842000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "Can you point this out? Seems like a subtle point that I'm not seeing which states that deployed code must go through this sort of analysis stage before allowing to be deployed.",
        "created_at": "2021-03-03T15:06:56.950000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Hmm, my understanding of the spec was that no analysis was required.",
        "created_at": "2021-03-03T15:07:01.703000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "The proposal seems simple enough I'm not sure where its hiding, but maybe I'm missing something",
        "created_at": "2021-03-03T15:07:32.326000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "There *used* to be a requirement that jumping into the middle of a subroutine was invalid, but that was removed (too much complexity to validate that never happened on contract deployment or at runtime).",
        "created_at": "2021-03-03T15:07:34.944000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Jumps have to be to valid destinations.  You can check at the time of the jump, or you can check up front.  It's a trade-off.",
        "created_at": "2021-03-03T15:08:50.804000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "Does the tradeoff introduce a DoS vulnerability?",
        "created_at": "2021-03-03T15:09:12.640000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "if not, this is of no concern",
        "created_at": "2021-03-03T15:09:24.768000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I don't know why someone would implement a check up front since that should be the uncommon (never) case in all but an attack scenario.  And in the attack scenario, the transaction will fail immediately after the jump and I *believe* burn all remaining gas.",
        "created_at": "2021-03-03T15:09:35.616000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "It does not.",
        "created_at": "2021-03-03T15:09:35.979000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "It's the jump that is the common case.  Adding \"if destination is valid\" to every jump is useless runtime overhead.",
        "created_at": "2021-03-03T15:10:43.209000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "External Analysis tools can implement this check, sure. The idea is that a compiler making us of this feature simply wouldn't _do_ this because it makes no sense.",
        "created_at": "2021-03-03T15:10:53.739000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Right, but the EVM interpreter doesn't know that.",
        "created_at": "2021-03-03T15:11:33.526000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "And it doesn't need to know that",
        "created_at": "2021-03-03T15:11:47.670000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "If its a bad jump dest, it just fails",
        "created_at": "2021-03-03T15:12:07.093000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I think a scan of the blockchain found only 3 cases of bad destinations.  If it was up to me I'd let them just fail at runtime.",
        "created_at": "2021-03-03T15:12:31.735000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "Are you sure only 3 cases? I think solidity \u003c 0.4.0 or so emitted \"jump to invalid destination\" in lieu of the revert and invalid opcodes. That surely is a large number of contracts.",
        "created_at": "2021-03-03T15:13:36.846000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I'm not sure.",
        "created_at": "2021-03-03T15:14:02.002000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Did they always jump to the same invalid destination?  If so they could be filtered out.",
        "created_at": "2021-03-03T15:14:08.608000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "We are way down in the weeds of shaving cycles off of VM implementations ...",
        "created_at": "2021-03-03T15:14:46.217000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I was contending the results of the benchmark don't reflect what they claim to reflect because there should be no difference.  It sounded like you were defending the benchmark results as reasonable.  Perhaps I misunderstood though.",
        "created_at": "2021-03-03T15:16:46.779000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I was saying the implementation is common and reasonable, and the slowdown looks to be very small.  If it matters enough we can probably do better, but we don't need to do so here and now.",
        "created_at": "2021-03-03T15:18:17.584000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I can't find the relevant discussion - it's on one of the turbo-geth channels.  It may be that the test was something like - during resync, don't do jumpdest analysis unless blocknumber \u003c # or contract is one of # or # or #.  Anyway, invalid jumps are rare.",
        "created_at": "2021-03-03T15:24:31.951000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "So, after having looked at the 350+ messages overnight, it seems that Geth, OE and Nethermind are all OK with leaving 2315 in given that it benefits Vyper (and potentially others). Besu would be fine with this too. \u003c@!429719902363058177\u003e \u003c@!206016661470314496\u003e \u003c@!489256758989029405\u003e can you 👍-react if that's accurate?\n\nAlso, a bunch of people (myself included) have expressed concern about changing things so close to a release after they've been agreed upon for a long time without a fairly strong reason. AIUI, there is no \"strong reason\" to remove 2315 now. \n\nWe can \"officialise\" this on ACD, even though it's already been made official before, but I just want to make sure this accurately reflects people's positions.",
        "created_at": "2021-03-03T15:37:52.275000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Also, we need to figure out if we're still comfortable forking Ropsten in 1 week given all this. It seemed like that was the consensus yesterday, but just want to double check.",
        "created_at": "2021-03-03T15:39:41.221000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Finally, we'll have a lot to discuss about how we improve the EIP process based on this, but I think it makes sense to table this for now until Berlin has been dealt with 😅",
        "created_at": "2021-03-03T15:41:53.338000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "This discussion about \"we now suddenly remove a fork which is scheduled\" - didn't we do this before in Constantinople and then the Petersburg fork? They are technically two different forks, but they eventually reach the same result?",
        "created_at": "2021-03-03T15:42:14.462000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Yes, but that was because of a security issue",
        "created_at": "2021-03-03T15:42:25.079000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "We also had a long debate then, and I remember \u003c@456226577798135808\u003e saying we should think as if the fork was scheduled 1 month out, not 1 day, and we decided to remove EIP-1283 because of security considerations. It made it back in as EIP-2200 in the subsequent fork",
        "created_at": "2021-03-03T15:43:09.227000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "One improvement I could see making is \"no Core EIP moves to ACD without being in Review\"",
        "created_at": "2021-03-03T15:44:13.723000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "since some see that as a signal that an EIP is worth reviewing at all",
        "created_at": "2021-03-03T15:44:48.842000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "By \"moves to ACD\" do you mean \"gets discussed on ACD\" or \"gets added to a HF\"?",
        "created_at": "2021-03-03T15:45:03.980000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "gets discussed",
        "created_at": "2021-03-03T15:45:09.114000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "To know if it is bad jumpdest you have to do the code scan.",
        "created_at": "2021-03-03T15:45:10.640000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "Review allows for changes, so that is no problem",
        "created_at": "2021-03-03T15:45:22.217000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "but Review signals it's at least well-formed enough to be discussed on ACD",
        "created_at": "2021-03-03T15:45:36.442000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Got it. So that implies there has been at least some async discussion on, say, EthMagicians, on it before it moves to ACD?",
        "created_at": "2021-03-03T15:46:15.177000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "I would say that's generally advised",
        "created_at": "2021-03-03T15:46:29.834000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "not a requirement though",
        "created_at": "2021-03-03T15:46:34.260000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "if it doesn't move forwards in ACD there's reasoning to update, and that still matches being in Review",
        "created_at": "2021-03-03T15:46:54.577000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "being pushed to Review right before ACD is not really a problem to me",
        "created_at": "2021-03-03T15:47:17.147000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "The downside I can see with that is that it may add more friction to folks who aren't super familiar with the process. See the recent \"counter EIP\" re: gas refund removals: https://ethereum-magicians.org/t/eip-3300-phase-out-refunds/5434",
        "created_at": "2021-03-03T15:47:17.581000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "but setting that hard requirement in terms of status might hopefully avoid these types of issues",
        "created_at": "2021-03-03T15:47:30.375000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "ACD scheduling can just be like \"make this Review first\"",
        "created_at": "2021-03-03T15:48:28.485000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "BTW, there is also \"last call\" status which has RSS-like notification...",
        "created_at": "2021-03-03T15:48:38.535000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Got it. I need to think about this more! From my PoV, it feels more natural to have a DRAFT requirement for the first ACD discussion, and then REVIEW for inclusion.",
        "created_at": "2021-03-03T15:48:41.515000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "Last Call I think must come closer to fork scheduling",
        "created_at": "2021-03-03T15:48:59.130000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "at least, as a gating factor",
        "created_at": "2021-03-03T15:49:04.782000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Does last call still have a time component to it?",
        "created_at": "2021-03-03T15:49:21.130000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "I see this as REVIEW and then LASTCALL lol",
        "created_at": "2021-03-03T15:49:34.035000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "Closer to this mess we are currently having?",
        "created_at": "2021-03-03T15:49:47.317000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Because, as we've seen with EIP-2930, some stuff can get iterated on after being scheduled for a fork",
        "created_at": "2021-03-03T15:49:51.233000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "I think DRAFT should be \"this proposal is pretty in flux, no need to pay attention here\"",
        "created_at": "2021-03-03T15:49:58.201000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "iteration in REVIEW is fine",
        "created_at": "2021-03-03T15:50:13.336000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "So if it's OK for something to stay in LAST CALL for 1-2 months and have non-trivial changes, then I think I agree with your proposal \u003c@!659892951006183425\u003e",
        "created_at": "2021-03-03T15:50:15.353000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "that's a different discussion",
        "created_at": "2021-03-03T15:50:26.659000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "there's nothing wrong with it being in REVIEW for 1-2 months and have non trivial changes, that's for sure",
        "created_at": "2021-03-03T15:50:42.762000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "LAST CALL should hopefully have few changes IMO",
        "created_at": "2021-03-03T15:51:00.911000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "I only mean that if EIP-2315 went though LAST CALL I would be notified earlier than last week.",
        "created_at": "2021-03-03T15:51:37.451000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "because of the RSS feed?",
        "created_at": "2021-03-03T15:52:08.421000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Please \u003c@!425274498732916736\u003e , it's been slotted for Berlin on every ACD Agenda for almost a year now.  At some point it's up to devs to take a look.",
        "created_at": "2021-03-03T15:53:18.673000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "btw the main EIPs website still doesn't have REVIEW as a status\nhttps://eips.ethereum.org/",
        "created_at": "2021-03-03T15:53:20.153000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "I think another RSS feed for REVIEW is potentially justifiable",
        "created_at": "2021-03-03T15:53:54.444000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "gives 2 different levels of interest",
        "created_at": "2021-03-03T15:54:08.413000+00:00",
        "attachments": null
    },
    {
        "author": "hudsonjameson",
        "category": "general",
        "parent": "",
        "content": "I think Pawel is implying the process is broken which would have, in part, helped prevent some of this and encouraged more review.",
        "created_at": "2021-03-03T15:54:28.130000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "especially if you can further restrict by \"Core in REVIEW\"",
        "created_at": "2021-03-03T15:54:49.197000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "OK",
        "created_at": "2021-03-03T15:55:51.811000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "let's move forwards from this 😄",
        "created_at": "2021-03-03T15:56:04.211000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "random thought: what if EIPs were their own organization?",
        "created_at": "2021-03-03T15:57:37.808000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "\u003c@!683653554631868440\u003e some small updates needed to push 2315 to REVIEW\nhttps://github.com/ethereum/EIPs/pull/3309",
        "created_at": "2021-03-03T15:58:38.247000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "OK.  All of this tweaking to EIP statuses post-dates EIP-2315.",
        "created_at": "2021-03-03T16:02:23.867000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "I only want to share my personal experience: in April we raised some concerns, did some additional validation prototyping and the discussion was kinda stalled on this. And then I honestly don't know how it happen but I only blame myself for this: I didn't notice it was accepted. I was thinking it is kind of \"undecided\" until last week or two when I received the implementation for evmone.\n\nI don't think status update would change much. But on the other hand, why not to follow this status update process more  rigorously instead of fighting this argument later.",
        "created_at": "2021-03-03T16:02:36.295000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Sorry to be critical - I just don't think there was any other process at the time, and didn't know you were in the dark, Pawel.",
        "created_at": "2021-03-03T16:03:55.281000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This is already the intent.  It is a fairly new part of the process though and this EIP went to core devs *long* before that process was introduced.  (cc \u003c@552133098075193354\u003e)",
        "created_at": "2021-03-03T16:07:50.474000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Known issue, working on it.  😬",
        "created_at": "2021-03-03T16:09:34.710000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "Even in the old process there was an Accepted status when considered for a fork, and that status was supposed to be preceded by Last Call.",
        "created_at": "2021-03-03T16:11:15+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003c@659892951006183425\u003e https://eips.ethereum.org/core#review is what you want I think?",
        "created_at": "2021-03-03T16:11:22.216000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "I believe this EIP may have had the Accepted status at some point, but during the transition to the new statuses the Accepted was removed from the file.",
        "created_at": "2021-03-03T16:11:39.858000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "yes, but in RSS form (which, I don't necessarily use, but it seems like people like the RSS feeds)",
        "created_at": "2021-03-03T16:12:09.124000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It is unclear whether there are more than 1 users of the RSS feed at the moment.  😖",
        "created_at": "2021-03-03T16:12:30.689000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "lol",
        "created_at": "2021-03-03T16:12:37.889000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "twitter bot?",
        "created_at": "2021-03-03T16:12:41.890000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I believe \u003c@642887713246150666\u003e was going to or already has setup such a thing for EIPs that enter certain stages?",
        "created_at": "2021-03-03T16:12:57.473000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I think I just left it at Draft, given the whole system of statuses was changing beneath it.  I still don't see the need for any statuses besides Draft and Final, but I already lost that battle.",
        "created_at": "2021-03-03T16:15:38.544000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "60 more messages.  Do we have answers to your questions here?",
        "created_at": "2021-03-03T16:19:46.382000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "My read is that all the client teams are in consensus about keeping it, but I asked for explicit confirmation 😅 https://discord.com/channels/595666850260713488/745077610685661265/816695884225708043\n\nI think we'll probably need to wait until ACD to get a \"fully final\" decision?",
        "created_at": "2021-03-03T16:32:08.666000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "general",
        "parent": "",
        "content": "It's a work in progress. I've mentioned to request the status change of all Berlin ready EIPs on the ACD meetings a few times. Also mentioned it to the authors in the PEEP meeting that we organize. After talking to authors, we've created PR for a few EIPs.",
        "created_at": "2021-03-03T16:35:48.252000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "general",
        "parent": "",
        "content": "One of the reasons for delay in the request for status change for EIP-2315 could be, we just had the chat with \u003c@!683653554631868440\u003e last week, where we discussed about the need for status change.",
        "created_at": "2021-03-03T16:35:50.948000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "I really would like to have a synced ack from all teams before we green light the fork",
        "created_at": "2021-03-03T16:36:18.027000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Why sync?",
        "created_at": "2021-03-03T16:36:35.194000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "Just to ensure we're really on the same page and nobody drifts on into a sidechain",
        "created_at": "2021-03-03T16:36:37.773000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "well, depeding on which messages you read above, you'll have teams agreeing to both variations 😄",
        "created_at": "2021-03-03T16:37:06.562000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The latest message from each of the 4 teams I believe is \"go for Berlin with 2315\".",
        "created_at": "2021-03-03T16:37:26.987000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Waiting for a synchronous repeat seems unnecessary to me.",
        "created_at": "2021-03-03T16:37:38.054000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Well, I don't think we're \"waiting\" much anymore",
        "created_at": "2021-03-03T16:37:47.929000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "We're gonna wait for acd anyway, too volatile 😄",
        "created_at": "2021-03-03T16:38:02.204000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Especially given that we live in a world where the teams are time zone spread, getting synchronous *anything* is hard.",
        "created_at": "2021-03-03T16:38:14.017000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "general",
        "parent": "",
        "content": "It's a fairly new process and I am trying to follow the EIP GitHub to let authors know at the early stages of standardization.",
        "created_at": "2021-03-03T16:38:17.057000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003c@!206016661470314496\u003e are you OK keeping the Ropsten block as is?",
        "created_at": "2021-03-03T16:38:22.616000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "Sure, we're not gonna ship it in 1.10.0",
        "created_at": "2021-03-03T16:38:40.362000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "but can do a followup release to insert the numbers",
        "created_at": "2021-03-03T16:38:47.413000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "as I said, I want to wait 1-2 more days just to see the dust settled 😛",
        "created_at": "2021-03-03T16:39:03.230000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I guess keeping it as is means that clients who already have a Berlin release (Besu, OE has a RC) don't need to change it.",
        "created_at": "2021-03-03T16:39:43.740000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "\u003c@!206016661470314496\u003e even with the fork blocks removed  `--override.berlin` still works, right?",
        "created_at": "2021-03-03T16:41:04.517000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Re: having this synchronously, would people want to have an off-schedule call tomorrow at ACD time? Not sure we gain much by having it 1 day earlier, but perhaps?",
        "created_at": "2021-03-03T16:49:16.310000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "It would keep this from crowding more important items on the agenda.",
        "created_at": "2021-03-03T16:52:06.241000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I had more thoughts about this today and also I refreshed knowledge on JVM and Risk-V to understand what is going there, specifically about static/dynamic jump question. JVM instruction set is from the start with variable length opcodes, which allows to have all jump/branch offsets to be part of the instruction (immediates). In that sense, JVM is dynamic-jump free. Risk-V, on the other hand, has fixed opcode size, 4 bytes. They have branch instructions with offsets as immediates, which can be classified as static jumps, but they are limited in how far they can jump. Then there are \"subroutine\" jumps, `jal` and so on, these can perform long jumps, and use registers to read the jump location from. These are in effect dynamic jumps. Looking at EVM, we have most opcodes 1 byte long, and changing that would be backwards incompatible. So if we think we are stuck with 1 byte opcodes, then there is no hope to ever escape dynamic jumps, because we cannot add jump offsets to the opcodes. If that's the case, I agree with \u003c@!683653554631868440\u003e that the matter of static/dynamic jumps is a red herring. EVM would need to be completely redone most probably to achieve that. And more importantly, some general design direction need to be chosen.",
        "created_at": "2021-03-03T16:59:46.065000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "What we can do is eliminate the need for dynamic jumps.  The general direction I have in mind remains EIP-615, though \u003c@!194433073394352129\u003e has suggested a frame pointer extension that is superior to the design there.  Iterate and improve.",
        "created_at": "2021-03-03T17:03:08.861000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "Even the 2315 thread on magicians explains that multi byte opcodes is not a no-go and there are multiple ways to do it. Just there wasnt a big enough push from multiple groups to do it.",
        "created_at": "2021-03-03T17:03:35.448000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I think it requires versioning, which introduces problems of its own.",
        "created_at": "2021-03-03T17:04:10.609000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "Having a bigger plan laid out for the EVM is important and having multiple teasm (clients, vm teams, compiler teams, auditor and security people) aligned would be a good start to actually achieve the implementation of such a plan.",
        "created_at": "2021-03-03T17:04:49.341000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Agreed.",
        "created_at": "2021-03-03T17:05:11.380000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "Even 615 shows the non-versioning option: just run validation at deploy time. Then one can say a preceding push as an immediate.",
        "created_at": "2021-03-03T17:05:43.346000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "This was also brought up under the swapdup discussion and other places I probably forgot about.",
        "created_at": "2021-03-03T17:06:03.619000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Yes.  Not ideal, but workable.",
        "created_at": "2021-03-03T17:06:20.808000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I wanted EIP-2315 in and some experience with it before tackling further changes.",
        "created_at": "2021-03-03T17:07:09.055000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "There is no need in dynamic jumps already. As I mentioned before, Solidity already generates the code (unless you use some assembly tricks) that can be analysed with basically 100% soundness and CFG constructed. In that sense, adding those extra opcodes does not change the situation",
        "created_at": "2021-03-03T17:10:01.122000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "For speed purposes I think validation at deploy time is a really good direction to go and I believe the static analysis work \u003c@456226577798135808\u003e talked about would be well aligned with that: one could extend the \"is account validated\" flag to every single account (and not just newly deployed contracts).",
        "created_at": "2021-03-03T17:10:03.648000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Good.",
        "created_at": "2021-03-03T17:10:36.282000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Very good.",
        "created_at": "2021-03-03T17:10:44.018000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I do vaguely remember saying these things on some ACD calls, but this was long time ago",
        "created_at": "2021-03-03T17:12:17.052000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Also in some Telegram thread, but I was just passing through.",
        "created_at": "2021-03-03T17:12:46.637000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "so the \"dry residue\" for me is that the \"static jumps\" angle can be removed from the discussion, and I hope this will clean things up a bit",
        "created_at": "2021-03-03T17:14:19.866000+00:00",
        "attachments": null
    },
    {
        "author": "pauld.9606",
        "category": "general",
        "parent": "",
        "content": "\u003c@456226577798135808\u003e  wrote:\n\n```Looking at EVM, we have most opcodes 1 byte long, and changing that would be backwards incompatible. So if we think we are stuck with 1 byte opcodes```\n\nWe are _NOT_ stuck with one byte opcodes.\n\nVersioning is _NOT_ required for multi-byte opcodes or immediates.\n\nWe could do `JUMPSUB PUSH*\u003cbeginsub_offset\u003e`. The program counter would be incremented to jump over the PUSH* and offsets.\n\nNote that the `PUSH*` is never executed, it is just a guard to preserve backwards compatibility.\n\nAnother option is to break backwards compatibility once we have EIP-2327 (`BEGINDATA`).",
        "created_at": "2021-03-03T17:17:59.690000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Good to know. So if we do want to do this eventually, it is better to stop now and redo the `JUMPSUB` than to introduce an opcode that we know will need to be deprecated",
        "created_at": "2021-03-03T17:20:09.100000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "or first break the compatiblity",
        "created_at": "2021-03-03T17:20:47.944000+00:00",
        "attachments": null
    },
    {
        "author": "chriseth8375",
        "category": "general",
        "parent": "",
        "content": "It would be nice to align on the goals first. Do we want a fast EVM? Do we want an EVM that is statically analyzable? Which kinds of static analyses do we want and why? And only after that figure out which changes we need.",
        "created_at": "2021-03-03T17:21:42.965000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I think we are probably more qualified to talk about it now than year or two ago",
        "created_at": "2021-03-03T17:22:37.892000+00:00",
        "attachments": null
    },
    {
        "author": "pauld.9606",
        "category": "general",
        "parent": "",
        "content": "EVM already supports subroutines. EIP-2315 making subroutines first-class objects does not add much value.",
        "created_at": "2021-03-03T17:24:08.143000+00:00",
        "attachments": null
    },
    {
        "author": "pauld.9606",
        "category": "general",
        "parent": "",
        "content": "Furthermore, EIP-2315 introduces too much complexity. A new stack, new jumpdest analysis, awkwardness with unrestricted jumping into and out of subroutines, allowing dynamic jumps. Seems to create more problems than it solves.",
        "created_at": "2021-03-03T17:24:28.142000+00:00",
        "attachments": null
    },
    {
        "author": "pauld.9606",
        "category": "general",
        "parent": "",
        "content": "Furthermore, from a design perspective, EIP-2315 seems to hinder larger and more valuable design efforts, including static analysis-friendly EVM (discussed above). We should prioritize such efforts, not hinder them.",
        "created_at": "2021-03-03T17:24:49.770000+00:00",
        "attachments": null
    },
    {
        "author": "pauld.9606",
        "category": "general",
        "parent": "",
        "content": "Furthermore, EIP-2315 gas cost motivations have been refuted by the Solidity team with counterexamples. Motivation have crumbled.",
        "created_at": "2021-03-03T17:25:33.349000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003e Furthermore, from a design perspective, EIP-2315 seems to hinder larger and more valuable design efforts\nHow so.\n\n\u003e Furthermore, EIP-2315 gas cost motivations have been refuted by the Solidity team with counterexamples. Motivation have crumbled!\nStill under discussion.\n\nhttps://ethereum-magicians.org/t/eip-2315-simple-subroutines-for-the-evm/3941/\n\n https://ethereum-magicians.org/t/eip-2315-simple-subroutines-for-the-evm/3941/90",
        "created_at": "2021-03-03T17:26:33.146000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "Geth v1.10.0 out! https://blog.ethereum.org/2021/03/03/geth-v1-10-0/ (no Berlin, as announced)",
        "created_at": "2021-03-03T17:28:06.403000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T17:28:29.594000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T17:29:01.738000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T17:29:18.798000+00:00",
        "attachments": null
    },
    {
        "author": "pauld.9606",
        "category": "general",
        "parent": "",
        "content": "\u003e How so.\n\nRead above. `if this is indeed the goal (switching to no-dynamic jumps), then the EIP does need to be modified and reworked`.",
        "created_at": "2021-03-03T17:29:37.120000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T17:32:53.224000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T17:33:00.777000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Objections and requests for rework can be raised ad infinitum.  I have no intention of reworking this beyond removing the Appendix and references to it if you so insist.  The time for review and rework is _over_.",
        "created_at": "2021-03-03T17:33:23.762000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003e new jumpdest analysis\nWhat new jumpdest analysis?",
        "created_at": "2021-03-03T17:33:56.297000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T17:34:59.700000+00:00",
        "attachments": null
    },
    {
        "author": "chriseth8375",
        "category": "general",
        "parent": "",
        "content": "On a positive note, \u003c@!206016661470314496\u003e : geth and solidity release days are in sync again! 😉",
        "created_at": "2021-03-03T17:37:42.025000+00:00",
        "attachments": null
    },
    {
        "author": "pauld.9606",
        "category": "general",
        "parent": "",
        "content": "New ways to move the program counter.",
        "created_at": "2021-03-03T17:38:16.618000+00:00",
        "attachments": null
    },
    {
        "author": "pauld.9606",
        "category": "general",
        "parent": "",
        "content": "New rules. New constraints.",
        "created_at": "2021-03-03T17:38:25.441000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "What new constraints?",
        "created_at": "2021-03-03T17:38:32.977000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T17:38:33.600000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T17:40:01.839000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T17:41:11.581000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T17:41:22.756000+00:00",
        "attachments": null
    },
    {
        "author": "pauld.9606",
        "category": "general",
        "parent": "",
        "content": "Good question and thought provoking question. My biggest concern is constraints on future design.",
        "created_at": "2021-03-03T17:41:23.446000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T17:41:26.611000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "This does not go to you personally. Please don't feel it is you vs us. If reworks is needed and required, there will be people to help with it",
        "created_at": "2021-03-03T17:41:52.551000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T17:42:23.152000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "Review being a requirement for join Considered for Inclusion is a good middle ground here. And, I think it is totally reasonable to expect a REVIEW status at that point.",
        "created_at": "2021-03-03T17:44:07.596000+00:00",
        "attachments": null
    },
    {
        "author": "pauld.9606",
        "category": "general",
        "parent": "",
        "content": "Agreed. Reading the EIP, I thought that it is well-written, and the authors should be proud of it.",
        "created_at": "2021-03-03T17:44:47.809000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-03T17:47:58.769000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "pinned a few more messages for people interested in catching up quickly, and for people writing summaries.",
        "created_at": "2021-03-03T17:51:21.962000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "Making REVIEW as a requirement to propose CFI is a good first proposal to improve the process.",
        "created_at": "2021-03-03T17:54:31.094000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "2315 would have moved to this Status on 2020-02-21 and linked to this decision for comments. https://github.com/ethereum/pm/blob/master/All%20Core%20Devs%20Meetings/Meeting%2081.md#decisions",
        "created_at": "2021-03-03T17:56:05.044000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "\u003c@!552133098075193354\u003e \u003c@!301186049323958275\u003e",
        "created_at": "2021-03-03T17:56:40.045000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "Authors are movitivated to get an EIP into CFI and so are aligned in doing the work to make it REVIEW.",
        "created_at": "2021-03-03T17:57:24.079000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It already is.  This EIP was just from *long* before that and we didn't do a push to \"fixup\" all of the EIPs that were already CFI when the new rule came into place.",
        "created_at": "2021-03-03T17:57:31.952000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I am not sure there was a process failure to be honest. Perhaps there was an issue of perception of what process is supposed to do, and this perhaps needs to just be spelled out",
        "created_at": "2021-03-03T17:57:40.751000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "Yup, I was laughing when I saw your release tweet a couple hours ago 😄",
        "created_at": "2021-03-03T17:58:59.346000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "Just didn't want to jump on it",
        "created_at": "2021-03-03T17:59:05.331000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "It was a process failure for me.  I came back from lunch to find that what I had thought for almost year was a done deal was suddenly up in the air, and I was being showered with questions on a chat forum at the last minute with no time to prepare careful answers.",
        "created_at": "2021-03-03T18:03:23.743000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "wasted time and work happens to all of us, the difference is how we react to it. Embrace it or become defensive",
        "created_at": "2021-03-03T18:05:55.472000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I'm trying.  I'm only human.  And sometimes a very grouchy old man 😉",
        "created_at": "2021-03-03T18:06:59.443000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "I think Greg's reaction was completely to be expected 😄",
        "created_at": "2021-03-03T18:08:01.422000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "He handled it much nicer than I would have (speaks volumes about my temper)",
        "created_at": "2021-03-03T18:08:21.636000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Definitely, we are not perfect and are human. That is why we need to remind ourselves to be kind to each other, whatever happens 🙂",
        "created_at": "2021-03-03T18:09:11.520000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "anyhow, I would not rush to change the process with \"quick fixes\". I think this requires a bit more thoughtful analysis of whether it was a process failure or something that is going to happen whatever process we have (which is also fine)",
        "created_at": "2021-03-03T18:13:36.381000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "We've already had a lot of work and experience on establishing process.  So just follow it, see how it works out, and adjust as needed.  Often, just _having_ a rational process is more important than the exact details of the process.",
        "created_at": "2021-03-03T18:16:05.920000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "On EIP-2315, what I am going to do is remove the Appendix and references to it.  It changes nothing substantial and doesn't change my motivation much.  I think that's adequate rework given we plan to release it as specified.  On EIP-615 I have long considered it as just a framework.\n\nAs I've mentioned, I want to use \u003c@194433073394352129\u003e's work rather than the local variable opcodes in EIP-615.  Some other parts of it also may not be needed.\n\nThe most important thing from my point of view is that EIP-615 provided a carefully specified and formally reviewed spec for what a valid program was.  In the end we will need that.",
        "created_at": "2021-03-03T18:24:15.761000+00:00",
        "attachments": null
    },
    {
        "author": "tkstanczak",
        "category": "general",
        "parent": "",
        "content": "we are pushing Nethermind with the preagreed block numbers but for testnets only now",
        "created_at": "2021-03-03T18:54:00.682000+00:00",
        "attachments": null
    },
    {
        "author": "tkstanczak",
        "category": "general",
        "parent": "",
        "content": "(2315 in)",
        "created_at": "2021-03-03T18:54:07.236000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Added 2315 as the first thing on the agenda for ACD (https://github.com/ethereum/pm/#acd-107-march-5-2021), and left a comment summarizing client teams' positions on \u003c@!543900561460822016\u003e's issue: https://github.com/ethereum/pm/issues/263#issuecomment-790052597",
        "created_at": "2021-03-03T21:08:01.587000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Also opened an issue to discuss the interplay of the EIPs and network upgrade process: https://github.com/ethereum/pm/issues/264\n\nNot sure we need to discuss it on Friday's call per se, but it would be good to start an async conversation about potential improvements here.",
        "created_at": "2021-03-03T21:23:01.465000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I was actually wrong about JVM being dynamic-jump free. Just found that `ret` instruction (return from a subroutine) takes the return address from a specified local variable. The `jsr` instruction (jump into a subroutine, or block) pushes the return address on the stack, and then any sub-routine usually pops it straight away and stores in a local variable. That, of course, makes `ret` potentially dynamically-jumping.",
        "created_at": "2021-03-03T22:28:39.210000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Java compiler uses such sub-routines to compile `try {} finally {}` blocks, for example",
        "created_at": "2021-03-03T22:30:19.294000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "and interestingly, I could not (so far) find any other uses for subroutine opcodes in JVM apart from compiling `finally` blocks",
        "created_at": "2021-03-03T22:36:34.052000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "and it may be ironic that it looks so far that subroutines are the only reason JVM is not dynamic-jump free 🙂",
        "created_at": "2021-03-03T22:40:08.339000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I also found this quote in one of the papers about JVM: \"Subroutines are a\nmajor source of complexity for the bytecode verifier because\nthey are not obviously last-in/first-out and because they require a kind of polymorphism\"",
        "created_at": "2021-03-03T22:42:08.184000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I also suspect that Java compiler could compile `finally{}` without the use of sub-routines somehow (though the code would be less compact apparently), and thus having a simpler bytecode verifier",
        "created_at": "2021-03-03T22:43:13.853000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "\u003c@!682078300234973185\u003e does WebAssembly have sub-routines? I could not find any there",
        "created_at": "2021-03-03T22:46:58.397000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "JVM also has top level object and method support, so the subroutine calls are usually taken care of by those calls.  It also has stronger code boundaries since each method has its own code block and doesn't have to implement method dispatch (for most JVM languages, groovy is an odd duck with its dispatch).",
        "created_at": "2021-03-03T22:46:58.778000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "JVM also has in-line metadata and versioning wrappers, so backwards compatability has built in checks.",
        "created_at": "2021-03-03T22:47:23.542000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Yes, but it looks like the `jsr` `ret` subroutines in JVM are much more similar to what we have in EIP-2315 than the method dispatch",
        "created_at": "2021-03-03T22:47:56.598000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "And data segments, and strict validation checks.  A lot of the items from the 615 dream list are present there.",
        "created_at": "2021-03-03T22:48:06.710000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "And a long list of validation related sandbox exploits and bugs.",
        "created_at": "2021-03-03T22:48:55.808000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "so I am just trying myself to verify the claim that subroutines (in the form we are talking about) are pervasive in virtual machines. It seems that they are not 🤔",
        "created_at": "2021-03-03T22:50:02.852000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "EIP-615 subroutines were different, I suspect. Without ability to jump into them. This I would agree is a pervasive pattern. But not the pattern of EIP-2315 I think. My feeling that the baby has been thrown out with the bath water, unfortunately",
        "created_at": "2021-03-03T22:51:44.997000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "\u003c@456226577798135808\u003e wasm has a more defined structure (not unlike jvm) where functions exists separately and one can call them. Within a function there are various ways to jump around, including if/else blocks, different branching (to well defined labels), including a branch table instruction (a jumptable).",
        "created_at": "2021-03-03T22:54:49.289000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Yes, basically the terminology sucks a bit, and I think this it was partially tripped people over (including myself)",
        "created_at": "2021-03-03T22:58:19.752000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "EIP-615 had a comparison table to which wasm features it wished to replicate in EVM.",
        "created_at": "2021-03-03T22:59:25.123000+00:00",
        "attachments": null
    },
    {
        "author": "pauld.9606",
        "category": "general",
        "parent": "",
        "content": "To add, Wasm has no subroutines. It has a structured control-flow which allows jumping to parent blocks of code.",
        "created_at": "2021-03-03T22:59:37.157000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "when EIP-615 was proposed, it had a meaning of \"subroutine\" which is what we understand by function dispatch, something that cannot be jumped into etc. But with adaptations, we arrived at a different meaning of subroutine in EIP-2315, which is more like JVM special-case subroutines for `finally {}` blocks",
        "created_at": "2021-03-03T22:59:53.970000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "so it is partly terminology creep that confused some people and perhaps delayed some important discussions",
        "created_at": "2021-03-03T23:00:54.916000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "so when the original claim was made \"subroutines are part of every Virtual Machine I have seen\", it would have only been true if by subroutines we meant subroutines in the meaning of EIP-615. However, such claim does not hold anymore for the \"subroutine\" in the sense of EIP-2315. It is a niche feature that I so far only found in JVM for specific purpose of compact `finally` block compilation",
        "created_at": "2021-03-03T23:02:53.831000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "and that feature is also the reason JVM is not dynamic-jump free 🙂",
        "created_at": "2021-03-03T23:04:54.192000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "And now after thinking about all this, I am also curious about this: why using `PUSH there JUMPSUB`/`RETSUB` to delineate the inter-contract calls (as Vyper team is intending to do) safer or more secure than emulating it with `PUSH here PUSH there JUMP` / `some POPs JUMP` ? There is still chance of a stray jumps between subroutines, unfortunately that protection was removed for simplicity. Less chance of stack misalignment because there is now a separate stack just for return destinations? I am not disputing this (yet), but just curious \u003c@!659892951006183425\u003e if you have a chance to chime in. I understood the prior desire to use `CALL` for inter-contract calls because it segregates caller/callee stack and memory completely, but using EIP-2315 subroutines for that might be still \"unsafe\" from the same point of view",
        "created_at": "2021-03-03T23:42:42.994000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "POP once too many 😭 \nPOP once too few 😫 \n\nBEGINSUB and RETSUB are well aligned, just the return jump you can get wrong (maybe)",
        "created_at": "2021-03-03T23:46:45.878000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "Off by one errors are catastrophic and lead to memory corruption using dynamic jumps",
        "created_at": "2021-03-03T23:47:17.718000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "Off by one errors with subroutines are much less likely (because of the separate stack) and easier to spot",
        "created_at": "2021-03-03T23:47:53.157000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "And when they do happen, you'll get a revert if you don't jump to a BEGINSUB",
        "created_at": "2021-03-03T23:48:33.559000+00:00",
        "attachments": null
    },
    {
        "author": "daniel.kirchner",
        "category": "general",
        "parent": "",
        "content": "Isn't being off in stack alignment *always* catastrophic? And without subroutines you will most likely jump to a non-jumpdest - so isn't that easier to detect?",
        "created_at": "2021-03-03T23:48:51.503000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "(The reverse direction is maybe still a problem, but harm reduction is good)",
        "created_at": "2021-03-03T23:48:52.275000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "This is all off the top of my head, as I said before we haven't implemented anything because we didn't want to invest the time into something that will just be swept away based on ever changing feelings",
        "created_at": "2021-03-03T23:50:30.832000+00:00",
        "attachments": null
    },
    {
        "author": "fubuloubu",
        "category": "general",
        "parent": "",
        "content": "If having a compiler implement it is considered a blocker to inclusion, then there's your answer",
        "created_at": "2021-03-03T23:51:00.520000+00:00",
        "attachments": null
    },
    {
        "author": "tkstanczak",
        "category": "general",
        "parent": "",
        "content": "we have deployed Nethermind with the earlier agreed block numbers",
        "created_at": "2021-03-03T23:57:50.701000+00:00",
        "attachments": null
    }
]