[
    {
        "author": "gumb00",
        "category": "general",
        "parent": "",
        "content": "The only cases where CREATE/CREATE2 would abort the execution are: stack underflow, not enough gas for opcode, static mode violation (and also CREATE2 not being defined before Constantinople)\n\nAll CREATE-specific errors result in 0 pushed on stack, and somehow when implementing EIP-2681 I interpreted \"exceptional halt\" in EIP text as \"CREATE fails similar to other error cases\".",
        "created_at": "2021-12-30T14:13:24.029000+00:00",
        "attachments": null
    },
    {
        "author": "gumb00",
        "category": "general",
        "parent": "",
        "content": "To summarize findings from this thread\n\n1. EIP-2681 spec for error case for CREATE* is inconsistent with current geth implementation and tests. I think EIP should be updated to say 0 is returned in case of nonce overflow.\n\n2. EIP-3860 also needs to be updated in the similar way - we already planned to do this. Current draft geth implementation and draft tests PR are not consistent with current EIP text.\n\n3. Maybe EIP-3860 should be more explicit about initcode cost being part of transaction intrinsic gas (so not enough gas to cover it makes transaction invalid). Currently it's only implied by saying that initcode cost \"extends the transaction data cost formula\".\n\n4. EIP-3860 should consider declaring creation transactions invalid when code is over the initcode limit. I agree it's better for UX, but should double check the implications for the implementation.",
        "created_at": "2021-12-30T14:13:32.619000+00:00",
        "attachments": null
    },
    {
        "author": "gumb00",
        "category": "general",
        "parent": "",
        "content": "\u003c@!508125616940515329\u003e thanks for bringing this up!",
        "created_at": "2021-12-30T14:13:50.926000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "Great, thanks a lot 🙂 It's good to know that the current implementation does not match the EIP 3860 spec, I literally just pulled your tests branch and tested against our JS implementation (some tests fail). It's good to know that the implementation does not match the spec, so I'll wait until that's updated 🙂",
        "created_at": "2021-12-30T14:17:30.175000+00:00",
        "attachments": null
    }
]