[
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Not sure if I can make it to the meeting, but if you ask me, these would be my initial personal opinions. EIP-2315 - not to be considered for London, because there are still lots of things to work out there about validation. Also, these changes do require full cooperation with compiler teams, because the roll-out plan will require core devs and compiler devs to make changes in lock-step. So inclusion of \"reborn\" EIP-2315 is still premature. BLS Support as a precompile - I still think evm384 is a better solution to the underlying problem and needs to be pursued instead. Sponsored Transaction Precompile - not to include to London - is there a way to do it without precompile (these are ugly things and should not be regarded as normal artefacts of EVM development), also consider who exactly will need it and what are the alternatives. BEGINDATA - proposal looks simple enough, but I would prefer to first look at a more general proposal from \u003c@!425279588009246720\u003e that proposes the introduction of code formats. If the more general approach is found too complex, I would consider including BEGINDATA. Limiting size of initcode - I would say yes, this looks trivial but I would like to hear more about benefits",
        "created_at": "2021-03-14T09:45:47.991000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "The problem with the calls (and we talked about it before) is that most of time is spent on things that aren't likely to be included anyway. I hope that people can be less shy and diplomatic and say what they think before the meeting (like I did), at a risk of ensuing arguments, but this will improve the quality of the discussion on the call.",
        "created_at": "2021-03-14T09:49:15.062000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Regarding the EIP that increases mining reward and then tapers it off. I do not think most of core devs that join the call are necessarily \"championing\" EIP-1559, so it is a bit unfair to ask them to adjudicate political issues like that. Yes, it is political, and important issue, but not sure what is expected from Core Devs on the call? They cannot commit either way on behalf of all people who are for and against EIP-1559, so having this on ACD is just going to make everyone frustrated and disappointed. If they are looking for some kind of pronouncement from Hudson or Tim, this pronouncement can be made in a different place",
        "created_at": "2021-03-14T10:06:13.181000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I just remember how it was with ProgPOW - lots of debates, then some really forced pronouncements from Hudson, and then it turned out (rightly) that Hudson does not represent everyone, so why did we spend so much on on ACD on this",
        "created_at": "2021-03-14T10:09:06.672000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I personally think that EIP-1559 is a good an interesting change, and a very interesting experiment. But I do not know what the consequences are and what the political fallout it. So I would say we should prepare the implementation, but not have debates yet about how this is going to blow up or not",
        "created_at": "2021-03-14T10:16:48.843000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "3074 is now an opcode, not a precompile.  Also, it may change to `authorize` + `authorizedcall` to simplify it in the EVM and provide for more use cases.",
        "created_at": "2021-03-14T10:38:57.470000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "Imo\n\n- 2315 should not be included. The 'reborn' is same as previous. It is a Feature-eip, and adding any features need to be backed solidly by showing that there is a demand for the feature. As neither Vyper nor Solodity demands/wants it, I don't see why we would include it. \n- 3074 Should not be included. It's still iterated on, and the semantics are very hard to overview. The possible quirks with new call types are _many_ both on infra layer and app layer, and I think it needs more time to be fully understood. \n- 2327 Begindata: imo also too soon/rushed. In it's current form, it's not ideal, IMO, and could be done better. \n- bls precompiles - not sure. I'm slightly in favor of it over 384 right now, but I'm on the fence. \n\nOnly my 5 cents, fwiw.",
        "created_at": "2021-03-14T13:48:58.117000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Thanks \u003c@!211091239112671234\u003e that is quite helpful",
        "created_at": "2021-03-14T17:05:50.891000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Actually, both of your comments are very helpful 😄 getting a rough idea of people’s views prior to the calls definitely means we can spend the time on them better 😄",
        "created_at": "2021-03-14T18:05:28.259000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003c@456226577798135808\u003e I need to think through yours about the BR increase more 🤔 on one hand, I agree with you this will likely be “a burden” for ACD, but OTOH we lack a body to have those conversations.",
        "created_at": "2021-03-14T18:06:11.987000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Perhaps one solution is to expect these political decisions, and the people championing them, can come to a consensus prior to coming on ACD. I have some thoughts about the best way to proceed, but am obviously biased here given my role with 1559.",
        "created_at": "2021-03-14T18:06:55.231000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Given EIP-2315 had been discussed, accepted, implemented, tested, and scheduled I had thought that the time for politics had passed.",
        "created_at": "2021-03-14T18:18:20.176000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Anyway, I've discussed these points in more technical detail on the [Agenda issue](https://github.com/ethereum/pm/issues/274) itself.",
        "created_at": "2021-03-14T18:21:46.589000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "\u003e many people have expressed support for my proposals, especially people doing various forms of static analysis.\n\nYes, but which proposal? For static analysis, there's a world of difference between 2315 and 615. \n\n\u003e if we do deprecate static jumps then all compiler teams will require another mechanism for returning from subroutines. EIP-2315 provides a good one.\n\nWell, if we do that (assuming you mean _dynamic_ jumps), we also deprecate jumpsub. Alternatively the spec needs to say how that future form will look - and requiring push32 for every jumpsub is not awesome either.",
        "created_at": "2021-03-14T18:29:31.526000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "(quotes from Greg's link)",
        "created_at": "2021-03-14T18:29:46.961000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "To be clear, I was referring to the BR increase EIP as the political one, not 2315",
        "created_at": "2021-03-14T18:29:52.438000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "A pretty cool idea from the evm-room, by \u003c@682078300234973185\u003e  was to do e.g. JUMPSUB PUSH2 00 01. That format makes it possible to inline args statically, but not mess with jumpdest analysis.",
        "created_at": "2021-03-14T18:32:55.910000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Thanks. Tim.  In my opinion there is a large political component to what I was subjected to.\n\n\u003e For static analysis, there's a world of difference between 2315 and 615. \n\nLess than you think.  615 provides more features, and provides syntax for them.  The security guarantees are nearly the same.\n\n\u003e the spec needs to say how that future form will look - and requiring push32 for every jumpsub is not awesome either.\n\nYes, that is what the spec proposes.  It's not awesome, but it works, and it's backwards-compatible.",
        "created_at": "2021-03-14T18:33:02.922000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Where is the \"evm-room\" ?",
        "created_at": "2021-03-14T18:34:26.041000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003c#706868829900505180\u003e",
        "created_at": "2021-03-14T18:34:56.698000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "https://discord.com/channels/595666850260713488/706868829900505180/817455521341636649",
        "created_at": "2021-03-14T18:35:11.927000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-14T18:36:44.936000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-14T18:36:51.653000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-14T18:36:59.956000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "unpinned the previous pins and pinned overview statements on EIPs considered for London",
        "created_at": "2021-03-14T18:38:11.057000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I'd like the discussion to mostly happen on the issue and here and not take time on the call.",
        "created_at": "2021-03-14T18:39:34.672000+00:00",
        "attachments": null
    },
    {
        "author": "madeof_tin7509",
        "category": "general",
        "parent": "",
        "content": "I like the format of the summary statements with current thoughts on each EIP. Great to have any and all of the discussion here. I didn't mean to seem exclusionary if it seemed as such. It helps me keep track and follow along.",
        "created_at": "2021-03-14T18:41:00.592000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Understood - just a reminder.  And thanks for the link, Tim.  Seems \u003c#706868829900505180\u003e went quiet for a long time, and was awakened recently without my noticing.  It looks like people are -- to some extent -- wanting to rehash six years worth of prior technical discussion.",
        "created_at": "2021-03-14T18:45:19.599000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "So - please do look at https://eips.ethereum.org/EIPS/eip-2315 if you haven't done so very recently.  The difference is not in the opcodes themselves, but in the security analysis.",
        "created_at": "2021-03-14T18:48:43.399000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "A suggestion -- \u003c@!187490121698770945\u003e, \u003c@!552133098075193354\u003e -- if London really is premature:\n\nWe now have several EVM-related proposals on the table.  EIP-1051, EIP-2315, EIP-2327, EIP-3336, and EIP 3337 among them.  Would it make sense to form a working group of their authors -- \u003c@!307777296406806529\u003e \u003c@!211091239112671234\u003e \u003c@!194433073394352129\u003e --- and other interested parties and plan a single post-London upgrade containing all and only EVM-related proposals?",
        "created_at": "2021-03-14T19:06:37.562000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I think this is a good idea, yes! I feel like we should only have one \"big EIP\" or \"theme\" per upgrade, and while we may want to add a few small tweaks alongside it, we should try and focus on one thing, ship it, and then ship whatever next \"big thing\" is ready. \n\nI'd be weary of committing to which \"theme\" is for which upgrade before the work is nearly done, though. For example, right now we could have the merge work and EVM work both happening in working groups in parallel. If the merge is ready first, we should ship that (and only commit to it when it is reasonably ready), and vice-versa for the EVM work.",
        "created_at": "2021-03-14T19:23:22.262000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003c@!489256758989029405\u003e raised this on the previous ACD w.r.t. London \u0026 1559. I generally agree we should try and limit London's scope to 1559 and related EIPs (i.e. removing gas refunds), or very small changes. Otherwise, we risk (and usually end up) delaying the upgrade for another \"big thing\" that's not ready.",
        "created_at": "2021-03-14T19:24:36.478000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "My take is that the EVM  EIPs I mentioned are very nearly ready technically -- or else shouldn't go in yet. And those which have not been implemented already are not difficult to implement.  So I think we are looking at only a few months.\n\nI don't know when \"the merge\" is supposed to happen, but I think the work is largely independent.",
        "created_at": "2021-03-14T19:28:30.362000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "So, if they are \"nearly ready\", then I suspect the fork after London makes sense. Reading above, it seems like what Alexey and Martin want to see is more user validation that the work will bring benefits. \n\nRe: the Merge, agreed it is independent, and it is much earlier in terms of readiness. Assuming EVM is ready before, we should ship that, but if they are both ready at the same time, I still think it is best to ship two distinct forks each of which has a more narrow focus.",
        "created_at": "2021-03-14T19:31:54.318000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I quoted the comments about the various EIPs by Martin and Alexey in the issues directly, to make it easier for folks to quickly glance at them. Here's an example: https://github.com/ethereum/pm/issues/260#issuecomment-798966142",
        "created_at": "2021-03-14T19:36:24.295000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Thanks a lot Tim!",
        "created_at": "2021-03-14T19:41:08.425000+00:00",
        "attachments": null
    }
]