[
    {
        "author": "nav.7",
        "category": "general",
        "parent": "",
        "content": "Hi first thanks all devs for the great work you guys are doing. I heard the ACD call 1 thing I would like to mention is I heard someone say that 4444 is only fixing a mis pricing of the gas fee but if the new pricing is soo low that we need another eip to cap the block size than it seems to me the new price is also a misprice but on the opposite direction. Maybe we need more research on the right pricing otherwise we are just swapping 1 mispricing with another. Just my 2c",
        "created_at": "2021-12-11T01:12:27.279000+00:00",
        "attachments": null
    },
    {
        "author": "toff9",
        "category": "general",
        "parent": "",
        "content": "https://eips.ethereum.org/EIPS/eip-4444",
        "created_at": "2021-12-11T03:08:01.500000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "For comparison, what would be the size of uncompressed Tx payloads for the same range?",
        "created_at": "2021-12-11T06:54:26.960000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "What attack vectors do you have in mind?",
        "created_at": "2021-12-11T06:55:01.259000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "nvm, I have found it in the post that you have provided above",
        "created_at": "2021-12-11T07:25:14.906000+00:00",
        "attachments": null
    },
    {
        "author": "nav.7",
        "category": "general",
        "parent": "",
        "content": "Sorry i got the eips 4444 and  4488 wrong way mixed up",
        "created_at": "2021-12-11T10:04:35.370000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Regarding EIP-4444 preparation here is my thinking. From my POV, the standard for storing/delivering historical blocks is not actually the most important thing. Instead, the standard of delivering the current state (aka state sync) is the most important thing. If historical blocks drop from the network largely, the only way for the new nodes to join would be via some kind of state sync. As far as I understand, in the geth-dominated network, this standard will de-facto be snap sync. Fast sync will be removed in a few months, as far I can gather. So non-geth implementations will either need to switch from fast sync to snap sync or have their own strategy of how to do state sync. In Erigon, we are planning to both use historical blocks (delivered outside of devp2p) and also use state sync (delivered outside of devp2p) + some catch up for recent block. As I mentioned before, Erigon cannot use snap sync as consumer, but it can be used as provider, though it is a lot of work (but will be simpler when our own state sync is working).",
        "created_at": "2021-12-11T14:09:43.156000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "So I would say pouring a lot of energy into standardising historical blocks is probably not wise, it should go into supporting what will become de-facto standard for state sync, or doing some alternatives (as we do)",
        "created_at": "2021-12-11T14:11:54.356000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "also, I have heard about \"importing\" historical blocks functionality as being a direction. Again, I think this is too biased direction, because in our context, for example, importing does not make sense. If the amount of data is so large, you don't want to download it, and then \"import\" it (effectively converting to some native format). It would be much better if downloaded files would be mostly ready for access",
        "created_at": "2021-12-11T14:15:25.589000+00:00",
        "attachments": null
    },
    {
        "author": "jadler2664",
        "category": "general",
        "parent": "",
        "content": "\u003e all existing rollup schemes are either insecure, or not fully trustless.\n\nNoticed this is still up. It's actually incorrect, see: https://twitter.com/jadler0/status/1469454342503780354",
        "created_at": "2021-12-11T15:53:18.075000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "all rollups claim to be trustless in one way or another, it's the inevitable part of marketing",
        "created_at": "2021-12-11T18:00:11.488000+00:00",
        "attachments": null
    },
    {
        "author": "jadler2664",
        "category": "general",
        "parent": "",
        "content": "Fuel v1 is unique in that it actually is.",
        "created_at": "2021-12-11T18:01:45.906000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "everyone claims to be",
        "created_at": "2021-12-11T18:02:33.042000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Can probably s/all/most in the doc, but I don't think that's what would tip things w.r.t. 4488: I think if we could confidently say \"most are trustless\", that would.",
        "created_at": "2021-12-11T18:25:48.465000+00:00",
        "attachments": null
    },
    {
        "author": "lukaszrozmej",
        "category": "general",
        "parent": "",
        "content": "Why Erigon can't use snap sync as a consumer but can as a provider? Is it about storage layout (but then provider is fine?) Or disability to heal? Or something else?",
        "created_at": "2021-12-11T20:23:19.332000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "It is because it uses what we call \"plain state\", meaning the representation where addresses and not address hashes are mapped to tuples (balance;nonce;code;storage), and the same for storage location. Snap sync, as well as fast sync, currently delivers only hashed keys, and we cannot reconstruct the entire plain state from it. The reverse transformation (plain state =\u003e hashed state) is of course possible",
        "created_at": "2021-12-11T20:25:20.657000+00:00",
        "attachments": null
    },
    {
        "author": "thiago_crowdtainer",
        "category": "general",
        "parent": "",
        "content": "hm, this is the exact opposite in terms of the recent priority change from portal team (shift from state sync data to chain history); I'm wondering why the different point of views. Is this a problem specific to erigon? For reference: https://snakecharmers.ethereum.org/the-aperture-vol-4/",
        "created_at": "2021-12-11T20:26:03.755000+00:00",
        "attachments": null
    },
    {
        "author": "thiago_crowdtainer",
        "category": "general",
        "parent": "",
        "content": "Ah, ok, you just answered this I think, above",
        "created_at": "2021-12-11T20:27:20.948000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "It is not specific to Erigon. As I mentioned, we will need to use our own alternative to snap sync for the reasons I just outlined above. It is more about implementations that are not geth and not erigon, what their priorities should be (from my point of view). But of course, they can choose their priorities themselves, my comments are just advisory",
        "created_at": "2021-12-11T20:28:27.764000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I do not personally see the packaging/distribution of historical blocks and headers a very challenging technical problem. Once you've defined the file format, you can use a plethora of existing CDNs to distribute them",
        "created_at": "2021-12-11T20:29:51.718000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "they have a nice append-only property, unlike the state",
        "created_at": "2021-12-11T20:30:28.116000+00:00",
        "attachments": null
    },
    {
        "author": "thiago_crowdtainer",
        "category": "general",
        "parent": "",
        "content": "got it. Thanks for clarifying. I guess part of the reason portal chose to focus on that first, is also that it will be a way of testing the other layers with the simplest use-case first, to then evolve to the more complex case.",
        "created_at": "2021-12-11T20:33:28.946000+00:00",
        "attachments": null
    },
    {
        "author": "lukaszrozmej",
        "category": "general",
        "parent": "",
        "content": "Got it, we are now working full time at changing our db model and sync method. would love to drop the tree. Could you potentially store data by address hash + keep it flat? its like similar to what you do already just use hash instead of address",
        "created_at": "2021-12-11T20:37:19.141000+00:00",
        "attachments": null
    },
    {
        "author": "lukaszrozmej",
        "category": "general",
        "parent": "",
        "content": "and potentially you have snap sync",
        "created_at": "2021-12-11T20:37:25.602000+00:00",
        "attachments": null
    },
    {
        "author": "lukaszrozmej",
        "category": "general",
        "parent": "",
        "content": "I know its additional operation when loading address, but might be worth it?",
        "created_at": "2021-12-11T20:38:46.255000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Yes, we do in fact have such table, but it is not primary, and execution uses plain state as primary. Yes, we could have changed to use hashed state as primary, but we are going in a quite different direction anyway, where none of that would be necessary",
        "created_at": "2021-12-11T20:38:53.025000+00:00",
        "attachments": null
    },
    {
        "author": "lukaszrozmej",
        "category": "general",
        "parent": "",
        "content": "can I ask what that direction is? We are at decision point and having majority client sync support looks a bit too big of a thing to pass on, but would love to hear about alternatives",
        "created_at": "2021-12-11T20:41:30.718000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Of course, I have briefly described it yesterday in my long post, and some initial info is here: https://github.com/ledgerwatch/erigon/wiki/State-sync-design",
        "created_at": "2021-12-11T20:43:41.857000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "The prototype is hard to do, but it is promising so far",
        "created_at": "2021-12-11T20:43:58.243000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "we are trying to take as much stuff as possible out of our database and into files",
        "created_at": "2021-12-11T20:44:18.593000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "and we will keep separation between state and state commitment, because this will be important for supporting other networks with different kinds of commitments, for example, StarkNet",
        "created_at": "2021-12-11T20:45:10.129000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "where most probably, there will be no key pre-hashing before they make it into merkle tree",
        "created_at": "2021-12-11T20:45:30.326000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I think it has been worth going an extra mile onto decoupling",
        "created_at": "2021-12-11T20:46:05.411000+00:00",
        "attachments": null
    },
    {
        "author": "lukaszrozmej",
        "category": "general",
        "parent": "",
        "content": "ok what will be the desired  distribution system?",
        "created_at": "2021-12-11T20:53:18.924000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "BitTorrent, IPFS, Swarm",
        "created_at": "2021-12-11T21:48:57.511000+00:00",
        "attachments": null
    }
]