[
    {
        "author": "heiko5375",
        "category": "general",
        "parent": "",
        "content": "There is a significant cost in delaying the Merge by 3 months.  While the Merge must be done properly and securely, the pace ought not to be dictated by the weakest client",
        "created_at": "2021-05-25T10:28:21.985000+00:00",
        "attachments": null
    },
    {
        "author": "tkstanczak",
        "category": "general",
        "parent": "",
        "content": "One question here, since we are running a similar program at Nethermind. Is the one that you run something Python-Ethereum specific or research specific or EF? Are they supposed to work for EF or with different teams?",
        "created_at": "2021-05-25T10:41:56.851000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "No.\n\nThe worst thing that can happen is a bug in beacon chain or eth1/eth2 client integration - this can potentially freeze the chain and kill Ethereum. We must take time to do it properly, not rush it to our doom.",
        "created_at": "2021-05-25T14:48:48.126000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "Program isn't targeted at any specific job role or organization.  Take a look at this document which explains the program and let me know if you have more questions.\n\nhttps://github.com/ethereum-cdap/cohort-zero/blob/main/program-details.md",
        "created_at": "2021-05-25T14:50:54.273000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "and this one too: https://github.com/ethereum-cdap/cohort-zero#participate",
        "created_at": "2021-05-25T14:51:26.176000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "It would be nice if you could put some effort into softening your tone in this channel.  I don't see anythign in Heiko's message that says that delaying is the worst thing that can happen.  You are engaging him with a hyperbolic response rather than actually discussing the point he seems to be trying to make.",
        "created_at": "2021-05-25T14:53:11.965000+00:00",
        "attachments": null
    },
    {
        "author": "jomuel",
        "category": "general",
        "parent": "",
        "content": "For us (openethereum) the timeline is ok, we are about to merge the London-related EIP implementations and should be able to come up with a release candidate this week.",
        "created_at": "2021-05-25T16:30:03.770000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "yeah, there's two separate merge delay tradeoffs. One is delay vs security, and there it's reasonable to take security concerns seriously. The other is delay vs features, and minimizing delay is definitely far more important than features. I think heiko was speaking more to the second one",
        "created_at": "2021-05-25T16:37:16.638000+00:00",
        "attachments": null
    },
    {
        "author": "heiko5375",
        "category": "general",
        "parent": "",
        "content": "There is also a trade off of speed vs not leaving stragglers behind - unless having those stragglers on board is key to security or culture",
        "created_at": "2021-05-25T20:19:09.363000+00:00",
        "attachments": null
    },
    {
        "author": "heiko5375",
        "category": "general",
        "parent": "",
        "content": "If you look at the extra ETH issued as a result of a 3 month delay - there is also a trade off between that cost and perhaps injecting more resources into the stragglers",
        "created_at": "2021-05-25T20:21:12.176000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003c@!759661208621154334\u003e I generally agree that we shouldn't set the speed based on the slowest team, but I don't think that's really an issue we have at the moment. Teams generally work at a similar pace, so I don't see a world where one team needs, say, 3 months more than others. If that were to happen, we can obviously weight the tradeoffs then, but for now it feels much more hypothetical.",
        "created_at": "2021-05-25T20:27:59.564000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "That said if that happened it'd be worth fully understanding _why_ one team was 3 months behind, since it might be they are running into something that the other teams hadn't considered.",
        "created_at": "2021-05-25T20:30:03.800000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Agreed! Kind of why I feel like this is a \"figure out how to deal with it _if_ it happens\" vs. something we need to proactively plan in advance (vs. , say, deciding whether adding feature X is worth the delay).",
        "created_at": "2021-05-25T20:31:04.586000+00:00",
        "attachments": null
    },
    {
        "author": "heiko5375",
        "category": "general",
        "parent": "",
        "content": "Thanks - glad to hear that.  I’m an avid supporter and hugely appreciative of the immense effort by all the core devs",
        "created_at": "2021-05-25T20:32:27.479000+00:00",
        "attachments": null
    }
]