[
    {
        "author": "schone_wizard",
        "category": "general",
        "parent": "",
        "content": "I think even if it looks bad to delay, the question should be very simple.  what is the objectively right thing to do? if delaying is it, then hype and emotions should be put aside.  2 more weeks or even a full month won't change much at this point",
        "created_at": "2021-07-24T00:03:27.305000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Obviously I'm not a core dev, but from an outside perspective I would hope that the plan would be to continue with the current timeline but extend the testing as much as possible in the time remaining, with the aim of increasing test coverage as much as possible.\n\nA delay without an additional test plan seems to be not useful, and if there is a test plan then it should be able to proceed on the basis that no additional delay is needed (assuming that whatever test plan fits in to the allotted time).",
        "created_at": "2021-07-24T00:04:05.577000+00:00",
        "attachments": null
    },
    {
        "author": "ravensslayer",
        "category": "general",
        "parent": "",
        "content": "A consensus error on mainnet looks much worse than a bad look from a delay, figuratively speaking",
        "created_at": "2021-07-24T00:04:28.175000+00:00",
        "attachments": null
    },
    {
        "author": "schone_wizard",
        "category": "general",
        "parent": "",
        "content": "I think \u003c@!144468805697929216\u003e brings a good point.  I don't necessarily agree about sticking to the timeline, but methods to further the testing coverage should be investigated",
        "created_at": "2021-07-24T00:05:55.747000+00:00",
        "attachments": null
    },
    {
        "author": "protoplanetary",
        "category": "general",
        "parent": "",
        "content": "Random Ethereum community member/occasional solidity dev/Eth2 staker here - the safety of the chain is paramount IMO. If there is anything at all you can think of that would help potentially catch any remaining bugs, I'm in favor of it, even if it would mean a delay. In particular, looking at why this particular bug did not have test cases and why the stress testing on the testnets did not trigger this bug sooner both seem important avenues of investigation, but I'm sure you already know that. But know you have the support of a good chunk of the community to take whatever time you need to insure the update goes according to plan.",
        "created_at": "2021-07-24T00:06:55.973000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "For me the forcing function is the Difficulty Bomb.  If not for that I would propose simply unscheduling mainnet until we have the needed confidence. That would be 4 weeks and ~200k blocks at a minimum. If we see another consensus break then we should pull the ripcord and contemplate Muir Glacier the Second.",
        "created_at": "2021-07-24T00:14:37.721000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "But all these alternatives from my perspective actually incur more risk than focused testing for the next two weeks and keeping the block as scheduled. All clients have a CLI Flag for a late abort (right?  right?!).",
        "created_at": "2021-07-24T00:14:42.284000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "One possibility that shouldn't be discounted is that there are no more consensus breaking bugs that will be tripped on mainnet.",
        "created_at": "2021-07-24T00:14:46.547000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I don’t think it’s particularly helpful to have a fixed reaction to any bug. Whether we need to delay depends a lot on what the newly discovered bug is. Does it open up a whole new avenue of test cases we hadn’t considered or did we just miss one particular case? How much time is required to add tests to properly cover the problematic area? \nI’m this case it sounds more like there’s a small number of missed cases and we should add them and carry on.\nFinding an unexpected bug in one area doesn’t really tell you anything about how much confidence you should have in any other area so a knee jerk reaction to delay doesn’t necessarily help - particularly if we don’t have a clear indication of what more testing we’d need to do to have confidence.",
        "created_at": "2021-07-24T00:21:03.852000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "We have two weeks, that's more than enough time to get our minds around what was missed.",
        "created_at": "2021-07-24T00:23:27.738000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Yep agreed. The key for me is that we need to focus on working the problem. We all know a consensus bug in MainNet is a big deal but we need objectivity, not emotions.",
        "created_at": "2021-07-24T00:25:39.637000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I think it says a lot that there wasn’t anyone pushing for a delay on the call, because that suggests the people who know the bug and the code best are still confident.",
        "created_at": "2021-07-24T00:26:29.770000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Friendly reminder for any non-client-team-member lurking who wants to help: if you do find a London consensus bug and submit it to bounty.ethereum.org, rewards are 2x’d until the fork 😄",
        "created_at": "2021-07-24T00:26:51.897000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "(Wonder if there can be some sort of \"test bounty\", where tests that include new cases/additional coverage could be rewarded?  Might be hard to evaluate, but could also bring a better time/reward trade-off than the whole \"hope you get lucky\" methodology of bug bounties.)",
        "created_at": "2021-07-24T00:29:03.103000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "If anyone wants to spend their weekend adding test cases for London or 1559, I’m happy to use funds from the 1559 multi sig to cover their time 👍",
        "created_at": "2021-07-24T00:29:40.730000+00:00",
        "attachments": null
    },
    {
        "author": "tqpcharlie",
        "category": "general",
        "parent": "",
        "content": "ooo",
        "created_at": "2021-07-24T00:30:42.257000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I think the bar to evaluate is if it gets merged in the test repo 😅 and some amount of judgement, but if funding is your main blocker and you have the skill set to contribute, we can definitely work something out.",
        "created_at": "2021-07-24T00:30:48.382000+00:00",
        "attachments": null
    },
    {
        "author": "hudsonjameson",
        "category": "general",
        "parent": "",
        "content": "Long long ago we tried a chatham house rules call with summary notes only and in general public opinion was negative on it. Appeared too secretive for most people's taste. A cool experiment for the future would be democratic voting for issues anonymously using zero knowledge tech on Ethereum.",
        "created_at": "2021-07-24T00:50:45.919000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "a consensus difference between geth and others on mainnet would be a non-event now. looking at https://www.ethernodes.org/ geth is ~90% of mainnet nodes (including erigon here). on mainnet, at least 85% of miners run mev-geth https://dashboard.flashbots.net/network. from what I know that excludes ethermine, so if ethermine is also running geth, it may be that \u003c1% of hashrate is running openethereum, which wouldn't be that surprising as openethereum is being abandoned after london - can as well switch now.\nthis means that unless a consensus bug crashes geth, or breaks something very fundamental like allowing people to print eth, it wouldn't be actually dangerous and could be fixed in a soft-fork.",
        "created_at": "2021-07-24T02:07:45.717000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "It was not so much \"didn't want to talk about it\". The question was \"does anyone want to push the date?\". I didn't, so I didn't speak. Apparently neither did other folks.",
        "created_at": "2021-07-24T06:05:34.584000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Here we go again, \"difficulty bomb strikes back\" 🙂 you know my opinion on this, of course 🙂",
        "created_at": "2021-07-24T06:41:51.799000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I think it is unfair to assume that now people have to spend their weekends \"adding more test cases\". But core devs should also look at this situation from this point of view when taking \"no delay\" advice. If a bug does not get discovered on mainnet, it is great, it is good we did not delay. If another bug does get discovered, however, the question would inevitably be: \"did you follow at least all your own processes to ensure the code quality?\". If you feel the answer is \"no\", you should ignore people who are saying now: \"but this case is special, you don't need to always follow processes\". Because you cannot say: \"I got bad advice\". The problem is that the processes for such things might not even be written down (I could not find them yesterday to refer to).",
        "created_at": "2021-07-24T06:58:17.184000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Depends.  A bug that allowed a balance underflow could be fine for consensus but bad for ETH.",
        "created_at": "2021-07-24T07:46:09.095000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Consensus forks and execution forks are separate.  In some cases, they will happen at the same time (when we need to update both at the same time) but it is possible for each to be on its own fork cadence.",
        "created_at": "2021-07-24T09:35:24.027000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "It's probably better for them to be at the same time, to reduce the number of mandatory software updates for users and validators",
        "created_at": "2021-07-24T09:36:48.320000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think we should do the other way around.  Execution client updates should move to spec-based process like consensus client updates do, not that consensus client updates should move to the EIP process like execution clients.",
        "created_at": "2021-07-24T09:39:12.277000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I would hate to delay consensus updates because execution client teams are struggling to get work done or vice versa.",
        "created_at": "2021-07-24T09:44:40.713000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Though, you are right that the burden of updating infrastructure is non-zero and should be considered.",
        "created_at": "2021-07-24T09:45:00.548000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "How is that fundamentally different from delaying EIP XXX because of delays in EIP YYY in the same fork?",
        "created_at": "2021-07-24T09:45:26.501000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I *think* because the failure domains are more cleanly separated.",
        "created_at": "2021-07-24T09:47:15.246000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Though, I can see how that argument is kind of weak now that I say it out loud.",
        "created_at": "2021-07-24T09:47:36.977000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "It does make some sense though. Layer 2 protocol updates don't follow hard fork cadence either. I do feel the execution and consensus layers are (to some degree) separable concerns.",
        "created_at": "2021-07-24T09:50:21.136000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "My concern is that if validators are forced to get off their butts and download updates 2N times per year instead of N times, that increases the risk that they'll get lazy and just use a stake pool",
        "created_at": "2021-07-24T09:51:01.491000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Alternatively, if N is large enough they will automate the process (or _someone_ will automate the process) and it will decrease the risk.  Having `geth` on ubuntu available through `apt` is a good example of this, where updates are usually automatic and unattended.",
        "created_at": "2021-07-24T09:53:58.015000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "Automated updates are themselves a really politically risky concept",
        "created_at": "2021-07-24T09:54:12.543000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I think the difference we're talking is in terms of mechanics of the upgrade rather than acceptance of the change.  It's relatively unlikely that someone with even just a single validator will pay no attention to a controversial change, and so will be able to make their informed decision.  But I don't think that optimising for the expected path (and reducing the burden of decentralisation for its users) is a terrible way to go.",
        "created_at": "2021-07-24T09:56:03.688000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "I feel like the ethereum community is already too dangerously close to a default-to-accept mindset in a lot of levels; you don't want pressure of laziness to be *in favor* of potentially controversial changes",
        "created_at": "2021-07-24T09:57:20.929000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I guess that depends on how wide you cast the \"community\" net.  We've seen a lot of discussion around EIP-1559, to take a recent example.\n\nAnd given that it's incredibly rare for an upgrade to be optional, it seems that at the point the upgrade is implemented in released code is far too late to have any sort of meaningful discussion.",
        "created_at": "2021-07-24T10:01:45.360000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "Is there a long-term plan to reduce the number of EIPs pushed per year?",
        "created_at": "2021-07-24T10:01:45.977000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "I personally hope so!",
        "created_at": "2021-07-24T10:02:11.199000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "How about validators are allowed to switch on opt-in switch for each upgrade before the upgrade actually happens? After spec, before code. That way they still need to manually approve but the window of time to do it is bigger.",
        "created_at": "2021-07-24T10:06:29.996000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "I definitely think we need longer lead-times between agreement and code publishing and the HF in the long term",
        "created_at": "2021-07-24T10:07:06.400000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "The tests repo should have test cases for london. I will send more transactions on goerli over the weekend to fuzz it",
        "created_at": "2021-07-24T10:55:32.218000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "Yes, this was my point",
        "created_at": "2021-07-24T14:13:53.534000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "How many hard forks happened when we pushed the bomb back two years?  I think the bombs are useful to prevent pre-mature calcification of the protocol, they are better than existential security threats which is the next most successful way to ensure positive evolution.",
        "created_at": "2021-07-24T16:40:58.273000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "But with the merge I think it's time for it to go.  PoS was always a pre-launch goal and at that point I am OK with protocol calcification.",
        "created_at": "2021-07-24T16:40:58.881000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "Muir Glacier II kind of goes against this point, no?",
        "created_at": "2021-07-24T16:45:07.236000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "Difficulty bombs only force difficulty bomb delays, NOT feature forks",
        "created_at": "2021-07-24T16:45:29.279000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "It provides incentive.",
        "created_at": "2021-07-24T16:45:37.743000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "Feature forks happen when they are done",
        "created_at": "2021-07-24T16:45:37.799000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "A shitty incentive",
        "created_at": "2021-07-24T16:45:47.587000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "Lack of deadlines always causes delays in software projects.",
        "created_at": "2021-07-24T16:46:03.706000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "So no incentive means done will take longer.",
        "created_at": "2021-07-24T16:46:45.921000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "Deadline until Ethereum dies",
        "created_at": "2021-07-24T16:47:12.540000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "Almost like Suicide booth from Futurama",
        "created_at": "2021-07-24T16:47:21.653000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "Incentive was an emergant property. The real purpose was to insure the chain goes to PoS when it is ready.",
        "created_at": "2021-07-24T16:47:28.289000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "Another reason it can be done away with after the merge.",
        "created_at": "2021-07-24T16:48:06.099000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "I'm totally on board with removing it _post_ merge",
        "created_at": "2021-07-24T17:25:50.765000+00:00",
        "attachments": null
    }
]