[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "To clarify my current position.  I think core devs need a forcing function for regular updates.  Without it, we tend to drag our feet and delay rather than doing more frequent small updates.  See Berlin.\n\nI don't like how the bomb works currently.  I would much rather see it as a function of time/block number rather than total difficulty.\n\nI'm open to other solutions to forcing regular/frequent hard forks.  For me, a hard fork every 4-6 months feels like a good cadence.  Such a cadence will force us to improve the HF coordination process.\n\nIf it hurts, do more of it.",
        "created_at": "2021-05-01T02:29:02.310000+00:00",
        "attachments": null
    },
    {
        "author": "evanvanness",
        "category": "general",
        "parent": "",
        "content": "\u003c-    bomb maximalism camp",
        "created_at": "2021-05-01T03:16:17.213000+00:00",
        "attachments": null
    },
    {
        "author": "jadler2664",
        "category": "general",
        "parent": "",
        "content": "This position is only tenable if a similar mechanism is included in Serenity.",
        "created_at": "2021-05-01T16:57:24.359000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e  If 4-6 months is a good cadence, let's start setting the bomb to go off every 4 months, and see how that goes. Then we will spend half of the time on ACDs discussing the parameters of the next bomb or two. You should understand that bombs are a terrible tool for project management. And instead of figuring out the real reasons why \"we drag our feet\", let's attribute it to the lack of the bomb exploding in the next month. Very satisfactory",
        "created_at": "2021-05-01T19:07:33.410000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "\"If it hurts, do more of it\" - more bombs, please 🙂",
        "created_at": "2021-05-01T19:08:27.799000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Personally I don’t see the point in the additional complexity of removing the bomb now given it will be removed by the merge. Deciding the new values to use may be more complex than deciding to remove it but in terms of code setting new values for things that have already changed in previous hard forks is much simpler than implementing new logic which would be required to remove it.",
        "created_at": "2021-05-01T20:26:40.061000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "It sounds like a good argument, but there is no new logic to implement. Using go-ethereum master branch as an example, removing difficulty bomb is creating a function with these lines removed:",
        "created_at": "2021-05-01T20:42:10.184000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "unknown.png",
                "content": "80b9f93c3c033769cec1a952496b6d5221a04275388ccc9daec12cb18ab79dee"
            }
        ]
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Keeping the bomb is to copy-paste the invocation of this function with a parameter that is yet to be chosen",
        "created_at": "2021-05-01T20:42:38.622000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "so not much difference either way, except for choosing the parameter",
        "created_at": "2021-05-01T20:42:52.762000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "if you think we cannot manage to figure out that removing these lines of code is equivalent of not having the bomb, then I think we should all \"pack up and go home\" 🙂",
        "created_at": "2021-05-01T20:47:41.119000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "For me, the argument is not \"we need the bomb to force regular updates\". For me, the most compelling argument is \"if someone wants to fork ethereum, it is not sufficient to just convince people to not upgrade to x.y\". So, if there is a group who wants to fork ethereum to _not_ do 1559, or _not_ do the merge, then they have to actively gain sufficient credibility to make users _switch_ to use their (patched) software. So basically it removes the 'status quo fork' from the available options. We've lived with \"da bomb\" for years, and if we're chucking it out in a not-too-distant future anyway, I don't see why we need to do it now _now_",
        "created_at": "2021-05-01T21:31:35.800000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "I agree that it's not technically challenging. I we (or anyone) wants to chuck it out, the change is simple, yes.",
        "created_at": "2021-05-01T21:34:00.162000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "And this for me is a simple litmus test for the viability of any fork: can they find engineers who are willing to make the change, make a build, and get the software distributed?  That sounds easy _to us_ but it is a surprisingly high bar to clear for some fork organizers. Which to means it is working as intended. No zombie chains.",
        "created_at": "2021-05-01T21:41:00.310000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "It's a technical mechanism for a social solution. My read of the angst over the bomb is how the effectiveness requires examining layer 8, 9, and 10 of the OSI model.",
        "created_at": "2021-05-01T21:43:33.312000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Ok, that is a valid point of view, but I personally believe it is over-thinking. It is \"protecting\" from people who want to make a fork and never maintain the code, but who is going to fall for it? Perhaps 4 years ago yes, but now - I don't think so. I think it is a remnant of existing insecurities perhaps related to Ethereum Classic era. Anyway, If this is a good solution for an existing problem (this is what I am doubting - that the problem exists) I am definitely wondering why Beacon chain does not have the bomb yet 🙂",
        "created_at": "2021-05-01T21:45:21.702000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "Beacon chain cannot viably support multiple forks. The amount of slashing that would occur for both sides makes it a shared fate sort of thing.",
        "created_at": "2021-05-01T21:46:42.291000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Ok, makes sense",
        "created_at": "2021-05-01T21:48:23.486000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "I don't think that's true though? I remember a discussion with Alex and Micah, where it boiled down to conflicting attestations _before_ the PoS chain split being cross-slashable, but not after. It's a bit more nuanced with \"consecutive fork ids\" and all, but that was the gist of it. (found it: https://discordapp.com/channels/595666850260713488/598292067260825641/801869923231596595 )",
        "created_at": "2021-05-01T21:49:30.167000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "so there is no cross-chain slashing after the fork?",
        "created_at": "2021-05-01T21:56:13.044000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "From what I can tell... I'm more of a learning lurker than an expert though 😅  That said, I don't see how cross-chain slashing would add anything to the security of either chain (after a split). They should just ignore each others blocks.",
        "created_at": "2021-05-01T22:01:10.944000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "and the existence of the Merge being designed the way it is (meaning total stop on mining without any kind of hybrid-transition as proposed back in 2018), if the miners want to keep PoW after the merge, they will, regardless of the bomb. Everyone understands that this will require having developers to maintain the code, so bomb is totally inconsequential 🙂 Do you really think they will go \"Oh, we would really love keep mining PoW, but we can't, because we would need to remove 10 lines of code from our favourite mining client - which is a fork anyway with all the MEV stuff 🙂 \"",
        "created_at": "2021-05-01T22:01:49.644000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "The bomb isn’t required in eth2 because a minority chain won’t finalise. So the active steps you need to take to keep a fork running is to do an irregular state transition to remove validators that didnt follow your chain. Or to wait months of non finalisation for their balances to drop enough to be evicted, during which time all validators will lose some money, new validators can’t be on boarded, existing validators can’t withdraw, the chain has massively reduced throughput and nodes require significantly more resources to follow it. \n\nSo basically PoS has a much better bomb already built in. 🙂",
        "created_at": "2021-05-01T22:08:04.939000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "But if there is a contentious split, there is nothing standing in the way of all validators running both chains right?",
        "created_at": "2021-05-01T22:10:00.968000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "They’d need to actively setup a new beacon node for the other chain which would mean twice the resources required. \nAs long as the fork numbers are different you won’t get slashed but you still need to make an active effort to support the fork. And in this case it requires an active effort from a super majority of validators which just isn’t going to happen. Falling just short of the two thirds of validators required to finalise likely still leaves you with months of non finalisation.",
        "created_at": "2021-05-01T22:13:19.195000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "\u003e mean twice the resources required\nI don't think this is remotely as costly as having to _mine_ the two chains though. Anyway, technically it is possible though for two chains to coexist without cross-slashing, and that's what I was chiming in on.",
        "created_at": "2021-05-01T22:17:18.681000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "It’s definitely not as costly as mining two PoW chains but a drop in hashrate in PoW is fairly quickly adjusted for and doesn’t have serious implications for the functionality of the chain (security is obviously affected). But for PoS a sudden drop in the number of online validators is a big problem and does last for a long time. \n\nBut yeah definitely no cross slashing as long as they never share a fork ID.",
        "created_at": "2021-05-01T22:20:30.455000+00:00",
        "attachments": null
    }
]