[
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Do you think that the following addition would satisfy our needs or should it go into more detail around these \"security reasons\"?\n```\nParticularly, this is important for those smart contracts that verifies Merkle proofs linked to transaction, receipt or state trie roots. For security reasons they parse the needed field from a block header string, thus, stick to the existing block format.\n```",
        "created_at": "2021-07-28T09:39:05.171000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "`s/verifies/verify`",
        "created_at": "2021-07-28T09:40:08.712000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003e Particularly, this is important for those smart contracts that verify Merkle proofs of transaction/receipt inclusion and state by validating an externally provided block header hash against the blockhash for a historic block provided by the EVM.",
        "created_at": "2021-07-28T09:41:39.079000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Maybe something like that?",
        "created_at": "2021-07-28T09:41:42.895000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "To answer your question more directly, I don't think we need to go into deep technical detail, just something that makes someone knowledgeable about Ethereum go \"ah, right, I didn't consider that but it makes sense\".",
        "created_at": "2021-07-28T09:42:10.137000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We don't need to deeply explain how things work in the EIP itself though, users who aren't familiar with how the EVM works can at least use the statement in the rationale to go ask the right questions elsewhere.",
        "created_at": "2021-07-28T09:42:50.676000+00:00",
        "attachments": null
    }
]