[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I would be happy to be allowed to travel out of my country and then return home.  😬",
        "created_at": "2021-03-27T04:54:58.544000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "Hi guys, I was just thinking about access list generation. There seems to be an edge case here. The goal of the access lists should be that we provide the \"right\" accounts and slots which we are going to touch. However, when we run a transaction (starting with the empty access list) then we can record which accounts and slots we just touched. But, if we then re-run the transaction, then the behavior of the access lists might change the outcome of this transaction. The edge case is where an internal call touches a slot, but runs OOG. Now if we add it to the access list, this internal call might not run OOG and might change the behavior of the transaction further down the road. What should we do here? Should we re-trace the transaction to see if the access list changes and keep doing this? Or is it possible that if we do that, we get in a flip/flop situation, where the newly reported access list did change, but this is an access list which we already considered before? What should we do here?",
        "created_at": "2021-03-27T18:25:47.540000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "\u003c@!508125616940515329\u003e Yeah I ran into the same problem and basically decided that we would always rerun the transaction until the gas cost for the transaction does not change anymore.\nSee also the discussion over here: https://github.com/ethereum/go-ethereum/pull/22550\nThis might not be the right call, but I think this suffices for automatically creating access lists. If someone needs more control, they can always modify the access lists by hand",
        "created_at": "2021-03-27T18:32:04.734000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "Are you certain that this is not a DoS vector? I am not yet sure if this flip/flop situation can occur. I think it might be possible to come up with such thing. So then you would flip/flop between two different access lists which both report different gas. (You could also stop I guess if the gas used stays the same or increases?)",
        "created_at": "2021-03-27T18:35:31.235000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "CC \u003c@!425269142615097345\u003e",
        "created_at": "2021-03-27T18:35:33.512000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "The problem with using gas costs to determine which accesslist to use is that you can construct a contract where this produces a \"bad\" accesslist.\nE.g. If a internal call is made possible due to a slot in the accesslist, more gas is used than if the call reverts with OOG.\nSo the accesslist that produces less gas might not be the one that you want.\nRe DoS, Yeah you can always construct a call that would always increase the accesslist (e.g. a contract that only does SSTOREs would start with a small accesslist and increase the al on every subsequent call), that is why we capped this at 10 iterations. After 10 iterations, the currently best accesslist is returned",
        "created_at": "2021-03-27T18:40:07.994000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "Yeah this makes sense. This is a much more complex topic than I initially anticipated 😅",
        "created_at": "2021-03-27T18:42:21.684000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "Same!",
        "created_at": "2021-03-27T18:42:53.414000+00:00",
        "attachments": null
    }
]