[
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Have we solved the access problem for Discord yet?\n\nIf I publish a web link to a conversation on our old Gitter channel people can read it without creating an account, and an account with Gitlab, Twitter, or Gitter is only needed to converse.\n\nIf I publish a link to a conversation here people seem to be forced to create a Discord account even to read the conversation.  If so, I think that is an unacceptable reduction of access to and transparency of our deliberations.",
        "created_at": "2021-01-11T17:02:55.495000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "afaik we have not",
        "created_at": "2021-01-11T17:05:32.922000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I thought someone created a matrix bridge or something?",
        "created_at": "2021-01-11T22:20:39.069000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "One could pretty easily write a mirror bot that just mirrored conversations to somewhere like IPFS.  Maybe one file per day per channel with anchors for each message?  Bot could also have an in-chat command to get a permalink to any given message.",
        "created_at": "2021-01-11T22:22:03.454000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I don't know if anyone has done that work though.",
        "created_at": "2021-01-11T22:22:16.631000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I wouldn't know how, but the current situation isn't good.  Especially the next time we make a controversial decision and people want to know why they weren't informed of the discussion or able to participate in time.",
        "created_at": "2021-01-11T22:25:18.306000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "This is probably an issue for the entire Eth R\u0026D  server.  A supposedly open project \"hiding\" in a proprietary system.  I noticed this today trying to read the discussion from one of my own computers where I had no access to my password manager.",
        "created_at": "2021-01-11T22:31:23.604000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This would be a good project for a grant I think.  Discord has an API that is pretty easy to use and the technical expertise required is fairly low.  Writing auditable code is probably the hardest part.",
        "created_at": "2021-01-11T22:32:58.787000+00:00",
        "attachments": null
    }
]