[
    {
        "author": "furriebunnie0730",
        "category": "general",
        "parent": "",
        "content": "hi guys, im asking again for an invite to the call to this OPEN SOURCE project",
        "created_at": "2021-02-01T08:34:04.247000+00:00",
        "attachments": null
    },
    {
        "author": "furriebunnie0730",
        "category": "general",
        "parent": "",
        "content": "i have a diffrente perspective to offer with my 40 years of compliance and techology background, looking forward to moving this project forward",
        "created_at": "2021-02-01T08:35:32.410000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "\u003e There is only one RLPx message where this applies, it seems like a odd one off to break the pattern of [ request_id, \u003ceth65 message\u003e]\n\nWell, the thing is, that RLPx message is already pattern-breaking by itself, as it's the only one that is already comprised of different-typed fields. So adding one more field does not necessarily mean we break a pattern, but instead continue a pattern already established. I'd say it depends on how you look at it, \u003c@!403707149043105803\u003e . But what you're saying, basically, is that to be consistent, we should then also change the other messages to be e.g. `[ req_id, tx1, tx2, tx3 ]` ?",
        "created_at": "2021-02-01T10:45:18.764000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "\u003e i have a diffrente perspective to offer with my 40 years of compliance and techology background\n\nWell, start contributing then. Anyone can't just demand to jump on a call and expect everyone to give them their time of the day without first showing that they have something valuable to contribute. What do you mean by \"moving this project forward\"  ?",
        "created_at": "2021-02-01T10:49:04.843000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "My advocacy is for the EIP as written: a list wrapping the old packet,  List item 1 is the request ID, list item 2 is the old EHT65 packet.  I am not saying what you claim I am saying, please don't put words in my mouth.  That would be one consistent extension of your proposal to all the packets.  PooledTransactions (0x0a) would need some exposition, is it [req_id, [nonce, address, value], [nonce, address, value]...], or [req_id, nonce, address, value, nonce, address, value...]?  How deep does the unwraping go?",
        "created_at": "2021-02-01T15:23:35.292000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "I didn't intend to put words into your mouth, but you did say \n\n\u003e  We should either unwrap all the messages with request id inline, or wrap all the messages like the original spec IMHO, not pick and choose off of implementation details.  And align with that other ethereum specs do (like LES).\n\nI interpret the above like, \"if we go with Peter's suggestion, then consistency requires us to unwrap all messages\". I didn't mean that you advocated for it, only that you argued for it being the natural consequence for the suggested change - and I think that's a bit of a stretch (and obviously something nobody wants to do)",
        "created_at": "2021-02-01T16:22:09.577000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "The unwrapping is very unnatural looking, as you pointed out.",
        "created_at": "2021-02-01T16:36:10.089000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "So if we unwrap, we should go the whole distance.  But I don't think unwrapping is the way to go.",
        "created_at": "2021-02-01T16:39:02.434000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "I guess the two sides are: \"Keep in line with other protocols (les, eth65) + consider request-id as outer 'metadata'\" versus \"Make the protocol as minimal/efficient as possible and don't necessarily align with legacy protocols\"",
        "created_at": "2021-02-01T16:44:02.422000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "Wrapping results in more modular code for both streaming and structure based RLP decoding when clients have to support both eth/65 eth/66 packets (streaming handlers are fine either way).  It winds up being a skeuomorph of the transition, but makes the transition much smoother.",
        "created_at": "2021-02-01T17:03:04.883000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "When fields were added to RLP structures before they've typically been at the end of the structure so indexes remain consistent.  Hard to do when the message is an unbound list.",
        "created_at": "2021-02-01T17:03:42.201000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "We plan to ship eth66 before berlin, so we can later drop \u003c66. Hence support for both will not be an issue for very much longer, hopefully",
        "created_at": "2021-02-01T17:24:56.576000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Based on Micah's feedback, added a TL;DR and 3 Proposed Next Steps: https://hackmd.io/@timbeiko/acd-feedback",
        "created_at": "2021-02-01T18:32:18.558000+00:00",
        "attachments": null
    },
    {
        "author": "hudsonjameson",
        "category": "general",
        "parent": "",
        "content": "\u003c@!323626686170136577\u003e Email me at hudson@ethereum.org and we can discuss the call and what you can do to contribute 🙂",
        "created_at": "2021-02-01T21:20:41.272000+00:00",
        "attachments": null
    }
]