[
    {
        "author": "jadler2664",
        "category": "general",
        "parent": "",
        "content": "\u003e which just isn't going to happen\n\nOut of curiosity, have you heard of \"nothing at stake\"?",
        "created_at": "2021-05-02T16:23:03.966000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I’ve heard the term but not sure if you’re referencing something specific. I say people won’t set up a second validator not because they have something to lose if they do but because it costs them time and money to do so they need something to gain. It just isn’t worth the effort. \n\nBut they do actually have something to lose. It would be quite easy to get themselves slashed by running the same fork on both nodes either now or in the future. And a fork is bad for the minority chain which reduces the value of their stake. Maybe it’s made up for in the value of the other fork but there’s no guarantee. \n\nAnyway I think we’re well off topic here - the point is that there is active effort required to sustain a fork of the beacon chain similar to how the difficulty bomb requires for forks in PoW.",
        "created_at": "2021-05-02T20:29:30.792000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003e we rejected included a change that was proposed for the first time on the call.\nI don't recall that we rejected it.  I thought we decided to continue considering it, given we didn't have enough information to go by yet.",
        "created_at": "2021-05-02T21:13:41.898000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "Idk why I asked this at eth magicians could just have asked here",
        "created_at": "2021-05-02T22:10:18.005000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "For EIP3529 is there any case where we can hit the max refunds? I tried clearing 100 storage slots but this did not yield the max refund for me",
        "created_at": "2021-05-02T22:10:36.537000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "For 3541 I'm assuming that if I try to deploy a contract with deploycode 0xEF.... the abort consumes all gas?",
        "created_at": "2021-05-02T22:15:19.410000+00:00",
        "attachments": null
    }
]