[
    {
        "author": "xoheb",
        "category": "general",
        "parent": "",
        "content": "the 1024 stack items also include pointers to reference memory right?\n(each of which would take up 2 slots)",
        "created_at": "2021-09-23T11:20:26.319000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "The stack has always been 1024 items of 256 bits.  1 item is more than enough to index a location in memory, if that is your question \u003c@!726055386142212216\u003e.",
        "created_at": "2021-09-23T13:32:46.038000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "Have a look at https://eips.ethereum.org/EIPS/eip-3670 which is the simplest first step towards that.",
        "created_at": "2021-09-23T16:01:28.858000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Thanks, \u003c@!425279588009246720\u003e, I hadn't considered that way of going wrong.  As other instructions with immediate data get added the same problem will arise.  Could these be considered a form of invalid instruction?",
        "created_at": "2021-09-23T16:58:08.220000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I'm stressing the concept of safety here because it arises often with no agreed definition.\n\nI think I can validate the properties I give with fewer restrictions than EIP-615, and without deprecating dynamic jumps - just taming them.\n\nThat is because I think that in actual code the destinations of most dynamic jumps can be limited to a finite set by a simple static analysis. But the proposal remains a Draft until I'm sure.\nhttps://eips.ethereum.org/EIPS/eip-3779\n\nAnd even minimal taming of dynamic jumps would let static versions of subroutines and jumps can ensure safety.\nhttps://eips.ethereum.org/EIPS/eip-2315",
        "created_at": "2021-09-23T17:51:04.773000+00:00",
        "attachments": null
    }
]