[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This is no different from any other hard fork and it doesn't really matter.  Anyone can fork Ethereum at any time, that is the nature of a permissionless open source system.",
        "created_at": "2021-02-20T01:38:56.924000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "In fact, I actively support people forking Ethereum if they don't agree with the long term vision of the core developers.",
        "created_at": "2021-02-20T01:39:30.791000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I don't think it depends on whether a slot or a block number is used to mark the transition. Entire chain history won't be required by consensus anymore and validators may use this opportunity to prune unnecessary data e.g. after finality. Some of the apps that rely on the history will need to be able to download it from somewhere and one of the questions whether we support it on L1 by retaining a part of ETH63 protocol responsible for chain history or defer it to anything else like services that e.g. shares big chunks of history via bittorrent. My preference would be to retain headers, blocks and receipts downloader until we're convinced that there is a reliable replacement for it. ENR may be used to mark nodes that stores history on discovery layer. Keeping the history downloader would require keeping eth1 block format after the merge.",
        "created_at": "2021-02-20T04:51:19.677000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "Btw funny to read this comment given how yesterday's call went",
        "created_at": "2021-02-20T04:54:52.906000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "I guess it takes \u003c@273808422753796097\u003e backing to compress 'pushing through' into 14 minutes on ACD",
        "created_at": "2021-02-20T04:56:27.247000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I still stand by that comment.  I think the core devs all want to remove self destruct (and refunds in general), but to get it past the finish line we need someone to do an impact analysis.",
        "created_at": "2021-02-20T05:09:07.990000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I *suspect* that without that we'll get stuck prior to it being released.",
        "created_at": "2021-02-20T05:09:29.830000+00:00",
        "attachments": null
    },
    {
        "author": "shamatar",
        "category": "general",
        "parent": "",
        "content": "It’s only a negligible reduction of any problem surface because a subset will need almost all the ops, and if that subset “works” then most likely the whole math engine “works”, so you only reduce a number of possible API calls that are nothing to do with cryptographic operations",
        "created_at": "2021-02-20T15:53:31.319000+00:00",
        "attachments": null
    },
    {
        "author": "shamatar",
        "category": "general",
        "parent": "",
        "content": "What would be a good place for discussion of EVM feature removal proposal to not spill a chat? GitHub issue doesn’t look like the best place too",
        "created_at": "2021-02-20T15:55:56.969000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Maybe we can convince one of the \u003c@\u0026595685821026271242\u003e to create a channel for \u003c#706868829900505180\u003e-graveyard or something (name TBD).",
        "created_at": "2021-02-20T16:15:05.384000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "\u003c#812719315136675850\u003e (other mods free to change the name if any better ideas)",
        "created_at": "2021-02-20T16:19:44.860000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003c@!425572898787426305\u003e what I was trying to get at is basically how easy/hard do we want to make it for people to fork against PoS? For example, if we try and time it with the difficulty bomb, then the pre-merge chain will need an explicit fork to keep going. If we don't, then maybe it continues and \"forks by default\" (ex: miners still mine and then the transition to PoS is solely based on running a client that swaps the consensus engine). I think we should be explicit in that design choice, and communicate it early to set expectations for the community (ex: \"the eth1 chain _will_ keep going with PoW, but \"Ethereum\" will move to PoS at X time\" vs. \"we expect after block Y, no more blocks will be mined on the PoW chain unless someone explicitly creates a fork\")",
        "created_at": "2021-02-20T16:39:09.056000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I'm a big fan of the former personally, though I wouldn't be opposed if we *happen* to get the ice age timer just right.",
        "created_at": "2021-02-20T16:41:03.545000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I like people having the freedom to make choices, even if I disagree with them.  🙂",
        "created_at": "2021-02-20T16:41:21.787000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Yeah, I have no strong position here, aside from \"whatever we choose, it must be made explicit to reduce the amount of scams + general confusion\" 👍",
        "created_at": "2021-02-20T16:43:18.313000+00:00",
        "attachments": null
    },
    {
        "author": "evanvanness",
        "category": "general",
        "parent": "",
        "content": "bomb should be annual imho",
        "created_at": "2021-02-20T16:58:59.996000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "less than a year is what we're going for",
        "created_at": "2021-02-20T17:00:46.204000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I feel like ~9 months is probably the sweet spot: aim to push it back every 6 months, and if something goes wrong we have 3 months wiggle room",
        "created_at": "2021-02-20T17:01:18.355000+00:00",
        "attachments": null
    },
    {
        "author": "holgerd77",
        "category": "general",
        "parent": "",
        "content": "I think we shouldn't make it too easy for people to just \"jump on the bus\" and keep the old chain going. This will likely be extremely attractive to short-term squeeze a lot of money out of this and to leverage the situation of people not so deep in the matter  being confused on what the correct Ethereum is. And this will likely be more severe the stronger a potential old chain remains, not much to win of this situation.\n\nA remaining PoW chain also counteracts on the positive environmental impact the switch to PoA will have.",
        "created_at": "2021-02-20T19:05:28.771000+00:00",
        "attachments": null
    },
    {
        "author": "dkdkdkdkdkdk",
        "category": "general",
        "parent": "",
        "content": "\u003e This will likely be extremely attractive to short-term squeeze a lot of money out of this and to leverage the situation of people not so deep in the matter  being confused on what the correct Ethereum is.\nhow do you imagine this happening? selling ETH on the old chain? I doubt people not so deep in the matter would buy from random people...",
        "created_at": "2021-02-20T19:28:50.639000+00:00",
        "attachments": null
    },
    {
        "author": "holgerd77",
        "category": "general",
        "parent": "",
        "content": "Hire 20 people - 5 to do marketing and convince enough people that this is the *real* Ethereum and some exchanges to still list, 10 developers to keep a client + some infrastructure going, maybe 5 doing ops - and then trigger a short term fork eliminating the difficulty bomb + set some (overpaid) percentage of the miner fees going to the team respectively some intermediary contract.\n\nLet me know if you think this scenario is too far fetched.\n\n(and on second thought I wonder if there is a way to avoid such a scenario at all?)",
        "created_at": "2021-02-20T20:55:07.885000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "Yeah, I'm not inclined to put any effort towards supporting the POW chain continuing.  I'm open to arguments to the contrary but it seems like a distraction from the large pile of more important work that needs to be done.",
        "created_at": "2021-02-20T21:23:53.750000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "The application layer will implode spectacularly on a minority fork (e.g. all the interconnected defi requiring eth collateral and even real world backed assets). I dont expect minority forks in todays ethereum environment to prove too viable",
        "created_at": "2021-02-20T21:34:23.813000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Seems to me the point isn't whether the entire chain history is needed for consensus or whether some apps currently need it, or whether it might be available elsewhere.  A blockchain simply _is_ a ledger of past transactions.  Or am I missing something here?",
        "created_at": "2021-02-20T21:45:33.381000+00:00",
        "attachments": null
    }
]