[
    {
        "author": "___condor___",
        "category": "general",
        "parent": "",
        "content": "Is a mainnet block going to be picked? Or are we waiting for Tim to get back?",
        "created_at": "2021-07-02T05:23:52.237000+00:00",
        "attachments": null
    },
    {
        "author": "holgerd77",
        "category": "general",
        "parent": "",
        "content": "\u003c@\u0026595684226221735986\u003e \u003c@\u0026688101493978562687\u003e \u003c@\u0026652918665943056397\u003e \u003c@\u0026836981603216654336\u003e \u003c@!206016661470314496\u003e \u003c@!194432762315407360\u003e It would be relatively high on our (EthereumJS) wishlist to have some kind of **networking roadmap** which can somewhat serve as some point of reference when networking/devp2p updates will happen (currently \"looking up the roadmap\" means  desperately searching in *some* chat channel where I was \"so sure\" that Peter said something on that some weeks/months ago 😂 ).\n\nWould it make sense to add some kind of roadmap document to https://github.com/ethereum/devp2p (alternative: https://github.com/ethereum/eth1.0-specs) ? For now I would suggest - since we don't have some kind of standarization or exchange process yet on this - that we just add a timeline with some past and future reference when the different clients have dropped specific protocol versions respectively plan to drop, could look something like that (simplified + made-up version numbers):\n\n- ...\n- January 2021, Besu 1.3.5, Introduction of ETH/65 support, dropped ETH/63 Support\n- March 2021, Geth 5.3.0, Introduction of ETH/66 support, hardcoded ETH/65 along London HF (July/August 2021)\n- March 2021, new LES/4 version, see https://github.com/ethereum/devp2p/blob/master/caps/les.md#les4-march-2021\n- ...\n\nSomething like this (can likely be a lot better presented, would give this some additional thought). This would be some first step and would give a lot better orientation than we have with the current situation.\n\nClients would then be encouraged to do PRs against this every time they do a substantial networking change or deprecation. WDYGT? 🤔 If somewhat supported I am happy to open a PR on this.",
        "created_at": "2021-07-02T08:22:00.795000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "Sounds like too much work for very little benefit",
        "created_at": "2021-07-02T09:37:16.838000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "it's not like we're changing protocols like rolls of toilet paper - we've had what, 5 `eth` protocol versions over the course of Ethereum history?",
        "created_at": "2021-07-02T09:38:26.550000+00:00",
        "attachments": null
    },
    {
        "author": "holgerd77",
        "category": "general",
        "parent": "",
        "content": "Gna, this isn't that much work (you don't have to worry about my initial work to set up 😋 ). If there aren't that many networking updates, there just also won't be that many roadmap updates needed, so that goes somewhat linearly. Also note that there are also other protocols which receive updates like `LES`, the underlying `RLPx` protocol as well as discovery.\n\nAt the end I would assume this to *safe* some time to have some central source of information here, preventing people from asking repeatedly because they are not sure about timelines. It also helps prevent coordination failures. A network protocol version update is a serious thing - similarly to a HF - and can have somewhat severe consequences like a client being completely cut off from the network.\n\nSo from my PoV we should give this coordination aspect some minimal attention. 😄 (I actually wonder if we have done this sufficiently on this `ETH/66` update: how does this actually work? Is this hardcoded into geth and from the HF block onwards `ETH/65` and below connections are not allowed any more? Has this transition actually been tested? E.g. was this assumed mechanism (if correct) also active along the testnet HFs?)",
        "created_at": "2021-07-02T10:34:56.112000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "devp2p is orthogonal to hardforks - protocols are added and removed with client upgrades, not block numbers",
        "created_at": "2021-07-02T10:49:36.829000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "as long as you keep running the same release, it will support the same fixed set of protocol versions",
        "created_at": "2021-07-02T10:50:39.890000+00:00",
        "attachments": null
    },
    {
        "author": "holgerd77",
        "category": "general",
        "parent": "",
        "content": "I guess in this case of the `ETH/66` drop, it might be connected to the HF block number though? 🤔 Let's wait for some clarification from someone from geth.",
        "created_at": "2021-07-02T10:57:20.253000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I *think* the plan is that the Geth update after London will drop ETH/66 support.",
        "created_at": "2021-07-02T11:17:29.271000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "Probably yes, so the network spec updates are not related to the hf. We will (most likely) drop 65 one release after the london release.",
        "created_at": "2021-07-02T11:31:50.651000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "If you want to maintain a timeline \u003c@425269142615097345\u003e that would be fine by us, with the small caveat that we might not adhere to the dates that we set now (as other work might interfere)",
        "created_at": "2021-07-02T11:33:16.409000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "This document is old, current block is from June 9",
        "created_at": "2021-07-02T12:30:18.784000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "Also: \"TL;DR: we can expect the difficulty bomb to become noticeable in ~300k blocks, or in ~45 days at around block 12900000. Blocks 1 (July 28) \u0026 2 (August 4) proposed for mainnet would fall in this period, while blocks 3 \u0026 4 would happen after the next difficulty bomb increase.\"",
        "created_at": "2021-07-02T14:09:57.751000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "12900000 = July 25 so around then?",
        "created_at": "2021-07-02T14:10:10.906000+00:00",
        "attachments": null
    }
]