[
    {
        "author": "yperbasis",
        "category": "general",
        "parent": "",
        "content": "I've submitted a PR to update the Yellow Paper to Istanbul (w/o EIP-2200) + Muir Glacier: https://github.com/ethereum/yellowpaper/pull/796. Can somebody review it please?",
        "created_at": "2021-06-07T10:20:59.043000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "That's cool. What do you think should be done with the authorship of this paper? It lists Gavin Wood, who created original version. Do you think we should either remove it or also add effective co-authors?",
        "created_at": "2021-06-07T12:47:06.013000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Actually, one cannot remove it completely, because licence requires attribution",
        "created_at": "2021-06-07T12:48:45.820000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "that licence looks way too complicated for my understanding 🙂",
        "created_at": "2021-06-07T12:50:18.492000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "The \"Core Developer Apprenticeship Program\" received almost 400 applications.  We are only going to be explicitly \"accepting\" a very tiny portion of the applicants.  We are operating the program \"openly\" and allowing anyone to participate who wishes to do so.  This is still going to leave a very large number of applicants who want to get involved but don't have a clear path to do so.\n\nWe will be sending out emails to all of the applicants by the end of this week.  Included in this will be an option to opt-in to us sharing their application with those of you who might be interested in something in the realm of hiring, interns, mentorship, whatever.  If you or your team would be interested in this, send me a direct message here on discord or an email to `piper@ethereum.org` with 1) Who you are and what team you represent 2) What type of position you are looking to fill.",
        "created_at": "2021-06-07T16:05:10.991000+00:00",
        "attachments": null
    }
]