[
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I am in favour of the former. Reducing the pushback period of difficulty bomb to something like 9 or 12 months make a lot of sense in that regard.",
        "created_at": "2021-02-22T04:38:36.175000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Validators won't have to store and serve ancient chain data which reduces the cost of hardware for them. On the other hand, mainnet will likely have to keep the history for application needs, at least up to a certain point in the past. ETH63 may be re-used for that purpose for the beginning because creating more efficient algorithm would require additional time and resources.",
        "created_at": "2021-02-22T04:49:46.831000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Re: ledger of past transactions. Beacon chain has history accumulator which could be used to proof _any_ piece of data ever published on chain and each app could store the history on its own with corresponding proofs. An open question for this model is how the node that just joined the network can catch up with what was published a long time ago if it needs this data.",
        "created_at": "2021-02-22T04:59:42+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "general",
        "parent": "",
        "content": "The issue reminds me to the \"who is the last miner\" problem but extended beyond the moment PoS is switched on, maybe one option is to give miners an incentive for them to align with the PoS chain for at least a couple of months.\n\nSomething similar to what's going on with the beacon chain could be implemented, a smart contract that can mint some new ETH for 6 months or 1 year, it gives ETH to miners in the same way a mineable ERC20 does, but it's real ETH.\n\nThis contract could start giving enough rewards so it matches the security budget of the PoW chain at the time of the merge, and linearly go down until it reaches 0 after one year, something like this could remove the urge to coordinate a non-merge ETH fork, and it wouldn't be that bad from the emission point of view, since it's practically the status quo if there is no merge.",
        "created_at": "2021-02-22T10:42:18.405000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "\u003e maybe one option is to give miners an incentive for them to align with the PoS chain for at least a couple of months.\n\u003c@!469936733073702915\u003e  i was thinking about something similar. We'd introduce a lot of users (miners) to eth2 and keep them in the ethereum ecosystem, which would be 👍🏽",
        "created_at": "2021-02-22T10:58:40.635000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This was discussed on the last call and the top suggestion IMO (not everyone agrees) was to just have some smallish out-of-band reward for 100 blocks after the fork block.",
        "created_at": "2021-02-22T11:09:41.732000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "100 blocks on eth2?",
        "created_at": "2021-02-22T11:10:08.500000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "ETH1.",
        "created_at": "2021-02-22T11:10:13.652000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Just to encourage miners to not just keep re-mining the transition block over and over.",
        "created_at": "2021-02-22T11:10:31.596000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "They would all be empty blocks.  Its just to incentivize not re-mining head over and over.",
        "created_at": "2021-02-22T11:11:20.813000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "i see, a smoother transition would be if they were rewarded on the eth2 side for a few blocks",
        "created_at": "2021-02-22T11:11:48.766000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "wdyt?",
        "created_at": "2021-02-22T11:11:51.304000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "general",
        "parent": "",
        "content": "Yep that was the original proposal, but only for the last miner problem. I think we can use the same mechanic for \"avoiding drama\" to put it in some words. The only downside that I see to this approach is that it keeps the \"high issuance\" and carbon emissions for a couple months more, but if the merge becomes contentious that's going to happen anyway.",
        "created_at": "2021-02-22T11:12:08.228000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "general",
        "parent": "",
        "content": "It's the same thing, but allowing miners to mine empty blocks for a couple of months instead of 100 blocks.",
        "created_at": "2021-02-22T11:12:32.501000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "general",
        "parent": "",
        "content": "We could even make that process die using the ice age, but implemented inside an ETH 2.0 contract instead, and only affecting to the empty blocks rewards. When the empty words reward starts to die out we would probably see some miners ask for a refill, but then the \"threat\" of forking out from the already running PoS chain has very little weight.",
        "created_at": "2021-02-22T11:14:41.488000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Can't say I'm a big fan of paying funds to \"avoid drama\".  A winding down of rewards to provide security to the last block mined by PoS, sure, but that should be for a relatively small number of blocks (5-10K, which is roughly 1-2 days) seems reasonable.  Weeks or months, less so.",
        "created_at": "2021-02-22T12:03:30.658000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "general",
        "parent": "",
        "content": "But drama may as well push back the merge a couple of months too, or at least introduce uncertainty that causes similar damage; apart from the increased inflation what other cons do you see for the prolonged empty blocks mining?",
        "created_at": "2021-02-22T12:05:07.714000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Keeping PoW going wouldn't be great in terms of optics - questions could be asked why we're still burning all that electricity when we have proof of stake.\n\nAny funds payout not directly related to chain security moves Ethereum to a \"who shouts loudest\" model of payment.\n\nAnd ultimately all that is happening is delaying the inevitable situation where miners have no income from Ethereum and react accordingly.  The idea that payment at time _x_ ensures good behavior at time _x+n_ is one that isn't borne out by history.",
        "created_at": "2021-02-22T12:28:36.989000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "general",
        "parent": "",
        "content": "We don't want to incentive good behaviour on time x+n, we want to incentive good behaviour around x, that's the moment of the merge and thus the most likely moment a group of miners may try to fork off the chain.\n\nOf course even if we keep paying during 6 months they could try to fork the chain, but then they would need to compete with the PoS chain also paying them to mine, splitting their efforts.\n\nIn x+n they could try to reverse back the original merge, but if the reward slowly fades out it becomes a big coordination challenge, a they will have very few arguments to roll back the merge that already happen successfully 6 months ago.\n\nThe burning electricity argument is the most compelling one, I figure 6 months of PoW would have a measurable carbon footprint, but I think we should consider two things:\n\n1) The PoW carbon footprint is directly correlated to how much is being paid to miners, if this PoS empty block reward goes down linearly then after 3 months the carbon footprint would already be half, and after 6 it would be gone.\n\n2) If we have to push back the ETH 2.0 merge because we have to fight off a large number of miners making fud, then we are already worse off, because we are having 3 months of 100% PoW instead of it linearly going down.\n\n\u003e And ultimately all that is happening is delaying the inevitable situation where miners have no income from Ethereum and react accordingly.\n\nIt's very different having a sudden cutoff from slowly letting the incentives for PoW miners dry-out, the later is far less likely to cause a revolt.",
        "created_at": "2021-02-22T13:32:08.830000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "Are there any arguments for 6months? Sounds quite long.",
        "created_at": "2021-02-22T13:42:08.262000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "general",
        "parent": "",
        "content": "I don't have any, it's more of a placeholder duration for the sake of the example. I guess it could be shorter, this is only a temporary thing to deter miners from attacking the merge, nothing more.",
        "created_at": "2021-02-22T13:47:10.520000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I think the challenge here is that we don't need to \"support PoW continuing\" as much as \"stop it continuing\": the default right now _is_ that it will continue (with a DeFi implosion, and not be very useful).",
        "created_at": "2021-02-22T16:14:07.150000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Yeah, I suspect that the \"right amount\" is either (1) up to the next finality checkpoint on the beacon chain or (2) the same as the follow distance (2048 blocks IIRC). If we're confident in processing deposits in that period, we should be confident in selecting a last block with 2047 empty blocks beyond it.",
        "created_at": "2021-02-22T16:16:18.621000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "👍🏽 the only questionable part is in how to payout miner rewards on eth2.  However, Miners would be forced to use eth2 in order to access their funds and ideally we'll keep them in the ecosystem as a non-miner 😉",
        "created_at": "2021-02-22T16:24:31.085000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I think \u003c@!273808422753796097\u003e once proposed you maybe just do it off-chain or by manually sending ETH to their accounts on Eth2",
        "created_at": "2021-02-22T16:33:46.873000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "yeah pretty much",
        "created_at": "2021-02-22T16:34:05.021000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "I really think it's not worth it to build the infrastructure to pay them automatically",
        "created_at": "2021-02-22T16:34:17.165000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "IMO this is something where using a \"good enough\" vs. \"perfect\" approach can make a 3 month difference on shipping the merge 😅 It's _way_ cheaper to pay those last, say, 2048 blocks, at 2x the reward off-chain than to delay the merge by N months.",
        "created_at": "2021-02-22T16:34:18.846000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "Just make a fund, the EF can contribute a few hundred to a thousand ETH and all is good",
        "created_at": "2021-02-22T16:34:40.681000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We only need the PoW chain to be mined long enough for PoS to agree on the transition block.  That should be on the order of hours I suspect.",
        "created_at": "2021-02-22T16:35:08.927000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "general",
        "parent": "",
        "content": "Yes for the \"last miner\" problem I agree, it's only a couple of hours. I was proposing an alternative scheme that kept the PoW reward in parallel with the PoS reward (like now, but with PoS being the consensus), in order to deter miners from pushing back against the merge",
        "created_at": "2021-02-22T16:36:29.863000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "general",
        "parent": "",
        "content": "but I also I agree that it may not be worth the trouble, because something like that couldn't be easily subsidised by the ef, and we would need to develop something special to support it",
        "created_at": "2021-02-22T16:37:12.654000+00:00",
        "attachments": null
    },
    {
        "author": "dkdkdkdkdkdk",
        "category": "general",
        "parent": "",
        "content": "is there any evidence that miners might push back against the merge?",
        "created_at": "2021-02-22T16:38:20.360000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003c@!132497957135187968\u003e I'd say it really depends on each miner, but I don't think we can assume they will all go along",
        "created_at": "2021-02-22T16:38:45.004000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "general",
        "parent": "",
        "content": "I mean we are seeing pushback for 1559 and that's only cutting part of the rewards, my guess is that pushback for the merge is going to be a lot worse",
        "created_at": "2021-02-22T16:39:05.633000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Yeah: MVP is a N of N gnosis safe where some of the Ns are the EF, maybe a core dev?, and a bunch of different miners",
        "created_at": "2021-02-22T16:39:40.143000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "So all miners need to agree to each others' rewards",
        "created_at": "2021-02-22T16:39:49.184000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I think it may not be worse because a lot of miners have invested in staking infrastructure vs. 1559 which is a \"pure loss\", but IMO we should expect something at least on a similar scale. From reading the 1559 channel, the biggest \"risk\" is a lot of miners probably still expect the merge to be 2-3 years away, when it may be ~12 months.",
        "created_at": "2021-02-22T16:40:44.003000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "general",
        "parent": "",
        "content": "It can also be achieved by seeding a mineable-style contract right? spiking the multisig altogether",
        "created_at": "2021-02-22T16:40:50.766000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "It can be achieved many ways for sure 🙂",
        "created_at": "2021-02-22T16:41:08.547000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "general",
        "parent": "",
        "content": "If that multisig exist it will also be fuel for the merge fud 😛",
        "created_at": "2021-02-22T16:41:41.526000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "general",
        "parent": "",
        "content": "just kidding, I guess it depends on how long this empty block subsidy lasts",
        "created_at": "2021-02-22T16:42:31.790000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "I checked our bootnodes a bit, and it seems most clients support `eth65` -- I guess the only questionmark is Besu. Does Besu support it \u003c@!403707149043105803\u003e ? https://gist.github.com/holiman/55d522d3cf6b09c578bad6c0368d4a9c",
        "created_at": "2021-02-22T17:31:21.155000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "Yes.",
        "created_at": "2021-02-22T17:31:35.305000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "It's been on since late last year. 20.10.3 or later to be precise.",
        "created_at": "2021-02-22T17:31:50.486000+00:00",
        "attachments": null
    },
    {
        "author": "0xraino",
        "category": "general",
        "parent": "",
        "content": "\u003c@!206016661470314496\u003e which testnet did you want all the clients to set up miners on again?",
        "created_at": "2021-02-22T20:29:56.320000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Ropsten, I beleive",
        "created_at": "2021-02-22T20:37:07.759000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "general",
        "parent": "",
        "content": "OpenEthereum does not have `eth/65` support yet, we are working to replace big chunk of code for both `eth/65` and `eth/66` support",
        "created_at": "2021-02-22T21:14:28.327000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "How come I saw this then?\n```\n   caps: [\"eth/62\", \"eth/63\", \"eth/64\", \"eth/65\"],\n    name: \"OpenEthereum/v3.1.0-stable-2072341-20201102/x86_64-linux-gnu/rustc1.47.0\",\n```\nis that some experimental node? Or does it erroneously announce it?",
        "created_at": "2021-02-22T21:24:25.846000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "(I might have copy-pasted wrongly when I collected it)",
        "created_at": "2021-02-22T21:30:07.590000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "general",
        "parent": "",
        "content": "I would be really surprised if there is hard-coded  `eth/65`, we dont register it as protocol.",
        "created_at": "2021-02-22T22:01:19.621000+00:00",
        "attachments": null
    }
]