[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I'll reiterate the message from https://discord.com/channels/595666850260713488/745077610685661265/902497430212329492 then, we can easily deploy a deposit contract and start a merge devnet in less than a week, with a good TTD target and even better, under realistic conditions with the bomb about to go off",
        "created_at": "2021-10-30T00:38:21.428000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I see a lot of value of turning Ropsten into PoS after the next iteration of engineering efforts on the Merge is done. As the definition of done we could use something like: a couple of weeks of more or less stable run on the devnet",
        "created_at": "2021-10-30T04:54:28.015000+00:00",
        "attachments": null
    },
    {
        "author": "suburbandad_",
        "category": "general",
        "parent": "",
        "content": "shall we add an arrow glacier block for ropsten then?  That way the chain is being actively mined when the transition occurs (for full fidelity with mainnet transition).",
        "created_at": "2021-10-30T05:38:03.896000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "If I understood correctly both your message and Mikhail's, then there's no need, we should get there before the bomb is really  felt, presumably near the same current estimations that are being made for mainnet.",
        "created_at": "2021-10-30T06:17:22.429000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Yeah, I don't think pushing back the bomb on Ropsten worth the efforts in the perspective of its upgrade to PoS",
        "created_at": "2021-10-30T06:56:47.930000+00:00",
        "attachments": null
    },
    {
        "author": "schone_wizard",
        "category": "general",
        "parent": "",
        "content": "is there a chance of increasing difficulty from the bomb sabotaging the terminal difficulty needed for merge transition?",
        "created_at": "2021-10-30T22:48:06.767000+00:00",
        "attachments": null
    },
    {
        "author": "schone_wizard",
        "category": "general",
        "parent": "",
        "content": "also, not sure if this is needed as we have much experience with it, but maybe worth doing the arrow glacier hf just to simulate every event that will eventually be played out on mainnet to say we have hardened test cases.  i dont think erroring on the conservative side when it comes to anything related to the merge is a bad idea",
        "created_at": "2021-10-30T22:49:21.008000+00:00",
        "attachments": null
    }
]