[
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "I thought Ropsten will be sunset anyway?",
        "created_at": "2021-11-02T05:53:41.666000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Yes, it will be, but if we're sunsetting it, why not run the merge on it before 🙂 ?",
        "created_at": "2021-11-02T14:59:54.320000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "But do you guys really need to be ready for the merge itself? I'm principle we can easily merge Ropstein this year before the bomb is visible, and providers can join in later with the same setup. Surely there'll be tons of testnets for the fork itself before the actual merge in mainnet",
        "created_at": "2021-11-02T15:31:16.936000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I do agree that it seems far fetched to get stable client releases this year with the yet-to-be-released merge spec",
        "created_at": "2021-11-02T15:32:13.695000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "IMHO merging Rospten should be seen as a dress rehearsal or RC type deal for mainnet, not something that would be done with a merge spec that is not locked-down except for critical bugs.",
        "created_at": "2021-11-02T15:53:21.223000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "we're working on releasing a merge spec *today* for a target testnet at end of month\n\nThis should shake out any bugs and final spec changes (hopefully none or minimal) as the testnet runs through the holidays\n\nAssuming we are confident with specs in Jan and assuming Ropsten is planned to be sunset, then merging it in mid-January as a first big testnet merge seems like a reasonable target\n\nIf it goes well, great, ropsten will die soon after. If it fails, whoops. If specs change slightly from there, it's okay because ropsten is sunset",
        "created_at": "2021-11-02T15:55:48.876000+00:00",
        "attachments": null
    },
    {
        "author": "schone_wizard",
        "category": "general",
        "parent": "",
        "content": "if things go well with ropsten, what might be the next steps to eventually bring this live to mainnet?",
        "created_at": "2021-11-02T15:58:22.406000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "bring what, the merge?\n\ntons of testing, calling specs \"final\", scheduling other testnet upgrades, and mainnet release epochs/TTD",
        "created_at": "2021-11-02T15:59:11.858000+00:00",
        "attachments": null
    },
    {
        "author": "schone_wizard",
        "category": "general",
        "parent": "",
        "content": "yes the merge, and i guess more specifically my question was trying to envision how many different public testnets we'd like to see transition through a merge before its considered mainnet ready",
        "created_at": "2021-11-02T15:59:58.047000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I think we'd want _all_ testnets to transition (or be sunset?) before mainnet. There might be value in keeping one non-PoS one though",
        "created_at": "2021-11-02T16:28:04.269000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "One bit of feedback I've received after London is that it would be nice to scatter the testnet upgrades so that at least one testnet is available as a \"staging environment\" for mainnet for as long as possible. So it might make sense to transition some testnets early, and some a few weeks before the actual merge.",
        "created_at": "2021-11-02T16:29:06.770000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "It may be nice to have a rolling set of testnets, where there is a weekly \"pow chain starts, beacon chain starts, merge happens 1 day later\" or similar that runs close to the merge date.  For Altair, for example, there were a fair number of beacon client changes made between the last test upgrade and the mainnet upgrade which didn't cause issues, but could have.\n\n(Unless of course there is a real code freeze a decent distance before the merge, but that seems unlikely given past history).",
        "created_at": "2021-11-02T16:31:00.007000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "An actual freeze will be welcome, it would be nice to actually read the spec, or at least expect that someone besides EF employees and a small subset of  implementers did",
        "created_at": "2021-11-02T16:35:22.439000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "if we get rid of Ropsten, Rinkeby and Goerli, execution implementations can delete the botched Constantinople fork code",
        "created_at": "2021-11-02T17:03:45.942000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Worth cross-quoting from the \u003c#595701770034872362\u003e channel: \n\u003e Additionally, the first 30 minutes of each EL and CL public call this month will be dedicated to team updates, issue/blocker discussions, and next steps for Kintsugi. We invite teams from both EL and CL to each, with the first being this week's CL call on Thursday, 2pm UTC",
        "created_at": "2021-11-02T20:19:24.357000+00:00",
        "attachments": null
    }
]