[
    {
        "author": "quezacoa",
        "category": "general",
        "parent": "",
        "content": "If I understand correctly the absolute maximum number of tx per block is doubled in 1559 and the price for a single tx should be reduced on average.\n\nI believe the high tx fees today show that demand \u003e feasible supply - feasible in an economic sense. My guess is as the price goes down the feasible supply will go up in users eyes, thus will the number of txes.",
        "created_at": "2021-05-22T04:46:30.259000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Personally, I am open for withdrawals right at the Merge. But the complexity of its implementation makes me think about the following trade off. We ship the Merge without withdrawals about 3 months earlier than if withdrawals were included. They are not that simple as it might seem from the first glance and require EVM opcode and system contract or an alternative to the latter. It will take additional time to test and reason about these changes. And the preference is to work on withdrawals in parallel to the general Merge line but not bundle them with already complicated network upgrade.",
        "created_at": "2021-05-22T04:53:29.148000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Btw, 3 months is not a certain amount of time required for developing and testing withdrawals. It may vary and used as an example in the message about. But this number is certainly more than 3 days or 3 weeks.",
        "created_at": "2021-05-22T05:03:27.423000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I think 3 months is a good price to pay for withdrawals",
        "created_at": "2021-05-22T07:09:54.398000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I would also allow us to catch up with your progress hopefully. Otherwise I am wondering when are we going to prepare all that stuff",
        "created_at": "2021-05-22T07:10:50.980000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I think we’ve learnt from an awful lot of delays in eth2 that shipping things in smaller increments is a lot more reliable and safer. Shouldn’t be surprised by that, it’s one of the core tenets of modern software development. 🙂\n\nIf we need to delay because there’s too much to do then so be it. I’m not sure it makes sense to increase scope with that or we’re still under the same pressure but trying to deliver in more of a Big Bang.",
        "created_at": "2021-05-22T07:16:52.723000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I have been trying to reason with people about not rushing The Merge because we cannot handle the schedule, but so far I don't think I've been heard",
        "created_at": "2021-05-22T07:17:49.034000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "so I am trying different ways",
        "created_at": "2021-05-22T07:17:55.481000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "At this stage in Ethereum's lifecycle, I would rather deliver at an overall slightly slower pace, but spread out more into smaller updates rather than deliver faster overall, but in monolithic updates.",
        "created_at": "2021-05-22T07:18:15.711000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Are you concerned with the execution client timeline or the consensus client timeline?  From previous statements you have made it sounds like execution client timeline, in which case I'm curious what in particular is the long pole for Erigon?",
        "created_at": "2021-05-22T07:19:34.085000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e I think your language is a bit too elaborate for me, I don't understand 🙂",
        "created_at": "2021-05-22T07:20:25.882000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Are you worried that execution clients (Geth, OpenEthereum, Nethermind, Besu, Erigon) are going to struggle to implement The Merge \"in time\", or do you think consensus clients (Prysm, Teku, Lighthouse, Nimbus) are going to struggle to implement The Merge \"in time\"?",
        "created_at": "2021-05-22T07:21:42.010000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "That is, which group of developers do you think are going to struggle to meet the current proposed timelines?",
        "created_at": "2021-05-22T07:22:07.493000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I don't know about others, but we will struggle. Because current timelines assume that we must drop everything we are doing and only work on London HF and rayonism. And I simply cannot grow that fast",
        "created_at": "2021-05-22T07:22:59.116000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I do not want to hack Rayonism onto Erigon without understand how it fits into our architecture",
        "created_at": "2021-05-22T07:23:37.036000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I have ideas, but figuring it out properly will require some proper attention",
        "created_at": "2021-05-22T07:23:55.946000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "What part of The Merge/Rayonism do you think is going to be the most challenging or the most time consuming?",
        "created_at": "2021-05-22T07:23:59.160000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "The fact that reference implementations assume a monolithic client, where all three parts (RPC, fork choice rule and block composition) live inside the same component. We will figure out how to split it up, but it cannot be done in matter of couple of weeks (which I am afraid all we will have left with after London HF work is done)",
        "created_at": "2021-05-22T07:25:33.004000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "my biggest worry is that after London HF the question will be: \"OK, can you make testnet release for The merge in 2 weeks?\"",
        "created_at": "2021-05-22T07:26:10.062000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I am not prepared to work at such pace",
        "created_at": "2021-05-22T07:26:43.957000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "because it does burn me (and my team) out",
        "created_at": "2021-05-22T07:26:53.310000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I *personally* think that is unlikely.  How I *suspect* it will go is something like:\n1. London goes out in July.\n2. People start working on Shanghai and The Merge in parallel.\n3. Shanghai goes out in November.\n4. The Merge goes out in Q1 or Q2 2022.",
        "created_at": "2021-05-22T07:26:57.666000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think The Merge in October/November incredibly optimistic, even if theoretically possible.  It is likely that one or two clients will be Merge ready before the end of November, but I doubt all 9 clients will be ready by then and I don't see us leaving behind half of the clients.  Maybe if 8 of the 9 clients are ready we would have a conversation about leaving the 9th behind... but not leaving behind 3 or 4.",
        "created_at": "2021-05-22T07:28:33.016000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I am raising my voice now to be able to answer questions later: \"Why you are only complaining now?\"",
        "created_at": "2021-05-22T07:29:31.623000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "FWIW, I don't think you are the only client dev who thinks this year is overly optimistic.  🙂  I have heard similar grumblings from other client devs.",
        "created_at": "2021-05-22T07:29:56.478000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I also think there will be a lot of work post London-HF to watch how EIP-1559 performs and perhaps make non-consensus adjustments to the implementation, that will also likely take decent chunk of work",
        "created_at": "2021-05-22T07:30:32.701000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "the assumption is that EIP-1559 will be finished with London HF is wrong, I think",
        "created_at": "2021-05-22T07:30:53.287000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "London is the *start* of 1559.  😄",
        "created_at": "2021-05-22T07:31:14.220000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "There is definitely a constant stream of upgrades to deal with and I can very much sympathise with being a new client trying to play catch-up while Ethereum keeps moving the goal posts forward. Been there, done that and it’s brutal. \nBut at the same time if we don’t push hard to keep Ethereum moving forward the timelines just keep blowing out further and further. No one is suggesting we ship the merge this year regardless and I think everyone sees it as optimistic (and getting less and less likely as time progresses without Altair and London fully wrapped up). But we need to be able to keep Ethereum moving forward constantly while teams work out how to keep up and perform other improvements at the same time.\nBut while pushing hard we still need to keep timelines flexible so if things take longer we ship later and just be ok with that. We don’t sacrifice quality (and I don’t think we are currently).",
        "created_at": "2021-05-22T07:38:41.698000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "who is going to stop the propaganda machine from hammering that The Merge will happen this year though? 🙂",
        "created_at": "2021-05-22T07:41:46.849000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Oh, that is nearly hopeless I think.  I don't even bother paying attention to it anymore, I just ignore it.",
        "created_at": "2021-05-22T07:42:16.837000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Ok, makes sense. I will ignore it too then",
        "created_at": "2021-05-22T07:42:53.529000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Welcome to the living-in-bliss club.  😆",
        "created_at": "2021-05-22T07:43:24.441000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "and I think our dev pace will accelerate (there are lots things being done to that end), we just need some time to \"spread our wings\"",
        "created_at": "2021-05-22T07:44:58.243000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Yeah people think all kinds of crazy things regardless of what we try to tell them. Half the people think the merge is coming far sooner than it can and half think it’s still years away. \nWe just need to keep reiterating that there is no central authority and so no guaranteed timelines. Just random people guessing on the internet. Things will ship when they’re ready.",
        "created_at": "2021-05-22T07:45:49.009000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Yep hang in there, prioritise ruthlessly and keep building team capacity. You’ll get there. I am very familiar with how hard it is to play catch-up and get new clients going so I definitely hear your concerns and know where you’re coming from.",
        "created_at": "2021-05-22T07:48:07.228000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "One day with a bit of luck you’ll have all the problems of being the majority client instead. 😃😳",
        "created_at": "2021-05-22T07:50:32.606000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I'm happy to help play a role here. As \u003c@!340345049063882753\u003e said, though, it's a fine balance. In a lot of my conversations about 1559, miners thought it was straight up impossible the merge would happen in less than 2 years and several people are still under the impression that the \"original\" Eth2 roadmap (merge after Phase 2) is the right one. \n\nThere's a lot of nuance to the message, but one thing I've been saying is that people should **not** start mining now with the expectation they have a \u003e12 mo ROI window. In a way, the more conservative estimates we give to miners, the more optimistic estimates we give to everyone else 😅",
        "created_at": "2021-05-22T16:10:37.135000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "One thing I've seen drafts of, and I intend to contribute to more post-London is a sort of \"Merge checklist\" (similar to https://github.com/ethereum/pm/blob/master/Fee-Market/mainnet-readiness.md). If we can all agree on _what_ needs to be done rather than _when_, I think that's already a good start, and it can help set expectations both for ourselves and the community.",
        "created_at": "2021-05-22T16:11:41.541000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "But, agreeing with Adrian once more, \" there is no central authority and so no guaranteed timelines\" ™️ 🙂",
        "created_at": "2021-05-22T16:12:04.399000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I had a massive arguments with people on the The Merge TG channel about deadlines vs \"what needs to be done\". Most people seem to want deadlines, because they think they cannot work without them 🙂",
        "created_at": "2021-05-22T16:20:20+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I doubt we will ever have a world without people setting at least tentative deadlines (I'm guilty of it here!), but IMO a list of things that need to be done helps put those into contexts, and set expectations (or update them if things are going wrong).",
        "created_at": "2021-05-22T16:27:51.183000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminion",
        "category": "general",
        "parent": "",
        "content": "I've said it before, and I'll say it again - don't call them \"deadlines\". That word implies far too much. Too final; too fixed. I prefer \"planning targets\", myself. Useful for coordination, but no big deal if they get changed. Certainly not likely to result in death if we miss them 😂",
        "created_at": "2021-05-22T16:36:27.316000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Ok",
        "created_at": "2021-05-22T17:01:07.165000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "The challenge is as soon as dates are involved, no matter how tentatively we label them, context gets lost and people hook onto them. The 2021 merge is a great example 😄",
        "created_at": "2021-05-22T17:02:43.592000+00:00",
        "attachments": null
    },
    {
        "author": "tkstanczak",
        "category": "general",
        "parent": "",
        "content": "Interestingly after this October shout out I have heard from various infra / exchange teams / validators that they started analysing The Merge proposal and involving their teams in understanding the architecture. I have a feeling that this is one positive outcome. October sounds optimistic. We definitely should not rush the merge October may be reasonable for a testnet maybe? I think the mainnet transition will be a massively complex task (logistically).",
        "created_at": "2021-05-22T19:22:46.107000+00:00",
        "attachments": null
    },
    {
        "author": "tkstanczak",
        "category": "general",
        "parent": "",
        "content": "The operations of switching will be the hardest part in my opinion.",
        "created_at": "2021-05-22T19:23:12.980000+00:00",
        "attachments": null
    },
    {
        "author": "tkstanczak",
        "category": "general",
        "parent": "",
        "content": "I would be very cautious about expanding the scope of the merge and take it piece by piece wherever possible. Logistics and security and testing requirements will probably eclipse the engineering work required. I think The Merge date is important for the ecosystem to wake up to The Merge happening. Lots of businesses have to look at it, understand it and voice concerns.",
        "created_at": "2021-05-22T19:29:32.160000+00:00",
        "attachments": null
    },
    {
        "author": "tkstanczak",
        "category": "general",
        "parent": "",
        "content": "I would target a testnet for October (not as a deadline but as a target so that businesses / infra feels that if they miss their preparation window they will stay behind competition). I would suggest extremely long period of testing (up to 6 months).",
        "created_at": "2021-05-22T19:31:12.833000+00:00",
        "attachments": null
    },
    {
        "author": "tkstanczak",
        "category": "general",
        "parent": "",
        "content": "\u003c@!758579010027782144\u003e are these being added to our tests?",
        "created_at": "2021-05-22T19:32:45.493000+00:00",
        "attachments": null
    },
    {
        "author": "dimitry8570",
        "category": "general",
        "parent": "",
        "content": "Prs are being merged to develop branch",
        "created_at": "2021-05-22T19:40:15.213000+00:00",
        "attachments": null
    }
]