[
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Did ETH ever have a talk about being in hybrid mode, PoW and PoS say 50/50, before full transition into PoS? I cant be the only one worried about losing 1000 000 000 Mhs of miner interactions in network. Not only security wise, but in general - new people getting involved into crypto world with just a gpu, and so on, as we saw in May 9th, 2021 peak at 1.7M transactions  in a day. And yes, this is kind of late. https://ycharts.com/indicators/ethereum_transactions_per_day",
        "created_at": "2022-05-29T06:39:00.784000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "most recent one related i can find: https://ethresear.ch/t/proof-staked-work-a-simple-hybrid-pow-pos-with-potential-stronger-51-attack-resistant/4740\nbut isnt really a discussion obviously",
        "created_at": "2022-05-29T07:53:24.118000+00:00",
        "attachments": null
    },
    {
        "author": "yolo_otm_calls",
        "category": "general",
        "parent": "",
        "content": "Lmao you think devs care about the network? Pos is going to be the greatest crypto of all time",
        "created_at": "2022-05-29T17:56:26.963000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "The quality of this channel has degraded over the past weeks. Many contributors have reached out to me about this and I’ve also found myself skipping past entire conversations because the signal/noise ratio is poor. \n\nI would **really** like to avoid any sort of whitelisting on here because many community members do provide very valuable contributions. That said, we want this to be a channel that people on client teams constantly monitor and it’s really hard to do that if a large % of messages aren’t useful to them. \n\nPlease ask yourself before posting whether your comment is something every client dev should be aware of. If not, try and use another channel. Thanks!",
        "created_at": "2022-05-29T18:11:16.922000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "I think there should be an offtopic channel as a place for less technical messages. Then devs can just ignore it. If you whitelist this channel it's only going to move into other channels with some specific purpose, whitelisting is only going to work if it's server wide.",
        "created_at": "2022-05-29T18:38:35.490000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "There’s \u003c#595721451651465227\u003e",
        "created_at": "2022-05-29T20:47:29.897000+00:00",
        "attachments": null
    }
]