[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Does anyone have a good estimate of when the difficulty bomb is expected to go off on Ropsten? It would be good to know when blocks are expected to hit 15/20 secs to determine if we want to push back the bomb there or dry-run the merge on it.",
        "created_at": "2022-01-12T00:00:21.944000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "Didn't we decide a while back that we don't want to delay the bomb on Ropsten but instead want to create a new testnet?",
        "created_at": "2022-01-12T15:54:50.141000+00:00",
        "attachments": null
    },
    {
        "author": "yperbasis",
        "category": "general",
        "parent": "",
        "content": "The difficulty bomb on Ropsten will explode after the main net (Ropsten bomb is offset by 2M fewer blocks than the main net, but the block height is 2.2M lower than the main net).",
        "created_at": "2022-01-12T16:27:09.857000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Right, there was Sepolia, but I'm not sure what the status is. That said, Ropsten does have a fair amount of activity, and we can probably learn some stuff by running it through The Merge 🙂",
        "created_at": "2022-01-12T16:27:54.184000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Got it, so if 13,773,000 was safe on mainnet, then 12 milliion-ish should also be manageable on Ropsten, which is still 3+ weeks away: https://ropsten.etherscan.io/block/countdown/12000000\n\nFrom there, we probably get another 3-500k blocks where the bomb is going off, block times are manageable. That brings us to late march/early April",
        "created_at": "2022-01-12T16:34:51.626000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Given that, unless there's a reason why 15/20 sec blocks are unacceptable on Ropsten (seems to happen periodically just because miners shut down), I think it might be enough time for us to be ready to test The Merge on it ... !",
        "created_at": "2022-01-12T16:36:18.342000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "(To be clear, I eyeballed all these numbers off the graphs that \u003c@!334288075356241920\u003e did for the Arrow Glacier pushback)",
        "created_at": "2022-01-12T16:36:59.184000+00:00",
        "attachments": null
    },
    {
        "author": "yperbasis",
        "category": "general",
        "parent": "",
        "content": "Actually sorry, Ropsten is offset only by 1M blocks fewer than the main net (9.7M offset on Ropsten vs 10.7M offset on the main net), which gives Ropsten even more time.",
        "created_at": "2022-01-12T16:44:15.787000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Oh great 😄 !",
        "created_at": "2022-01-12T16:45:22.231000+00:00",
        "attachments": null
    },
    {
        "author": "tyneslol",
        "category": "general",
        "parent": "",
        "content": "I'm not sure if this is the best place to talk about this but I'm hearing a lot of fud about the future of kovan and if I understand correctly, Nethermind can run kovan so in theory when openethereum is truly no longer maintained then kovan can be continued using Nethermind and go through the merge?",
        "created_at": "2022-01-12T18:14:17.935000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "In theory - you could spin up a PoS testnet based on Kovan, then merge that with Kovan. Something about PoA and that has no difficulty for merge but that can be managed. Question is why? Over using whatever long lived multi client testnet emerges, whether Sepolia or something else.\nConsensus after merge is PoS.",
        "created_at": "2022-01-12T21:46:29.750000+00:00",
        "attachments": null
    },
    {
        "author": "tjayrush",
        "category": "general",
        "parent": "",
        "content": "I've just read about 200 messages, catching up. One thing I'm not seeing is any comments about the sort of \"Public Relations\" aspect of the merge. I think it might be wise to try to tamp down the expectations. So make sure that people in the larger community know that there is a real possibility that there may be a delay. This, as opposed to, two months before the supposed Merge telling people there will be a delay.\n\nAlso, I think it wouldn't hurt if the Ethereum Foundation and/or the Core Devs started approaching project teams (DeFi, NFT platforms, Exchanges, etc.) whose business depend very heavily on the success of the merge and shame them into providing a massive testing effort. Those 'users' of the chain don't have to be core devs, but they should definitely take responsibility for testing. This would also make the decision to delay or not something that's not only on the shoulders of the Core Devs. If you're the member of a non-core dev team that depends on a successful merge, speak up--offer help testing.\n\nFinally, I think the Ethereum Foundation should take on the responsibility of handling this Public Relations function, as this, I think is their function.",
        "created_at": "2022-01-12T23:44:39.010000+00:00",
        "attachments": null
    }
]