[
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "Aby Bellatrix watch party?",
        "created_at": "2022-09-06T08:55:17.600000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "https://discord.com/channels/595666850260713488/598292067260825641/1016351146694148126",
        "created_at": "2022-09-06T09:02:59.623000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Probably quite boring, but I'll be there just because I like to watch 🌎 🔥 and I'm always on the lookout for an opportunity.",
        "created_at": "2022-09-06T09:03:26.233000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "\u003c@388751025789468672\u003e I am not sure if this is already in place on Infura, but one of my worries is node operators running without an EL for the merge. Do you guys have numbers on how many CLs are connected to your nodes for deposit logs? would it be possible to block those requests for a week or so? I mean it would be nice to give a wake up call to anyone running on Infura that they need to sync an EL right now. And if their client starts erroring out that would be good.",
        "created_at": "2022-09-06T16:38:53.597000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "We thought about blocking like that but it felt too disruptive, so instead we ran some reports on which accounts looked like validators based on their usage and reached out to them directly, and ran a series of Workshops targetting Solo stakers who might've been using us pre-merge as their EL: https://www.crowdcast.io/e/the-merge-weekly/register?session=4",
        "created_at": "2022-09-06T18:59:26.987000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Teku also made it very hard to just keep using infura without noticing.  You had to specify a `--ee-endpoint` option or it refused to start and you'd get a log full of errors if you pointed it at a normal JSON-RPC endpoint (like Infura) rather than an engine API.  It does seem to be getting people's attention well based on the support requests.",
        "created_at": "2022-09-06T21:15:57.201000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "We have the same, but still see people that haven't upgraded since Altair",
        "created_at": "2022-09-06T21:17:48.242000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Oh yeah not upgrading happens too, but they've all dropped off the chain now and that wouldn't change regardless of whether they had a local EL or not.",
        "created_at": "2022-09-06T21:18:54.095000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Yeah the thing is that these people I'm sure didn't see any logs ever, only when their node doesn't run is that they notice they need to update. So people like this that just rebooted prysm on Bellatrix and realized they couldn't work, came asking for help, realized that they need to change some flags and they're back up. I'm afraid such a person does not even see the red alerts in the logs",
        "created_at": "2022-09-06T21:21:33.633000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Certainly possible. Teku doesn't automatically delete \"invalid\" blocks from its database so if you followed the not-upgraded chain and then upgrade it will fail to start until you manually intervene which has been a useful point of intervention and gets people to look at their logs - not that we planned it for that but sometimes you get lucky...",
        "created_at": "2022-09-06T21:24:52.644000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "I'll ask internally if we can rerun the report that identified solo stakers and see if the numbers have gone down. 🤞",
        "created_at": "2022-09-06T21:29:26.528000+00:00",
        "attachments": null
    }
]