[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I'm pretty sure Tuesday is over everywhere in the world at this point, but I don't see a blog post on https://blog.ethereum.org with The Merge announcement and client details.  What is the status of that \u003c@291925846556540928\u003e \u003c@552133098075193354\u003e?",
        "created_at": "2022-08-24T10:02:39.335000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminion",
        "category": "general",
        "parent": "",
        "content": "I believe delayed slightly pending confirmation of resolution of the Geth issue.",
        "created_at": "2022-08-24T10:16:14.987000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "It's coming, we just released our fix. Danny will publish the post soon",
        "created_at": "2022-08-24T10:16:42.389000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "*grumble*  Erigon told us a week ago that they weren't going to be fully merge ready by Tuesday and we went ahead with the plan to post the blog despite that.",
        "created_at": "2022-08-24T10:23:39.517000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I'm not a fan of giving Geth preferential treatment here.  We could have just said in the blog post that Geth isn't ready yet and to keep an eye out for further updates (like we are going to for Erigon).",
        "created_at": "2022-08-24T10:24:10.404000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "*Especially* since Geth is currently the supermajority EL client, we should be eager to take every opportunity we can to cause an outflow of Geth operators.",
        "created_at": "2022-08-24T10:35:59.771000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "Tim is on vacation, I made the call. This was not a \"we need to patch an edge case that someone might hit in some weird sync race condition\", this was a critical failure in a public release that said \"merge ready\". \n\nI decided that going to sleep last night in hopes of a release this morning was less damage than pushing it out last night with \"TBD\" or otherwise. I would have considered the same for other situations and other clients. depending on the severity, the information around the bug at the time, and expected timelines.\n\nI did fail to engage with that decision here either by notifying or asking the general sentiment, and in retrospect I should have done a minimum of the former",
        "created_at": "2022-08-24T11:34:18.126000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "blog post will be out shortly",
        "created_at": "2022-08-24T11:34:28.435000+00:00",
        "attachments": null
    },
    {
        "author": "lukaszrozmej",
        "category": "general",
        "parent": "",
        "content": "Well for me it's how long we should wait. If it's 1-2 days I like to think that we should wait for any client. 1-2 weeks or 1-2 months and it's harder to judge. I see very big pressure to release the Merge.",
        "created_at": "2022-08-24T11:42:11.534000+00:00",
        "attachments": null
    },
    {
        "author": "lukaszrozmej",
        "category": "general",
        "parent": "",
        "content": "And this comes from a team member which historically were the ones hitting the breaks on dates and timelines for Merge (and I'm owning it, we were right it was too early)",
        "created_at": "2022-08-24T11:44:48.666000+00:00",
        "attachments": null
    }
]