[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Did we resolve the Kiln transition problem from yesterday?",
        "created_at": "2022-03-16T05:52:08.048000+00:00",
        "attachments": null
    },
    {
        "author": "kedos25.eth",
        "category": "general",
        "parent": "",
        "content": "Im not sure if this is the problem you referring to, but Prsym produced bad blocks caused by a big vs. little endian issue in handling baseFeePerGas. The bugs are already fixed by the team.",
        "created_at": "2022-03-16T06:46:21.698000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Was that the only issue from the transition?  I stopped following before everything was figured out, and at the time it wasn't clear if there were multiple problems or not.",
        "created_at": "2022-03-16T07:28:03.465000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "About the Merge -\u003e Paris rename. I'm glad this is resolved, but this is very late to decide on names. In my projects I'm already using Cancun for the upgrade after Shanghai. I will change the name to Paris but I wander if other projects will do (e.g. geth, tests).",
        "created_at": "2022-03-16T13:57:19.191000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "Isn't it London, (Arrow Glacier), Paris, Shanghai now? Where Paris is out of order, because the first Paris conf (EDCON) was after Shanghai? 😬",
        "created_at": "2022-03-16T13:59:57.279000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003ctimbeiko\u003e \u003e  In my projects I'm already using Cancun\nI’m curious what “uses” there are for Cancun already given that Shanghai isn’t even fully spec’ed yet?",
        "created_at": "2022-03-16T14:00:00.526000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003ctimbeiko\u003e Yes, that’s correct. Paris isn’t in the right order, but there was already a lot of talk of Shanghai so it would have been more confusing to name the merge upgrade Shanghai 😅 (re @allcoredevs_bot: \u003caxic\u003e Isn't it London, (Arrow Glacier), Paris, Shanghai now? Where Paris is out of order, because the first Paris conf (EDCON) was after Shanghai? 😬)",
        "created_at": "2022-03-16T14:00:57.738000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "I'm using Cancun to prototype some EIPs that are too late for Shanghai. Could be named Experimental too. I just wanted to note that these names are introduced to code quite early in the process. So it has more value to know the names up front.",
        "created_at": "2022-03-16T14:11:59.421000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "Shanghai (feature fork) could still launch before Paris (merge), right \u003c@!552133098075193354\u003e? 😅",
        "created_at": "2022-03-16T14:14:46.521000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003ctimbeiko\u003e That seems incredibly unlikely, no? We’d have to find something _so_ wrong with The Merge that we think it will take several quarters to fix, and then decide that getting Shanghai out is a better way forward...",
        "created_at": "2022-03-16T14:22:25.278000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Not just unlikely, but a fate we are working very hard to avoid.",
        "created_at": "2022-03-16T14:35:44.083000+00:00",
        "attachments": null
    }
]