[
    {
        "author": "jwasinger",
        "category": "general",
        "parent": "",
        "content": "I think we are stalled by not having a better understanding of which contracts would be affected with eip4758.  I am doing some analysis work that will hopefully provide some more insight here.",
        "created_at": "2022-11-24T05:18:54.090000+00:00",
        "attachments": null
    },
    {
        "author": "joey_02",
        "category": "general",
        "parent": "",
        "content": "Nov 14 😯 ?",
        "created_at": "2022-11-24T05:36:47.855000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Ha, 24, good catch! 🔜 !",
        "created_at": "2022-11-24T05:53:28.323000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Call in 25 minutes! Zoom: https://ethereumfoundation.zoom.us/j/91348592283?pwd=SnRnL1VTeXNYVE9CaWpBbnJEUXhQZz09",
        "created_at": "2022-11-24T13:36:54.174000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "As promised, here's a quick recap of the decisions on ACD today. Lots of back and forth, in both the video and the chat, so I'd recommend people watch the actual recording. But if you can't, TL;DR:\n\n- We discussed the state of testnets and what to do with them going forward. Only specific decision is agreeing to** fully shut down Ropsten by EOY.** Broader testnet proposal to be discussed here: https://ethereum-magicians.org/t/proposal-predictable-ethereum-testnet-lifecycle/11575\n- We went over the EIPs we've been discussing for a while now and discussed which should be moved to CFI... and what CFI means! No strong consensus on the latter, \"definition\" is here (https://github.com/ethereum/execution-specs/tree/master/network-upgrades#definitions). With 4844 and EOF (all 5 EIPs) being on devnets already, they've been moved to CFI. For 4758, people wanted to see a better elaboration of the ways to deal with contract breakage before moving it to CFI. 2537 was also moved to CFI... but it's been CFI'd since Berlin 😅 \n- After that, we discussed what should be the scope of Shanghai and when it should happen. Hardest part to summarize given the diverging views, but there is strong (unanimous?) consensus that withdrawals should happen ASAP, and if we add anything alongside them in the fork, the delays to Shanghai should be minimal. Teams felt like a March fork with withdrawals should be possible. \n- On next week's CL call, we'll discuss more how CL teams feel 4844 might affect withdrawal timelines\n- On the next ACD (which will be the last one of 2022!), we'd like to get a final list of EIPs we can include alongside withdrawals. \n- And, lastly, we have a withdrawal devnet live 🎉 ! We'll make sure to cover the status of withdrawals in more depth on the next call.\n\nLonger form Twitter recap: https://twitter.com/TimBeiko/status/1595860968298672128",
        "created_at": "2022-11-24T15:55:39.370000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Too many new acronyms recently 😅 EOF, CFI, had to Google them",
        "created_at": "2022-11-24T16:16:04.835000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Not that it needs any vouching, but that TL;DR reflects accurately to the very last detail my reading of the meeting. Kudos for a great summarizing skill.",
        "created_at": "2022-11-24T16:19:47.938000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "Yes thanks \u003c@552133098075193354\u003e , very helpful!",
        "created_at": "2022-11-24T16:25:34.518000+00:00",
        "attachments": null
    },
    {
        "author": "joeysantoro",
        "category": "general",
        "parent": "",
        "content": "Too many new acronyms recently 😅 EOF",
        "created_at": "2022-11-24T17:25:48.022000+00:00",
        "attachments": null
    },
    {
        "author": "jessepollak",
        "category": "general",
        "parent": "",
        "content": "Hi all - Jesse here, I support Protocol engineering at Coinbase, including our contributions to core development of Ethereum clients. I'm joined by folks like \u003c@898563924440543283\u003e, \u003c@281887943579271178\u003e, and \u003c@918333659327655968\u003e in this work.\n\nFollowing a few DMs and chatter on Twitter, I wanted to quickly ask if it'd be helpful for me to host an open conversation for Core Devs to ask questions about Coinbase's approach to contributing to Ethereum, share feedback on how we are showing up, and discuss how we can best contribute. I see this as an open ended session that would be totally optional, but could be a great jumping off point for continuing to make contributions in a better and better way. I've been getting some of this in 1:1 conversations with folks, and I'll continue doing that, but think a more open setting might be helpful as well.\n\nI can prepare some pre-read content ahead of time to help folks understand what our current work and approach looks like, which could be a good jumping off point. Then maybe we do like an hour long open session sometime in the next few weeks.\n\nWhat do folks think?",
        "created_at": "2022-11-24T19:44:12.757000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "PR adding today's CFI'd EIPs to the Shanghai spec: https://github.com/ethereum/execution-specs/pull/656 \n\nWill merge tomorrow if no pushback",
        "created_at": "2022-11-24T20:56:32.009000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I would only make one comment: In \u003c@203220829473996800\u003e's issue to raise 4844 to CFI, Shanghai is mentioned, albeit with a clever wording. In the actual commit to this repo, the file changed is `shanghai.md`.  During the call there was a felt strong effort to disambiguate the wording of  CFI from any fork that the \"consider for inclusion\" may be meant to.  I honestly feel that this is disingenous and the actual meaning of the CFI status should be stated clearly or just removed as some meaningless moniker that wastes cycles on meetings.",
        "created_at": "2022-11-24T22:22:23.260000+00:00",
        "attachments": null
    }
]