[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Why do you think increasing block gas limit in line with the block time increases is the wrong thing to do?",
        "created_at": "2022-05-25T05:55:31.910000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Well for one obvious reason, I think all the testnets have the current gas limit and block times not big blocks with diff bomb times? I’m sure there’s others.",
        "created_at": "2022-05-25T05:57:30.329000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "it is a little harder to argue that the gas limit should be reduced than increased",
        "created_at": "2022-05-25T05:58:10.884000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Mainly because we will end up moving larger blocks around the network, processing data in larger chunks, and in general being more \"big bumps\" than \"little and often\".\n\nAnd on a more practical basis, the coordination required to increase the gas limit on an on-going basis seems higher than that to delay the difficulty bomb.",
        "created_at": "2022-05-25T05:58:38.518000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I agree on the coordination point.  I'm more dubious about the larger block shuffling problem, though I appreciate the general form of the argument.  I think it is a *reasonable* concern, but I'm just not convinced it will cause any actual problems in reality.",
        "created_at": "2022-05-25T06:03:33.187000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Yep, not saying that it will definitely cause problems, but it is possible that we end up down different code paths, hit resource limits, bump into someO(n^2) algorithms, etc.\n\nI guess the question is: do we really need to create ourselves another potential pain point when there is a tried-and-tested alternative that we know works?",
        "created_at": "2022-05-25T06:08:30.780000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The only argument that sits well with me *against* pushing back the bomb is that it makes it more likely that some exchanges will list PoW ETH post-merge without there being release infrastructure in place by proponents of that.  Purely a social problem, not a technical one.",
        "created_at": "2022-05-25T06:10:16.370000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If it weren't for that I would lobby much harder for \"push back the bomb for 6 months\".",
        "created_at": "2022-05-25T06:10:34.813000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Could just push it back monthly or push it back 3 months as suggested 😅",
        "created_at": "2022-05-25T06:12:10.425000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I am worried about the situation when we are entering transition with payloads that are twice as big as usual. New PoS consensus is very time sensitive and I would not put additional stress on this property of the system at the very beginning. Also, it would require additional efforts to coordinate validators to bring gas limit down to it's usual value post Merge",
        "created_at": "2022-05-25T08:37:30.437000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "After all those discussions, I think everyone can now agree that the lack of predictable fork scheduling resulted in a huge headache",
        "created_at": "2022-05-25T08:59:16.888000+00:00",
        "attachments": null
    },
    {
        "author": "tkstanczak",
        "category": "general",
        "parent": "",
        "content": "not pushing the bomb now seems wrong and we should agree on the 3 month push back now",
        "created_at": "2022-05-25T09:07:36.601000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e I think we should not push it back and try to deliver the merge in August.",
        "created_at": "2022-05-25T09:21:24.264000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Why not push it to 2023? It is not unlikely that the merge will get delayed again, and we will be faced with the exact same problem.",
        "created_at": "2022-05-25T10:47:44.611000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Not a fan of making glacier hardforks that contain a pushback only.",
        "created_at": "2022-05-25T10:48:21.623000+00:00",
        "attachments": null
    },
    {
        "author": "dirigible6945",
        "category": "general",
        "parent": "",
        "content": "A 3 month pushback maintains time pressure to deliver the merge promptly, gives clients breathing room, reduces the time and energy spent on this discussion (almost every ACD now we talk about this...), allows a stable and predictable network condition for TTD, and improves UX for network participants. It isn't a necessity to force the upgrade in a specific month, despite public perception of when this upgrade may or may not come.\n\n\nI'm very curious to know what team reps think here.",
        "created_at": "2022-05-25T11:13:26.560000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "A single fork to a block that takes two seconds to execute may push everyone into what's known as optimistic sync mode. If this happens right at the fork block, all those nodes will not be allowed to continue syncing until the chain advances 128 blocks. If everyone is in this mode we are broken.",
        "created_at": "2022-05-25T12:16:04.079000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "if every node is on that block, how is that a fork as opposed to the canonical chain?",
        "created_at": "2022-05-25T14:29:30.934000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "You cannot continue syncing blocks if you are optimistically syncing close to the merge. Either way, the message I think Jim, Mikhail and I are trying to get across is that large blocks are a complication on the consensus layer, more so than in the execution layer, and being in a situation where every block takes longer to execute by the time the merge comes is not something I want to be in.",
        "created_at": "2022-05-25T14:32:26.143000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "This is not true for any EL except Erigon as far as I know.",
        "created_at": "2022-05-25T22:08:55.260000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "if the EL has not executed the block it will return SYNCING, regardless of client. its true that it may eventually catch up, but the point is that if every block is takes long to execute and we have some form of forking and we have a large disparity between the CL slot time and the EL block timings, this is not a situation that anyone wants to be. At the very **minimum** if this is the route we are going to go on mainnet, then I would want to have a few testnets where this is the setup that's being tested, instead of the countless shadow forks and testnets that we are having where the situation is very different",
        "created_at": "2022-05-25T22:48:34.435000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "\"If the EL has not executed the block\" is the key part there.  Most ELs will execute non-canonical blocks if they're only a short fork (which makes sense because you want to be able to reorg quickly). I'm not really a fan of increasing the gas limit instead of pushing back the bomb but want to hose down the idea that one slow block could destroy Ethereum - there have been plenty of cases of slow to import blocks being possible because gas prices had gotten out of sync with real world costs and it would surprise me if it weren't possible to create a block now that takes a few seconds to import (though it's likely quite expensive).",
        "created_at": "2022-05-25T23:02:14.361000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "today on a well behaved not merged network we are seeing late blocks breaking havoc. If we need to execute 2 seconds blocks, even well behaved blocks will be borderline late for attestation. I don't doubt that PoW could handle longer delays between blocks and larger blocks for a limited time. I do doubt that we are prepared to handle a merge in that situation. And there's been zero testing as far as I can tell of such a case",
        "created_at": "2022-05-25T23:06:42.787000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "It's also true that right at the transition block in principle the CL will pass a 30M gas limit and suddenly we should switch to smaller regular blocks. Still, this is completely uncharted territory",
        "created_at": "2022-05-25T23:08:38.085000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Again, I'm not arguing for increasing the gas limit, just want to counter the incorrect claim that a slow block could trigger optimistic sync on all nodes and break ethereum. Even if optimistic sync was triggered, the next fork choice update would bring them back out of optimistic sync mode and the network would continue because the EL would have finished the reorg and would no longer return SYNCING. That's true even right at the fork block.",
        "created_at": "2022-05-25T23:27:05.431000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "We currently don't poll the EL, so if the EL returns SYNCING we just won't propose until we sync another block. That is, if every CL is prysm and they all get a large enough block that puts them in optimistic sync, there won't be another fcu. Luckily not all clients are prysm, but then again I have no clue how other clients act and I don't want to find out at the merge",
        "created_at": "2022-05-25T23:34:54.640000+00:00",
        "attachments": null
    }
]