[
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "I'm generally against EIPs that require access to paid documents. Both durability and immutability of external references is important, however I think it is draconian to require only allowing citations to \"published\" works. I think blogs/tweets are not good sources. Things like FEM, eth research, etc are more acceptable resources IMO since that is where we as a community often \"publish\" and discuss ideas.",
        "created_at": "2022-11-02T14:12:01.550000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "I would never accept a spec which is in a paid document. If it is transcribed to a free document, then I don't mind, however.",
        "created_at": "2022-11-02T15:04:54.442000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "How about, say, HackMD, which is a weird in between but easily exported (raw .md) and frequently used?",
        "created_at": "2022-11-02T15:06:52.941000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "general",
        "parent": "",
        "content": "We're discussing on a call right now, if anyone wants to join ^^;;",
        "created_at": "2022-11-02T15:09:14.336000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "As for the third question: I think eips should be written in a way that makes them not _depend_ on external refs. They may include them, with the understanding that if the source disappears, then nothing of substance is lost from the eip. Just maybe some related research or motivation. \n\nI'm not an editor tho, so my take might clash with the de-facto standards",
        "created_at": "2022-11-02T15:09:50.121000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "Any background as to why this came up as a question?",
        "created_at": "2022-11-02T15:09:53.859000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I believe EIP editors are debating if \u0026 how to allow external links, and these are some of the fun edge cases to work through.",
        "created_at": "2022-11-02T15:11:32.141000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "general",
        "parent": "",
        "content": "https://github.com/ethereum/EIPs/blob/2d2e7cfc55ae8dfc33eeebbdecef8a565794a500/EIPS/eip-5757.md",
        "created_at": "2022-11-02T15:11:55.246000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "One counter example here, for EIP-4844, is that the cryptography is defined in the CL specs, and the EIP itself just links back to it. That said, if we move the EL towards using a python spec as well, and EIPs point to either/both for implementations, I guess that's not really an \"external\" reference?",
        "created_at": "2022-11-02T15:13:09.747000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "-------\nnot to derail things, but quick reminder of the **CL call, tomorrow (nov 3) 14:00 UTC**\nagenda: https://github.com/ethereum/pm/issues/630\nstream: https://youtu.be/GWkhFCvwOT4\nzoom: shared here shorly before the call\n-------",
        "created_at": "2022-11-02T15:14:50.936000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "Well, the CL specs are still within 'ethereum' control.",
        "created_at": "2022-11-02T15:19:49.894000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Hello, so for the call tomorrow, since probably my own PR may make some discussions around it \u003chttps://github.com/ethereum/consensus-specs/pull/3068\u003e I want to leave my thinking here just in case (apologies but I thought I'd be moving continents next year and we were scheduled to get my kids passports tomorrow. Will try my best to make it on time to the meeting even if it is on a prepaid cellphone). \n1) I think there's support from every single CL team except Lighthouse where Paul expressed support while Sean and Michael had their doubts around UX and some implementation details. So I suspect that there's alignment on the implementers'  side that the benefits of protocol simplicity outweigh other issues. \n2) There was some concern about the effects of long term non-finality (over 5 days currently) leading to processing a full loop  per block. After some benchmarks from Teku I believe those concerns are no longer there, and Paul's arguments lead to think that other options may be more demanding. \n3) There seem to be track of support (including my own) of bounding the loop size by a hardcoded constant instead of the validator registry size. I personally support this. As long as the constant is of the order of 2^17 that has currently the loop in the microseconds for prysm running on a laptop. I just heard from Adrian that their design makes it harder to loop over validators so this number may need to be lower, but my only worry is about holes in the validator set are not bounded and we want this constant to be very large as to give us time to fork to reuse validator indices. \n\nFinally I strongly support my own PR cause I can't justify protocol complexity otherwise. I'm hoping that I'll be able to make these points in person tomorrow, but trusting that a federal policeman willbe reasonable enough to take my signature in advance, is like trusting that the relay/builder protocol  is doing it out of altruism and to smooth MEV",
        "created_at": "2022-11-02T22:22:37.167000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003csigpaul\u003e FYI I just spoke to Michael and Sean and they approve of #3068 too. From Lighthouse, you have our sword!",
        "created_at": "2022-11-02T23:43:10.318000+00:00",
        "attachments": null
    }
]