[
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "gas limit can be increased to compensate without any hard fork. there's no logical reason for short term bomb delays. ethereum can function even with 1 minute block times and 4.45x higher gas limits for a while.",
        "created_at": "2022-05-24T05:24:09.411000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "People who actually use ethereum daily may think otherwise your talking about $100+ just to perform swaps much less the $300+ to do claims\n\nAlso some devs have spoken out against increasing gas limits",
        "created_at": "2022-05-24T06:59:13.353000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "no, increasing the gas limit would keep fees at the same level.",
        "created_at": "2022-05-24T06:59:46.777000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Certain devs have spoken out against it due to certain risks/issues. I thought it was a possibility before they said so.\n\nAlso getting 3+ pools making up 50+% to do it would be difficult.\n\nSince ethereum assumes a max profit incentive it would be more likely that pools lower gas to push devs to take the time to diff bomb delay to produce more blocks and thus more profits.",
        "created_at": "2022-05-24T07:00:05.262000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I'm not sure how much of this belongs in this channel, but I do not want to be hitting TTD with large blocks that take seconds to execute and possibly many forks, that would literally test the resilience of clients in the worst case scenario when the merge comes and it's a recipe for disaster",
        "created_at": "2022-05-24T07:05:11.798000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Agree that increasing block size is the wrong thing to do.  As to if the difficulty bomb should be reset: I think it should.  Two reasons:\n  - whatever timeline we have for mainnet merge should not have a negative impact on today's chain and its users\n  - we need to remove the time pressure that the difficulty bomb brings to being \"merge-ready\"\n\nI know that for many people the difficulty bomb and mainnet merge are linked, but resetting the difficulty bomb will remove that linkage and allow the dev teams to complete a successful mainnet merge without the additional time pressures created by increasing block times.",
        "created_at": "2022-05-24T07:55:54.419000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Attached is a 7-day moving average of recent block times.",
        "created_at": "2022-05-24T07:58:34.159000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "blocktime-recent-7dma.png",
                "content": "7aa2cd5269ae40412f67b35f3745d073f8fcf34f6b4f26c4cc2aff61faa509df"
            }
        ]
    },
    {
        "author": "dirigible6945",
        "category": "general",
        "parent": "",
        "content": "I would add to this discussion that we are at a similar point in the process -- in terms of block production -- as we were at the start of the Muir Glacier.",
        "created_at": "2022-05-24T13:27:23.451000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "unknown.png",
                "content": "192aec01df4848cc4eb1dbb49ed0f06d067c3f3d5201b1042acf02dff11029e3"
            }
        ]
    }
]