[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This has been proposed in the past, but I'm dubious that it will improve the situation significantly.  If we lower the bar for draft, then we'll have more stuff reaching Review that is of low quality so we are just kicking the can very slightly down the road.",
        "created_at": "2022-03-13T05:51:21.626000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "In science a common pattern for the first editorial filter is that the handling editor makes a decision right there on the spot. The second is that this editor will ask someone specialized on the topic for a quick opinion. And only then it goes for review. This doesn't apply for Ethereum since the analog would be to only have a single journal. But perhaps there could be 4 or 5 public handling editors to make that first filtering. Authors that feel wronged by editor 1 are free to submit to editor 2.",
        "created_at": "2022-03-13T16:05:05.037000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003e \u003e In science a common pattern for the first editorial filter is that the handling editor makes a decision right there on the spot.\n\nI agree this is the best way to take the pressure off of the first stage of editing.  It's also common for the author to help by suggesting qualified reviewers for the next stage.\n\n\u003e Authors that feel wronged by editor 1 are free to submit to editor 2.\n\nWhich, informally, is how it goes now.  If one editor refuses to merge you ask another.  (Or you make the change, wait for the merge, and undo the change.)\n\nSome of us might not recall the furor over the 'lost funds` EIP, which caused one editor to resign for fear of legal exposure.  At that point we made clear that the editors' duties did not imply approval of the content, and introduced the bot to make that easier.  And from the start we were clear that the format laid out in EIP-1 was a strong suggestion, not a Procrustean bed.",
        "created_at": "2022-03-13T19:16:23.761000+00:00",
        "attachments": null
    }
]