[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Did we ever figure out what happened on Goerli?",
        "created_at": "2022-02-20T02:14:12.071000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It does appear to be back up, but it feels like we should understand what happened.",
        "created_at": "2022-02-20T02:14:25.653000+00:00",
        "attachments": null
    },
    {
        "author": "schone_wizard",
        "category": "general",
        "parent": "",
        "content": "What happened on Goerli? Was it transition to POS?",
        "created_at": "2022-02-20T14:53:04.245000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "No, it went down for a while.",
        "created_at": "2022-02-20T15:51:13.330000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "But nonetheless it'll be worth knowing what went on. Didn't listen to the call were the other sealers there saying they were online? I know from prysmaticlabs perspective their sealer was on but they only had 3 peers and they couldn't find more even after upgrading the nodes",
        "created_at": "2022-02-20T21:43:03.447000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Not sure of the details of this one but typically issues on Görli are because there's a liveness failure in Clique which can occur where there are multiple forks with equal total difficulty and the signers split fairly evenly between them - then no signer can produce a block because they've produced one recently but all the other signers are on the other fork with the same problem.  Given there was talk of signers resyncing the chain that's usually how it gets solved.\n\nThere's been a proposal around to fix this for quite some time but it hasn't gotten any traction.  It probably doesn't matter too much now as Görli will move over to PoS so we won't have any testnets using Clique (and private networks are likely better off using QBFT).",
        "created_at": "2022-02-20T21:51:17.072000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "It's still surprising that prysm nodes didn't get more than 3 peers, presumably most users were following a different fork?",
        "created_at": "2022-02-20T22:31:41.374000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Thanks for the explanation by the way",
        "created_at": "2022-02-20T22:32:00.513000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Yeah the peering issues on Görli are interesting - it's been harder than normal to find peers since before the outage and I'm not sure what changed.  Being on a different fork shouldn't affect the peers you have.",
        "created_at": "2022-02-20T22:37:04.371000+00:00",
        "attachments": null
    }
]