[
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "Easier question: Are there any testnets that are planned to be long lived? We’re likely to help Chainlink transition off Kovan, so whatever we choose next should be the one where it’s likely it’ll be around, sudden changes notwithstanding. That sounds like Goerli or Sepolia, but not sure which one is the safer bet.",
        "created_at": "2022-01-21T00:54:47.235000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I would assume that Goerli isn't going anywhere given that there is a community maintaining it beyond client teams. Kovan has tended to lag mainnet in terms of updates, so it might not be the best \"staging' environment if that's what you are looking for.",
        "created_at": "2022-01-21T13:29:37.842000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**AllCoreDevs in 30 minutes**\n\nAgenda: https://github.com/ethereum/pm/issues/449\nStream: https://youtu.be/VffwWtklJvA\nZoom: https://ethereumfoundation.zoom.us/j/91348592283?pwd=SnRnL1VTeXNYVE9CaWpBbnJEUXhQZz09",
        "created_at": "2022-01-21T13:29:56.951000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Anyone from \u003c@\u0026688101493978562687\u003e joining?",
        "created_at": "2022-01-21T14:02:52.733000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003c@!425279588009246720\u003e If you can make it to the call, your input would be valuable on the discussions of subroutines and DIFFICULTY/RANDOM opcodes.",
        "created_at": "2022-01-21T14:04:03.655000+00:00",
        "attachments": null
    },
    {
        "author": "yperbasis",
        "category": "general",
        "parent": "",
        "content": "yes, I'm in",
        "created_at": "2022-01-21T14:04:04.232000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "I'll join now",
        "created_at": "2022-01-21T14:07:27.658000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I'm sorry if if expressing some anger on the call disturbed anyone, but in the engineering culture I've spent 50 years in that was very mild.\n\nWhen I arrived 6 ago the consensus was that the EVM was so broken it needed to be replaced by Wasm.  That didn't happen, and the team that was doing it has taken what they learned and are applying it to the EVM.  So at this point many people  have put years of work into improving the EVM, and every attempt to do so hits a wall and gets kicked down the road.  For years now.\n\nIt appears the current set of proposals is now looking to be another 2 years off.\n\nI would like to see a  strong commitment from the other devs that we really do want to bring the EVM up to modern standards before people put in another 2 year of wasted effort doing so.",
        "created_at": "2022-01-21T15:42:28.564000+00:00",
        "attachments": null
    },
    {
        "author": "yperbasis",
        "category": "general",
        "parent": "",
        "content": "We din't have time to discuss EVM improvements on the call today, but in my opinion EIP-3540/3670/3860 should be scheduled for Shanghai because they a) good proposals that help to speed up EVM execution a little bit and b) pave the way for potential future improvements like subroutines. But for such proposals we need a buy-in from Solidity – otherwise there's little point in having some theoretical EVM improvements w/o actual contracts utilizing them.",
        "created_at": "2022-01-21T15:55:28.630000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003c@!425279588009246720\u003e is a team leader for both Solidity and the EVM team, so that shouldn't be an issue.",
        "created_at": "2022-01-21T15:58:57.755000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I've heard this sentiment echoed in a few places now, so I think the best next step here is to propose moving those 3 EIPs to \"Considered for Inclusion\" for Shanghai on the next ACD. This gives 2 weeks for folks who disagree strongly to make their objections known. Assuming client teams are on board next week,  we can move them to CFI, create a Shanghai spec and we could then have them on the first iteration of Shanghai devnets. Does that make sense?",
        "created_at": "2022-01-21T16:40:43.240000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Yes, thanks.",
        "created_at": "2022-01-21T16:41:08.695000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Also, re: solidity,  `chriseth` on Ethereum Magicians was the one who had issues with 2315 last time. It might be good to just get a 👍 from him too",
        "created_at": "2022-01-21T16:42:45.144000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Actually, he made his final objections known onTwitter.  The discussions on the Magicians had long since concluded.",
        "created_at": "2022-01-21T16:44:02.298000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "So yes, if he has objections, now is the time to make them known.",
        "created_at": "2022-01-21T16:48:31.021000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "One thing I'm a bit unclear about, is the relationship between https://eips.ethereum.org/EIPS/eip-4200 (RJUMP and RJUMPI instructions with a signed immediate encoding the jump destination) and 2315. Both 4200 and 2315 have immediates, and make analysis easier. The former can be used for anything (e.g. loops), the latter only for subroutines. The latter incurs adding an additional stack on the EVM. I don't (yet) have any strong opinions, but my thinking is that 1) we don't need _both_ 4200 and 2315, and 2) I'd rather have 4200 with more generic usecases and without a separate stack. Now, I might be missing the subtleties, so please tell me why one is better than the other, or why they are not mutually exclusive",
        "created_at": "2022-01-21T17:18:03.299000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "Answering myself here: one key difference is that a relative static jump with immediates cannot be used to  gracefully _return_ from a subroutine, only enter into it",
        "created_at": "2022-01-21T17:24:30.818000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "With 4200 the goal is to improve those cases which are \"static jumps\", and those are \u003e90% of the cases in Solidity. The rest, like return to caller, can keep using the current jump instructions.",
        "created_at": "2022-01-21T17:29:00.649000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "Regarding the EOF proposals from Ipsilon we have reached out to various Solidity team members and their feedback has been incorporated. This mostly applies to 3540,  3670,  3860, while 4200 only had a cursory look, but we'll work towards getting them reviewed by them.",
        "created_at": "2022-01-21T17:34:22.054000+00:00",
        "attachments": null
    },
    {
        "author": "yperbasis",
        "category": "general",
        "parent": "",
        "content": "To my mind it'd make sense to have EIP-615 v2 based on EIP-3540/3670/3860 instead of separate EIP-2315 \u0026 4200. Such EIP-615 v2 would have static jumps, jump tables and subroutines and REMOVE dynamic jumps (or at least severely penalize them). It's a bit like with goto in programming: if you have ordinary and virtual functions and loops and conditionals, then you don't use goto. Were dynamic jumps still allowed (besides jump tables), that would leave Pandora's box open and code analysis complicated.",
        "created_at": "2022-01-21T17:38:07.881000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "We (ipsilon) did some internal specifications about jump tables, but all the various implementations didn't seem convincing enough that the complexity is worth it.\n\nWe also have another proposal in progress (mostly written up, just polishing it) which introduces proper function sections, which in my opinion solves the problem more nicely.\n\nA reason for jump tables would be to have the dispatch function as such, but actually function sections could be a better replacement for that too.",
        "created_at": "2022-01-21T17:41:39.977000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "Most of these were prototyped in evmone in the past months.",
        "created_at": "2022-01-21T17:42:08.844000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Opened this issue to track conversations about testnets post-merge: https://github.com/ethereum/pm/issues/460\n\ncc: \u003c@!388751025789468672\u003e \u003c@!219015859182632960\u003e",
        "created_at": "2022-01-21T19:01:18.465000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003e EIP-615 v2 based on EIP-3540/3670/3860 instead of separate EIP-2315 \u0026 4200\nThis collection of EIPs pretty much amounts to EIP- 615 v2.  They could be combined, but they are independently useful.\n\nEIP-3540/3670/3860 provide the scaffolding for versioning and a deployment time initialization phase.  They are ready to go.\n\nEIP-2315 provides substantial (circa 50%) gas cost advantages over the current approach with JUMP.  EIP-4200 does also, but I haven't seen an analysis.  They are ready for Review.\n\nEIP-3779 pulls all of the EIPs together to provide the safety guarantees that EIP-615 does and a little more:\n\u003e A valid contract will not halt with an exception unless it runs out of gas or overflows stack during a recursive call.\n\nEIP-4573 is an early draft to provide a procedural level of structure for code sections.  It appears that \u003c@!425279588009246720\u003e has an alternative in the wings.",
        "created_at": "2022-01-21T19:01:33.748000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003e ... goto in programming: if you have ordinary and virtual functions and loops and conditionals, then you don't use goto\nVirtual (and real) machines aren't programming languages, and most always support conditional and unconditional jumps, with which to compilers can generate higher-level structures.  Many machines support some sort of jump table and/or some form of indirect addressing, with which compilers can generate virtual functions and other such polymorhism.  (For that matter, even many structured programming languages retain _goto_ as an escape hatch.)",
        "created_at": "2022-01-21T19:13:39.484000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "The upshot of all this being that trying to pull these EIPs into a single EIP-615 v2 would be a lot of work that I'm not sure anyone wants to take on, and it would make it impossible to introduce the components in stages.",
        "created_at": "2022-01-21T19:16:00.781000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "PS.\n\u003e Were dynamic jumps still allowed (besides jump tables), that would leave Pandora's box open and code analysis complicated.\nEIP-3779 does a validation-time analysis to restrict dynamic jumps to static uses, including subroutine returns.",
        "created_at": "2022-01-21T19:24:48.874000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003c@!425279588009246720\u003e \u003c@!275684146658148352\u003e I made a PR against some version EIP-4200 somewhere (I can't find it now) for what I think is a fairly simple implementation of jump tables.",
        "created_at": "2022-01-21T19:46:14.174000+00:00",
        "attachments": null
    },
    {
        "author": "gumb00",
        "category": "general",
        "parent": "",
        "content": "I don't remember seeing that, but also the reason we don't include jump table instruction in 4200 is that currently existing dynamic jumps are good enough for that.\n\nJUMP can be seen as a jump table instruction over a global jump table encoded as JUMPDEST bytes inline in code (so all destinations are statically known, very similar to potential new jump table instruction)",
        "created_at": "2022-01-21T20:02:53.347000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "We discussed it, I just can't find it.  But as I recall it went like:\n```\nPUSH dest_index\nRJUMPTABLE\ndefault_dest\ndest1\ndest2\ndest3\n```\nwhere *default_dest* was the *dest* to take if the *dest_index*  was outside the size of the table.  It's important that the  table be repeated for each jump, even if it is the same, to prevent a DoS attack.\n\nI suggested adding it to 4200 to allow for future deprecation of dynamic jumps.",
        "created_at": "2022-01-21T20:20:33.471000+00:00",
        "attachments": null
    }
]