[
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "^ sounds like we've seen a majority of the traffic drop, but are still seeing some usage that _appears_ to be solo stakers.",
        "created_at": "2022-09-07T14:48:37.490000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I was away for a bit and just caught up on things here. Re: the Shanghai Planning discussion, I think there are a few things to consider: \n\nFirst, we agreed several months ago to pause eligibility conversations because we already have a very large list of EIPs CFI'd for the upgrade and were nowhere near, at the time, starting to implement them. \n\nSecond, it's worth recognizing that The Merge was a *ton* of work, and several contributors have voiced both publicly and privately that they/their team are burnt out from the effort. This is by far the largest upgrade we've done to Ethereum, and it's felt like a non-stop sprint for 1+ year (and more for others). \n\nThird, I think for Shanghai, the quality of decisions matters much more than the speed, at least for now. Having a final list of EIPs 1 month earlier is far less important than figuring out what the right scope is, IMO. \n\nGiven this, I'd like to propose something that Danny and I have floated to client teams: **taking a break from ACD/CL calls for ~1 month after The Merge, giving people time to recharge, step back a bit, and also to discuss the various potential EIPs for the upgrade async.** Some folks _really_ like calls and have said we could perhaps keep informal #party-lounge sessions on Thursdays 14:00 UTC to discuss certain EIPs, general prioritization, etc. but not have it be a formal place where decisions get made. \n\nI'm curious to hear what folks think about this, and if the sentiment is generally positive, I'm happy to put together a more concrete proposal for how \"discussing potential Shanghai EIPs\" async could work!",
        "created_at": "2022-09-07T14:49:06.607000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "To be clear: this would be _after_ The Merge - tomorrow's CL and next week's ACD call are still on 😅",
        "created_at": "2022-09-07T14:52:02.095000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "+1 for skipping a month of calls post-Merge",
        "created_at": "2022-09-07T14:54:26.325000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "the FINAL Merge community call - see you there!\n\n→ 14:00 UTC (10 ET) Friday Sept 9\n\nhttps://github.com/ethereum/pm/issues/599\n\nhttps://twitter.com/trent_vanepps/status/1567526645761703938",
        "created_at": "2022-09-07T14:56:06.173000+00:00",
        "attachments": null
    },
    {
        "author": "lukaszrozmej",
        "category": "general",
        "parent": "",
        "content": "I would prefer business as usual. As I prefer not to rush things I also prefer not to go to standstill. Skipping one when there is devcon is quite obvious though",
        "created_at": "2022-09-07T19:08:44.654000+00:00",
        "attachments": null
    }
]