[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Any final objections against this? If not, I’ll put the spec for Gray Glacier together tomorrow. \n\nThe prediction script in the EIP is wrong, though, so worth nothing that using 500k blocks, if we fork between blocks 15-15.1M, we should be at the same place, bomb-wise, as we are today by roughly late August.",
        "created_at": "2022-06-12T16:58:19.137000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e I think the delay should be 400,000 blocks instead of 500k",
        "created_at": "2022-06-12T17:28:12.578000+00:00",
        "attachments": null
    },
    {
        "author": "catwith1hat",
        "category": "general",
        "parent": "",
        "content": "Did somebody do the basic math of adding up all the outstanding work (preparation of bellatrix, the announcement of such, waiting for it to happen, setting TTD, announcing that, waiting for it to happen, post-merge analysis and patching bugs) times two for Sepolia, Goerli? To me, everything in round brackets takes a month for each testnet, so that alone would put us into mid-August. Then announce the merge, then give people at least a month. So we end up mid-September with the bomb already active again.  My apologies if I missed any project planning docs, but I haven't seen anything of that kind ever. Gantt, critical path, etc. Yes, plans are pretty useless to prove that you can achieve something by date X, but pretty effective in proving that you can't achieve something by date X.",
        "created_at": "2022-06-12T18:59:08.235000+00:00",
        "attachments": null
    },
    {
        "author": "dirigible6945",
        "category": "general",
        "parent": "",
        "content": "Well, for Sepolia and Goerli that part is unclear whether it would take 2 weeks or 4 weeks to finish related work for it. Goerli would be deploying mostly-ready mainnet builds, would it take a month of testing for that after seeing what we had on Sepolia and Ropsten?",
        "created_at": "2022-06-12T22:15:36.977000+00:00",
        "attachments": null
    },
    {
        "author": "infamousrev",
        "category": "general",
        "parent": "",
        "content": "When the ETH split happened with ETC it was never expected that both chains would survive so things like transaction replay protection were not considered (and had to be added later). Would it be a good idea to plan with a possible chain split in mind this time? So maybe the delay should be 400k blocks now, and then another 100-200k delay when the TTD will be set to sugar coat the poison pill (for the PoW miners) of the TTD hardfork, this will reduce the chance of a split. But even with this it may still be a good idea to maybe expect it to split anyway and to plan with transaction replay protection in mind (because both the PoS chain and PoW chain may survive).",
        "created_at": "2022-06-12T22:31:47.767000+00:00",
        "attachments": null
    },
    {
        "author": "infamousrev",
        "category": "general",
        "parent": "",
        "content": "Because the merge is such a radical change putting many miners out of business it is probably naive to assume it will be a fully non-contentious hardfork. Therefore it may be worth thinking about how to minimize disruption caused for all participants of the network.",
        "created_at": "2022-06-12T22:54:28.883000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Short answer is that it would create more confusion than it solves, I think. Myself and others obviously think about this, and anyone can make inferences based on previous network upgrade timelines about how long things take, but there is no hard and fast rule. \n\nI agree it might act as a « minimum possible date », but I’m not sure that’s how it would actually end up perceived. In practice, I suspect people would just be dissappointed every time that minimum date moves because they quickly assume it is the « official » estimate. \n\nIt’s a bit harder for The Merge specifically because it’s the first coordinated EL/CL upgrade and, for example, the incidents around the Ropsten TTD have led to rethinking how we may want to approach the mainnet deployment.",
        "created_at": "2022-06-12T23:17:27.166000+00:00",
        "attachments": null
    }
]