[
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "The procedure:\n\n1. Launch beacon chain\n2. Cut releases with Paris and Bellatrix -- users are upgrading nodes\n3. Wait it to be upgraded to Bellatrix -- this upgrade adds `ExecutionPayload` into a beacon block, establishes communication with EL. CL needs to know the TTD -- it's querying EL for the head, and once the head reaches TTD it proposes a transition block\n4. Set real TTD on EL and CL and, ideally, cut releases that include the new TTD value\n5. Users are upgrading nodes -- presumably, upgrade takes ~~24 hours~~ X hours/days/weeks; not ideally, users use TTD override flags -- I don't think that considering the upgrade complexity for the whole network it would take less than ~~24~~ X hours/days/weeks tho and it might make sense\n6. TTD hits\n\nFor the mainnet it makes sense to combine 2 and 4 to preclude users upgrading nodes twice. For testnets, apparently, we do it separately to alleviate risk of early TTD hit (before Bellatrix). But the risk of TTD hit between 4 and 5 still exists, though, the probability of this risk to hit should be much lower.\n\nI don't see *any* design flaw here. I might see a flaw in the procedure we have been using to upgrade Ropsten but the lesson is learned and we'll do Sepolia in the right way.",
        "created_at": "2022-05-27T08:30:47.963000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I am strongly confident in the decision that we have made to set TTD to incredibly hight value and do the things in the right order according to the procedure that is outlined above. To be honest, I am glad that we have this issue with Ropsten. Yes, it adds more stress but it also shows that we may coordinate and react relatively quickly and that we actually have mechanisms to take the situation under control, even though we're not expecting exactly the same thing happening on the Mainnet.",
        "created_at": "2022-05-27T08:33:49.805000+00:00",
        "attachments": null
    },
    {
        "author": "catwith1hat",
        "category": "general",
        "parent": "",
        "content": "Pardon, do I read this correctly? You expect node operators to take action 24 hours after you published the TTD (in presumably a blog post)?",
        "created_at": "2022-05-27T08:55:23.038000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Yeah I’d say we need longer than 24 hours but it will be at a known time so people will be able to plan ahead.",
        "created_at": "2022-05-27T08:57:02.895000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Agreed, thinking that approximately 7 days is reasonable.",
        "created_at": "2022-05-27T08:57:26.106000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "You're right, my \"24 hours\" is something that should be replaced with \"X hours/days\" and depends whether it's a testnet or the mainnet",
        "created_at": "2022-05-27T08:58:01.672000+00:00",
        "attachments": null
    },
    {
        "author": "catwith1hat",
        "category": "general",
        "parent": "",
        "content": "What happens if only a minority implements the TTD override?",
        "created_at": "2022-05-27T09:06:10.278000+00:00",
        "attachments": null
    },
    {
        "author": "catwith1hat",
        "category": "general",
        "parent": "",
        "content": "(Sorry, the timeline seems extremely aggressive to me. I do production software for a living at a hyperscaler, and also do free software. I expect 1% of users to upgrade within 7 days, and I simply cannot understand the rollout schedule proposed. This is no criticism. I saw you pull it off with EIP1559 setting a fork block 4 weeks in advance, which baffled me completely and it worked.)",
        "created_at": "2022-05-27T09:07:59.018000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Hard forks are kind-of mandatory.  If you don't upgrade you'll be on a different chain to those who did upgrade.",
        "created_at": "2022-05-27T09:09:03.338000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I think that X days may become X weeks for the Mainnet. Sorry, the exact time between releases and TTD hit on the Mainnet was not the message that I was conveying. My message was about the generic order of actions that would work for testsnets and the Mainnet.",
        "created_at": "2022-05-27T09:14:18.637000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The procedure you described sounds correct. The procedure that was followed for Ropsten and was suggested to be followed for Sepolia was what was flawed IMO.  I do not think we should do a *different* procedure for mainnet.  If users don't want to upgrade their clients twice, they can simply *choose* to skip the first one and risk it, but that should be their choice not ours.  We should provide a path that allows them to not \"risk it\".",
        "created_at": "2022-05-27T10:58:38.469000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Also, having a *consistent* procedure for testnets and mainnet is incredibly valuable.  It allows operators to practice the whole procedure end-to-end and setup any necessary runbooks/scripts of their own and test them on testnets and use the same runbooks/scripts on mainnet.",
        "created_at": "2022-05-27T11:00:53.257000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Would love to see some focus on this in the subsequent tests.  We're way off it at current (compiling binaries and special flags for ropsten, ignoring the TTD issues).",
        "created_at": "2022-05-27T11:07:34.253000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Sounds like mainnet deployment will be extremely complex",
        "created_at": "2022-05-27T12:12:28.381000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "More complex than usual, certainly.",
        "created_at": "2022-05-27T12:12:54.351000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**AllCoreDevs in 20 mins**\nAgenda: https://github.com/ethereum/pm/issues/528\nStream: https://youtu.be/5mMd-XHAv2Q\nZoom: https://ethereumfoundation.zoom.us/j/91348592283?pwd=SnRnL1VTeXNYVE9CaWpBbnJEUXhQZz09",
        "created_at": "2022-05-27T13:41:14.202000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "\u003c@360491619402776577\u003e  So lets say block time goes to 20+ s. Isn't that comparable to paypal sending an email for people who do business on the chain saying:  'please don't do big business in our network for the time being, also if you still try, those transaction fees are not reimbursable if they dont go through'. \nUsually people start looking at other options to run their business at.\n\n20s will also increase the average transfer confirmation time already significantly. 35 blocks confirmation in coinbase mean an increase from 7.5min to  ~12min, at 30s it would be ~17.5min. The network will throttle (big gas) with big NFT drops, unless they stop doing them, like it did in december with 13s block times.",
        "created_at": "2022-05-27T17:17:36.536000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "in additional to the time and operational UX of longer times.. has anyone does any rough calcs on what the impact would be to estimated gas price? (e.g. with double the block time.. does that roughly equate to double the gas price or 4x or?) thx..",
        "created_at": "2022-05-27T17:29:19.762000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "This sounds ok to me, I think even for Ropsten we should ideally have the time between 4 and 6 be more than a couple days, jgm's suggestion of a week sgtm too!\n\nEven though its \"just Ropsten\" the optics of the first \"testnet\" merge going badly won't be great (kiln and kintsugi are less known outside this group).",
        "created_at": "2022-05-27T18:10:23.396000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We can't really know because wallets don't ask users how much they are willing to pay.",
        "created_at": "2022-05-27T18:36:39.646000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "The consensus on ACD was that we'd tentatively set a TTD on the CL call next week (June 2), and \"finalize\" it the next day once Bellatrix had hit. We can then announce it on June 3rd, and aim to have the fork happen around June 8th. We'd probably pick a TTD which is expected to be later than the 8th and then add some miners to Ropsten if we want it to happen sooner.",
        "created_at": "2022-05-27T18:38:24.496000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "For future networks, the lag should be longer",
        "created_at": "2022-05-27T18:38:49.961000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "\u003e We'd probably pick a TTD which is expected to be later than the 8th\n\nJust curious, would this be extrapolated from recent baseline hashpower or factoring in the attackers hashpower?",
        "created_at": "2022-05-27T20:08:34.916000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Given the hashpower was on the order of X00$/day to add to the chain, I'd rather factor it in and then pay mining costs rather than aim too low and hit TTD on, say, June 4th",
        "created_at": "2022-05-27T20:11:36.588000+00:00",
        "attachments": null
    },
    {
        "author": "sma4321",
        "category": "general",
        "parent": "",
        "content": "As someone who has lurked and watched ACD for years, ACD has (yet again) been the steady hand doing careful work to deliver a reliable outcome; every time someone finds a new spanner to throw, the work gets better. That's not easy and is appreciated.",
        "created_at": "2022-05-27T20:16:01.139000+00:00",
        "attachments": null
    },
    {
        "author": "dirigible6945",
        "category": "general",
        "parent": "",
        "content": "Agreed. I appreciate that the devs have (mostly) come to a consensus on a short -- and final (🤞)  bomb delay. I am looking forward to the merge in a few months as the PoW chain begins to ice out, rather than when it is already freezing.",
        "created_at": "2022-05-27T21:36:36.342000+00:00",
        "attachments": null
    }
]