[
    {
        "author": "metachris_",
        "category": "general",
        "parent": "",
        "content": "not sure where to post, but https://github.com/ethereum/pm/issues/ needs a bit of modding (there's 3 no-content issues)",
        "created_at": "2022-10-19T11:51:02.224000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Thanks - fixed! Wasn't checking it as frequently these past two weeks",
        "created_at": "2022-10-19T15:17:32.714000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Hey everyone 👋 ! \n\nFriendly reminder that we'll be resuming ACD/CL calls next week (agenda: https://github.com/ethereum/pm/issues/624). Even though there haven't been public calls, over the past month, I've had a ton of conversations with client teams, researchers, EIP champions, etc. regarding how we should approach Shanghai/Capella. \n\nOne commonality talking across client teams in the past few weeks has been the desire to get clarity relatively quickly on priorities so they can allocate staff on them ASAP. \n\nIn order to make things a bit more efficient, I think one thing we could try on the ACD call next week is to use a \"pull\" model from client teams to discuss candidate EIPs. Basically, have each client team go through the list of candidates here (https://ethereum-magicians.org/tag/shanghai-candidate), along with the currently CFI'd EIPs (https://github.com/ethereum/execution-specs/blob/master/network-upgrades/mainnet-upgrades/shanghai.md#eips-considered-for-inclusion) and highlight the ones they'd like to discuss. I think this will allow us to \"sort\" better than going through proposals in whatever order they are proposed. \n\nI definitely think we should also allow space for people to come and bring up their EIPs, but IMO doing it after this initial discussion will help frame things better, as we'll have a better view of what client teams can commit to. \n\nI realize a lot of people are taking a well deserved rest after devcon, but I'll be around `#party-lounge` tomorrow 14:00 UTC to chat about this idea 😄 !",
        "created_at": "2022-10-19T19:06:54.452000+00:00",
        "attachments": null
    }
]