[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**AllCoreDevs in ~50m (14:00 UTC)**\nAgenda: https://github.com/ethereum/pm/issues/675\nStream: https://www.youtube.com/watch?v=y8jZ11_CQGo\nZoom: https://ethereumfoundation.zoom.us/j/91348592283?pwd=SnRnL1VTeXNYVE9CaWpBbnJEUXhQZz09",
        "created_at": "2022-12-08T13:11:17.537000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Rough summary of the call for those who couldn't make it: \n1. We agreed to the scope for Shanghai: we will move forward with all previously included EIPs (Withdrawals, PUSH0, Warm COINBASE, Limit/Meter initcode) **as well as the 5 EOF EIPs (3540, 3670, 4200, 4750, 5450), as long as they do not delay withdrawals significantly**\n2. To ensure this re: EOF, we'll have two \"gates\" early next year: **EL client implementations completed \u0026 tested by ACD on Jan 5, and EL cross-client interop by ACD on Jan 19. If we miss either of these, we agreed to remove EOF from Shanghai and ship only the 4 other EIPs to ensure withdrawals are not delayed. **\n3. We agreed that EIP-4844 should be included in the fork after Shanghai, to reflect how the CL specs are right now. There isn't really a way to do this on the EL side, so for now I'll create `cancun.md` and list EIP-4844 as Included. Open to better options if people have suggestions! \n4. \u003c@360491619402776577\u003e will be putting together an EIP for time-based EL forking 🔜, geth already has an implementation\n5. We agreed to include these two Engine API changes in Shanghai, unless we see them cause unexpected delays for teams: https://github.com/ethereum/execution-apis/pull/314 \u0026 https://github.com/ethereum/execution-apis/pull/218 \n6. Alongside EIP-4844, there may be other things we want to make a decision on quickly for the next upgrade. In the first few calls next year, we'll discuss those. Client teams should try and review what's posted on the agenda before then and highlight anything they feel particularly strongly about!",
        "created_at": "2022-12-08T15:54:24.383000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "\u003c@552133098075193354\u003e will you create a \"Proposals for Cancun\" on magicians? Or are people supposed to propose as an issue on https://github.com/ethereum/pm? Both cases still exists for Shanghai.",
        "created_at": "2022-12-08T16:02:04.113000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Let's do EthMagicians 👍 Will remove the /pm ones and create that 🔜 !",
        "created_at": "2022-12-08T16:02:42.117000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "general",
        "parent": "",
        "content": "Note that we aim for a **fast turn-around with Cancun**, ideally *in May/June*, 4844 is a critical improvement for ethereum and so far we were aiming/building towards Shanghai already. So we should continue the already ongoing 4844 testnet efforts, and need client support insofar it does not delay Withdrawals. I believe Cancun should be open for additional proposals, but IMO by start of February every proposal should meet the same support/testing as 4844 to go into Cancun. E.g. EIP-1153 would be a good candidate, or EOF if it slips in January.",
        "created_at": "2022-12-08T16:32:48.890000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I personally agree with that as well. I think it's important to have a more explicit conversation around it in the first few calls in Jan 👍",
        "created_at": "2022-12-08T16:35:53.697000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "What is the general feeling about switching to CL fork naming notation after Shanghai? Previously, I was a proponent of keeping them separate but now I often catch myself on trying to call a thing with a wrong name",
        "created_at": "2022-12-08T16:40:55.516000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I really liked Proto's idea: we keep using the same naming schemes and combine them to refer to the full upgrade. E.g. we keep Shanghai and Capella, but given they ship together, the upgrade is called Shapella. See: https://ethereum-magicians.org/t/rfc-post-merge-network-upgrade-naming-schemes/11977/9?u=timbeiko",
        "created_at": "2022-12-08T16:44:32.859000+00:00",
        "attachments": null
    },
    {
        "author": "__kasey__",
        "category": "general",
        "parent": "",
        "content": "Everyone loves a portmanteau, but we could also just literally concatenate them, eg \"Shanghai Capella\". Kind of looks like a celebrity's name.",
        "created_at": "2022-12-08T16:58:45.251000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "Shanghai/Capella or as I recently started calling it Shanghai + Capella",
        "created_at": "2022-12-08T17:35:33.707000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Two words just makes it really weird to communicate to the broader community. IMO \"Shapella\" \u003e\u003e\u003e \"Shanghai/Capella\".",
        "created_at": "2022-12-08T17:36:42.761000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "There is likely to be very little in terms of new features at the consensus layer that interest users, so I don't see a problem with having two separate names and using the EL one when communicating to the outside world as that is what people will care about.  Capella has no features of interest to anyone that likely isn't in this Discord; it _enables_ features in Shanghai, sure, but doesn't bring them by itself.  Separately, Shanghai _will_ enable features that are of interest to end users.  So talking about Shanghai when discussing the features that will become available (_e.g._ withdrawals) seems like a totally reasonable thing to do, and keeps communications with the outside world much cleaner and clearer.\n\nPortmanteaus can easily end up being ugly, awkard or offensive.",
        "created_at": "2022-12-08T17:42:25.321000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I think you're underselling the beacon chain 🙂 people care about things like `0x00` -\u003e `0x01` credential swaps or, even more-so, anything related to issuance/security. I don't think it's good to try and \"hide\" those changes. That said, we should probably move this conversation back to EthMagicians to not spam this channel with it 🙂",
        "created_at": "2022-12-08T17:45:19.332000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Here is a PR reflecting these changes in the specs: https://github.com/ethereum/execution-specs/pull/663\n\nWill merge tomorrow if no objections on it.",
        "created_at": "2022-12-08T17:45:50.333000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Here's something to start with 🙂 https://ethereum-magicians.org/t/cancun-eip-consideration/12060",
        "created_at": "2022-12-08T17:49:19.289000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I found myself using both Shanghai and Capella interchangeably",
        "created_at": "2022-12-08T20:54:03.263000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "Would've been better to have Cancun Capella I guess, both a C. Maybe we can do a quick EL-only fork to make it match up 😉",
        "created_at": "2022-12-08T20:59:55.308000+00:00",
        "attachments": null
    }
]