[
    {
        "author": "faraz3920",
        "category": "general",
        "parent": "",
        "content": "Hello is there a way to generate a certificate of proof that a transaction occurred on the ethereum blockchain.\n\nI want to monitor a account for incoming eth perform some offchain computation based on the amount of eth received in the account.   Is there a “certificate” that the block chain can generate such that I don’t have to run a full eth node.",
        "created_at": "2022-03-26T21:19:54.424000+00:00",
        "attachments": null
    },
    {
        "author": "faraz3920",
        "category": "general",
        "parent": "",
        "content": "I know about the “don’t trust verify” mantra. I am curious to know how will running a local node work in ETH2 for cases where one just wants to verify authencity of a transaction post consensus. Will I need 32 eth for this ?",
        "created_at": "2022-03-26T21:29:11.931000+00:00",
        "attachments": null
    },
    {
        "author": "domotheus",
        "category": "general",
        "parent": "",
        "content": "You won't need 32 ETH to run a full node after the merge. As for the certificate, my best guess would be a merkle proof that shows the transaction is indeed included in a specific block by checking against the transactionsRoot block header, which can be verified by a light node that only syncs headers",
        "created_at": "2022-03-26T22:14:03.800000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e You do not need 32 ETH to run a full node. You only need to do this to run a validator",
        "created_at": "2022-03-26T22:18:28.949000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e Anyone can run a full node and it is very cheap to do so. Yes you can use it to verify that a transaction has occured.",
        "created_at": "2022-03-26T22:19:08.277000+00:00",
        "attachments": null
    }
]