[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Well, I'd say that having many users losing funds because they are following the wrong chain and take it as the right one is a successful attack on the network.",
        "created_at": "2022-07-11T00:44:26.599000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "There is a chance a user unintentionally ends up on a fork they don't want to be on with every upgrade.  This is just the nature of how fork based governance works.",
        "created_at": "2022-07-11T02:51:52.227000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I wouldn't call that an attack though.  That is just a user making a mistake.  Nothing malicious was involved.",
        "created_at": "2022-07-11T02:52:46.815000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "following the wrong chain ends up just being inactivity... thats not so bad unless a lot of ppl do it and the penalties bloom i guess.. then that'd get bad fairly fast...",
        "created_at": "2022-07-11T02:55:38.299000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "We can use TTD override as a safeguard as we did on Ropsten. Hashrate on Mainnet is much less volatile and we should be able to identify the point where TTD happens before Bellatrix early enough to react.\n\nConsidering very low risk of hashrate spike on Mainnet and existence of the safeguard, I am advocating for releasing TTD and Bellatrix epoch at once",
        "created_at": "2022-07-11T10:39:00.115000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "As I mentioned above, my argument here is not that this is an unreasonable change.  It is that we are crossing a bright line (trading robustness for deployment UX/timeline) and we should not do that without having a new bright line well defined in advance.",
        "created_at": "2022-07-11T10:41:43.987000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Crossing bright lines is almost never dangerous the first time, the problem is that once you cross it the first time it becomes easier to cross it again in the future and each time it gets crossed it becomes easier until the line no longer holds any meaning.",
        "created_at": "2022-07-11T10:42:29.146000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Yes, this makes sense. And what I am trying to say is that IMO this time crossing the line is reasonable, because a) the risk we're concerned about has low probability and there is a safeguard in place b) not crossing the line leads to a risk of misconfiguration",
        "created_at": "2022-07-11T10:47:11.896000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I agree, crossing the line \"just this time\" is almost certainly fine and worth if if we ignore the weakening of the line.",
        "created_at": "2022-07-11T11:04:05.562000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I disagree that it’s a bright red line. If we always prioritised robustness over UX and timelines we’d never ship because there’s always another test we could write or more time to see if it works on testnets etc.",
        "created_at": "2022-07-11T11:06:17.992000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "In this case, there is basically no engineering work required to do the robust solution.  It is purely a \"we want to ship sooner\" or \"we want messaging to be simpler\".",
        "created_at": "2022-07-11T11:07:43.689000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I agree that we have made robustness trades for engineering reasons in the past, though we try to avoid them as much as possible.  I feel like making robustness for timeline or messaging trade is a new uncrossed line.",
        "created_at": "2022-07-11T11:08:32.837000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Oh, for me it's not that much about increasing the timeline but more about increasing the probability of the misconfiguration risk",
        "created_at": "2022-07-11T11:13:00.422000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I'm a fan of shipping Belatrix ASAP.  I believe the reason we are waiting until *after* Goerli is in case Goerli turns up any bugs?",
        "created_at": "2022-07-11T15:06:32.999000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003ctimbeiko\u003e that + also not training users to ignore logs between the EL + CL",
        "created_at": "2022-07-11T15:07:14.595000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Why would we be training people to ignore logs (sorry I missed most of the meeting)?",
        "created_at": "2022-07-11T15:14:41.749000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "What about implementing a \"soft\" version of the external TTD config, where the focus is on messaging the node operator vs actually configuring the node.  Something like this:\n\n- Define the mainnet \"placeholder\" TTD (e.g. 10e23 or whatever we used on Ropsten and Sepolia: unsure if that value is high enough on mainnet)\n- If on startup TTD == placeholder, warn user that their node is not fully setup yet, that they still need to update to final TTD once its available\n- could even \"pre-select\" a EF blog URL, which 404s until final TTD is decided\n- if on startup TTD is placeholder *and* blog URL returns a 200 then warn _really loudly_ that final TTD is available but node isn't updated (maybe even fail to launch?)\n- one downside: could this be an accidental ddos on EF blog infra?\n\nKey difference is this removes any \"automatic config selection\" that we have various views on and focuses solely on automating the messaging to users about the two-step fork-then-TTD-override process.",
        "created_at": "2022-07-11T15:59:18.862000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Because if ELs aren't configured with a TTD as well (or aren't upgraded), the CL will complain during some Engine API calls to the EL and print bad logs.",
        "created_at": "2022-07-11T16:22:54.563000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003e - If on startup TTD == placeholder, warn user that their node is not fully setup yet, that they still need to update to final TTD once its available\nI think this along might be worth doing if we do two steps\n\n\u003e - could even \"pre-select\" a EF blog URL, which 404s until final TTD is decided\nStrongly against tying the EF blog directly in the release process 🙂 In practice, the blog will have the TTD, but this can also be cross-checked against client codes, the Paris/Bellatrix specs, etc.",
        "created_at": "2022-07-11T16:24:14.814000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We could have the node start screaming louder and louder the longer after bellatrix it is until the user updates or provides a TTD override.",
        "created_at": "2022-07-11T16:30:54.557000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "How does the node \"know\" its current TTD is invalid?",
        "created_at": "2022-07-11T17:13:46.739000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If you are running Bellatrix client (not The Merge client), and TTD override isn't set, and Bellatrix hard fork was more than X days ago: Yell loudly.",
        "created_at": "2022-07-11T17:26:21.922000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It adds an assumption to the Bellatrix client that the TTD will be known X days after Bellatrix.",
        "created_at": "2022-07-11T17:27:05.308000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "The \"Merge\" client is the same as the Bellatrix client with a different TTD",
        "created_at": "2022-07-11T17:27:46.705000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Personally, I'd rather avoid these types of \"tweaks\" to clients so late in the process and instead have our coordination be done outside of them.",
        "created_at": "2022-07-11T17:28:29.068000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This is fine, the codepath that checks \"is TTD override set\" can just be changed to \"is TTD set to anything other than UINT256_max (or whatever it is set to in Bellatrix).",
        "created_at": "2022-07-11T17:29:16.043000+00:00",
        "attachments": null
    }
]