[
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "If a 2 month delay is unavoidable, why not add a merge ttd to the fork?\nMuir glacier happened with one week of upgrade time, and it worked with no problems. There are about 2 months of acceptable block times left. Therefore, bomb delay can easily be announced half of july with a fork set for 1 august. That's 1.5 months to prepare everything and set a reasonable ttd.\n\nThe merge itself needs at least one month imo - because people have to start beacon nodes, making it a more demanding update.\n\nAt the very least, the decision doesn't have to happen until July.",
        "created_at": "2022-05-28T08:02:57.413000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I think it's all but decided that we will not choose a real TTD before `BELLATRIX_FORK_EPOCH` has hit. What may be reasonable though is to defuse the bomb for a couple of months and decide this epoch at the same time. This would depend on how long it takes to defuse the bomb in terms of coordination as this sets an upper bound on when to ship the bomb defusal.  On the one hand I suspect people will not want to set mainnet's Bellatrix epoch before Goerli's merged so there's some lower bound to setting this epoch. If there's some intersection then it makes sense to mix the defusal into what was being called Paris fork during the call.",
        "created_at": "2022-05-28T08:11:53.164000+00:00",
        "attachments": null
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "Would it be preferable for Coinbase to adjust their confirmation requirements to factor in blocktimes?\n\n(longer blocktimes reduce the likelihood of a reorg succeeding, for a particular level of depth)\n\nhttps://blog.ethereum.org/2015/09/14/on-slow-and-fast-block-times/",
        "created_at": "2022-05-28T12:18:07.677000+00:00",
        "attachments": null
    }
]