[
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "PSA: Anyone that has been using `ethstats.net` should update their flags to send to `ethstats.dev` instead. \n\n- If you are a client dev, and your client has ethstats url hardcoded, please update, \n- If you are a node operator, please update your parameters to use the `ethstats.dev` address. \n- If you are in control of documentation, please update it to use the `ethstats.dev` address.\n\nThe `ethstats.net` domain was never owned by EF, and despite our attempts to get it transferred to us, it eventually fell through, and the domain expired -- and AFAIU it was immediately sniped.",
        "created_at": "2022-11-17T12:01:36.672000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "Hi guys. A quick comment about EIP-1153 (Transient Storage Opcodes):",
        "created_at": "2022-11-17T12:26:22.226000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "I've been talking to \u003c@273818081439121408\u003e on and off about this, and he feels very strongly that the EIP is not fit for inclusion in its current form. However he doesn't know how to further raise the issue and feels ignored with his technical feedback.",
        "created_at": "2022-11-17T12:27:54.921000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "Specifically, this is about the 'scope' of transient storage values.",
        "created_at": "2022-11-17T12:28:19.670000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "We both think that transient storage entries should be reset when the surrounding CALL ends.",
        "created_at": "2022-11-17T12:28:55.818000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "Semantics like that make transient storage good enough for re-entrancy locks.",
        "created_at": "2022-11-17T12:29:11.567000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "The current EIP version makes transient storage entries live until the end of the transaction, which can supposedly enable some advanced use cases, but also has huge potential for contract bugs.",
        "created_at": "2022-11-17T12:30:19.131000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "For example, if a certain contract relies on setting transient storage for a re-entrancy lock around a CALL, but does not clear the lock when the CALL returns, the lock will be stuck and the call interaction cannot be repeated within the same transaction.",
        "created_at": "2022-11-17T12:32:21.578000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "This can lead to situations where 'batching' of contract calls is no longer possible.",
        "created_at": "2022-11-17T12:32:45.789000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "Both \u003c@273818081439121408\u003e and I don't fully understand the advanced use-cases that people would want the current version of EIP-1153 for.",
        "created_at": "2022-11-17T12:33:08.995000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "Just think it might be better to reduce the scope of this feature in the interest of contract security.",
        "created_at": "2022-11-17T12:40:00.083000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "Not to 'derail' the discussion from what \u003c@194432762315407360\u003e mentions above, but one tangential concern/thought: wouldn't it be better to do 1153 _only_ on eof-versioned code? Making it so that as far as possible, we don't change/evolve legacy code, but add all features and new opcdes to eof only, as a carrot to get people to use the new format ( regardless of whether 1153 happens in shanghai or cancun (or not at all))",
        "created_at": "2022-11-17T12:43:54.330000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "CL call in 20 minutes\nhttps://github.com/ethereum/pm/issues/660",
        "created_at": "2022-11-17T13:41:33.528000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "https://ethereumfoundation.zoom.us/j/91725886939?pwd=b2kzT0JGeFAzTmhyb1BYSTgrZ0xwdz09",
        "created_at": "2022-11-17T13:56:52.179000+00:00",
        "attachments": null
    },
    {
        "author": "sendmoodz",
        "category": "general",
        "parent": "",
        "content": "this is not how transient storage would be used for a reentrancy lock, this would strictly be considered a smart contract bug. doesn't seem like a con of the eip\ni'd also just like to reiterate, reentrancy locks are just one of many use cases of transient storage",
        "created_at": "2022-11-17T14:52:33.647000+00:00",
        "attachments": null
    },
    {
        "author": "sendmoodz",
        "category": "general",
        "parent": "",
        "content": "reducing the scope of tstore/tload to only subcalls is actually increasing the complexity of the eip as far as the evm goes, meaning more complicated testing as well, at the cost of these advanced use cases. happy to explain any advanced use cases further here, or in the discussion thread if you post some of your questions. a few of them are listed here https://ethereum-magicians.org/t/eip-1153-transient-storage-opcodes/553/91?u=moodysalem\nas far as risk of smart contract bugs, \u003c@822908652116639806\u003e from RV shared his opinions here: https://ethereum-magicians.org/t/eip-1153-transient-storage-opcodes/553/105?u=moodysalem\nmy opinion on that is the evm should not be designed around preventing smart contract developers from writing bugs. arguing we shouldn't have tstore because it may be misused seems similar to making the argument we shouldn't have call or sstore because of risk of reentrancy bugs",
        "created_at": "2022-11-17T15:00:16.444000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminion",
        "category": "general",
        "parent": "",
        "content": "Notes: https://hackmd.io/@benjaminion/rJBcqhXIo",
        "created_at": "2022-11-17T15:05:24.209000+00:00",
        "attachments": null
    },
    {
        "author": "sendmoodz",
        "category": "general",
        "parent": "",
        "content": "\u003c@543900561460822016\u003e mentioned this in the call, my main concern with this is increasing the dimensions to the testing matrix (it would mean the two eips do interact a bit more, and the set of eof eips is not currently agreed upon). given 1153 is an addition and not a backwards incompatible change the only reason to do it seems to be to make it a carrot to use the new format, but there should already be incentives to use EOF or else why is EOF being considered?",
        "created_at": "2022-11-17T15:12:29.933000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "I read \u003c@822908652116639806\u003e's comment as addressing implementation/compiler complexity, and not contract bug risks.",
        "created_at": "2022-11-17T15:35:39.411000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "Given the very frequent reports of contract bug exploitation, I think we do need to care about these risks at the EVM design level.",
        "created_at": "2022-11-17T15:37:41.784000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "Thank you for providing the link to the detailed list of use cases, I overlooked that in the thread before.",
        "created_at": "2022-11-17T15:38:30.386000+00:00",
        "attachments": null
    },
    {
        "author": "sendmoodz",
        "category": "general",
        "parent": "",
        "content": "i think his post is explicitly not about the complexity of the compiler, but i'll let \u003c@822908652116639806\u003e speak for himself:\n\u003e I also can’t speak for the Solidity compiler, but does the Solidity compiler need to support the feature immediately?\n\u003e The first users of the feature, whether via the Solidity compiler or not, are going to be taking the brunt of risk here ...\n\u003e I am usually a fan of the “give the devs tools, and let them figure out how to not shoot themselves in the foot” approach.\nthis is coming from an auditor specializing in FV, which is the perspective that was requested from other solidity team developers, e.g. ekpyron in the thread:\n\u003e Are there any statements of these changes not causing issues and being perfectly fine and manageable from people doing static analysis or formal verification or auditors?",
        "created_at": "2022-11-17T15:55:15.184000+00:00",
        "attachments": null
    },
    {
        "author": "sendmoodz",
        "category": "general",
        "parent": "",
        "content": "i've spent a lot of time trying to address the concerns of the solidity team, i don't think it's accurate to say it's been ignored, i also mentioned the concerns in the PEEPanEIP we just recorded, definitely hearing and listening to the feedback",
        "created_at": "2022-11-17T15:56:08.704000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "As for \"adressing the concerns\", the discussion on https://ethereum-magicians.org/t/eip-1153-transient-storage-opcodes/553/93 reads to me like you are pretty harshly trying to silence them by telling them not to oppose this late in the process. \n\nFrom the perspective of a geth-dev, the PR is pretty simple, and I have no qualms. But I think that the perspective of the solidity devs matter a lot, and have high regard for their opinions\n\nI'm also no super-keen about being listed as \"in support\", when you cite one positive bullet point I wrote, but ignore the remaining (negative) ones. (EDIT: fixed now, thanks!)",
        "created_at": "2022-11-17T16:23:03.720000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "Our main technical point opposing the change is as follows: Since transient storage slots will be cleared automatically at the end of the transaction, there is little incentive to 'unset' them. It costs strictly less gas to let the slot expire, and we therefore believe contract authors will omit releasing locks, for example. This will lead to cases where only a single interaction with the contract can be made per transaction.",
        "created_at": "2022-11-17T16:29:12.567000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "I strongly agree something like transient storage is needed. Using storage for these use cases is *not* appropriate.",
        "created_at": "2022-11-17T16:34:33.149000+00:00",
        "attachments": null
    },
    {
        "author": "sendmoodz",
        "category": "general",
        "parent": "",
        "content": "the incentive is composability, app developers will not sacrifice composability in order to save a small amount of gas. i say this as a developer at uniswap, we would not consider doing that.",
        "created_at": "2022-11-17T16:39:16.076000+00:00",
        "attachments": null
    },
    {
        "author": "sendmoodz",
        "category": "general",
        "parent": "",
        "content": "there will be many cases where developers don't clear the slot, and those contracts will be worse than contracts that do.",
        "created_at": "2022-11-17T16:40:03.578000+00:00",
        "attachments": null
    },
    {
        "author": "sendmoodz",
        "category": "general",
        "parent": "",
        "content": "we are all competing to write the best smart contracts, and so app developers _will_ clear the slot. there isn't a rational reason to deliberately make your contracts worse from the perspective of integrators",
        "created_at": "2022-11-17T16:41:28.174000+00:00",
        "attachments": null
    },
    {
        "author": "sendmoodz",
        "category": "general",
        "parent": "",
        "content": "uniswap is a heavy user of solidity, i think solidity's perspective matters a lot as well. earlier in the thread i think there was a productive discussion w/ \u003c@273818081439121408\u003e which resulted in several changes/cleanup of the EIP. apologies for expressing my frustration in the later interactions, i did not mean to silence anyone",
        "created_at": "2022-11-17T17:02:41.357000+00:00",
        "attachments": null
    },
    {
        "author": "joeysantoro",
        "category": "general",
        "parent": "",
        "content": "If a footgun exists, the less experienced (most) solidity devs will find a way to shoot themselves because they didn’t know better.\n\nThat being said, it will be on the respective lang teams and dev community to establish strong standards and best practices.\n\nMore use case expressivity is a plus but the biggest plus to me is the fact that as written is simplest from the evm perspective",
        "created_at": "2022-11-17T17:29:01.699000+00:00",
        "attachments": null
    },
    {
        "author": "ehildenb",
        "category": "general",
        "parent": "",
        "content": "👋",
        "created_at": "2022-11-17T19:31:45.444000+00:00",
        "attachments": null
    },
    {
        "author": "ehildenb",
        "category": "general",
        "parent": "",
        "content": "I'm mostly in support of the feature as a whole, I think it makes sense. There is precedent in other blockchains for having multiple memory regions with finer-grained longevity.",
        "created_at": "2022-11-17T19:32:50.866000+00:00",
        "attachments": null
    },
    {
        "author": "ehildenb",
        "category": "general",
        "parent": "",
        "content": "I do think the discussion on the EIP seems to have strayed from productive in the past, but that's beside the point.",
        "created_at": "2022-11-17T19:33:48.512000+00:00",
        "attachments": null
    },
    {
        "author": "ehildenb",
        "category": "general",
        "parent": "",
        "content": "Not sure how much complexity this introduces in the Solidity compiler, I guess my initial impression is \"not much\", but I also am not a Solidity compiler dev, so I have no real idea. But I guess if the feature is just exposed via inline assembly first, we'll see some common usage patterns emerge and can target Solidity-level support for those specific patterns.",
        "created_at": "2022-11-17T19:34:42.079000+00:00",
        "attachments": null
    },
    {
        "author": "ehildenb",
        "category": "general",
        "parent": "",
        "content": "I think the risk of introducing contract bugs is (and always will be) largely on the contract developers (and thus users of those contracts). Education about materials, and Solidity-level exposure of the feature, should help mitigate this. But if developers want it, we should find a way to make it happen. The developers are the customers here, not the tool builders.",
        "created_at": "2022-11-17T19:38:39.220000+00:00",
        "attachments": null
    },
    {
        "author": "ehildenb",
        "category": "general",
        "parent": "",
        "content": "But if the developers want \"cheaper memory that is persistent across re-entrant calls\", this seems like a perfectly fine way to implement that. The \"adjust the gas schedule\" option seems like a hackier version of achieving the same thing to me, without the clients then being _guaranteed_ that they can free th ememory post transaction. Bundling the storage slots you _intend_ to use in the way with transactions is another possibliity (eg. how the storage access lists work), but that seems like it will bloat transaction and state size a lot over time.",
        "created_at": "2022-11-17T19:40:14.331000+00:00",
        "attachments": null
    },
    {
        "author": "ehildenb",
        "category": "general",
        "parent": "",
        "content": "Could also consider starting the gas cost of `TSTORE` and `TLOAD` to be comparable to `SSTORE` and `SLOAD` used in the pattern that people are doing now. Then at least it's not cheaper for people to use the new featrue, let them try it out, nad in later hardfork adjust the costs down.",
        "created_at": "2022-11-17T19:41:18.088000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "can we move this discussion to either \u003c#706868829900505180\u003e or the magicians thread pls?",
        "created_at": "2022-11-17T19:41:22.693000+00:00",
        "attachments": null
    }
]