[
    {
        "author": "mearix",
        "category": "general",
        "parent": "",
        "content": "Rocket launches use a “No Earlier Than” date. They have to deal with unknown unknowns and known unknowns (weather) all the time. Those dates frequently get pushed back/delayed, but having that minimum time frame is valuable.",
        "created_at": "2022-06-13T01:39:41.492000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "I don't think min time frame is valuable as people think its the real date and \"oh it got delayed again\"",
        "created_at": "2022-06-13T05:58:06.074000+00:00",
        "attachments": null
    },
    {
        "author": "mearix",
        "category": "general",
        "parent": "",
        "content": "But for people actually doing the work, having some sort of min time frame is useful. As a node operator that’s how I see it anyway.",
        "created_at": "2022-06-13T14:39:02.983000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003c@552133098075193354\u003e Did I black out for the latter half of the meeting?  I thought there were other agenda items we were going to talk about?",
        "created_at": "2022-06-13T14:45:40.673000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The meeting end caught me off guard.",
        "created_at": "2022-06-13T14:45:49.314000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "For context, earlier today we had a regularly scheduled testing call between client \u0026 testing teams where the difficulty bomb pushback ended up being the main/only topic we covered. \n\nGiven the rushed conversation about it on Friday's AllCoreDevs + confusion here over the weekend,  I wanted to make sure all EL client teams were on the same page. \n\nThe first bit was about how much of a block time increase is acceptable, and whether we should aim for the delay to start kicking in when we expect to be ready to merge, or for blocks to not be exceeding X time. After some back and forth, we've converged on the former: trying to Merge before block times noticeably slow down. \n\nThe second bit was then about whether the 500,000 blocks proposed in EIP-5133 was the right amount. More context here: the script used in the EIP (and the Arrow Glacier bomb pushback, and previous ones too) underestimates when the bomb starts showing up. The best way to predict the (starting) impact is simply to look at the number of blocks being added, and use that as an offset. If we delay it by 500,000 blocks, then we'll be in the same spot 500,00 blocks from now. \n\nGiven these two things, we tried to find a number for the delay which leads the bomb to start showing at a time when we think we can run The Merge on mainnet. The rough consensus there was that mid-September felt right. Earlier is possible, but hinges on basically not hitting any hiccups. We therefore agreed to make the delay 700,000 blocks. This means that late September, we'd be at roughly the same block time as now (~14.5s) and so 2 weeks before, in mid-Sept, the effects will start being noticeable (\u003e13.5s blocks, similar to early June block times).",
        "created_at": "2022-06-13T16:31:13.760000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e what's the problem with just delaying again in that case?",
        "created_at": "2022-06-13T16:32:42.032000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Delaying it when?",
        "created_at": "2022-06-13T16:33:28.881000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e if we hit hiccups",
        "created_at": "2022-06-13T16:33:47.299000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "From an infrastructure standpoint we do have to take things offline for a bit for updates so we obviously prefer as few as possible.",
        "created_at": "2022-06-13T16:34:40.896000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "general",
        "parent": "",
        "content": "Appreciate the update, Tim! I think 700k is generally reasonable, even if I would prefer 500k.\nPurely from a process pov I would point out though that this does constitute a change to an EIP scheduled for inclusion into a hard fork, so I strongly believe that we should wait a few more days for feedback before making a final call on acceptance \u0026 moving forward with client releases. This is already a rushed governance process as-is, and I think it is important follow some sort of process here.",
        "created_at": "2022-06-13T16:37:12.579000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Agreed that this is bad from a process perspective. The reason to rush this is obviously that block times will keep increasing before the fork, so minimizing that is better for users. Given the rough target of June 29th for the fork, we should have client releases + an announcement Friday at the latest (ideally Thursday...!).  This means client releases should ideally be out on Wednesday/Thursday, which implies a final offset and block number chosen today/tomorrow. \n\nWhile we may not be able to get \"a few more days\", perhaps we can have a tighter schedule for this week to make the process clearer?",
        "created_at": "2022-06-13T16:52:49.572000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "My suggestion would be: \n\nBefore 15 UTC wednesday: Last Call for 5133 + block numbers suggested for Gray Glacier, people should sanity check the numbers \nThursday: client releases\nFriday: announcement around 14 UTC",
        "created_at": "2022-06-13T16:59:33.543000+00:00",
        "attachments": null
    },
    {
        "author": "dirigible6945",
        "category": "general",
        "parent": "",
        "content": "I think 700k is extremely reasonable. If you can merge earlier under slower block times -- good, but merging in Sept when block times will be ~16-18s due to a mid august target of 500k blocks seems counterproductive with expected hashrate drops.",
        "created_at": "2022-06-13T17:02:19.005000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "general",
        "parent": "",
        "content": "That sounds reasonable.",
        "created_at": "2022-06-13T17:03:05.669000+00:00",
        "attachments": null
    },
    {
        "author": "dirigible6945",
        "category": "general",
        "parent": "",
        "content": "Is there a central location where we can direct comments about the EIP other than in \u003c#745077610685661265\u003e? Or is this the best spot for eyeballs given the time constraints",
        "created_at": "2022-06-13T17:03:29.364000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I think it would be better to use https://ethresear.ch/t/delaying-difficulty-bomb-to-mid-august-2022/12762",
        "created_at": "2022-06-13T17:04:06.062000+00:00",
        "attachments": null
    },
    {
        "author": "adorable_axolotl_54784",
        "category": "general",
        "parent": "",
        "content": "Great recap and very sensible outcome IMO",
        "created_at": "2022-06-13T18:06:40.731000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "For the fork block number, I'd tentatively propose `15,050,000`. My calculations are here: https://docs.google.com/spreadsheets/d/1fTSbD712YEU0MQKOuF-bgBH9LuO1X8G9vf-znwEVjVs/edit?usp=sharing\n\nFeedback welcome (can create a thread in this channel to not clog the main feed).",
        "created_at": "2022-06-13T18:20:34.803000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "https://github.com/ethereum/execution-specs/pull/537",
        "created_at": "2022-06-13T18:34:40.420000+00:00",
        "attachments": null
    },
    {
        "author": "ericmartihaynes",
        "category": "general",
        "parent": "",
        "content": "We updated the EIP including the prediction script: https://github.com/ethereum/EIPs/blob/master/EIPS/eip-5133.md",
        "created_at": "2022-06-13T20:59:25.199000+00:00",
        "attachments": null
    }
]