[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "EOF breakout in ~45 minutes, all the info is here: https://github.com/ethereum/pm/issues/653",
        "created_at": "2022-11-04T13:15:29.241000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003c@425274498732916736\u003e let's use \u003c#706868829900505180\u003e to continue the conversation about EOF next week 🙂 Rough notes from today: https://notes.ethereum.org/@timbeiko/eof-breakout",
        "created_at": "2022-11-04T15:22:02.050000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "One thing that came up in the EOF call, similar to the discussions we've been having on the CL side about Capella \u0026 4844 activation, is how to best 'bundle' EIPs into various testnets, considering we have some that are already included and some that are being prototyped (most notably the EOF set \u0026 4844). I've written down what I see as the two options. We were running out of the time on the call, so agreed to move this to ACD. It would be great to get some feedback on this before from client teams (and potentially even make the call async 🙂 ) https://notes.ethereum.org/@timbeiko/shanghai-prototype-devnets",
        "created_at": "2022-11-04T16:16:59.225000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "if im understanding correctly, the \"bundle everything together\" plan will involve a lot of (potential) \"glue code\" that will just be thrown away -- this is where client devs should chime in but i imagine the closest we can stick to the actual sequence on mainnet the better\n\nthis may feel lower velocity in the short term but i'd argue keeping closer to mainnet means lower coordination costs for _everyone_ so will be higher velocity in the long run",
        "created_at": "2022-11-04T17:22:08.679000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "My read of this order is that it is saying EOF should not stop a withdrawals fork.  And that if EOF will reach success it will do so before protodanksharding.  So this ordering allows EOF to be added to Shanghai or Cancun with a minimum of fuss.",
        "created_at": "2022-11-04T18:45:26.155000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "presuming danksharding is not part of shanghai and is the fork driver of cancun.",
        "created_at": "2022-11-04T18:46:00.972000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "An alternate scenario is all three make up shanghai.",
        "created_at": "2022-11-04T18:46:37.389000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Right, the way I see it now is we have some confirmed Shanghai things and two \"pending\" ones that should be \"parallel\" to one another: EOF and 4844",
        "created_at": "2022-11-04T18:47:07.849000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "```\n                       -\u003e EOF\nmerge -\u003e shanghai-core \n                       -\u003e 4844\n```",
        "created_at": "2022-11-04T18:47:52.438000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "kinda like this ⤴️",
        "created_at": "2022-11-04T18:47:54.520000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "So we'd ideally want the ability to eventually merge either/none/both of EOF and 4844 back into Shanghai-Core. I would really try and avoid 4844 or EOF having a dependency on \"top\" of one another either way.",
        "created_at": "2022-11-04T18:48:41.029000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "From a task sizing and testing perspective I don't see 4844 forking in 2023H1, where I see that being a reasonable deposits timeframe.  Happy to be wrong on 4844 timing however.",
        "created_at": "2022-11-04T18:51:00.789000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "There definitely are some client devs who think 4844 in H1 is possible, as per the latest implementers + ACD calls. Rough consensus on last ACD was to try and get the spec finalized in the next month, and re-evaluate there if we want to consider bundling it. So I think it's valuable to keep the door open, but if it looks like it's not going to make it as part of Shanghai, we don't want to slow everything else down because we need to remove 4844 from the bundle. Same thing with EOF 🙂",
        "created_at": "2022-11-04T18:54:34.883000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "+1 on danno here, i'd love to be wrong but all of the 4844 estimates i have heard i think are underestimating how much effort it will be to test + vet a change this big across all the client combos\n\nthe EOF work seems scoped enough that it seems reasonable to generally target `shanghai-core` then `eof` then `4844` assuming that the first two things will be ready in H12023, and if 4844 happens to be ready by then we should definitely ship it\n\nin an ideal world we should keep the optionality to mix in either the EOF or 4844 feature set in either order but it sounds like that is simply not the case for a number of EL and CL clients (they need *some* sequence)",
        "created_at": "2022-11-04T20:19:16.678000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "and so if we must give *some* sequence, i'd suggest what i just said to do `eof` ahead of `4844`, otherwise i see a potential risk of never getting to the `eof` stuff",
        "created_at": "2022-11-04T20:20:42.074000+00:00",
        "attachments": null
    }
]