[
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "So this is what I think needs to happen to bring the EVM up to modern standards.  That is, up to the standards of _25 years_ or in some cases _76 years_ ago.\n\nI think EIPs 3540, 3670, and 3860 belong in Shanghai. They set the stage for future work, are ready to go, and solve some immediate problems.\n\n3860 mitigates a known DoS vulnerability, 3670 begins to insist that only valid code can be deployed, and 3540 provides the versioning and structure we need. 3540 mitigates the problem of changing the semantics of DIFFICULTY -- programs can tell which version of the EVM is running, so they know which semantics to expect.\n\nThen, in a fork as soon after Shanghai as practical, and limited to EVM changes, we bring the EVM up to modern standards with EIPs 2315, 4200, 3779, and 4573 -- or their close cousins that emerge from current work and review.\n\nEVM-2315 and EIP-4200 provide the static branching and subroutine  operations invented by Turing in 1946 and carried through many, if not most VMs ever since. \n\nEIP-3779 builds on EIP-3670 to ensure -- like Java and Wasm -- that only code with valid control flow is ever placed on the blockchain.  By valid control flow I mean that no contract will terminate with an exception unless it runs out of gas or overflows stack during a recursive function call.\n\nAnd either EIP-4573 or the \"function section\" EIP in progress can provide for validation that calls adhere to specified interfaces.\n\nThis may seem like a lot, but it's not.  It amounts to a refined version of EIP-615, broken into individually useful facilities.  And none of it is at all controversial over the 76-year history of VM implementations.   Much of it, or code very much like it, has been implemented and tested in at least one, if not all Ethereum clients.\n\nThe community has been anticipating an improved EVM for years now.  We need to deliver sooner rather than later.",
        "created_at": "2022-01-22T13:56:15.091000+00:00",
        "attachments": null
    }
]