[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I have been thinking about the accidental veiled threat I made in the consensus call the other day regarding using the EIP process for more stuff:\n\nThe core issue here is that we really need more active EIP editors that spend meaningful amounts of time on the job.  I generally agree with most of the core devs that it would be great to have a place to put standards that don't fit the traditional EIP mold (e.g., consensus layer standards, cross-layer meta-standards, informational, etc.) but at the moment we just don't have the staff to actually handle that load.  If we continue to dump work onto the EIP editors because they are \"keeping up with things\", then the situation will rapidly change to \"they aren't keeping up with things\" and then we won't even have a functional execution layer spec process.\n\nWe have seen this in the past, where for a time EIPs would sit for over a year awaiting editor review.  The reason I push back anytime anyone tries to dump more work on the EIP editors is because we cannot even handle the work we currently have in a timely fashion (I get personal email/Discord/GitHub pings from people from people regularly asking when someone will get around to reviewing their EIP).  While from the outside it may look like a great place to dump spec work, it is very much on the brink of being non-functional and additional work is very likely to push it over the edge.\n\nI think the EIP process can be a good fit for these new things, but we really need to address the current strain on editors before we do so.  This could come in the form of someone (EF?) actually hiring a full time editor (or even part time), or figuring out how we can recruit more volunteer editors with lots of free time, or do some contracting to greatly improve our automation so editors have to do less work, or removing things from the EIP process (e.g., ERCs) to free up existing bandwidth.",
        "created_at": "2022-03-12T06:37:32.030000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "cc \u003c@!552133098075193354\u003e \u003c@!291925846556540928\u003e since you two were involved in the consensus call conversation.",
        "created_at": "2022-03-12T06:37:35.641000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "What do you think about moving non-core eips out of the repository (such as all the ERC crap) to free up time and focus for the editors? From an outsiders perspective it looks like there are a bunch of editors that can easily review those types of EIPs and little that can do the core EIPs. If we were to split them the editors can focus on the set of EIPs that they can review best.",
        "created_at": "2022-03-12T07:03:11.663000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We have talked about this in the past and it is something I'm a big fan of.  One problem is that there is risk that all of the editors would be Core EIP editors only and the ERCs would receive no love.  Another open question is whether it is worth doing a big change like that prior to getting the executable spec for the execution layer complete.  Once the executable spec is complete, maybe the EIPs repository just becomes ERCs only as all of the rest would be part of some system used to update executable specs.",
        "created_at": "2022-03-12T07:19:05.506000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "One thing that might help (and that would be difficult for you to do, Micah) is to cut people more slack (form, not substance) so far as getting an initial Draft into the system.  It's only the beginning of the process, and I think we can wait to impose higher standards as the proposal proceeds, if it does.  That also means that non-editors with an interest in a particular EIP can lend a hand working with author.",
        "created_at": "2022-03-12T13:56:04.993000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\"... maybe the EIPs repository just becomes ERCs only as all of the rest would be part of some system used to update executable spec ...\"  It took years getting the current system in place, such as it is.  Good luck.  Also, I think most people would have a hard time writing or reading proposals in \"executable spec\" form.  I certainly do.",
        "created_at": "2022-03-12T13:59:02.677000+00:00",
        "attachments": null
    }
]