[
    {
        "author": "gwintery",
        "category": "general",
        "parent": "",
        "content": "What is there left to test though? Is there a known issue that have not been tested? I think the most rational route is to get a confirmation from client devs on whether it is a realistic timeline or not.",
        "created_at": "2022-01-09T02:31:20.853000+00:00",
        "attachments": null
    },
    {
        "author": "syentist.",
        "category": "general",
        "parent": "",
        "content": "We should also be wary of roadmap sabotage masquerading as \"readiness concerns\". Testing has been on-going since early Nov with Kintsugi (and Amphora before that). The original plan was to have a spec freeze in early Jan so now a freeze in Feb and clients in March for a stripped out version of the merge without any other features/eips included can alr be argued to be extremely conservative \n\n(All comments after Alexeys at 731pm, including mine, are off topic and could probably be deleted or moved to another channel)",
        "created_at": "2022-01-09T02:46:52.023000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Testing for known issues is easy... The unknown issues take time, people are still today finding issues to fork choice in phase0.",
        "created_at": "2022-01-09T02:48:07.957000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I truly think this is not off topic as these are the decisions that typically all core devs make. Just that it becomes more involved at the merge. I think I'm involved enough with one particular consensus client to know that they'll be most likely ready in their implementation of Bellatrix specs by March. I also think the specs have been very well thought and vetted by now, with later changes only cosmetic or UX based. However, there's a huge leap from that to actually  shipping a product that has been thoroughly tested. As far as I know most of the fuzzing or spamming Kintsugi has been carried by one person alone. I highly doubt there are many application devs running a Kintsugi node to see how that affects their contract (I agree it shouldn't, but still).  There is one consensus client in the works and at least one execution client that wasn't Kintsugi ready a week ago.   I don't think my \"readiness concern\" has anything to do with sabotage. I was skeptical as well with phase 0 launch and I think I was right and that we just got lucky that clients were actually ready and didn't have big bugs",
        "created_at": "2022-01-09T03:04:24.482000+00:00",
        "attachments": null
    },
    {
        "author": "gwintery",
        "category": "general",
        "parent": "",
        "content": "Unknown unknowns is always going to be a problem, and more time does not necessarily mean it will be found and we can have diminishing returns.\n\nI am not saying that I think we should not delay the timeline, I am simply saying that provided enough testing is done and all client teams are confident in their release timeline, we should go forward with it.\n\nHow much 'enough' testing is probably going to be the question that everyone is going to have different expectations though. Personally I thought the 'merge mainnet readiness checklist' was made to align expectations on this.",
        "created_at": "2022-01-09T03:18:57.871000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003e TBD - the merge isn’t even scheduled yet + it’s still unclear what the scope of Shanghai will be\nSo it seems that in scoping out Shanghai we are pretty much looking at our roadmap for the next year or so.",
        "created_at": "2022-01-09T05:48:47.085000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Yes, the readiness checklist is supposed to be the main thing we align on. It might be due for an update, though! Of course, if someone thinks we are missing something important on it, please do open a PR!",
        "created_at": "2022-01-09T06:12:48.834000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Well, with the merge basically taking the bulk of the first half of the year, it’s unlikely we do more than Shanghai in the second half, at least on the execution layer. Consensus layer folks might have more in store!",
        "created_at": "2022-01-09T06:12:49.239000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Exactly.  Some of the EVM work can be done pretty independently of the merge work.",
        "created_at": "2022-01-09T06:15:15.174000+00:00",
        "attachments": null
    },
    {
        "author": "schone_wizard",
        "category": "general",
        "parent": "",
        "content": "I was gonna say earlier but you already did. None of this was any different with phase 0. The leap from oh were plying on test nets to launch is Dec 1st was pretty abrupt and deterministic.",
        "created_at": "2022-01-09T15:10:32.276000+00:00",
        "attachments": null
    },
    {
        "author": "schone_wizard",
        "category": "general",
        "parent": "",
        "content": "Question is did we dodge a bullet and get lucky. Or was any extra postponing in the name of testing becoming redundant. I don’t know what the right answer is",
        "created_at": "2022-01-09T15:11:10.645000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I think withrawals (and possibly/hopefully proof of execution) should be reachable shortly after the merge. I think the latter requires much more testing",
        "created_at": "2022-01-09T15:24:52.502000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "We didn't have a single public testnet without major issues before mainnet launch. Spadina didn't reach consensus on eth1 data and that testnet was supposed to be \"we get one flawless launch and we deploy mainnet contract\". Client devs were mostly confident that there weren't any bugs and were pretty sure about their product.",
        "created_at": "2022-01-09T15:28:43.927000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Coordination to diffuse the bomb takes time, even if everything seems on track, we should be absolutely certain by April that we are merging in June otherwise we need to start planning to diffuse the bomb. Knowing with certainty three months from know that we will be merging is unrealistic therefore we should anyway keep another postponement in mind",
        "created_at": "2022-01-09T15:38:49.351000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "Shipping is a combination of doing all the things, balancing timelines and expectations, and trusting development teams to know when its ready\n\nI think we have some reasonable information still to gather in the coming couple of months\n\nMerge testing efforts I'm aware of\n* independent client testing \n* el and cl consensus tests\n* mergemock ( not sure if deprecated with rise of hive)\n* hive (cl mocked)\n* hive (el-cl integration)\n* network chaos messages (marius)\n* #testthemerge community testing\n* staking institutions (im aware of a few) testing on kintsugi\n* standard el fuzzing\n* beaconfuzz (cl)\n* auto-generated fuzzing of functions (cl) (new/experimental)\n* kurtosis simulations \n* goerli shadow forking (to be done on a continuous basis for transition tests)\n* antithesis deterministic hypervisor fuzzing framework (pretty experimental)\n* cryptomanufakture large network stress and scenario tests (early)\n* working with a few dapps deploying on kintsugi as a case study\n* ef red teaming cl implementations",
        "created_at": "2022-01-09T15:46:45.550000+00:00",
        "attachments": null
    }
]