[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "AllCoreDevs in ~45 minutes! Agenda and stream above, here’s the zoom: https://ethereumfoundation.zoom.us/j/91348592283?pwd=SnRnL1VTeXNYVE9CaWpBbnJEUXhQZz09",
        "created_at": "2022-11-10T13:13:03.905000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "general",
        "parent": "",
        "content": "It's bad form to make CFI decisions at the very end of a call, especially when arguing for zero-sum decisions between EIPs. Can we improve the process here for next ACD calls?",
        "created_at": "2022-11-10T15:39:13.086000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "To speak to Martin's questions on EOF stack validation -- code that passes validation cannot underflow stack, call functions with wrong number of arguments or return the wrong number of results, jump to bad destinations, or execute invalid instructions.  So yes, you can save all of these checks at runtime.  More important, other transformations that a client wants to run at initialization time -- including compiling to machine code -- require that code be valid in these ways to ensure linear performance.  Java and Wasm enforce similar constraints for the same reason -- to make it possible to compile bytecode in one pass.",
        "created_at": "2022-11-10T15:47:09.273000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "As for https://eips.ethereum.org/EIPS/eip-5450 itself:  It's in Draft, and needs a little work to be ready for Review -- mainly getting the English description of the constraints more clear.  The Reference Algorithm given uses space and time *linear* in the size of the code.  It needs an array of stack heights, one for each byte of code, and a stack of continuations, one for each true branch of code, starting with the first byte.  Its outer loop processes each continuation only once, and its inner loop validates each instruction in a continuation only once.",
        "created_at": "2022-11-10T16:12:33.966000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "You're right, I agree. To be clear, though, the only thing that _did_ move to CFI during the call was 1153, which we discussed extensively. The reason for the last minute CFI discussion re: EOF \u0026 4844 is that we spent a lot of time discussing them earlier in the call, but didn't explicitly get to that question. Assuming there were no objection, I think it would have made sense to move them to CFI then if everyone was on the same page. Clearly, people weren't, so it didn't happen. \n\nAt a higher level, one thing that's hard with CFI, and Core EIP statuses generally, is that the decision is at the EIP level while the \"thing we do\" is a full fork. This leads to the situation we're in now, with a lot of CFI'd (and potentially CFI'd) stuff that when looking at as a whole, feels really big for a single upgrade. \n\nI think we should focus the next call on triaging between those things, and determining what it makes sense to have teams focus on first/as a bundle. If everyone is working on 9 different things, it will be really hard to get momentum on them. As I mentioned at the end, it would be great for client teams to take time to think about what they see as the highest priority stuff that should be bundled together. I'm happy to also chat individually with client teams before the next call to try and compile opinions (and share them publicly), so we can hopefully start the next call with a better shared context.",
        "created_at": "2022-11-10T16:29:31.402000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "did anyone take notes on ACD today?",
        "created_at": "2022-11-10T18:18:38.852000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003ctimbeiko\u003e There will be a full transcript as always, but there aren’t (ever?) “high level notes” AFAIK.",
        "created_at": "2022-11-10T18:28:57.339000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "Have you not seen Tim Beiko's call notes?",
        "created_at": "2022-11-10T18:29:30.999000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "no, exactly what i was looking for",
        "created_at": "2022-11-10T18:31:42.732000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "i was thinking of the twitter threads i've seen in the past, guess i'll check there",
        "created_at": "2022-11-10T18:32:39.341000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Sorry, can’t tweet today 😅 Christine Kim often has great recaps, but they usually come out the day after",
        "created_at": "2022-11-10T18:33:45.988000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "nbd, will watch her feed thx",
        "created_at": "2022-11-10T18:35:48.973000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Did you forget to move your calendar events with government mandated clock changes?  😬",
        "created_at": "2022-11-10T19:05:54.972000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Yes.  If legislatures had said, \"We are going to make everybody get up an hour earlier in the summer!\" the bills never would have passed.  Instead they promised to \"Save daylight!\"  Who could object to that?",
        "created_at": "2022-11-10T19:50:31.390000+00:00",
        "attachments": null
    }
]