[
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "I think this is new. Clever!",
        "created_at": "2022-11-26T07:49:14.176000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "What about deleting all warm storage in the account.\nIncluding access list\nThe problem with not deleting anything is that reinit may assume some state starts at zero. This would allow salvaging all current reinit patterns at no unbounded performance cost",
        "created_at": "2022-11-26T09:08:02.788000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "Alternatively, change sload/sstore so that incarnation nonce is added to the key (hashed with) for contracts that were once destructed. This means all reinits see everything at zero while no explicit deletion ever happens during selfdestruct\n(I think this pattern is 100% backwards compatible on the evm side?)",
        "created_at": "2022-11-26T09:17:57.596000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "You mean for revivals done in the same transaction? May make sense. Can you describe such patterns/problems more in depth, potentially on the magicians forum?",
        "created_at": "2022-11-26T12:31:28.106000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "That seems to be a complete workaround, but I feel like that may be pushing it too much as it introduces an extra layer of hashing on the client for such accounts (and so these accounts should be more expensive to use) and removes the ability for revived code to remove old storage items. I'd prefer not to do this, unless there's a very strong reason for it.",
        "created_at": "2022-11-26T12:32:22.066000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "Reinit without zeroing breaks eg. anything that uses a reentry guard that's assumed to start at zero, or any balance map (sload+add+sstore), etc. So it's very likely some patterns may break in weird ways.\n\nIf anything with significant funds actually breaks it's going to require a special-case rescue eip which is a horrible perspective I think.\n\n\u003eadditional hashing expensive\nWell, sload/sstore is already expensive and sha2 is relatively cheap, so I don't see why it should impact the gas cost. If it was on something light like add it would be noticeable, yes.\n\n\u003eprevents code from deleting old storage\nYes, but not the node. That storage is now permanently inaccessible on the evm side, so it could be cleaned completely separately.\n\nNote it's still a gain compared to the original proposal that would just leave that storage forever while bricking some contracts.",
        "created_at": "2022-11-26T22:16:25.212000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "\u003e So it's very likely some patterns may break in weird ways.\n\nYes it pushes some responsibility/work on the contract authors to work this around, but at least they should be able to compared to the previous proposal.\n\n\u003e Well, sload/sstore is already expensive and sha2 is relatively cheap\n\nIt is keccak256 not sha2, but this introduces a two-tier system: some accounts are cheaper than others. Maybe it is insignificant, but that would need to be verified via analysis/benchmarks.",
        "created_at": "2022-11-26T22:24:19.875000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "Can you leave some of these comments on the forum post? I think this is important insight, especially if you could point us to some example contracts/transactions.",
        "created_at": "2022-11-26T22:30:31.019000+00:00",
        "attachments": null
    }
]