[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I'm not sure were to post this so I'll try here. I want to get a feeling as to whats the weight of \"not breaking any contract\" when reviewing EIPs. My impression is that there's a strong bias in the community that we should not break any contract unless there's a security issue or a very strong case for it. Then I'm faced with 3074 and it's not clear what's the path forward. I figured the best I can do now in my free time is give an unbiased view on these EIPs.",
        "created_at": "2022-09-17T01:46:13.430000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Historically there has been *incredibly* strong bias against breaking existing contracts.  See 2930.",
        "created_at": "2022-09-17T01:47:04.980000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "(which exists solely to avoid breaking contracts)",
        "created_at": "2022-09-17T01:47:19.435000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "That being said, arguably the switch from DIFFICULTY to RANDAOMIX was breaking (though the expectation was that it wouldn't actually break anyone).",
        "created_at": "2022-09-17T01:48:13.178000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Sorry, 2930 (edited)",
        "created_at": "2022-09-17T01:50:08.328000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Ah crap... Looking like crazy 🤣 thanks",
        "created_at": "2022-09-17T01:50:36.355000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If you are referring to 3074 breaking `tx.origin`, an argument can be made that the way people use it is already broken, so things won't get worse.",
        "created_at": "2022-09-17T01:52:20.088000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Thanks reading about access lists. I do think I read this one before though. I don't have anything against 3074, in fact everything I read points to it being included in Shanghai. Just want to put myself in the shoes of people claiming their nft contract will be broken and assess it independently",
        "created_at": "2022-09-17T01:57:40.635000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "Do the \"people claiming their nft contract will be broken\" mean that their contracts won't be compatible w/ 3074, or that 3074 will introduce a means for someone to exploit or otherwise grief their contract?  If it's the later I definitely sympathize, blockchains are billed as immutable so I would be upset if an invariant that held when I deployed my contract was changed during a later fork.  Not sure what the solution is but some sort of means for contracts to opt-in to new functionality seems useful.  Maybe EOF v2 can have some sort of section where a contract describes what sort of invariants it relies on, and future behavior changes have to respect that metadata?",
        "created_at": "2022-09-17T02:21:01.611000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "A lot of people have contracts that are already vulnerable, but allowing EOAs to execute code makes it more obvious.",
        "created_at": "2022-09-17T02:43:48.583000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "`require(tx.origin === msg.sender)` in particular is almost always a sign your contract is already broken, but in a way most people think it is protected.",
        "created_at": "2022-09-17T02:45:00.204000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Some people use this as a really bad mechanism for reentrancy protection, which any auditor worth their salt will warn against.",
        "created_at": "2022-09-17T02:45:43.098000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e Are any client teams already working on 4844? We are currently preparing a library that contains all the cryptographic functions on top of blst and would like to talk to any potential consumers about their needs",
        "created_at": "2022-09-17T22:27:15.200000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Prysm is, \u003c@363800010518822915\u003e has a branch, but as far as I know he hasn't looked into optimizing KZG proofs yet, I was supposed to do so and didn't either yet",
        "created_at": "2022-09-17T23:56:30.330000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "As posted in the sharded data channel, cgo has a huge overhead and I've been pondering about porting blst to goassembly, but if they implement all hot loops in assembly and we have to call only high level functions then that's probably overkill",
        "created_at": "2022-09-17T23:58:44.654000+00:00",
        "attachments": null
    }
]