[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I have been thinking about the concern I brought up in ACD this week and I think I can further refine it to:\n\u003e If we decide to pick the TTD prior to Belatrix landing, we are crossing a bright line for the first time where we are trading robustness for an improvement in deployment UX and time to launch.",
        "created_at": "2022-07-10T07:33:54.095000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "While I can definitely appreciate how tiny the robustness trade here is, and relatively speaking the deployment UX benefit is far more significant, it is the crossing of a schelling fence without first setting up a new schelling fence that worries me greatly.  If we had some even brighter (or at least equally bright) line somewhere further down the hill that we were confident we could avoid crossing I *might* be able to get on board.  Without a schelling fence setup in advance though, it feels like we are just making the claim that we (and all future Ethereum core developers) can be trusted to never slip down the slope of making robustness for UX trades (which in the moment almost always feel like good trades, until a black swan shows up and it isn't).",
        "created_at": "2022-07-10T07:37:38.874000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "It's weird to me that bellatrix is defined in a way hat needs a TTD anyway. From my understanding Bellatrix changes some consensus critical components and makes the node listen for td right? Why can it not just listen for td without us having to specify a ttd -\u003e thus the IsTTDReached condition would always be wrong until we specify the TTD. This is kinda what we do on the EL. Even if some people call it \"Paris\" there is no hardfork on EL before TTD. We just provide all the necessary endpoints even without a TTD specified. \n\nRegardless I agree with Micah that we should follow the same paradigm as on the testnets. There is a potential attack if TTD happens before Bellatrix and so we need to make sure that this is impossible",
        "created_at": "2022-07-10T08:54:37.367000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We don't have to set TTD with Bellatrix IIUC.  It is just that people want to have a single client release for Bellatrix that *also* includes the TTD baked in so people don't have to TTD override or download another client after Bellatrix.",
        "created_at": "2022-07-10T10:54:57.347000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "(I may be wrong on that, and if so somenone please correct me)",
        "created_at": "2022-07-10T10:55:23.705000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "This is correct, we could disable all configuration mismatched warnings and fork to Bellatrix without any trouble. But as you say this would require users downloading another release after the fork or using the override. At some point it becomes a discussion about semantics, but it's possible to argue that not including the TTD baked in, in a single release, also opens the door for different attacks if there's a large set of users that do not update. I'd say that bad UX is part of network security and if we can't trust client devs to remember to update their configs, we certainly can't trust users. I sense conflicting directions in insisting on having a 32 byte hex string as mandatory jwt secret to connect to the engine, so that we are parenting our users instead of letting them choose their level of security, and on the other hand suggest that it's fine to rely on them updating twice or using a CLI override. I don't have strong opinions on the matter of the override, but would be better to be consistent in the level of trust we put on the users",
        "created_at": "2022-07-10T12:16:25.287000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003e it's possible to argue that not including the TTD baked in, in a single release, also opens the door for different attacks if there's a large set of users that do not update.\nCould you steel man this argument for me?  I don't see it.",
        "created_at": "2022-07-10T12:55:28.337000+00:00",
        "attachments": null
    }
]