[
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "Hi all, I was rather sure about the decisions regarding Shandong yesterday but I am not anymore. Do we want 1153 on Shandong?",
        "created_at": "2022-11-11T08:13:36.006000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "I am new to this ACD call process, but I think what we should at least do is to create a \"decision sheet\" of whatever is decided at the ACD ASAP, so we can all agree after the ACD whatever was discussed and focus on that (for instance, at this point, I do not exactly know how some of the EIP states changed - did they get CFId or not? - I should have taken better notes myself anyways, but it should still be at a central (... hah 😅 ) point such that we can all agree on these notes/decisions)",
        "created_at": "2022-11-11T12:47:56.883000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "There was no decision if 1153 should go into shandong.  Perhaps we need a #shandong channel in the R\u0026D discord and make the decision there?",
        "created_at": "2022-11-11T16:25:54.039000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Figuring out testnets plans was on the agenda, but we didn't have time to discuss on the call, unfortunately. I'd use \u003c#892088344438255616\u003e  (or this channel?) if we want to discuss it async in the meantime.",
        "created_at": "2022-11-11T21:52:55.622000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "yeah, that's fair - we used to do this in the past and have them as part of the transcripts. It felt a bit bureaucratic at times to do, and we eventually drop it, but we could fairly easily bring it back. \n\nFor the last call, I believe the only \"explicit\" decision we made was to move 1153 to CFI. I usually try and post PRs up for these things right after and share them here, but I was travelling yesterday and \u003c@383836935480803339\u003e offered to open it but wasn't sure how to proceed, so was blocked on me.",
        "created_at": "2022-11-11T21:54:56.661000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Another thing where we can perhaps improve is that because we do full transcripts for ACD, they usually take a few days to be uploaded/merged in the `/pm` repo. This means it might be easiest to separate a lightweight \"decision summary\" from a full transcript.",
        "created_at": "2022-11-11T21:56:59.123000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "V1 of this might just be posting a list of decisions in the discord here after the call? And then we can record them more permanently in the transcript?",
        "created_at": "2022-11-11T21:58:12.055000+00:00",
        "attachments": null
    }
]