[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "15 mins to ACDE! Zoom: https://ethereumfoundation.zoom.us/j/91348592283?pwd=SnRnL1VTeXNYVE9CaWpBbnJEUXhQZz09",
        "created_at": "2023-10-12T13:46:19.715000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "Here are my slides from ACD - https://docs.google.com/presentation/d/10mxZK5hzLeaTLGAVo83qrPybk0Y8fUN5prAffGhKV6o/edit?usp=sharing.  The \u003c#706868829900505180\u003e channel is the best channel to discuss EOF and give feedback.",
        "created_at": "2023-10-12T17:06:28.447000+00:00",
        "attachments": null
    },
    {
        "author": "smartprogrammer",
        "category": "general",
        "parent": "",
        "content": "EOF Status Update",
        "created_at": "2023-10-12T17:36:45.266000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE recap**\n- devnet 9 testing going strong: bad blocks are being sent, MEV pipeline testing is in progress, and some clients are debugging issues found on the network. Trying to confirm if builder blocks can include blob txns. \n- devnet 10 launch planned for next week ideally. Things we want to see before that: final KZG setup in CL specs and clients, general stability on the network, confirm the mev-pipeline works, and getting better tooling around blobs (WIP). Dencun will activate shortly after genesis to allow us to flood the deposit queue and trigger the churn limit. If things go well, we'll start looking at scheduling Goerli! \n- One concern raised by the Geth team is bandwidth requirements to gossip blob txns on the EL (cc: \u003c@206016661470314496\u003e). We went into it a bit on the call, but will discuss further on Monday's testing call (https://github.com/ethereum/pm/issues/881). EL teams should think about that issue and come prepared on Monday to discuss it 🙂 \u003c@360491619402776577\u003e provided context on the call!\n- Then, we spent the rest of the call discussing the EOF update shared above, including how it may affect L2s, and whether it should be prioritized over Verkle for Prague. No decisions, but this is something we'll need to start thinking about more in the next month or so as the Cancun work wraps up!",
        "created_at": "2023-10-12T17:57:15.812000+00:00",
        "attachments": null
    },
    {
        "author": "joeysantoro",
        "category": "general",
        "parent": "",
        "content": "[edit] Convo on EIP-7528 in \u003c#856943705209569291\u003e https://discord.com/channels/595666850260713488/856943705209569291/1162100849254866965",
        "created_at": "2023-10-12T18:44:24.416000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "While I get how reserving an address affects the protocol, this probably isn't the best place to get client teams to engage. I'd suggest moving this to \u003c#856943705209569291\u003e (or telling people there to use EthMag?), as it's something we want to \"reserve in the spec\" rather than enshrine in protocol. \n\nIf what you want is the latter, e.g. like EIP-3540 did for `0xEF` deployments, I'd suggest writing a separate EIP for it.",
        "created_at": "2023-10-12T18:50:12.478000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "So will the order by Goerli, Holesky, Sepolia, Mainnet?  Also any idea how much time we will have between each testnet?  IIRC we had two weeks between Sepolia and Goerli for Shanghai, are we expecting a similar window between testnets for Dencun?",
        "created_at": "2023-10-12T18:57:40.127000+00:00",
        "attachments": null
    },
    {
        "author": "joeysantoro",
        "category": "general",
        "parent": "",
        "content": "replied in \u003c#856943705209569291\u003e",
        "created_at": "2023-10-12T18:57:41.018000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Definitely Goerli first, not sure if we've decided whether Sepolia will come before Holesky? \n\nIt's hard to say what the exact delay will be between them, but assuming things go smoothly, I'd expect on the order of 2-3 weeks? Obviously if we find issues and need fix them, then longer 😅",
        "created_at": "2023-10-12T19:00:58.095000+00:00",
        "attachments": null
    }
]