[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Testing call now - pinging EL teams re: the blob gossip conversation. Zoom: https://ethereumfoundation.zoom.us/j/88332629239?pwd=YmNpVVpaVy93RXhOTS9DYmNtWGtLdz09",
        "created_at": "2023-10-16T15:32:36.348000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I want to start making noise more regularly about ePBS until I get a clear signal that core devs are not interested and I can't break the inertia and will give up, but for the time being I think we still have some hopes of getting a more general and focused discussion going, avoiding private channels and setting clear objectives as a group. I think the majority of core devs are not aware that in the last Mev Boost call (in an EF zoom domain) the main topic was relay funding and that the idea that was agreed upon is to have builders submit Merkle paths along with their bids, so that the relay can change them on the fly, so that the proposer would get the second bid instead of the first bid and the relay could in principle split (or take, or do whatever) the difference. The main reason to have these discussion is that relays are running out of funding. I do see that relays are today providing a public good and losing money in doing so. On the other hand I believe that protocol researchers and developers should be focusing on getting rid of the relay as a trusted player in the protocol, instead of perpetuating them by finding ways of funding them.",
        "created_at": "2023-10-16T15:39:32.115000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "what is the specific problem ePBS aims to solve?",
        "created_at": "2023-10-16T15:40:56.984000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "getting rid of the trusted intermediary between proposers and builders",
        "created_at": "2023-10-16T15:41:24.359000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "i _think_ the only way this is going to happen is if we have a validity proof of execution -- all other guaranteed payment scheme will require upfront capital (in case block is invalid) and that will cause builders to use intermediaries who lend the capital",
        "created_at": "2023-10-16T15:42:29.623000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "there might be other services which relays will provide in the future -- certainly efficient networking is one. but with a ePBS it may be trustless. but i don't think the topology will change",
        "created_at": "2023-10-16T15:43:56.821000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I think here the point is that if I have the capital right now and I want to build blocks trustlessly on Ethereum, I can't. I need to construct a network and get some credit so that proposers trust myself (becoming in fact a vertical relay) or I need to deal with relays. This is unacceptable. ePBS allows me to actually trustlessly provide blocks, and allows proposers to get my bids trustlessly without needing to 'know' me.",
        "created_at": "2023-10-16T15:45:44.093000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "there are so many centralizing forces for block building it does not seem useful to spend so much research and engineering effort when the common / majority path will continue using trusted intermediaries",
        "created_at": "2023-10-16T15:47:09.225000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "that's what I don't agree with, there's no reason to use a trusted intermediary, and as you say, this is already very much centralized today anyway. Beaver could open their own endpoint, and the people that are currently producing our blocks definitely not need to be borrowing capital to be staked",
        "created_at": "2023-10-16T15:48:33.696000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Any trusted intermediary that signs blocks for them is fine too",
        "created_at": "2023-10-16T15:49:08.176000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "the difference today is that a trusted intermediary is not the block signer, its just a trusted player",
        "created_at": "2023-10-16T15:49:30.202000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "\u003e there's no reason to use a trusted intermediary, and as you say\n\nwhat do you mean by this? I can see many reasons for using a trusted intermediary (ePBS or not)\n* networking (unless validity proof)\n* block cancellation\n* guaranteed payment loan\n* censorship checking (??)",
        "created_at": "2023-10-16T16:00:38.106000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "\u003e networking (unless validity proof)\nWhy is it better a relay than you directly opening the same port that the relay would open",
        "created_at": "2023-10-16T16:02:53.684000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "the only reason builders don't do this right now is that they aren't trusted by proposers",
        "created_at": "2023-10-16T16:03:06.814000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "block cancellation",
        "created_at": "2023-10-16T16:03:22.643000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Same thing, you can do exactly everything the relay does, with your own endpoint, becoming indeed a relay yourself, but in a trustless manner",
        "created_at": "2023-10-16T16:03:50.689000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "the only thing you cannot cancel is a publicly gossiped bid",
        "created_at": "2023-10-16T16:04:04.993000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "but that's the same for the relay",
        "created_at": "2023-10-16T16:04:10.314000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "I think there are two important questions to resolve before moving forward with an ePBS proposal: \n1. What can malicious mev actors do to the network today that will become impossible with ePBS (e.g. why is this the most imporant thing to do now)\n2. Why do we believe that relays will not exists post ePBS (my understanding from conversations with builders is they provide many services / want to provide more services and i don't think they will just disappear)\n\nobviously it is better to remove trusted intermediaries, but the reality is that we have a trustless fall back (local building) and it isn't a network liveness issue -- I think a bigger fire to put out is figuring out ILs and integrating them into the protocol",
        "created_at": "2023-10-16T16:10:52.676000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "FWIW, Vitalik's idea of submitting summaries for IL's is very simple to implement, it's included in our ePBS proposal and it's easily implementable without ePBS (Terence has a document where he extracted the python specification without the ePBS and Max EB parts) I don't like this at all, again as this perpetuates relays which are a single centralizing force in Ethereum: 4 trusted players relay 90% of our blocks.  But anyway, the IL design seems to be quite solid. Forced inclusion lists are easier to implement and specify (that's why I went with them for ePBS) but switching to the standard IL where the builder can provide a full block to not satisfy them is relatively simple too",
        "created_at": "2023-10-16T16:14:56.169000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "And by the way, I don't know if relays exist or not in post ePBS, the existence of relays is not bad per-se, their trusted status is the problem. If builders need to become relays, or if relays still provide services, that's fine, as long as they aren't trusted off-protocol entities.",
        "created_at": "2023-10-16T16:17:23.523000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "may yall start a thread?",
        "created_at": "2023-10-16T16:18:39.629000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "ah sry didn't realize this was acd \u003ca:PepeAngryLeave:1126173622113931465\u003e",
        "created_at": "2023-10-16T16:20:42.346000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "general",
        "parent": "",
        "content": "wen ePBS channel",
        "created_at": "2023-10-16T16:21:00.848000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "im not trying to stop the convo but its good to keep the message count focused here",
        "created_at": "2023-10-16T16:21:18.482000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "we have \u003c#874767108809031740\u003e",
        "created_at": "2023-10-16T16:21:36.641000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e sorry for the delay, but #block-construction has now been renamed to  \u003c#874767108809031740\u003e!",
        "created_at": "2023-10-16T17:07:31.207000+00:00",
        "attachments": null
    }
]