[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "ACDE in ~30m!\n\nAgenda + stream above, and here's the zoom link: https://ethereumfoundation.zoom.us/j/91348592283?pwd=SnRnL1VTeXNYVE9CaWpBbnJEUXhQZz09",
        "created_at": "2023-09-28T13:27:56.796000+00:00",
        "attachments": null
    },
    {
        "author": "batenieth",
        "category": "general",
        "parent": "",
        "content": "Hi dear tim\nMe and my friend are the writers of the eip7503 and we have little presentation for today call. We should do anything for presentation or we should just start talking and share screen on the call?",
        "created_at": "2023-09-28T13:55:51.792000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003c@467253321594437632\u003e see the agenda linked above - 7503 is scheduled for after discussions of Deneb and Holesky. Once we get to that, I'll let you know on the call 🙂",
        "created_at": "2023-09-28T13:59:59.464000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "Why is 4788 contract address changed?",
        "created_at": "2023-09-28T14:37:49.852000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "I guess you needed to mine a new address with new bytecode, si?",
        "created_at": "2023-09-28T14:39:14.563000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003ctimbeiko\u003e that, and wanting a \"nicer looking\" one 😅",
        "created_at": "2023-09-28T14:39:42.241000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "I liked the old one more :/",
        "created_at": "2023-09-28T14:39:59.780000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "Thanks 🙂",
        "created_at": "2023-09-28T14:54:55.938000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "I'm confused, it is deployed with a normal CREATE transaction so it is not necessary to mine a new address? Changing input data of the tx should not change the deployed address?",
        "created_at": "2023-09-28T15:00:41.225000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE Recap**\n\n- devnet-9: expected to launch tomorrow, using mainnet 4788 address + deployment scheme, but not the mainnet trusted setup. We'll also launch a short-lived devnet-10 after to test the validator churn limit, and then start moving towards testnets. \n- On the EL side, clients are mostly dealing with the last of hive tests (some of which are failing due to config issues - testing team looking into it!), blob gossip, and optimizations. \n- 4788 audit reviews: both Chainsecurity and Dedaub were on the call to present their audit findings, and ToB published their report (linked in ACDE agenda). The `0` timestamp and ring buffer size issues found in the first passes were the only two significant ones, and fixed in the updated bytecode. \n- Holesky launch: currently at 70-80% participation rate and finalizing, two biggest causes for the offline validators were an issue with prysm \u0026 vouch + some beacon nodes running too many validators on one instance. Both are being looked into!\n- We had a presentation for EIP-7503. Slides here: https://docs.google.com/presentation/d/1omnj-y2L59wERsOBQRKjoIKHm5VQ1A6Sdmc2_Oa75IM/edit?pli=1#slide=id.p\n- Clarification re: EIP-6780: the bullet point concerning the behavior in a post-verkle world will be removed (*\"Note that when verkle tries are implemented on Ethereum, the cleared storage will be marked as having been written before but empty. This leads to no observable differences in EVM execution, but a contract having been created and deleted will lead to different state roots compared to the action not happening.\"*). This should not affect any current implementations.",
        "created_at": "2023-09-28T15:35:48.192000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "To my understanding: mining is done on tx signature (not private key) and the signature is bound with the transaction hash (including initcode).",
        "created_at": "2023-09-28T15:47:15.744000+00:00",
        "attachments": null
    }
]