[
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "Ohey, just got a proposal fresh off the printing press to \"solve\" client diversity, by actually making it irrelevant 🙂 No hard forks needed, doable in a couple weeks with \"minimal\" effort by all. (No, not a joke, it's a legit doable proposal).\n\nhttps://twitter.com/peter_szilagyi/status/1725029695127748789",
        "created_at": "2023-11-16T05:58:28.876000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Direct link to post without Twitter intermediary: https://gist.github.com/karalabe/e106ac58afc1d611641e543312cf41e3",
        "created_at": "2023-11-16T05:59:45.106000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Would a pithy summary of the strategy be \"use block witness data to execute block on multiple VMs and compare results\"?",
        "created_at": "2023-11-16T06:02:39.273000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "A bit rough and misses the fine points, but I guess yes",
        "created_at": "2023-11-16T06:09:38.891000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I left a comment on the gist, seemed to be the best place to consolidate discussion.",
        "created_at": "2023-11-16T06:38:20.364000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdannyryan\u003e Nice! Seems like a simple way to do local N of M on the evm output \n\nOne thing to note is that if everyone adopts full N of N (rather than a subset) and there is an isolated failure of one client, the chain halts.\n\nWhereas if you have legit diversity or keep it at N of M, you still get an available and ideally live chain. Which is the holy Grail of client diversity. Resilient to both safety and liveness failures of a single client",
        "created_at": "2023-11-16T06:49:33.808000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "You should definitely not to N-of-N as we always expect something to go wrong, but N-1 out of N might be interesting",
        "created_at": "2023-11-16T06:59:45.948000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "Of course, if that one that disagrees is the main client then you must stop attesting since oyu can't progress anymore, but that would at worse result in the chain not finalizing until the issue is sovled",
        "created_at": "2023-11-16T07:02:47.312000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "Also, of course, the more diverse clients people run the better overall from a network DoS and whatnot perspective. So my point isn't to say \"run Geth and screw the rest\", rather that we could avoid catastrophic scenarios without having to always maintain a perfect balance across clients.",
        "created_at": "2023-11-16T07:09:50.028000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "Also the idea might be applicable to consensus clients too I'm guessing, but I don't dare say anything about that since I'm way over my head there",
        "created_at": "2023-11-16T07:20:15.336000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdannyryan\u003e yep, agreed!\n\nwe certainly have similar testing-import paths for similar reasons, but I'm unfamiliar wiith how optimized (or not) such executions are",
        "created_at": "2023-11-16T07:52:22.541000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This idea *feels* like a step towards modular clients.  One could *imagine* a client that lets you swap in any EVM, or an m of n EVM that did what Peter is describing.  Coming up with a protocol for building and sharing witness data and execution results is the first step.",
        "created_at": "2023-11-16T08:00:22.123000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Though, I guess sharing results is just sharing the blockhash.",
        "created_at": "2023-11-16T08:00:46.541000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "general",
        "parent": "",
        "content": "Copy-pasting my twitter response, not sure where best to continue conversation about the client diversity:\n\n\u003e Stateless EL block execution is also already part of the OP-Stack, without geth code modifications!\n\u003e We import the geth EVM, implemented an oracle-backed DB, and have a simple protocol to make an external process prepare and fetch the witness data while the program statelessly executes. And it can execute both natively or target a fault proof VM (mips/risc-v emulation).\n\u003e Specs are CC0, and we’re also working on a rust implementation, as part of proof-diversity (multi-proof system can remove human training wheels more easily, by hedging against bugs, when requiring multiple proofs).",
        "created_at": "2023-11-16T08:47:57.772000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "general",
        "parent": "",
        "content": "With the above, I think a geth prototype can be built within a day, by simply importing/copying a bunch of our op-program code, and dropping the part where it also statelessly transforms L1 rollup batch data into the EL block inputs.",
        "created_at": "2023-11-16T08:51:18.698000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "general",
        "parent": "",
        "content": "If anyone is around at devconnect, I’d love to cowork on this stateless execution diversity. cc \u003c@206016661470314496\u003e are you still in Istanbul?",
        "created_at": "2023-11-16T08:54:44.481000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Anywhere but Twitter.  😬  On the gist seems like a good place to have the conversation, as it is public (unlike here) and indexed by search engines and whatnot.  However, it isn't as synchronous as Discord.",
        "created_at": "2023-11-16T08:54:52.706000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "From the gist:\n\n\u003e If you are a high stake operator, you are probably already running multiple full-fledged clients, so this is moot for you.\n\n\nThis is commonly untrue, it seems that many of the larger operators want to run with a single consensus and execution client.  Sometimes they have more than one, but lazily split the validators between them without cross-verification.\n\nHaving the ability to  verify against multiple state/EVM implementations is interesting, a lot depends on how much extra time it takes.  Running it async (optimistically importing the block then reorging it back out if there is disagreement) could avoid this becoming a bottleneck.",
        "created_at": "2023-11-16T08:57:06.921000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "I'd definitely be curious how you did it. My initial reaction would be that i'd prefer a slightly tighter integration to have stronger guarantees that it executes the same as if it was a live client. We can do that in Geth by having the witness act as a 3rd trie db type",
        "created_at": "2023-11-16T09:31:03.675000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "general",
        "parent": "",
        "content": "Let’s meet at the devconnect coworkspace later maybe? I also presented about this at protocol berg a while ago, and last Tuesday at onchain summit, if you like to learn more.",
        "created_at": "2023-11-16T09:32:57.619000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "Sure, am at the RPC spec track, but will free up later",
        "created_at": "2023-11-16T09:33:18.611000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "\u003e Having the ability to  verify against multiple state/EVM implementations is interesting, a lot depends on how much extra time it takes.  Running it async (optimistically importing the block then reorging it back out if there is disagreement) could avoid this becoming a bottleneck.\n\nOptimistically importing an lazy validation does beat the purpose though, since by the time I figure out it was wrong, I already attested it. So yes, there is a performance hit to it. But if a validation can be done say in 100-200ms, that seems a low price to pay for the guarantee of not getting slashed.",
        "created_at": "2023-11-16T09:57:44.511000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "general",
        "parent": "",
        "content": "Note that execution may get much faster after the first execution completes, which can do all the DB loads, effectively warming up the stateless client execution",
        "created_at": "2023-11-16T10:10:41.725000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Depends; with local execution payload there is commonly a ~2s gap between proposing and attesting.  But with MEV relays it's usually a lot closer.\n\nIt may be that there are multiple stages here: building an execution payload that you are happy with is enough to use it for proposal, but to attest to it you want others to confirm.",
        "created_at": "2023-11-16T10:21:41.202000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "We’d definitely need to run the numbers to discuss, but I’d aim for keeping ot as simple as possible that works vs getting lost in perfection",
        "created_at": "2023-11-16T10:25:03.795000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "It's not so much perfection, its avoiding blocks being orphaned due to the extra time taken to propose.  We're already often bumping up against the 4s mark with MEV relays, and with proposer boost hitting the specs finally it's likely that all clients will implement it, meaning that any block showing up after 4s is likely to be orphaned.\n\nAgree that we need to look at the timings, but it's something to be aware of that the 4s mark is moving towards being more of a cliff than it is today.",
        "created_at": "2023-11-16T10:27:41.584000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "ACDC in 8 minutes!\n\nhttps://ethereumfoundation.zoom.us/j/91725886939?pwd=b2kzT0JGeFAzTmhyb1BYSTgrZ0xwdz09\nhttps://github.com/ethereum/pm/issues/900",
        "created_at": "2023-11-16T13:52:09.012000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "general",
        "parent": "",
        "content": "twittered this, but nimbus supports this sort of: if you connect multiple execution clients to a single bn, it rejects disagreements when validating blocks",
        "created_at": "2023-11-16T20:16:55.197000+00:00",
        "attachments": null
    }
]