[
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "Yes. There are zero technical reasons to break backwards compatibility. Keys can be remapped internally or proxy can be set. The only thing that isn't compatible with verkle trees are storage refunds.",
        "created_at": "2023-01-12T05:31:53.939000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "If I read 6049 right it encompasses all possible futures including 6190. It states “stop using this because it’ll at a minimum be changed and might be removed altogether”. That seems to be accurate signaling.",
        "created_at": "2023-01-12T13:04:25.662000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "CL call in 12 miniutes\nhttps://github.com/ethereum/pm/issues/702\nhttps://ethereumfoundation.zoom.us/j/91725886939?pwd=b2kzT0JGeFAzTmhyb1BYSTgrZ0xwdz09",
        "created_at": "2023-01-12T13:48:23.465000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminion",
        "category": "general",
        "parent": "",
        "content": "CL call notes, including Decisions and Actions: https://hackmd.io/@benjaminion/Hkm5x5acj",
        "created_at": "2023-01-12T15:28:55.425000+00:00",
        "attachments": null
    },
    {
        "author": "christine_dkim",
        "category": "general",
        "parent": "",
        "content": "I think the first part of today's CL call was accidentally omitted from the livestream recording on YouTube, can a new version of the full recording be uploaded please? thank you!",
        "created_at": "2023-01-12T16:36:26.531000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003ctimbeiko\u003e Yes, sorry about that! Still dealing with the new channel settings 😅 Will upload the zoom recording today.",
        "created_at": "2023-01-12T16:38:41.984000+00:00",
        "attachments": null
    },
    {
        "author": "christine_dkim",
        "category": "general",
        "parent": "",
        "content": "Thank you! 🙂",
        "created_at": "2023-01-12T16:51:23.872000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e \u003e \u003cdankrad\u003e  That is simply not true. Allowing backwards compatibility will require all contract accounts to have a version number. This is tech debt that is going to remain forever and should not be taken lightly! (re @allcoredevs_bot: \u003csadcat\u003e Yes. There are zero technical reasons to break backwards compatibility. Keys can be remapped internally or proxy can be set. The only thing that isn't compatible with verkle trees are storage refunds.)",
        "created_at": "2023-01-12T17:03:24.595000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e \u003e \u003cdankrad\u003e  Yeah I'm stringly in favour of \"including\" 6049 (re @allcoredevs_bot: \u003ctimbeiko\u003e This is a bit unorthodox, but curious what client teams think of considering https://ethereum-magicians.org/t/deprecate-selfdestruct/11907 for Shanghai. **To be clear, the EIP is only _saying_ we intend to deprecate SELFDESTRUCT, it's not a code change**.\n\n But, by marking SELFDESTRUCT as \"officially\" deprecated, it might help reduce reliance on it. Happy to put it on the agenda for the next ACDE call if people think it's worth considering 🙂)",
        "created_at": "2023-01-12T17:04:07.685000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e \u003e \u003cdankrad\u003e  I think there is largely consensus about removing it, so this decision is about whether the correct first step is to signal that it is deprecated (re @allcoredevs_bot: \u003cPandapip1\u003e I'm not a fan of setting the precedent of removing opcodes no longer considered useful, unless there is an extremely good argument that it won't be considered a precedent in the future.)",
        "created_at": "2023-01-12T17:05:05.697000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "i'll post this here for visibility:\n\nthis morning on the CL call we discussed options for harmonizing withdrawal representations across the CL and EL and decided client devs are interested in two options (see further discussion in \u003c#598292067260825641\u003e ):\n\n1) convert withdrawal amounts to `Gwei` from `wei` -- this is forward-compatible with the next option and avoids needing to worry about backwards compatibility with tooling in the event we want to pursue option 2 in a future hard fork\n2) use the same serialization and merkleization routines for withdrawals in the EL as we do in the CL -- this is a more involved change and requires non-trivial code additions to ELs beyond what exists today\n\nthere seems to be broad agreement to pursue (1) for shanghai and i've put together the spec updates for this here:\n\nhttps://notes.ethereum.org/@ralexstokes/withdrawals-in-gwei\n\nplease take a look so we can make a final call on this during the next ACDE (in one week) as this is likely the last change before Shanghai is finalized (for real)",
        "created_at": "2023-01-12T17:58:06.473000+00:00",
        "attachments": null
    }
]