[
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "Yes, they sent a bunch of and all was vested already. https://app.0xsplits.xyz/accounts/0xF29Ff96aaEa6C9A1fBa851f74737f3c069d4f1a9/",
        "created_at": "2023-09-03T09:01:20.759000+00:00",
        "attachments": null
    },
    {
        "author": ".10320",
        "category": "general",
        "parent": "",
        "content": "Thank you.... I hope there are devs still thinking about how to make solo staking significantly more attractive and easier. Lido is a problem.",
        "created_at": "2023-09-03T10:54:33.135000+00:00",
        "attachments": null
    },
    {
        "author": "0x1984",
        "category": "general",
        "parent": "",
        "content": "Or foster Lido competitors like rETTH",
        "created_at": "2023-09-03T14:45:08.162000+00:00",
        "attachments": null
    },
    {
        "author": ".10320",
        "category": "general",
        "parent": "",
        "content": "Lido has the first mover advantage thus network effects and liquidity advantage. Ethereum staking amount needs to be lowered and the process of staking has to be so easy that anyone can easily do it.",
        "created_at": "2023-09-03T20:15:09.770000+00:00",
        "attachments": null
    },
    {
        "author": ".10320",
        "category": "general",
        "parent": "",
        "content": "Seeing as Lido streams money to the devs and some are even involved in Lido directly. I feel like there is a massive conflict of interest. Whats best for ethereum is decentralization over many unique parties. There should be efforts to streamline staking. Technically there could be an LST given out on the protocol level for solostakers.",
        "created_at": "2023-09-03T20:18:44.337000+00:00",
        "attachments": null
    },
    {
        "author": ".10320",
        "category": "general",
        "parent": "",
        "content": "LIdo and Ethereum interest are not 100% aligned. There will be issues down the line imo.",
        "created_at": "2023-09-03T20:21:16.817000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cadietrichs\u003e I think these are reasonable concerns - but speaking for myself, figuring out long term sustainable staking economics is pretty much at the top of my priority list right now. That includes (among other aspects) both points you raised: A sustainable role for home stakers, and within the staking pool model potential ways to avoid winner-takes-all dynamics. And other researchers are currently actively investigating these questions as well.",
        "created_at": "2023-09-03T20:22:18.229000+00:00",
        "attachments": null
    },
    {
        "author": ".10320",
        "category": "general",
        "parent": "",
        "content": "Thank you for your efforts. I believe in the Dev community to find ways to mitigate the Lido issue.",
        "created_at": "2023-09-03T20:24:00.789000+00:00",
        "attachments": null
    }
]