[
    {
        "author": "dnunez",
        "category": "general",
        "parent": "",
        "content": "Please reconsider for next fork!! 🙏  BLS precompiles would be superuseful in so many projects",
        "created_at": "2023-09-15T15:45:02.503000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "\u003c@\u0026595685821026271242\u003e  can we get an #ePBS channel? I think we need to get coredevs and the larger community involved in the discussions around the designs of PBS in general, instead of them happening in obscure TG channels or random venues. This is the server where most discussions happen and I think ePBS does warrant a channel. We have a WIP for a spec version here \u003chttps://github.com/potuz/consensus-specs/pull/1\u003e and here \u003chttps://github.com/terencechain/consensus-specs/pull/1\u003e . I was hoping to have a coded working devnet PoC  before asking for the channel but I am getting increasingly worried by the amount of press this topic is getting from entities that have direct interest in the topic. To be concrete: I would want to discuss the option of completely getting rid of relays as intermediary, and what worries me is events like this proposal \u003chttps://collective.flashbots.net/t/pbs-guild-proposal-v3-wip/2223\u003e or the fact that there are many \"informative interviews\" with EF researchers together with Flashbots core devs/advisors like this one \u003chttps://www.youtube.com/watch?v=mEbK9AX7X7o\u003e, or research documents signed by EF researchers and Flashbots devs like this one \u003chttps://ethresear.ch/t/relays-in-a-post-epbs-world/16278\u003e. \n\nI would want to have  serious discussion among coredevs, EF researchers and the community at large on the actual objective of ePBS, what is the future we envision, what are the core priorities for the concept to even exist and how do we get there. \ncc \u003c@291925846556540928\u003e (sorry for the double ping if you have mod rights here)",
        "created_at": "2023-09-15T23:17:45.278000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e we have \u003c#874767108809031740\u003e and \u003c#692078615269212180\u003e, would either of these work?",
        "created_at": "2023-09-15T23:21:38.117000+00:00",
        "attachments": null
    }
]