[
    {
        "author": "plasmapower",
        "category": "general",
        "parent": "",
        "content": "While integrating EIP-4844 into Arbitrum, I realized there's no way to get the current price of blobs inside the EVM. This is important for Arbitrum because, currently, Arbitrum uses the `BASEFEE` opcode to trustlessly set the price of data on L2 and reimburse the sequencer for its data posting costs. However, there's currently no equivalent for blob gas.\n\nI'd appreciate it if y'all would consider adding an opcode that returns the current blob gas price to EIP-4844 -- maybe `BLOBGASPRICE`. I'd be happy to write the PR if this sounds reasonable. The EL already needs to calculate this to charge for blob txs, so it would be a simple opcode for EL teams to implement.\n\nI think this is an important feature to consider for Ethereum's vision of scaling with decentralized rollup. If this opcode isn't implemented, rollups will have two options: trust a centralized oracle to set the L1 price and reimburse the sequencer (obviously problematic especially in rollups where a tx's gas limit does not bound the amount it may pay for L1 costs), or do proofs against the L1 block hash. While the latter is trustless, it makes batch posting a lot more complicated (there's a tradeoff between accurate data and required tx inclusion speed), and it presents an issue for any rollup hoping to become immutable, which is that the Ethereum header format may change further in the future and break parsing (as an extreme example, if SSZ was used for the full header, this would certainly break any schemes parsing information out of the header).\n\nThank you for considering this proposal.",
        "created_at": "2023-09-11T15:01:41.499000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003c@165550481156866048\u003e as you're probably aware, we're quite late in terms of specifying + implementing the upgrade in clients. At this point we would strongly default to not making more changes in order to ship the upgrade ASAP. \n\nThat said, if you feel this is a critical feature for L2s, I'd suggest having a full proposal by this Thursday's ACDE, where we can discuss it (even better if 1-2 days before so people can review it prior to the call). This means a full EIP, including an outline of the testing involved. If the Arbitrum team can help with implementations + testing, it may make client teams more inclined towards the feature.",
        "created_at": "2023-09-11T15:30:41.878000+00:00",
        "attachments": null
    },
    {
        "author": "dapplion",
        "category": "general",
        "parent": "",
        "content": "could you use header parsing for this fork, and upgrade your systems in 6-9 months on the next fork once the opcode is made available?",
        "created_at": "2023-09-11T16:00:38.432000+00:00",
        "attachments": null
    },
    {
        "author": "plasmapower",
        "category": "general",
        "parent": "",
        "content": "Given the extent of the timing concerns here, that does seem to be the best approach. Thanks for considering my proposal, but it from \u003c@552133098075193354\u003e's message it sounds like the best approach would be to revisit this in the future 🙂",
        "created_at": "2023-09-11T16:37:59.959000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cadietrichs\u003e right, having an opcode like that would be useful. If I remember correctly, we didn’t originally include one to keep it simple, and to maybe figure out a way to expose that information in a way that could be generalized for future fee dimensions, without having to add an opcode every time",
        "created_at": "2023-09-11T16:40:15.019000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "We're still considering max churn limit, so i think we could do this opcode. Would have been nice to know earlier, but it seems important for L2s to access this field easily",
        "created_at": "2023-09-11T16:41:13.656000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cadietrichs\u003e admittedly going via past block headers is not ideal. I think it’s good enough though to not motivate a last-minute addition to Dencun, but we should definitely add something in the next fork",
        "created_at": "2023-09-11T16:41:50.359000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cadietrichs\u003e although depending on the timeline for shipping Dencun, maybe there is still room",
        "created_at": "2023-09-11T16:42:50.298000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I'd suspect we may get more requests from L2s given that they just started testing it (at least in the case of Arbitrum) and they may be the highest consumers of this fork. It'd be nice to hear from other L2s here.",
        "created_at": "2023-09-11T16:47:44.458000+00:00",
        "attachments": null
    },
    {
        "author": "dapplion",
        "category": "general",
        "parent": "",
        "content": "Writing the EIP is not gonna be wasted work since that has to be done anyway before or after the fork",
        "created_at": "2023-09-11T17:08:08.258000+00:00",
        "attachments": null
    },
    {
        "author": "dapplion",
        "category": "general",
        "parent": "",
        "content": "Chatted with Polygon ZK-evm recently and they hadn't started testing either (understandable since they just went mainnet)",
        "created_at": "2023-09-11T17:08:36.576000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003e It was unfortunate that ASICs ruined that dream\nIt was unfortunate that _we allowed_ ASICs to ruin that dream.  But we succeeded in moving to proof of stake, so in the end it didn't matter for long.  The hashrate was probably about 25% ASICs as the Merge approached, and it was still possible to make useful (if not profitable) amounts of Ether with consumer gear and no KYC.",
        "created_at": "2023-09-11T20:13:51.507000+00:00",
        "attachments": null
    }
]