[
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "It has been removed since Shanghai, will close the issue",
        "created_at": "2023-06-23T05:46:47.578000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "\u003c@547171287831805972\u003e \u003c@755913785620824175\u003e \u003c@892053833121923094\u003e thanks for presentation this all looks nice. \n\nI was the main complainer that execution-spec-tests does not support state tests and state test format is what evmone works with (not only execution but also test generation and fuzzing).\n\nOn the other hand, blockchain tests is a superset of state tests and there is big duplication between two formats. Some teams happily consume blockchain format only.\n\nWe can research and discuss the details. You can point me to the best place for discussion. But if to deprecate the state test format we need a migration plan up front.\n\nHowever, EIP-4844 only having blockchain tests is quite a pain.",
        "created_at": "2023-06-23T08:14:18.782000+00:00",
        "attachments": null
    },
    {
        "author": "danceratopz",
        "category": "general",
        "parent": "",
        "content": "Thanks \u003c@425274498732916736\u003e for the feedback!\n\nWe discussed our state test format internally this week. \u003c@892053833121923094\u003e drew it to our attention that the current format can't be used by evmone. We could definitely add support for this format, although it'd be worth exploring whether a single format can be used across tooling from all teams.\n\nWe can def jump on a call together to quickly discuss options. Otherwise, the best place to discuss with other teams is the \"Protocol Testing Call\", the next one is at \u003ct:1688044800:F\u003e - I just tried to invite you, did it work?",
        "created_at": "2023-06-23T09:16:16.892000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "general",
        "parent": "",
        "content": "Nope, bl tests are not a superset. Statetests can contain invalid transactions and verify that they are rejected, which a bl test cannot.",
        "created_at": "2023-06-23T18:43:28.453000+00:00",
        "attachments": null
    },
    {
        "author": "spencer_tb",
        "category": "general",
        "parent": "",
        "content": "danceratopz Spencer Taylor Brown Mario",
        "created_at": "2023-06-23T20:57:10.048000+00:00",
        "attachments": null
    }
]