[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I'm not a fan of private discussions overriding public consensus.  It feels like a more appropriate next step would be to start a public discussion about whether or not the EL wants to move to SSZ, and bring up the ideas that came up in private conversation to a broader public audience.",
        "created_at": "2023-01-28T03:56:24.430000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I think you are talking about two different things. During the ACD call it was discussed about trying to get the withdrawals root as SSZ on the EL to have compatibility with the CL and let light clients for example prove it. There was an almost unanimous decision that this would not be part of Capella, that we would simply switch units to Gwei on the engine API and that we would analyze the path forward for SSZ. The discussions during the off site centered around a more comprehensive path towards SSZ adoption on the EL, far more reaching than withrawals, including transactions and the way to hash/serialize them",
        "created_at": "2023-01-28T11:46:47.506000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The primary argument against SSZ withdraw roots in Shanghai was from Danny and it was strongly premised on the assertion that there was **not** consensus that we would eventually move the EL block header to SSZ.  IIRC I expressed that I believed that twice in the past the EL had agreed we would move to SSZ and we had consensus.  However, no one in the call reinforced this belief which sent a strong signal that it was incorrect and there was in fact no consensus among EL devs to move to SSZ.",
        "created_at": "2023-01-28T11:50:30.191000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I see two possibilities here:\n1. There is in fact no consensus on moving EL to SSZ, and we should start the discussion there.\n2. There was in fact consensus that the EL will SSZify eventually, but no one was wanted to lend support to an argument that might delay withdraws by weeks for other reasons so everyone just kept quiet and allowed Danny's incorrect assumption to survive in hopes that the conversation would end.",
        "created_at": "2023-01-28T11:52:46.597000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I personally *hope* that the reality is (1) and for now I'm choosing to operate under the assumption that is the reality we live in because (2) implies a *much* worse problem IMO.",
        "created_at": "2023-01-28T11:54:17.974000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "To be clear, I'm a huge fan of moving to SSZ (ignoring my desire for ossification).  I just think that we shouldn't be making such a decision to do so in private off-sites.  Such off-sites are great for figuring out solutions that can be proposed to the broader ACD community, but I think we should first start by figuring out whether we are going to move to SSZ or not.",
        "created_at": "2023-01-28T11:59:22.166000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "But then you'd go in circles",
        "created_at": "2023-01-28T11:59:44.679000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "figuring out whether to move to SSZ or not strongly depends on what that path would look like",
        "created_at": "2023-01-28T11:59:59.311000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "And bringing a concrete proposal forward is a great first step to getting consensus on whether to switch to SSZ.",
        "created_at": "2023-01-28T12:00:05.847000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I'm certainly not against discussing the proposed path forward!  But that isn't what Vitalik proposed above, he skipped the step of \"talk to core devs about a potential path forward\" and went straight to \"lets announce to the world that we are moving to SSZ\".",
        "created_at": "2023-01-28T12:00:47.596000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "Ah, I see what you mean",
        "created_at": "2023-01-28T12:01:11.743000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Step 1: Come to agreement on whether we are going to SSZify the EL.\nStep 2: If we agree to do it, then discuss announcing an EOL policy on RLP in the EL.",
        "created_at": "2023-01-28T12:01:36.454000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "I do see how you can interpret his statement that strongly, but I'm not sure it was meant that way.",
        "created_at": "2023-01-28T12:02:48.418000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I think Vitalik didn't say \"we are moving to SSZ\" but rather \"we are probably moving to SSZ\" and I think it's right to announce this since if you're about to deploy a contract that proves transactions, you may want to wait until a decision is made",
        "created_at": "2023-01-28T12:04:03.260000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If my assumption of reality above is correct, I'm not convinced we are \"probably moving to SSZ\".  At the least, Danny sounded quite uncertain of the path forward and no one challenged him on that.",
        "created_at": "2023-01-28T12:04:46.788000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think we need to be careful about announcing deprecations of stuff that we don't actually deprecate because it risks turning deprecation warnings into the boy who cried wolf and people will stop heeding them.",
        "created_at": "2023-01-28T12:05:19.305000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "By the time we make such an announcement, we should be quite confident that we are going to do it.  I'm no longer convinced we are at that level of confidence (I was convinced prior to ACDE last week).",
        "created_at": "2023-01-28T12:05:55.350000+00:00",
        "attachments": null
    }
]