[
    {
        "author": "abcoathup",
        "category": "general",
        "parent": "",
        "content": "Caveat: **not a core dev**, but posting here in case aids with the discussion.\n\nDencun upgrade schedule prediction (assume no major issues \u0026 EIP4788 audit ok):\n* **Devnet-9** early September\n* No Dencun specific testnet as L2s currently use Goerli\n* **Goerli** upgrade mid September (4 weeks for L2s to test, Goerli deprecated)\n* **Sepolia** mid October (2 weeks, L2s moving to Sepolia, Arbitrum just added)\n* **Holešky** early November (2 weeks)\n* **mainnet** mid November (clashes with Devconnect, so as per Ben could be a couple of weeks later)",
        "created_at": "2023-08-30T00:44:46.429000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e it would be huge if we could do mainnet before or around Devconnect",
        "created_at": "2023-08-30T00:45:59.854000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "general",
        "parent": "",
        "content": "I think that timeline is pretty aggressive",
        "created_at": "2023-08-30T01:01:13.398000+00:00",
        "attachments": null
    },
    {
        "author": "__kasey__",
        "category": "general",
        "parent": "",
        "content": "We're debugging issues in devnet-8 still - so early September (presumably that means \"next week\") seems off for devnet-9. Building on that observation, \"mid-September\" for Goerli must be off as well. It seems likely we'll find tricky performance issues in Goerli testing, and those can take time to test and build confidence. Keep propagating prediction errors forward (with more variables, like: L2s start testing and experimenting more hardcore; Holesky is a new network with a large val set) and my wild guess is this is easily off base by 1-3 months.",
        "created_at": "2023-08-30T01:21:01.424000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "imo it'd need to be a good week before if we were to attempt to, because a lot of people will be in flight (literally) if anything goes boom",
        "created_at": "2023-08-30T01:50:24.481000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "Given that most teams will probably be releasing very shortly for the initial holesky settings, it'd mean we need to release for goerli basically straight after that if we were to allow people any time to update their clients... we'd want at least a week for validators to update their nodes, even if it is a testnet...\nI think i'd agree with \u003c@363800010518822915\u003e , probably leaning towards 'unrealistic'",
        "created_at": "2023-08-30T01:59:24.133000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE in ~23:45 (Aug 31, 1400 UTC)**\nAgenda: https://github.com/ethereum/pm/issues/850\nStream: https://www.youtube.com/watch?v=vxZL9dyeMr4\nZoom: will post here before the call",
        "created_at": "2023-08-30T14:17:08.091000+00:00",
        "attachments": null
    }
]