[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "ACDE in 30m! \n\nhttps://ethereumfoundation.zoom.us/j/91348592283?pwd=SnRnL1VTeXNYVE9CaWpBbnJEUXhQZz09",
        "created_at": "2023-11-09T13:29:14.710000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Not a fan of an API call that nominally provides any sort of guarantee of inclusion for a transaction (in this case calling it `max` suggests that it is as big as it needs to be).  And having this at all seems to hark back to gas auctions.  Tip is a tip, not a priority system.  Inclusion from the point of view of the end user should be based upon max fee per gas.",
        "created_at": "2023-11-09T14:04:38.290000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "That's an argument to have ethers.js make it easier to alter the tip, not for it to be a client call.\n\nWhat situation are you facing where you think changing the tip would make a significant difference?  The only time that it likely matters is when the next block being built is 100% full.",
        "created_at": "2023-11-09T14:09:57.226000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "You can, if you want.  But a lot of clients will reject it in the same way they used to reject txs with a low gas price.  Nothing in the protocol says you can't have txs with 0 tip.",
        "created_at": "2023-11-09T14:12:10.050000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Still not sure what problem this is solving, compared to the user picking their own tip (and understanding that in times of full blocks if they don't give a decent tip they may have to wait for the next block).  The value gives no guarantees, as others can come in with higher tips afterwards but before the block is built.",
        "created_at": "2023-11-09T14:13:49.006000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "can we move this \u003c#804019759934078987\u003e pls",
        "created_at": "2023-11-09T14:22:36.709000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE Recap** \n- Goerli Shadow Fork went well, but was on a relatively small number of nodes. Next steps are to get a devnet running with the last spec changes, and after that we'll do a larger Goerli Shadow Fork, and then start doing mainnet ones to have at least one smaller and one larger one done before actually forking mainet. \n- We agreed to add the single RPC method for blob gas price (`eth_blobGasPrice`) and to add the blob pricing info to `eth_feeHistory` as described here: https://github.com/ethereum/execution-apis/pull/486 \n- Conversations about EIP-7545 and precompiles in general, no action taken for now. \n- We agreed to **keep** both next week's ACDC and ACDE the week after, but cancel the testing call next Monday. For teams who aren't able to send anyone to the call, please post an async update on the call agenda prior to it.",
        "created_at": "2023-11-09T15:04:26.756000+00:00",
        "attachments": null
    }
]