[
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Thanks for response. What’s “merkleization” by the way? Also, is it just me but I think that making a breaking change like this would invalidate a lot of existing implementations and make a lot of things not backwards compatible with the upgrade, which IMO is not something we want to have? SSZ implementations are not as widespread as RLP ones are, and not nearly as time tested. \n\nPlus since blockchains are all about history, clients would need to maintain two implementations at the same time either way, or at very least have a band-aid solution to work around it. Sounds like a lot of commitment for a small change like this, yet that it’s more of a breaking change than the merge itself, especially if you invalidate non-RLP transactions (which otherwise doesn’t make any sense).",
        "created_at": "2023-01-31T00:38:07.040000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Added this to this week's ACDE agenda, as well as a link to \u003c@881905303011086387\u003e's draft EIP, cc: \u003c@273808422753796097\u003e",
        "created_at": "2023-01-31T01:14:40.769000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "general",
        "parent": "",
        "content": "https://github.com/ethereum/consensus-specs/blob/dev/ssz/merkle-proofs.md\nMerkleization allows you to generate a proof that a certain field is part of a block. For example, you could create a proof that you sent 1 ETH to a certain destination in a block. It can be used by smart contract bridges, for example, to verify that you indeed made a deposit. Or, it can be used in a wallet to link `eth_getReceipts` responses to a specific block, instead of having to blindly trust a server. Essentially, merkleization improves security. With the current MPT, there are also proofs (`eth_getProof`), but as I understand it, they need the full data to be sent. This can be a problem when the transaction is larger than calldata, so you can't submit it to a smart contract using such techniques. SSZ merkleization allows proving individual fields / chunks of a tx.\n\nSSZ and RLP can we converted back and forth, the legacy implementation could simply be fed through a proxy that does the conversion to the expected format. The trouble where things break is only if you rely on the existing `transactions_root` in the EL block header, because the new blocks wouldn't commit to the old MPT root anymore. If this breaks major apps, and they can't migrate, it may be useful to keep that commitment in the block header.",
        "created_at": "2023-01-31T08:46:46.494000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "general",
        "parent": "",
        "content": "And, yes, if you want an archive node, you need to support older formats. But, if you just want to run a validator, supporting the formats that were allowed in the last 0.5-2 years is totally sufficient.",
        "created_at": "2023-01-31T08:47:49.095000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "general",
        "parent": "",
        "content": "Thing is, EIP-4844 already introduces SSZ transactions, so existing tooling needs to be updated anyway. If this is already the case, is a good chance to just do it the right way instead of just partially",
        "created_at": "2023-01-31T08:48:20.368000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "general",
        "parent": "",
        "content": "re merkleization, I touched merkle proofs as a concept in a Devcon Bogotá talk https://www.youtube.com/watch?v=ZHNrAXf3RDE\nSSZ merkleization works quite similarly as presented (binary tree). The existing hexary MPTs are more complicated (but, similar concept).",
        "created_at": "2023-01-31T10:25:01.221000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e \u003e \u003cdankrad\u003e  SSZ supports optional fields (re @allcoredevs_bot: \u003cRoberto Bayardo\u003e [reply]: SSZ doesn't have optional fields so while you could use SignedIP1559Transaction to represent it you'd waste a few bytes by doing so, and then you'd have to mandate/check those unused values are always set canonically (e.g. 0) to avoid non-deterministic hashing.)",
        "created_at": "2023-01-31T15:04:42.741000+00:00",
        "attachments": null
    }
]