[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "ACDE in ~10m\n\nAgenda: https://github.com/ethereum/pm/issues/754\nStream: https://youtube.com/live/u8Nm8AGyCQM\nZoom: https://ethereumfoundation.zoom.us/j/91348592283?pwd=SnRnL1VTeXNYVE9CaWpBbnJEUXhQZz09",
        "created_at": "2023-04-13T13:49:22.401000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "ACDE recap: \n\n* Debrief on the Shapella upgrade. TL;DR: things went (relatively) smoothly 🎉 ! We saw a huge number of withdrawal credential changes, which caused some initial networking issues. \n* Prysm had an mev-boost-related bug, expect a full post-mortem tomorrow. v4.0.2 is already out with a fix!\n* Teku is currently investigating a minor issue re: block import times. \n* Alex proposed a set of changes to EIP-4788 (see: https://github.com/ethereum/EIPs/pull/6859) - lots of discussion on this, hoping to continue async this week and bring up on ACDC next week. \n* On the next ACDE, we'll go over all the candidate EIPs for Dencun and try to agree on the most important ones to CFI! You can see the list of candidates here: https://ethereum-magicians.org/t/cancun-network-upgrade-meta-thread/12060 - I'll make sure to keep the first message on the thread updated. If you'd like to propose an EIP, either mention it in that thread, and/or add the `cancun-candidate` tag to the EIP's forum post. \n* Pari will follow up with client teams re: setting up Capella genesis for devnets in the next week or so. \n* We discussed Mikhail's PR to ensure `payloadIds` change if any parameter in fcU calls change: https://github.com/ethereum/execution-apis/pull/401 - we agreed to merge this in the next couple days if there are no objections.\n* Alex will make a PR to the execution APIs repo for a JSON RPC endpoint to allow verification of blocks sent by external builders - this is currently part of a geth fork, and having it in the spec would allow more client diversity in that part of the stack.",
        "created_at": "2023-04-13T16:24:58.665000+00:00",
        "attachments": null
    }
]