[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE tomorrow 14:00 UTC**\nAgenda: https://github.com/ethereum/pm/issues/834\nStream: https://youtube.com/live/pTWm4EyStYg\nZoom: to be shared here before the call",
        "created_at": "2023-07-19T07:02:58.671000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Was there a final decision on the max number of blobs per block?  I think it went from 4 to 6, but there was talk about that being experimental and it dropping back to 4.",
        "created_at": "2023-07-19T07:56:41.728000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "We're testing 3/6 on devnet-7 and the data kind of isn't useful. I can tell you 6 works fine on a small scale devnet, but that doesn't help us get any closer to finding out if it'd be fine on mainnet. Once we're a lot more stable we'd run some resource exhaustion tests, perhaps those are more telling. I think realistically we can only have data on if it'd work based on goerli/holesky.",
        "created_at": "2023-07-19T08:24:22.515000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Okay so is the plan to go with 6 until we have a large-scale testnet, and then dial it back if it is shown to not work?",
        "created_at": "2023-07-19T08:24:59.176000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "general",
        "parent": "",
        "content": "i think we can't afford any more than 200ms additional latency as proposals are already super tight with mev - anything \u003e 4 sec which misses proposal boost gets missed it seems",
        "created_at": "2023-07-19T08:25:53.976000+00:00",
        "attachments": null
    },
    {
        "author": "frankwiz",
        "category": "general",
        "parent": "",
        "content": "\u003c@552133098075193354\u003e  thanks for this - is the implementer recording from last week out?",
        "created_at": "2023-07-19T08:39:39.001000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Still haven’t checked zoom archives, sorry! Will try and do so tomorrow",
        "created_at": "2023-07-19T08:40:05.420000+00:00",
        "attachments": null
    },
    {
        "author": "frankwiz",
        "category": "general",
        "parent": "",
        "content": "Thank you! looking fwd to it (or tag you again lol)",
        "created_at": "2023-07-19T08:40:14.578000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "I think currently there is no plan, I guess the top priority is to get a devnet up with all EIPs in them to begin with so the 4 or 6 debate didn't really get settled. Hoping that we can run 2 shadowforks in parallel, one with 2/4 and another with 3/6, so that we can compare performances. \n\nIssue I see with going for a larger value on a large-testnet: If it fails, we then have to create a fork just for that testnet in order to save it.",
        "created_at": "2023-07-19T08:49:24.372000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Yeah, good point.  Shadow forks would certainly be safer in that configuration, but will there be enough nodes on it to have any reliable metric?\n\nAt current the spec sets max blobs per block to 6, is that going to be put back to 4 before we move to public testnets then?",
        "created_at": "2023-07-19T08:52:11.821000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "That's where we're stuck too, it'll be a better metric compared to devnets but it won't be a perfect one. I guess it depends on what risk level we're willing to tolerate. \n\nI think its going to be left at 6 unless we find data going against it (or that's the assumption i've been working under)",
        "created_at": "2023-07-19T08:54:31.470000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I suppose the other consideration is that goerli is already deprecated, and will be unsupported at the end of the year.  As such, if we end up with a chain that limps along for a few months it won't be the worst thing because it's short term.  We wouldn't need to fork it, just indicate that putting lots of blobs across it would be detrimental to the health of the chain (worst case we could have a --max-blobs-per-block flag in the clients that allowed us to keep this down to 4 per block until goerli is done).",
        "created_at": "2023-07-19T08:59:09.320000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "Yea that'd definitely be possible and would make a strong case for having goerli as the first fork so we have enough time to collect data.",
        "created_at": "2023-07-19T09:20:17.477000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "Is goerli \"officially\" deprecated though?  The most recent mention of goerli on https://blog.ethereum.org/ is still the Shapella announcement, and the Ropsten/Kovan/Rinkeby announcement before that that explicitly lists Goerli as a viable alternative.  I know there are twitter threads about it being shutdown but it'd be nice to be able to point our customers to something a little more official if goerli stops finalizing after Dencun and people start complaining.",
        "created_at": "2023-07-19T18:08:07.573000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "Ya its unfortunate we can't add machine readable constraints, but we can always add documentation for us humans.  IMO ideally each RPC had a `usage.md` document attached to it that included things like this.  Or maybe `expectations.md`, not sure, but would be good to have somewhere to point to where we can say \"this RPC expects this type of input to work, and your client implementation doesn't do that\" (and likewise at'd act as a good human readable spec to follow for implementers).\n\nMaybe in conjunction w/ links to hive's `ethereum/rpc` tests for each method?",
        "created_at": "2023-07-19T18:40:34.910000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "One of the benefits of using OpenRPC is there are tools for rendering as a website with human readable forms and rendering of inputs/outputs.  At the moment, there isn't a way to get anything other than a single-line text description added (and only to certain locations).  😖",
        "created_at": "2023-07-19T18:53:36.071000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If we did want to add extra files like you suggest, then I think it would be very valuable to update the common documentation rendering tools to support them.",
        "created_at": "2023-07-19T18:54:03.670000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "What if the one-line description included a link to `https://github.com/ethereum/execution-apis/tree/main/docs/methods/$METHODNAME.md` or what have you?  I don't know much about Open(RPC|API)'s format but maybe there's a way to tell it that it should \"include\" the link vs. linking to it?",
        "created_at": "2023-07-19T20:12:57.497000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "This is what I intended the description field to be used for in method definitions. I moved the spec to yaml a while ago so we could easily support multi-line strings. It's really just a matter of documenting the behavior. It would be nice to get it to render to the human readable form, but not a hard requirement - the spec files are plenty readable, ~~ eventually we'll get support in the openrpc tools ~~ it actually does!",
        "created_at": "2023-07-19T20:35:18.422000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "https://github.com/eth-clients/goerli",
        "created_at": "2023-07-19T20:56:00.383000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "Ah 👍 that links to https://ethereum.org/en/developers/docs/networks/#goerli which lists it as deprecated, thanks!",
        "created_at": "2023-07-19T20:57:55.643000+00:00",
        "attachments": null
    }
]