[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE in 35m (14:00 UTC)**\nAgenda: https://github.com/ethereum/pm/issues/759\nStream: https://youtube.com/live/ajLQVC3E_mk\nZoom: https://ethereumfoundation.zoom.us/j/91348592283?pwd=SnRnL1VTeXNYVE9CaWpBbnJEUXhQZz09",
        "created_at": "2023-04-27T13:27:56.559000+00:00",
        "attachments": null
    },
    {
        "author": "karalabe",
        "category": "general",
        "parent": "",
        "content": "Probably people don't much care any more, but I propose terminating the Rinkeby testnet on the 1st of June. If anyone opposes, please voice your concerns 🙂",
        "created_at": "2023-04-27T15:19:38.339000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE TL;DW**\n\n- We discussed Cancun scope! You can watch the livestream for all the back and forth, but here is where we landed:\n- **Included EIPs: 4844, 6780, 1153 and 6475**, some notes: \n- 6780: we've commissioned an impact analysis for the EIP. When we have it (in ~1 month), we'll discuss the EIP again based on the findings to assess whether any spec changes should be done. EIP-6913 was proposed to mitigate some potential issues. \n- 6475: we discussed some changes to the spec on the call, which Etan will make in the coming days. 4844 will also need to be updated to reflect this. \n- **CFI'd EIPs:** we made EIPs 4788 and 6493 CFI. We also removed EOF EIPs from CFI, and had some conversations about prioritizing them for Prague. We'll discuss 6493 more on the 4844 call next Monday and then the next ACDE. \n\n- 4844 devnet updates: devnet 5 launched with 1000 validators and 6 clients. Tooling and links are available here: https://4844-devnet-5.ethpandaops.io/\n- Expect more clients joining, as well as fuzzing, 🔜 \n- With this one live, we'll now shut down devnet-4",
        "created_at": "2023-04-27T15:26:06.011000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "PR to the EL specs to reflect the decisions above: https://github.com/ethereum/execution-specs/pull/754",
        "created_at": "2023-04-27T15:36:29.404000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "general",
        "parent": "",
        "content": "For a bit more visibility, I would like to post it here too, that we would like to shut down 4844-devnet-4 possible as soon as early next week. We would like to ask people to migrate their tools to devnet-5 that has launched yesterday. https://4844-devnet-5.ethpandaops.io.",
        "created_at": "2023-04-27T16:06:47.784000+00:00",
        "attachments": null
    }
]