[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "ACDE is ~15 minutes\n\nAgenda + stream above. Zoom link: https://ethereumfoundation.zoom.us/j/91348592283?pwd=SnRnL1VTeXNYVE9CaWpBbnJEUXhQZz09",
        "created_at": "2023-08-31T13:43:09.573000+00:00",
        "attachments": null
    },
    {
        "author": "phi.go",
        "category": "general",
        "parent": "",
        "content": "it seems like nearly everyone is muted on the Youtube stream...",
        "created_at": "2023-08-31T14:14:49.454000+00:00",
        "attachments": null
    },
    {
        "author": ".mkrypto",
        "category": "general",
        "parent": "",
        "content": "yes",
        "created_at": "2023-08-31T14:15:12.398000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "Tim will update the stream to the zoom recording after the call",
        "created_at": "2023-08-31T14:16:00.651000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "is it better now?",
        "created_at": "2023-08-31T14:17:37.286000+00:00",
        "attachments": null
    },
    {
        "author": "phi.go",
        "category": "general",
        "parent": "",
        "content": "yes",
        "created_at": "2023-08-31T14:18:11.823000+00:00",
        "attachments": null
    },
    {
        "author": "phi.go",
        "category": "general",
        "parent": "",
        "content": "well, i heard at least 4 people consecutively, which is an improvement 🙂",
        "created_at": "2023-08-31T14:18:30.189000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "sorry about that - stream setting carried over from hosting the CL call last week 😅",
        "created_at": "2023-08-31T14:18:39.714000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "One thing that I forgot to mention is that counterfactual addresses (eg. the multisig example in https://ethresear.ch/t/what-would-break-if-we-lose-address-collision-resistance/11356 ) do become somewhat more important with L2s",
        "created_at": "2023-08-31T15:17:11.409000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "so that increases the risk of address space compression compared to an L1-only world, or at least it means we have to do more work to counteract that risk",
        "created_at": "2023-08-31T15:17:31.189000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "For example, consider the following scenario:\n\nWhen creating the NewDAO Wallet, an insider grinds a collision where they generate two pieces of code, one which looks like a legit DAO wallet, and the other controlled by themselves. They publish the first, to generate the NewDAO wallet. On L1, and on every L2 where NewDAO sent at least one transaction, the NewDAO controls funds. But the insider can do a long con where they wait until NewDAO receives a significant amount of funds on some L2 where they have not yet performed any activity, and then immediately reveal the other code, publish it on that L2, and seize those funds",
        "created_at": "2023-08-31T15:20:31.395000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "If Safe gets designed in such a way that each L2 gets a separately generated address, then this attack would still be possible but it would be weaker: the attacker would have to target a specific L2 to steal from, and hope that NewDAO gets a windfall on that L2 before it engages in activity there",
        "created_at": "2023-08-31T15:21:25.810000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "There are identifiable countermeasures: for example, we can standardize across L2s that a particular address subspace can _only_ instantiate \"mirrors\" of L1 contracts that have correspnding addresses, so there is no possibility of a collision once that L1 contract is already published. Effectively, this is basically extending the L2 EVM / AA effort to enshrine the whole concept of a multi-L2 smart contract wallet. But this requires significant ecosystem-level coordination.",
        "created_at": "2023-08-31T15:23:20.393000+00:00",
        "attachments": null
    },
    {
        "author": "jlokier",
        "category": "general",
        "parent": "",
        "content": "\u003c@273808422753796097\u003e Probably not the channel for this, but can't some of the above ASC risks be mitigated by requiring a constrained larger private key than the size of the public address, such that a substantial 2^n grind is required to generate a single valid key pair, so as to increase the collision security (= iterations needed to generate a valid public address collision), equivalently allowing the public address size to be reduced without reducing the collision security?",
        "created_at": "2023-08-31T15:33:34.948000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE recap** \n- Devnet 8: devnet is healthy but there are still some issues with specific client pairs and non-consensus features (e.g. blob txn pool). We agreed to keep it running longer and do most of our testing on it before launching devnet 9.\n- Devnet 9: main change: new 4788 contract. Full spec here: https://notes.ethereum.org/@ethpandaops/dencun-devnet-9 - assuming we can do most of our testing on devnet-8, we'll _try_ and make 9 the last one before testnets, but ofc if we find issues there that warrant another devnet launch, we'll do that\n- Testnet ordering: we tentatively agreed to first fork Holesky, then Goerli, then Sepolia. \n- Blob count: we'd like to ideally keep the same amount of blobs on all networks, but if we deploy 3/6 on a testnet and find we'd rather do 2/4, we'll likely leave the testnet with 3/6 to not introduce a custom for for it.\n- Verkle Trie / State Expiry discussion: long conversation on the call about the intersection of both features, recap of the past few years of work, and the suggested path forward.  No decisions taken, and \u003c#824798757618188339\u003e is the main channel to follow ( \u003c#862773283472408596\u003e and \u003c#739145593762611250\u003e are kinda dead)\n- Etan shared some updates on the various SSZ transaction types, which he cross-posted to the agenda (https://github.com/ethereum/pm/issues/850#issuecomment-1700785320)\n- We \"officially\" announced EELS (https://blog.ethereum.org/2023/08/29/eel-spec) and put up a grant request for someone to add the missing pre-merge fork logic to the Yellow Paper (https://github.com/ethereum/yellowpaper#repository-currently-outdated)",
        "created_at": "2023-08-31T18:19:27.985000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Also, here's the updated ACDE recording where my audio isn't cut off for the first 10m 🙂 https://youtu.be/GkSjuiqqkKU",
        "created_at": "2023-08-31T22:15:14.266000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cadietrichs\u003e damn, I miss one acde and y‘all start talking about state expiry…",
        "created_at": "2023-08-31T23:02:30.566000+00:00",
        "attachments": null
    }
]