[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE is ~15m**\nhttps://ethereumfoundation.zoom.us/j/91348592283?pwd=SnRnL1VTeXNYVE9CaWpBbnJEUXhQZz09",
        "created_at": "2023-03-30T13:42:43.693000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE TL;DW**\n\n* Shapella is happening! If you haven't yet, upgrade your nodes. Client versions are listed here: https://blog.ethereum.org/2023/03/28/shapella-mainnet-announcement\n* Note: Erigon updated its required release, and Prysm + Lodestar will likely have optional minor release updates before the fork. Nethermind is planning a \"monster release\" post-Shapella with several new features. \n* Last Shapella MSF is scheduled for next week, and EVM fuzzing has started across EL clients \n* EOF update: https://notes.ethereum.org/ZOEv9yyHQdmxTVaYiJmy9Q - the changes proposed remove code \u0026 gas observability as much as possible. EL teams need to review in more detail, and some discussion of making it the \"main thing\" for the next upgrade, potentially. \n* SELFDESTRUCT: new proposal out to only allow SELFDESTRUCT in the same txn as a contract creation: https://eips.ethereum.org/EIPS/eip-6780 - **we've CFI'd 6780 for Cancun**, and plan on doing more analyses of potential impact on contracts. If your contract is affected by this, please reach out. \n* CL access in the EVM: https://notes.ethereum.org/@ralexstokes/notes-on-cl-access - expect some minor updates to EIP-4788 and a proposal to address the generalized index 🔜 \n* `getPayloadV3` - EL teams said they will look into implementing this. If block selection heuristics aren't implemented before Cancun, it will be introduced as part of that fork. Otherwise, we will merge it into the API spec as soon as there are EL heuristics implementations. \n* Verkle Tries unscheduled update: Guillaume gave an overview of the state of VT, and answered questions from everyone on the call - too much back and forth to recap, but worth watching the end of the call if you want the latest on VT 🌳",
        "created_at": "2023-03-30T15:35:53.272000+00:00",
        "attachments": null
    },
    {
        "author": "pandapip1",
        "category": "general",
        "parent": "",
        "content": "Quick question: is there any new way to try to get a Core EIP CFI'd, or is there still only the meta thread?",
        "created_at": "2023-03-30T15:51:34.505000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "We make the decision for CFI on the call, and use the thread (+ACD agendas) for signalling which ones should are proposed",
        "created_at": "2023-03-30T15:51:51.436000+00:00",
        "attachments": null
    },
    {
        "author": "pandapip1",
        "category": "general",
        "parent": "",
        "content": "Hm... what if I always seem to have a conflict with an ACD call?",
        "created_at": "2023-03-30T15:52:10.719000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Unfortunately, the sync calls are where most \"final\" decisions happen. I agree that's not ideal, but it's unlikely to be something we change for this fork (although I would like us to gradually be more async, hence the use of EthMag for parts of the process now!). \n\nIn the past, people in that situation have tried to find someone who can champion their EIP on the call. Also, if you can make it for part of a call, but not the whole thing, I can make sure we timebox a specific time for you!",
        "created_at": "2023-03-30T15:54:09.186000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "PR to make 6780 CFI: https://github.com/ethereum/execution-specs/pull/741",
        "created_at": "2023-03-30T18:26:15.621000+00:00",
        "attachments": null
    }
]