[
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "I'll ask here, I guess -- one point I'd like to see clarified as well, maybe it's just my misunderstanding, but is the claim closer to:\n- blob space is filling up, and it's constraining growth of L2's and other blob users, and it would be better for Ethereum if this constraint were lifted, but it's a gradual process either way, and such growth just somewhat slows or stalls for a while, until blob space is increased (by any means, deliberately leaving aside the specific mechanism(s)); or\n- it's more akin to the over-staking concerns people bring up, where there's a mechanism where Ethereum without sufficiently increased blob space flips into a stable but undesireable equilibrium difficult to escape, where resuming growth of blob usage is actively more difficult than it would be if it'd been continued sooner?",
        "created_at": "2024-09-27T00:00:32.423000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "i'm not even conflating this issue with anything other than solo stakers being able to manage their bandwidth, and managing the risk of missing proposals. for nearly zero profit.",
        "created_at": "2024-09-27T00:48:05.311000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Yes, I agree with that concern. Looking for the perspective of one of the many people who have been vocal about the urgency of blob space increase being a must.",
        "created_at": "2024-09-27T00:50:05.259000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "As in, what is the scenario being protected against here.",
        "created_at": "2024-09-27T00:50:28.615000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "I've asked it already, do we want geographically dispersed solo stakers, or do we not? to me if we want them, then they need to still be able to locally publish and succeed.",
        "created_at": "2024-09-27T00:51:27.321000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Yes, and the (generic) counterpoint is, no, Ethereum just has to have increased blob space, and that's a priority, and et cetera.\n\nOk. So say it doesn't happen, nothing happens in Electra, maybe nothing happens in Fusaka. What's the fallout and how durable is this fallout (e.g., is it that blob space usage doesn't grow, and then it starts growing again when economically accessible blob space capacity increases, or does Ethereum get stuck in everyone going back to calldata indefinitely, or Ethereum just dies in the meantime, or ...)?",
        "created_at": "2024-09-27T00:54:03.207000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "we basically require ePBS ASAP if we want everything all at once",
        "created_at": "2024-09-27T00:54:37.173000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "like, yesterday ideally",
        "created_at": "2024-09-27T00:54:54.206000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "but local builders would still be hosed",
        "created_at": "2024-09-27T00:55:36.479000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "i'm not sure how increased blob space doesn't hose solo stakers with poor bandwidth",
        "created_at": "2024-09-27T00:56:06.833000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Yes, indeed. Ok, look, I'll get more pointed about this. Maybe there is a reason that blob space must increase ASAP and if it doesn't, bad things happen and Ethereum cannot let the blob market increase in price, et cetera. But I haven't run across it, and until then the we-need-blob-target-and-max-increases now arguments look awfully handwavy.",
        "created_at": "2024-09-27T00:56:11.564000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "One concern is that when there was blob spam on mainnet and prices spiked, it became extremely difficult to get blob tx included at any price. The system just got clogged.  Some of that has been addressed by fixing a few things in clients but it makes me a bit nervous. (https://x.com/roberto_bayardo/status/1838986454216917174?s=46\u0026t=TbwFam2kmSTDdFt9ExHzWw - I htink the screen shot there is from somewhere on eth research).",
        "created_at": "2024-09-27T00:56:25.003000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Ok, _this_ is the kind of thing I'm looking for",
        "created_at": "2024-09-27T00:56:40.012000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "https://ethresear.ch/t/understanding-minimum-blob-base-fees/20489/2 is the post on eth research.",
        "created_at": "2024-09-27T00:57:28.688000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "this kind of issue is also exacerbated if blocks cant be produced by a percentage of the network (like solo stakers)",
        "created_at": "2024-09-27T00:57:45.256000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "because blobs are high AND blocks get missed",
        "created_at": "2024-09-27T00:58:07.569000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "\u003e One thing to note is that during the LayerZero spike, Base witnessed significant difficulties landing blob transactions, even with fees set well above what should have been required. We tracked it down to the way geth was handling blob transactions in its transaction pool.\n\nThat's a Geth bug, not a cryptoeconomics or mechanism issue, but, yeah, that would be a problem",
        "created_at": "2024-09-27T00:59:08.105000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "have people made testnets or devnets with deliberately high-priced blob markets to ferret out these issues?",
        "created_at": "2024-09-27T00:59:29.192000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "geth bug is still arguably a mechanism issue with a large % geth",
        "created_at": "2024-09-27T00:59:40.757000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Well, so set up a mechanism to find some of these issues (see above, devnet/testnet/kurtosis/etc)",
        "created_at": "2024-09-27T01:00:25.259000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Yeah definitely - it was a few things coming together in the first real world instance of congested blob space. By itself its not a \"we must have more blobs now!!!\" but it is why I'm nervous about not having any increases until after blob space is already congested.\nI'm also nervous about solo stakers not being able to produce blocks with full blobs. It's an unsettling morning all round really...",
        "created_at": "2024-09-27T01:01:26.815000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "it'll be informative to know how many solo stakers are in the same position honestly",
        "created_at": "2024-09-27T01:02:50.817000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "at 1 block per year some will not know for several months and assuming the right circumstances i guess",
        "created_at": "2024-09-27T01:03:19.404000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "And when other client bugs emerge, the response to them hasn't been change the protocol to work around them indefinitely/forever",
        "created_at": "2024-09-27T01:04:17.515000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "No, but I'm also not entirely sure it was just the client bug. Blob inclusion is kind of weird in general and the incentives aren't really lining up with the costs too well.  So I think there are also protocol problems here (not saying increasing the blob count isn't necessarily the solution to them).",
        "created_at": "2024-09-27T01:05:58.309000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "We were told that moving to POS was delayed multiple times because one of the golden goals of Ethereum was that not only would you be able to validate the chain with your home computer, but you'd also be able to sequence/stake on it. For a while after the merge we could, and with \"pretend ETH\" (since it wasn't even clear that it could eventually go out) we would fight with Ben Edington on wether Prysm or Teku included more attestations. By the time of the merge, even before it, when the beacon chain was actually going to stop being pretend ETH and be for real, we were told that you could still sequence the chain with your home computer, but you'd be better off sending blocks to sorcerers in the Dark Forest, these would cast spells and with magic reordering of transactions would get more value to your block. You can't compete with them cause they have transactions that your node won't even see... we were so told. Still some preferred to stick to their own building and trust that their local execution engine will pack the best transactions they could, in as much as they could from their local mempool so that they'd get their most profitable, censor free block out there. We are now turning yet another page and we are saying that we can't even fill our blocks in our home computers. That we have to leave some space out. At this point I ask: is this or is it not an admission that we have entrusted thus external, off-protocol, trusted entities, to fill our blocks? We are thinking on providing flags to users that can no longer fill their blocks to submit a second tier kind of block up to the network. To distort the effects of 1559 that may even lower the gas price of the next block thinking that the network is not in demand. We are allowing home stakers to not include a perfectly valid tx that paid enough fees. Two days ago this would be called clearly censoring. Now it's saving the homestakers? So I repeat, if we are in a position in which we are admitting to needing",
        "created_at": "2024-09-27T01:48:53.731000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "to outsource production to trusted off-protocol entities that have the means to actually fill the blockspace, why aren't we putting these entities in-protocol?",
        "created_at": "2024-09-27T01:49:05.444000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": ".. so the solution is 2 entities get to build blocks, and thats ok... I don't see your logic here at all. so we have all these clients and all this diversity, but lets just allow only 2 entites build a block because we don't care any more?",
        "created_at": "2024-09-27T01:52:54.506000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "perhaps there is an assumption i didn't realize in my comfort with this option... would simply reducing blob size (1/2?) so home stakers can more reliably propose over poor connections be an option?",
        "created_at": "2024-09-27T01:57:37.790000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Also worth asking if attempting to use a builder first and then falling back to the local EL made a difference here.  It tends to add a delay over just going straight to the local EL which would then make it harder to be included.  As builders push the limits of how long they can wait for one more MeV tx is that making the fallback more problematic?",
        "created_at": "2024-09-27T01:59:02.883000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "in the specific case i had mentioned the builder failed to provide a bid, so local building was used (relayer returned a 204).",
        "created_at": "2024-09-27T02:01:41.428000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "general",
        "parent": "",
        "content": "Do you prepare builder block and local block in parallel?",
        "created_at": "2024-09-27T02:07:23.789000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Quickly or after they timed out waiting for their block builders to respond?\nI mean, I suspect there's issues slinging lots of blobs around from a home node and we should be careful with that. But there's also a time cost to using an external builder which increases the likelihood of your block being reorged out (even when preparing the payloads in parallel).",
        "created_at": "2024-09-27T02:08:13.863000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "\u003c@504202741933932544\u003e will probalby correct me but yes i believe so, so it used local ultimately and did have not awesome peer count, but was attesting well\nIt looks like they started publishing quite early, like 1.1 sec into slot, which is much sooner than a lot would publish, so we're also working on bandwith solutions like allowing stakers to turn off flood publishing etc which would help also",
        "created_at": "2024-09-27T02:09:51.051000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "and in this case several of our nodes saw the block at around 2 seconds, but it was still reorged so the proposer clearly didnt i guess.",
        "created_at": "2024-09-27T02:11:52.193000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "general",
        "parent": "",
        "content": "Timing for proposal is tricky. How long is the timeout? Is the timeout coming from Teku or mev-boost? Does the relayer play a timing game there? If you timeout at the 3-second mark and then decide to use the local block, blocks can easily get orphaned, and this is independent of blobs. If you timeout at the 2-second mark, then it's probably fine. It depends on when you call `GetHeader`...",
        "created_at": "2024-09-27T02:12:02.389000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "so we'd seen the block body early, like 1.8sec, but at 5.8s into slot it looks like we gave up on the blobs as well",
        "created_at": "2024-09-27T02:13:36.950000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "so as a proposer following that i think its clear the reasoning, because the block cant be validated without having the blobs",
        "created_at": "2024-09-27T02:15:04.707000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "If all ELs implement:\nhttps://github.com/ethereum/execution-apis/pull/559\n\nWe wont have to artifically restrict blobs packed in by homestakers. It allows the block + commitments to be broadcasted out first. Peers who have the blobs in the EL mempool can simply process the block and not need to wait for the blob sidecars to appear in CL gossip taking care of users with constrained bandwidth",
        "created_at": "2024-09-27T02:45:37.818000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "general",
        "parent": "",
        "content": "The problem is if L2s switch to a private mempool",
        "created_at": "2024-09-27T02:48:10.799000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "general",
        "parent": "",
        "content": "(but it shouldn't prevent us from implementing this, it's a no brainer imo)",
        "created_at": "2024-09-27T02:48:56.863000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "I think this is fine, the only way L2s would use a private mempool is through builders or bigger validators. They have more than enough bandwidth to broadcast the blobs",
        "created_at": "2024-09-27T02:50:00.103000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "general",
        "parent": "",
        "content": "Yeah. The target audience is home building validators anyway",
        "created_at": "2024-09-27T02:51:18.340000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Given L2s are submitting data with the explicit aim of data availability, there's probably something wrong with the protocol if they need to use private mempools to get their transactions onchain.",
        "created_at": "2024-09-27T03:08:23.874000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "im definitely looking at that today, Sproul also pointed to that earlier...ty",
        "created_at": "2024-09-27T03:15:11.818000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "general",
        "parent": "",
        "content": "\u003c@680234424037670912\u003e just want to confirm — the issue, to your knowledge is purely about bandwidth and not computing the proofs/preparing the blobs?",
        "created_at": "2024-09-27T06:24:23.586000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "in this case yes i believe so, the block proposer had pushed and it took us about 300ms to see the block, but one of our teku nodes at least couldnt get the data and gave up at about 5.8 seconds into the slot.\nNeed more specific misses to look through with logs... other nodes must have seen the blobs to pass the block on, otherwise the block would have failed validation... im assuming the following proposer didnt see the blobs or potentially reorged it out. \nAnd this is obviously front of mind from looking, i dont' know quantitatively how many misses look similar to this, or even how we'd know unless ppl report them... something like a block following a miss has 6 blobs or something may be helpful? Im not sure..",
        "created_at": "2024-09-27T06:44:22.358000+00:00",
        "attachments": null
    },
    {
        "author": "holgerd77",
        "category": "general",
        "parent": "",
        "content": "Thanks guys for having this discussion/exchange! 🙏👍🙂",
        "created_at": "2024-09-27T06:49:52.102000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "general",
        "parent": "",
        "content": "I had the same conviction: this my analisys of what happened: https://hackmd.io/@dsjdqQDBRp66btjRzfxjbw/r1OuFG7AA",
        "created_at": "2024-09-27T07:45:45.634000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "403 🙂",
        "created_at": "2024-09-27T07:50:01.970000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "general",
        "parent": "",
        "content": "ok let me make it public, now is authenticated only",
        "created_at": "2024-09-27T07:50:32.868000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "Thanks ! have access now",
        "created_at": "2024-09-27T07:51:30.905000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "It seems the block was out pretty early at 1.1s, it took some nodes only 300ms to see it but blobs were seen several seconds later, do you have a node that had fully validated the blobs early? If so then the problem could be in propagation and not just uplink. If you don't know of a node that found the blobs early (given that the block was out at 1.1 blobs should have been disseminated by 3 seconds) then it points to uplink. Michael's proposal definitely should help here, and IDONTWANT would help in propagation. Hopefully those two are impactful enough",
        "created_at": "2024-09-27T09:14:37.506000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "Currently looking at idontwant, getblobs engine call, and not using flood publish (on by default though)… , sounds like this has had success with lighthouse so very hopeful that his can improve things  teku side.",
        "created_at": "2024-09-27T09:19:00.251000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "general",
        "parent": "",
        "content": "I have not found any node getting  all blobs on time. Moreover all nodes i saw ended up importing it before the next block (and then get reorged). This strengthen the idea that the problem was the proposer uplink bandwidth.",
        "created_at": "2024-09-27T09:25:19.651000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "\u003c@504202741933932544\u003e do we know how many peers the homestaker's node was connected to?",
        "created_at": "2024-09-27T09:48:12.776000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I had the same conviction: this my",
        "created_at": "2024-09-27T09:50:24.456000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "general",
        "parent": "",
        "content": "60",
        "created_at": "2024-09-27T11:03:32.214000+00:00",
        "attachments": null
    },
    {
        "author": "pawandhananjay",
        "category": "general",
        "parent": "",
        "content": "we have disabled flood publish by default for more than 6 months now and haven't seen any latency issues.",
        "created_at": "2024-09-27T18:30:44.643000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "oh interesting! Thanks for sharing!",
        "created_at": "2024-09-27T19:38:23.969000+00:00",
        "attachments": null
    },
    {
        "author": "francis.li",
        "category": "general",
        "parent": "",
        "content": "Hello coredevs, this is Francis from Base team, I'd love to kick off a thread here to gather your opinions on what are the exact metrics that you would love to see to convince you that a `blob max increase` is safe and reasonable.\n\nI'll try my best to tag people on each clients, but please feel free to include whoever you think is relevant into the discussion! Please let us know\n\n1. If you would support a blob max increase or not\n2. If not, what would be your concerns and\n3. If there are any set of metrics or changes (EIPs) that could alleviate your concerns\n\ncc: \u003c@898563924440543283\u003e \u003c@552133098075193354\u003e \u003c@539495253418180618\u003e \u003c@415548822983278593\u003e \u003c@555483069038198827\u003e \u003c@792404665068158998\u003e \u003c@199561711278227457\u003e \u003c@607055410104500244\u003e \u003c@491624610215886849\u003e \u003c@363800010518822915\u003e \u003c@755590043632140352\u003e \u003c@476250636548308992\u003e \u003c@654267572107083777\u003e \u003c@792822129019584562\u003e \u003c@504202741933932544\u003e \u003c@543900561460822016\u003e \u003c@761154847432769577\u003e \u003c@628018527470616606\u003e \u003c@814151075601973278\u003e \u003c@122421399213047814\u003e",
        "created_at": "2024-09-27T22:31:03.355000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "I still want to understand the urgency of it (see my questions above: https://discord.com/channels/595666850260713488/745077610685661265/1289013773931384842)",
        "created_at": "2024-09-27T22:32:30.276000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "i.e. if it doesn't happen, then, what (from an Ethereum perspective) fails in a _permanent, durable_ way (not, just, well, when it's decided to be a priority then more blob space gets used again)",
        "created_at": "2024-09-27T22:33:38.820000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "the Geth bug referenced has been fixed as of 1.14.9 and other bugs can be systematically tested for by blob-spamming devnets/kurtosis networks",
        "created_at": "2024-09-27T22:34:07.314000+00:00",
        "attachments": null
    },
    {
        "author": "francis.li",
        "category": "general",
        "parent": "",
        "content": "I believe there are two main reasons:\n1. Increasing demand: both base (10 -\u003e 25 Mgas/s) and op (initial increase to 7.5Mgas/s) are planning to increase throughput in the next few months, and with the planned increase, current blob capacity will be exceeded soon\n2. As Vatalik mentioned here (https://github.com/ethereum/pm/issues/1153#issuecomment-2377002932), not only does the lack of extra blob space constrain existing rollups, it also stops new rollups that considered blobs but decided not to and moved to alt DA solutions.",
        "created_at": "2024-09-27T22:42:23.897000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Ok, point (2) in particular does help address this question.",
        "created_at": "2024-09-27T22:50:41.358000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "one aspect of this that has become clearer to me, is that the bandwidth constraint is very different than other resource constraints. Access to quality, commodity hardware is way easier to come by than access to quality infrastucture.  All things being equal, if I can trade bandwidth requirements for hardware requirements, i'll do it every time.",
        "created_at": "2024-09-27T23:31:43.550000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "Yes, this is an exactly good point and also one which I realized today. Getting more beefier hardware is much easier than getting a better connection. Especially in the sense of \"home staking\" where we really mean \"at home\", it is almost impossible to get a better connection, the only alternative is to move your node out-of-house and to a dedicated location with a good connection. (Slight side node: I do not support that the protocol needs extreme beefy hardware to validate, but I am assuming that this is the general consensus).\n\nSo, this means (and this is already being done on devnets) that not only performance benchmarks are a thing, but also the bandwidth consumption. I realized that this has been tested a lot in the past, but it is actually at this point I completely realize the importance of the bandwidth requirements 🙂",
        "created_at": "2024-09-27T23:42:11.099000+00:00",
        "attachments": null
    }
]