[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I'm not a fan of anything that restricts the set of people who are allowed to comment.",
        "created_at": "2024-08-04T05:53:20.840000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think there is value in moderating the quality of comments, but excluding classes of people feels like it is against the ethos of the Ethereum development process.",
        "created_at": "2024-08-04T05:53:43.187000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "My understanding is that one concern is to avoid creating an ad-hoc additional space where commenting might happen that effectively becomes in addition to, not instead of, and becomes additional context in one more place which needs to be checked. So, disallowing commenting entirely (for everyone, aside from the person who posted the summary) is consistent with this idea. It's not \"restrict[ing] the set of people who are allowed to comment\", because that's already an empty set.\n\nI don't have a strong view on this, but given that ACD calls tend to mix topics which are already under written discussion elsewhere, I do see the point in ensuring that people who want to continue that discussion (anyone at all) find the original location(s) of such discussions, rather than adopting some ACD-related place",
        "created_at": "2024-08-04T06:15:05.512000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Yeah, I am fine with this generally speaking.  I was arguing against the suggestion that \"anyone can read forum section in ethmagicians where **you can only write if you're a client dev**\".",
        "created_at": "2024-08-04T06:17:36.269000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It creates a privileged class of people who can participate, while the general public cannot.",
        "created_at": "2024-08-04T06:18:18.171000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It also means there needs to be some process in place to determine who is part of the privileged class, which needs to be able to change over time.",
        "created_at": "2024-08-04T06:18:41.168000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2024-08-04T17:55:55.817000+00:00",
        "attachments": null
    }
]