[
    {
        "author": "protolambda",
        "category": "general",
        "parent": "",
        "content": "Created a new EIP to fix a use-case that I believe will be broken by EIP-3074 and was not previously considered to be broken (as far as I am aware): https://ethereum-magicians.org/t/eip-7664-access-key-opcode/19395   (edit: EIP 7664)",
        "created_at": "2024-03-28T07:07:12.488000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "ACDE in ~20 minutes (14:00 UTC)\nAgenda: https://github.com/ethereum/pm/issues/982\nStream: https://youtube.com/live/cSQmbCVwGUk\nZoom: https://ethereumfoundation.zoom.us/j/91348592283?pwd=SnRnL1VTeXNYVE9CaWpBbnJEUXhQZz09",
        "created_at": "2024-03-28T13:40:10.567000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "ACDE 3/28",
        "created_at": "2024-03-28T13:55:40.152000+00:00",
        "attachments": null
    },
    {
        "author": "garyrong",
        "category": "general",
        "parent": "",
        "content": "\u003c@243183686562873344\u003e regarding the point you had for 7610: it might be possible someone finds the hash collision and re-deploy contract code on the address which we discard the storage during the transition. But actually we have more than 10m accounts eligible for deployment(nonce=0, nil runtime code). So I don't think it's an issue.",
        "created_at": "2024-03-28T14:53:51.621000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "can we moderate the chat for high signal ^^",
        "created_at": "2024-03-28T15:21:48.971000+00:00",
        "attachments": null
    },
    {
        "author": "littlemountainman",
        "category": "general",
        "parent": "",
        "content": "is there a better channel to ask?",
        "created_at": "2024-03-28T15:22:08.652000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "RE: ILs interplay with EIP-3074 and other things..I read a couple times that ePBS solves this. Totally open to that, could we get a nuanced double click on it? Culturally would be good if we steered towards bulletpointed pros/cons/\"nfw\"-type conversations, because \"X solves Y\" is hard to parse and makes the conversation hard to have..",
        "created_at": "2024-03-28T15:28:34.268000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "I did not get this entirely at the end, did we now CFI 3074 or not?",
        "created_at": "2024-03-28T15:34:54.560000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "general",
        "parent": "",
        "content": "\u003c@543900561460822016\u003e I couldn't really explain the issue I'm seeing with 3074+value and blobs, so let's discuss here.\n\nBlob eviction is critical, and can be become a mempool DoS vector. You're right that 3074+value only makes the attack ~3x cheaper. However, if blob eviction DoS becomes an issue, mitigation becomes much harder.\n\nCurrently, if blob eviction DoS becomes an issue, nodes can add restrictions on replace-by-fee evicting a blob. E.g. require a much higher replacement fee when there's a pending blob. The attack can be mitigated without a hardfork.\n\nHowever, once 3074 is in, there is no easy way to detect an evicting tx other than simulating all transactions to detect AUTHCALLs that drain EOAs with pending blobs.\n\nWhat would be our strategy for preventing mass blob eviction, with 3074+value enabled?",
        "created_at": "2024-03-28T16:01:17.044000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "general",
        "parent": "",
        "content": "Another related issue is that the mempool doesn't associate the EOA that sends the AUTHCALL transaction with the EOA that sends the blob, so the 2x fee increase doesn't apply.  Wouldn't it be possible to amplify blob eviction attacks with something along these lines?\n- Propagate a blob from EOA1\n- Replace it with a different one at 2x fee.  Repeat until we're close to the next block time.\n- Frontrun with an AUTHCALL transaction from EOA2 which drains EOA1.\n\nEOA2 pays a reasonable fee since it is unaffected by the multiple 2x increases in EOA1.\nEOA1 never pays anything since its last blob gets excluded by EOA2.\n\nCan we somehow make this attack more expensive and associate EOA2's fee with EOA1's without simulating every transaction?",
        "created_at": "2024-03-28T16:01:57.434000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "I don’t understand what you mean by “nodes can add restrictions on replace-by-fee”. If the node gets a new block which includes several txs who invalidate pending blob txs, they aren’t going to reject the block. So this is the worst case. I don’t think 3074 changes this basic attack- it simply makes it cheaper to execute.",
        "created_at": "2024-03-28T16:27:09.154000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "Again, you can do this today if you work with the block producer for the next block",
        "created_at": "2024-03-28T16:28:41.243000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "Can 4337 do this too?",
        "created_at": "2024-03-28T16:35:28.738000+00:00",
        "attachments": null
    },
    {
        "author": "alexf5200",
        "category": "general",
        "parent": "",
        "content": "Did I understand correctly that without EIP-3074, the \"cheap\" replacement (without EOA paying x2 replacement gas fee) of a `Type 3 transaction` with `value transfer transaction` can only be made by a block builder that **ignored** the replacement rule either maliciously or by mistake; but invalidation of a `Type 3 transaction` with an `AUTHCALL opcode` can happen anytime at any gas price in any transaction in a block, so even an altruistic block builder would include such a transaction, and that would be a bad thing?",
        "created_at": "2024-03-28T16:45:28.375000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "Yes the block builder would either i) somehow not have seen the blob tx over p2p or ii)  allow for eviction-by-simple-replacement (either by mistake or otherwise).\n\nWith 3074 it is easier to orchestrate this attack, because a block builder will not know statically whether a tx is going to use 3074 or not.",
        "created_at": "2024-03-28T16:56:16.988000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "Is this a bad thing? Maybe in the short term. But in the medium term, as we increase the blob throughput, we will have to have a very different design for blob tx pool. It defeats the purpose of DAS / danksharding if we're just propogating all the pending blob txs. At that point we should just keep downloading the full blocks!",
        "created_at": "2024-03-28T16:58:22.238000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE Recap**\n\n- The Prysm team gave an overview of the missed slots situation over the past few days. It seems to have been caused by an issue in the bloxroute relay. The conversation will continue on the mev-boost community call and hopefully a postmortem will be shared. \n- The Reth/Paradigm team presented their state growth research (https://www.paradigm.xyz/2024/03/how-to-raise-the-gas-limit-1), and emphasized the relative importance of history growth. General agreement that we should continue the work on 4444 \u0026 out-of-network historical data serving. You can follow the conversation in \u003c#953349957400821860\u003e \n- We agreed to move forward with the two retroactive EIPs (7523 \u0026 7610). I'll draft a Meta EIP to document our growing list of retro EIPs. If anyone from Gnosis Chain is reading this, you should review 7523! \n- Dencun EIPs need to be moved to Final. This PR tracks all of the individual EIPs: https://github.com/ethereum/EIPs/pull/8334 --- \u003c@415548822983278593\u003e \u003c@555483069038198827\u003e \u003c@543900561460822016\u003e \u003c@203220829473996800\u003e there is still an open PR for 4844. Aside from that, everything looks ready to merge! \n- **Pectra EIP updates:** re: 2537 gas costs, Marius shared a doc above with benchmarks. Reth team said they will also run benchmarks soon, and the EIP champions will look into the necessity of subgroup checks for non-pairing operations. \n- **Pectra Candidates updates:** we spent most of the call going over updates for potential Pectra EIPs. I won't recap each one here, but we covered nearly everything and agreed to make decisions about the Pectra scope next call. \n- **Client teams:** please review the list of candidate EIPs before the next ACDE (https://ethereum-magicians.org/t/pectra-network-upgrade-meta-thread/16809#other-pectra-proposals-2) and be ready to voice your preferences for what to include alongside what's already in. \n- **EIP Champions:** if you have more updates, please share them in writting ahead of the call so client teams can review.",
        "created_at": "2024-03-28T17:25:56.419000+00:00",
        "attachments": null
    },
    {
        "author": "drortirosh",
        "category": "general",
        "parent": "",
        "content": "It is not \"easier\" to make the attack with 3074: it makes it impossible to prevent the attack, unless you simulate each transaction, to make sure it doesn't attempt to invalidate (drain) the sender of a blob.\nThe main principle of a decentralized mempool is a bounded small validation that a tx pays for its inclusion (or replacement)\nWith this seemingly naive change (allow eth transfer in 3074) it now requires full simulation of each tx while building a block.",
        "created_at": "2024-03-28T17:48:15.593000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "general",
        "parent": "",
        "content": "I'm not talking about block propagation and rejecting the block. I mean DoS against the mempool nodes.  Revoking pending blobs cheaply (not paying 2x for each revocation) could lead to mempool liveness issues.\nWhen I say \"nodes can add restrictions\", I mean that if the mempool is attacked by a large number of blob revocations using EOAs that replace-by-fee their blobs, we could change the nodes' txpool strategy not to accept these replacements.  With 3074, we won't be able to mitigate since it's impossible to know statically whether a transaction from some other EOA is going to invalidate blobs by other EOAs.",
        "created_at": "2024-03-28T18:00:12.580000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "general",
        "parent": "",
        "content": "btw I'm seeing some of these in geth today:\n`Dropping overdrafted blob transactions   from=0x716F22b1E70761830B22Bc7fd76f77401bFD3446 balance=303,276,657,831,000    spent=33,744,358,303,918,768  drop=\"[16 15 14 13 12 11 10 9 8 7 6]\"         ids=\"[268438015 268437963 268437921 268437890 268437868 268437849 268437838 268437803 268437770 268437601 268437556]\"`\n\nAre these transactions that can no longer pay for the blob, or does it mean something different?",
        "created_at": "2024-03-28T18:01:39.466000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "general",
        "parent": "",
        "content": "You could attack **once** using the next block producer.  But doing this repeatedly is harder.  With 3074 it could be done via the mempool since builders don't have an easy way to statically detect that a transaction invalidates some blobs.",
        "created_at": "2024-03-28T18:03:04.703000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "general",
        "parent": "",
        "content": "You mean invalidating blobs?  It can't.  And 3074 also couldun't until a few days ago, when it added `value`.  With `value` in AUTHCALL you can invalidate a pending blob.",
        "created_at": "2024-03-28T18:04:55.684000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "general",
        "parent": "",
        "content": "Hey guys, we've observed significantly more reorgs on the mainnet due to the increased arrival times of blocks and blobs, which have risen to 3.5s. This time marks when the Prysm node completes its p2p validation, previously avg 2s",
        "created_at": "2024-03-28T18:06:24.475000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2024-03-28T18:06:32.824000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "Screenshot_2024-03-28_at_11.01.33_AM.png",
                "content": "a8eb7cc85fc50be5fcea162d4df254d3d99b7f9ce06d9c20faebee946127fee6"
            }
        ]
    },
    {
        "author": "terencechain",
        "category": "general",
        "parent": "",
        "content": "Daily reorg increased 2.5x more",
        "created_at": "2024-03-28T18:06:43.033000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2024-03-28T18:06:48.913000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "Screenshot_2024-03-28_at_11.02.38_AM.png",
                "content": "66caf18620f6e913ad9409db644b79b5c39c62a15b66ba3303b9989b9cc61c6b"
            }
        ]
    },
    {
        "author": "yoavw",
        "category": "general",
        "parent": "",
        "content": "These invalidations already seem to be happening all the time now:\n```\nexecution-1  | 2024-03-28T18:03:49.420303182Z WARN [03-28|20:03:49.420] Blob transaction swapped out by signer   from=0xc37743E5702545a35dD986e3D8a1D316a04ff0cE nonce=0       id=268,436,989\nexecution-1  | 2024-03-28T18:03:49.420325716Z WARN [03-28|20:03:49.420] Dropping overdrafted blob transactions   from=0xc37743E5702545a35dD986e3D8a1D316a04ff0cE balance=397,213,210,632,000    spent=17,511,197,519,459,276  drop=\"[6 5 4 3 2 1]\"                          ids=\"[268444506 268442183 268441946 268441827 268439312 268437119]\"\n```\n\nWon't it become a bigger issue for block builders when detecting overdrafted blob transactions will require checking after every transaction rather than just from the same EOA?",
        "created_at": "2024-03-28T18:11:21.960000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "What if 3074 required a new tx type that included a list of addresses that could be `authorized` by `AUTH`  (and the `AUTH` opcode would check this list which could be added as a `allowed_authorized` context variable)?  Then any blob txs from sneders in the authorized list could be evicted from your mempool on receipt of such a tx.  Though perhaps the list needs to include the full `r/s/yP/commit` to prevent crafting fraudulent authorized lists to force eviction of competing blob txs..\n\nAlso should this 3074 discussion be moved elsewhere?",
        "created_at": "2024-03-28T18:31:20.316000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "general",
        "parent": "",
        "content": "That would solve the issue and make these transactions detectable statically, if it's enforced on chain (AUTH failing if the address is undeclared).  Blob eviction would then occur only if the auth transaction pays the 2x fee as if it was sent by the EOA of the evicted blob(s).\n\nYes, we could move this discussion to the \"future EOAs\" channel. Although the implication on blobs may be of interest for core devs who don't follow that channel.",
        "created_at": "2024-03-28T19:06:35.220000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "I'm saying block propagation already allows you to do the worst case attack you're describing. How does 3074 change this beyond making it cheaper?\n\nToday: you can replace-by-fee a bunch of blob txs over and over during the slot and then sweep all the accounts by producing a block with standard transfer txs.\n\nWith 3074: you can replace-by-fee a bunch of blob txs over and over during the slot and then sweep all the accounts by sending a tx which uses 3074 over the standard tx pool.\n\nIn both cases, the attacker forces a lot of blob tx propagation without paying for the blob.",
        "created_at": "2024-03-28T19:44:31.105000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "If the 3074 case is so detrimental to the network, I think while building a block we can check during a 3074 tx if the auth is coming from an account with a pending blob tx. There isn't much reason to do this in the first place, the builder can quit execution of the tx, include the blob tx and then ban the addresses the txpool for a period of time",
        "created_at": "2024-03-28T19:47:57.177000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "general",
        "parent": "",
        "content": "Both are equally bad if they happen, but the former is more expensive and requires building the block, whereas the latter just requires propagating a transaction to the mempool.  Doing it once as a block builder is easy, but sustaining the attack requires building every block.  Whereas sustaining it with 3074 is a matter of sending one transaction per block to the mempool",
        "created_at": "2024-03-28T19:48:08.227000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "I think there are plenty of mitigation techniques. Plus, as I said earlier, the blob txpool design needs to be rethought as we increase the scale. We can't propagate every pending blob tx to every node",
        "created_at": "2024-03-28T19:49:13.067000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "general",
        "parent": "",
        "content": "In that case, wouldn't it be a DoS vector against builders?  Send many high-gas transactions that perform a blob-invalidating AUTH towards the end of execution.  All of these transactions will have to be dropped by the builder, after executing them.",
        "created_at": "2024-03-28T19:49:38.937000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "general",
        "parent": "",
        "content": "For sure - we need to think about blob propagation.  3074 just makes it more urgent since it needs to be fixed ahead of inclusion",
        "created_at": "2024-03-28T19:50:28.092000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "Yeah it isn't great for builders",
        "created_at": "2024-03-28T19:51:40.316000+00:00",
        "attachments": null
    }
]