[
    {
        "author": "rudolf6",
        "category": "general",
        "parent": "",
        "content": "As mentioned on ACD re the quantum computing discussion: i'm helping organize a small, informal effort to: (i) better understand timelines/progress from experts in the field, (2) map out in-protocol components affected/high-level mitigation strategies. This is mostly intended as an educational exercise to start, and to perhaps serve as an input in other long-term cryptography decisions down the road. I think most agree it's not an urgent issue, but the goal is to at least better understand the landscape for now  😅\n\nIf anyone has already spent time thinking about this or would like to assist, please ping me. Will move the conversation over to \u003c#800773302213279784\u003e  going forward.",
        "created_at": "2024-08-02T07:58:45.751000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "ethereum/pm?",
        "created_at": "2024-08-02T09:44:40.275000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "general",
        "parent": "",
        "content": "following up with what we discussed in the last ACD, I opened https://github.com/ethereum/consensus-specs/pull/3864 it is less important as a change (tiny one) more to start a discussion over the potential consequences",
        "created_at": "2024-08-02T13:25:57.141000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "Oh, I think I might like this place better than magicians (or just do both)",
        "created_at": "2024-08-02T20:56:19.163000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "formerly-known-as-Twitter tends to be behind a login-wall and seems sometimes subject to arbitrary management whims. Discord's archive/search ability is flaky at best and also is behind a login-wall to even view. So of the initial three options, magicians was the most reasonable one. But yeah, ethereum/pm also satisfies these criteria",
        "created_at": "2024-08-02T21:32:20.514000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "Yes, the login wall is a no-go for me 🙂 EthMagicians or GitHub both seem fine to me, but maybe GitHub a somewhat more logical / centralized ( 😬 ) place, and magicians a more logical place to also allow async discussions. So I'm not sure where my preference would go 😅",
        "created_at": "2024-08-02T21:35:40.404000+00:00",
        "attachments": null
    }
]