[
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "**ACDC 135 summary**\n\nWe began with some announcements:\n* Migration of the Kurtosis `ethereum-package`, see details here: [Consensus-layer Call 135 · Issue \\#1069 · ethereum/pm](https://github.com/ethereum/pm/issues/1069#issuecomment-2161051815) and be sure to upgrade your infra!\n* Request to review [Add EIP: Network Upgrade Inclusion Stages by timbeiko · Pull Request \\#8662 · ethereum/EIPs](https://github.com/ethereum/EIPs/pull/8662) to add more refinement to different senses of “CFI” in core dev governance\nThen discussed Electra `devnet-1` from the CL side:\n* Agreed to [merge this PR](https://github.com/ethereum/consensus-specs/pull/3768) into the `devnet-1` specs, which refactors the attestation layout following EIP-7549 and has implications for the SSZ merkelization of this type\n* Client teams agreed to target `v1.5.0-alpha.3` of the consensus specs for `devnet-1`. Be on the look out for release soon(tm)!\n* Wrapped this segment with some rough timelines on `devnet-1` readiness, most clients seemed to think a couple weeks after the specs release is all that would be needed to get an implementation ready, which means we can keep Pectra moving along 🎉\nAnd then moved to PeerDAS work:\n* Started by calling out [this PR](https://github.com/ethereum/EIPs/pull/8649) to move PeerDAS to formal inclusion in Pectra to reflect client intent, even if PeerDAS is developed separately from the “core” Pectra set.\n* Next discussed how to proceed on PeerDAS development given that we want to work in parallel to the other Pectra work; PeerDAS implementer’s agreed on the PeerDAS breakout call #1 to implement PeerDAS on top of Deneb for the time being, to minimize thrash with Pectra changes as the core EIP set is still in the process of stabilizing. The intent is to rebase PeerDAS on top of the Pectra changes once it is clearer that the other Pectra EIPs have stabilized, ideally over the next few Pectra devnets.",
        "created_at": "2024-06-14T00:13:52.042000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "We then turned to raising the blob count in Pectra:\n* The intent is to raise the blob count to provide an increase in Ethereum’s data throughput in the upcoming hard fork.\n* However, there are a few complications:\n  * Preliminary analysis shows turbulence at the current blob count.\n  * PeerDAS handles blob data differently than today’s EIP-4844 mechanism, which unlocks further scale but makes it hard to compare the blob count today to a blob count under Pectra.\n* In light of these facts, there are a variety of opinions on how to raise the blob count in Pectra; including: increasing the blob count even without PeerDAS, increasing the blob count with PeerDAS, or simply deploying PeerDAS and leaving the blob count alone. Analysis of the future Pectra devnets should give us more confidence in the right approach — check the call for the full nuance here.\n* We also covered a proposal to uncouple the blob count, which currently is set independently on the EL and CL (yet has to match); there is an [initial PR here](https://github.com/ethereum/consensus-specs/pull/3800) that has the CL drive the blob count but discussion on the call raised a few more questions to do this safely. We also discussed how to handle the change in the blob base fee when the blob count changes. In short, expect some possible changes in how blob accounting is carried out in Pectra.\nWe concluded with a [great update](https://github.com/ethereum/pm/issues/1069#issuecomment-2162556692) on the SSZ-ification of the protocol (expect to see a devnet by the next CL call), and a call-out to determine the name of the “F-star” for the next CL fork to accompany Osaka on the EL.",
        "created_at": "2024-06-14T00:13:54.366000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "see above 🙂",
        "created_at": "2024-06-14T00:14:26.305000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Did anyone on the call challenge increasing the blob count on the grounds that it will decrease competitiveness of home stakers?  This was discussed in some of the threads here, but I don't see it mentioned in the notes above and I worry that the issue could easily be swept under the rug.",
        "created_at": "2024-06-14T03:04:37.173000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "yes, more or less, not in those exact words, but it was acknowledged",
        "created_at": "2024-06-14T03:14:01.694000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "it's the subtext of why couple PeerDAS with the blob increase in the notes",
        "created_at": "2024-06-14T03:14:26.738000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "listen to the call and it becomes text",
        "created_at": "2024-06-14T03:14:46.324000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Hmm, I thought the home staker problem of increasing blob count wasn't resolved until ePBS (where stakers no longer need to be able to build locally)?",
        "created_at": "2024-06-14T03:24:20.062000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "well, the specific part of this discussed was bandwidth-related",
        "created_at": "2024-06-14T03:28:16.589000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "so anything outside of that scope, no, wasn't really brought up in an explicit way",
        "created_at": "2024-06-14T03:28:39.211000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "That would be referring to the same problem, our earlier discussion was on bandwidth constraints making it difficult for local block building for home stakers",
        "created_at": "2024-06-14T03:34:24.064000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "How does PeerDAS solve the bandwidth problem home stakers face with more blobs?  (Note: I haven't followed PeerDAS basically at all, so the answer may be obvious)",
        "created_at": "2024-06-14T03:53:00.893000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "peerDAS reduces the amount of data both a non-staking node and a staking node(up to a certain limit) will have to custody. Currently all nodes have to process and store all the blobs being propagated, with peerdas a node would just have to process and store a subset of them. With just the current blob count, bandwidth consumption (upload and download) would be reduced by a non-trivial factor for most nodes.",
        "created_at": "2024-06-14T03:57:57.309000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "The main issue is local block building as you have to propagate all the data",
        "created_at": "2024-06-14T03:58:48.738000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "How does PeerDAS affect the network's resilience to a network split?  At the moment, the theoretical minimum number of stakers required for an honest fork to *eventually* finalize the honest chain is 1 (though finalization will be excruciatingly slow and painful, it would eventually happen).  If not all nodes have all data, then it seems that the number of stakers required to recover an honest minority chain will be substantially higher.",
        "created_at": "2024-06-14T04:00:15.264000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If so, that is a significant change, going from a 1/n honest staker assumption to an x%/n honest staker assumption.",
        "created_at": "2024-06-14T04:01:35.180000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "\u003e  At the moment, the theoretical minimum number of stakers required for an honest fork to eventually finalize the honest chain is 1\nI dont think this can happen in practice, the honest staker would be constantly penalized due to the huge amount of missing slots. Eventually it would be ejected from the chain",
        "created_at": "2024-06-14T04:03:11.297000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "for the case you are describing with only 1 honest validator it doesn't really matter becasue if you are simply builiding your own fork, you will have all the data",
        "created_at": "2024-06-14T04:04:54.115000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Hmm, stakers get punished when *other* slots are missing?",
        "created_at": "2024-06-14T04:05:20.465000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The 1 honest participant wasn't planning on forking, the rest of the stakers forked away from them without warning.  So the 1 honest participant has whatever information they happened to have at the time of the split.",
        "created_at": "2024-06-14T04:05:43.143000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "For a staker to not be punished, it needs its attestation included in a block so that it is accounted for in that epoch's votes. If you have 1 honest validator out of 1 million due to shuffling you might only get a block every few months.",
        "created_at": "2024-06-14T04:07:03.672000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "This works if you have 32 validators and 1 of them want to fork away",
        "created_at": "2024-06-14T04:07:34.566000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "not with 1 million",
        "created_at": "2024-06-14T04:07:40.272000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Has anyone done any analysis to calculate the minimum number of honest nodes required to maintain a fork (today)?",
        "created_at": "2024-06-14T04:07:56.994000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "at some point it doesn't really matter for network purposes if that validator is honest, the network is not. if the network is otherwise idle, that's one thing, but if enough other validators insist on other forks, it can be possible not to reconverge",
        "created_at": "2024-06-14T04:08:13.966000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Anyone running a validating node would be following the honest fork, so the number of stakers on the dishonest forks would be inconsequential to validating nodes as honest validating nodes on the network would simply ignore them.",
        "created_at": "2024-06-14T04:09:50.166000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "But I can accept that \u003e1 may be necessary today, and I would like to know what the actual number required is to eventually recover (regain finality) on an honest minority fork.",
        "created_at": "2024-06-14T04:10:37.038000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "With that, we can then answer the question of \"are we increasing the honest minority assumption with PeerDAS?\"",
        "created_at": "2024-06-14T04:10:53.814000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "there might have been some analysis done previously on non-finalization and how balances would decrease before it finalizes again. However can't remember where the doc is at off the top of my head",
        "created_at": "2024-06-14T04:11:01.670000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "I guess I'm not sure what definitions you're using here? The other structure does matter -- if the network finalizes on something else (which, yeah, isn't the scenario you describe, but generically fits in the honest/dishonest validator question range) it really does not matter what the honest validators did. They don't define the chain anymore",
        "created_at": "2024-06-14T04:12:11.984000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "but yes, if the premise is that the network has not otherwise finalized, agree",
        "created_at": "2024-06-14T04:12:29.190000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "the point though is that one cannot simply narrowly focus on the one \"honest\" validator and ignore the rest of the network",
        "created_at": "2024-06-14T04:13:32.996000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Oh, I disagree 100% on this!  The finalized chain doesn't define Ethereum, the honest ruleset defines Ethereum.  If you can finalize an invalid chain, that doesn't make your chain valid by fiat.",
        "created_at": "2024-06-14T04:14:01.399000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "hm, okay, that's the definitional answer I was looking for",
        "created_at": "2024-06-14T04:14:16.755000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "I don't regard it as super operationally useful, but it's one I at least understand where you're coming from",
        "created_at": "2024-06-14T04:14:45.343000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This is exactly why the majority client problem is so bad.  If Geth finalizes a bug, that doesn't make the bug valid, it just means everyone running a Geth validating node will incorrectly consider the Geth chain valid when in reality it is not.",
        "created_at": "2024-06-14T04:15:56.998000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "(and I want to be careful not to necessarily say this other chain is \"valid\". That means something specific to me)",
        "created_at": "2024-06-14T04:16:00.256000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I don't mind switching to \"legitimate\" instead of \"valid\".",
        "created_at": "2024-06-14T04:16:26.828000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "ok, sure, this I agree with",
        "created_at": "2024-06-14T04:16:48.836000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "but at at point, one has jumped out of the technical consensus protocol into the social protocol",
        "created_at": "2024-06-14T04:17:45.120000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "a system is what it does, etc.",
        "created_at": "2024-06-14T04:18:18.398000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Anyone who is *correctly* running a non-super-majority client (as everyone is instructed to do) will correctly see the chain not finalize, and then eventually finalize once the buggy/dishonest super-majority stakers are leaked out.",
        "created_at": "2024-06-14T04:19:08.737000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I'm not sure whether I would call \"don't run a super-majority client\" to be part of the social layer or not, it is borderline in my eyes.  You need the social layer to figure out which client is a super-majority client, but once you start running a non-super-majority client you can then just let it do its thing unattended.",
        "created_at": "2024-06-14T04:20:17.270000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "That downtime (which it sort of would look like, even if technically the chain would be running) might be measured in months",
        "created_at": "2024-06-14T04:20:26.370000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Yep.  We definitely want to avoid it!",
        "created_at": "2024-06-14T04:20:38.279000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Some chains are designed to function well regardless of finality. Ethereum is not",
        "created_at": "2024-06-14T04:20:47.820000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "From a social mechanism design standpoint, it is absolutely critical that there is a credible threat of an honest/correct minority chain being legitimate and a dishonest/buggy super-majority chain being illegitimate.  It is that credible threat that gets users to run minority clients and hostile actors to not try to execute a super-majority staking attack.",
        "created_at": "2024-06-14T04:22:48.076000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Yes, agree, and I'll go with the \"legitimate\" phrasing here",
        "created_at": "2024-06-14T04:23:29.060000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If the threat of following \"the one honest staker\" is not credible, then the system becomes susceptible to stacking majority attacks.",
        "created_at": "2024-06-14T04:23:33.414000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This is why I am concerned about changes that may raise the \"honest minority\" size assumption up from what it is (such as by making it so not all nodes have all of the data required to recover the chain).  If today the chain can recover with say 10% of stake on a minority fork, but PeerDAS requires at least 20% (made up numbers), then we are changing the security properties of the chain by making it only require 80% of stake to compromise the network rather than 90% (again, numbers imaginary).",
        "created_at": "2024-06-14T04:25:15.984000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "As long as the validators who produce the blocks + data stay in the minority chain the assumption doesn't change. You would still have the data distributed to different peers but it becomes recoverable. \nIf you had every validator custodying 1 subnet, you would need just 64 validators to continue recovering and eventually justifying the chain. With validator custody this number is higher, so the amount of validators required to recover all the data is even lower",
        "created_at": "2024-06-14T04:33:49.494000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Does this assume even distribution of honest validators across subnets?  If there are 64 honest validators but two of them happen to be on the same subnet, wouldn't that mean one subnet was missing?  This sounds like a birthday problem, and you need relatively large (but not crazy) numbers to get to high confidence that the honest minority chain has at least one validator from each subnet in it?",
        "created_at": "2024-06-14T04:35:57.985000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "The distribution to your subnet is determined by your node id. As long as the node id for each node was randomly generated this distribution holds. I think its a fair assumption to assume that each node is randomly generating its network key (and therefore node id)",
        "created_at": "2024-06-14T04:38:42.085000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Yeah, so then I think this is the ~~birthday~~ coupon collector problem, and you would need significantly more than 64 honest validators to have high confidence that each subnet was represented by at least one honest validator.  If the internet is correct, then the number you need to achieve 99.9% confidence is ~700 (\u003chttps://www.wolframalpha.com/input?i=Plot%5BStirlingS2%5Bn%2C64%5D*64%21%2F64%5En%2C+%7Bn%2C+0%2C+1000%7D%5D\u003e).  Not terribly high, and getting to 99.99% only takes you up to ~850 validators required and 99.999% confidence requires ~1000 validators.",
        "created_at": "2024-06-14T05:05:21.915000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "That makes sense and is a reasonable number. Also the current number of validators required to sustain a honest minority fork without penalization for the honest validators would be 15625 with 1 million active validators. This is a much bigger number than that required for recovering all the data (15x)",
        "created_at": "2024-06-14T05:10:15.664000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Great news, thanks for doing the math on honest validator requirement!",
        "created_at": "2024-06-14T05:13:57.602000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "So right now we have a ~1.5% honest minority assumption, and PeerDAS has ~0.1% honest minority assumption.  So PeerDAS doesn't increase the honest minority assumption.  🥳",
        "created_at": "2024-06-14T05:16:01.822000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "Yeah this assumes that we produce at least 1 block every 2 epochs, so that honest validators do not get penalized. If we are fine with honest validators getting penalized but still being active and eventually finalizing the chain then this number would be smaller. That calculation becomes a lot more complicated though because you would need to do inactivity leak calculations for both honest and dishonest validators to see the threshold at which the latter do get exited and the former can start finalizing the fork.",
        "created_at": "2024-06-14T05:17:58.773000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I don't think ePBS changes this in any way isn't it?",
        "created_at": "2024-06-14T07:04:56.194000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I was going off of the statement here: https://discord.com/channels/595666850260713488/1248361514335731826/1248489833551368244 I don't know the details for why this would be the case.",
        "created_at": "2024-06-14T07:07:12.415000+00:00",
        "attachments": null
    }
]