[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "An advantage of going with an envelope instead of we removing these fields by hand is that it's hash friendly because of ssz",
        "created_at": "2024-07-24T00:42:19.465000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "And it shouldn't really be lots of changes in the current client's code",
        "created_at": "2024-07-24T00:42:47.030000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "\u003e I was wondering if we could consider using an envelope that contains the payload (and only this is sent to the EL for validation) and the container envelope has all the information that is necessary for the payload to be processed\n\nElectra payload container (https://github.com/ethereum/execution-apis/blob/main/src/engine/prague.md#executionpayloadv4) has all the information except for `expectedBlobVersionedHashes` and `parentBeaconBlockRoot` which should always be available. I am confused by the fact that withdrawal requests should be stored aside",
        "created_at": "2024-07-24T07:00:35.917000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "So the problem is that the Electra fields that are requests to the CL, need to be stored in the CL database as they are needed to process blocks, the remainder of the execution payload can be stored in the EL as it's needed by the EL. So it'd be nice if these requests are moved one level up from the Payload. In this case we would just replace the Payload by a hash, send it to the EL for validation and storage and we would keep the blinded block exactly as we do today",
        "created_at": "2024-07-24T09:28:58.976000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I see two problems here:\n1) CL has to store requests to process blocks, I believe that those requests can be pruned whenever a new checkpoint is finalized, I also believe that pruning legacy payloads is what CL clients do already as we have getPayloadBodies requests to aid pruning.\n\n2) Blinded block has to have requests in it. I am curious what kind of a problem it is? Performance or storage, or just the engineering complexity related to this shift?",
        "created_at": "2024-07-24T12:58:37.541000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "1) you need to process  older states typically for requests from syncing nodes so we can't prune these. \n2) It's the engineering complexity, we could in principle just take some parts of the payload that we are interested in, save them ourselves, but we would need to create new types and possibly hack everywhere where we use blocks in our state transition function to use these new types. By moving to an envelope we solve everything at no cost other than just simply repackaging the same information.",
        "created_at": "2024-07-24T14:02:36.103000+00:00",
        "attachments": null
    },
    {
        "author": "__kasey__",
        "category": "general",
        "parent": "",
        "content": "Maybe a dumb question or just not that important, but is there is any concern from builders about blinded blocks revealing which deposit and consolidation request txs are included? For instance if there is a known tx from a given account with a lower nonce than a deposit tx from the same account observed in the blinded block, you could be certain the lower nonce non-deposit tx was included?",
        "created_at": "2024-07-24T16:11:17.949000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "you would know that \"some transaction\" was included, not which tx.",
        "created_at": "2024-07-24T17:22:05.376000+00:00",
        "attachments": null
    }
]