[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "How much calldata is required to prove a block given a beacon root?",
        "created_at": "2024-04-12T04:36:53.603000+00:00",
        "attachments": null
    },
    {
        "author": "dapplion",
        "category": "general",
        "parent": "",
        "content": "For EIP-7002, we have to hard commit to a value of TARGET_EXITS_PER_BLOCK forever right? If we decide to lower the minimum activation balance in the future such that the maximum number of exits per unit of time increases, would that come to bite us?",
        "created_at": "2024-04-12T05:14:03.498000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "For EIP 7623, calldata increase, how do people think about it related to blob count? \u003c@273808422753796097\u003e \u003c@1126229231572094976\u003e",
        "created_at": "2024-04-12T08:37:07.012000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "No matter which value we choose (I think we should increase the TARGET), if there are any protocol changes that would require us to change these numbers (TARGET and MAX) we would have to redeploy a contract code. I suppose if we come up with values that are gonna work in a foreseeable future then we're fine. Should there be any significant changes to the protocol we accept the complexity and re-deploy the contract with the new numbers, it's gonna be a simple change to the contract and clients (switching to the new contract address) but more coordination/governance complexity",
        "created_at": "2024-04-12T10:14:49.267000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "\u003c@552133098075193354\u003e just pinged me about Reth's EOF progress, https://github.com/bluealloy/revm/pull/1143 \u003c@429719902363058177\u003e (who's OOO right now) has just merged it into Revm, in a backwards compatible way. I think this covers all/most of the EIPs? cc \u003c@403707149043105803\u003e. How can we help and be an asset to the rest of the eco here?",
        "created_at": "2024-04-12T15:54:11.664000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "Test case generation and fuzzing are the next steps.  my understanding is retesteth is being sunset in favour of execution-test-specs, but also that tests generated from execution-spec-tests create the same testing artifacts as retesteth did. a testnet is also a good step but until we can get solidity and vyper generated contracts it would be a fairly low volume testnet.",
        "created_at": "2024-04-12T15:57:51.305000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Who is the \"owner\" of test case generation, fuzzing, retesteth, execution-specs, execution-spec-tests and of devnets/testnets?\n\nWho is responsible for getting Solidity / Vyper buy-in/resources?",
        "created_at": "2024-04-12T17:05:09.642000+00:00",
        "attachments": null
    },
    {
        "author": "marioevz",
        "category": "general",
        "parent": "",
        "content": "We want to have all EVM tests consolidated in execution-spec-tests for Prague as we had them for the two previous forks (Shanghai https://github.com/ethereum/execution-spec-tests/tree/main/tests/shanghai, and Cancun https://github.com/ethereum/execution-spec-tests/tree/main/tests/cancun), so ideally EOF tests should also be here, and we have a tracking issue for implementation https://github.com/ethereum/execution-spec-tests/issues/500, currently only \u003c@547171287831805972\u003e, \u003c@755913785620824175\u003e, \u003c@393119312350543872\u003e and myself are writing tests so we are taking a few EIPs at a time, and Dimitry is starting with EOF, but any help is appreciated.",
        "created_at": "2024-04-12T18:00:04.621000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "general",
        "parent": "",
        "content": "Fuzzing is probably \u003c@211091239112671234\u003e, and execution-specs are myself/\u003c@830368514225340436\u003e/\u003c@243183686562873344\u003e (though we want EIP authors to take more of a role in writing code)",
        "created_at": "2024-04-12T23:42:09.403000+00:00",
        "attachments": null
    }
]