[
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "i also like option2\n\u003e communicate it only via engine api: works but kinda requires EL to then store the value somewhere and has a higher cost of specifications\nyes, this requires the engine api to reach a little bit deeper into client internals, but i'm ok with that",
        "created_at": "2024-12-11T15:34:23.769000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "and i'm kinda surprised to see option 3 floated, since while sure it is configurable, it is no longer dynamic. seems like a big loss.",
        "created_at": "2024-12-11T15:36:09.559000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "i.e. if we keep it dynamic over the engine api, can't future \"difficulty bomb\" type upgrades stay limited to the beacon chain?",
        "created_at": "2024-12-11T15:37:27.699000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "general",
        "parent": "",
        "content": "+1 for option 2 as well, having a client global config updated on every new payload doesn't sound too far reaching to me",
        "created_at": "2024-12-11T16:20:06.139000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "in theory, but we aren't even considering them at all. so it seems a classic case of adding complexity to support  a theoretical future use case that we aren't even sure will land",
        "created_at": "2024-12-11T16:32:50.747000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "ok, so put a pin in option2 until all EL clients can handle a wider, more dynamic range of blob targets. till then, option 3.",
        "created_at": "2024-12-11T17:01:17.152000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Does it make sense to add the blob info to the fcu message today, even if it is going to be ignored for now? Stops us keep bumping fcu...",
        "created_at": "2024-12-11T17:10:22.298000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "not sure i understand this?",
        "created_at": "2024-12-11T17:39:53.347000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "Is including the max blob count in the header really that wasteful?  Aren't RLP values under `0x7f` just stored as a single byte?  Can we restrict the count to a \"u7\"?",
        "created_at": "2024-12-11T19:16:44.588000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "yeah well it depends if we specify max blob count or max blob gas - but sure, i don't think the actual amount of data stored or transmitted is all that problematic. it's more a canary that the design itself is problematic",
        "created_at": "2024-12-11T19:18:39.344000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "true.  Personally I still prefer explicit (e.g. option 1) just because it feels like with ePBS etc coming at some point there's potentially more places where an implicit number might accidentally get out of sync.  \n\nOr perhaps overkill but what about something like this: we add a new \"From CL config\" versioned object that is included indirectly in the EL header, so the process is something along the lines of: CL sends `config: { \"version\": 1, {\"data\": { max_blob_gas: xxxx }}` and then we include \"config_version\" as a small int in the EL header?  Lots of hand-waving there just trying to get the gist across succintly w/o getting too deep but the point would be to have a new location to house infrequently changed values like this.  CL-only forks could change existing values while CL/EL combined forks could add new fields.",
        "created_at": "2024-12-11T20:46:36.216000+00:00",
        "attachments": null
    }
]