[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I opened a PR to keep track of the current Pectra proposals to consider during the next ACDE: https://github.com/ethereum/EIPs/pull/8846\n\nI omitted some EIPs that haven't been discussed for a while for brevity. If there's something important I've missed, please suggest its addition in the PR. \u003c@135497428882292736\u003e I'll add your blob fee proposal once you have an EIP PR for me 🙂",
        "created_at": "2024-08-30T12:46:31.284000+00:00",
        "attachments": null
    },
    {
        "author": "nordbjerg",
        "category": "general",
        "parent": "",
        "content": "Here's Reth's opinion on the CFI'd EIPs for Pectra\n\n**EIP-7623: Increase calldata cost**\n\nWe think it makes sense to increase the calldata cost for actors using calldata as DA to nudge them to use blobs instead. The change is relatively small as well, so we think it makes sense to include this in Pectra.\n\n**EIP-7742: Uncouple blob count between CL and EL**\n\nIt makes sense to have this configuration live in a single place, and allows us to increase blob count without changes to EL in the future. The change is small, although a bit larger than EIP-7623. We're supportive of including this in Pectra.\n\n**RIP-7212: Precompile for secp256r1 Curve Support**\n\nWe're excited about adding this precompile. Reth already has a working implementation of the RIP, so we'd be supportive of including this in Pectra, but we are also sensitive to the fact that not all client teams may have this implemented, and are OK with not including it in Pectra if others feel it adds too much extra work.\n\n**In summary**:\n\n* **EIP-7623**: Strongly supportive of inclusion in Pectra\n* **EIP-7742**: Strongly supportive of inclusion in Pectra\n* **RIP-7212**: Supportive of inclusion in Pectra, if time permits",
        "created_at": "2024-08-30T14:28:23.422000+00:00",
        "attachments": null
    }
]