[
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Sorry if off topic, what are the best channels to track PeerDAS progress / get involved?",
        "created_at": "2024-01-19T01:20:18.339000+00:00",
        "attachments": null
    },
    {
        "author": "dapplion",
        "category": "general",
        "parent": "",
        "content": "https://github.com/ethereum/consensus-specs/pull/3574 is a good snapshot of current status. \u003c#988798065894907934\u003e looks like the best forum to ask questions / start debates",
        "created_at": "2024-01-19T02:00:18.929000+00:00",
        "attachments": null
    },
    {
        "author": "hsiaowei",
        "category": "general",
        "parent": "",
        "content": "I just opened a magicians thread for high-level disucssion: https://ethereum-magicians.org/t/eip-7594-peerdas-peer-data-availability-sampling/18215",
        "created_at": "2024-01-19T03:24:47.249000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "Oh hi. I wanted to comment on Prague/Electra from a node operator/staking perspective, and the discussion of what \"big thing\" might go into it.\nHaving slept on this, I vastly prefer EOF over 4444.\nWhichever of them doesn't make it in, is 2026 at the earliest. Verkle 2025 unless it pushes into 2026.\n4TB drives are affordable now (MP34) and more so in 2025, when 2TB may no longer be sufficient. Node Operators can deal with the expense.\nEOF unlocks better smart contracts, that make it easier to reason about security among other benefits (code/data separation). 2 years in the software dev space matters\n\nI'd rather see the app/user layer getting a boost than the staker layer. Because that ultimately brings value to ETH, and that's good for stakers as well.",
        "created_at": "2024-01-19T10:36:26.533000+00:00",
        "attachments": null
    },
    {
        "author": "praveen0311",
        "category": "general",
        "parent": "",
        "content": "Hi quick quesion, Am runing a  execution client, Do we have specific endpoint to get the the execution rewards directly?",
        "created_at": "2024-01-19T13:56:43.147000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "It isn’t EOF vs 4444’s though. 4444’s isn’t going to push back EOF or Verkle. The impact of 4444’s is big, but the scope of it is minor.\nWhat do EL clients need to implement for 4444’s\n- being able to Weak Subjectivity Checkpoint sync because you won’t be able to sync from genesis off devp2p\n- no longer serving pre-4444s data on devp2p\nBelow are alternative history providers. EL clients don’t have to integrate these schemes for 4444’s but they can to provide a better UX experience. The important thing for 4444’s is that alternative methods exist.\n- having alternate history providers. For pre merge you will be able to use ERA1 which will require downloading 8192 block chunks of the chain history from BitTorrent or centralized sources. you can use a P2P history provider like the Portal History Network, where you would be able to individually request headers,bodies,receipts.",
        "created_at": "2024-01-19T14:33:19.374000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003e Below are alternative history providers. EL clients don’t have to integrate these schemes for 4444’s but they can to provide a better UX experience. The important thing for 4444’s is that alternative methods exist.\n\nI personally think we should not \"handwave\" this part away. The UX _is_ critical, and there's a big difference in a post-4444 world that looks like \"my client syncs just like it did before, but it magically gets the data from elsewhere, and there's a decent set of alternatives to choose from\" vs. \"I'm trying to get history and have to spend 2 hours finding a torrent with 1 seed, that I then need to manually move into my client DB and hope I did things right\". \n\nThat said, a lot of this work does not have to fall onto client teams directly, and improving on the history import flow is a really valuable thing others can do in parallel 😄",
        "created_at": "2024-01-19T15:54:34.026000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "100%, UX/readiness of Alternative history providers are major blockers right now",
        "created_at": "2024-01-19T16:19:38.383000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "Would a brief update from the portal team in the next ACDE be helpful for 4444 scoping?",
        "created_at": "2024-01-19T16:20:21.287000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "I agree this is a critically missing component atm for anything expiry. It also is important for rollup trustless sync from l1 which is no longer possible with expired blobs.",
        "created_at": "2024-01-19T16:42:03.945000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "A quick TL:DR of (what is)/(the status of) the Portal Networks*\nPortal is a project comprised of different P2P networks history, beacon (stores Beacon Chain state used to validate data for other portal network's post merge), state... State is WIP/R\u0026D. But history is currently in the bug fixing stage. With beacon almost out of the implementation stage. History will provide pre-merge blocks, History + Beacon will provide all minus 8192 blocks at first, then all blocks after a network upgrade. The idea being all data should be validatable. Once the bugs are squashed we will launch a Portal History network for 4444's.",
        "created_at": "2024-01-19T16:45:00.146000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "Any thoughts on making EF grants available around this work? Are those still a thing I haven’t really been following that space.",
        "created_at": "2024-01-19T21:04:44.117000+00:00",
        "attachments": null
    }
]