[
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "**ACDC #140 in ~25 mins!**\nAgenda: https://github.com/ethereum/pm/issues/1129\nStream: https://www.youtube.com/live/hSNJ6vURfmE\nZoom: https://ethereumfoundation.zoom.us/j/83703239965?pwd=VnjQjZ06LIaCzOjmyY1Jllt0LoTpvK.1",
        "created_at": "2024-08-22T13:35:39.973000+00:00",
        "attachments": null
    },
    {
        "author": "velvetshark",
        "category": "general",
        "parent": "",
        "content": "Might be of interest to people here. I've just launched a major revamp of https://eip.directory\nIt has all the EIPs, ERCs, CAIPs, and RIPs in one place, with quick search, feedback mechanism, decent mobile experience, etc.\nLets you find and go through all the proposals quickly and efficiently. Any feedback, ideas - greatly appreciated.",
        "created_at": "2024-08-22T14:40:40.495000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "**ACDC #140 summary**\n* consensus-specs release `v1.5.0-alpha.5` is out!\n* Pectra devnets\n  * Started with an overview of `devnet-2`\n    * A bad block, likely from early EIP-7702 implementation; clients are debugging\n  * Minor issue with JSON-RPC, see the call for more details\n  * Touched on an update to EIP-2935; no substantive change, just a clarification around behavior\n  * And it looks like we are in a good place for `devnet-3` — be on the lookout for launch next week!\n* Pectra EIP updates\n  * [Update to EIP-7251](https://github.com/ethereum/consensus-specs/pull/3882) to adjust correlated slashing penalty; fixes an overflow at high amounts of stake\n    * Please take a look! The change is straightforward but touches some very delicate code.\n  * Next, [a proposal](https://github.com/ethereum/consensus-specs/pull/3875) to refactor some of the data types on the beacon chain to streamline processing of execution requests added in Electra\n    * General support for this solution\n    * Blocked on adding spec tests; I’ll follow up here\n  * Then [another proposal](https://github.com/ethereum/execution-apis/pull/565) to refactor the engine API to streamline implementation when passing execution requests from EL to CL\n    * Proposal has some support, although there was a question about the interplay with the possible move to SSZ if we decide to harmonize serialization across the CL and EL\n    * Going to get more feedback from additional CL clients",
        "created_at": "2024-08-22T18:35:45.848000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "* PeerDAS\n  * Started with implementation updates and client status\n    * Clients have made progress on implementing the `peerdas-devnet-2` specs, and devnet launch should be in the next few days!\n  * Next, turned to EIP-7742\n    * Started with some clarifications, engine API payload attributes needs the maximum blob count as well as the target as currently specified\n    * Did a temperature check on Pectra inclusion, generally good support\n  * And then touched on an implementation concern around blob flexibility\n    * Some clients hard-code the max and target blob parameters, which can make operations of devnets harder\n    * Clients are aware of the issue and will likely solve this pain point under EIP-7742\n  * This segued into a discussion around blob limits per transaction in the protocol, and how that interacts with similar concerns in the public mempool\n    * want to make blob packing easier; if a transaction has the max number of blobs, it crowds out other transactions that could otherwise go into the same block\n    * strong pushback to not have a protocol-level rule and instead handle in the mempool or networking layer\n    * some nice back-and-forth on this point, check the call for the details!\n* And to close the call:\n  * Agreed to label the F-star (next hard fork after Pectra): `Fulu`, with portmanteau `Fusaka`\n  * And last but not least, an update from Probelab around some recent analysis of gossipsub and its control messages\n    * Find slides on IPFS with this CID: QmURBPigXY9LjGuumwRohrXfhhi26RZmWHKQT2RjcUEQAy\n    * A related analysis on block arrival times here: https://probelab.io/ethereum/block_arrival/2024-29/",
        "created_at": "2024-08-22T18:35:47.095000+00:00",
        "attachments": null
    }
]