[
    {
        "author": "arnetheduck",
        "category": "general",
        "parent": "",
        "content": "indeed, +1 for ssz, if anything - we've recently added a canonical json representation to SSZ as well, to make migrations and dual JSON/SSZ API specifications easier - we've had the PB-and-insert-your-favourite-format-discussions before, lots of times and they all come back to the same point, that translating between X and native eth (ssz nowadays) is both semantically challenging and performance-wise inadvisable (just like json - but at least json is established in the eth world so it has that going for it).",
        "created_at": "2024-06-27T08:54:11.076000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "ACDC in ~15 mins\nAgenda: https://github.com/ethereum/pm/issues/1084\nStream: https://www.youtube.com/live/T-w5dzte36c\nZoom: https://ethereumfoundation.zoom.us/j/83703239965?pwd=VnjQjZ06LIaCzOjmyY1Jllt0LoTpvK.1",
        "created_at": "2024-06-27T13:43:51.078000+00:00",
        "attachments": null
    },
    {
        "author": "__kasey__",
        "category": "general",
        "parent": "",
        "content": "How do we decide the order of topics in the `ethereum/pm` issues? The way this one was sequenced, we front-loaded a presentation, and then a topic that was prone to EL rabbit holes. I would suggest we try to schedule presentations, or discussions on ideas that haven't previously had the floor, for the end of the call, as these tend to take up more time than expected. This also ensures CL devs who are joining the call to make sure they are live for timely updates on things live devnets (consider in particular people in SEA who are joining late at night) can front load and drop before the end (and watch the presentations later on youtube).",
        "created_at": "2024-06-27T15:23:37.482000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "general",
        "parent": "",
        "content": "wrote up something regarding updating system contract params via \"super limited\" onchain validator governance: https://ethereum-magicians.org/t/beacon-validators-contract-for-online-governance/20404",
        "created_at": "2024-06-27T17:43:51.778000+00:00",
        "attachments": null
    },
    {
        "author": "abcoathup",
        "category": "general",
        "parent": "",
        "content": "\u003c@539495253418180618\u003e can you provide a summary please? (either here or Eth Magicians).\nhttps://ethereum-magicians.org/t/all-core-devs-consensus-acdc-call-136-june-27-2024/20397",
        "created_at": "2024-06-27T23:14:58.546000+00:00",
        "attachments": null
    }
]