[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "There's one more addition to the agenda 🙂 \n\nCall starts in ~1h15: https://ethereumfoundation.zoom.us/j/91348592283?pwd=SnRnL1VTeXNYVE9CaWpBbnJEUXhQZz09",
        "created_at": "2024-10-24T12:42:33.888000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Call summary \u0026 action items: https://ethereum-magicians.org/t/all-core-devs-execution-acde-199-october-24-2024/21355/2",
        "created_at": "2024-10-24T17:43:31.035000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**TL;DR:**",
        "created_at": "2024-10-24T17:43:43.060000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "Screenshot_2024-10-24_at_10.43.15_AM.png",
                "content": "40b38fff67855997112703afc334ad79eb904589f4d46f87d1d117133062909a"
            }
        ]
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I know today must've been heated and since I missed it by being literally fighting with Monkeys, I wanted to express support for \u003c@687974325072035882\u003e's EIP, regardless of gas increases or not. I hear that \u003c@360491619402776577\u003e mentioned that they would rather do discrete client releases with increasing defaults and then monitor the status. I claim that Giulio's mechanism is safer. In Giulio's mechanism we get to have a smoothly growing increase where each block increases by less than the maximum that is allowed today. The alternative produces a function that is piecewise constant but that on interface changes, the increases happen rapidly at the maximum that is allowed per block. \n\nBoth mechanism require rough community consensus, as these are flags that node operators can set with the corresponding parameters. In fact, even if we were to go with Marius's approach: we should **annyway** do it with Giulio's system, that is, set up the increase to be gradual since the first release up to the expected increase that otherwise would have been chosen in these microreleases. \n\nEither way, I think EIP 7783 should be considered and even if you are against increasing the gas limit, it should be considered as a better system than the current one. Just ship clients with flags to determine the slope and the time that they want to increase the gas limit. Eitherway we already allow operators to set whatever they want: just that we today enforce an exponential increase if the community decides to increase, instead of a more conservative linear increase as the EIP dictates",
        "created_at": "2024-10-24T19:29:41.806000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Thanks for the feedback. today was actually very productive and now i see the problems that needs to be addressed. so I think that the \"whole\" chain fail silently is a flawed argument but I will need to write a long post about it, to make that clear to people. naturally the microreleases is an inferior design, maybe i was thinking of an automatic step design\n\nOverall - I agree with you, i think, however, it would be better to start with a 40mn over 3 months - and display the data on it which looks very good to that extent (it already looked good on 60mn though)",
        "created_at": "2024-10-24T19:37:18.371000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "sure, I don't advocate for any increase on gas limit: my only point is that if anytime the community agrees to increase, by any amount, even if it's minimal just to test, a linear increase is better than the exponential one we have today, we will never be in a situation where we need to quickly increase it or the network will die",
        "created_at": "2024-10-24T19:38:54.044000+00:00",
        "attachments": null
    }
]