[
    {
        "author": "paulhauner",
        "category": "general",
        "parent": "",
        "content": "\u003c@552133098075193354\u003e here's the Lighthouse release for Goerli Deneb: https://github.com/sigp/lighthouse/releases/tag/v4.6.0-rc.0",
        "created_at": "2024-01-11T02:42:35.125000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Thank you! Blog post out 🔜!",
        "created_at": "2024-01-11T03:00:53.779000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I would like to echo the following point made by @Tomasz and others on the latest ACDE call regarding the scope of the next HF:\n\nIf the Verkle is set for Prague then I think there is still a room for changes having moderate engineering complexity on EL side. Previously, I was sceptical about that but after realizing the Verkle will likely take at least 12 months to get rolled out working on other EIPs at the same time seems to be doable. I believe that 4788 did not delay Cancun anyhow and I think some of the proposed EIPs won't delay the Verkle too. I don't know the exact way teams would do resource management while working on the Verkle implementation, but my guess is that not each engineer in every EL team will be working on the Verkle and EL teams can dedicate one engineer for 3-4 months to implement other EIPs (I might be wrong tho).\n\nI believe that implementation and testing of 7002, 6110, 2537, 7377, 4444 and maybe others does not increase the complexity significantly as it can be tested independently via ethtests and Hive test suites. I do admit that extending the block header brings additional testing complexity to the RPC as \u003c@543900561460822016\u003e mentioned and may be the tooling but the precedent of extending the header was set with withdrawals and beacon block root and isn't a completely new thing.\n\nSo a few important EIPs with good testability and moderate EL implementation complexity in the same HF with the Verkle doesn't sound bad.",
        "created_at": "2024-01-11T13:42:06.856000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "ACDC in 15 minutes:\nhttps://github.com/ethereum/pm/issues/936\nhttps://ethereumfoundation.zoom.us/j/91725886939?pwd=b2kzT0JGeFAzTmhyb1BYSTgrZ0xwdz09",
        "created_at": "2024-01-11T13:46:38.211000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "call in a couple of minutes!",
        "created_at": "2024-01-11T13:57:25.311000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "Please add any additional EIPs under consideration for the next upgrade here --  https://github.com/ethereum/consensus-specs/issues/3449\n\nWe'll begin conversation on the CL side in two weeks about priorities, strategy, etc in relation to these\n\n*and note*: we'll have a PeerDAS EIP up by then for discussion -- draft CL spec: https://github.com/ethereum/consensus-specs/pull/3574",
        "created_at": "2024-01-11T14:31:25.465000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "6110 forking shouldn't add complexity (at least on EL side) as it pretty much deterministic and can be well tested",
        "created_at": "2024-01-11T14:51:32.807000+00:00",
        "attachments": null
    }
]