[
    {
        "author": "infamousrev",
        "category": "general",
        "parent": "",
        "content": "As both a lifelong coder and a psychologist I figured I would make a comment about the discussion around the inclusion of EOF in Pectra. Even though coredevs tend to be super intelligent people who can be very rational, it is important to realize that even coredevs are still human and that emotions can influence everyone's thinking process. People's brains tend to work optimally when you are in a neutral state of mind, but if you get emotional (either angry/sad/excited) it tends to lower our ability to think straight. One issue I see in the current EOF debate is that various individuals have spend countless hours on it. Because of this the sunk cost fallacy start playing a bigger and bigger role. Listening to the recent call discussing the inclusion of EOF I noticed that the proponents of EOF seem to be getting emotional about it. They fear that if it doesnt get included in pectra that it will make all their efforts go to waste. However taking extremely important decisions about a multi-billion dollar ecosystem in an emotional state of mind seems irresponsible. I think the best compromise decision regarding EOF in pectra is to commit to shipping it in pectra BUT not activated on mainnet but with a switch to activate it for L2s with the stated intention that IF L2s activated it for a sufficiently long enough time that all coredevs feel that all the risks regarding consensus failures have been properly accounted for that it will be later activated on mainnet.",
        "created_at": "2024-07-22T05:40:15.301000+00:00",
        "attachments": null
    },
    {
        "author": "infamousrev",
        "category": "general",
        "parent": "",
        "content": "\u003c@206016661470314496\u003e Do you think this would be a suitable compromise to feel make the geth team more comfortable with the EOF plans?",
        "created_at": "2024-07-22T06:02:47.457000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e I like this idea",
        "created_at": "2024-07-22T06:56:05.931000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "That adds a lot of risks for L2s that they may activate something and then have to maintain it forever even though L1 doesn’t adopt it so upstream geth then removes it again.",
        "created_at": "2024-07-22T08:26:50.007000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "And you need to have the same level of confidence in the code to activate it on L2 as you do on L1. It’s not like anyone is ok with chain splits happening on an L2.",
        "created_at": "2024-07-22T08:27:36.097000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e L2s do a lot of things that L1 wouldn't do, e.g. when it comes to cryptographic primitives",
        "created_at": "2024-07-22T08:29:06.665000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "This has similarities to another EIP where people are proposing effectively a similar notion of shipping in Pectra but maybe not activating yet. It's the same problem, that it plays with what \"shipping in Pectra\" means.\n\nIf \"shipping in Pectra\" means that client teams know that it's not expected to work pending yet another fork, well, that's not really \"shipping in Pectra\" except that there's now a pile of dead code there for... why?\n\nIf \"shipping in Pectra\" means that it is expected to work, at a moment's notice, it doesn't really solve the main problem of is it worth the client team investment of developing and testing code which does, in fact, have to work",
        "created_at": "2024-07-22T08:59:35.389000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "It's a way of not making a decision",
        "created_at": "2024-07-22T08:59:41.918000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "While carrying all the costs of implementing the EIP regardless",
        "created_at": "2024-07-22T08:59:56.407000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "(This one has the L2 angle, which is interesting. But for L2's to use it at all it still basically has to work.)",
        "created_at": "2024-07-22T09:01:52.067000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Sometimes but they do that based on a bunch of factors and trade offs which will differ from L2 to L2 though. It doesn’t mean that all L2s are a guinea pig for features L1 isn’t sure about though.",
        "created_at": "2024-07-22T09:55:55.650000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "But L1 should be the guinea pig for L2s?",
        "created_at": "2024-07-22T10:07:46.979000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "Indepentent of eof, I think that if a feature is not able to be rolled out on L2s with the confidence that it won't change when it comes to L1, then it shouldn't be proposed to L1 either",
        "created_at": "2024-07-22T10:12:44.255000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I’m not saying that L1 is the guinea pig or even that there’s anything wrong with EOF. I’m specifically pushing back on the idea that L2s are somehow a lower quality target",
        "created_at": "2024-07-22T10:31:56.833000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "I think some might, but definitely not the big ones, especially if we want to encourage users to move there",
        "created_at": "2024-07-22T10:33:18.177000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "general",
        "parent": "",
        "content": "EOF is not a experiment it is improvement to EVM. And i want to see L1 getting improved.",
        "created_at": "2024-07-22T10:36:30.959000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "Again, I didn't want to comment on eof, just on the relationship between L1 and L2. I think its important that we have these debates.",
        "created_at": "2024-07-22T10:43:44.171000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "general",
        "parent": "",
        "content": "We were talking about EOF so I assumed you talked about it.\nOn topic of L1 and L2, true we need to talk about it. Really like RollCall initiative it is moving things in good direction.",
        "created_at": "2024-07-22T10:51:47.048000+00:00",
        "attachments": null
    },
    {
        "author": "daniellehrner",
        "category": "general",
        "parent": "",
        "content": "L1 is not forcing L2s to do anything. There are L2s like Starknet or Fuel that go into very different directions. And there are L2s that decide to follow L1 to take advantage of the network effects with regards to tooling, etc. I really don't like the talking point that we force anybody to implement EOF only because some L2s have decided on their own to follow L1. If they are unhappy with our decisions they can simply decide not to follow them.",
        "created_at": "2024-07-22T11:20:41.642000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I don't think is as simple as this take. The relation between L1 and L2 became more intricate when we decided to make some form of unwritten commitment to an L2-based-roadmap. In particular this requires us from being in conversation with L2s and take their input on EVM changes.",
        "created_at": "2024-07-22T11:24:58.574000+00:00",
        "attachments": null
    },
    {
        "author": "daniellehrner",
        "category": "general",
        "parent": "",
        "content": "I wouldn't agree with that take. For example I've never heard any of the L2s share their position on EOF. L2s were heavily invested in our things, like 4844, but I never got the impression that EVM changes are a big concern for them. EOF even makes their life easier by banning gas introspection.\n\nWe committed to provide cheap data availability and focus on credible neutrality and censorship resistance, so that L2s don't have to worry too much about that. I don't feel we have made any particular commitment wrt to the EVM.",
        "created_at": "2024-07-22T11:33:40.088000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "What was the number of the EIP which disable empty accounts touching?",
        "created_at": "2024-07-22T14:57:59.226000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "https://eips.ethereum.org/EIPS/eip-7523",
        "created_at": "2024-07-22T15:03:12.931000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "I think I meant the https://github.com/ethereum/EIPs/pull/8712.",
        "created_at": "2024-07-22T15:09:03.980000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "Yea, it got closed and I only searched the reelased EIPs.",
        "created_at": "2024-07-22T15:09:56.038000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I think it's hard to say Ethereum has a rollup centric roadmap but not also plan for maximal compatibility between L1 and at least some/most L2s with the EVM being the most important part of that (though not all of it). Otherwise moving to an L2 requires the same kind of changes as moving to a different L1.",
        "created_at": "2024-07-22T20:48:19.651000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Any L2 that is focussed on compatibility is pretty much just going to follow L1s choices for the EVM. They might have some input towards it at times but often L1 will have heard that directly since it comes from users and most users are working with both L1 and L2s at the moment. ie if I wanted to find out if EOF was useful on OP Stack, I'd need to talk to the most popular compilers, but they've already given input directly.\nAnd L2s that are doing work on improving the VM tend to be focussed on replacing the EVM outright from what I've seen because if you're going to deal with incompatibilities you may as well go big and give yourself the biggest scope for meeting user needs.",
        "created_at": "2024-07-22T20:51:40.247000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "And just to be completely clear, that doesn't mean that all L2s need to be strictly the same as L1 - there's definitely scope to do wildly different things and see if they work, but I don't think that's an accurate way to look at all L2s nor do I think its a viable strategy for the Ethereum ecosystem as a whole.",
        "created_at": "2024-07-22T20:53:36.580000+00:00",
        "attachments": null
    },
    {
        "author": "0x1984",
        "category": "general",
        "parent": "",
        "content": "IIt's for L1 to setup compatibility benchmark, and individual L2s can branch out at their own choices - just like Type 3/4 zkEVM because they have to. However, L2 sequencers are hanging around with one power button to turn it off, and Arbitrium only went live \u003c2 yrs, it's premature to move away from providing consistent tech and compute stake between L1 and L2s.  The developers are going too fast without reality checks from true users, and this is real danger of ETH dev. Just geth core devs refuse to do EOF because they do not buy into it. Devs shall focus on technology delivery while listening to the users on what they need, not \" I think your guys shall use L2 only. ETH is settlement layer only so get out today\".",
        "created_at": "2024-07-22T22:40:44.795000+00:00",
        "attachments": null
    }
]