[
    {
        "author": "barnabasbusa",
        "category": "general",
        "parent": "",
        "content": "Testing call starting in 0 seconds: https://ethereumfoundation.zoom.us/j/86466169680?pwd=x17cbD1lDCeQEWMTTOLARQhELiJV21.1",
        "created_at": "2024-09-23T14:00:29.518000+00:00",
        "attachments": null
    },
    {
        "author": "marioevz",
        "category": "general",
        "parent": "",
        "content": "Summary from the testing call:\n`Pectra Devnet-3`:\n - PK910: Filling deposit queue to see if the increased queue has an effect on timing. Currently have 32,000 deposits, and will fill up to 50,000. No findings yet.\n - Ethjs having trouble keeping up due performance issues, but these are expected due to the overhead of running the JS engine. No consensus issues at the moment so the client is expected to sync up to head when there are less transactions to process.\n\n`Pectra Devnet-4`:\n - Nethermind: Requires BLS gas pricing benchmark to finish\n - Testing updates required, testing team will start working on them this week and potentially have a release by the end of the week with all Devnet-4 changes.\n - Significant tooling changes are required for devnet-4: Assertor, and potentially MEV builder should be included in this phase.\n - List of all changes to be included in Devnet-4: https://notes.ethereum.org/@ethpandaops/pectra-devnet-4\n - Consensus spec release for devnet-4: https://github.com/ethereum/consensus-specs/releases/tag/v1.5.0-alpha.6\n - There was a discussion about CLs might needing to implement RLP decoding, but it turns out this is not necessary after all.\n - Need testing of deposits before and after the fork are queued in correct order, assertor should be capable of doing this on the next devnet, so the Pectra fork should be activated on epoch 300-400 in order to queue up enough deposits before the fork.\n\n`PeerDAS Devnet`:\n - Barnabas: Running long testnet with all CL combos, very stable at the moment at epoch 40 with 100% participation. Potential launch devnet-2 tomorrow.\n - Gajinder raised concern that we should run longer testnets because 40 epochs look ok, but clients have forked at 200+ epochs, sampling parametrization is required to guarantee the network can be stable under different circumstances. More supernodes+nodes ratio parametrization is required along with evaluation of stability on each configuration, in order to detect parameters that are more prone to be unstable. Barnabas suggested that we should use main-net parameters to start, and eventually branch out to more combination of parameters. This topic should be brought up on the next testing meetings.\n - Metric unification: CL clients are encouraged to adopt the same metric names in order to make it easier to gather metrics from all clients using the same grafana dashboards. Link shared in the meeting regarding this: https://github.com/ethereum/beacon-metrics/pull/13\n- Builder: Reth is currently working on rBuilder, and MEV-Boost also, but target would be devnet-4. Hive can be updated to have builder process sanity testing.\n\n`EOF`:\n - Potential spin up of a Devnet in order to test EOF contract deployment. It was suggested we can use a simple fork name such as \"EOF\" in order to activate on top of \"Pectra A\" EIPs.\n - Current issue is obtaining interesting EOF contracts in the devnet, such as popular contracts like Uniswap or the OpenZeppelin implementations in EOF deployed.",
        "created_at": "2024-09-23T15:02:20.587000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "Ah it seems like multiple people are working on adding pectra support to mev-boost (and attestant) \u003c@592004585506340885\u003e \u003c@808969530608451584\u003e and I. It should just be one of us. Maybe pk because he already has a wip branch open to go-eth2-client. Once that is merged, I can take over the mev-boost part",
        "created_at": "2024-09-23T17:00:07.774000+00:00",
        "attachments": null
    },
    {
        "author": "pk910",
        "category": "general",
        "parent": "",
        "content": "I think it should be almost complete. But I don't have anything to test it against 😄  so, I'll need a client thats ready for alpha.6 to be sure it works as expected",
        "created_at": "2024-09-23T17:05:58.337000+00:00",
        "attachments": null
    },
    {
        "author": "pk910",
        "category": "general",
        "parent": "",
        "content": "\u003c@360491619402776577\u003e, ready to go if I didn't miss something (it's basically just the ExecutionRequests change, right?)\nwanna have a look at it if you started working on it too? 🙂",
        "created_at": "2024-09-23T17:30:05.113000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "general",
        "parent": "",
        "content": "\u003e List of all changes to be included in Devnet-4: https://notes.ethereum.org/@ethpandaops/pectra-devnet-4\nThe doc mentions [execution-api#577](https://github.com/ethereum/execution-apis/pull/577) is going to be in devnet-4. Is it superseded by [execution-api#587](https://github.com/ethereum/execution-apis/pull/587) which removes all three requests from payload and form a separate ExecutionRequests container instead of unifying them and still sits in the payload? Correct me if I am wrong",
        "created_at": "2024-09-23T18:37:25.003000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "587 needs to be updated",
        "created_at": "2024-09-23T19:34:06.837000+00:00",
        "attachments": null
    }
]