[
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e I don't thinks this makes sense. Proposers already trust relays that they will propagate their blocks in time for them to be validated and included on chain, blobs don't change that.",
        "created_at": "2024-06-03T01:43:11.761000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Bigger blocks increase the chance the block won't propagate through the network in time.  The relay may behave honestly but a bigger block will still take longer to propagate.  This means the builder needs to produce the block sooner, which means fewer transactions in the block.  If the builder can make more money by waiting and including more transactions (which tend to be much smaller than blobs) they will do so (assuming profit motivation and optimization).",
        "created_at": "2024-06-03T01:46:45.931000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "How does the build proposer reward work for blobs?  Is it just a field the user can specify like for type 2 transactions?",
        "created_at": "2024-06-03T01:47:25.874000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e Yes, we know that. Blobs will have to increase their tips to compensate for the lost MEV",
        "created_at": "2024-06-03T01:50:01.357000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Priority fee is per transaction gas, not per blob gas?  So people submitting blobs will need to adjust this up manually to compensate for their attached blobs?",
        "created_at": "2024-06-03T01:52:28.928000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e yes, that is unfortunately a consequence of how gas is currently calculated",
        "created_at": "2024-06-03T01:52:58.514000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e (I would also propose to make the tip proportional to the gas limit rather than the actual gas used, so that this is more predictable — that way, the builder/proposer can gauge the tip before including a transaction in a block, whereas currently the tip could be lower than expected if the tx uses less execution gas)",
        "created_at": "2024-06-03T01:54:03.442000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This would result in people paying a higher price for reverts, which could lead to incentives for builders to intentionally cause reverting transactions so as to extract more value from transactions.",
        "created_at": "2024-06-03T01:55:19.852000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e ultimately it just means a fixed tip for each transaction",
        "created_at": "2024-06-03T01:56:33.313000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Right, which means if a builder can cause a 500,000 gas transaction to revert after 20,000 gas by including a 100,000 gas transaction before it, then it is in their best interest to do so.  They get paid the same whether the transaction reverts or doesn't, so they will prefer it to revert early so they have more space.",
        "created_at": "2024-06-03T01:58:00.758000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This effect *may* be lost in the noise, as the size aspect only matters if blocks are full, and so you are left with only execution cost difference in the common case.  It worries me introducing such an incentive though and I would want to see some really robust data showing that the benefits of forcing a revert are *always* negligible.",
        "created_at": "2024-06-03T01:59:22.899000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Blobs do not really make blocks propagate slower. This is only true for the very few self built blocks. Builder's blocks can start broadcasting the blobs as soon as the proposer sends the blinded block even before any validation. I'm surprised the relay is not already doing this. On ePBS this effect is even more drastic: blobs can be broadcast 3 second before the block. I don't think that blob content causing reorgs should even be a topic",
        "created_at": "2024-06-03T02:07:33.883000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "general",
        "parent": "",
        "content": "What are people's thoughts around",
        "created_at": "2024-06-03T04:23:13.298000+00:00",
        "attachments": null
    },
    {
        "author": "smartprogrammer",
        "category": "general",
        "parent": "",
        "content": "\u003c@\u0026595685821026271242\u003e",
        "created_at": "2024-06-03T07:28:40.247000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "There is no beacon API to publish blobs separate to blocks, so we would either have to create a new API for this or the builders would need to directly interface with the rest of the network at the p2p layer.  This may be a solvable problem, but I don't see it as being solved today.",
        "created_at": "2024-06-03T09:28:41.525000+00:00",
        "attachments": null
    },
    {
        "author": "jc6763",
        "category": "general",
        "parent": "",
        "content": "Workshop on the Decentralization of the Internet\nACM Conext-2024 call for papers\n\nhttps://dirk-kutscher.info/conf/conext2024-din/\n\nhttps://conferences.sigcomm.org/co-next/2024/#!/din",
        "created_at": "2024-06-03T22:26:51.894000+00:00",
        "attachments": null
    }
]