[
    {
        "author": "arnetheduck",
        "category": "general",
        "parent": "",
        "content": "let's not forget why we use gossipsub to begin with: it's exceptionally hard to disrupt, ie the redundancy is a means to a resiliency end and reducing redundancy in transmission also makes it easier to disrupt the network, in addition to the additional hop latency",
        "created_at": "2024-12-04T08:06:21.887000+00:00",
        "attachments": null
    },
    {
        "author": "cortze",
        "category": "general",
        "parent": "",
        "content": "\u003e we're measuring the worst case scenario\nI am coming a bit late to the discussion, but my thinking to reach those conclusions came from this comment from Yiannis.\n\nI think it's relevant to emphasize that if the node can allocate 10Mbps to reply to RPC calls, it could handle an extra peak load of 3-9Mbps to download 3 extra blobs on GossipSub (with its duplicates), even if that means that it would lower priority of RPC on bandwidth even more. \nThis means that if we continue the study after Pectra and see that most nodes still report enough bandwidth, they didn't make significant sacrifices to adopt the new blob target values.",
        "created_at": "2024-12-04T09:28:07.315000+00:00",
        "attachments": null
    },
    {
        "author": "cortze",
        "category": "general",
        "parent": "",
        "content": "On this, I agree that the main focus should be GossipSub, as is the one carrying the main load of the chain on a healthy canonical state.\nHowever, we shouldn't lose focus on RPC calls. These calls are the main method for nodes to sync or re-sync when something happens, let's call it a reorg. \nIncreasing the blob target/max doesn't only affect the ability of the network to propagate more messages over GossipSub, it also means being able to recover from edgy scenarios in the shortest time. This is something \u003c@755590043632140352\u003e and \u003c@476250636548308992\u003e already pointed out previously.",
        "created_at": "2024-12-04T09:37:48.101000+00:00",
        "attachments": null
    },
    {
        "author": "popef",
        "category": "general",
        "parent": "",
        "content": "\u003e I think it's relevant to emphasize that if the node can allocate 10Mbps to reply to RPC calls, it could handle an extra peak load of 3-9Mbps to download 3 extra blobs on GossipSub (with its duplicates),\n\nI think this is not true. When you send the RPC calls, you send only to one node (which obviously the network can handle that), but if you add extra blobs, every node will consume more bandwidth (not only one node).\n\nI'm not saying that we shouldn't increase the blob count, but I'm saying the measured available bandwidth doesn't lead to that conclusion at all. The block arrival time measured by ethPandaOps and its prediction leads to that conclusion, but the measured available bandwidth doesn't.\n\nIn other words, the statement like \"we measured the median of 20Mbps of available bandwidth of each individual node by sending RPC calls, so we can increase more blobs\" is false.",
        "created_at": "2024-12-04T11:00:43.659000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I agree with this take and in some way it's precisely what we've been saying for a few months now: looking at gossipsub is looking at the happy case which is where the network sits now. But the network recovers from an outage with RPC, and when blobs start to come late, all nodes start to stress all other nodes. This is why the devnets had that phase-change behavior rather than a gradual degrading with rate limitation: when blobs started to not being handled in time, the whole network came apart.  \n\nIn addition, while I agree that the \"max bandwidth\" reported by this study linked by \u003c@677848014278361123\u003e may not really be that because of the node rate limiting RPC calls, I feel that that's a matter of names only: it is this number that matters because it is this number what nodes have to both serve and download when things go south.",
        "created_at": "2024-12-04T12:36:47.816000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "A node which isn't in a healthy state or sufficiently updated on the chain can't effectively check several gossip rules anyway, so it's not clear a node catching up this way would need to stay on gossip",
        "created_at": "2024-12-04T12:44:23.833000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE tomorrow 14:00 UTC**\nAgenda: https://github.com/ethereum/pm/issues/1197\nStream: https://youtube.com/live/Umh7ZKukmtY\nZoom: to be shared here before the call",
        "created_at": "2024-12-04T16:32:49.136000+00:00",
        "attachments": null
    }
]