[
    {
        "author": "abcoathup",
        "category": "general",
        "parent": "",
        "content": "\u003c@552133098075193354\u003e I'm experimenting with ACD and breakout call posts in Eth Magicians based on **ACD Proposal 2: Breakout Room Templates**\nTo complete this we need a transcript \u0026 chat logs.  I assume someone at the EF with Zoom account owner/admin can export these.  \nWhat is the best way to get them (ideally without adding more for a moderator to do)?\n\nExamples:\nhttps://ethereum-magicians.org/t/all-core-devs-consensus-acdc-call-134/20174\nhttps://ethereum-magicians.org/t/future-of-eoa-aa-breakout-room-3/20164",
        "created_at": "2024-06-02T00:20:14.085000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "This should be handled at the builder level: the builder is more likely to start requiring larger tips to offset the cost of orphaning",
        "created_at": "2024-06-02T12:14:31.355000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Yeah but by itself that doesn't allow proposers to select the \"best\" block according to their own requirements, as there is no indication to the proposer of the value of the blobs included.",
        "created_at": "2024-06-02T19:04:54.686000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e why? the value of the tip is known",
        "created_at": "2024-06-02T20:53:13.658000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "In aggregate, but not for the individual blob transactions.",
        "created_at": "2024-06-02T20:59:43.379000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e I don't understand, why can't you find the tip for an individual blob tx?",
        "created_at": "2024-06-02T21:18:16.827000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Because the relay provides the execution payload header, which does not contain details of individual transactions.",
        "created_at": "2024-06-02T21:30:12.567000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e ok I don't understand. Assuming the builder compensates proposer for missed slots, then the proposer does not have to care about blobs, right?",
        "created_at": "2024-06-02T21:38:10.865000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "That assumption seems very optimistic.  And even if a builder does compensate for missed slots, the slot is still missed and the chain still suffers as a result.\n\nBut regardless, the initial point was that if validators had control of the blob limit they would increase it as high as possible to attempt to obtain higher fees.  My counter to that was that builders wanted to optimize for profit they would likely not include blobs at all, as the benefit is currently minimal (and would be even less if there were more blobspace available), and the size of the blob adds a non-negligible increase in the chance of the block being orphaned.  Potuz mentioned that the builder should be the entity deciding on the blobs to be included in the payload, but my concern there is that there is not enough information passed from the relay to the proposer for them to decide if the relay-provided payload is worth using compared to a payload from another relay, or a locally produced payload, for their given criteria.",
        "created_at": "2024-06-02T21:58:47.956000+00:00",
        "attachments": null
    }
]