[
    {
        "author": "peter.davies",
        "category": "general",
        "parent": "",
        "content": "Unfortunately I'm on a flight during ACD, so won't be able to attend.\n\nEIP-7523: This should be moved to Last Call. Tests have already been deleted from `ethereum/tests`. The only issue I can think that might be worth discussing is the whether their should be independant verification of the deletion of the empty accounts. I have checked quite thoroughly, but you might not want to simply trust me. I'm happy to publish my Reth based verification script if that would be helpful. \n\nEIP-7610: The real value in this change is making the new behaviour retroactive and removing a gnarly edgecase. In principle this requires a hardfork, but the situation is so implausible that it doesn't really matter. There is an added complication that querying whether an account has storage is impossible under verkle tries, so we should check that the verkle team are fine with this.",
        "created_at": "2024-02-15T12:11:44.745000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Call in 20m! \n\nAgenda + stream above. \nZoom link: https://ethereumfoundation.zoom.us/j/91348592283?pwd=SnRnL1VTeXNYVE9CaWpBbnJEUXhQZz09",
        "created_at": "2024-02-15T13:40:44.634000+00:00",
        "attachments": null
    },
    {
        "author": "builder_benny_figment",
        "category": "general",
        "parent": "",
        "content": "youtube link isn't working? (or private?)",
        "created_at": "2024-02-15T14:00:01.373000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "How about now \u003c@903477148680081429\u003e ?",
        "created_at": "2024-02-15T14:02:24.866000+00:00",
        "attachments": null
    },
    {
        "author": "builder_benny_figment",
        "category": "general",
        "parent": "",
        "content": "thank you \u003c@552133098075193354\u003e",
        "created_at": "2024-02-15T14:02:54.325000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE Recap**\n- Dencun: mainnet client releases are starting to go out! We hope to have everything released next Thursday, run a mainnet shadow fork Thursday or Friday, and have the proper announcement early in the week of Feb 26\n- Retroactive EIPs: For 7610, there are some questions to answer about potential Verkle interactions. For 7523, we agreed it would be nice to get a second check that all the empty accounts were deleted before finalizing the EIP\n- Pectra: we discussed many EIPs on the call, but didn't make any additions to the fork, aside from agreeing to move 2537 from CFI to included. We'll spend the next few weeks reviewing the various proposals. \n- Tomorrow we have an Inclusion List breakout for that purpose: https://github.com/ethereum/pm/issues/954\n- We'll also organize an account-related breakout in the next week or so to discuss the various EOA/AA-related proposals more deeply. I'll use the \u003c#718596092828057631\u003e channel to coordinate and post the info here when it's set!",
        "created_at": "2024-02-15T16:03:18.285000+00:00",
        "attachments": null
    }
]