[
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "**ACDC #142 in ~55 mins!**\nAgenda: https://github.com/ethereum/pm/issues/1154\nStream: https://www.youtube.com/live/MRtJSnBU3Gk\nZoom: https://ethereumfoundation.zoom.us/j/83703239965?pwd=VnjQjZ06LIaCzOjmyY1Jllt0LoTpvK.1",
        "created_at": "2024-09-19T13:06:47.053000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "How do people feel about starting with the two currently `Included` Pectra EIPs for PectrB devnets, EOF and PeerDAS, and then re-opening the can of worms about additions? \n\nAs we saw today, there is a high coordination cost in going back on our commitments. Looking at the [Meta EIP](https://eips.ethereum.org/EIPS/eip-7600), we had decided to Include all of devnet-3 + PeerDAS \u0026 EOF already. Both PeerDAS and EOF are significant changes and even if they are \"80% done\", the last 20% of the work tends to take 80% of the time. \n\nTo not lose momentum, it feels best to get both of them running smoothly on devnets and, **when we've done that (but not before!),** we can discuss further additions. In practice, what we could do is agree to only CFI additional Pectra EIPs for now and once PeerDAS and EOF are stable (meaning we feel we have additional engineering cycles to add more EIPs to pectrb devnets), we choose from the CFI list. \n\nI think it's important that when we choose additions we consider a full set of possibilities and not EIPs as one-offs. When considering EIPs one-off, we often bias towards \"implementation readiness\", but IMO that's only one of the factors we should consider. Other important ones are \"value to the protocol\" and \"capacity to include in the fork\" . If we look at a list of proposals, we may very well choose one that's a bit more work to implement but we feel brings disproportionate value. \n\nTL;DR: I propose we keep PectrA as devnet-3 EIPs + polish (Alex's proposal), start PectrB with EOF + PeerDAS, continue CFI'ing other EIPs for PectrB if we want,  and once  we have a solid pectrb-devnet running (again, not before!), consider extra EIPs for inclusion in PectrB.",
        "created_at": "2024-09-19T17:04:31.978000+00:00",
        "attachments": null
    },
    {
        "author": "rjected",
        "category": "general",
        "parent": "",
        "content": "Testing call",
        "created_at": "2024-09-19T18:08:22.179000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "**ACDC #142 summary**\n* Began the call with Pectra\n  * Touched on status of `pectra-devnet-3`; it has been launched and generally going well\n    * deployed a “bad block” fuzzer which surfaced some bugs; relevant teams are debugging\n  * Turned to discuss how to handle scoping of the current Pectra fork into a more manageable size\n    * Lots of convo, with many different perspectives across core devs here; catch the recording for the full discussion\n    * Landed on two key decisions to make\n      * Do we focus on the EIPs currently deployed to `pectra-devnet-3` as a target for Pectra (next hard fork)?\n      * Assuming we split off `pectra-devnet-3` from the rest of development for the Pectra hard fork, do we want to determine the scope of the hard fork _after_ Pectra?\n    * Again, many inputs and ideas but we agreed to determine the Pectra hard fork as the EIPs currently deployed to `pectra-devnet-3`.\n      * There’s still some polish for this EIP set remaining, but the timeline from devnet-3 to mainnet is order of a few months as we move to a ‘spec freeze’ for Pectra and keep iterating devnets along the way to testnet and ultimately mainnet.\n    * There was a lot less consensus around determining the scope of the fork after Pectra. Obvious candidates are EOF and PeerDAS (having already been scheduled for Pectra so far), but there is some uncertainty around other features like Verkle, or additional EIPs with benefits like EIP-7688.\n    * We agreed to move ahead with pushing `pectra-devnet-3` to production, and tabling the conversation around the scope of the next fork until a later ACD call.\n        * check Tim's suggestion on how to think about the second fork here: https://discord.com/channels/595666850260713488/745077610685661265/1286372367177748643",
        "created_at": "2024-09-19T21:29:12.075000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "* Next, we looked at a number of open PRs concerning the “polish” of the devnet-3 feature set so that we can get to a spec freeze ASAP.\n    * Check the agenda for the full set.\n    * In particular, client teams should check out these changes to the consolidation and deposit flow that are required to mitigate potential DoS issues around the handling of these operations\n      * https://github.com/ethereum/consensus-specs/pull/3918\n      * https://github.com/ethereum/consensus-specs/pull/3818\n    * We also discussed some changes to attestation refactoring that would be nice, although there is some concern it will lead to an outsized ask in terms of code change — it would be great to get another client team or two to add their perspective to these PRs\n      * https://github.com/ethereum/consensus-specs/pull/3900\n        * arnetheduck will update to cover the validator behavior this PR touches\n      * https://github.com/ethereum/consensus-specs/pull/3787\n* After the Pectra discussion, we moved to look at the status of PeerDAS and a consideration of the blob parameters\n  * A quick check-in on PeerDAS devnets: teams are still working on implementing the latest specs and debugging local issues\n  * Then, had a presentation to support raising the target and/or max blob count in Pectra (with consideration for these changes going into the fork _after_ Pectra as well)\n    * https://docs.google.com/document/d/1mkxfhDNvbT6jFEjH3e6LADsGGh3jEvL_WOt2glFbFfA/edit#heading=h.v2qm0jqcd4bj\n  * This proposal touches on the fork scheduling conversation above, and as we can expect there are lots of views/inputs to this decision\n  * An interesting point was raised around the deployment of `IDONTWANT` in the gossip layer, as this feature should save some bandwidth for a node and give us more room to consider raising the blob parameters, even ahead of PeerDAS\n    * Implementation is under way, but clients have different amounts of progress here",
        "created_at": "2024-09-19T21:29:36.525000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "* Consensus on the call was that raising the blob target in Pectra could be reasonable, especially pending further mainnet analysis that supports the headroom for an increase\n    * Otherwise, it seemed too risky to raise the maximum blob count without PeerDAS",
        "created_at": "2024-09-19T21:29:40.743000+00:00",
        "attachments": null
    }
]