[
    {
        "author": "daniel.kirchner",
        "category": "general",
        "parent": "",
        "content": "To formally confirm: Solidity is strongly in favour of EOF and, thus, in particular supports its inclusion in Prague. Radek has rebased and updated our previous prototype implementation as proof of concept (thanks a lot again) - once we have confirmation about the inclusion we'll finalize it to be production-ready. EOF simplifies compiler development - for us and in general - significantly, and evidence so far indicates that we can expect improvements in all applicable metrics. I can't overstate EOF's benefits in decreasing the overall complexity of code generation.",
        "created_at": "2024-05-22T11:07:13.821000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE tomorrow (May 23) 14:00 UTC**\nAgenda: https://github.com/ethereum/pm/issues/1043\nStream: https://youtube.com/live/jO-BbmSsT_0 \n\nWill share the YT link prior to the call here.",
        "created_at": "2024-05-22T14:14:53.954000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "https://github.com/ethereum/pm/issues/1043#issuecomment-2124981927  we are pitching a Q1 2025 Pectra incl EOF from EL, and would love for a blob count bump as well which also requires EL HF and PeerDAS from CL side",
        "created_at": "2024-05-22T14:43:26.367000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "If we continue adding stuff to this I'll pitch ePBS as well 🙂",
        "created_at": "2024-05-22T14:44:43.332000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Of note we're only recommending things here where the design is done and there exists meaningful implementation progress. PeerDAS was tested during devnet-0, and EOF is implemented and tested in multiple clients + Solidity fork. So while we're recommending extra \n scope, we're being mindful about what it means to ship it",
        "created_at": "2024-05-22T15:58:29.587000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "FYI, last week the L1 client and testing/research/devops teams had a F2F interop event to work on Pectra, PeerDAS and Verkle. I just published a recap of the week, which I've also linked on the agenda for tomorrow. Sharing here too for anyone who wasn't present to get up to speed 🙂 https://blog.ethereum.org/2024/05/22/nyota-interop-recap",
        "created_at": "2024-05-22T16:22:52.681000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "In a similar manner, we've written down some thoughts on what the fork could look like and tried to focus on our current options: https://notes.ethereum.org/@ethpandaops/pectra-fork-thoughts",
        "created_at": "2024-05-22T19:36:54.175000+00:00",
        "attachments": null
    }
]