[
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "**ACDC #134 recap**\nThis call was packed with various discussions around scoping the upcoming Pectra hard fork.\n* Began with a recap of devnet-0, which generally went really well!\n* Next, covered a variety of updates, extensions or modifications to the existing EIP set\n* Then turned to a new EIP (number 7688) to consider inclusion reflecting learnings from devnet-0\n* Touched on early PeerDAS devnet alongside devnet-0, which also went very well given how early the implementations are\n* Spent the rest of the call discussing fork scoping for Pectra\n  * Check out the call for the full color\n  * Many teams/contributors expressed a variety of options\n  * Rough consensus formed around the importance of PeerDAS\n  * To reflect an intent to include PeerDAS in Pectra, while derisking feature sets and timelines, client teams agreed to build PeerDAS as part of the Electra fork with a separate activation epoch\n    * If PeerDAS R\u0026D goes well, this activation epoch can simply be the Pectra fork epoch\n    * If client teams discover difficulties with PeerDAS after implementation over the coming months, we have the option to set the PeerDAS activation epoch _after_ the Pectra epoch (including possibly setting it so far in the future we would be able to schedule for a future hard fork)\n  * Otherwise, we agreed to keep the existing Pectra scope as is\n* We didn’t quite have time to finish the discussion around EIP-7688 (stable container SSZ upgrade), which we will cover on the next call!",
        "created_at": "2024-06-01T01:53:21.079000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "What are people's thoughts around raising the blob target?",
        "created_at": "2024-06-01T05:33:09.512000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "that's a hard fork, and is needed to actually get the benefits from PeerDAS",
        "created_at": "2024-06-01T05:33:27.740000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Negative because Ethereum has an extremely bad state growth problem and we should exercise some self-imposed constraints that disallow any increase in rate of state growth until *after* the state problem is addressed.  This will put pressure on us to actually fix the state problem instead of just kicking the can down the road more and more and continuing to increase state growth.",
        "created_at": "2024-06-01T06:54:32.281000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If enabling PeerDAS is believed to decreases state growth on net (particularly for regular nodes), then we should decrease something else (like gas limit) by a comparable amount until such time as PeerDAS lands and shows meaningful reduction in state or state growth.",
        "created_at": "2024-06-01T06:56:52.419000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think we should be focusing efforts on 4444, Portal Network integration, state expiry, and similar things before we seriously consider any *increases* to the amount of data nodes need to store at any point in time.",
        "created_at": "2024-06-01T06:58:15.333000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cfradamt\u003e \u003e \u003cfradamt\u003e  Blobs do not cause state growth (re @allcoredevs_bot: \u003csky.cactus\u003e [reply]: Negative because Ethereum has an extremely bad state growth problem and we should exercise some self-imposed constraints that disallow any increase in rate of state growth until *after* the state problem is addressed.  This will put pressure on us to actually fix the state problem instead of just kicking the can down the road more and more and continuing to increase state growth.)",
        "created_at": "2024-06-01T07:21:54.027000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003e Blobs do not cause state growth\nThey increase the disk size required to run an Ethereum node.  It is a fixed amount, unlike state, but it is still an increase in disk size required.",
        "created_at": "2024-06-01T07:27:26.147000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "it's truly tiny though; increasing from 3 to 6 would only add 3 * 128 kB * 32 slots/epoch * 4096 epochs = 48 GB of storage reqs. The recent proposed change to 4444 to reduce the storage period from 12 months to 6 makes up for that 5 times over",
        "created_at": "2024-06-01T08:11:38.193000+00:00",
        "attachments": null
    },
    {
        "author": "dapplion",
        "category": "general",
        "parent": "",
        "content": "Waiting for a hard-fork to raise the blob target appears very limiting. This limitation is completely self-induced, as no new code is required in clients to support the increase. Are there strong opinions against having a dynamic consensus mechanism to raise the blob-target similar to the execution gas target?",
        "created_at": "2024-06-01T08:28:58.469000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Lets do 4444 first then, so we get the 250GB reduction before we add another 50GB.  Also, I wouldn't call 50GB \"tiny\", I think we have just completely forgot that we want regular users to be able to run a node locally.  😢",
        "created_at": "2024-06-01T10:07:16.918000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I hold my opinion above quite strongly.  😄  You are correct, the limit would be self imposed.  The reason we need to self impose a limit is because reducing state keeps getting delayed/shelved in favor of other things and I think we need to take very intentional steps to stop doing that, and self limiting is such a step.",
        "created_at": "2024-06-01T10:08:32.953000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "State Expiry, 4444, Portal Network are all things we have had on the roadmap for years, and while progress is made on the latter two, it is slow because it isn't a priority for most people.  By blocking state growth things people want (like PeerDAS, bigger blobs, etc.) we get people to focus efforts on solving the state growth problem so they can \"unblock\" the projects that they are interested in.",
        "created_at": "2024-06-01T10:10:11.424000+00:00",
        "attachments": null
    },
    {
        "author": "dapplion",
        "category": "general",
        "parent": "",
        "content": "On a philosophical it's more of node implementors imposing the limit on node runners",
        "created_at": "2024-06-01T10:10:37.042000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\"Protocol developers blocking changes to the protocol that increase state size for all nodes in the network\" is how I would phrase it.",
        "created_at": "2024-06-01T10:11:34.870000+00:00",
        "attachments": null
    },
    {
        "author": "dapplion",
        "category": "general",
        "parent": "",
        "content": "We could have a hybrid approach: a hardcoded limit to a blob target that is unnacceptable or not intended to be reached until the next hard-fork, and then allow increases from the current value up until the hardcoded value",
        "created_at": "2024-06-01T10:12:27.324000+00:00",
        "attachments": null
    },
    {
        "author": "dapplion",
        "category": "general",
        "parent": "",
        "content": "I am coming more from a logistical point of view, we may want to increase the blob target in more frequent steps than hard-forks.",
        "created_at": "2024-06-01T10:13:41.385000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Do we have ways to decrease disk requirements for Ethereum clients that don't require hard forks?  If not then I point back to my original argument that we shouldn't do *any* disk size increasing changes to the protocol until we first remove some (which I think requires hard forks).  If it were up to me, I would require 2 bytes decrease for every 1 byte increase, to ensure we trend towards less disk (relatively, after drive size increases) than today.",
        "created_at": "2024-06-01T10:15:04.784000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Philosophically, I'm not sure that handing custody over protocol to stakers is the right choice.  In *theory* the protocol developers are a trusted custodian of long term network health and ethos.  Stakers are generally assumed to be short term profit motivated.  If we hand control over X to stakers, we should assume they will optimize for their short term profit which likely means cranking the disk utilization up to 10, as they shouldn't be assumed to care about decentralization and censorship resistance.",
        "created_at": "2024-06-01T10:17:08.616000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "\u003chttps://glados.ethdevops.io/\u003e",
        "created_at": "2024-06-01T10:18:49.758000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "image.png",
                "content": "272383bc756b6f0ab47f7e4491037835b455ea28a08ab4ad50440b17f7152304"
            }
        ]
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "Another thing to note is the Portal History Network is ready with all pre-merge history",
        "created_at": "2024-06-01T10:19:15.897000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "My understanding of 4444's is that it will take place in 2 stages\n- dropping genesis to pre-merge\n- pre-merge to last 6 month (or a year)",
        "created_at": "2024-06-01T10:20:18.607000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "After each of these stages are activated getting block history within the respective periods will be disabled network wide on devp2p, and other p2p networks like the Portal History Network will be used to get block history (which can be used to maintain the current json-rpc experience for users or expand it)",
        "created_at": "2024-06-01T10:22:06.091000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "Syncing will no longer occur from genesis for 99% of nodes, but checkpoint sync will be used",
        "created_at": "2024-06-01T10:23:18.879000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "People can still run archival nodes, but they will bootstrap through era1 files or other bulk block history formats",
        "created_at": "2024-06-01T10:24:01.442000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "We should have a draft eip for Portal History up around this week. I believe Piper has a Portal History onboarding breakout room or acde talk booked (or will be soon). We are also doing Portal to EL team calls right now with EL teams who are eager to learn more.",
        "created_at": "2024-06-01T10:31:36.793000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "The goal would be for a group of EL clients to implement Portal history in parallel. As cross client development has proven in the past to accelerate the progress of any EIP. We have a suite of tests in ethereum/hive which will help on boarding clients as well",
        "created_at": "2024-06-01T10:36:05.975000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "Our golang implementation of Portal History was built by an open source team in China in a timeframe of roughly 6 months. They haven't really asked us for help, mostly relying on our hive tests and reading our reference implementations. We are more then happy to offer help (they just didn't ask)",
        "created_at": "2024-06-01T10:38:33.938000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "If anybody has more questions about Portal History in the context of 4444's you could ask me or check \u003c#953349957400821860\u003e which has a pinged message",
        "created_at": "2024-06-01T10:39:35.942000+00:00",
        "attachments": null
    },
    {
        "author": "0xunclebill",
        "category": "general",
        "parent": "",
        "content": "Keeping blob fees low encourages users to use L2s which helps scale ethereum and arguably reduces state growth on L1. Also, our targeted user base isn’t just people running nodes. I agree that we should allow for a more dynamic max blob count mechanism, especially post PeerDAS",
        "created_at": "2024-06-01T13:36:24.644000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "I think Micah's arguments still hold that this continues the trend of prioritizing new features over addressing long standing problems and making meaningful reductions to user disk usage. Reduction of growth rate is not the same as actual disk utilization reduction.",
        "created_at": "2024-06-01T15:01:12.324000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "To be clear, I'm not suggesting that we should treat these as a dichotomy where we must choose one or the other but not both.",
        "created_at": "2024-06-01T15:13:59.225000+00:00",
        "attachments": null
    },
    {
        "author": "rudolf6",
        "category": "general",
        "parent": "",
        "content": "Just to understand, is part of the question whether to actually raise the blob count _prior_ to shipping PeerDAS? \n\nalso, are there any latest testing numbers floating around on how much we can safely bump it up 🙏",
        "created_at": "2024-06-01T15:58:21.984000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e \u003e \u003cdankrad\u003e  Stakers have had control over the gas limit since the beginning, and what you describe hasn't played out at all. (re @allcoredevs_bot: \u003csky.cactus\u003e Philosophically, I'm not sure that handing custody over protocol to stakers is the right choice.  In *theory* the protocol developers are a trusted custodian of long term network health and ethos.  Stakers are generally assumed to be short term profit motivated.  If we hand control over X to stakers, we should assume they will optimize for their short term profit which likely means cranking the disk utilization up to 10, as they shouldn't be assumed to care about decentralization and censorship resistance.)",
        "created_at": "2024-06-01T16:17:15.337000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Stakers would be far more likely to exclude blobs altogether if they only cared about their own profit. Blobs pay proposers next-to-nothing and result in far larger blocks that are more likely to be orphaned.",
        "created_at": "2024-06-01T16:23:36.801000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e this can be remedied by demanding larger tips",
        "created_at": "2024-06-01T16:26:40.077000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "There is no mechanism for individual proposers to advertise the tip they may require to include blobs.\n\nAs to if proposers start to consider blobs at the current tip rate not worth including, I suspect the majority will not purely because it would require custom software to build such payloads.\n\nBut my original comment was to the suggestion that if proposers had a choice they would include as many blobs as possible to increase their profits, as adding more blobs comes with downside risk.",
        "created_at": "2024-06-01T16:33:10.641000+00:00",
        "attachments": null
    }
]