[
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "ACDC in ~20 minutes (14:00 UTC)\nAgenda: https://github.com/ethereum/pm/issues/1003\nStream: https://www.youtube.com/watch?v=ZqxDq1aJxHc\nZoom: https://ethereumfoundation.zoom.us/j/91725886939?pwd=b2kzT0JGeFAzTmhyb1BYSTgrZ0xwdz09",
        "created_at": "2024-04-04T13:40:09.096000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "PR for the Retro Meta EIP: https://github.com/ethereum/EIPs/pull/8389",
        "created_at": "2024-04-04T16:36:54.801000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "**ACDC Recap**\n\n* Clarified handling of fork digest in gossip topics for exits, now that their signatures are locked to an earlier fork\n* Discussed the recent network outage due to interactions with Bloxroute’s relay and BDN\n* Reviewed included Electra EIPs to agree to an initial scope for `pectra-devnet-0`\n  * 6110: mostly ready, may rework pending deposits to simplify processing on-chain\n  * 7002: updates outstanding for the predeploy to handle partial withdrawals; updates to the EIP and Engine API to follow that\n  * 7251: core is in place, two big questions: (1) custom ceilings for setting a “withdrawable balance”, (2) EL-initiated consolidations (which would touch 7002). Both of these require further community input to assess demand and find right trade-off for resulting complexity. Keep an eye out for a breakout room to discuss further!\n  * 7549: mostly ready, may update to make on-chain aggregation more flexible for better packing efficiency\n* Discussed client implementation status of the above EIPs\n  * Each client has a different subset of the EIPs implemented to varying degrees. Client’s top focus over the coming month(s)!\n* Discussed other EIPs to include aside from the above in an initial Electra scope\n  * Inclusion lists came up, still some uncertainty around interactions with AA; expect to discuss further on next ACDE\n* Called out an initial electra PR for the `consensus-specs`: https://github.com/ethereum/consensus-specs/pull/3615. Expect the above to be reflected here soon, and test vectors along the way!\n* Wrapped the call with a discussion on PeerDAS\n  * there has been good progress on spec and initial work on implementation\n  * we touched on potential networking complexities that would bar a “progressive” rollout and will wait for further mainnet data to find the next best steps for data scaling in Electra",
        "created_at": "2024-04-04T17:59:49.797000+00:00",
        "attachments": null
    }
]