[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "ACDE in 1h. Agenda \u0026 stream above, zoom here: https://ethereumfoundation.zoom.us/j/91348592283?pwd=SnRnL1VTeXNYVE9CaWpBbnJEUXhQZz09",
        "created_at": "2024-05-09T13:02:55.935000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "One general observation when discussing exciting updates: It seems like many times there's a topic brought up and the first thing discussed is \"when\" and not necessarily \"why\", and not having a full on cost/benefit analysis on the feature being discussed. \n\nAnd I wonder if other people share the feeling that this observation is true? \n\nMy view is we should always have a clearly written motivation section in any idea. That motivation should be accompanied by industry-driven evidence, and not our own views. That should hopefully let us prioritize better and allocate resources appropriately.",
        "created_at": "2024-05-09T15:09:00.441000+00:00",
        "attachments": null
    },
    {
        "author": "nixo.eth",
        "category": "general",
        "parent": "",
        "content": "stream is silent fyi",
        "created_at": "2024-05-09T15:10:11.252000+00:00",
        "attachments": null
    },
    {
        "author": "niard.eth",
        "category": "general",
        "parent": "",
        "content": "It's back up we had a small Zoom issue",
        "created_at": "2024-05-09T15:11:35.998000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003ctimbeiko\u003e Apologies: when zoom crashed, OBS was stuck on the \"old\" window.",
        "created_at": "2024-05-09T15:11:49.332000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Also process-wise, I love the multidim proposal personally and captures a lot of my/reth views, but I wish we gave people some more lead time to read it (this also happened with the MVI proposal), so that we can have a high context conversation.\n\nIn addition it seems like the time could be utilized for things necessary to be decided on in the coming weeks, right? (vs we don't have a clear next step right this moment)",
        "created_at": "2024-05-09T15:13:15.365000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Do we have a rough timeline from the Solidity team on EOF support / who's owning it (if anyone)? Who's the right person to ping for this?",
        "created_at": "2024-05-09T15:54:15.014000+00:00",
        "attachments": null
    },
    {
        "author": "gregthegreek",
        "category": "general",
        "parent": "",
        "content": "\u003c@\u0026688090867927482525\u003e are you still blocking pre-155 transactions at the mempool by default?",
        "created_at": "2024-05-09T16:49:41.415000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "Yes, you can enable them with --allow-unsafe-transactions",
        "created_at": "2024-05-09T16:56:27.782000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE Recap**\n\n**devnet-0**: \n-the EF devops team is prepping the kurtosis config files and should be ready to start launching things early next week! A few EL teams have finalized their implementations, and Grandine has completed theirs on the CL side. Other teams are at various stages of completion. \n- Lighthouse brought up some changes are required to `getPayloadBodies` to support 6110/7002 messages. Some EL clients have implemented the additions to the method despite the spec not supporting them yet. \n- On the EL testing side, all EIPs have python test cases except for 3074, with new 2935 just added\n\n**AA Breakout Recap**\n- A lot was discussed on the call, but the most notable update is the introduction of EIP-7702 as a potential alternative to 3074. While many details still need to be ironed out, there is broad support for the overall proposal. We'll discuss further on the next call, and until then the conversation will continue here: https://ethereum-magicians.org/t/eip-7702-set-eoa-account-code-for-one-transaction/19923\n\n**EIP-7685**\n- \u003c@881905303011086387\u003e raised some concerns about 7685 and Optimistic Sync: the EIP introduces fields to the EL block header that aren't part of the CL ExecutionPayload, which would break Nimbus's optimistic sync implementation. It seems like the values can be calculated on the CL side directly and solve the issue. Etan will confirm whether this is the case. \n- Etan also raised the idea of introducing SSZ to replace the MPT roots used in 7685. There wasn't much support for this on the EL side, but it did raise the question of if/when/how we should prioritize SSZ. \n\n**EOF**\n- EOF now has a Meta Spec 🎉 ! https://eips.ethereum.org/EIPS/eip-7692\n- There is also a new EIP for creation transactions: https://eips.ethereum.org/EIPS/eip-7698\n- Given EOF was already \"broadly\" CFI'd we agreed to CFI both of these as well, PR here: https://github.com/ethereum/EIPs/pull/8544\n\n(char limit hit --- cont'd after!)",
        "created_at": "2024-05-09T17:12:12.900000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**EIP-7623**\n- \u003c@418000431814279181\u003e had some concerns about 7623. He shared a presentation outlining them: https://docs.google.com/presentation/d/1IUJ2TmcNdJbagPEjpZoBohpXEyjfaTJ8FZT4kydJDak/edit#slide=id.p\n- Vitalik had a blog post on the topic today (https://vitalik.eth.limo/general/2024/05/09/multidim.html) and he also shared his views on the call. \n - A few EL devs noted their concerns with the proposal, and \u003c@486477492434239488\u003e highlighted that if we want to consider EIP-7623 in the context of a blob limit increase, we should have someone start researching what a safe blob count increase would be ASAP. \n\n **Re-entrency Protection**\n- \u003c@408154589494247424\u003e presented an EIP draft to prevent re-entrency in contracts: https://github.com/ethereum/EIPs/pull/8543/files. He drafted this as an alternative to EIP-7609, which proposes to lower the cost of transient storage to solve the same issue. No decisions made on this. \n\nAnd that was it!",
        "created_at": "2024-05-09T17:16:51.629000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "general",
        "parent": "",
        "content": "\u003c@450651770243252225\u003e is currently working on updating the implementation to the latest spec.",
        "created_at": "2024-05-09T18:19:44.593000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Eip155",
        "created_at": "2024-05-09T18:53:56.776000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Is there a link to the matrix Verkle channel?",
        "created_at": "2024-05-09T22:22:37.086000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "general",
        "parent": "",
        "content": "Thanks for the summary!\n\nYep, for the SSZ timing, Electra has certain aspects speaking in its favor.\n1. Generalized indices in `BeaconState` break, making everyone on an EIP-4788 verifier have to redo their logic to adjust for new proof shape. As the SSZ transition also breaks proofs (but only a single time), would be a good opportunity as the downside of a breaking proof shape is already being realized in Electra.\n2. EIP-7022 introduces a new transaction type that would fit in nicely with EIP-6493 (an extra SSZ `Variant` is all that's needed). Delaying SSZ means that there is yet another tx type to deal with, they are extremely difficult to obsolete later on (technically, even replayable legacy transactions without chain ID are still supported in the EVM)\n3. EIP-7685 adds a workaround motivated by extending the block header with an MPT becoming too annoying. These problems don't exist with SSZ, as evidently, the same proposals (EIP-6110 etc) propose.. simply extending the CL ExecutionPayloadHeader with new lists. As Electra adds a new MPT, it's another chance where SSZ could help now.\n4. F-fork with its Verkle focus will unlikely have appetite for introducing more major items along with it into the EL. Missing Electra for SSZ means that it likely gets delayed even more.\n\nThe general verdict among EL folks from the call seems to be weakly opposed.\n1. SSZ libraries are not ready. Keep in mind that the library does not need to be crazily efficient, the large items such as `BeaconState` are not being hashed in the EL.\n2. Too many breaking changes. At the minimum, only the MPT get replaced. But, it is true that there may be internal implementation changes necessary to support it.\n3. No benefit for core developers. True in the immediate sense, the benefits unlock over time. After Verkle, MPT logic is only needed by archive nodes.\n\nUser benefits are:\n1. Compact proofs for JSON-RPC API --\u003e decentralized API access\n2. Stable EIP-4788 verifiers (rocketpool etc)\n...",
        "created_at": "2024-05-09T23:13:14.046000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "general",
        "parent": "",
        "content": "I'll next work on making a devnet for exploring SSZ with nimbus/lodestar CL + nimbus EL. That way estimation of the effort required is more realistic. Would be better to have a more mature EL on board, but that's what I have available so far.",
        "created_at": "2024-05-09T23:16:27.703000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "general",
        "parent": "",
        "content": "About the EIP-7685, will check whether optimistic sync is affected, based on lightclient's suggestion. Can look into it during next 1-2 weeks, but the explanation seems plausible enough to me, especially as type 2 requests (consolidations) don't seem to exist yet. type 0/1 info is in theory available to the CL.",
        "created_at": "2024-05-09T23:18:58.440000+00:00",
        "attachments": null
    }
]