[
    {
        "author": "cortze",
        "category": "general",
        "parent": "",
        "content": "Hey folks, could someone get a status update on [this PR](https://github.com/ethereum/go-ethereum/pull/30283) ? ( it adds a QUIC entry to the enode in `go-ethereum`)\nIt seems to be fine and ready to be merged but it's still hanging. CC: \u003c@194432762315407360\u003e",
        "created_at": "2024-09-13T09:59:20.098000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "Hey, I will look into it again today. Been busy with another project sorry.",
        "created_at": "2024-09-13T10:00:51.133000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "Also please do not use this channel for Geth PR comms, you can send me a DM next time if you want!",
        "created_at": "2024-09-13T10:01:30.811000+00:00",
        "attachments": null
    },
    {
        "author": "cortze",
        "category": "general",
        "parent": "",
        "content": "ohh sorry, will do next time! Thanks!",
        "created_at": "2024-09-13T10:06:06.098000+00:00",
        "attachments": null
    },
    {
        "author": "gwintery",
        "category": "general",
        "parent": "",
        "content": "Fusaka Fork Focus",
        "created_at": "2024-09-13T11:40:58.384000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "(sorry to spam ACD channel)\n\nHi all, I apologize for my extended absence beyond the 3 months originally discussed. After much reflection, I'm going to step away from my roles at the EF and the L1 ecosystem. This is one of the hardest decisions that I've ever made, but just on a personal level, it's time to move on.\n\nFortunately, Ethereum R\u0026D looks way different and far more healthy than it did many years ago. There are many incredible teams, strong clients, and leaders at the table. The R\u0026D group and the protocol is resilient to change and to failures. I'm sure y'all barely even noticed I was gone 🙂\n\nThere's still plenty of work to do, but Ethereum is in a strong place and I'm extremely confident in your ability to do what needs to be done.\n\nMy main parting advice here is to seek \"sufficiency\" and no more. Sufficient features, sufficient scale, sufficient extensibility, at the lowest sufficient complexity. Ethereum is complex and governing it might be even more so. Keep it simple, simple as possible.\n\nI have a bit more in this note here -- https://github.com/djrtwo/writing/blob/main/docs/2024-09-13_goodbye-for-now.md\n\nI won't be engaged on the day to day or month to month anymore, but you can always reach out to me if you want to catch-up or have something fun you want me to take a look at.\n\nI wish you all the best. I look forward to following along, and catching up with my many friends and collaborators in the coming months and years.",
        "created_at": "2024-09-13T17:40:02.350000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "general",
        "parent": "",
        "content": "Hi Danny, we never had the chance to talk in person but I will miss you dearly. Oddly enough, I will not miss your technical expertise that much as we have many more very talented individuals working on Ethereum. The main reason is that your every speech ended with \"remember to keep a healthy work-life balance and take care of yourself\". I think this is of utmost importance because no matter how smart you are, if you get depressed or burnt-out, you will accomplish less that you could have if you paid more attention to your overall well-being. I wish more leaders in the space had the same attitude as you.\n\nGiven all of the above, I am not surprised you decided to move on. Take care of yourself 😄",
        "created_at": "2024-09-13T20:54:42.022000+00:00",
        "attachments": null
    }
]