[
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "One extra concern with reducing slot time is that it makes SSF trickier",
        "created_at": "2024-10-07T01:07:27.276000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "so I would not mess with slot time until SSF is a solved problem",
        "created_at": "2024-10-07T01:07:46.726000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "if you don't increase blob count at all and reduce the slot time to 8 seconds, then by definition you are increasing the peak bandwidth requirement",
        "created_at": "2024-10-07T13:23:19.751000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "less than directly increasing blob count",
        "created_at": "2024-10-07T13:24:29.014000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "because its over two time periods/edges; rather than one edge",
        "created_at": "2024-10-07T13:24:48.669000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "much like ePBS decreases peak bandwith by moving CL and EL activty apart rather than at same time",
        "created_at": "2024-10-07T13:26:12.334000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "total bandwith will be the same (or slightly more due to more CL votes)",
        "created_at": "2024-10-07T13:27:13.298000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "CL is most of the bandwidth though - which is why it probably will not be that different from a direct increase",
        "created_at": "2024-10-07T13:27:54.119000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Not  really clear, you get 33% less time to broadcast and get the blobs in time for attesters. That would be roughly the same as a 33% increase in the limit today without changing the slot time.  ePBS mechanism to reduce the bandwidth requirement is drastically different: it moves the validation entirely to the next slot, so even with 8 seconds slot (which I don't think we can achieve) validators would get 6 seconds to validate DA instead of 1.5-2 with this proposal.",
        "created_at": "2024-10-07T13:59:51.209000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "general",
        "parent": "",
        "content": "Testing call started 1 min ago: https://ethereumfoundation.zoom.us/j/86466169680?pwd=x17cbD1lDCeQEWMTTOLARQhELiJV21.1",
        "created_at": "2024-10-07T14:02:02.139000+00:00",
        "attachments": null
    },
    {
        "author": "marioevz",
        "category": "general",
        "parent": "",
        "content": "Summary from the testing call:\n`pectra devnet-3`:\n- Lighthouse bug when proposing blocks, there's a PR that is open with the fix: https://github.com/sigp/lighthouse/pull/6464.\n- Besu bug is still pending to be resolved with an open PR:  https://github.com/hyperledger/besu/pull/7717.\n\n`pectra devnet-4`\n- There was a discussion on whether the CL should send back the entire list of requests to the execution layer, the decision at first was to leave the specs as is, which entails sending the full requests list. At a later point on the call, \u003c@755590043632140352\u003e  raised concerns regarding the amount of data being serialized and JSON-formatted in Engine API is an unnecessary overhead, and it should be simplified to sending a simple hash that the CLs should compute (not hash-tree-root but a different sha256 commitment). At the end of the call, the sentiment changed to agree that we should apply this change and the CL should simply compute the hash and send it back instead of the full list, therefore the PRs need to be updated. On-going discussion can be found in this thread: https://discord.com/channels/595666850260713488/1288408367068610585\n\n- Open PRs\n  - [Beacon API] [Update submitPoolAttestationsV2 endpoint](https://github.com/ethereum/beacon-APIs/pull/472) decision to skip this for devnet-4 on the grounds that is not ready.\n  - [Builder API] [add initial electra spec](https://github.com/ethereum/builder-specs/pull/101): requires Engine API changes to be merged first\n  - [Consensus-specs]: [eip7685: Pass execution_requests to notify_new_payload](https://github.com/ethereum/consensus-specs/pull/3950) At the time of writing this contains the full requests being sent back to the execution layer, needs a rework to send only the requests commitment hash (as specified in https://github.com/ethereum/EIPs/pull/8924) instead.\n  - [Engine API]: [engine: Make execution requests a sidecar, take 2 ](https://github.com/ethereum/execution-apis/pull/591): At the time of writing this PR is currently specified to send the full requests lists in the `engine_newPayloadV4`, and needs to be updated to send the requests hash.\n  - [Execution EIP] [Update EIP-7702: add several clarifications to align spec with tests](https://github.com/ethereum/EIPs/pull/8906), no opposition regarding this PR, should be accepted and merged for Devnet-4.\n  - [Execution EIP] [Update EIP-7702: Do not allow authorization nonce equal to 2**64 - 1](https://github.com/ethereum/EIPs/pull/8905), also no opposition regarding this PR, should be accepted and merged for Devnet-4.\n  - [Execution EIP] [Update EIP-7702: restrict field sizes](https://github.com/ethereum/EIPs/pull/8929) needs an update to move from draft status and be merged for devnet-4.\n\n`eof`\n- Not many updates from last week, path forward is waiting on devnet-4 to be released and then rebase Osaka (which contains only EOF at the time being) on top of it in order to launch osaka-devnet-0 at some point in the coming weeks.\n- https://github.com/ethereum/execution-spec-tests/pull/869 is an open PR to the execution layer tests that has been prepared to rebase EOF to be in Osaka.\n\n`peerDAS`\n- Devnet-3 was launched with the same spec as devnet-2 in order to have a working devnet, but 14-15 hours ago there was an issue that caused all clients to be on their own different fork, and at the moment there is no lead on the culprit.",
        "created_at": "2024-10-07T15:28:11.216000+00:00",
        "attachments": null
    }
]