[
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Can't say that I understand this. There are perhaps two pieces of software in addition to the consensus and execution clients (mev boost and vouch) that are used by a decent percentage of the network, and it makes sense to include them as the aim is to ensure the network is upgraded as fully as possible.\n\nI'm not sure what the rationale is for excluding them.",
        "created_at": "2024-03-13T11:36:20.459000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "In short, keeping the scope narrow. I'd rather avoid maintaining a (growing) list of \"plugins\" that we need to track, feel comfortable enough with to recommend both generally and at a specific version in these posts. Additionally, we've tried moving away from mentioning specific \"products\" (e.g. naming wallets/exchanges) in these posts as people would then perceive them as \"Official ™️ \" \n\nAlso, even with the growing number of clients listed, and their different releases processes, my sense is we should be pushing users to actually go and read a specific client's release page and understand what they are downloading vs. training them to click whatever is in the EF blog post 😅 That said, I think it's totally reasonable for clients to list out the vouch/mev-boost/other dependency versions they recommend on their release pages!",
        "created_at": "2024-03-13T12:55:52.677000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Are there realistically more than the 2 I mentioned, though? We're talking about versions of software specifically needed to keep the network going.",
        "created_at": "2024-03-13T14:04:03.756000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I personally prefer to keep a clean distinction at \"the blog only mentions client releases\", but happy to open the can of worms again when we get to the next fork! It _seems_ like this time around things worked out?",
        "created_at": "2024-03-13T14:35:11.465000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "... and on that note, **huge congrats to everyone for shipping Dencun 🎉 !** It's been literally years in the making and it's wild to see it happen so smoothly 😄 !",
        "created_at": "2024-03-13T14:35:54.587000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Staying on schedule, we'll go over the upgrade, as well as proposals for Pectra on tomorrow's ACDE, at 14 UTC (double check your local (DST?) time!) 🫡 \n\nAgenda: https://github.com/ethereum/pm/issues/976\nStream: https://youtube.com/live/US8T0ZoGF8s",
        "created_at": "2024-03-13T14:37:20.790000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "I'd distinguish a bit between Vouch (which is, after all, a client) and `mev-boost` (which exists solely to interact with offchain resources)",
        "created_at": "2024-03-13T14:38:21.451000+00:00",
        "attachments": null
    },
    {
        "author": "sauliusgrigaitis",
        "category": "general",
        "parent": "",
        "content": "Congrats to everyone on the successful hardfork! To celebrate this - a small announcement from Grandine team - our consensus layer client is open-source now! https://twitter.com/grandineio/status/1767915448895500469",
        "created_at": "2024-03-13T14:38:37.167000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "this is huge, congrats!",
        "created_at": "2024-03-13T14:39:20.266000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "One last comment here: Dencun was not only a super complex fork to ship with 4844, but also tied for \"most EIPs in a single fork\" with Byzantium. It's extremely inspiring to see us ship more ambitious improvements to Ethereum, more _total_ improvements at the same time, and do it with more teams involved! Again, great work everyone 👏",
        "created_at": "2024-03-13T14:46:31.152000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "general",
        "parent": "",
        "content": "Reminder: Dencun EIP authors, please make PRs to move respective proposals to `Final` status, thanks!",
        "created_at": "2024-03-13T16:10:59.031000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "blessed blob day - sharing **Delivery at Dawn | a 4844 film** with you all!\n\nongoing protocol stewardship should be celebrated, this film is a small way to do that 🙂 hope the story resonates!\n\ncrew on the ship = core contributors\nwater = 4844\nexpanding town = mainnet + L2s\n\nfundcoredevs.xyz\nhttps://twitter.com/trent_vanepps/status/1767177236967202903\nhttps://www.youtube.com/watch?v=hm8XpXh-ayo",
        "created_at": "2024-03-13T16:41:26.436000+00:00",
        "attachments": null
    }
]