[
    {
        "author": "barnabasbusa",
        "category": "general",
        "parent": "",
        "content": "Testing call starting in 3 mins: https://ethereumfoundation.zoom.us/j/86466169680?pwd=x17cbD1lDCeQEWMTTOLARQhELiJV21.1",
        "created_at": "2024-09-30T13:57:55.371000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "Summary from the testing call: \n`pectra`: \n- Update from pk910 about deposit queue test results. We're going to wait for the queue related PRs to be merged in and retry the experiment on pectra-devnet-4. \n- There's an unexplained drop in participation on the pectra-devnet-3, investigation underway\n- `pectra-devnet-4` planning underway, current task is for teams to look into open PRs: https://notes.ethereum.org/@ethpandaops/pectra-devnet-4#Open-PRs , e.g: https://github.com/ethereum/execution-apis/pull/591 might still need some discussion pre-merging\n- Work started on `rbuilder` and integration into testing stack. Mario will work on `mock-mev` after the tests are done. The `mock-mev` update should help clients test the API changes and `rbuilder` would help test the full integration. Ideally both are done before the devnet launch.\n- Briefly discussed system contract address changes. Since we want to reduce the number of changes, lightclient will try to get the next round of changes in by the end of the week. There still might be future mods, but the version at the end of the week would be stable for a while. Please keep an eye out for messages about said change. \n- We would want external people to interact with `pectra-devnet-4` or similar devnets. This means we'd ideally want a stable API, or one we intend to release on mainnet. Please have a look at this EIP: https://github.com/ethereum/execution-apis/pull/592 and raise similar external APIs now rather than later\n- Keep an eye on this PR for the status on the specs release: https://github.com/ethereum/execution-spec-tests/pull/832\n- Consensus spec release probably later this week\n- We briefly discussed the blob increase topic and if there were any concerns besides data. We also tried to get a sense of how difficult EIP-7742 would be with a blob increase. Client teams were asked to atleast look into it for easier decision making later on.",
        "created_at": "2024-09-30T15:30:13.943000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "`eof`:\n- Main update is that `eof` wont happen in pectra, so a rebase is expected. We would wait for `pectra-devnet-4` to come out for a version to target\n- Danno is working on some assertoor/kurtosis configs that could be used for local testing\n`peerDAS`:\n- Discussion on issues surrounding the current devnet along with an explanation by lodestar on what happened\n- Since `peerdas` won't happen in pectra, any debugging tools that would be interesting should be collected in one place, potentially [here](https://github.com/ethpandaops/tooling-wishlist)\n- `peerdas` devnet relaunch with the current spec will occur soon, the switch to `pectra` rebase will only happen after `pectra-devnet-4`\n`fuzzing`:\n- Bad block generator has been running for a ~week-ish now with no significant issues found\n`general`:\n- Focus this week is on getting PRs closed and specs released. Ideally we're in a place to launch `pectra-devnet-4` next week",
        "created_at": "2024-09-30T15:30:18.297000+00:00",
        "attachments": null
    },
    {
        "author": "jameshe5018",
        "category": "general",
        "parent": "",
        "content": "Summary from the testing call:",
        "created_at": "2024-09-30T16:21:51.505000+00:00",
        "attachments": null
    }
]