[
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "**ACDC #141 in ~20 mins!**\nAgenda: https://github.com/ethereum/pm/issues/1140\nStream: https://www.youtube.com/live/XMPupRyEBk0\nZoom: https://ethereumfoundation.zoom.us/j/83703239965?pwd=VnjQjZ06LIaCzOjmyY1Jllt0LoTpvK.1",
        "created_at": "2024-09-05T13:36:44.401000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "**ACDC #141 summary**\n* Started with Pectra\n  * devnet-2 around for debugging, but deprecated soon\n    * finality bug in Prysm was identified over the weekend and fixed\n  * devnet-3 soon(tm)!\n    * some clients ready, others ready in next few days\n    * may start devnet with all prepared clients next week, others can join as soon as they are ready\n  * Next covered some updates to Pectra EIPs\n    * One for EIP-7251 correlated slashing computation, merged!\n    * Another for handling execution layer requests in the beacon chain (multiple EIPs)\n      * a small bookkeeping issue but should be merged in next few days\n  * Turned to a discussion around how to best handle the passing of request data from the EL to CL\n    * covers several EIPs in Pectra\n    * Felix has [this PR](https://github.com/ethereum/execution-apis/pull/577) to present an option with a minimal number of transformation steps by extracting data from the EL as SSZ and then passing directly to the CL\n    * good support from CL devs, will decide on next ACDE\n  * Then looked at a PR to update EIP-6110 so that deposit requests from the EL are buffered in a way to prevent CL-layer DoS concerns\n    * One open question left around interactions with the MaxEB feature; client teams please take a look so we can merge this in ASAP!\n  * Wrapped the Pectra section with a temperature check on two PRs to update EIP-7549\n    * further refinement of EIP-7549 features to simplify implementation and make it easier to secure both chain data and network traffic\n    * general support from participants, and need a bit more work before we can merge",
        "created_at": "2024-09-05T20:16:02.307000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "* And then, PeerDAS\n  * some early success with a subset of clients on a local devnet on the path to `peerdas-devnet-2`\n  * clients generally under way to launch `peerdas-devnet-2`\n  * Turned to discuss an issue around timing of PeerDAS proof generation and local block building (where we assume some nodes may have fewer resources available)\n    * Work towards `peerdas-devnet-2` identified a hotspot in proof generation performance\n    * Some proposed solutions from asn here: https://discord.com/channels/595666850260713488/988798065894907934/1280985423715373067\n    * There was a fairly active conversation about all of the considerations here, as we intend to achieve a performant data facility for any node regardless of size/resource supply; so check the call for the full details!\n    * But ultimately, settled on a near-term and longer-term solution. Exploration of both solutions would be helped by a spec so expect to see something along these lines soon.\n    * Near-term: go w/ “option 3” linked above, which keeps proof generation on the CL with a richer interface b/t EL and CL during local block building\n    * Longer-tem: explore more decentralized block + blob building regimes where lower resourced nodes can leverage higher resourced nodes on the network to assist in blob distribution\n      * see \u003c#988798065894907934\u003e if you want to engage with the discussion here!\n* Wrapped the call with a discussion around the “union” feature in SSZ\n  * currently part of the specification, but has never been used in a “production” setting and so relatively under-developed and under-tested\n  * there’s demand to remove or mark them as “experimental” to reduce the design space (in a helpful way!) when discussing various EIPs or client implementations\n  * will continue the discussion on the PR: https://github.com/ethereum/consensus-specs/pull/3906 and likely to do something here to make their status clearer in the specs",
        "created_at": "2024-09-05T20:16:04.291000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "general",
        "parent": "",
        "content": "Is Danny Ryan coming back to us?",
        "created_at": "2024-09-05T21:15:13.152000+00:00",
        "attachments": null
    },
    {
        "author": "lucassaldanhaconsensys",
        "category": "general",
        "parent": "",
        "content": "Just wanted to give a shout out to \u003c@539495253418180618\u003e for posting this detailed summary. For us devs on timezones that aren't compatible with the call it is super helpful!",
        "created_at": "2024-09-05T21:30:54.973000+00:00",
        "attachments": null
    }
]