[
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "ACDE #191 in ~10 mins!\n\nAgenda: https://github.com/ethereum/pm/issues/1080\nStream: https://www.youtube.com/live/58_bJD_dmm0\nZoom: https://ethereumfoundation.zoom.us/j/83703239965?pwd=VnjQjZ06LIaCzOjmyY1Jllt0LoTpvK.1",
        "created_at": "2024-07-04T13:50:13.241000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "In terms of EIP's for EIP 4444's/Portal History Network\n\nEIP 7718: Portal Wire Spec \u003chttps://github.com/ethereum/EIPs/pull/8629\u003e\nEIP 7719: P2P History Network (Portal History Network) \u003chttps://github.com/ethereum/EIPs/pull/8630\u003e",
        "created_at": "2024-07-04T15:25:40.862000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "Here are the PR's for the EIP's I said I would make",
        "created_at": "2024-07-04T15:25:59.105000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "Potez's mentioned the Engine API part which would be used for the proving path for post-merge history. I was going to do that in a follow up EIP to 7719, but I guess it would make sense to spec it out in 7719 so I will work on that",
        "created_at": "2024-07-04T15:27:24.657000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "We just got approval yesterday to link to Portal Network specs in ethereum/EIPs \u003chttps://github.com/ethereum/portal-network-specs\u003e",
        "created_at": "2024-07-04T15:29:16.817000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "So I will be putting some time into cleaning the PR's up and linking to our specs repo",
        "created_at": "2024-07-04T15:29:38.404000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "general",
        "parent": "",
        "content": "\u003c@539495253418180618\u003e I’m not really sure what was the verdict on including r1 in pectra — was it “let’s see if it gets implemented by the deadline”?",
        "created_at": "2024-07-04T15:30:00.620000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "i think we should make a formal decision on next ACDE, there are a few things to do around getting the EIP into a final place",
        "created_at": "2024-07-04T15:31:50.445000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "from \u003c@415548822983278593\u003e \n\u003e     my proposal:\n\u003e     \n\u003e     include r1 into pectra\n\u003e     delete EIP-7212\n\u003e     create a new EIP with a copy of the spec of RIP-7212, at a new number\n\u003e     check whether we want to make spec changes. if no, ship at original RIP precompile address. if yes, ship at new mainnet range address",
        "created_at": "2024-07-04T15:32:33.604000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "so i think we can take the next 2 weeks to resolve the last 3 items, and then discuss formal inclusion on next call",
        "created_at": "2024-07-04T15:33:07.784000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "**ACDE 191 Recap**\nStarted with Pectra updates\n* Clients moving ahead with devnet-1 implementations\n* Waiting for a greater number of clients to be ready before we launch devnet-1, but expect to be there in the next week or two\n* Got an [update on 7702 progress](https://github.com/ethereum/EIPs/pull/8677) that will likely go into devnet-2; please take a look as the intention is to merge in the next week\n  * Note: devnet-1 will reflect the current spec of EIP-7702\n\nThen turned to discuss EIP-7212\n* There’s support for the feature as it brings a lot of nice UX improvements around key/wallet management with a widely supported cryptographic curve\n* We discussed the point around formal inclusion in Pectra, but will wait till the next ACDE to make that decision. While the EIP in isolation brings a nice set of features, it needs to be weighed against the already large scope of Pectra\n* There are a few minor things to address around the EIP itself, including mirroring the precompile address across L2 deployments and L1. These will be resolved over the next two weeks to tee us up for an inclusion discussion on the next call\n\nNext, [we discussed a proposal to add events](https://ethereum-magicians.org/t/eip-7002-execution-layer-triggerable-exits/14195/13) to the predeploy system contracts for cross-layer communication with EIP-7002 and EIP-7251. Consensus was that this change makes sense and the corresponding contracts will be updated.",
        "created_at": "2024-07-04T16:20:19.598000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "Then, we had a call to [deactivate EIP-158](https://github.com/ethereum/EIPs/pull/8712) to simplify the effects of deploying EIP-7702 and the Verkle migration. In light of the latest updates to 7702 we no longer need this proposal and decided to ignore it.\nAnd to wrap the call, we had a discussion around making progress on other protocol improvements like history expiry and changes to the blob mempool to streamline usage of blobs by users like rollups. We jumped across various concerns here so check the call for the details. In short, there was a call for more regular updates on EIP-4444’s progress, and a call out to various things both rollups and clients can do to more intelligently handle the pipeline from blob producer to blob inclusion on-chain.\n\nReminder: Goerli has been deprecated and so clients will (or have already!) dropped support for this testnet.",
        "created_at": "2024-07-04T16:20:21.329000+00:00",
        "attachments": null
    }
]