[
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "We were discussing to run tests with something around 5/10 on devnets with no finality to check that clients are capable of handling higher numbers than those we want to aim for Pectra",
        "created_at": "2024-11-27T09:35:05.316000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "We can run those tests easier than 6/9. As I said above the devnets we already ran I think support a target increase to 4 or 5 without stressing the network. My biggest worry with large changes is about secondary effects that are not understood: \n1) can proposers handle sending 9/10 blobs at once? \n2) how will the two centralized builders act? \n2) is particularly problematic since we've seen already deliberate censoring of blob txs (supposedly doesn't happen anymore) and this breaks the gas market. \n\nAt any rate the type of devnets we ran are good to test for target, not so useful for limits, and given that the bottleneck has been on peering and getting the batches, I think it's clear they will support an increase",
        "created_at": "2024-11-27T09:41:30.914000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Would just like to point out that as much as I'm genuinely not against raising these numbers, and recognize this is a completely usual negotiating stance, seeing the immediate reply to, oh, the previous request of 4/8 or similar looks likely is to push farther again is, from a strict get-Pectra-shipped stance, tactically to oppose until the very last minute and say, sure, ok, then 4/8 is ok.\n\nI don't want to have to resort to this sort of thing for Ethereum, for the record",
        "created_at": "2024-11-27T09:42:41.848000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "So, yeah, I oppose. How much I oppose? what are the conditions for not opposing? Maybe it's a mystery",
        "created_at": "2024-11-27T09:43:24.770000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "But I don't want to push Pectra to the breaking point for the sake of make number go up",
        "created_at": "2024-11-27T09:44:04.891000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "We're already scoping Fusaka, apparently, to be fairly minimal",
        "created_at": "2024-11-27T09:46:17.649000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "If (1) has computational/bandwidth/etc reason, can e.g. 9/10 be justified with test running 10/20 on devnets? I can't say anything about (2). My interest in that would be to make a decision on the numbers that are safe for mainnet and doesn't require a client redesign which can delay Pectra",
        "created_at": "2024-11-27T09:48:07.164000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "general",
        "parent": "",
        "content": "On 1), is there any new information about getBlobs? Either way, I genuinely think we should not give too much weight to this point, because it's a short term problem that has an easy short term solution. It's a short term problem because we are actively working on distributed block building, and, if we are really concerned about it in the meantime, having a flag for max blobs to include solves the problem for low bandwidth solo stakers without impacting their bottom line in any meaningful way.",
        "created_at": "2024-11-27T09:52:47.182000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "\u003e if we are really concerned about it in the meantime, having a flag for max blobs to include solves the problem for low bandwidth solo stakers without impacting their bottom line in any meaningful way.\n\nWasn't this interpreted as being not an honest validator last time around?",
        "created_at": "2024-11-27T09:53:28.197000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "or \"censoring\"?",
        "created_at": "2024-11-27T09:53:45.288000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "general",
        "parent": "",
        "content": "Not by me at least. I really struggle to see who exactly would be harmed. Would rollups rather have a couple of blobs \"censored\" 1% of the time and then still be able to post them immediately after, or have the target be a couple of blobs less, and just not have those blobs ever?",
        "created_at": "2024-11-27T09:57:31.295000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Ok, I mean, I don't mind either, I don't oppose this. But it wasn't exactly uncontroversial",
        "created_at": "2024-11-27T09:58:17.301000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I am the one who was/is very opposed to those flags, I also think that this devnet showed that the bottleneck for increasing these numbers is not strictly bandwidth but it's more related to network topology and peering. Doing the same experiment with a proper EL state would increase processing but that's done in parallel to downloading (or can be done at least) so I do think there's some slack to increase these numbers. I also agree with Francesco that 1) is only a temporary problem. But I feel that trying to find the maximum we can increase these numbers to the point of breaking Pectra is not responsible. We could easily deploy the necessary EIPs to make these changes a consensus fork and they have releases with increases if they seem necessary/possible. Doubling the blob target from one day to the next one is a bit of a stretch. We haven't tested even close to this either, to get to maintain that target even on these closed devnets, we would need to test 6/12 or 7/14 even",
        "created_at": "2024-11-27T10:06:11.309000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "\u003c@476250636548308992\u003e can you repost your statements on rate limiting and the prysm/lighthouse misconfiguration here as it's very relevant?",
        "created_at": "2024-11-27T10:23:44.679000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "\u003e Even with LH changing their config, they still serve a lot more blobs than us. If we want to increase the target and max blob rate. We need to adjust our rate limiter here otherwise in periods where we need to sync (startup, non-finality), it will be very rough. I dont like this because the end result is that each full node has to serve nearly 3x as much data in the worst case. But its either that or the network stops being functional.\n\u003e Our current blob limit is 64. We can increase the blob limit ( target * block_limit). So 3 x 64 ~ 200 . It can reach a max amount of 400 blobs on a burst with a factor of 2.\nThis was in our internal chat, but basically we will have to increase our rate limits non-trivially to account for an increased max and target rate.",
        "created_at": "2024-11-27T10:27:21.555000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "Otherwise prysm stops being functional at an increased max and target",
        "created_at": "2024-11-27T10:27:49.013000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Adding to this, LH current parameters are at about 8Gbit per peer at the maximum which would explain some peering issues on nft-devnet-0. There's no easy tradeoff here, the change from 3/6 to something like 6/9 is radical.",
        "created_at": "2024-11-27T10:33:37.968000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "general",
        "parent": "",
        "content": "Its important to remember gossip is not the only place where we will incur an extra cost but also on req/resp. When peers need to sync up to head they need all the blocks + blobs. Pushing the target up from 3 to 6 is  extreme as now in the average case you will need to serve twice as much data to do this. And all your connected peers are able to ask you for this data. \n\nWe also havent even gone into if propagating 9 blobs will work in mainnet ethereum in a timely fashion",
        "created_at": "2024-11-27T10:40:43.555000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "Sam has a post under review for the timeliness discussion, should be out in a few hours 🙂",
        "created_at": "2024-11-27T10:41:57.242000+00:00",
        "attachments": null
    },
    {
        "author": "samcm",
        "category": "general",
        "parent": "",
        "content": "This is the post Pari mentioned: https://ethresear.ch/t/block-arrivals-home-stakers-bumping-the-blob-count/21096 🙏",
        "created_at": "2024-11-27T12:38:44.023000+00:00",
        "attachments": null
    },
    {
        "author": "samcm",
        "category": "general",
        "parent": "",
        "content": "tl'dr is that we now have data from both sides of the home staker equation (proposing and attesting/observing) which was previously obscured by timing games. This can probably be assumed to be a worst-case scenario for a blob count bump in Pectra. \n\nThe data indicates that we have some room for a bump, either 4/8 or 6/9. It's only one data point in this entire equation, but it's one we previously didn't have",
        "created_at": "2024-11-27T12:42:48.118000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "6/9 is apparently slightly disruptive to the economic side for some implementations?",
        "created_at": "2024-11-27T12:44:43.342000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "because it's not n/(2n)",
        "created_at": "2024-11-27T12:44:50.045000+00:00",
        "attachments": null
    },
    {
        "author": "samcm",
        "category": "general",
        "parent": "",
        "content": "I'm not familiar with the economic side specifics, but a 5/10 increase would also be in the realm of possibility in this scenario as far as block/blob arrivals go imo\n\nThat's nearly double the target/max in Deneb though, and i'd be somewhat hesitant due to other factors like syncing (like what \u003c@476250636548308992\u003e mentioned above.)",
        "created_at": "2024-11-27T12:54:53.640000+00:00",
        "attachments": null
    },
    {
        "author": "francis.li",
        "category": "general",
        "parent": "",
        "content": "Hey all, wanna provide my 2c regarding the situation:\n\n\u003e From a user's perspective, we would love to see the target number increase to 6 given reasons below\n1. blob target has saturated for ~1 month now and we can see blob base fees go frequently higher than 100 gwei (with a max of almost 200 gwei on Nov 256th)\n2. Unichain \u0026 Ink hasn't launched yet, and there are other L2s down the pipeline\n3. Existing chains still need blob headroom to continue scaling\n4. Ideally Pectra could be shipped Q1 2025, but realistically speaking we do not have any guarantees on Fusaka's ship time and from past experience and my knowledge on PeerDAS devnet, we could be saturating for over a year if we only give 1 extra blob capacity in target\n\nI believe giving more increase for the blob capacity would help the entire ecosystem to scale, it's good for ethereum as a whole.\n\n\u003e From a technical point of view, I do understand there's concerns around mainnet stability and they're very important\n1. From the post by ethpandaops team: https://ethresear.ch/t/block-arrivals-home-stakers-bumping-the-blob-count/21096, the theoretical limit for mainnet safety is 14 blobs for solo stakers, even 6/9 in this case would be well within the safety parameter\n2. And simultaneously https://notes.ethereum.org/@ethpandaops/network-limit-devnets outlines a way to simulate worst case network scenario that could help us gather more information on how the network would perform under new configurations\n\n\n\u003e my questions\n1. what would be the lift to support something like 6/9? Since it's temporary change, can we keep the fee mechanism the same, and just change the target / max number?\n2. There are the rate limiting configuration mentioned in prysm, would love to understand any blockers for increasing that rate limit default?\n3. from my convo with pandaops team, we still need a few cycles to ship Pectra, can we do a devnet with higher number, like 7/14 to help confirm that target 6 would be reasonable for an increase?",
        "created_at": "2024-11-27T18:26:37.073000+00:00",
        "attachments": null
    }
]