[
    {
        "author": "jimmygchen",
        "category": "general",
        "parent": "",
        "content": "Great post, thanks \u003c@555483069038198827\u003e!\n\n\u003c@602753420033785856\u003e actually implemented something very similar to what you described as \"decentralized blob building\" for Deneb in Lighthouse as an optimisation (https://github.com/sigp/lighthouse/pull/5829) This does require adding a `getBlobs` engine api endpoint though, but I think this *may* be worth doing (or even include it as a  recommendation in spec?) as it could help reducing the rate that self builders' blocks get re-orged. It seems to work quite reliably from what I heard, and I think it may be useful for PeerDAS too - keen to do this experiement in PeerDAS and hear thoughts on spec inclusion.\n\nThe 2nd proposed approach does require having a supernode peer  - I wonder how much slower if we remove the supernode assumption, i.e. sending 50%+ samples to 1 peer per subnet, and waiting for supernode to receive and reconstruct. This probably means 0 to many extra hops compared to a direct supernode connection. Although i think the two techniques suggested compliment each other - if supernode is able to reconstruct from mempool faster than getting it from gossip, do that, otherwise wait for gossip. (FYI there was a similar discussion on this thread (https://discord.com/channels/595666850260713488/1247156108263555185/1247156110146928640)\n  \nThis may be a short-mid term optimisation though - it sounds like ePBS fixes this (from \u003c@363800010518822915\u003e's X post here https://x.com/terencechain/status/1802364710215700577)",
        "created_at": "2024-06-17T07:02:15.063000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e I don't think it's true that ePBS improves this in the current design. Currently self builders have 4s to send, with epbs 3s until the ptc votes",
        "created_at": "2024-06-17T08:04:57.209000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e It's super cool that Lighthouse is already implementing something like this! \n\nBTW I don't think you have to recompute the blob data proof as it is also already part of the blob transaction",
        "created_at": "2024-06-17T09:21:57.810000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e I don't think it's true that",
        "created_at": "2024-06-17T13:45:35.856000+00:00",
        "attachments": null
    }
]