[
    {
        "author": "0xjorg.eth",
        "category": "general",
        "parent": "",
        "content": "Hi  \u003c@786210786036547615\u003e , thank you for the questions! I was the one presenting the article.\n\nI will preface the questions by sharing some context to the research, and then I will address them one by one.\n\nThis research is proposed at a time where the Ethereum community has become very interested in client diversity, with the goal of preventing existential risks to the protocol (e.g. due to a supermajority client bug). Multiple news articles (https://medium.com/coinmonks/the-existential-threat-to-eth-stakers-the-client-majority-risk-93505c3b80ad), dashboards(https://supermajority.info/), and social media discussions (https://twitter.com/sassal0x/status/1750681505775734875) have taken place around this subject, to encourage people to switch to minority clients to prevent these risks. Note that these sources all rely on some form of client diversity measurement to assess the danger and any potential progress over time.\n\nSo far so good. However, when we look deeper, we find concerns with the existing client diversity measurement methods. (You can read more on this in the introduction to our research article). One mistake that is very prevalent across the board in public discourse is that of confounding node client diversity with validator client diversity. This is especially dangerous because it may lead you to believe that the validator set is more diverse than it is if you are only looking at the nodes.\n\nWith that context out of the way:\n\n1. Future steps if the validator client data is available.\n\n\nWe want to ensure that the community has access to client diversity data as reliable as possible. From there, the future steps will follow in the same way we have seen the community take decisive action before: recalibrating client choices if necessary, and being able to monitor this risk over time. We know Ethereum takes action in light of client diversity data, but we want to make sure it has access to the most accurate one.\n\n(Continued...)",
        "created_at": "2024-07-02T15:29:24.667000+00:00",
        "attachments": null
    },
    {
        "author": "0xjorg.eth",
        "category": "general",
        "parent": "",
        "content": "(Cont'd)\n\n2. How can client diversity be ensured?\n\nI preface this by noting that even big players don’t have it in their best interest to run a majority client in the case of a bug. See [this](https://dankradfeist.de/ethereum/2022/03/24/run-the-majority-client-at-your-own-peril.html) article by Dankrad. Also [this](https://twitter.com/EthDreamer/status/1749355402473410714) commentary by EthDreamer.\n\nBut indeed, at the end of the day, this cannot be ensured across an open network like Ethereum. The only non-coercive way to make this happen is through a collective, public effort. Thankfully, as per some of the sources linked above (and many more you can find e.g. on the efforts of big node operators to diversify), the interest by the community to make this happen has been apparent. We just want to make sure we are measuring the data correctly to assess these efforts.\n\n3. Can’t we have some sort of channel or aggregator or clients…?\n\nIt depends a lot on what we mean by this. Here’s a couple of examples:\n\n- Locally: you can create a multiplexer setup for your own validators that will connect to multiple execution/consensus clients, either alternating between them or coming to consensus between their outputs. See e.g. https://github.com/TennisBowling/executionbackup or https://www.attestant.io/posts/introducing-vouch/. This, indeed, can help with client diversity and supermajority risks. We think multiplexers are important—in fact, we made a point to have the client diversity methodologies we proposed in the research be compatible with multiplexers.\n- Third-party: if we think of an outside infrastructure that handles this, run by a third party for a lot of operators at a time, then this is not a suitable approach, due to centralization concerns and loss of sovereignty by the operators.\n\nHope this makes sense!",
        "created_at": "2024-07-02T15:29:51.142000+00:00",
        "attachments": null
    },
    {
        "author": "richa311",
        "category": "general",
        "parent": "",
        "content": "Thanks for the detailed answers! Yes, I got my doubts cleared 🙂",
        "created_at": "2024-07-02T16:10:56.629000+00:00",
        "attachments": null
    }
]