[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Call in 15m: https://ethereumfoundation.zoom.us/j/91348592283?pwd=SnRnL1VTeXNYVE9CaWpBbnJEUXhQZz09",
        "created_at": "2024-09-26T13:45:03.806000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Will provide a more thorough recap later, but quick ACDE TL;DR: \n\n**Pectra**: devnet-3 (soon 4) is the target for the fork, and we'll CFI EIPs 7623, 7742, 7762 and a TBD blob increase EIP. We need more analysis about the risks \u0026 upsides of raising the blob count, and if we are to include this CFI bundle in Pectra, we need to make the decision in the next month. \n\n**pectra-devnet-4:** many spec changes, our goal is to get the specs finalized by ACDC next week, and the devnet launched by the next ACDE. We'll discuss these in detail on Monday's testing call. \n\n**Fusaka:** EOF + PeerDAS are included, and while we'll consider other EIPs for CFI, we won't include anything else in the fork until we have a working Fusaka devnet with EOF + PeerDAS running. \n\n**Amsterdam:** Verkle was CFI'd for Fusaka, but given the split, we'll open a new Meta EIP for (G*)Amsterdam and move the previously CFI'd Fusaka EIPs there.",
        "created_at": "2024-09-26T15:27:53.902000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "And here's the PR with the corresponding Meta EIP changes: https://github.com/ethereum/EIPs/pull/8911",
        "created_at": "2024-09-26T17:35:14.302000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Full call recap is on EthMagicians: https://ethereum-magicians.org/t/all-core-devs-execution-acde-197-september-26-2024/21085/2?u=timbeiko",
        "created_at": "2024-09-26T21:19:36.380000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "Ok. so I'm damned if i do and im damned if i dont, so here we go.\nIMO increasing blob count is difficult, because some solo stakers are already struggling to publish blocks *today* under some circumstances, especially when they end up needing to produce 6 blobs and publish from their local node for whatever reason (by choice or because their builder didn't respond).\n\nI've raised the issue in other chats and had feedback that im doing things privately or whatever, and because of the hour of ACDE its not an option, so ive also had feedback that im 'sending messengers' etc, which I kind of resent, but thats fine. Im not getting up at 2am, its just not a thing i can do and continue to function.\n\nSo here's my 2c. There's an element of home stakers that are already missing their small number of proposals on the back of needing to include larger than target blob count. This is just concrete fact.\n\nWe want to increase the target, and that poses more difficulty for these solo stakers. I myself believe i'd be in the same position on my internet at home so I  basically can't stake from home in Australia. (i wont go off topic)\n\nIMO, if. these users are physically unable to produce a block and publish, then we have a fundamental problem already, today, at our current settings, because if we are saying that home stakers are important, then this is something we need to acknowledge.\n\nSo. my question to the group. Do we want home stakers geographically dispersed? Because at the moment its sounding very much like we only want home stakers with very good internet which does severely limit geographic distribution of these nodes.\n\nI also frankly resent the implication that an EL being able to set their own maximum blob count is in any way censorship. IMO if the option is completely missing proposal vs. proposing with less blobs, then liveness should be preferred.",
        "created_at": "2024-09-26T23:48:54.403000+00:00",
        "attachments": null
    }
]