[
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e I think that's good to keep in mind. But in some ways, for most full nodes it is not as critical to be able to process the chain at the same speed as stakers, because they don't have to produce attestations within 4s. So for full nodes, it's acceptable if blocks occasionally take a few extra seconds to verify (re @allcoredevs_bot: \u003cpotuz\u003e I have no permission to comment on the file so I'll repeat the same here: I think it's a bit dubious to have these requirements for stakers and not talk explicitly about full nodes, that also need to follow the head of the chain, presumably do not need to be investing money and their system is also not necessarily dedicated. There are some protocol changes that will only affect the hardware requirements of stakers, but most of them affect both stakers and full nodes, and I think it's pretty misleading to have these documents out without explicitly stating that these apply to full nodes: in which case I think the numbers in that document are actually too high, cause most people will not have a computer dedicated to run a node, an internet connection dedicated to run a node, etc.)",
        "created_at": "2024-12-20T05:28:42.554000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e So I think you can actually significantly lower most things except for storage",
        "created_at": "2024-12-20T05:30:35.495000+00:00",
        "attachments": null
    },
    {
        "author": "s1na",
        "category": "general",
        "parent": "",
        "content": "The interesting point for me in this survey was 70% want their nodes to use less disk, and most people have now 2Tb disks I believe (would have been an interesting question in the survey)",
        "created_at": "2024-12-20T12:21:22.225000+00:00",
        "attachments": null
    }
]