[
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "bandwidth and overall network simulation and testing is actually pretty challenging, and an area of ongoing work that i think warrants more investment",
        "created_at": "2024-09-28T00:10:23.560000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "yes we kinda do it on some devnets, but my impression is that our confidence level is not ideal",
        "created_at": "2024-09-28T00:10:50.752000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "long tail of the problem is that its extremely hard to gain any confidence in the exact topology mainnet has and really diffucult to simulate things like load due to mempool/syncing as those are near random. So we can gain a decent chunk of confidence (see 4844 analysis), but then things like timing games/mempool load throw off most estimations we have. I guess we're only ever going to get a reasonable estimate from devnets, but we won't get the real thing until mainnet - meaning we always go with the safe value and never the bleeding edge.",
        "created_at": "2024-09-28T06:20:09.839000+00:00",
        "attachments": null
    },
    {
        "author": "0x1984",
        "category": "general",
        "parent": "",
        "content": "I can understand of importance of home staking(forget BTC commercial mining here). But what will be the true benefit of ensuring certain remote countries or area broadband access as ETH validator, while not acknowledging starlink’s exist.  Staking is an investment in reality now, and the fairness of access mainly stays with Ethereum network users, not validators, except it’s a proof that missing validators from certain remote area meaningfully increases censorship risk",
        "created_at": "2024-09-28T15:13:40.781000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "Lets be careful about vague definitions of what we are trying to support.  This is in push-back to the term \"remote countries\".  I think the goal here is to define real minimums in terms of uplink and downlink speeds that the protocol is aiming to support.  I don't think anyone is suggesting we support the most remote regions of the globe, only that we take into account what we are actually aiming to support and be eyes open about what regions that excludes.",
        "created_at": "2024-09-28T17:25:24.734000+00:00",
        "attachments": null
    },
    {
        "author": "francis.li",
        "category": "general",
        "parent": "",
        "content": "I want to argue for a more open stance, especially for those complex networked systems, there will always be areas that we cannot fully simulate / test with devnets, no matter how much effort we put into them (if they're worth the effort at all).\nInstead, maybe we can try to go with a combination of below techniques:\n1. let's go with fast iterations, make blob increase easy and indepdent of hard forks, use real network data to inform our decisions\n2. define a good set of network metrics to monitor, like reorg rate, impact on tx inclusion, etc, and run them periodically (weekly, daily, whatever)\n3. and move forward if all metrics look good, rollback, if there's issues and then with real data, we can find what's the bottleneck and how to improve them\n\nMy worry with going with the safe choices and coupling blob increase with hard forks is that, the speed of increase will be too slow, and we're all constrained by that",
        "created_at": "2024-09-28T17:30:22.933000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "I'm not sure I know enough about this subject to have this opinion be considered highly innformed (it isn't), but overall, this approach seems to have some merit on the surface.  👍",
        "created_at": "2024-09-28T17:32:23.884000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "How would this work in a decentralized way? There are blockchains which can coordinate this kind of change easily, but a strength/weakness of Ethereum is exactly that it consists of about a half-dozen each of CLs and ELs with varying release schedules and no uniform way of mass-applying configuration changes.",
        "created_at": "2024-09-28T17:35:57.911000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "At least for Nimbus, we routinely run into people who update exactly once per hardfork, for example, and in theory that's all that's necessary.",
        "created_at": "2024-09-28T17:39:07.721000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "The sort of metrics that can go wrong are slow to reflect and once they happen is hard to go back. If an increase leads to validator centralization, once that happens is irreversible. And such a trend it's very hard to measure on chain and even harder to attribute it to a single decision",
        "created_at": "2024-09-28T17:45:10.213000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "In addition to another more mundane issue: one of my worries is not about the happy case but rather our adversarial resilience. If we're lucky we never need to test if we can resist a week of non finality on mainnet. But if we're not? One takes resilience for granted until it's actually needed. Goerli died and no one could save it even though we tried.",
        "created_at": "2024-09-28T17:47:49.148000+00:00",
        "attachments": null
    },
    {
        "author": "francis.li",
        "category": "general",
        "parent": "",
        "content": "Curious, what percentage of the network are solo stakers? Are remaining stakers professional services?",
        "created_at": "2024-09-28T18:02:19.266000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Numbers are around 10% stake and probably 50% nodes, not sure how trustable those numbers are",
        "created_at": "2024-09-28T18:03:42.049000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "In general, would note a large middle ground, by the way. There's a category error to some extent in the question, or a fallacy of an excluded middle. There are staking pools such as Rocketpool which are arguably a bit more managed than pure solo staking but still have many characteristics of it, or Lido, which is professional, generally, but a lot more decentralized than it looks like from the outside",
        "created_at": "2024-09-28T18:04:34.251000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "in terms of management/configuration of individual \"parts\" of it",
        "created_at": "2024-09-28T18:04:47.765000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "With StarLink, we can almost entirely ignore \"remoteness\" if our target is below StarLink.",
        "created_at": "2024-09-28T18:35:40.681000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e The gas limit is currently managed by a vote of the validators (used to be miners). There is no reason why we can't do the same with the blob limit (re @allcoredevs_bot: \u003ctersec\u003e [reply]: How would this work in a decentralized way? There are blockchains which can coordinate this kind of change easily, but a strength/weakness of Ethereum is exactly that it consists of about a half-dozen each of CLs and ELs with varying release schedules and no uniform way of mass-applying configuration changes.)",
        "created_at": "2024-09-28T18:43:32.095000+00:00",
        "attachments": null
    },
    {
        "author": "0x1984",
        "category": "general",
        "parent": "",
        "content": "Starlink is not practical for under developed countries, as it's very expensive. By still very relevant for other remote countries/areas. And it will get cheaper. Now many airlines started to offer free wifi via Starlink already",
        "created_at": "2024-09-28T18:43:58.047000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I live in such a country and StarLink is spreading quite well because all of the other options suck.  It isn't the *cheapest* option available, but for people who need reliable internet for work it is becoming commonplace.",
        "created_at": "2024-09-28T18:45:15.236000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It does have problems during storms, which in some parts of the world means significant downtime, but the rest of the time it is pretty reliable.",
        "created_at": "2024-09-28T18:45:54.787000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Maybe we shouldn’t centralise on Elon Musk though….",
        "created_at": "2024-09-28T20:09:35.915000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I use it as a reference point for a level of bandwidth/response time that is currently available to much of the world.  Easier than trying to compare local bandwidth providers across countries I suspect.",
        "created_at": "2024-09-28T20:10:11.184000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "If there were a good range of companies providing that kind of service it might be a good baseline but there’s really only one and it has a history of disabling access based on politics.",
        "created_at": "2024-09-28T20:12:06.375000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Not against starlink per se, I've only tried it in the middle of nowhere a while ago so things may have changed but the TTL was horrible. Bandwidth was great but if the TTL is so bad I think that makes it very hard to run nodes that need to repeer and subscribe to different subnets from time to time",
        "created_at": "2024-09-28T20:41:01.687000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Perhaps this was solved now, ever since I've made this claim on Twitter I got contacted by homestakers running on starlink",
        "created_at": "2024-09-28T20:41:43.451000+00:00",
        "attachments": null
    }
]