[
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "Is there any urgency for this EIP that justifies the fact it's been CFI'ed that fast? From my point of view, this EIP could be CFI'ed later on and planned for Glamsterdam. I have nothing against the proposal itself, but this simple (at the first glance) change need to be well assessed in terms of implementation complexity and potential edge cases and impact on other parts of the protocol. After \"simple\" changes introduced in Pectra which turned out to be real pain, I think we should be more conservative on the decision making process",
        "created_at": "2025-04-04T05:29:48.500000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "general",
        "parent": "",
        "content": "I completely agree. It's been only a few weeks since we made all these resolutions about how we are going to do things differently from now on, learn on our mistakes etc etc, and we are already breaking these rules? Even if we agree that the rules we set are not absolute, we should be very conservative at the start, follow them strictly and loosen them up gradually if we feel that's the right thing to do. Already deviating from what we agreed on feels immature.",
        "created_at": "2025-04-04T09:27:28.307000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "general",
        "parent": "",
        "content": "I also have nothing against the EIP itself and I am happy to include it, but not in Fusaka",
        "created_at": "2025-04-04T09:28:10.685000+00:00",
        "attachments": null
    },
    {
        "author": "linoscope",
        "category": "general",
        "parent": "",
        "content": "Hi! I competently understand the concerns here. Let me add some context from the preconf protocol perspective: The lack of visibility into lookahead within the EVM has long been a long-lasting pain point for preconfirmation protocols. To address this, we've previously had to develop various workarounds or \"hacks\" to expose lookahead information to the EVM. However, with the recent introduction of the Max EB increase (EIP-7251), the lookahead have become unstable in way that breaks our hacks. This EIP unlocks robust preconfs by bringing a stable lookahead that is accessible in the EVM, completely removing the need for any hacks. The interaction between EIP-7251 and preconfs has been a very recent realization, hence this somewhat \"emergency\" EIP, especially now that there are many preconf protocols rushing for mainnet releases.\n\nI have also written a longer write-up on this topic, explaining the context around preconfs in more detail: https://hackmd.io/@linoscope/eip-7917-from-preconf-protocol",
        "created_at": "2025-04-04T09:38:46.317000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "As a ... general note? I guess?\n\n\u003e The interaction between EIP-7251 and preconfs has been a very recent realization, hence this somewhat \"emergency\" EIP, especially now that there are many preconf protocols rushing for mainnet releases.\n\nis exactly the wrong way around. If the chain doesn't support it to their satisfaction (for any reason), then that \"there are many preconf protocols rushing for mainnet releases\" because \"The interaction between EIP-7251 and preconfs has been a very recent realization\" is emphatically not a sudden emergency _for Ethereum_. It might be for those preconfers?",
        "created_at": "2025-04-04T09:51:11.533000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "An at least more sound argument structure would be, preconfers benefit Ethereum because `${REASONS}`, so therefore Ethereum should improve support for them, but that's again in no way an emergency, that's a usual EIP discussion",
        "created_at": "2025-04-04T09:53:22.364000+00:00",
        "attachments": null
    },
    {
        "author": "rostyslav2431",
        "category": "general",
        "parent": "",
        "content": "Do you mean Ethereum doesn't need preconf asap?",
        "created_at": "2025-04-04T09:56:37.501000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "I'm going to very, very carefully not make any particular claims in that regard",
        "created_at": "2025-04-04T09:57:11.584000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "So, no, I don't \"mean Ethereum doesn't need preconf asap\" (that's a great leading question by the way, congrats)",
        "created_at": "2025-04-04T09:57:34.337000+00:00",
        "attachments": null
    },
    {
        "author": "rostyslav2431",
        "category": "general",
        "parent": "",
        "content": "`is emphatically not a sudden emergency for Ethereum. It might be for those preconfers?`\n\nI just read it from your message actually",
        "created_at": "2025-04-04T09:57:57.333000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "read the whole thing again",
        "created_at": "2025-04-04T09:58:10.020000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "\"If the chain doesn't support it to their satisfaction (for any reason), then  that \"there are many preconf protocols rushing for mainnet releases\" ...\"",
        "created_at": "2025-04-04T09:58:59.560000+00:00",
        "attachments": null
    },
    {
        "author": "rostyslav2431",
        "category": "general",
        "parent": "",
        "content": "Statement 1: I assume we all know preconfs are super important for Ethereum eco asap.\n\nStatement 2: If interaction between EIP-7251 and preconfs blocks preconfs to go live asap, I assume it's an emergency for Ethereum which is a conclusion from the first statement. \n\nSo, please help me to understand - you don't agree with the statement 1 or statement 2?",
        "created_at": "2025-04-04T10:05:17.350000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "I'm in this context addressing the reasoning in the message, so I'm not taking a position on statement 1 in particular. It's out of scope of the argument-as-stated",
        "created_at": "2025-04-04T10:07:02.852000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "\"there are many preconf protocols rushing for mainnet releases\" is not a good argument for Ethereum to do anything particular",
        "created_at": "2025-04-04T10:07:59.543000+00:00",
        "attachments": null
    },
    {
        "author": "rostyslav2431",
        "category": "general",
        "parent": "",
        "content": "Ethereum needs preconf -\u003e many preconf protocols rushing for mainnet releases\n\nI don't see why it's not good argument",
        "created_at": "2025-04-04T10:10:57.170000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "ok, whatever you see or don't see is fine",
        "created_at": "2025-04-04T10:11:52.054000+00:00",
        "attachments": null
    },
    {
        "author": "linoscope",
        "category": "general",
        "parent": "",
        "content": "Yeah, good point that the \"why preconfs are important\" part was missing in my comment. I think \u003c@269786774660710400\u003e phrase this nicely in the last ACDC call: for blockchain performance, we want to \"increase bandwidth and reduce latency\". The great efforts around DAS are addressing the \"increase bandwidth\" goal, with strong focus. This EIP tackles the other critical goal of \"reducing latency.\" Achieving this will unlock the space of based preconfs, and it does so through a relatively small (arguably) change. And to be clear, I do agree that PeerDAS should be top priority in terms of road map, without it any rollup (based or not) cannot scale. So I think a good place to put it is CFIed - So it can be \"considered\" for inclusion as long as it does not block PeerDAS and no critical concerns are found on the way.",
        "created_at": "2025-04-04T11:19:49.457000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003e Statement 1: I assume we all know preconfs are super important for Ethereum eco asap.\nThe only things that meet this bar for me (ASAP, willing to add it to a fork after freeze) are critical security vulnerabilities or active attacks against known weaknesses in the network (e.g., Shanghai attacks).",
        "created_at": "2025-04-04T11:38:23.241000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Ah, though maybe we are talking about the fork after the upcoming one and starting negotiations around what goes in that?  In that case ignore my comment above.",
        "created_at": "2025-04-04T11:40:05.120000+00:00",
        "attachments": null
    },
    {
        "author": "linoscope",
        "category": "general",
        "parent": "",
        "content": "The discussion is on  CFI of Fusaka",
        "created_at": "2025-04-04T11:46:46.919000+00:00",
        "attachments": null
    }
]