[
    {
        "author": "pcaversaccio",
        "category": "general",
        "parent": "",
        "content": "hey folks, quick (important) note on something outside the usual \"core dev\" topics which I however deem important enough to share here quickly. For context, as some folks know here, besides the other things I do I'm also leading SEAL 911 (basically an incident help desk for crypto-related security incidents), and we are seeing the amount of device compromises is **peaking over the last weeks**. To be clear, not just random users, some well-known OGs too. On top of that, we keep uncovering more orgs that have unknowingly employed DPRK-linked IT workers, sometimes for years. seriously (not joking).\n\nmain takeaway: please lock down your setups, both personal \u0026 work-related. Don't blindly clone and run stuff from GH. E.g. a single FFI call can wreck you. Never give remote access during Zoom calls. They've been social-engineering folks with a user called \"Zoom\" asking for it so it looks legit. Don't fall for it. If you're hiring, meet IRL if you can. Vet deeply. Double-check everything. I don't assume you guys don't do this, but I simply want to emphasise again to do it because one simple mistake can be devastating.\n\nFor anyone who wants to understand how such malware can look like (and is distributed), I wrote a deep-dive here some time ago after 1inch was targetted: https://hackmd.io/@pcaversaccio/1inch-analysis-app-a-dprk-trojan-horse. This can also happen to any client team. All I ask you is to be **maximal paranoid** with whatever you do on your system. I don't assume you're not (you're all pros), but I just want to share the bad trend we see from our tickets. Stay safe.\n\nps: if you have any questions, you can dm always.",
        "created_at": "2025-05-12T09:26:03.063000+00:00",
        "attachments": null
    },
    {
        "author": "marioevz",
        "category": "general",
        "parent": "",
        "content": "ACD-Testing in 1 hour (and four minutes): https://ethereumfoundation.zoom.us/j/84251237513?pwd=i7iN3k2ldFFjOOP38RMb4cXv5tQedB.1",
        "created_at": "2025-05-12T12:56:26.457000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "general",
        "parent": "",
        "content": "LiveStream: \nYT - https://youtube.com/live/Lzpb1czKWR8?feature=share\nX: https://x.com/i/broadcasts/1rmGPyPZVWqJN",
        "created_at": "2025-05-12T13:44:21.044000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "Besus priority list for Fusaka devnet rollout:",
        "created_at": "2025-05-12T13:44:55.368000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "- Ordered list of CFI'd for devnet deployment\n    - [EIP-7594](https://eips.ethereum.org/EIPS/eip-7594) : PeerDAS, cell proofs on tx receipt\n    - [EIP-7892](https://eips.ethereum.org/EIPS/eip-7892): Blob Parameter Only Hardforks\n    - TODO Remove EOF activation on Osaka\n    -\n    -\n    - [EIP-7823](https://eips.ethereum.org/EIPS/eip-7823): Set upper bounds for MODEXP\n    - [EIP-7883](https://eips.ethereum.org/EIPS/eip-7883): ModExp Gas Cost Increase\n    - [EIP-7825](https://eips.ethereum.org/EIPS/eip-7825): Transaction Gas Limit Cap - already have this in Linea plugins\n    -\n    - [EIP-5920](https://eips.ethereum.org/EIPS/eip-5920): PAY opcode\n    - RIP-7212: Precompile for secp256r1 Curve Support\n    - [EIP-7907](https://eips.ethereum.org/EIPS/eip-7907): Meter Contract Code Size And Increase Limit\n    -\n    - [EIP-7762](https://eips.ethereum.org/EIPS/eip-7762): Increase MIN_BASE_FEE_PER_BLOB_GAS\n    - [EIP-7918](https://eips.ethereum.org/EIPS/eip-7918): Blob base fee bounded by execution cost\n    -\n    -\n    - [EIP-7934](https://eips.ethereum.org/EIPS/eip-7934) : 10MB block limit enforced on block production\n    - Defer to CL opinion - [EIP-7917](https://eips.ethereum.org/EIPS/eip-7917): Deterministic proposer lookahead",
        "created_at": "2025-05-12T13:45:03.638000+00:00",
        "attachments": null
    },
    {
        "author": "anderselowsson",
        "category": "general",
        "parent": "",
        "content": "For EIP-7918, there have been improvements suggested during the discussion phase for both the if-clause and the return statement. I will here detail them.\n\nFor the if clause, there is a suggestion by Ben to relate the minimum blob base fee to the cost of POINT_EVALUATION_PRECOMPILE_GAS. I think this can further improve the EIP. Here is a summary:\n\nhttps://notes.ethereum.org/@anderselowsson/EIP-7918E\n\nThe change is very simple, switching out one constant for another and removing the amortization constant.\n\nFor the return statement, there has been discussion on the design with one suggestions by Ansgar and one suggestion that does not change the current logic but requires accessing blobSchedule.Max. Here is a summary of those ideas:\n\nhttps://notes.ethereum.org/@anderselowsson/EIP-7918-return",
        "created_at": "2025-05-12T14:02:59.671000+00:00",
        "attachments": null
    }
]