[
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "Before ACDE this week, would it be possible to get a formal statement from EF leadership as to what actually happened with EOF, covering ACDE 208 - 210 and ACDT 34? Asking because this channel has been pretty packed with differing framings of what happened, different recollections of events, and little to no correction of the record when accounts diverge.\n\nI would like to be past re-litigation and on to reconciliation by ACDE on Thursday, if possible. Without doing so, it will be hard to say \"lets not relitigate the call\", which is something that I suspect could come in handy.",
        "created_at": "2025-05-05T00:47:17.724000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I’m planning to publish something in the next day or two. My intention was less to be very narrowly focused on the specifics of the calls but to try and zoom out a bit on the entire ACD process to triangulate how we even got in this situation. \n\nHappy to do a more “zoomed in” retro if that helps too, but I have a pretty active role in the process so it will certainly be biased.",
        "created_at": "2025-05-05T01:11:54.200000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "One thing worth flagging to set expectations: I don’t think it is possible to get a unified “EF perspective” on this. \n\nMany of both EOF’s strongest proponents (incl. most authors) and vocal critics are part of the EF. I don’t think you can distill a particularly useful perspective by making that your principal frame of reference.",
        "created_at": "2025-05-05T01:23:56.451000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "wrt participatory bias, is there someone who can take over if you were to recuse yourself from the situation?",
        "created_at": "2025-05-05T12:51:53.520000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "it sounds to me like you are saying that since EF members differ on the technical merits of EOF, we then cannot trust them to come to consensus on the meta-process surrounding this decision? I'm not trying to put words in your mouth, i'm just trying to understand- because the EF perspective seemed to be unified at the end of ACDT 34: that ACD were not confident enough with the EOF plan to be allowed to proceed with it.",
        "created_at": "2025-05-05T12:59:34.953000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "i'm honestly not trying to argue or stir shit; i'm trying to plot a course for us to reconciliation so that \"the EOF debacle\" doesn't become a meme that gets thrown in our faces as we try to plot out the EVMs future.",
        "created_at": "2025-05-05T13:00:40.789000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "Interop testing call starts in ~30mins: https://ethereumfoundation.zoom.us/j/84251237513?pwd=i7iN3k2ldFFjOOP38RMb4cXv5tQedB.1\nagenda: https://github.com/ethereum/pm/issues/1520",
        "created_at": "2025-05-05T13:31:15.121000+00:00",
        "attachments": null
    },
    {
        "author": "niard.eth",
        "category": "general",
        "parent": "",
        "content": "should be this link for interop testing (automated notes / posting \u003c@199561711278227457\u003e ) : https://ethereumfoundation.zoom.us/j/84251237513?pwd=i7iN3k2ldFFjOOP38RMb4cXv5tQedB.1",
        "created_at": "2025-05-05T13:57:09.676000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "general",
        "parent": "",
        "content": "Yes, that will be helpful. Thanks \u003c@1219940276223606846\u003e",
        "created_at": "2025-05-05T13:57:36.952000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "The ACD governance process seems to be broken in respect to the process of eip inclusion \u0026 removal with the 11 SFI'd EOF eips being DFI'd in a single call. Contrary to \u003c@552133098075193354\u003e conjecture that there isn't a dominant EF position on EOF https://discord.com/channels/595666850260713488/745077610685661265/1368760092777775236 I think it appears to most observers of the ACD calls that the EF has taken a (belatedly) firm position against EOF inclusion based on the following:\n1. The goal posts have seemingly moved from a Supermajority of client teams and core devs required for rough consensus on the EOF eips to Unanimity. This has not been the case for any other eips I can recall and was a decision made by \u003c@552133098075193354\u003e who represents the EF when he chairs the ACD calls. \n2. \u003c@489256758989029405\u003e stated he has full faith in how \u003c@552133098075193354\u003e handled the decision re: DFIing the 11 SFI'd EOF eips\n3. \u003c@273808422753796097\u003e subtly endorsed this position by both not criticizing it and not explicitly supporting EOF. In addition, he stated his belief that RISC-V is the likely endgame for the Ethereum VM, implying EOF is not a priority.",
        "created_at": "2025-05-05T14:17:29.744000+00:00",
        "attachments": null
    },
    {
        "author": "niard.eth",
        "category": "general",
        "parent": "",
        "content": "bot fetched the meeting successfully no more chat history loss for ACDT 🙏  https://ethereum-magicians.org/t/interop-testing-35-may-5-2025/24014",
        "created_at": "2025-05-05T14:48:48.521000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Do you mean from the calls or the write up? I don’t feel like I have a strong bias in either direction re: EOF, but think a perspective from someone less closely involved in the process could be good.  \n\nRe: the meta process, I feel like this is way more on me personally than the EF as an org. Again, though, EFers have voiced their support or concern with the decision in this chat. \n\nAnd all good re: your intent. I also agree we need a credible path forward.",
        "created_at": "2025-05-05T14:55:27.714000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "I think the basic question that needs to be clarified going forward, if it takes a Supermajority to SFI an eip, shouldn't it also require a similarly high bar to reverse that decision?",
        "created_at": "2025-05-05T16:14:08.415000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "Maybe one way to look at what just happened is that ACD has not ever truly formalized it's decision making process.  No formal membership.  No formal voting.  The EOF decision may be one of our first really contentious decisions where this lack of formality leaves the decision feeling like it violated the process.  Supermajority vs Unanimity vs whatever our interpretations of the process have been.  I believe there's been some loose consensus in the past that avoiding formalization of process is a mechanism to avoid capture... and this is potentially a negative outcome of lack of formalization of our process.",
        "created_at": "2025-05-05T17:00:30.997000+00:00",
        "attachments": null
    },
    {
        "author": "wjmelements",
        "category": "general",
        "parent": "",
        "content": "Several chains are doing much more than 3m gas/sec. The main risk of going full throttle is sync time imo, as it takes longer to catch up or start from zero. It’s true that some validators want to go full throttle and others want to burn more ether but the dictator in the current system is the median voter. I suspect they haven’t thought about it very much. They might be swayed by analysis, or (more likely) default settings.",
        "created_at": "2025-05-05T17:01:33.418000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "One difference, structurally, with EOF is that all the options were both mutually exclusive and relatively high-stakes, and there were enough to fragment people:\n- do nothing (status quo from Pectra)\n- some \"minimal\" EOF (didn't really satisfy everyone who thought that a major point of EOF was remove gas introspection)\n- \"status quo\" EOF (tooling/some conceptual issues about, are people 100% sure either the delay in adoption was ok, or it's otherwise fine not to support gas introspection ever, either way)\n- do nothing, plan/wait for something RISC-V based\n\namong other outcomes. these were different enough to fragment people in a way that's a bit unusual in EIPs, where mostly it's yes/no with tweaks which don't fundamentally affect things and can be safely made later",
        "created_at": "2025-05-05T17:08:03.800000+00:00",
        "attachments": null
    },
    {
        "author": "wjmelements",
        "category": "general",
        "parent": "",
        "content": "I’ve thought about this more and I don’t think it would go all the way to seven wei because of spam.",
        "created_at": "2025-05-05T17:08:51.505000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "Would you say an informational eip is needed to formalize the eip process?",
        "created_at": "2025-05-05T17:53:07.391000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "I'm not intending to prescribe a solution, but rather understand the situation and structures that produced the current situation.  I have my subjective opinions about what happened, but my parent comment is intended to try and hit an objective measure of the situation with as little subjectivity as possible.  It's possible that our current lack of structure is worth this cost if we are convinced that anti-capture is important enough and the mechanism is effective enough.",
        "created_at": "2025-05-05T17:56:20.147000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "The retort would be that at least in this specific scenario, the lack of a formal process has allowed capture of the process by a superminority of client teams and core devs. In this case it was Reth/Paradigm,  but it could just as easily have been another party.",
        "created_at": "2025-05-05T18:02:45.035000+00:00",
        "attachments": null
    },
    {
        "author": "abcoathup",
        "category": "general",
        "parent": "",
        "content": "There is an EIP that describes network upgrade inclusion stages. \n\nhttps://eips.ethereum.org/EIPS/eip-7723",
        "created_at": "2025-05-05T21:38:55.007000+00:00",
        "attachments": null
    },
    {
        "author": "siladu",
        "category": "general",
        "parent": "",
        "content": "Thanks for this. Note, downloading the transcript or chat requires a passcode, which I don't think has been published?",
        "created_at": "2025-05-05T22:09:52.804000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "not sure we should get in the habit of naming names on contradictory opinions from what a team lead presents on call.",
        "created_at": "2025-05-05T22:35:26.869000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "This eip does not specify the process by which consensus is reached to SFI eips or later reverse such a designation. Maybe a new eip not needed but instead this eip-7723 can be amended to include the formalized process.",
        "created_at": "2025-05-05T23:15:43.039000+00:00",
        "attachments": null
    }
]