[
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "**ACDC 162 Summary** here: https://ethereum-magicians.org/t/all-core-devs-consensus-acdc-162-august-07-2025/24919/4?u=ralexstokes",
        "created_at": "2025-08-09T07:41:15.262000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "reposting **action items**:\n* `fusaka-devnet-4` is live! Focus on performance to identify any places to harden PeerDAS.\n* Active discussions are under way to find the right Fusaka timelines. Expect updates here soon. There is general agreement to proceed with Holesky in September.\n* Focus all effort on preparation for Fusaka releases — the main blocker right now seems to be merging in feature branches.\n* EIP-7732 (ePBS) has been selected as the Glamsterdam headliner and moved to SFI.",
        "created_at": "2025-08-09T07:41:58.991000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Hey guys I know people are under a lot of pressure and it's coming from lots of places so I don't want to blame anyone but really a timeline of March/April really couldn't have been advanced by any client dev (or most). If we're forking mainnet in Nov/Dec and then there's holidays and to ship March/April we need  releases mid January/February, this is not realistic in any scenario and under no scope for that fork. I think we should refrain from mentioning those dates, this is not healthy. I honestly am convinced that the overwhelming majority thinks as me on this one",
        "created_at": "2025-08-09T14:07:52.431000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e Is there something we can do to achieve this? I agree with the importance of shipping high quality code but I think we also need to show the world that we can deliver at a higher rate than before and actually improve Ethereum at a rate so that it will win.",
        "created_at": "2025-08-09T16:28:19.361000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e January is still a decent amount of time to get implementations done. It's 5 months away. What is blocking starting now? I know the current HF still needs work but ideally we find resources to start this in parallel. And once the testnet forking starts work on Fusaka should be largely done and there should be almost full resources to work on Glamsterdam",
        "created_at": "2025-08-09T16:31:53.411000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "As a user of Ethereum, I would much rather see core devs slow down than speed up.  It worries me to see Ethereum developers push for accelerating development rather than slowing down, especially as more users join the network.  Change is risky, and we should be getting more and more careful over time IMO.",
        "created_at": "2025-08-09T17:04:20.158000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "general",
        "parent": "",
        "content": "I was one of the people that brought up March / April on the call, but that was for March interop \u0026 April client releases, not mainnet fork date. April client releases would mean hardfork in June at the earliest. I do think that’s a reasonable goal.",
        "created_at": "2025-08-09T21:15:55.980000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "general",
        "parent": "",
        "content": "My main point was to make sure we wouldn’t delay for multiple months for any feature, including a headliner.",
        "created_at": "2025-08-09T21:17:04.435000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "general",
        "parent": "",
        "content": "So my proposal would be:\n\nInterop in March, at the end of that we kick out any features that don’t have a clear line-of-sight (say within a few weeks) to release readiness.",
        "created_at": "2025-08-09T21:18:28.146000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "June is a target that I think many of us will believe possible. The ACD recap and Tomasz tweet mention Glamsterdam as a Q1/Q2 fork. The problem is that in the current environment what we believe \"possible\" becomes a binding agreement and then subject for pressure and keeping us all working on weekends.",
        "created_at": "2025-08-09T21:20:25.648000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "general",
        "parent": "",
        "content": "I think a Q1 Glamsterdam mainnet date is obviously not realistic.",
        "created_at": "2025-08-09T21:21:09.340000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "So I would refrain from mentioning dates until it's actually an ACD decision to target a specific timeline",
        "created_at": "2025-08-09T21:21:23.631000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "general",
        "parent": "",
        "content": "Well that’s why I mentioned it *on acd*! Because I think we should make timeline decisions alongside fork scope decisions, to make sure we have context for deciding what the cost for any feature is",
        "created_at": "2025-08-09T21:22:54.647000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I think it's fine to have targets for forks. I pushed personally to have this in Fusaka, and I agree with you that setting some expected timelines actually helps setting the fork's scope. I am on board with that idea. What I don't like is that the Q1/Q2 arc spreads before ACD actually decided for it",
        "created_at": "2025-08-09T21:24:16.902000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "general",
        "parent": "",
        "content": "I see. I tend to agree with you there. I was only speaking to my own timeline comments, which were within the acd process.",
        "created_at": "2025-08-09T21:25:10.536000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Yeah I think it's fine to have personal opinions. I also expressed my own personal opinion that by March we won't be ready. But there's a leap from that to have the community thinking the fork schedule is whatever timeline cause then that is what causes an actual pressure to deliver by then",
        "created_at": "2025-08-09T21:26:34.958000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e I think there should be some pressure to deliver tbh",
        "created_at": "2025-08-09T21:28:09.929000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e not excess pressure that leads to mainnet bugs but I think it's normal that people work hard when something as important as an Ethereum mainnet fork is due to be shipped",
        "created_at": "2025-08-09T21:29:08.919000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "general",
        "parent": "",
        "content": "ePBS just got SFI’d. There are probably only a handful of people in the world who fully understand how ePBS works end to end. I think it’s way too early to discuss timelines in a formal venue like ACD. We should let the people who will actually implement ePBS and are directly involved weigh in first, then allow a broader consensus to emerge. So far, Glamsterdam doesn’t seem like a timeline-driven hard fork like Fusaka, where we’ve said it must ship by the end of the year and nothing else unless im miss understanding this part",
        "created_at": "2025-08-09T21:49:34.763000+00:00",
        "attachments": null
    }
]