[
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "Hey all, I have this PR open for EIP-6110 to explicitly define `parse_deposit_data` (how to parse the raw emitted EVM logs to the EIP-7685 request) here: https://github.com/ethereum/EIPs/pull/9460. I think we should explicitly define this because clients differ on how this method is implemented and I want it explicitly defined in the EIP so it is clear. \n\nNote that on Sepolia we have a deposit contract with different code than the code on Holesky. A bug would be found if different `DepositEvent` data is emitted (but with the same event signature, it encodes all data of as dynamic `bytes` type, otherwise the log topic /  `DEPOSIT_EVENT_SIGNATURE_HASH` would change). On Holesky the emitted data is always the same length and the encoding is static (so it is possible to hardcode the offset/sizes of the data to decode). Therefore I believe it is necessary to explicitly spec `parse_deposit_data`.\n\nThere are basically two options: (1) ABI-decode it or (2) hardcode how to decode it. I prefer (2) because otherwise we enshrine ABI-decoding into the protocol which adds (in my opinion) unnecessary complexity to the protocol.\n\n\u003c@316280621783580673\u003e has raised points on the PR that the hardcoded decoding of this event is somewhat sloppy.\n\nI'd love to hear if there are any other (strong) opinions not to do (2), and I'd like to keep this discussion async/here because I don't want to \"waste\" any time on this at next ACD-E on this topic if it is not necessary 🙂\n\n(Please reply in the thread)",
        "created_at": "2025-03-10T13:45:57.052000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "Testing call starts in 2min: https://ethereumfoundation.zoom.us/j/86466169680?pwd=x17cbD1lDCeQEWMTTOLARQhELiJV21.1",
        "created_at": "2025-03-10T13:58:12.423000+00:00",
        "attachments": null
    },
    {
        "author": "danceratopz",
        "category": "general",
        "parent": "",
        "content": "Client Testing Call meeting notes available here:\nhttps://ethereum-magicians.org/t/client-testing-call-28-march-10th-2025/23107",
        "created_at": "2025-03-10T15:17:20.004000+00:00",
        "attachments": null
    }
]