[
    {
        "author": "abcoathup",
        "category": "general",
        "parent": "",
        "content": "\u003c@539495253418180618\u003e can you share summary of actions/decisions\n\nhttps://ethereum-magicians.org/t/consensus-layer-call-152/22959",
        "created_at": "2025-03-07T00:10:07.783000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "general",
        "parent": "",
        "content": "I would like to evaluate a Peer-DAS CL",
        "created_at": "2025-03-07T01:48:09.431000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "general",
        "parent": "",
        "content": "I'd be interested too - but this means we should offload some of the supernodes responsibilities - non supernodes may have to do some reconstruction and distributed publishing under certain conditions - today we assume there are at least *some* supernodes in the network (for distributed blob publishing), although we've avoid assuming we have them as peers for sync purpose.",
        "created_at": "2025-03-07T01:57:11.529000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "general",
        "parent": "",
        "content": "^ but like potuz said, can't happen on mainnet - you can have 0 supernode peers (I think we must assume this in sync implementation), but we can probably safely assume there's a small number of supernodes in the network - i.e. more than 1 node publishing the data columns.",
        "created_at": "2025-03-07T02:02:28.384000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "general",
        "parent": "",
        "content": "Borrowing \u003c@688748669268132001\u003e 's slide",
        "created_at": "2025-03-07T02:18:50.198000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "image.png",
                "content": "58b79757f6cfb14ed36c66c8c4b8b209bdeb22b0bbe87a64f8fe26984a3b9878"
            }
        ]
    },
    {
        "author": "jimmygchen",
        "category": "general",
        "parent": "",
        "content": "I would also like to understand what",
        "created_at": "2025-03-07T02:22:06.808000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Is there a set of minimum requirements enumerated for what PeerDAS requires of a small devnet or testnet, even if the goal isn't to test PeerDAS as such? One of my concerns has been that various of the hacks currently used appeara to derive from a certain increased structural rigidity around, e.g., the dependence of column custody on peer ID (and new questions about column syncing as a result, because right now peer ID isn't really a semantic part of the protocol) and dependence on supernodes.\n\nOne read is that to have an equivalent kind of small devnet or testnet, where bandwidth isn't a major concern, is to make all nodes supernodes? That is, that won't test PeerDAS, but it gets PeerDAS out of the way and allows scaling down to arbitrarily small node counts and removes that peer ID dependency",
        "created_at": "2025-03-07T02:24:22.660000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "I'd also want to see this offloading, if it happens, of some of the PeerDAS calculation to the EL which was proposed tested before I'd consider a commitment to e.g., Q3 (or anything else) for a PeerDAS release particularly serious or plausible. Otherwise it looks a lot like that kind of thing was being said to humor people who care about the downsides of PeerDAS, while allowing it to move forward for a release as quickly as possible",
        "created_at": "2025-03-07T02:26:42.941000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "And if it's not going to be feasible/practical/on-net-advantageous, ok. Then it would be good to know that the value proposition of PeerDAS just intrinsically includes, no, smaller nodes won't be viable anymore",
        "created_at": "2025-03-07T02:27:27.315000+00:00",
        "attachments": null
    },
    {
        "author": "francis.li",
        "category": "general",
        "parent": "",
        "content": "To provide my 2c to the conversation:\n\n1. There will definitely be a lot of supernodes on the network, can't really speak for others, but for coinbase staking, one node on average attaches ~1400 validators, and they're geo distributed, cloud / client diversified\n2. in my personal opinion, it's very important to include cell proof computation change (EIP and execution-apis PR is ready, see thread: https://discord.com/channels/595666850260713488/688075293562503241/1346977768038203473), and it's not that big amount of work\n     a. it took me less than 2 weeks to implement cell proof computation related features in prysm\n     b. I'm starting to work on getting geth ready for the cell proof computation related work, from the current scope, it does seem like a relatively small change (~1 week of work?)\n3. Agree that testing would be very important, and for that we have Sunnyside Labs ( \u003c@330401857392476163\u003e , \u003c@898089525711089664\u003e , etc) folks working on tooling and devnet iterations, we'll try to share results as soon as possible (aiming for some preliminary data within 2 weeks)\n4. From first principle perspective, let's say we aim to ship Fusaka to mainnet in September, it's still 6 months out, and for the amount of work remaining (distributed blob publishing, validator custody, cell proof computation), should take like a month and we have all the remaining 5 months to do whatever test we want to get to a reasonable and safe number for PeerDAS.\n5. we have recently constructed this PeerDAS roadmap doc (https://docs.google.com/document/d/1MXf5zTU58mRj0Yq88EPBP1gCJzWTY9FRfUdpZjcfgqw/edit?tab=t.0) to try to capture all the remaining tasks needed and are trying to help wherever we can, and we believe it's ambitious, but doable",
        "created_at": "2025-03-07T02:48:49.188000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "general",
        "parent": "",
        "content": "yeah this is the strange thing in the design that I need to read up on - it's really surprising to me that not everyone participates in reconstruction in _some_ capacity, ie by being responsible for reconstructing _certain_ columns for example instead of \"all\" (to avoid the stampede _and_ to distribute reconstruction among all validators \"evenly\") - similar to attestation aggregation duties",
        "created_at": "2025-03-07T07:58:24.079000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "general",
        "parent": "",
        "content": "ie no matter how you look at it, supernode designs are a regression compared to the status quo and exhausting the alternatives would be high on the list of desiderata for it",
        "created_at": "2025-03-07T08:00:08.044000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "this dependence on supernodes is to an extent, as I understand it, an artifact of the 1D column-based PeerDAS design, and more advanced versions of DAS don't rely on them as much",
        "created_at": "2025-03-07T08:01:13.811000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "And this in turn was a sort of intentional compromise to try to ship PeerDAS by Pectra, which obviously didn't happen",
        "created_at": "2025-03-07T08:05:20.727000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "Update on `peerdas-devnet-5`full node usage:\n- You can go to this page: https://dora.peerdas-devnet-5.ethpandaops.io/clients/consensus and toggle the `supernode peers`, this shows you all the full nodes that aren't supernodes as well as what portion of columns they are custodying\n- We had a extra config line from a different layer of the stack that added `--subscribe-all-subnets` by mistake on Prysm, this has been patched\n- The devnet is still a small and does indeed rely on supernodes, we will be ramping up testing along with others! We purely wanted to start \"easy\" to make sure the rebases and changes over the last months work as expected. Expect more involvement with testing as the next weeks pass.\n\nI see it as 3 large pieces required:\n- Get research-ey topics done and implemented (cell proof computation/etc)\n- Get an understanding of what blob values to go with (blob target, when to bump, stepwise increase, BPO?)\n- Harden peerdas and ensure reliability (reorgs, sync testing, bandwidth limiting, non-finality tests, different peering structures)",
        "created_at": "2025-03-07T08:58:30.274000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "How many validators are nodes running with \u003c@199561711278227457\u003e ? Any large node is a super node. I'm not worried about \"lack of supernodes\" on any testnet/mainnet. \n@francis.li even if the amount of work on the EL is minimal, the coordination of testing all CL/EL combos is undoubtedly going to delay the fork vs just shipping a CL only version earlier",
        "created_at": "2025-03-07T09:59:01.667000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "You can still aim to bump the blob count on the very next EL mainly fork and even further with 7732",
        "created_at": "2025-03-07T09:59:43.888000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "100 validators per host, 19 hosts = 1900 validators on the network",
        "created_at": "2025-03-07T10:05:44.814000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "general",
        "parent": "",
        "content": "It's not actually due to 1D per se. You could just add row subnets and allow gossiping of cells in them, and have local reconstruction. The reason this wasn't part of the design originally is indeed that there was a desire to ship a minimum viable version. While PeerDAS ultimately did not end up in Pectra, there have been very minimal resources on it and I don't think it would have made sense to change the spec in this direction (btw, there was a related discussion of generally moving to cell gossip instead of column gossip, and the feedback was pretty much that it would be interesting to explore but that we should not change the spec)",
        "created_at": "2025-03-07T10:11:43.284000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "general",
        "parent": "",
        "content": "In the next fork, this is one of the things we should do (imo), as was always the plan. In the meantime, there's going to be 100s or even 1000s of nodes participating in all subnets, and I think it's perfectly fine to rely on one of them doing reconstruction.",
        "created_at": "2025-03-07T10:13:42.193000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "So every node is a supernode",
        "created_at": "2025-03-07T12:03:24.609000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I thought at 64 vals you're already downloading everything",
        "created_at": "2025-03-07T12:03:35.721000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "FWIW, Prysm allocated two devs full time on Peer DAS, this is more than we have allocated to anything else. Peer DAS is fast on track to be complete featured before June and much earlier if we move people to code for it.",
        "created_at": "2025-03-07T12:04:40.990000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "i dont think so, i dont think all clients have validator custody fully implemented yet. \n\nhttps://dora.peerdas-devnet-5.ethpandaops.io/clients/consensus and toggle the supernode peers. you'll see that some nodes are indeed just storing some columns and not all.",
        "created_at": "2025-03-07T12:11:25.838000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Oh but that's just lack of implementation my point is that if you ever want to test without super nodes, testnets will have to have some very minor nodes. And purely no super nodes I guess will be tested on Kurtosis",
        "created_at": "2025-03-07T12:20:29.186000+00:00",
        "attachments": null
    },
    {
        "author": "manunlp",
        "category": "general",
        "parent": "",
        "content": "I think no client at all have validator custody running on the devnet.",
        "created_at": "2025-03-07T12:33:19.533000+00:00",
        "attachments": null
    },
    {
        "author": "francis.li",
        "category": "general",
        "parent": "",
        "content": "Agree adding EL to the folk makes things a little harder, but I do think they're managable\n\nThe way I see it\n1. ship PeerDAS with cell proof computation unlocks us to go to a high blob number initially (pending testing), timing wise, we still have 6 months till September, seems like a reasonable amount of time to get it done given the minimal workload?\n2. even if we don't do cell proof computation, it won't save us too much time, we still have to do all the network analysis, benchmarking, and integration testing, dropping it won't impact the timeline much imo\n3. My current understanding is that the amount of hardfork coordination effort for a EL only fork \u003e the effort to coordinate and implement cell proof computation, not sure if it's worth it",
        "created_at": "2025-03-07T16:59:53.522000+00:00",
        "attachments": null
    }
]