[
    {
        "author": "nero_eth",
        "category": "general",
        "parent": "",
        "content": "Right agree. Clients can use BALs for whatever they want. With shipping it, new features such as perfect parallelization, parallel post state root calculation, executionless state updating, etc can be sequentially rolled out after it went live.",
        "created_at": "2025-07-11T05:39:59.193000+00:00",
        "attachments": null
    },
    {
        "author": "jwasinger",
        "category": "general",
        "parent": "",
        "content": "I agree that we do not need to have clients roll-out parallel execution/root-calculation to production by the time of the BAL fork.  However, parallel execution may render inclusion of reads in the BAL less useful (there is less time to prefetch reads before executing the transactions that need them when more of the tx workload is parallelized).\n\nSo having parallel execution implemented, and measuring the performance with/without read-prefetching should at least be done before we settle on the final BAL format.\n\nGeth is working on an implementation to gather numbers here.",
        "created_at": "2025-07-11T06:19:53.522000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "general",
        "parent": "",
        "content": "having some initial implementations would also help dial in the tradeoffs related to bandwidth vs execution time. iirc a vanilla BAL format might increase payload size roughly ~20%",
        "created_at": "2025-07-11T07:14:56.463000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Right, this seems applicable to order similar features and not also BALs, I don't see how implementation and testing can be decoupled from design here. The latter should be quite influenced by the former. While the implementation doesn't need to be production ready, at the very least it'll be nice to have minimal proof of concepts to as to let pandaops gather data of performance.",
        "created_at": "2025-07-11T08:49:26.950000+00:00",
        "attachments": null
    },
    {
        "author": "lukaszrozmej",
        "category": "general",
        "parent": "",
        "content": "implementing BAL's isn't super hard but also isn't trivial, you need to verify it (and potentially fail payload), you need to build it when producing block ect.",
        "created_at": "2025-07-11T19:35:55.614000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "**ACDC #160 summary** here: https://ethereum-magicians.org/t/all-core-devs-consensus-acdc-160-july-10-2025/24771/5?u=ralexstokes",
        "created_at": "2025-07-11T21:38:47.702000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "Reposting action items:\n**ACDC #160 Action Items**\n\n* Prepare/publish releases with updated default gas limit\n* Debug fusaka-devnet-2 and prepare for fusaka-devnet-3 genesis the week of 21st July\n  * https://notes.ethereum.org/@ethpandaops/fusaka-devnet-3\n* Start preparing client opinions for headliner selection to occur after fusaka-devnet-3 is live and stable\n  * https://forkcast.org/upgrade/glamsterdam for a nice digestible EIP explorer",
        "created_at": "2025-07-11T21:39:21.438000+00:00",
        "attachments": null
    }
]