[
    {
        "author": "cskiraly",
        "category": "general",
        "parent": "",
        "content": "Regarding **getBlobs**, I think what we need is a notification interface. I've even called this a potential \"**getBlobsV3**\" in some previous discussions.\n\nThe rationale is that I think we need a **tighter metadata loop** between the EL and the CL to improve efficiency.\n\nI would like to temperature check what people think about it. (btw, is this the right channel to discuss Engine API?).\n\n- `notifyBlobs` would be a JSON-RPC **Notification**, transmitting the blob_versioned_hashes (or transaction hashes, or both, not sure which fits better) as they arrive.\n\n- `getBlobs` than can simply be used to get blobs as they arrive, without trying to guess the right timing. So for this getBlobs variant, the semantics could be \"partial\", which also implies \"return immediate\". I think that's equivalent how we are checging (back) getBlobsV2 now.\n\nEventually, a `fetchBlobs` (actually this also works at the transaction level, so maybe a more generic `fetchTx` is more appropriate) could instruct the EL to hunt down a specific blob (it's type 3 transaction). As background, for large TXes and for Type3 TXes the EL operates in a notify and fetch more. Fetches have to be scheduled .... but we have limited information about what is urgent. If the CL needs a blob (or a cell of it), we should better know and fetch it fast. We can already infer this when the payload is passed to the EL, but maybe an explicit call is better. I'm not sure.\n\nLater, and eventually, we could extend these to the cell level. That might also require the EL to be able to do cell-level fetching (seems a fairly simple devp2p extension).  I don't think I would do the cell level before we move away from the JSON encoding and its inefficiencies, but it could be an interesting direction to.",
        "created_at": "2025-06-24T10:44:14.922000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "general",
        "parent": "",
        "content": "Regarding **getBlobs**, I think what we",
        "created_at": "2025-06-24T15:26:48.568000+00:00",
        "attachments": null
    },
    {
        "author": "tmiychao",
        "category": "general",
        "parent": "",
        "content": "The Protocol \u0026 Application Support team will be hosting an **Eth Magicians Council with a 3-hour round table at EthCC on Wednesday, July 2**, 10:00 - 13:00 in Vision Room BS. \n\nThis round table will be an unconference style event mainly focused on 3 tracks: \n1. EIP championing and feedback\n2. Technical discussions about future forks, headliners \n3. ACD visibility, EthMag forum and tools\n\nIf you will be at EthCC, we would like to invite you all to join us at this event. All core devs and public are welcomed! \n\nPlease give us thumbs 👍  if you are planning to join and use the thread under this message to suggest topics you'd like to discuss. Hope to see you there!",
        "created_at": "2025-06-24T15:36:25.983000+00:00",
        "attachments": null
    }
]