[
    {
        "author": "barnabasbusa",
        "category": "general",
        "parent": "",
        "content": "Start name suggestions for G future fork",
        "created_at": "2025-05-21T15:29:40.132000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE tomorrow 14:00 UTC**\nAgenda: https://github.com/ethereum/pm/issues/1533\nStream: https://www.youtube.com/watch?v=FEZGRUPkI_8\n\nAs discussed last week, we should come to a final set of SFI'd EIPs for `devnet-1` tomorrow. \n\nHowever, it was a bit underspecified how we'd get from \"the next devnet\" to \"the final set of Fusaka EIPs\".\n\nI still think it's best to iteratively bringing EIPs in (rather than all at once) to align all client teams around implementation. \n\nWhat I'd suggest is that teams come tomorrow with both the list of EIPs they feel most strongly about including in `devnet-1` **and** the CFI'd EIPs they feel **least** strongly about including in Fusaka. \n\nThis way, we can move some CFI'd EIPs to SFI, and others to DFI. I'd also propose that `devnet-2` be our last devnet where we consider adding more EIPs to SFI, so anything that doesn't make it then would be DFI'd for Fusaka.",
        "created_at": "2025-05-21T16:08:05.999000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I'll share a more fleshed out plan for Glamsterdam planning by EOD today, too 🙂",
        "created_at": "2025-05-21T16:08:28.313000+00:00",
        "attachments": null
    },
    {
        "author": "niard.eth",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2025-05-21T20:51:09.216000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Here's my suggested timeline for how to approach Glamsterdam scoping: https://ethereum-magicians.org/t/eip-7773-glamsterdam-network-upgrade-meta-thread/21195?u=timbeiko",
        "created_at": "2025-05-21T21:47:06.359000+00:00",
        "attachments": null
    },
    {
        "author": "daniellehrner",
        "category": "general",
        "parent": "",
        "content": "I have to say I find \u003c@555483069038198827\u003e and \u003c@489256758989029405\u003e approach to promise upcoming changes on Twitter rather irresponsible. Especially with shortening slot times, which CLs devs always consider extremely hard to do. I think everybody here agrees that we need to accelerate the roadmap, but we should do that by working together. Not by throwing each under the bus by promising something that we might not be able to ship, especially if the people promising it are not even involved in shipping those changes.\n\nWe might not always agree on the priorities, but I think we should at least agree on testing changes like that first on devnets or testnets before we announce them to the broader ecosystem.",
        "created_at": "2025-05-21T21:50:02.867000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "Screenshot_2025-05-21_at_23.33.18.png",
                "content": "47801d63129b496bca9d7c81e26638fcac32fd284820d9f173fc8962ac7e979d"
            }
        ]
    },
    {
        "author": "notnotstorm",
        "category": "general",
        "parent": "",
        "content": "I dont see anyone being thrown under the bus or an official announcement being made. I see it more as a discussion of the roadmap that is happening in public. e.g. vitalik himself pushed back on tomasz and lots of ppl liked his post\n\nI also think that roadmap is not a purely technical venture. a huge part of it is coordinating and inspiring ppl and setting aspirational goals. playing it overly safe is itself a risk. and I think tomasz is doing a wonderful job navigating all these things",
        "created_at": "2025-05-21T22:36:11.817000+00:00",
        "attachments": null
    },
    {
        "author": "zengjiajun",
        "category": "general",
        "parent": "",
        "content": "As a community member, I don’t see this as “promises”, it’s just Dankrad’s personal opinion and Tomasz is just opening up an important topic that we discuss here in the public.",
        "created_at": "2025-05-21T23:02:14.487000+00:00",
        "attachments": null
    }
]