[
    {
        "author": "sproul",
        "category": "general",
        "parent": "",
        "content": "I would prefer a longer timeline, given that consensus bugs were only recently fixed in 4 CL clients (including LH). I do not have faith that our fuzzing and testing has been comprehensive enough yet",
        "created_at": "2025-03-28T03:26:57.848000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "is this something the spec tests could have caught or what layer of the stack might need more attention?",
        "created_at": "2025-03-28T10:31:04.741000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "All of the bugs I'm aware of should have been caught both by spec tests and our own unit tests",
        "created_at": "2025-03-28T10:46:40.195000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "It's not to point the finger to test maintainers but the increasing complexity of the spec with the number of edge cases starts to creep out. It's no coincidence that we have had two major failures in testnets, even though each feature is relatively simple, there's several features being worked in parallel and not more than a couple of eyes can watch each",
        "created_at": "2025-03-28T10:48:45.288000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "While that seems reasonable, it would be ideal to have reps from all client teams on ACD to avoid having to walk back these decisions because we are missing some client teams’ PoV. \n\nI understand the time isn’t ideal for Australian devs, but at the very least I think we should get in the habit of teams who don’t have anyone that can make it providing their thoughts async ahead of the call. \n\nI can make it clearer on the agenda going forward when we need a response from all teams vs. just ELs 😄",
        "created_at": "2025-03-28T13:19:49.510000+00:00",
        "attachments": null
    },
    {
        "author": "claravanstaden",
        "category": "general",
        "parent": "",
        "content": "If Pectra will fork on 30 April, I need to get our referendum rolling. I'm seeing some uncertainty about the date above. Will it change or are things going ahead as mentioned on the call yesterday?",
        "created_at": "2025-03-28T13:22:11.226000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "There were people from LH in the last ACD",
        "created_at": "2025-03-28T13:37:30.448000+00:00",
        "attachments": null
    },
    {
        "author": "nixo.eth",
        "category": "general",
        "parent": "",
        "content": "the Apr 30 date won't be final until the next ACD on Apr 3",
        "created_at": "2025-03-28T15:12:16.148000+00:00",
        "attachments": null
    },
    {
        "author": "nixo.eth",
        "category": "general",
        "parent": "",
        "content": "i was under the impression that the 30 days was just from decision to fork, not from releases nor testnets. to give protocols time to prepare",
        "created_at": "2025-03-28T15:14:53.302000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "general",
        "parent": "",
        "content": "Sorry yeah, we (LH) have been trying to discuss internally before each ACD and last week had reached the conclusion that we would support an earlier fork date. However this was before we had to patch a last minute crit. Our call immediately prior to ACD was dominated by fixing said crit, and I assumed this context would be enough for us to push back on an early fork date even though we didn’t discuss it explicitly. That’s my mistake and I should have been clearer in stating the implications (in my mind) of finding such a bad bug so late in the process.\n\nThe last few weeks have been very stressful for us, lurching from one crisis to another, and I would very much like that to slow down a little before we go potentially unprepared into a new one",
        "created_at": "2025-03-28T20:34:57.336000+00:00",
        "attachments": null
    }
]