[
    {
        "author": "marioevz",
        "category": "general",
        "parent": "",
        "content": "ACD-T in 1 hour! \nZoom: https://ethereumfoundation.zoom.us/j/84251237513?pwd=i7iN3k2ldFFjOOP38RMb4cXv5tQedB.1\nPM: https://github.com/ethereum/pm/issues/1583",
        "created_at": "2025-06-23T13:00:37.896000+00:00",
        "attachments": null
    },
    {
        "author": "lookupforsky",
        "category": "general",
        "parent": "",
        "content": "Youtube: https://www.youtube.com/live/3mnaILTNk6w?si=74LzszxTUFRL5YqU\nTwitter/X: https://x.com/i/broadcasts/1lPKqMeBAWlKb",
        "created_at": "2025-06-23T13:43:27.120000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "Here the benchmarks presentation https://docs.google.com/presentation/d/1d5XsEQhE8PnRE6OCM6iwZxndqwQIY7vIVdCekmOv2zA/edit?usp=sharing",
        "created_at": "2025-06-23T15:16:12.272000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "As recap what I will do, I will add these performance tests to EEST and I will also add the test vector which forces clients which do not have the codeHash =\u003e codeSize index to read contracts from disk. This \"attack\" vector will read 11k+ contracts (30M gas limit) of 256 KiB from disk. (And yes, this includes the code size limit pricing, because we can force clients to read the contract from disk even if they do not have enough gas to pay for the actual code size. It's a gotcha I guess easier to understand when seeing the actual test vector here (STATICCALL enough to pay for the 24 KiB target but not enough to pay for the 24 KiB+ target))",
        "created_at": "2025-06-23T15:18:52.171000+00:00",
        "attachments": null
    },
    {
        "author": "marioevz",
        "category": "general",
        "parent": "",
        "content": "ACD-T #41 Notes:\n\n### Devnet 2 Updates\n- Barnabas: Devnet-2 was not launched today due to missing client implementations.\n- Several clients, including Besu, Erigon, and others, provided updates on their progress, with most reporting readiness.\n- Nethermind still working on implementation.\n- EEST release for devnet-2: https://github.com/ethereum/execution-spec-tests/releases/tag/fusaka-devnet-2%40v1.2.0\n\n### PeerDAS Testing\n- Sunnyside-labs performed benchmark tests with different blob counts: https://testinprod.notion.site/Sunnyside-Devnet-Updates-06-23-Internal-21b8fc57f54680639103d8b54c5f1500\n- Full nodes consumed significantly more bandwidth than expected, with some clients using up to 80-100 megabits per second compared to 20 megabits for others.\n- They identified that network traffic scaled linearly with the number of blocks, though Raúl noted this might be due to recent optimizations and suggested further investigation of the networking stack implementations.\n- Agreed to analyze the report in detail and coordinate with the Sunnyside labs team to understand the root causes of the high network usage.\n\n### GetBlobs API\n- Discussed changes to the getBlobs API (in this [PR](https://github.com/ethereum/execution-apis/pull/669)).\n- It was decided to remove the partial response flag and make partial responses the default behavior, as proposed by Marius.\n\n### PeerDAS Readiness\n- Ansgar raised that a metric is needed to decide whether PeerDAS is ready to launch on testnets or not.\n- Barnabas indicated that a they need a stable spec before conducting performance tests.\n- Agreement to continue working on identifying networking bottlenecks and implementing optimizations, with Raúl emphasizing the importance of benchmarking in realistic scenarios. \n- Plan is to review the results of Devnet 2 before making further decisions about the BPO numbers and testnet rollout.\n\n### EIP-7907 Benchmarking\n- Jochem presented a benchmark on large contract sizes on a mainnet shadow-fork, using a gas limit of 30 million for transactions targeting six contract sizes, including small and large contracts.\n- They observed slower execution times for larger contracts, with the worst case taking almost a second for statical big contracts.\n- Łukasz explained that performance could vary based on hardware and optimization strategies.\n- Ansgar emphasized the need for standardized behavior across clients regarding the use of an index for contract size, expressing concerns about its interaction with future features like ZK proofs.\n- Full presentation located here: https://docs.google.com/presentation/d/1d5XsEQhE8PnRE6OCM6iwZxndqwQIY7vIVdCekmOv2zA/edit?usp=sharing\n- Ameziane inquired about triggering these tests after client fixes to the performance branch.\n- Jochem explained that state tests should be run using EEST fixtures, and Mario suggested summarizing the list of tests run in perfnets.\n- For EIP-7907, it was agreed to continue using the current state of the EIP for Devnet 2, with plans to reassess and potentially make final changes to the EIP either during ACDE or asynchronously\n- Łukasz expressed concerns about including 256 kB code size information in the EIP, but the team decided to proceed with the current specification for Devnet 2.\n\nNote: Notes generated with AI 🤖  and manually cleaned up",
        "created_at": "2025-06-23T18:24:00.459000+00:00",
        "attachments": null
    }
]