[
    {
        "author": "samcm",
        "category": "general",
        "parent": "",
        "content": "Posted my analysis here: https://ethpandaops.io/posts/60m-gas-sepolia-hoodi/\n\ntldr: it's performing pretty much exactly as you'd expect on networks where core devs run the majority of validators while also on high bandwidth nodes 😅 \n\nThere's nothing to suggest we'd have a problem with mainnet 60M imo, at least as far as block/blob propagation is concerned based on these networks. I'm planning to do another post looking at how 6/9 blobs is performing on mainnet, and maybe that'll give us a little more confidence?",
        "created_at": "2025-05-27T09:41:49.701000+00:00",
        "attachments": null
    },
    {
        "author": "serenita_io",
        "category": "general",
        "parent": "",
        "content": "If we do gain enough confidence that 60M on mainnet is safe and desirable, does anyone else share my preference of raising the gas limits in 2 steps? Say, to 45M or 48M (halfway) first, observe, and only then to 60M?\n\nReason being 36M-\u003e60M is a big step, we're almost doubling the value here.\n(Obviously no way to enforce this but clients could be released with defaults like this)",
        "created_at": "2025-05-27T12:09:26.974000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think we should first decide whether 60M is \"safe\" before starting to plan a rollout (I still have seen very little discussion about RPC nodes and how state effects them).  That being said, \u003c@555483069038198827\u003e had a proposed EIP that suggested doing an automatic escalation of gas limit that sounds like it sort of aligns with what you are thinking of here.  The primary complaint against it when it was presented to ACD was that we should figure out what is safe first, then roll that out second, rather than hoping things will be safe by the time it ticks up.  It sounds like your proposal would not suffer the same sort of problem.",
        "created_at": "2025-05-27T12:13:16.077000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "tbh I do think 20-100x is kind of reasonable in 4 years given how fast the progress is. the issue is that the 4 years timeframe makes it hard to nail it down exactly. I also kind of think that after Fusaka, we might go to 90-150mn which is already a 5x in 3-4 months. lots things can happen in 4 yrs fortunately/unfortunately",
        "created_at": "2025-05-27T13:10:31.245000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "maybe https://github.com/ethereum/EIPs/pull/8933 is what we are looking for :) ifsome node operators are scared",
        "created_at": "2025-05-27T13:12:55.775000+00:00",
        "attachments": null
    },
    {
        "author": "nixo.eth",
        "category": "general",
        "parent": "",
        "content": "Celo re: Holešky deprecation",
        "created_at": "2025-05-27T17:10:01.881000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "general",
        "parent": "",
        "content": "right now coordinating gas limit increases is a super high friction coordination problem. a two step process seems fine in a world with decent gas limit coordination, but I dont think we're quite there yet\n\ndoes anyone have ideas on how to improve coordination of future gas limit increases? maybe a canonical channel for validators to discuss such things? maybe a simple protocol for validators to discuss these things onchain?",
        "created_at": "2025-05-27T18:58:20.654000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "what we have today is typically this. Very large pools are directly connected with core devs, so when there was a push to 60 on twitter, they quickly learned that there was a problem with the gossipsub limit and stopped it. They typically coordinate this themselves and that's already quick high signal for the rest.",
        "created_at": "2025-05-27T19:31:10.811000+00:00",
        "attachments": null
    }
]