[
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "Looks like it still down?",
        "created_at": "2025-03-30T19:31:33.331000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Yes, we tried to use a recent backup but ran into issues as it was corrupted. Ethereum Magicians was originally launched by the community, not the EF, and hence had a separate infra/devops setup than ethresear.ch, ethereum.org, etc. \n\nThis weekend has made it clear that is no longer tenable and we're working on both getting the site back up + migrating it over to the EF's default infra stack to avoid issues like this in the future. \n\nThis doesn't mean we'll be restricting usage, including moderator permissions, to the EF, but it will help make the site more resillient.",
        "created_at": "2025-03-30T20:07:11.352000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Appreciate the extra color here. As we are thinking about formalizing the process to rollout upgrades, setting the actual time seems like something we should rethink. \n\nOn the live calls, with many people and limited time, the best way to move forward is to ask for objections and, if none are raised, assume we have consensus. Clearly, this process failed here. \n\nGoing forward, I'd propose that we move confirming the fork blocks to an asynchronous process, where we open a PR for them specifically and have teams +1 it. \n\nThis could look like having all client teams (or some % representing a supermajority of the stake/nodes, to avoid being delayed by a single team?) approve a PR that sets the fork blocks here: https://github.com/ethereum/pm/blob/master/Pectra/pectra-mainnet-plan.md#upgrade-information, and ideally also flag who on their team is the main PoC.",
        "created_at": "2025-03-30T20:14:34.820000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "Adding a few more weeks for further testing when client teams are still finding and patching critical bugs seems like the logical decision from a risk/benefit standpoint. It doesn't slow down Fusaka development which is occurring in parallel and it seems like infra teams were also anticipating more time to deploy and test on Hoodi.",
        "created_at": "2025-03-30T20:31:49.925000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "Probably a good idea to also enable daily backups as well and to multiple locations. Even my small company's website which I self-host on a Synology NAS gets daily automated backups to both AWS Glacier and a second locations.",
        "created_at": "2025-03-30T20:36:37.843000+00:00",
        "attachments": null
    }
]