[
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "hey all! wanted to leave a summary of key decisions from last ACDC (https://github.com/ethereum/pm/issues/1812) to facilitate scoping decisions for Glamsterdam\n* FOCIL\n  * interest to schedule for Heka/Bogota, core devs undecided if we should write as CFI or SFI\n    * CFI: follows established processes, not as strong a signal as SFI\n    * SFI: strong signal (reflecting community demand), but would be getting ahead of ourselves in terms of Heka/Bogota scoping as we have not started headliner selection for this fork yet\n    * will make final call on next ACDC\n      * client teams, please come prepared with a team preference on how to scope FOCIL in Heka / Bogota\n* 7688\n  * need to do due diligence on complexity; demand for feature exists for Glam, but could imply larger than expected implementation cost, along with more testing/review and potential audits\n  * will make final call on next ACDC\n* 8045\n  * CFI, some questions around complexity raised but due diligence has been done here; possibility to not SFI if cost becomes higher than currently expected\n* 8061\n  * see summary for 8080\n* 8062\n  * DFI\n* 8071\n  * DFI, in favor of 8080/8061\n* 8080\n  * lean CFI, but want to better understand if we should do 8061 instead\n  * main thing here is deeper security review of changing weak subjectivity periods\n  * will make final call on 8080/8061 route on next call",
        "created_at": "2025-12-02T00:18:35.987000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "draft PR to meta-eip here: https://github.com/ethereum/EIPs/pull/10861",
        "created_at": "2025-12-02T00:24:35.266000+00:00",
        "attachments": null
    },
    {
        "author": "christine_dkim",
        "category": "general",
        "parent": "",
        "content": "here's also a chart summary of the above decisions that i created for the acd after hours newsletter in case helpful: https://docs.google.com/spreadsheets/d/1ifXjsiFFzQW8s1gl4Gz3kVDKE2pvTMkPslHuE3U7Nqk/edit?gid=1671390874#gid=1671390874",
        "created_at": "2025-12-02T00:32:10.562000+00:00",
        "attachments": null
    },
    {
        "author": "zsfelfoldi",
        "category": "general",
        "parent": "",
        "content": "Not sure where is the best place to advertise this but it might be relevant for EIP inclusion discussions on this week's ACDE. Now I have a WIP EELS implementation of EIP-7745 which might answer some open questions. It needs more work, still a draft, but I think it already shows how this thing can be realized in a not extremely complicated way and also defines all corner cases exactly. I also want to do a quick explanatory write-up soon about how initialization, wire protocol extension, database storage, rollback handling and things like that can be realized in practice.\nhttps://github.com/ethereum/execution-specs/pull/1832\nThe EIP itself has also been updated, now it's consistent with the EELS code and also cleaned up the terminology a bit.",
        "created_at": "2025-12-02T12:31:29.096000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "Weren't we previously signaling that EIP-7782 (6-second Slots) is highest priority for Hegotá (yeah, I'm preemptively naming it😆) which is primarily a headliner CL change same as FOCiL? \n\nI would say if it either/or FOCiL vs SSS as the CL headliner for Hegotá, this would be a stark reversal of the priority signaling due to recency bias. Without giving an opinion of personal preference, I will say that SSS has huge community buy-in since it has much more direct UX effects for users than FOCiL and other big advantages beyond user UX in improving intra-op, decreasing time to finality and MEV mitigation. It also much easier for the average user to not just experience but conceptualize than FOCiL which much less user facing of an EIP.",
        "created_at": "2025-12-02T14:27:08.195000+00:00",
        "attachments": null
    },
    {
        "author": "0xunclebill",
        "category": "general",
        "parent": "",
        "content": "imo we shouldn't ship 6 second slots without FOCIL. bandwidth requirements for local block building post BPO forks and post 6 second slots increases significantly which effectively kills local block building. This gives centralized block builders even more control over transaction inclusion. that seems problematic to me",
        "created_at": "2025-12-02T14:45:47.742000+00:00",
        "attachments": null
    },
    {
        "author": "qu0b",
        "category": "general",
        "parent": "",
        "content": "ethproofs does the same",
        "created_at": "2025-12-02T15:17:39.899000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Functionally, one difference is that FOCIL \"almost\" was the Glamsterdam CI headliner, while 6 second slots was not, and the near-unanimous support from client. As a procedural point, it's not only recency bias; it's that there are more open questions about 6 second slots",
        "created_at": "2025-12-02T15:24:45.682000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "general",
        "parent": "",
        "content": "I think there is one of two ways for SSS, its either gonna make it in together with FOCIL, or its gonna be shifting to I start and probably be included around 2027 mid year. \n\nOn its own I think FOCIL is not a huge lift, so it alone as a CL headliner might be missing some meat. So I think its quite possible to have SSS and FOCIL in the same fork ideally ship by end of next year in Hogota.",
        "created_at": "2025-12-02T15:46:38.647000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "I stand by anything adding separate network sidecars is significant, minimally, from a testing/network engineering/message reordering/edge case perspective",
        "created_at": "2025-12-02T15:50:32.348000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "such as FOCIL",
        "created_at": "2025-12-02T15:50:39.980000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "True, but as I recall SSS also had near unanimous client support for Hegotá at that time and it definitely the more  user UX facing upgrade. I think there will be a lot of unhappy stakeholders from users to L2s if SSS gets pushed when it was signaled for immediately after Glamsterdam.",
        "created_at": "2025-12-02T16:20:03.261000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "general",
        "parent": "",
        "content": "One significant difference is that SSS doesn't have an active champion right now, while FOCIL does.",
        "created_at": "2025-12-02T16:49:48.990000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "\"user-facing\", also, is an somewhat arbitrary metric. It's a question of how to market the EIPs, of how to promote them. 6 second slots is somewhat more obvious, yes, but FOCIL can be said to be \"user-facing\" in much the same way. Furthermore, \"user-facing\" on its own isn't even necessarily the primary virtue of an EIP; the question is what value they provide to Ethereum as a system (which, yes, includes its stakeholders, and that does include users), not only what basically are obvious-front-end-visible EIPs. I mention this because multiple hardfork cycles have seen valorization of \"user-facing EIPs\" (or similar language) and it's somewhat circular each time",
        "created_at": "2025-12-02T16:59:06.307000+00:00",
        "attachments": null
    },
    {
        "author": "celtic.warrior",
        "category": "general",
        "parent": "",
        "content": "Does the champion need to be a core dev, or would a suitably knowledgeable community member be considered to be an \"acceptable\" champion?",
        "created_at": "2025-12-02T22:48:54.960000+00:00",
        "attachments": null
    }
]