[
    {
        "author": "barnabasbusa",
        "category": "general",
        "parent": "",
        "content": "https://forkcast.org/calls/acdt/056",
        "created_at": "2025-10-07T09:39:44.903000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "We added a blogpost describing requirements for various types of nodes after PeerDAS (focus on bandwidth requirements for now): https://ethpandaops.io/posts/fusaka-bandwidth-estimation/\n\nIMO there's still variables that prevent us from updating the EIP immediately. But agreed that long term it should be done.",
        "created_at": "2025-10-07T09:39:56.360000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Do the bandwidth estimation account for blobs in the CL P2P layer only or do they account for the increase in the EL P2P with more type 3 txs floating around?",
        "created_at": "2025-10-07T11:03:45.698000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "The theoretical calculator is just for CL p2p layer, its hard to estimate exactly how much the EL p2p would use - the devnet data is closer to reality since it includes both sides",
        "created_at": "2025-10-07T11:28:04.651000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "ahh then I call *bullshit* 🙂 willing to wager a bet that the curve will be quite different in real life? the EL propagation is not interested in how many validators you are running, or if you are running them at all, so for a full-non-validating node, I would bet my life that the P2P requirements will be considerably worse than today unless the mempool becomes really fragmented. At any rate, for such nodes, an EL estimation should be kinda mandatory since it should be the actual first order effect of Fusaka",
        "created_at": "2025-10-07T11:36:02.719000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "I mean... there's a warning right there: `• Only accounts for blob bandwidth usage; doesn't account for execution layer bandwidth usage OR block bandwidth usage`\n\nalso its the theoretical value that's followed by devnet data that encompasses both EL + CL traffic. \n\nThere's also a followup doc linked by sunnyside lab that does a really good job of discussing getblobs and their effects, as well as EL mempool traffic as a fraction of overall traffic: https://testinprod.notion.site/Draft-Sunnyside-Devnet-Updates-09-29-26f8fc57f546808cbc83c20ca7c386f8",
        "created_at": "2025-10-07T11:42:02.519000+00:00",
        "attachments": null
    },
    {
        "author": "cskiraly",
        "category": "general",
        "parent": "",
        "content": "partial diffusion in the mempool is in the works, but not for Fusaka. We are prototyping it in Geth atm.\nIn Fusaka and first BPOs the only EL \"advantage\" is that it is fully pull based, so there is no Gossipsub duplicates multiplier.",
        "created_at": "2025-10-07T15:00:36.075000+00:00",
        "attachments": null
    }
]