[
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "As the Glamsterdam CL headliner eips are being debated, it important to recognize the debacle that was the Fusaka EOF eip process and avoid a repeat.  EOF was a set of related eips meant to modernize the EVM that was many years in development.  All 10 eof eips went from being SFI'd to DFI'd from Fusaka in a single call since the consensus threshold shifted from a Supermajority of core devs to a near Unanimity which could not be reached. There are potential parallels here with the trajectory of the current ePBS discussions. If the threshold for inclusions of eips shifts to Unanimity consensus,  it will be difficult to be ambitious \u0026 Ethereum must be ambitious to meaningfully progress.",
        "created_at": "2025-07-30T01:10:02.801000+00:00",
        "attachments": null
    },
    {
        "author": "smartprogrammer",
        "category": "general",
        "parent": "",
        "content": "I remember 4 execution client teams + solidity team (the language used more than 80 if not 90 percent in the network) were still in support of EOF when it was decided to be DFI'd. EOF removal was caused mostly because some parties wanted to change the spec in the last moment when we are supposed to have a spec freeze. ePBS does not have that problem as we still probably have a couple of months before we need to freeze the spec. Deciding on it as a headliner does not necessarily require its spec to be frozen. Mitigation to the free option problem could be discussed and added after we choose the headliner.",
        "created_at": "2025-07-30T11:29:30.480000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "peerDAS spec was not frozen some weeks ago :)",
        "created_at": "2025-07-30T11:46:44.308000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "so i mean - EOF fate is still possible (imo even very likely) but i do not think frozeness is important",
        "created_at": "2025-07-30T11:47:24.034000+00:00",
        "attachments": null
    }
]