[
    {
        "author": "acd-bot",
        "category": "general",
        "parent": "",
        "content": "**ACDC \u003ct:1759413600:R\u003e**\nAgenda: \u003chttps://github.com/ethereum/pm/issues/1740\u003e\nStream: \u003chttps://youtube.com/watch?v=d-uG-anQWA0\u003e\nZoom: \u003chttps://ethereumfoundation.zoom.us/j/81973476602?pwd=L8ob6xqxvsaDcFe92c6Us5NxCupqpH.1\u003e",
        "created_at": "2025-10-02T13:05:10.969000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I'd like to frame the issue of trustless payments in a better way. Trusted payments can be had trivially with the current spec of ePBS and ePBS in fact already accounts for this by explicitly **not enforcing** any auction nor forcing the proposer to choose anything. \n\nHowever, a completely different thing is \"remove even the option to have trustless payments alltogether\". \n\nI find it incredibly fishy to use arguments in favor of  \"We should have trusted payments\"  to argue for \"We should not allow trustless payments\". Finally for anyone that actually touched any implementation of this, they know that separating the payload is 99% of the complexity.",
        "created_at": "2025-10-02T14:53:26.169000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Finally \u003c@532884962836480002\u003e the argument also applies to Lido: if they don't want to change their contracts they can simply enforce that their NO get their payments off-protocol, and still this is simpler with ePBS speced as-is than otherwise",
        "created_at": "2025-10-02T14:56:17.596000+00:00",
        "attachments": null
    },
    {
        "author": "linoscope",
        "category": "general",
        "parent": "",
        "content": "\u003e Finally for anyone that actually touched any implementation of this, they know that separating the payload is 99% of the complexity.\nI totally agree with this! The complexity I am worried about is not the in-protocol complexity, but rather the ecosystem impact on adopting multiple payment pipelines without being convinced on why they have to. And this \"without being convinced\" can of course change if we can make an argument for it.",
        "created_at": "2025-10-02T14:56:32.775000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I am giving concretee examples on why the community impact argument is false",
        "created_at": "2025-10-02T14:57:03.511000+00:00",
        "attachments": null
    },
    {
        "author": "linoscope",
        "category": "general",
        "parent": "",
        "content": "\u003e  if they don't want to change their contracts they can simply enforce that their NO get their payments off-protocol, and still this is simpler with ePBS speced as-is than otherwise\nSo to confirm, Lido (or any other validator) will be able to continue to take (only) off-protocol payments? Without forking client software.\n\nAnd I think your other point was that in-protocol payments is critical for the commit/reveal time difference (this I am still wrapping my head around) - If that is the case, is it ok in terms of slot restrucuring that Lido goes off-protocol?",
        "created_at": "2025-10-02T15:01:38.469000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I did not say it's critical, and yes, Lido or any other validator can continue taking off-protocol payments without forking clients. What they cannot do is use MEV-Boost type blinding",
        "created_at": "2025-10-02T15:02:40.869000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "As this is being derailed quickly, I still want to stress the following, there is a big difference between:\n\"We want to be able to have trusted payments\"  and \"We want no one to have the option of trustless payments\" \nThe arguments for the first are solid, and that's why we have that in ePBS, the arguments for the latter are incredibly weak",
        "created_at": "2025-10-02T15:04:20.350000+00:00",
        "attachments": null
    },
    {
        "author": "linoscope",
        "category": "general",
        "parent": "",
        "content": "\u003e  What they cannot do is use MEV-Boost type blinding\nThis is the proposer signing a zero value bid with themselves as builder, and relying on relay for the fair exchange of bid/payload, correct?",
        "created_at": "2025-10-02T15:09:17.292000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "general",
        "parent": "",
        "content": "Sorry to interject, just want to say that imo these are the options we have:\n1. epbs as is. It can support trusted payments but might depend on client support or forked software \n2. epbs as is, but agreeing on built-in support for trusted payments, i.e., being able to somehow receive  (e.g. in the builder response when you request a bid) an off-protocol bid value alongside an `execution_payload_bid` with `value` 0, and being able to whitelist builders for which you are willing to accept this.\n3. epbs as is, but without trustless payment, meaning no withdrawal mechanism (`BuilderPendingPayment`, `BuilderPendingWithdrawal`) and fork-choice changes supporting the trustless exchange. Upside is less complexity, downside is no fallback option to p2p bids and untrusted builders (when circuit breaker triggers or you blacklist all trusted builders etc...)\n4. Same as 3. but without signing the bid, and thus also without builder withdrawal credentials and staked builders",
        "created_at": "2025-10-02T15:11:27.658000+00:00",
        "attachments": null
    },
    {
        "author": "wolovim",
        "category": "general",
        "parent": "",
        "content": "https://forkcast.org/calls/acdc/166",
        "created_at": "2025-10-02T20:40:30.486000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "ACDC #166 summary here:\n\nhttps://ethereum-magicians.org/t/all-core-devs-consensus-acdc-166-october-2-2025/25573/5?u=ralexstokes",
        "created_at": "2025-10-02T22:11:31.910000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "**ACDC #166 Action Items**\n* Continue monitoring Holesky deployments to assess progress of Fusaka fork\n* Holesky Fusaka BPO 1 is at 2025-10-07 01:20:00 UTC in just a few days!\n* See \u003c#874767108809031740\u003e channel if you want to follow the conversation on trustless payments",
        "created_at": "2025-10-02T22:11:42.771000+00:00",
        "attachments": null
    }
]