[
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "Can the supernode requirements be simulated by enabling the flag `--subscribeallsubnets` or is there more to it than that?",
        "created_at": "2025-08-28T02:51:52.398000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "would depend on client, i think for teku its `--p2p-subscribe-all-custody-subnets-enabled=true`",
        "created_at": "2025-08-28T05:48:18.130000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "Understood, my question is if the only thing that distinguishes a supernode from a standard node enabling the flag to subscribe to all the subnet or are there other factors as well?",
        "created_at": "2025-08-28T05:58:15.978000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Definitionally, a supernode is a node which custodies all columns, that's it. But that's also distinct from enabling all subnets as such. Custodying is a separate action clients have to take",
        "created_at": "2025-08-28T06:01:35.476000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Some clients might combine them into a single command-line option, but they're different concepts",
        "created_at": "2025-08-28T06:02:03.628000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "(Or, custodies enough columns to reconstruct the rest, verify, etc)",
        "created_at": "2025-08-28T06:03:00.459000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "they'll have significantly more requirements on network / cpu / storage than nodes that aren't custodying all columns is all - at least this is my understanding",
        "created_at": "2025-08-28T06:24:55.240000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "yes",
        "created_at": "2025-08-28T06:25:56.102000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "i've added a comment to the meeting issue reflecting which EIPs Besu team would like to hear more about. DISCLAIMER: THESE ARE NOT SELECTION PREFERENCES",
        "created_at": "2025-08-28T13:05:58.344000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "https://tenor.com/view/know-more-desire-to-know-more-intesifies-gif-9636468",
        "created_at": "2025-08-28T13:06:18.542000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "we just want to know more",
        "created_at": "2025-08-28T13:06:23.793000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "Then it really seems imperative that clear guidance is offered in advance of Fusaka about what these resources requirements will be so qualifying supernode validators can make sure they are ready.",
        "created_at": "2025-08-28T13:09:25.917000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Glad to see Besu making concrete selections that it has strongly committed to including.  Will tweet immediately about this development.  😆 \n(for the reporters watching, the above is sarcasm, please read original message)",
        "created_at": "2025-08-28T13:12:59.411000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "general",
        "parent": "",
        "content": "Could we clean up the config.yaml a little bit, and remove/move unused stuff? \n\nThinking about values like removing:\n```\nTERMINAL_TOTAL_DIFFICULTY\nTERMINAL_BLOCK_HASH\nTERMINAL_BLOCK_HASH_ACTIVATION_EPOCH\nSECONDS_PER_ETH1_BLOCK\n```\nMoving some config parameters into presets:\n```\nNUMBER_OF_CUSTODY_GROUPS\nDATA_COLUMN_SIDECAR_SUBNET_COUNT\nMIN_EPOCHS_FOR_DATA_COLUMN_SIDECARS_REQUESTS\n```\n(Some newly introduced timing parameters can't be changed anyway anymore, so might as well be part of presets)\n```\nPROPOSER_REORG_CUTOFF_BPS\nATTESTATION_DUE_BPS\nAGGREGATE_DUE_BPS\nSYNC_MESSAGE_DUE_BPS\nCONTRIBUTION_DUE_BPS\n```",
        "created_at": "2025-08-28T13:20:03.835000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "general",
        "parent": "",
        "content": "CL Config Cleanup",
        "created_at": "2025-08-28T13:38:40.543000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE in 15ish mins**\nAgenda: https://github.com/ethereum/pm/issues/1687\nZoom: https://ethereumfoundation.zoom.us/j/88269836469?pwd=haUFXY28SNvw9pJ5CamxgMlMlghHac.1\nYT: https://www.youtube.com/watch?v=S4p0Ha_M_oE",
        "created_at": "2025-08-28T13:43:57.601000+00:00",
        "attachments": null
    },
    {
        "author": "lookupforsky",
        "category": "general",
        "parent": "",
        "content": "X: https://x.com/i/broadcasts/1gqxvredbPnxB",
        "created_at": "2025-08-28T13:44:29.222000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE TL;DW**\n\n**Fusaka**\n- `devnet-3` expected to finalize today, CL teams working on fixes for sync issues\n- Next week, once CL fixes are out, we'll do another non-finality test. If things go well, we'll launch `devnet-5`. Optimistic ETA EONW. \n- Barnabas will merge the following PRs if no objections in the next day: \n- [feat: update osaka style blob schedule eth-clients/holesky#129](https://github.com/eth-clients/holesky/pull/129)\n- [feat: update osaka style blob schedule eth-clients/sepolia#110](https://github.com/eth-clients/sepolia/pull/110)\n- [feat: update osaka style blob schedule eth-clients/hoodi#19](https://github.com/eth-clients/hoodi/pull/19)\n- [feat: update osaka style blob schedule eth-clients/mainnet#10](https://github.com/eth-clients/mainnet/pull/10)\n- For the fork rollout, we'll propose both a timeline that matches the [process doc we went with post-Pectra](https://github.com/ethereum/pm/blob/master/processes/protocol-upgrade.md#testnets) and reach out to the major stakeholders affected by the rollout to gauge their preferences",
        "created_at": "2025-08-28T15:29:07.100000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**Holesky**: agreed to shut it down a few weeks after Fusaka activates on it. Blog post coming next week to formally announce this.",
        "created_at": "2025-08-28T15:29:59.519000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**Gas Limit:** teams are working on addressing bottlenecks, hoping to get to 60M before Fusaka. Here is the list of blockers: https://github.com/NethermindEth/eth-perf-research/blob/main/README.md#60-mgas, Nethermind and PandaOps are working on better docs for the various dashboards and benchmarking test suites.",
        "created_at": "2025-08-28T15:31:13.996000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**Glamsterdam PFI discussions:** we'll prioritize EIPs that client teams want to see discussed on the call. [Besu shared some today](https://github.com/ethereum/pm/issues/1687#issuecomment-3233422166) which I'll try and line up for the next call. \n\nWe also discussed a handful of EIPs that people had put on the agenda. The goal isn't to make decisions about inclusion, but to share context and answer questions raised by client teams.\n\n🤖🤖🤖\n\n**[Longer AI-gen summary available on EthMag](https://ethereum-magicians.org/t/all-core-devs-execution-acde-219-august-28-2025/25106/3?u=timbeiko) **",
        "created_at": "2025-08-28T15:32:40.615000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "Re fork rollout: I've summarized some of the comments made back in Feb that motivated the new process doc\n\n* arbitrum chains have 30d+ governance process, given these upgrade delays, the code needs to be ready *before* the upgrade is proposed, therefore the time between testnet releases and scheduling of mainnet is the main integration time that teams have. https://discord.com/channels/595666850260713488/745077610685661265/1334929278722248847, https://discord.com/channels/595666850260713488/745077610685661265/1336982987090165770\n* L2s need to ensure their systems continue work with new L1 features, regardless if the L2 env upgrades then or not. This often necessitates upgrades to L1 contracts / other tooling. Plus, many apps have 30d upgrade policies anyways. https://discord.com/channels/595666850260713488/745077610685661265/1335008059323580416\n* stage 2 rollups generally require ~30d upgrade delay, L1 should promote that not penalize over it https://discord.com/channels/595666850260713488/745077610685661265/1335075922704863324\n* light clients for ethereum L1 on other chains often require ~30d upgrade delays https://discord.com/channels/595666850260713488/745077610685661265/1333874991518973952\n\nI don't see how any of these statements could have meaningfully changed over the past 6 months, so there is no reason to deviate from the process we agreed on. If 30d is the recommended stage 2 delay period, then we _must_ given L2s time before the fork to digest and make any changes necessary using the released code. L1 should be a role model for the ecosystem, consistently shipping quality forks with reasonable timing for downstream consumers to digest and update.\n\nIn the grand scheme of things, a few months will not make or break ethereum. But one rushed fork could.",
        "created_at": "2025-08-28T17:14:29.254000+00:00",
        "attachments": null
    },
    {
        "author": "sauliusgrigaitis",
        "category": "general",
        "parent": "",
        "content": "If core devs tries to ship hardforks 2x faster maybe L2s can also look at speeding up their processes? \n\n I agree that stability is more important than timing, but still everyone including L2s should aim for faster shipping. They also could attempt to make a large part of their engineering using unreleased client versions just like client devs work on devnets.",
        "created_at": "2025-08-28T17:39:27.330000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "No they can't, at least in the case of Arbitrum chains the time window is on purpose because the contracts are owned by a DAO and this DAO needs to vote and give time to any user that doesn't want to be part of the upgrade to leave. We can't at the same time tell our users \"go use L2s they have the security of L1...\" And then at the same time expect those L2s to actively bypass that security",
        "created_at": "2025-08-28T17:46:24.419000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Having said so, this time is for mainnet and not fit testnet though",
        "created_at": "2025-08-28T17:47:17.166000+00:00",
        "attachments": null
    },
    {
        "author": "sauliusgrigaitis",
        "category": "general",
        "parent": "",
        "content": "But those 30 days is not some technical limitation. They can change their rules from 30 days to 20-15.",
        "created_at": "2025-08-28T17:47:32.725000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "The way to ship faster hard forks is for teams to improve on working on forks in parallel, scale core teams, and minimize bugs, not shaving off days during the release cycle. Sure L2s could consider reducing the voting time for upgrades, but 30d is what a lot of them have set and it is what it is.",
        "created_at": "2025-08-28T17:59:14.842000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Thank you for compiling this! I was also going back into the ACD archives trying to understand how we got to this decision. \n\nWe formally agreed to the process on ACDE#208. On the call, there were already concerns raised about the delays from the testnet scheduling part of this process, but we decided to \"take that async\", which doesn't seem to have happened. The relevant section is from about [10:30 to 13:50](https://www.youtube.com/live/0eVoE_isGBk?feature=shared\u0026t=631)\n\nReading the threads you've linked, it's clear that everyone wants 30+days between a mainnet announcement and fork date, but it's less clear to me that this is strictly necessary for the first testnet fork? I think this may actually be worth digging into with teams more, to make sure we understand their constraints. \n\nFrom what I've read, I could see something like \"testnets require a full 30 day cycle post announcement\", rather than 30 days before the *first testnet fork* being sufficient, but I'd want to validate that.",
        "created_at": "2025-08-28T18:03:09.194000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "I think the point is that the 30d period from mainnet announcement to mainnet needed for the _governance_ delay, but the actual work to prepare the software for the governance proposal in the first place happens before that. So the 30d between testnet releases and testnet activiation is the time that teams prepare the software so they can participate in the testnet upgrades themselves and iron out any issues that may arise.",
        "created_at": "2025-08-28T18:13:06.709000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "With the latest proposed timeline, there is 7d from release before launching holesky and 14d before launching sepolia. So not only do downstream teams need to drop whatever they are doing and grind on supporting the fork in 7d, they also can't actually schedule exactly when that 7d period is going to be because we will only decide when that window will be ~2 weeks before it happens.\n\nBut even if we did go with the 7d window, we're only shipping the fork ~3w earlier than if we followed the process. I think it is a weird point for us to spend so much time arguing about since we could save much more time if we focused instead on improving processes earlier on in the fork and minimizing the total number of devnet cycles.",
        "created_at": "2025-08-28T18:14:58.099000+00:00",
        "attachments": null
    },
    {
        "author": "sma4321",
        "category": "general",
        "parent": "",
        "content": "is there clarity on where the line is between \"we do/don't absolutely need another devnet\"?  because any dates after the launch of another devnet of unknowable outcomes must be much more fluid than after that line...",
        "created_at": "2025-08-28T18:27:44.315000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "and then L2 beat will downscore them",
        "created_at": "2025-08-28T18:40:35.691000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "They don't really have much of a saying, there are widely accepted limits of what an exit window should be and the notion of rollup stages is ingrained now. Asking rollups to give up a stage status because we want to ship a faster fork would be crazy. Having said so, this **only** applies to mainnet and not testnets so it's not an issue as far as I know in Fusaka's case so far.",
        "created_at": "2025-08-28T18:42:22.822000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "On the testnet point, I tried to find other instances of it coming up on ACD explicitly and there really aren't much. On [ACDE#216](https://www.youtube.com/live/dkIQxIHX56E?feature=shared\u0026t=396), I brought up the release process to highlight that if we wanted to ship in November and follow it, we'd need testnet releases late August (basically now). \n\nThe conversation shifted towards what we actually want to see before moving to testnets, and whether to change the scope of the fork, rather than an explicit discussion of the different timelines.",
        "created_at": "2025-08-28T18:46:36.504000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I'm not saying we necessarily should change what's in the process doc, and agree that upstream improvements to the process can be much higher ROI than shaving off a few days at the end (though we are past that point for Fusaka). \n\nHowever, it's not clear to me that we ever made a super clear commitment to the specific numbers in that doc, especially for the testnet rollout delays. \n\nI don't think it's unreasonable to get more feedback from stakeholders about what they see as necessary delays for testnet upgrades so that we can anchor our timeline in actual security considerations, rather than dogmatically sticking to numbers that don't seem to have a strong rationale for them.",
        "created_at": "2025-08-28T18:51:09.951000+00:00",
        "attachments": null
    },
    {
        "author": "sauliusgrigaitis",
        "category": "general",
        "parent": "",
        "content": "L2 beat also needs to upgrade 🙂",
        "created_at": "2025-08-28T19:28:59.895000+00:00",
        "attachments": null
    },
    {
        "author": "sauliusgrigaitis",
        "category": "general",
        "parent": "",
        "content": "But anyway, I think as long as we keep 30 days for mainnet they need to find a way to work with shorter timelines for testnets.",
        "created_at": "2025-08-28T19:31:17.513000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I personally think it is a bit late to deviate from the 30d process now. it is a bit too late in this specific HF. However, we probably should change expectation for Glamsterdam to 15 days if we think it is better long term",
        "created_at": "2025-08-28T21:41:44.261000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "is there a good reason why we want to speed it up by 1 month (aside from looking good on X)? as to my understanding, we do not even know if devnet-3's next non-finality is going to succeed. what are the pros and cons,  I think generally the cons outweights the pros here",
        "created_at": "2025-08-28T21:43:09.695000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "following up from today’s ACDE, here’s an alternate proposal on fusaka timelines that follows the process doc established in pectra\n\nassuming we can finish out our devnet segments in time,\n\n15 Sep: client releases for Holesky/Sepolia/Hoodi ready\n* BPO values inferred from fusaka-devnet-5\n* bug bounty begins\n\u003c14 days\u003e\n29 Sep: Holesky forks\n\u003c14 days\u003e\n13 Oct: Sepolia forks\n\u003c14 days\u003e\n27 Oct: Hoodi forks\n\u003c7 days to finalize mainnet releases incorporating learnings from testnets\u003e\n3 Nov: mainnet releases\n\u003c30 days\u003e\n3 Dec: mainnet",
        "created_at": "2025-08-28T21:51:27.656000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "we are still gathering feedback from various community members on what’s possible around release and testnet timelines to help inform our process for this (and future) forks, but putting this up for consideration",
        "created_at": "2025-08-28T21:51:41.158000+00:00",
        "attachments": null
    }
]