[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Anyone from \u003c@\u0026975128241025204224\u003e around? Please DM if so",
        "created_at": "2025-03-05T10:39:05.873000+00:00",
        "attachments": null
    },
    {
        "author": "daniellehrner",
        "category": "general",
        "parent": "",
        "content": "The Hive tests for the Sepolia issue have shown that clients are parsing the deposit contract logs slightly differently. Geth has the position and length of the data fields hard coded, while at least Nethermind and Besu read the position and length dynamically from the input. We should agree on which one is the right way to do it. EIP-6110 needs to update the correct parsing implementation afterwards. `event_data_to_deposit_request` does not take into consideration that the actual topic data is prepended by 192 bytes of \"position information\", which I think is the reason for the different implementations.",
        "created_at": "2025-03-05T13:25:47.788000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "I would vote for the hard coded position, as we would need to add much more brittle parsing logic under consensus",
        "created_at": "2025-03-05T13:33:02.614000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "EIP has a `parse_deposit_data` placeholder leaving the parsing up to implementation",
        "created_at": "2025-03-05T13:37:47.967000+00:00",
        "attachments": null
    },
    {
        "author": "daniellehrner",
        "category": "general",
        "parent": "",
        "content": "You are right, but I think it shouldn't be a placeholder, but the actual implementation. The slight differences in parsing between clients could lead to a consensus issue in a future testnet if the deposit event would be slightly different. I would prefer to have the EIP make it clear that there is only one correct way to parse it",
        "created_at": "2025-03-05T13:47:23.664000+00:00",
        "attachments": null
    },
    {
        "author": "daniellehrner",
        "category": "general",
        "parent": "",
        "content": "I am fine with that. Besu is using a library right now to parse it, but we said we want to replace it with our own parser anyways to remove the library from the critical path.",
        "created_at": "2025-03-05T13:48:23.488000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "your suggestion is to add an ABI decoder for the data of this specific event to the EIP, right?",
        "created_at": "2025-03-05T13:51:39.558000+00:00",
        "attachments": null
    },
    {
        "author": "daniellehrner",
        "category": "general",
        "parent": "",
        "content": "The easiest would be to do it like Geth does and hardcode everything:  https://github.com/ethereum/go-ethereum/blob/master/core/types/deposit.go#L41\n\nBut we should wait if the other clients are okay with that. But if they are we don't need the API decoder.",
        "created_at": "2025-03-05T14:11:48.100000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "EIP is updated with filtering out irrelevant events, https://github.com/ethereum/EIPs/pull/9453",
        "created_at": "2025-03-05T14:19:40.854000+00:00",
        "attachments": null
    },
    {
        "author": "lukaszrozmej",
        "category": "general",
        "parent": "",
        "content": "I am not convinced, ABI lenghts and offsets are there in the message if ABI changes (it shouldn't) but we use fixed offsets we will parse garbage. My point is ABI format is already part of consensus rules now.",
        "created_at": "2025-03-05T15:33:55.879000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "general",
        "parent": "",
        "content": "I made a PR to the EIPs repo to add a section called 'chain-specific considerations' to EIPs. Of course it won't fix all issues like the one on Sepolia, but could be helpful to get EIP authors to think about this earlier. https://github.com/ethereum/EIPs/pull/9457",
        "created_at": "2025-03-05T18:16:32.272000+00:00",
        "attachments": null
    }
]