[
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "\u003e Additionally, if we decide after testing on holesky and sepolia to delay the mainnet fork for whatever reason, they can simply cancel the existing upgrade transaction and issue a new one to pass through governance again once a mainnet fork time is decided for the second time.\n\nIs the key point for me. There's this conflation between committing to a minimum time interval and a \"tentative\" or target or some other time (and a \"tentative\" time is a backdoor way of setting the actual time, due to social pressure/inertia/etc).\n\nOne does not require the other, and I'd like to see the L2's advocating for this be clearer about what it precisely is they want on this point and what's useful to them.",
        "created_at": "2025-02-06T00:05:21.387000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "FWIW, we did historically have ~1 month between the last testnet fork and mainnet. Not saying we should keep doing it just because we did so in the past, but we should also justify why we'd want to reduce the delay.",
        "created_at": "2025-02-06T00:13:46.648000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Mostly the requirements here are more forward looking - at least in OP Stack case we don't have a fixed delay yet so it's just a matter of having enough time to get all chains upgraded as needed (and we need to get the word out and get all nodes upgraded which is usually the key reason for allowing a decent amount of time).\nSo the way I'd think about this is, in our fully decentralized view of the world, do we want L2s to have a multisig key that can abort a governance approved update? If we're ok with that, then sure you can cancel the mainnet release on short notice if sepolia goes bad.  If we'd want L2s to be fully controlled by governance without such an override then L1 probably shouldn't optimistically schedule things.\nI'd say we want L2s to be fully controlled by governance but it does open up an excellent question of how to handle an L1 upgrade needing to be cancelled last minute because a critical security problem was found (or the same for an L2 etc). It's not a simple place to get to.",
        "created_at": "2025-02-06T00:17:48.690000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "and Im assuming we don't want to fork on a friday-ish which is why its basically 35 days?",
        "created_at": "2025-02-06T01:14:17.862000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "There's a poll right now to consider moving the peerDAS breakout call time: https://discord.com/channels/595666850260713488/1252403418941624532/1336316456656310334\n\nIf you'd like to attend the call post pectra, please choose an option that works for you.",
        "created_at": "2025-02-06T06:54:33.051000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I am not sure if I can speak for Arbitrum cause I may get this wrong but my understanding is that Arbitrum has full on chain governance and this produces two strong constrains: \n- they need to pass on chain the upgrade in a timely manner to give everyone 30 days to withdraw if they don't agree\n- they need the full code in place before those 30 days as they need to compute the new wasm root for the upgrade. Since L2 software is blocked by L1 clients being ready, they can't do this in advance\n\nGiven that we want L2s to actually give users these guarantees that they can get out if they don't agree with an upgrade, I think we should impose these timelines on L1 as well. The options for Arbitrum are either \n1) don't upgrade on time\n2) use the multisig to upgrade as an emergency\n\nI believe 2 will not happen as it would set a terrible precedent. So it seems that not giving enough notice will effectively give advantages to rollups that don't have on chain governance in place and are not constrained by the 30 days withdrawal period of upgrades",
        "created_at": "2025-02-06T08:53:04.065000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think over time we would like to see L2s extend the withdraw window further and further past 30 days, and also remove the \"emergency powers\" backdoors they all have.  The strategy chosen by L1 should, IMO, be compatible with both of these things.",
        "created_at": "2025-02-06T09:00:35.997000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cfradamt\u003e What is the advantage for an L2 in upgrading earlier? Dencun was special because upgrading earlier meant being able to use blobs, but why would it be a big deal for Pectra or most forks?",
        "created_at": "2025-02-06T09:17:10.715000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Most rollups enable features at the same time as L1 for compatibility. One example I assume would be 7702 support",
        "created_at": "2025-02-06T09:44:57.904000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I’m not concerned with L2s enabling additional features at the same time as L1. It’s the possibility that the L1 upgrade may break the L2. Arbitrum’s (and other chain’s) multisig override currently exists to handle that but it’s something that most L2s are working to get rid of.",
        "created_at": "2025-02-06T10:07:09.779000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Same.  I don't care about them being feature parity with L1, I care a lot about them bricking if they don't upgrade at the same time.  One path L1 could take is a firm stance that L2s should *not* depend on certain L1 behaviors.  This puts some limitations on what L2s can reasonably do, but I would rather be honest about the constraints than pretend they don't exist.",
        "created_at": "2025-02-06T11:43:07.935000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If we want to see immutable L2s, then I think we need to document exactly what guarantees the L1 will make.  For example, can we guarantee that the EVM will always execute existing code in the same way going forward, with the exception to changes in gas accounting?  Do we guarantee that certain transaction types will always work?  Do we guarantee that block shape will always be additive (never subtractive)?",
        "created_at": "2025-02-06T11:44:05.902000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "structurally this avoids a kind of unscalable coupling too. i.e. L1 can coordinate with a certain number of L2's on this point, but that doesn't scale either.\n\nthis, come to \u003c#745077610685661265\u003e as individual L2s and discuss this works at a small scale, not a large one, and if it's truly important to coordinate this to avoid L2 failure (not just nonoptimal L2 fork timing/feature introduction) it seems hard to avoid eventually if L1 wants a \"rollup-centric roadmap\"",
        "created_at": "2025-02-06T11:45:36.392000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "it turns a multiple-level, loosely coupled system into something which must happen in lockstep",
        "created_at": "2025-02-06T11:46:03.973000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "**ACDC #150 in ~30 mins!**\nAgenda: https://github.com/ethereum/pm/issues/1265\nStream: https://youtube.com/live/JhDgD366DKg?feature=share\nZoom: https://ethereumfoundation.zoom.us/j/83703239965?pwd=VnjQjZ06LIaCzOjmyY1Jllt0LoTpvK.1",
        "created_at": "2025-02-06T13:26:53.234000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I've made a quick analysis on the MAX/TARGET parameters for Withdrawal requests smart contract, this is a follow up to the audits presented a week ago, specifically, to the concern on the fee computation. Here is the summary for those who are interested: https://hackmd.io/@n0ble/SJE3CzGtyl\nFor those who are not, the TL; DR is that current parameters are good to go with 👍",
        "created_at": "2025-02-06T13:38:52.154000+00:00",
        "attachments": null
    },
    {
        "author": "daniellehrner",
        "category": "general",
        "parent": "",
        "content": "Could EL teams confirm the Prague fork timestamps?\n\nHolesky slot: 3710976\nHolesky timestamp: 1740434112\n\nSepolia slot: 7118848\nSepolia timestamp: 1741159776",
        "created_at": "2025-02-06T14:23:59.893000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "general",
        "parent": "",
        "content": "ahh sorry, correction for lodestar, we also switched to publishing block first when we added  getBlobs, (with reference to today's ACD discussion)\n```ts\nconst publishPromises = [\n      // Send the block, regardless of whether or not it is valid. The API\n      // specification is very clear that this is the desired behaviour.\n      //\n      // i) Publish blobs and block before importing so that network can see them asap\n      // ii) publish block first because\n      //     a) as soon as node sees block they can start processing it while blobs arrive\n      //     b) getting block first allows nodes to use getBlobs from local ELs and save\n      //        import latency and hopefully bandwidth\n      () =\u003e network.publishBeaconBlock(signedBlock) as Promise\u003cunknown\u003e,\n      ...blobSidecars.map((blobSidecar) =\u003e () =\u003e network.publishBlobSidecar(blobSidecar)),\n```",
        "created_at": "2025-02-06T14:59:10.536000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "PR up with the timestamps: https://github.com/ethereum/EIPs/pull/9322",
        "created_at": "2025-02-06T15:00:34.185000+00:00",
        "attachments": null
    },
    {
        "author": "closer__",
        "category": "general",
        "parent": "",
        "content": "Reth Pectra Retrospective take is live\nhttps://ethereum-magicians.org/t/pectra-retrospective/22637/26?u=rkrasiuk",
        "created_at": "2025-02-06T15:24:48.458000+00:00",
        "attachments": null
    },
    {
        "author": "abcoathup",
        "category": "general",
        "parent": "",
        "content": "\u003c@539495253418180618\u003e can you add a summary of actions/decisions to Eth Magicians when you can\nhttps://ethereum-magicians.org/t/all-core-devs-consensus-acdc-150-february-6-2025/22703",
        "created_at": "2025-02-06T20:20:57.696000+00:00",
        "attachments": null
    }
]