[
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "ACDT in ~5min:\ncall link: https://ethereumfoundation.zoom.us/j/84251237513?pwd=i7iN3k2ldFFjOOP38RMb4cXv5tQedB.1\nissue: https://github.com/ethereum/pm/issues/1573\nYT: https://youtube.com/watch?v=MxVuRKsOEE8\nX: https://x.com/i/broadcasts/1OdKrDvyXvvJX",
        "created_at": "2025-06-16T13:54:55.775000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "I forgot to ask, oops 😅  \u003c@415548822983278593\u003e your point regarding verifying the claim that the ratio of trie depth between mainnet/local test would be the \"slowdown factor\" of the DB reads (and writes (?)) was a good one to indeed not skew the results with that (possibly wrong) assumption. Would you maybe have the resources/bandwidth to check this? 😅  I currently do not have a synced node where I can verify this myself (but could spin one up). If we could verify this, then making the database intentionally slower is super smart, and also good for the DevUX, since we don't have to spin up some big \"random\" state to read from 😄",
        "created_at": "2025-06-16T14:38:40.787000+00:00",
        "attachments": null
    },
    {
        "author": "marioevz",
        "category": "general",
        "parent": "",
        "content": "Notes from ACD-T today:\n\n## Berlinterop updates\n\n###  Fusaka\n\n- All [specs](https://github.com/ethereum/execution-specs/tree/devnets/osaka/2) and [tests](https://github.com/ethereum/execution-spec-tests/releases/tag/fusaka-devnet-interop%40v1.1.0) merged in devnet-2\n- devnet-2 interop: Faster process in order to test, but the changes included will now have to use ACD process to be officially included in Fusaka.\n- Fusaka Devnet-1 still live, will go down in ~1 day, and clients using it will have to move all testing to devnet-2\n\n### Gas Limit tests\n\n- Benchmarking to find bottlenecks and optimizing performance\n- Clients agreed to 45m but there are many client fixes in every client that need to go into branches before making it the new default gas limit.\n\n#### 45 Million Gas Limit Requirements\n\n- Geth: Single fix that needs to get to master branch, but stance is that going above 45m is not possible without reprices (biggest reprice is modexp that is going into fusaka), but 45m would be ok (according to marius personal opinion)\n- Nethermind: Ok with 45m, and need to put out a new release, but confortable with current release, and could just instead signal that 45m gas limit is ok for nethermind users\n- Erigon: Ready for 45m\n\n#### Benchmarking\n\n- Marcin: For fusaka, modexp is still the main bottleneck\n- After fusaka alt_bn128 precompiles (https://eips.ethereum.org/EIPS/eip-196, https://eips.ethereum.org/EIPS/eip-197) are going to be the bottleneck, and it's possible that a repricing is going to be required.\n- More testcases for EC_PAIRING and EC_MUL are needed.\n- EC_ADD there's going to be an EIP next week.\n- EIPs for ECMUL/ECPAIRING is still TBD.\n- EVM logs are a potential issue due to devp2p constrains (10mb limit)\n- Ben: Issue only kicks at 65M, so we should be ok until Fusaka.\n- Create a block full of logs scenario to help decide which approach we need.\n- We require some benchmarks for logs in order to make a more informed decision.\n\n### Deep trie issues\n\n- Sstore with deep trie, not a big issue for 45m but moving forward it will be.\n- Jochem: The Xen contract is creating a lot of small proxy contracts which delegate call into something else.\n- During the tx itself (28m gas) 67 (CREATE2) small contracts, with a lot of stores too\n- Nothing else fancy/complex seems to be happening.\n- Seems like caching mechanism of clients is not predicting this correctly.\n- There's a state test now that creates a lot of stores and contract creations, but execution time of this state test is very quick, but on mainnet this same test is taking a long time due to the size of the mainnet db.\n- We should run this same state test in a very large state size to see if this is reproducible.\n- It's also possible that there's extra logging in the mainnet tx that could be making matters worse.\n- Ben: Ran this block (but could not trace it) and it took this block (and 20+ other blocks) only 600ms to execute, which is not significant.\n- Geth: Cache of a 256MB buffer (state tree buffer) that sometimes overflows and it happens from time to time during runtime and which takes 2.5 seconds, so this could be the culprit.\n- It's bad timing, plus the complexity of the block that included the tx, which adds to the cache more than a regular block.\n- Fix would be to do this process async (flushing of this cache).\n- Will try this on a shadowfork to see how it behaves.",
        "created_at": "2025-06-16T14:47:08.408000+00:00",
        "attachments": null
    },
    {
        "author": "marioevz",
        "category": "general",
        "parent": "",
        "content": "## History Expiry\n\n- Matt: Discussions about history expiry happened last week in the interop\n- Path forward: All clients needs to polish features to allow to run without pre-merge history.\n- Releases will come out in the following weeks that drop pre-merge history at each client's convience.\n- EF will publish a block post that informs the general public that clients can run without pre-merge history.\n- We need to modify the approach with the Era file format.\n- Originally ERA1 -\u003e pre-merge, ERA2 -\u003e post-merge.\n- ERA-E will be execution layer, and ERA-C will be consensus layer.\n- This will unlock the ability for clients to start prunning history.\n- We have a backstop to access the history, depending on whether we want to do a rolling history-prunning or by stages (e.g. forks).\n- Will continue discussions for the next month and a half.\n- ERA files is not the only solution: Portal implementations is one of the alternatives.\n- Clients will analyze whether they can bring some of the portal features to each client.\n- Will pick apart the sections of the portal protocol that are usable to each client/layer and implement those.\n- The rest of the features from portal will be implemented as they seem useful.",
        "created_at": "2025-06-16T14:47:29.290000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "general",
        "parent": "",
        "content": "(167 CREATE2s 🙂  I need to learn to pronounce better, lol 😅 )",
        "created_at": "2025-06-16T14:52:12.238000+00:00",
        "attachments": null
    }
]