[
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "And that was a snarky comment made in extreme disappointment.  But here is how it looks -- People work hard, they think they have succeeded.  Then very late in the game, the rug is pulled.  Not good enough!   Try again!  So people try again.  And have the same experience.  And try again.  And have the same experience.   At some point we should either make it clear that we prefer to leave the EVM broken, or get clear on what we want, upfront, and work together to get it done.",
        "created_at": "2025-04-29T08:45:57.648000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "And that was a snarky comment made in",
        "created_at": "2025-04-29T09:44:49.087000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "I now have far more questions and concerns with how this decision is being handled than I do about the technicals of EOF.  Rough Consensus has always been roughly defined, but I have a hard time seeing this decision as resulting from that process.\n\nThis is going to need reconciliation.",
        "created_at": "2025-04-29T12:29:21.413000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "I re-watched the recording of the call, and took notes to make sure I'm not overreacting. I'm not.",
        "created_at": "2025-04-29T12:30:08.761000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "While re-watching it, I expected to get more clarity on how we went from \"Monday we will consider gas introspection and how to accommodate it in EOF\" to \"EOF is cancelled, it's just too controversial\"",
        "created_at": "2025-04-29T12:32:21.645000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "I did not get that clarity, and in discussions with others we have been unable to arrive at it.",
        "created_at": "2025-04-29T12:33:11.770000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "anyway, i would encourage others to do the same, please let me know if you find a clearer path that makes more sense.",
        "created_at": "2025-04-29T12:34:50.914000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "It is most concerning that we let a minority overtake majority consensus.\n\nThis is a vulnerability. Even Erigon/Neth/Besu (not only Reth) can probably get enough people to do the same. I think most of the concern lies there",
        "created_at": "2025-04-29T13:34:23.970000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "general",
        "parent": "",
        "content": "I agree. I am a CL dev and  know nothing about EOF, but wouldn't it make sense to gather all involved parties and have some kind of a vote to achieve \"rough consensus\"? It has happened several times already that 1-2 people push their agenda very strongly, making sure their voice is heard every single call, tweeting/posting/whatever and they achieve what they want. This is not \"rough consensus\"",
        "created_at": "2025-04-29T13:50:24.663000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "general",
        "parent": "",
        "content": "Because the way things are done now, as I understand, is back and forth discussions for/against EOF and then a decision is made based on (???)",
        "created_at": "2025-04-29T13:51:15.169000+00:00",
        "attachments": null
    },
    {
        "author": "corcoranwill",
        "category": "general",
        "parent": "",
        "content": "**PeerDAS Breakout Room Call 27 in 5min:**\n- Agenda: https://github.com/ethereum/pm/issues/1505\n- Zoom: https://ethereumfoundation.zoom.us/j/82343923303?pwd=aGLyX8xtcVeaDni8mhQi7NNIkzwuUT.1",
        "created_at": "2025-04-29T13:56:26.877000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I agree that this is a concern, but it's worth noting a couple asymmetries in the decision process:\n\n1. Many of the EOF supporters, client devs, have a full time job that includes engaging with the process. This is not true of the broader community, so when several important stakeholders take time out of their \"main thing\" to come and signal they have concerns about a feature, we should listen. The past few days weren't the first time someone raised potential issues about EOF, it's happened pretty regularly throughout the process. \n\n2. A decision to remove something can always be undone, whereas one to include a feature cannot. This isn't the only example of a feature that we've pulled in Ethereum's history because some client teams had issues. EIP-2537 probably got pulled from the most forks due to concerns about the API design and/or library stability. Personally, my bar would have been far higher had a minority tried to push for the inclusion of something vs. its removal. This is, in part, why I also don't think adding a last-minute EIP to replace EOF is a good idea.",
        "created_at": "2025-04-29T14:06:08.938000+00:00",
        "attachments": null
    },
    {
        "author": "rodiazet",
        "category": "general",
        "parent": "",
        "content": "I did not want to comment on EOF this week but I need to clarify.\nThe main \"issue\" was that 3 popular libs (+forge-std. Not mentioned) don't compile without any changes. Only one of the libs  (Uniswap perifery)  has well known issue with gas introspection on Solidity level. The rest have issues with using low level assembly which for anybody who has a minimal knowledge of VMs should not be a surprise. If we say in the very beginning of  EOF EIP that those opcodes are banned in EOF everyone should understand what it means. I don't believe that ppl raising this argument don't understand it. Almost all issues are solvable even with option A. All are solvable with reintroducing gas introspection. It requires some work and I understand that this fact can be a potential blocker for some projects but EOF is optional. It's implemented in almost all clients and most popular compiler, it's ready to be shipped in a couple of months.  I think I will never understand why we decided not to ship it.",
        "created_at": "2025-04-29T14:23:56.415000+00:00",
        "attachments": null
    },
    {
        "author": "timjanssen1989",
        "category": "general",
        "parent": "",
        "content": "The reason is I assume because we didnt reach super majority consensus. Its a shame because from reading into it it would solve a lot of issues I actually have with solidity. Namely that is hard to formally verify and easy to write crappy code with. From my understanding EOF would fix make it easier to formally verify code and would have prevented many bugs that existed in smart contracts in the past.",
        "created_at": "2025-04-29T15:03:11.517000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Everybody I have talked to doing formal verification and auditing has supported every proposal to fix the EVM for almost ten years now.   They don't speak up much anymore -- they have customers to serve and plans to make today, and can't waste time on what the core devs may or may not do in the distant future.",
        "created_at": "2025-04-29T15:25:59.028000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "The only client against was reth (4/5 in support is supermajority)",
        "created_at": "2025-04-29T15:32:23.205000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Saying this is on the core devs is misleading",
        "created_at": "2025-04-29T15:32:56.017000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Not really.  In the end, who else decides what goes in the protocol?  Who else decided on Monday to pull EOF, in its entirety?",
        "created_at": "2025-04-29T15:37:21.055000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "In this instance it was not us",
        "created_at": "2025-04-29T15:38:19.886000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "who then?",
        "created_at": "2025-04-29T15:38:37.391000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Vyper + Reth + a new client team I never heard anything about but most core devs were pro",
        "created_at": "2025-04-29T15:39:14.943000+00:00",
        "attachments": null
    },
    {
        "author": "timjanssen1989",
        "category": "general",
        "parent": "",
        "content": "Wasnt talking about client teams only.",
        "created_at": "2025-04-29T15:40:25.249000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Saying it was on the core devs as a whole is highly misleading it was a 80% supermajority pro",
        "created_at": "2025-04-29T15:40:29.260000+00:00",
        "attachments": null
    },
    {
        "author": "timjanssen1989",
        "category": "general",
        "parent": "",
        "content": "To be clear i am in favor of EOF",
        "created_at": "2025-04-29T15:40:49.939000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I am not saying anything. I am just saying this one is not on client teams",
        "created_at": "2025-04-29T15:41:15.438000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I'm not \"blaming\" client teams.  I'm saying that decisions are usually taken at Core Devs meetins, and Core Devs are ultimately responsible for what goes into the protocol.  This decision was a bad on the merits, in my opinion, but just as bad in being so rushed, and not being taken at a scheduled Core Devs meeting.",
        "created_at": "2025-04-29T15:45:47.891000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "To be clear, it _was_ both scheduled and taken at a core dev meeting. I appreciate the process can be hard to follow, but everyone showed up on Monday with the expectation that this call, which has been recurring and attended by client teams for well over a year now, is when we'd make a final decision.",
        "created_at": "2025-04-29T15:50:45.036000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "It is also worth flagging that Geth had several dissenting opinions within the team, including some strongly against EOF, and this has been the case for several months.",
        "created_at": "2025-04-29T15:52:46.821000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Geth is nuanced. But I think it is worth noting nonetheless that as a team they were not opposing it",
        "created_at": "2025-04-29T15:53:49.791000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "That's correct, and I think this is partially why I think keeping EOF in was the right call until yesterday. In isolation, I don't think any of the 'issues' was a deal breaker. But, zooming out, there are many things that made consensus exceedingly... rough 😅",
        "created_at": "2025-04-29T15:55:52.678000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I'm talking about the regular bi-weekly ADCE meetings.  Monday was a hijacked Interop meeting.",
        "created_at": "2025-04-29T15:56:33.332000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "My understanding was this call was to address specific shortcomings, (gas introspection) which represent a subset of the functionality already approved. and I don't think I'm mistaken.",
        "created_at": "2025-04-29T15:56:34.542000+00:00",
        "attachments": null
    },
    {
        "author": "rodiazet",
        "category": "general",
        "parent": "",
        "content": "So their voice should be counted as neutral",
        "created_at": "2025-04-29T15:56:36.461000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "I think this captures what i'm struggling with; why did we need to \"zoom out\" past the point that we had consensus on shipping full EOF in fusaka.",
        "created_at": "2025-04-29T15:58:38.236000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Neutral=not remove here this was SFId",
        "created_at": "2025-04-29T15:59:11.800000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "IMO because at every possible step at the process we've seen concerns raised by different stakeholders in the community, and that in this ultimate step, it still wasn't clear that there was a version that would broadly satisfy not just core devs but also the community as a whole. \n\nAnd I realize this is a bit of a departure from only gauging what client teams think, but I think this is one of the rare instances where client teams, even though they have a shared majority view, seem to have a minority (or at least much weaker majority) view when looking across the ecoystem.",
        "created_at": "2025-04-29T16:01:58.252000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I believe we could reach consensus on a minimal EOF.  It's a set of EIPS, and not all of them are controversial.",
        "created_at": "2025-04-29T16:04:01.472000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I did take the time to listen to the call after the fact (I wasn't there). Take this tweek from just a week before, replace EIP-7917 with EOF and it still applies. I was going to use the phrase \"I'm shocked\", but I'm actually not",
        "created_at": "2025-04-29T16:07:23.190000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "https://x.com/potuz_eth/status/1912929379409084533",
        "created_at": "2025-04-29T16:07:26.075000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I frankly don't give a Xit about what people Xit  😉",
        "created_at": "2025-04-29T16:11:09.523000+00:00",
        "attachments": null
    },
    {
        "author": "inspector.butters",
        "category": "general",
        "parent": "",
        "content": "the argument of most of the \"community stakeholders\" was that this is not a priority and it's not user centered. I'm not sure how valid that argument is since nothing is replacing EOF in fusaka. \n\ninstead, the logical way to handle this imo, is to compile a list of issues arising from having EOF, and allow the pro-EOF teams to come up with solutions to those issues. and then opening these documents to discussion on the call, then you can see what to throw out and what to keep. \n\nrough consensus != vibe consensus",
        "created_at": "2025-04-29T16:11:54.797000+00:00",
        "attachments": null
    },
    {
        "author": "somnergy",
        "category": "general",
        "parent": "",
        "content": "If I recall correctly, there were strong opposition from very few people against Option D of EOF (and Reth wasn't one of them). Most of these were not technical arguments and the fact that Legacy EVM lives on for indefinite period of time in future, as a first class component was never accounted for. \nBut the explanation of Option D was rushed, and confusions kept building up around the seemingly conflicting \"introspection of EOF code still not allowed\" and \"Option D will solve everything\". That naturally means, however bad we may have wanted to, many people weren't ready to commit (to inclusion or exclusion). But the process did dictate that we include it.\nAdding these two only means there were two courses of actions: Change EOF from SFI to CFI for fusaka, or revisit this topic again on another call.",
        "created_at": "2025-04-29T16:12:00.140000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "There would not be a subset that everyone agrees on. The problem with a subset is that it would not clear the hurdle of being useful enough for a standalone EOF version that we need to maintain indefinitely.",
        "created_at": "2025-04-29T16:13:00.642000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Having subroutines at all gets the EVM 80 years ahead of where it is now.",
        "created_at": "2025-04-29T16:13:56.303000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I think regardless of what happens to EOF. This set a very bad precedent to ACD.\n\nI am honestly shocked that the responsibles will likely get away with DFIing after essentially organizing an hijack on ACD",
        "created_at": "2025-04-29T16:15:56.557000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Also, I think anyone with some connections could have pulled this off (every client)",
        "created_at": "2025-04-29T16:19:08.114000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "I agree that the \"against\" team has worked around the unwritten rules that we have for the ACD process.\nI disagree that anyone has \"hijacked\" the process.\n\nFrom my point of view, this is the same issue as with 2315 and 3074, the downstream dependencies of the change where not involved in the process early enough and were surprised by it.\nWe keep making the same mistakes and I feel like we're running into the same mistake with verkle (esp. the gas model changes) again.\nWe need to communicate early and often our intended changes to the target audience (like we did with the SELFDESTRUCT removal).",
        "created_at": "2025-04-29T16:25:12.382000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Nobody was given any opportunity to either think or vote on the matter. This is hijacking, I would not know how to call it otherwise",
        "created_at": "2025-04-29T16:26:08.755000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "And again, what was pulled off was not even that sophisticated. Take a bunch of people to ACD that agree with you -\u003e profit",
        "created_at": "2025-04-29T16:26:25.719000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003e From my point of view, this is the same issue as with 2315 and 3074, the downstream dependencies of the change where not involved in the process early enough and were surprised by it.\n\nI would have preferred to never hear about the death of EIP-2315 again, let alone see it used as precedent.  But here we are again.  To quote Peter from the day it died, \"It's a nasty thing we are doing here, and it will have consequences.\"",
        "created_at": "2025-04-29T16:34:29.391000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "It appears to me as an outside observer of the ACD process that there was supermajority consensus amoung the core devs and client teams with a superminority of vocal critics. Has the goal post been moved from EiPs requiring a Supermajority to Unanimity for inclusion? It seems the bar should be quite high to remove all 11 SFI'd EOF EiPs (the majority of Fusaka eips) and it difficult to reason how that bar was met in this case. It degrades the meaning of EiPs being SFI'd if they can be removed en masse in a single call by a vocal minority.",
        "created_at": "2025-04-29T16:41:31.983000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "The biggest voices against in the last few weeks were in no way at all surprised by it. \u003c@486477492434239488\u003e was fully aware of the changes and had been vocal in favor of it, as was the entire reth team, \u003c@429719902363058177\u003e has given talks about EOF and was one of the major supporters in this last push. \u003c@840207942581747712\u003e was vocal against EOF for a while. \u003c@331104497025679362\u003e, author of one of the affected libraries has postedabout it for a while. And so on. This is definitely not a topic where actually active members of the community, even if not engaged in ACD, could have been taken by surprise.",
        "created_at": "2025-04-29T17:01:27.584000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "A surprising side-note to me is that it seems the against voices are taken with more weight:\n- The positive response from Solidity seem to weigh much less than the negative response from Vyper.\n- The neutral (to perhaps positive, given Frangio's posts) response from Openzeppelin (correct me if I misread this) similarly had little weight compared to the neutral (to perhaps slightly negative) view from Solady.\n\nAnd slightly confused by the Vyper stance given Vyper was involved for months (if not years) developing EOF and the EXCHANGE instruction is directly designed by them.",
        "created_at": "2025-04-29T17:08:14.004000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "(I know Vyper has been against it for months, so not surprised on the last few calls, just generally.)",
        "created_at": "2025-04-29T17:10:55.989000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "i will respond in a bit more depth later but i don't think the negative response from vyper was weighted more than solidity. in fact \u003c@552133098075193354\u003e shut down our opposition a couple ACDE sessions ago and i respected that https://github.com/ethereum/pm/issues/1414#issuecomment-2789928939.",
        "created_at": "2025-04-29T17:21:06.575000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "I am talking in the context of yesterday's call.",
        "created_at": "2025-04-29T17:22:55.228000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e A lot of people talking about process, when we should be talking about outcomes",
        "created_at": "2025-04-29T17:33:27.035000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I hear this a lot but do we all think EOF was bad?",
        "created_at": "2025-04-29T17:34:33.003000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "It seems to me the answer this is no",
        "created_at": "2025-04-29T17:34:44.581000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e The question was never \"Is EOF good or bad?\", but (a) do the benefits justify the costs and (b) is it the highest value thing we could implement right now",
        "created_at": "2025-04-29T17:35:50.461000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Regardless of your view on it, it seems like the \"outcome\" was not only illegitimate but also it was forced by few",
        "created_at": "2025-04-29T17:36:02.857000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e For example I do not think EOF is bad at all — from everything I have seen, it is very clear that in an ideal world, this would have been closer to the original design of the EVM",
        "created_at": "2025-04-29T17:36:34.940000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "(A) majority says yes. (B) there is nothing else to implement but the majority would have still been yes probably because it was approved by the majority",
        "created_at": "2025-04-29T17:36:54.853000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "On Monday we did not even consider Minimal or Baseline EOF, about which there is much less controversy.",
        "created_at": "2025-04-29T17:38:31.263000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "This is kind of the empasse you get at. We dont know the \"outcome\". As of now, it is 100% subjective. The only outcome we have is EOF is out which does not tell you anything",
        "created_at": "2025-04-29T17:38:40.653000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I am talking from the perspective of someone  against EOF btw",
        "created_at": "2025-04-29T17:39:52.194000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "The cost was already paid, so I think that argument should be modified",
        "created_at": "2025-04-29T17:44:40.577000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "or mostly paid",
        "created_at": "2025-04-29T17:45:25.659000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I mean - what outcome are we even evaluating here?",
        "created_at": "2025-04-29T17:47:02.827000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Nobody knows the \"outcome\" really until it is out same goes for FOCIL",
        "created_at": "2025-04-29T17:47:25.842000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Maybe FOCIL will be a disaster who knows",
        "created_at": "2025-04-29T17:47:36.417000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Maybe L1 scaling will be a disaster too",
        "created_at": "2025-04-29T17:47:53.945000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003e  The question was never \"Is EOF good or bad?\", but (a) do the benefits justify the costs\nWe had consensus that they did -- that's why they were scheduled for inclusion.\n\n\u003e (b) is it the highest value thing we could implement right now\nWe had consensus that PeerDAS and EOF were the top two priorities for this upgrade --  that's why the EOF EIPs were scheduled for inclusion.",
        "created_at": "2025-04-29T18:03:08.274000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Greg respect for being around for a while, but please it's been so long, let the people that write code \u0026 talk to users call shots",
        "created_at": "2025-04-29T18:11:44.678000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "It's just not a good use of our time anymore",
        "created_at": "2025-04-29T18:11:59.367000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "I'm sorry",
        "created_at": "2025-04-29T18:12:01.549000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "The only reason I have not been writing code is that it is currently impossible to write a linear-time compile of EVM code to machine code.",
        "created_at": "2025-04-29T18:12:57.901000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Sure. That's OK with me. Please stop derailing and nerdsniping people.",
        "created_at": "2025-04-29T18:13:22.249000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "People changed their mind. It's OK.",
        "created_at": "2025-04-29T18:13:42.347000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "My strong preference is that we back up, delay the upgrade if necessary, and to re-establish consensus on a smaller set of EIPs.\n\nIf we *absolutely must* remove EOF  then I insist that we owe it to the many people who  worked for many years to reach this consensus -- and the people who were expecting to see these changes to support their own work --  to make EOF a priority for a fork to happen *ASAP*.  And that means a priority to succeed, not yet another opportunity to fail.",
        "created_at": "2025-04-29T18:14:31.812000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Yeah that's exactly the problem, you are not in touch with the market and the competitive pressures Ethereum has, delaying the upgrade is not an option, if anything, descoping is happening to accelerate hte upgrade. For real, please talk to a user.",
        "created_at": "2025-04-29T18:15:20.319000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I talk to users often.  Have been for ten years.  What they say hasn't changed.",
        "created_at": "2025-04-29T18:16:12.367000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "🤷‍♂️",
        "created_at": "2025-04-29T18:16:29.702000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Bad process, good outcome.",
        "created_at": "2025-04-29T18:17:49.420000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Good process, good outcome moving forward.",
        "created_at": "2025-04-29T18:18:03.351000+00:00",
        "attachments": null
    },
    {
        "author": "wjmelements",
        "category": "general",
        "parent": "",
        "content": "cringe",
        "created_at": "2025-04-29T18:18:33.290000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "I'm at peace with you cringing at the statement, but ultimately, there's real user demands that many people aren't entertaining in this channel, we've been maintaining Foundry for so long and we know what devs want. Respect but this is not the hill to die on team.",
        "created_at": "2025-04-29T18:19:16.238000+00:00",
        "attachments": null
    },
    {
        "author": "somnergy",
        "category": "general",
        "parent": "",
        "content": "Nothing will be broken by making EOF real even for the few people that are upset - that's not a promise or assurance, it's a fact. Extending the logic that EOF needs to be perfect and used by everyone on day-0, it's easy to see that half the precompiles are not used but are potential security pitfalls and must be removed and should never have been there in the first place.",
        "created_at": "2025-04-29T18:20:50.965000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Is the outcome so bad with EOF shipping that we should veto established client's opinion? Generally curious to hear your take is",
        "created_at": "2025-04-29T18:25:08.543000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I think process should be broken for big things (maybe we realize that scaling the L1 is bad) but EOF seems all-in-all not so bad at least not to the point where you would break it this far?",
        "created_at": "2025-04-29T18:25:54.015000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "This essentially a \"i am dying on this hill\" stance",
        "created_at": "2025-04-29T18:26:39.804000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "EOF all-in-all is not a bad change, it's pretty good in general and I was one of the biggest advocates. Ultimately it comes down to betting the scaling roadmap on it, especially when new information \u0026 modifications keep surfacing (ISCONTRACT months ago, then TXCREATE, then the Option D code introspection etc.) -- when does it end? Just cannot bet the whole house on EOF being sound at this point. Ethereum will get steamrolled if we don't ship Fusaka \u0026 Glamsterdam stat.",
        "created_at": "2025-04-29T18:26:49.575000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "Greg respect for being around for a",
        "created_at": "2025-04-29T18:27:13.543000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Ok but what is the core actual concern? Is eof not ready?",
        "created_at": "2025-04-29T18:28:13.552000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I spoke internally about it and most told me EOF was. I just want to understand why it is an hill worth dying onto",
        "created_at": "2025-04-29T18:28:44.101000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "For what it's worth, I'm not convinced by the recent arguments against EOF.  They seem fundamentally based on the concept that EOF should be fully adopted and work for everything on day-0 which I don't believe was ever the expectation, and I don't believe it is a reasonable one.  The arguments that it hurts DevEx seem to ignore the fact that legacy EVM remains unchanged.  I'm still strongly in favor of full EOF.",
        "created_at": "2025-04-29T18:29:41.402000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "You mentioned to me all the classic concerns and you managed to turn me over with the tooling argument, sure. But whar is actually the issue here that changed your mind?",
        "created_at": "2025-04-29T18:29:45.767000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "It's not an EVM issue. Consider a Hardhat or Foundry project. Trivial example is it requires It requires dynamic remapping of dependencies for EOF/non-EOF chains. That doesn't work if you consider any non-trivial project.",
        "created_at": "2025-04-29T18:33:48.400000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "These are dev tooling issues that will need engineering work.  Nobody is saying otherwise.  This is work that will need to be done to support EOF.  I don't claim it's trivial.",
        "created_at": "2025-04-29T18:34:50.241000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "I just humbly ask ACD to write Smart Contracts w/ any Framework and appreciate the devs that are out there, not the EVM, but the Solidity \u0026 Vyper devs.",
        "created_at": "2025-04-29T18:37:18.439000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "\u003c@874433895267987456\u003e The tooling failure made me realize that I just don't trust the process anymore on other things not being discovered down the line, to answer your Q (i.e. you could put it \"eof is not ready\" security wise yeah)",
        "created_at": "2025-04-29T18:38:52.305000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "Our crypto competitors use a form of EOF\n\nIf we include as competition TradeFi with T1 settlement; they also use a form of EOF. \n\nIf legacy prevents formal verification etc (and more so with increased code size); are they going to be comfortable moving billions of dollars to irreversible Ethereum settlement rather than TradeFi rails?",
        "created_at": "2025-04-29T18:39:09.202000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "Is it transactions per second they care about in T1 settlement; or do they care about all the news of crypto hacks and security?",
        "created_at": "2025-04-29T18:40:09.625000+00:00",
        "attachments": null
    },
    {
        "author": "wjmelements",
        "category": "general",
        "parent": "",
        "content": "It's unreasonable to expect tooling to be ready before SFI. Before SFI the spec can change. I hadn't started work on any EOF support. The only tooling support I know of that was already started was experimental/PoC.",
        "created_at": "2025-04-29T18:40:44.805000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "I think this is peace-time mentality, tooling should be ready yesterday always, we did Foundry EOF in August 2024 to accelerate and get things ported faster, and I encourage everyone to adopt a higher urgency mindset for Ethereum to be a leading smart contract platform 5 years out",
        "created_at": "2025-04-29T18:43:11.260000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "If there's one thing we have **strong** consensus on, is that we do not want to delay the upgrade to Peer DAS under any circumstances, regardless of the status of EOF or whatever EIP",
        "created_at": "2025-04-29T18:43:29.291000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "and it would have been perfectly acceptable to use The Call™ to discuss scheduling and separation",
        "created_at": "2025-04-29T18:44:02.103000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "Other than having less arguments about EOF (clearly not the case); has removing it gained shipping schedule for Peer DAS?",
        "created_at": "2025-04-29T18:46:15.463000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "general",
        "parent": "",
        "content": "Is it possible to start developing EOF and abandon it when unexpected significant complications occur? We already decided to do it for one CL EIP",
        "created_at": "2025-04-29T18:46:17.337000+00:00",
        "attachments": null
    },
    {
        "author": "pcaversaccio",
        "category": "general",
        "parent": "",
        "content": "A lot has already been said but I personally would like to add that EOF is a maximally invasive upgrade proposal, which goes against any security-first principle. We're securing 300bn (or more).",
        "created_at": "2025-04-29T18:46:34.673000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "And not being able to formally verfiy is a security-first barrier to securing 10Tn (or more)",
        "created_at": "2025-04-29T18:47:43.142000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "As far as I am aware not: we always worked under the assumption that as soon as Peer DAS is ready we ship. Q3/Q4 still seems reallistic (and at the same time before that does not)",
        "created_at": "2025-04-29T18:47:47.098000+00:00",
        "attachments": null
    },
    {
        "author": "pcaversaccio",
        "category": "general",
        "parent": "",
        "content": "As outlined in my original post each goal can be achieved through less invasive means and incrementally.",
        "created_at": "2025-04-29T18:48:37.138000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003e we do not want to delay the upgrade to Peer DAS under any circumstances\nI undertand that.  I also don't want to want to work for five more years only to go through this same thing -- wait until we have EVM fixes almost in, then kill them.",
        "created_at": "2025-04-29T18:48:41.164000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Sunk cost fallacy :/",
        "created_at": "2025-04-29T18:49:56.697000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "Never start anything outcome",
        "created_at": "2025-04-29T18:50:29.329000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Haha okay not to that degree",
        "created_at": "2025-04-29T18:50:45.371000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "It's not funny \u003c@486477492434239488\u003e",
        "created_at": "2025-04-29T18:51:09.654000+00:00",
        "attachments": null
    },
    {
        "author": "rjected",
        "category": "general",
        "parent": "",
        "content": "The productive way for big evm changes to have been developed from the beginning is\n1. agree on scope and allow devs and the community to understand exact implications of the specific scope (we are not even here given option D convos)\n2. implement\n3. ship",
        "created_at": "2025-04-29T18:51:11.331000+00:00",
        "attachments": null
    },
    {
        "author": "rjected",
        "category": "general",
        "parent": "",
        "content": "1/2 can be done in parallel but we've messed up the order with eof imo, deciding we want it without knowing \"what\", ie before step 1 here",
        "created_at": "2025-04-29T18:52:12.547000+00:00",
        "attachments": null
    },
    {
        "author": "rodiazet",
        "category": "general",
        "parent": "",
        "content": "We agreed on option A month ago",
        "created_at": "2025-04-29T18:52:32.461000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "This keeps getting ignored.",
        "created_at": "2025-04-29T18:53:00.617000+00:00",
        "attachments": null
    },
    {
        "author": "rjected",
        "category": "general",
        "parent": "",
        "content": "\u003e community to understand exact implications of the specific scope\nThis part was done essentially last weekend as a reaction to changing the scope, I do not think the agreement was an informed decision",
        "created_at": "2025-04-29T18:53:50.835000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "But this is actually the point",
        "created_at": "2025-04-29T18:54:58.675000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Everything falls under that category",
        "created_at": "2025-04-29T18:55:16.071000+00:00",
        "attachments": null
    },
    {
        "author": "rodiazet",
        "category": "general",
        "parent": "",
        "content": "Ppl have to read the eips before making decision.",
        "created_at": "2025-04-29T18:55:28.903000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "Pre-sectioned executables we are talking DOS on  COM; Unix/Linux on a.out; which they both moved to PE for Windows and ELF for Unix/Linux; which is basically EOF plus lots of irrelevant (to EVM) additionals; and that moe was 40 years ago\n\nShould they have stuck with the prior formats and not improvd their Operating Systems because they would break old code with full program gotos and being able to execute data as code?",
        "created_at": "2025-04-29T18:55:29.260000+00:00",
        "attachments": null
    },
    {
        "author": "rjected",
        "category": "general",
        "parent": "",
        "content": "My answer would be no, but I do think we are a different project with different governance, in a different world, it's not the same situation. Adoption is path dependent. I don't know what pros / cons were considered when switching to ELF",
        "created_at": "2025-04-29T18:58:15.215000+00:00",
        "attachments": null
    },
    {
        "author": "pcaversaccio",
        "category": "general",
        "parent": "",
        "content": "Would people agree here that EOF overall is a VM-first and not an application/dev/user-first design? And if yes, who do you build the VM for in that case?",
        "created_at": "2025-04-29T18:58:31.581000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "general",
        "parent": "",
        "content": "Guys, nobody **knows** if implementing EOF is a good/bad idea. One side is probably closer to the truth, but nobody really **knows**. \u003c@486477492434239488\u003e If you are right, you'll be the last to laugh. But you don't own Ethereum. If there is rough agreement to ship it, we ship it.",
        "created_at": "2025-04-29T18:59:38.373000+00:00",
        "attachments": null
    },
    {
        "author": "wjmelements",
        "category": "general",
        "parent": "",
        "content": "I don't think Ethereum should have a wartime mentality. Although I agree that task priority should be focused on impact, urgency preempts long-term development, and fickle reprioritization prevents completion in favor of starting the next shiny thing.",
        "created_at": "2025-04-29T18:59:56.140000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Oh wow and thats how EOF comes back next week",
        "created_at": "2025-04-29T19:00:08.694000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Could someone actually say why some people are willing to die on a hill for EOF?",
        "created_at": "2025-04-29T19:02:59.337000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "It seems so weird to me",
        "created_at": "2025-04-29T19:03:09.232000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Is it tooling? Peerdas delay?",
        "created_at": "2025-04-29T19:03:27.591000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "Most of the arguments I have seen are centered around tooling and the cost of supporting both legacy and EOF.  I haven't seen people arguing about PeerDAS delay because there is wide agreement that we won't accept a delay.",
        "created_at": "2025-04-29T19:04:52.783000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I am sure \u003c@486477492434239488\u003e who supported it in the past long knew about it",
        "created_at": "2025-04-29T19:05:15.357000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I was ignorant abt it - i am just trying to figure out what was the reason of that circus yesterday",
        "created_at": "2025-04-29T19:05:44.251000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Something must have happened",
        "created_at": "2025-04-29T19:06:00.793000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "And I find the argument that tooling isn't ready for it unfounded because I assert that it is not reasonable to expect tooling to be ready at this stage.",
        "created_at": "2025-04-29T19:06:06.715000+00:00",
        "attachments": null
    },
    {
        "author": "somnergy",
        "category": "general",
        "parent": "",
        "content": "Again, very presumptuous and the flying pony arguments of IFTTT (that first part, totally agree with the second part tho). We were way past those 2 months ago. Most people (actual core devs included) don't fully understand the simple Pectra upgrade either. It's totally okay to get a delayed understanding, but folks need to come up with their rationale, not empty guesswork on either side. EOF is not scheduled next month yet",
        "created_at": "2025-04-29T19:06:26.528000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "This is the most important question. Please engage folks.",
        "created_at": "2025-04-29T19:08:04.153000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "Disagree, this is not relevant at all, since we are discussing from a state where EOF is already out. It WOULD be relevant in a pre-The Call™ situation.",
        "created_at": "2025-04-29T19:08:48.951000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "(cont.) yes, vyper was giving feedback for some time, even like 2-3 years ago, but some of the most important feedback got ignored. for example i tried to find out many times why global jumps were banned and didn't get an answer. i also think that EIP-663 is at odds with writing a fast evm-to-native compiler, which is one of the supposed goals of EOF. getting vyper's buy-in was never even attempted as far as i'm concerned -- in fact, when i pointed out recently that EOF is in general a lot of work for us to implement, i got told by an ipsilon member that i didn't do my homework(?) and got ignored again. i'm not sure why the hostility was necessary. i'm just stating a fact that it makes our life difficult. and it certainly didn't make me feel like i should get excited about getting EOF in.\n\nand often when i brought these kinds of things up the answer i got was basically that \"it's too late to make changes to the spec, we have to package this up and present it to ACD otherwise static jumps are never going to ship\". that's why i said that the false sense of urgency given by ACDE is harmful to the proposal process.\n\nalso, the EOF that's being shipped is much larger than the EOF i originally started evaluating (around shanghai era). you can't just add or remove features and have it be the same spec -- due to gas and code introspection, EOF just started to grow more and more \"features\" like TXCREATE, and now EXTCODETYPE and CALL_GAS_SPLIT. so it's a completely different EOF than what i originally started evaluating.\n\ni have actually been dissenting against EOF for awhile now (a year+)? if i made a mistake anywhere it was not formally and loudly dissenting earlier. earlier, i gave my opinion that other things should be prioritized ahead of EOF, but maybe my communication style was overly polite.",
        "created_at": "2025-04-29T19:09:16.184000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003e  Could someone actually say why some people are willing to die on a hill for EOF?\nBecause I cannot write a linear-time compiler for EVM to anything else in the current EVM -- it can take quadratic time.  \n\nBecause for the same reason much of static analysis and formal verification can take quadratic time -- and those are the customers that ensure security for everyone else.\n\nAnd because I and others have been trying to fix this for ten years now, with proposals failing as late in the process in as possible.  How many rug pulls must we endure?",
        "created_at": "2025-04-29T19:09:18.897000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "I think Axic said this above, but I also think this situation is primarily a minority of loud voices against, a wide middle that is loosely positive, and a larger group that is very positive and in favor of EOF but is tired of arguing for it...  and the negative voices seem to be disproportionately weighted.",
        "created_at": "2025-04-29T19:09:20.175000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "(cont.) honestly a tipping point for me was when i started to see claims that certain things can't ship without EOF, like code size increase, and started to want to gate features (like PAY) to EOF so that users are \"incentivized\" to migrate. this is not an ok approach to VM maintenance imo. if you want to ship a new VM then ship a new VM, but don't call it an improvement to the VM when it purposely breaks compatibility with the existing VM.\n\ni have stated my position on the ACDE agenda 4 weeks ago so people know where vyper stands. i'm not trying to \"hijack\" any process, when timbeiko shut down our opposition 4 weeks ago i respected that. however, if EOF comes up for discussion again i will state my position again.",
        "created_at": "2025-04-29T19:10:25.597000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Most Solidity/Vyper/app devs on Twitter were against. Do you count them?",
        "created_at": "2025-04-29T19:11:03.016000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "general",
        "parent": "",
        "content": "I completely didn't mean guesswork, I just meant that whatever rationale you have, there is a theoretical possibility you were actually wrong. So if majority is against you, you bite the bullet and move on",
        "created_at": "2025-04-29T19:11:05.746000+00:00",
        "attachments": null
    },
    {
        "author": "pcaversaccio",
        "category": "general",
        "parent": "",
        "content": "Thx for proving my point. You didn't care much during the design phase and after the call you continue to not care. I have nothing else to say at this stage.",
        "created_at": "2025-04-29T19:13:13.241000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "i also want to say that nobody should be surprised by application layer response. app devs said very clearly in this thread that they didn't want it, and core devs basically said \"you're wrong\" -- https://ethereum-magicians.org/t/ethereum-is-turning-into-a-labyrinth-of-unnecessary-complexity-with-eof-lets-reconsider-eof/23136\n\nthey have also been saying so on twitter. like i have seen people say \"where do we get a survey of users\", and the users are here! telling you what they want! i have not spoken to a single dev who has been thrilled about introspection being broken",
        "created_at": "2025-04-29T19:14:23.696000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "Most auditors, formal verifiers and AoT compilers are pro; are their voices not to be considered; as Solidy/Vyper/app devs have to pay hard cash for their services on top",
        "created_at": "2025-04-29T19:14:59.704000+00:00",
        "attachments": null
    },
    {
        "author": "somnergy",
        "category": "general",
        "parent": "",
        "content": "I do appreciate the core of your argument, I am just saying it is going to be misinterpreted. This sorta confusion is very counter-productive in public forums. I mean what is reality even, did you know the speed of light will be 0 in a Trillion years as the Universe accelerates expanding, but maybe i am just dreaming",
        "created_at": "2025-04-29T19:17:22.220000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "What do you think about increasing contract size from 28Kb to 256kB without sectioning the code via an EOF-like system?",
        "created_at": "2025-04-29T19:19:00.136000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I don't think that it need create a problem but that is a discussion for a different proposal. (E.g the final version of EIP-2315)",
        "created_at": "2025-04-29T19:24:01.914000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "There's actually no need for dependency remapping. Solidity would like to have an in-source boolean to indicate which target is chosen (https://forum.soliditylang.org/t/eof-in-language-construct-to-check-for-eof/3229), this could be used to implement both paths in the very same codebase.\n\nObviously Solidity has not implemented this proposal yet (but it is made by one of the lead authors of Solidity), because of all the uncertainty around EOF and resource planning reasons.",
        "created_at": "2025-04-29T19:24:49.198000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "Was considering the quardratic issue with analysis, would that not be effected and amplified by increasing code size?",
        "created_at": "2025-04-29T19:25:43.377000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Once you have gone polynomial constant factors hardly matter.  But again, EOF is what is on the table, and it is sectioned.  ( 2315 breaks up code into subgraphs of the CFG, which I think would suffice.)",
        "created_at": "2025-04-29T19:26:39.920000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "We are also throwing out the baby with the bathwater, EVMMAX becomes very inefficient or significantly more complex to implement without EOF.\n\nEVMMAX is a way to reduce our dependency on precompiles and open up the EVM to more cryptographic expermentation on the application layer.",
        "created_at": "2025-04-29T19:29:53.129000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "As a reminder, EOF has always been proposed as an incremental rollout, but several times on ACD a larger package (with more visible features/effects) was asked for. If we really wanted maximum effect visible at once then we'd have included EVMMAX. Obviously I think that is a bad idea, but EVMMAX is one of the really important features enabled by EOF.",
        "created_at": "2025-04-29T19:31:02.281000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "It seems to me we should bring back EOF - i think today kind of confirmed this is a vocal minority",
        "created_at": "2025-04-29T19:31:15.341000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Decision was too premature",
        "created_at": "2025-04-29T19:31:55.990000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Anyway this is just my opinion if we decide to just respect our monday's decision so be it but it seems like EOF is not worth overthrowing majority",
        "created_at": "2025-04-29T19:32:36.077000+00:00",
        "attachments": null
    },
    {
        "author": "wjmelements",
        "category": "general",
        "parent": "",
        "content": "If PeerDAS cannot be delayed then EOF should be strongly considered for the following fork.",
        "created_at": "2025-04-29T19:33:43.004000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "why not its own fork? there is VERY little EL work for PeerDAS",
        "created_at": "2025-04-29T19:34:12.440000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I dont thibk anyone would push for EOF for glamsterdam",
        "created_at": "2025-04-29T19:34:17.783000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I would just put it in Fusaka again and call our decision premature which was",
        "created_at": "2025-04-29T19:34:47.654000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "And this time no hijacking please :)",
        "created_at": "2025-04-29T19:34:57.306000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "And is zero CL work for EOF",
        "created_at": "2025-04-29T19:34:57.568000+00:00",
        "attachments": null
    },
    {
        "author": "wjmelements",
        "category": "general",
        "parent": "",
        "content": "It doesn't have to be in the same fork for ppl to work on it. The reason for that thinking is that the process currently only scopes one fork at a time. If forks are to be smaller and more frequent, we should be scheduling inclusion further into the future.",
        "created_at": "2025-04-29T19:37:44.409000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "general",
        "parent": "",
        "content": "But here the situation is different. There are people arguing for A and people arguing for B. Both sides think they are right and that their arguments are sounder. This is a situation impossible to resolve by itself. That's where the consensus part comes in and sort of dictates whether we pick A or B",
        "created_at": "2025-04-29T19:39:45.088000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I would seriously consider it for Fusaka",
        "created_at": "2025-04-29T19:39:53.623000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "general",
        "parent": "",
        "content": "We will be going in circles here eternally",
        "created_at": "2025-04-29T19:40:08.189000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "general",
        "parent": "",
        "content": "Until one side gets tired and says \"fuck it\"",
        "created_at": "2025-04-29T19:40:24.645000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "What happened monday should be invalidated imo that call was clearly compromised",
        "created_at": "2025-04-29T19:40:35.955000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "general",
        "parent": "",
        "content": "there's also EIP-7701 that is building on EOF",
        "created_at": "2025-04-29T19:40:53.920000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "Yes. Even a version of EIP-3074 with EOF (*as a rough idea*) existed back in the day adding signature invaldiation as a feature. The various entry points (sections/headers) EOF offers makes these kind of features much more easy to accomplish.",
        "created_at": "2025-04-29T19:41:56.799000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "general",
        "parent": "",
        "content": "Hypothetically if EOF would be live, we could see other usecases emerge in the future.",
        "created_at": "2025-04-29T19:42:33.403000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "As far as I could hear, the more incremental options of Minimal and Baseline EOF were not considered yesterday.  I don't know if there is more consensus there, but the Minimal option has been on the table for at least three years.",
        "created_at": "2025-04-29T19:55:12.537000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "The Minimal option would be huge progress for me and others;\n\u003e Ben {chmark} Adams: Most auditors, formal verifiers and AoT compilers are pro; are their voices not to be considered; as Solidy/Vyper/app devs have to pay hard cash for their services on to",
        "created_at": "2025-04-29T19:56:57.961000+00:00",
        "attachments": null
    },
    {
        "author": "demiurgos_23",
        "category": "general",
        "parent": "",
        "content": "it's not about dying on a hill for EOF, it's dying on a hill for a better EVM, the current one is quiet simply a poor man's implementation of a 256bit stack based turing machine, there is a reason programming languages opt for runtime based on structures similar to EOF, it offers analysabilty in reasonable time, verifiable code, we attempted and are attempting to precompile legacy bytecode to MSIL and not knowing which JUMPDEST is actually a jumpdest and which one is a NOP in disguise is impossible code takes non-linear time to analyze and compile, amortization is unpredictable, deadcode elimination is tedious,  and the fact data and code are mixed randomly in current EVM makes it even much much difficult to know which is actually dead code and which is just data being read as bytecode for the analyzers, and the fact that all the bytecode is one single huge function make the emitted code huge and hard for the CLR's jit to handle and optimize further, EOF offered smaller functions, static jumps, no more jumpdests, no more data mixed with code, we can emit structs with defined methods we can essentially build a better EVM implementation, we can analyse purity of code sections, find out const-eval function calls, structure and function sections and static jumpdest along side the stack validation are pretty good additions and almost every other VM under major languages has them for a reason.",
        "created_at": "2025-04-29T20:07:09.661000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "no i mean - dying on a hill to kill EOF",
        "created_at": "2025-04-29T20:07:37.667000+00:00",
        "attachments": null
    },
    {
        "author": "pcaversaccio",
        "category": "general",
        "parent": "",
        "content": "Please elaborate compromised? I could argue, being provocative now, that the majority of core devs are compromised in a way that they hijack Ethereum for ivory tower solutions.",
        "created_at": "2025-04-29T20:07:43.665000+00:00",
        "attachments": null
    },
    {
        "author": "demiurgos_23",
        "category": "general",
        "parent": "",
        "content": "in that case I wonder abt that too",
        "created_at": "2025-04-29T20:07:53.297000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I am speaking from the perspective who leans against EOF here:\n\nEOF was scheduled for inclusion a looong time ago with reth being a supporter alongside everyone else too. then, one day, reth decided to be against, essentially decided to take matters in their own hands and force EOF out. now the process serves the product, sure. but something like this cannot be done this way and for something as minor as EOF",
        "created_at": "2025-04-29T20:10:14.349000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "EOF is relatively minor here - you do this for L1 scaling or for serious directions in the protocols. not for an optional VM",
        "created_at": "2025-04-29T20:10:44.423000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "Well established (for good reasons) operating system and compiler output practices is not \"ivory tower\"\n\nIts learning from history and the evolution of computing",
        "created_at": "2025-04-29T20:11:09.556000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "it sets a very bad precedent first and foremost for something 100% optional and that was SFId a looong time ago",
        "created_at": "2025-04-29T20:11:55.957000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "Ethereum is the World Computer; why should it be more primitive than your phone or laptop? Which are single user; and apps don't generally interact with each other in the strong way smart contracts do",
        "created_at": "2025-04-29T20:12:06.506000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "also anyone can pull what was pulled yesterday for any feature. this is a bad precedent, something was pushed through a bug on ACD for something \"RELATIVELY\" minor (and i stress the relatively here) - I could have done the same for pushing for L1 scaling 6 months ago when it was not popular to push for it - this is something easy to do at any scale",
        "created_at": "2025-04-29T20:13:08.657000+00:00",
        "attachments": null
    },
    {
        "author": "demiurgos_23",
        "category": "general",
        "parent": "",
        "content": "and everyone can agree that the current evm is a subpar solution, it \"working\" till now doesn't mean we should just accept it as it, \u003c@226589605816696832\u003e gave a very good example yesterday, good change sometimes comes with breaking changes, dotnet \"migrated\" from dotnet framework to dotnet core, and it had skeptics it introduced some limitations, but if it wasn't for that we probably wouldn't have our Nethermind client",
        "created_at": "2025-04-29T20:15:09.519000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Erigon,Nethermind and Besu all have connections to pull the stunt that was pulled yesterday for virtually any feature ovverriding consensus amongst core devs",
        "created_at": "2025-04-29T20:15:20.187000+00:00",
        "attachments": null
    },
    {
        "author": "demiurgos_23",
        "category": "general",
        "parent": "",
        "content": "and yes application users often dont care if the program or app is made in java or kotlin or c# as long as it works as expected",
        "created_at": "2025-04-29T20:15:53.502000+00:00",
        "attachments": null
    },
    {
        "author": "demiurgos_23",
        "category": "general",
        "parent": "",
        "content": "users of Ethereum wont care if it is eof or legacy or risc-v",
        "created_at": "2025-04-29T20:16:13.193000+00:00",
        "attachments": null
    },
    {
        "author": "demiurgos_23",
        "category": "general",
        "parent": "",
        "content": "as long as Ethereum is working as they want it to",
        "created_at": "2025-04-29T20:16:29.646000+00:00",
        "attachments": null
    },
    {
        "author": "rodiazet",
        "category": "general",
        "parent": "",
        "content": "But auditors do",
        "created_at": "2025-04-29T20:16:37.898000+00:00",
        "attachments": null
    },
    {
        "author": "demiurgos_23",
        "category": "general",
        "parent": "",
        "content": "it is compiler devs and application devs and auditors that",
        "created_at": "2025-04-29T20:16:45.711000+00:00",
        "attachments": null
    },
    {
        "author": "demiurgos_23",
        "category": "general",
        "parent": "",
        "content": "build on bytecode structure",
        "created_at": "2025-04-29T20:16:51.721000+00:00",
        "attachments": null
    },
    {
        "author": "demiurgos_23",
        "category": "general",
        "parent": "",
        "content": "and those (except Vyper team) voiced that legacy bytecode is tedious",
        "created_at": "2025-04-29T20:17:05.654000+00:00",
        "attachments": null
    },
    {
        "author": "demiurgos_23",
        "category": "general",
        "parent": "",
        "content": "painful to work with",
        "created_at": "2025-04-29T20:17:09.597000+00:00",
        "attachments": null
    },
    {
        "author": "demiurgos_23",
        "category": "general",
        "parent": "",
        "content": "so in a way EOF allowed us to anaylize code, verify it and build better execution environment for it, but naaah somehow we still chose to go with a bad vm",
        "created_at": "2025-04-29T20:19:30.667000+00:00",
        "attachments": null
    },
    {
        "author": "somnergy",
        "category": "general",
        "parent": "",
        "content": "Got it, and yes, say it like that, and possibly even more specific - who A and B are and what exactly are they saying, and whether there is a C. (I would still drop the word \"impossible\" there)",
        "created_at": "2025-04-29T20:24:25.443000+00:00",
        "attachments": null
    },
    {
        "author": "pcaversaccio",
        "category": "general",
        "parent": "",
        "content": "To make an analogy, if you ask me, EOF is like renovating the engine while the dashboard is already on fire. The dashboard is on fire because no one's designing here for the people actually building the apps.",
        "created_at": "2025-04-29T20:33:29.450000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "it's optional",
        "created_at": "2025-04-29T20:34:05.960000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "i donpt still think it is worth pulling what was pulled yesterday",
        "created_at": "2025-04-29T20:34:43.108000+00:00",
        "attachments": null
    },
    {
        "author": "demiurgos_23",
        "category": "general",
        "parent": "",
        "content": "how would an EVM designed for people who build apps look like then? because the current one is not well designed for that either",
        "created_at": "2025-04-29T20:35:53.913000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "Is like saying Intel and AMD shouldn't improve their processors because Microsoft has an issue in VisualC++ and they should fix that first",
        "created_at": "2025-04-29T20:37:05.298000+00:00",
        "attachments": null
    },
    {
        "author": "demiurgos_23",
        "category": "general",
        "parent": "",
        "content": "or imagine when apple migrated to apple silicon for their chip, they could have just said no, it is too big of a risk or worry about legacy programs and apps",
        "created_at": "2025-04-29T20:39:50.419000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "As I said on the call, I do not lean in either direction. I can see the benefits of a new and improved vm and I can see the drawbacks of EOF. \n\nOne thing that I want to note, is that I can not honestly say that I understand the specification. I implemented it and I understand the broad strokes of it, but I don't really understand why we have certain rules during stack or code validation and why these rules are changing, from my pov, very frequently. Do I need to? Probably not, but I currently feel like I need to trust the EOF authors that they have played through every scenario and every edge case in their head. \n\nOn the other hand, while I can emphasize with the contract and library devs who are worrying about the usage and compatability of their libraries, I don't think thats a strong argument against progress. \n\nI would like if people engaged more with \u003c@408154589494247424\u003e arguments above.\n\nI can still see what I saw yesterday on the call, the group deeply divided with no one willing or able to change their minds. In this case I still think defaulting to not shipping a feature is the right decision (and please stop insinuating that this is capture or a psyops, I feel like everyone here is stating their personal views)",
        "created_at": "2025-04-29T20:41:46.795000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "the 2 groups are really not the same \"size\" here tho but anyways i am tired so whatever",
        "created_at": "2025-04-29T20:44:23.404000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "\u003e please stop insinuating that this is capture or a psyops\nYes,  please.  I think people are acting in good faith, but the effect is to derail years of good work with no warning.  The people doing that work are not the ones making insinuations, but I think they do feel defeated and disrespected.",
        "created_at": "2025-04-29T20:49:22.891000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "\u003c@360491619402776577\u003e could you clarify this point: \" In this case I still think defaulting to not shipping a feature is the right decision\" wrt an SFI status. I don't understand how the default state for something Scheduled For Inclusion is to not ship it.",
        "created_at": "2025-04-29T20:49:45.968000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "The most I read about this the most I worry. I have seen well stated technical arguments on both sides. But for each technical argument against EOF, I have seen a pretty convincing reply from Ipsilon team, Solidity, etc. And then there is a whole different rally about users, how core devs are not relatable to users, how this EIP is not user focused, etc. While there is clearly a need to involve more of the wide user community on ACD, it is not less true that these arguments like \"I have been talking to users\", \"users demand competitiveness of Ethereum\", \"We are required to be on warmode\", etc. are simply non-tangible concepts that are not measurable and are at the same time not debatable since no one  that is data driven can actually disagree (nor agree for that matter). I am very weary that decisions in Ethereum government body would be guided by some ethereal concept that can only be based on hearsay and not in a clearly articulated list of effects that a proposal would have in the UX of the chain. There are two sets of loosely defined concepts that have been used against this EIP: \"users should be the focus first\" and \"complexity is blowing up\". Both are highly subjective and I believe that the first concept is being used in an unfair and unbased manner with this EIP, while the second has been discussed at large and the people with the highest knowledge and more worried about the protocol complexity had agreed numerous times (with some exceptions being the minority) that it was worth the effort. \n\nAgain, I am not part of the technical discusion of EOF, but I am incredibly dissapointed to see a side drop an EIP with non-measurable effects and appeals to \"users desires\" when these are ultimately not really known nor provably known and when every single concrete example was appropriately addressed.",
        "created_at": "2025-04-29T20:58:44.039000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "Alexey from Erigon: by rejecting EOF (rightly or wrongly), Ethereum makes a very important choice, probably irreversible, and this needs to be understood. It chooses the strategy of rollup aggregator as a sole strategy, giving up on the strategy of the smart contract platform (again, rightly or wrongly). As \u003c@683653554631868440\u003e keeps pointing out correctly, EVM has been primitively designed, compared to anything that is out there: BPF (used in Solana), WASM, JVM, Risk-V, etc. But there is another problem, which I call \"incomprehensive state problem\", which is not widely understood, but it is the reason why some form of archive nodes will always be required. Solana, with all its drawbacks, has better VM (because it chose not to invent it), and comprehensible state (because, having chosen not to invent VM, it did not need to invent new programming languages). Fixings these 2  things does require going for EOF. Not fixing them is also OK, but it needs to be understood what future directions are forfeited thereby",
        "created_at": "2025-04-29T21:03:14.706000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "Clarification",
        "created_at": "2025-04-29T21:03:22.463000+00:00",
        "attachments": null
    },
    {
        "author": "smartprogrammer",
        "category": "general",
        "parent": "",
        "content": "Agreed, once something reaches SFI status by rough consensus, it should only be removed by rough consensus",
        "created_at": "2025-04-29T21:08:25.206000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "this is my reading of the DFI definition.",
        "created_at": "2025-04-29T21:12:08.914000+00:00",
        "attachments": null
    },
    {
        "author": "pdobacz",
        "category": "general",
        "parent": "",
        "content": "\u003e I can not honestly say that I understand the specification\nJust want to note: Please ask for clarifications whenever needed, also there is the bi-weekly EOF call. We answer questions, add clarifications to EIPs and  if needed also EEST tests to cover such unclear case.\n\n\u003e rules are changing, from my pov, very frequently.\nTo address feedback received, and that would be from \"eof-denvet-0\" spec to \"eof-devnet-1\", so once in bulk for a bunch of changes gathered over several weeks. That seems normal and also [happened to 7702](https://github.com/ethereum/EIPs/pull/9248), for example.",
        "created_at": "2025-04-29T21:38:05.027000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "that interop call doesnt seem like the time or the place for reaching that consensus, IMO there almost needs to be a retro on what the heck happened on that call.",
        "created_at": "2025-04-29T22:45:25.966000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "I have a much more moderate view of \"what rejecting EOF means for ethereum\"",
        "created_at": "2025-04-29T23:16:50.557000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "Which is that large changes have a high fixed cost (to devs, to application devs, to infrastructure, etc)",
        "created_at": "2025-04-29T23:17:07.608000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "And therefore, large changes should not be done for the sake of a 1.5x gain, but should be done for a 10x gain",
        "created_at": "2025-04-29T23:17:30.028000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "I've similarly been rethinking my thoughts on what we should do to keep ethereum simple and avoid over-bloating things",
        "created_at": "2025-04-29T23:17:48.668000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "eg. I pushed hard for the SELFDESTRUCT removal",
        "created_at": "2025-04-29T23:18:03.182000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "but that was _a lot_ of work, and ultimately for not too much gain",
        "created_at": "2025-04-29T23:18:14.746000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "And so in areas where any change means disrupting workflows, incremental piecemeal approaches are just not the right strategy",
        "created_at": "2025-04-29T23:19:01.425000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "so I don't see EOF vs no EOF as being decisive for \"the vision of what L1 is for\", purely because EOF's pros and cons are both of the \"1.5x\" flavor rather than the \"10x\" flavor",
        "created_at": "2025-04-29T23:19:47.522000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "vision of L1 is to scale enough to both directly support major applications and to be a backbone for L2 proving / interconnection, I think this is consensus at this point, and this requires improvements of the 10x flavor",
        "created_at": "2025-04-29T23:22:15.933000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "btw this is the source of my thinking for the RISC-V shift",
        "created_at": "2025-04-29T23:24:09.874000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "(and as I said elsewhere, I'm fully okay with a minimal VM other than RISC-V, the underlying principle is \"whatever language the ZK-EVMs are written in, smart contracts should have access to that language directly\")",
        "created_at": "2025-04-29T23:24:52.668000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "RISC-V is also sectioned much like EOF (though more bloaty as full ELF)",
        "created_at": "2025-04-29T23:24:57.921000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "Isn't a raw binary format like legacy; but partitioned into executable, data sections etc",
        "created_at": "2025-04-29T23:27:20.441000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "And EOF brings improved auditability and verifiably of smart contracts; which while not a direct dev coding experience, is what devs generally have to pay a 3rd party for (so part of it); and what we rely on for users not to get hacked",
        "created_at": "2025-04-29T23:29:40.810000+00:00",
        "attachments": null
    },
    {
        "author": "tkstanczak",
        "category": "general",
        "parent": "",
        "content": "I stayed neutral.\n\nWhy I did not support EOF:\n* team Ypsilon still involved in devnets and specs after the final vote was pointing at the state of EOF still being patched and improved\n* the fact that team Ypsilon prepared a document for the final call that was still suggesting multiple options (by now there shoukd be strictly only one option proposed by Ypsilon)\n* none / few non-core devs users coming to the call or appearing in media kn defense of EOF (which suggested that almost nobody but core devs got convinced by the pro-EOF arguments - so they were not presented with real world scenarios showing audit costs falling or performance gains or so)\n\nAbove reasons did not turn me against the EOF - simply did not allow me to switch from neutral.",
        "created_at": "2025-04-29T23:31:33.841000+00:00",
        "attachments": null
    },
    {
        "author": "tkstanczak",
        "category": "general",
        "parent": "",
        "content": "I will still explore and will suggest improvements to the process for each of the future EIPs.",
        "created_at": "2025-04-29T23:32:41.072000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "well technically the risc-v spec and the executable format spec are separable, but yeah, realistically if we do risc-v we should just do it with a proper executable format, and I would favor \"just using ELF\"",
        "created_at": "2025-04-29T23:35:40.635000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "\"just using\" other people's stuff also has the benefit of disciplining us by constraining us to an external spec, so we don't go adding random things for short-term needs",
        "created_at": "2025-04-29T23:36:08.379000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "The more concerning aspect IMO is not that people disagree, but the handling seems like a complete subversion of any process we've ever followed. I could be wrong, but from the outside it looked very odd.",
        "created_at": "2025-04-29T23:36:19.853000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "to me it ironically feels like a continuation of the process 😆  very progpow vibes",
        "created_at": "2025-04-29T23:36:48.130000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "which is a sign that the aspects of the process that were broken at progpow time are not yet fixed",
        "created_at": "2025-04-29T23:37:05.932000+00:00",
        "attachments": null
    },
    {
        "author": "siladu",
        "category": "general",
        "parent": "",
        "content": "\u003e none / few non-core devs users coming to the call or appearing in media kn defense of EOF\nI think part of the problem is the very short timeline between Thursday's call and Monday for such a big decision.\n\nSeems plausible to me that since EOF was successfully SFI'd previously (on multiple occasions), non-core devs disengaged assuming it would stay in. Participation may have been bias to those that spend their weekend on twitter and are following the anti-EOF sentiment.",
        "created_at": "2025-04-29T23:39:19.050000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "My diagnosis: this is a common trait of a democratic system, that it takes a long time to \"steer a boat\", but when the boat finally steers (often quite inconveniently late) the steer can be quite strong",
        "created_at": "2025-04-29T23:39:20.781000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "this is not to say \"all good, no need to change\", rather that this is the starting point, and possibly even there are things we can learn from other people who have had and solved this problem",
        "created_at": "2025-04-29T23:41:00.656000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I don't think this is the right way to look at the timeline. \n\nFirst, we agreed on Thursday that we'd make the call on Monday, so no one on the ACD side should have been surprised by this. \n\nSecond, EOF has been discussed for the better part of the last 5 years. The fact that \"last minute issues\" can still show up is a signal in an of itself, when we are already past the point where the fork scope should be finalized.  \n\nThird, waiting is an implicit decision too. Everyone agreed PeerDAS should be priority #1 and EOF should not delay it. If we spend an extra month debating the right EOF version, odds are by the time we implement it, PeerDAS will be delayed, and we'll either have to pull EOF out at the (new) last minute, or actually ship PeerDAS later than expected.",
        "created_at": "2025-04-29T23:42:49.067000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003e non-core devs disengaged assuming it would stay in\n\nI feel we saw the exact opposite of this: at every possible occasion, many ecosystem participants who generally only loosely follow the process showed up to voice their objection, including Monday.",
        "created_at": "2025-04-29T23:43:40.598000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "At least watching it, it seemed like a very very vocal minority... again i've not followed this whole thing and that could be a mis-representation",
        "created_at": "2025-04-29T23:46:56.863000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "I think the other problem is that there are vocal minorities on both sides",
        "created_at": "2025-04-29T23:47:52.578000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "The last minute issues were compromises for the detractors; seems a shame to hold that against the design that the implementors were willing to make compromises for perceived day-1 adoption problems; rather than taking a hard uncompromising line 😢",
        "created_at": "2025-04-29T23:47:57.545000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "The core dev process is bad at taking into account views of people who are not as closely involved in core dev meetings at a sufficiently early time",
        "created_at": "2025-04-29T23:49:10.438000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "which leads to people learning about things that they disagree with at quite a late stage",
        "created_at": "2025-04-29T23:49:33.363000+00:00",
        "attachments": null
    },
    {
        "author": "siladu",
        "category": "general",
        "parent": "",
        "content": "It may be so, but I'm finding it hard to judge how representative the non-core devs that spoke up are of the whole ecosystem tbh. \n\nI still think a couple of days is too fast to make this decision, especially when part of the reason for pulling it out was there wasn't the most coherent response from EOF teams.\n\nI appreciate and support wanting to keep on schedule and not delay PeerDAS, but giving an extra week or two to allow a proper response to the \"new information\" doesn't really change much IMO. Do we gain much from pulling EOF now rather than in two weeks?\n\nAppreciate your moderation efforts on the call 🙏",
        "created_at": "2025-04-29T23:54:10.032000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I’m no EVM expert so can’t speak with confidence on the topic, but on ACDE we did explicitly make the call to decide yesterday and now two weeks from then 😅",
        "created_at": "2025-04-29T23:57:14.757000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "how would you define \"the call\" because what was agreed to be discussed on Monday seems to be under dispute",
        "created_at": "2025-04-29T23:57:59.412000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "many of us remember it as \"to shift from Option A to Option D or not\"",
        "created_at": "2025-04-29T23:58:25.961000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "I want to try to move more substantive discourse to media other than calls",
        "created_at": "2025-04-29T23:59:21.826000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I agree with the sentence, but this is not the case this time though. People that were vocal against and rallied strongly on Twitter this week have been very aware and involved for a very long time",
        "created_at": "2025-04-29T23:59:45.445000+00:00",
        "attachments": null
    }
]