[
    {
        "author": "infamousrev",
        "category": "general",
        "parent": "",
        "content": "Has anyone ever considered implementing a minimum gas fee (which will be burned) and minimum blob fee (also burned) that can be voted on in a similar manner than the gas limit? Of course developers could implement sane limits of the range (say 0-4 gwei). I think it would make smaller validators more in favor of voting for a higher gas limit (even it that means having the buy a larger SSD), because it would also mean that the minimum fee burn  would ensure that that new blockspace wont simply be given away for free but would contribute of the fee burn.",
        "created_at": "2025-05-10T11:57:02.501000+00:00",
        "attachments": null
    },
    {
        "author": "infamousrev",
        "category": "general",
        "parent": "",
        "content": "The issue with the loss leader strategy of keeping the transaction fees at 0 when there is no congestion is that it creates a conflict of interest between smaller validators and voting for a higher gas limit (because their hardware costs are higher relative to their validator profit)",
        "created_at": "2025-05-10T12:11:41.630000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "\u003c@478178670637219840\u003e are you familiar with EIP-1559?",
        "created_at": "2025-05-10T12:13:03.261000+00:00",
        "attachments": null
    },
    {
        "author": "infamousrev",
        "category": "general",
        "parent": "",
        "content": "Yes, but it doesnt implement a minimum fee right?",
        "created_at": "2025-05-10T12:14:25.651000+00:00",
        "attachments": null
    },
    {
        "author": "infamousrev",
        "category": "general",
        "parent": "",
        "content": "I mean tweaking the algorithm of eip-1559 a bit so that the base fee will have a lower bound that can be picked by the validators in a similar way than the gas limit (but with sane range picked by developers). That way it can be raised a bit in times when hardware upgrades might be necessary (like getting close to filling up commonly owned SSD sizes (2tb/4tb/8tb) but it can also be lowered back down if some alternative DA is being perceived as taking market share from ethereum.",
        "created_at": "2025-05-10T12:20:44.735000+00:00",
        "attachments": null
    },
    {
        "author": "infamousrev",
        "category": "general",
        "parent": "",
        "content": "In a way ethereum provides a very valuable service of being the root of trust for many layer 2 projects but the default fee algorithm choses to give this service away for free in times of low congestion (no fee burn). Since its hard to put a price on well estabished trust I doubt that ethereum charging a very small minimum base fee would immidiately cause projects to migrate to less well known less well tested alternatives.",
        "created_at": "2025-05-10T12:36:47.685000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Some EIPs in Fusaka fix this exact problem",
        "created_at": "2025-05-10T13:26:58.739000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "There is a better fee mechanism for blobs which won't price them at 0 during low congestion. Still kinda low but it is hard to set a minimum \"tariff\" because nomination is in ETH so you cannot be too greedy",
        "created_at": "2025-05-10T13:27:32.143000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I mean: you could just take a number out of thin air. 0.1 GWEI would work for blobs even if price 100xed",
        "created_at": "2025-05-10T13:30:32.581000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "well - plus you can consider that with price at 100x things wont stay in a vacuum so blob demand will be so high that 0.1 Gwei will be low. But this all thin air stuff",
        "created_at": "2025-05-10T13:32:58.728000+00:00",
        "attachments": null
    },
    {
        "author": "infamousrev",
        "category": "general",
        "parent": "",
        "content": "I agree that its hard to pick a specific value therefore it can be an idea to make it so that it can be voted on by validators in the same way the gaslimit is changed so it can be part of an ongoing community debate about what the optimal value is (just like how the gaslimit changes)",
        "created_at": "2025-05-10T14:36:21.119000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "this might be an okay idea",
        "created_at": "2025-05-10T14:48:05.719000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "Blob pricing EIPs CFI for Fusaka",
        "created_at": "2025-05-10T15:42:39.066000+00:00",
        "attachments": null
    }
]