[
    {
        "author": "justindrake",
        "category": "general",
        "parent": "",
        "content": "Ethproofs call #3 will happen tomorrow (July 11) at 2pm UTC 🙂\n\nPlease DM me or \u003c@836720546842148864\u003e for a calendar invite. (The Zoom link can be found in the public \"Ethereum Protocol Calls\" calendar.) You're also welcome to join the community Telegram group: t.me/ethproofs_community\n\nThe call will start with 7 updates, 4 of which from members of the EF's new zkEVM team (Kev, Sophia, Ignacio, Cody). There will then be a presentation titled \"gigagas L1\" to kickstart a technical discussion on turning the L1 EVM into a zkEVM.",
        "created_at": "2025-07-10T06:22:22.339000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "🤞 a gigagas discussion will include discussion about how to avoid massive state growth (which ZK doesn't help with), perhaps by repricing all state storing operations by 100x?  Same concern for bandwidth, block bodies can explode unless we crank up intrinsic cost and call data cost in parallel with a big gas limit expansion.",
        "created_at": "2025-07-10T07:16:33.659000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e state creation (not updates) could be a lot more expensive I think. I would guess it doesn't have to be 100x but 10x at least seems to be a good idea",
        "created_at": "2025-07-10T12:25:40.211000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "**ACDC #160 in 10 mins**\nAgenda: https://github.com/ethereum/pm/issues/1598\nStream: https://www.youtube.com/watch?v=WPT-PTuBb0U\nZoom: https://ethereumfoundation.zoom.us/j/85969202880?pwd=YUayBl1jRhwRFCHXwwajzKLkKX0afM.1",
        "created_at": "2025-07-10T13:51:18.619000+00:00",
        "attachments": null
    },
    {
        "author": "lookupforsky",
        "category": "general",
        "parent": "",
        "content": "X/Twitter Stream: https://x.com/i/broadcasts/1LyxBWdPXnpKN",
        "created_at": "2025-07-10T13:56:36.636000+00:00",
        "attachments": null
    },
    {
        "author": "sauliusgrigaitis",
        "category": "general",
        "parent": "",
        "content": "I believe we should first identify the core problems—or \"themes,\" though a better term may exist—that we want to solve in Ethereum in order to succeed in such a competitive environment. Rather than focusing on specific EIPs, we need a broader, more strategic approach. A collaborative effort involving major ecosystem players, marketing teams, protocol developers, and others could help shape meaningful improvements to Ethereum as a product.\n\nThrough this process, key stakeholders would commit to adopting the outcomes of these efforts. For example, staking pools could agree to consolidate 80% of their stake within six months, assuming the consolidation mechanism is implemented in a way that aligns with their needs. This doesn’t mean developers should simply build whatever individual players demand—it means there should be a joint design and implementation effort between users and developers to ensure what’s shipped will be used, and this will have a great impact on Ethereum competitiveness.",
        "created_at": "2025-07-10T15:20:46.498000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "yeah, i think its a helpful framing to think about headliner/EIP selection in glamsterdam\n\nmy read is that there's plenty of interest on the EL side for \"scaling (execution)\" and a nice corollary to this on the CL would be \"efficiency\" (if we feel that scaling is too generic on the CL side)",
        "created_at": "2025-07-10T15:57:18.886000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "and in that light, i think there's a core set of CL headliners that fit well",
        "created_at": "2025-07-10T15:58:21.716000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "general",
        "parent": "",
        "content": "what is the expected implementation difficulty of BALs? seems relatively small compared to epbs / DE / reduced slot times / FOCIL?",
        "created_at": "2025-07-10T16:28:24.740000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "From a CL perspective it's much simpler 🙂",
        "created_at": "2025-07-10T16:30:48.596000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "general",
        "parent": "",
        "content": "I would imagine that just implementing the specs is relatively simple, but taking full advantage of BALs will take more work? things like\n- start state root computation immediately in the background\n- load state in parallel, but in smart ordering\n- execute transactions in parallel",
        "created_at": "2025-07-10T16:31:01.162000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "general",
        "parent": "",
        "content": "yea exactly. but these things don't have to be ready at time of hardfork (obv would be nice). so maybe doesnt warrant hardfork headline status",
        "created_at": "2025-07-10T16:37:06.425000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "The Multi-dimenaional gas proposal will allow us to tweak storage growth rates without blowing up the gas schedule.",
        "created_at": "2025-07-10T16:51:31.759000+00:00",
        "attachments": null
    }
]