[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Anyone can be a champion, but it usually means showing up to core dev calls and coordinating work.  It is essentially the role of product manager and requires technical understanding so you can facilitate discussion and make sure things are progressing.",
        "created_at": "2025-12-03T05:09:01.956000+00:00",
        "attachments": null
    },
    {
        "author": "abcoathup",
        "category": "general",
        "parent": "",
        "content": "Poll (for signaling purposes only) for portmanteau for Heka + Bogotá upgrade\nhttps://ethereum-magicians.org/t/portmanteau-for-heka-bogota-upgrade-after-glamsterdam/26400",
        "created_at": "2025-12-03T06:22:58.092000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I think the role changes over time. It's mostly BD and marketing first. By the time it turns into a PM work is mostly because it was accepted and then that role can be filled by someone else. In the CL side of things it's typically the CL spec maintainer that takes up this role. In later stages it goes to pandaops to coordinate. This is in a sense the bottleneck cause all EIPs land in the hands of the CL spec maintainers and then pandaops. Whether the initial work is done by a large separate group of people. Luckily this has improved a lot in the last year or two. Pandaops is a full grown team and the CL spec now has a lot of help and a more structured work schedule",
        "created_at": "2025-12-03T09:18:30.322000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "What does \"BD and Marketing\" mean in this context?",
        "created_at": "2025-12-03T09:19:25.339000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "A gentle way of putting it would be raising awareness of the problem it's being solved and how",
        "created_at": "2025-12-03T09:20:21.284000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Raise awareness with who?",
        "created_at": "2025-12-03T09:20:34.598000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "With the whole community",
        "created_at": "2025-12-03T09:20:45.745000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "To what end?",
        "created_at": "2025-12-03T09:20:49.692000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "To convince community that it is a needed change",
        "created_at": "2025-12-03T09:21:04.297000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I'm asking these questions because I don't like the answer I'm getting to them in my head, and I'm hoping you answer differently.  😬",
        "created_at": "2025-12-03T09:21:16.478000+00:00",
        "attachments": null
    },
    {
        "author": "sauliusgrigaitis",
        "category": "general",
        "parent": "",
        "content": "I would say a core dev that is super excited about his EIP is not the best champion because of obvious bias. IMO the best champion would be someone who has the ability to objectively assess the ecosystem-wide impact of the EIP.",
        "created_at": "2025-12-03T09:21:32.707000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Let me fast forward a bit, tell me where my internal logic is wrong:\n**Micah**: And how does one identify when The Community has decided that it is a needed change?\n**Potuz**: By gauging online sentiment.\n**Micah**: So what you are saying is that BD \u0026 Marketing effectively translates to \"someone who hires an Indian botfarm to brigade twitter and issues with AI generated content espousing how great a particular EIP is?\"\n**Potuz**: No, I'm saying that BD \u0026 Marketing effectively translates to \"someone who bribes a sufficient number of social media influencers to speak positively about the change in public spaces.\"",
        "created_at": "2025-12-03T09:24:30.137000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Back in my day, the champion was the person who went around talking to core devs to find out where disagreements in the design were, identify root cause of disagreement, correct understandings where necessary, facilitate discussion in core dev calls, curate EIP contents, reply to questions in discussions, etc.  There was no \"BD \u0026 Marketing\" to it, it was basically a herding cats and documentation job.  It sounds like things have changed, and it is not obvious the change is for the better.",
        "created_at": "2025-12-03T09:26:38.275000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "This is still the case, but reaching core devs is not enough in many cases: you need to fix the design to attend requests from relay operators, builders, staking providers, etc. In addition to the ones you missed above that were always part of the \"reaching\" time which where app builders",
        "created_at": "2025-12-03T09:31:39.052000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Ethereum has grown a lot and reaching to all affected parties is a daunting task",
        "created_at": "2025-12-03T09:32:15.677000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Can you appreciate how the job you are proposing is incredibly vulnerable to Goodhart's Law?",
        "created_at": "2025-12-03T09:32:38.801000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "And in some cases, no matter how much good will on both sides. You won't find a middle ground that attends all",
        "created_at": "2025-12-03T09:32:55.368000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\"Reach app builders\" for example suffers the problem of \"which app builders\" to which the answer is \"the ones who agree with me and have clout in the industry (i.e., VC money), not the smaller builders who care about their users and don't have clout\".",
        "created_at": "2025-12-03T09:33:19.545000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Like are people reaching out to Uniswap or are they reaching out to Rotki to gauge app builder sentiment?",
        "created_at": "2025-12-03T09:34:05.873000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "For builders, are they reaching out to the 3 block builders that dominate building, which looks a lot like regulatory capture, or are they reaching out to aspiring builders who want to be competitive in the space but can't because we keep adding features for the top 3 rather than the upstarts?",
        "created_at": "2025-12-03T09:35:15.872000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "If you have a better system I'm all ears. Not contacting anyone and living in an ACD bubble is not a good idea",
        "created_at": "2025-12-03T09:35:59.820000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "No one likes my solution to the problem.  😆  Stop changing a live protocol and go build something new where you aren't going to accidentally wreck some poor sap with no political clout because you had no way to contact them for feedback.",
        "created_at": "2025-12-03T09:40:20.583000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If we insist on continuing on this path though, at the least the goal should be to reach:\n* Mission aligned participants rather than VC aligned participants.  People like Rotki trying to build permissionless, censorship resistant, self custody, apps/tools rather than people building centralized censoring tools.\n* Small participants rather than big participants.  Solo stakers with 1 validator, not Coinbase, Kraken, and Lido.\n* People in countries suffering significantly from financial censorship, not people in countries with functional financial systems.\n* Users who actually use Ethereum for something other than a casino.  People who pay their bills with crypto, buy goods and services with crypto, use crypto to secure their assets, etc. rather than people who hang out on pump.fun, aave, yearn, and Uniswap all day long and cash everything out to fiat to buy their yachts.",
        "created_at": "2025-12-03T09:40:21.598000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Of course, if we were to ossify this into something formal I'm sure someone clever would figure out a way to make Goodhart's Law apply.",
        "created_at": "2025-12-03T09:41:43.949000+00:00",
        "attachments": null
    },
    {
        "author": "anuragchvn",
        "category": "general",
        "parent": "",
        "content": "Built an SSZ verifier with zero dependencies. 118 tests passing across TypeScript, C, and Rust implementations.\n\nTargeting embedded systems and zkVMs. C implementation works with no_std, AFL++ fuzzing found zero crashes after 584K iterations.\n\ncode: https://github.com/anuragchvn-blip/ssz-universal-verifier\n\nLooking for feedback on the implementation and testing approaches. Anyone working with SSZ in resource constrained environments?",
        "created_at": "2025-12-03T12:08:22.228000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "I think both these upgrades,  FOCiL and SSS, have a lot of community support from the most important cohort of stakeholders (end users \u0026 L2s). The controversy is that both have now been essentially signaled by the core devs for Hegotá, but due to the self-imposed constraints of only one headliner eip from each from the CL \u0026 EL, two CL headliners are not possible. We also have the additional constraint of a high priority for 6 month hard fork cadences.\n\nEither we will need to essentially contradict the earlier signaling and choose between SSS \u0026 FOCiL (which will erode trust in the signaling process and cause a commotion) or deprioritize the 6 month upgrade cadence and lift the limit on the # of headliner eips permitted per layer.",
        "created_at": "2025-12-03T16:12:18.854000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "I think both these upgrades,  FOCiL and",
        "created_at": "2025-12-03T16:35:00.586000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "general",
        "parent": "",
        "content": "Fusaka just finalized on Mainnet! \n```\n2025-12-03 22:01:59.004 INFO  - Epoch Event *** Epoch: 411394, Justified checkpoint: 411393, Finalized checkpoint: 411392, Finalized root: 24f825d13a58c2aef66786519c48477b475672506538a610441d17d405889f2b\n```",
        "created_at": "2025-12-03T22:03:25.022000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "general",
        "parent": "",
        "content": "https://tenor.com/view/wolf-of-wall-street-lets-goo-gif-11742735383203550293",
        "created_at": "2025-12-03T22:03:31.863000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "general",
        "parent": "",
        "content": "ELs are  like, fusaka is cool, but did you see that BPO1 is just around the corner?: ```\nINFO [12-03|22:03:49.213] Ready for fork activation                fork=BPO1  date=\"09 Dec 25 14:21 UTC\" remaining=136h17m22s timestamp=1,765,290,071\n```",
        "created_at": "2025-12-03T22:04:58.112000+00:00",
        "attachments": null
    },
    {
        "author": "celtic.warrior",
        "category": "general",
        "parent": "",
        "content": "Nice job Ethereum devs!  You guys don't get enough credit for this level of technical awesomeness.",
        "created_at": "2025-12-03T22:10:28.462000+00:00",
        "attachments": null
    }
]