[
    {
        "author": "sanleo",
        "category": "general",
        "parent": "",
        "content": "I was an app dev speaking in the chat\nThe call organiser (iirc) specifically asked people who were not core devs to not speak since we were pressed for time.\nI think its poor to say we need app devs input, and then move the goal posts.\n\nI think part of the problem is that the research \u0026 core dev teams seem kind of impenetrable for the average app dev / wider community\nUntil you really sink your teeth in, it feels impossible to actually make your voice heard or make a difference\nAnd moving the goal posts from forums -\u003e discord -\u003e call -\u003e you have to speak, I think is unfair.\n\nIf we actually want app devs input, we need to make ourselves more accessible, or their voices more heard. I understand this is prone to DoS but I'm sure there's a balance to be struck.\nI'm speaking on this regardless of views on EOF -- they are not relevant to my point.",
        "created_at": "2025-05-02T01:21:54.158000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "Forums, posting on ACDC/E meeting issues, attending breakout calls on the subject and giving feedback (were 71 of them for EOF), discord, speaking on ACD calls all good\n\nMostly saying just in the ACD call chat isn't the best as don't capture it well as an \"on the record\" opinion that people review and can easily link to/reference",
        "created_at": "2025-05-02T02:50:28.586000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "As pointed out \u003c@552133098075193354\u003e and \u003c@539495253418180618\u003e try to express the chat verbally on the call record; but if its very fast moving that's hard to capture; and it jumps all over the place with replies to earlier messages; reaction emojis etc",
        "created_at": "2025-05-02T02:54:30.886000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "So basically we are losing a chance for close gap with other competitor, while closing the door also to a possibile future risc-v upgrade",
        "created_at": "2025-05-02T03:28:18.987000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "The question I feel totally missing is from a prospective of new builder starting today in web3 is more attractive build on ethereum with or without EOF?",
        "created_at": "2025-05-02T03:30:56.248000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "The point is that we are only starting and the developer out there are a moltitude more that the ones actually working on web3",
        "created_at": "2025-05-02T03:32:19.455000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "Is this the correct choise for ethereum future? No for paradigm team or app dev a e b\nWhose interest are being made here?",
        "created_at": "2025-05-02T03:34:00.597000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "And after seing how paradigm team members used twitter for influence the decision is even less more clear (left aside the big concern that can happen again in the future) considering also the weak position against of reth team stated here yesterday from a reth team member",
        "created_at": "2025-05-02T03:40:29.677000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "I think many of us outside observers into the ACD process are concerned by what transpired with EOF.  \u003c@486477492434239488\u003e  from Paradigm/Reth came across as dismissive of other dev opinions \u0026 towards \u003c@683653554631868440\u003e in particular. The Reth's team viewpoint was seemingly more heavily weighted than the supermajority opinion based on the claim that they have a better insight into what dapp devs \u0026 users want. There was little of technical substance to their EOF opposition beyond that.  That 11 SFI'd EIPs were canceled in a single call without support from any other client teams besides Reth and only a superminority of other core devs does feel like a hijacking of the ACD process. For reference of what I am referring to https://discord.com/channels/595666850260713488/745077610685661265/1366839387710820354\nIt gives the impression to the community that a single superminority EL client has captured veto power in the ACD governance process and moved the goal post from a Supermajority to Unanimity to keep even SFI'd eip(s) safe from being removed.",
        "created_at": "2025-05-02T04:11:44.489000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "this is not an impression is a fact",
        "created_at": "2025-05-02T04:13:04.135000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "and an highly concerning one",
        "created_at": "2025-05-02T04:13:51.745000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "Ah and what said against Greg to dismiss his opinion is not concerning is disgusting",
        "created_at": "2025-05-02T04:20:10.858000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "also the claim \"they have a better insight into what dapp devs \u0026 users want\" is really true? they started having it when? considering that they changed opinion last minute",
        "created_at": "2025-05-02T04:57:28.812000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "this feel a totally excuse and what happened a show of strenght from reth/paradigm to make power balance change inside ACD",
        "created_at": "2025-05-02T05:00:06.635000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "Paradigm which develops Reth interacts with dapp devs via their other products such as Foundry.  Not sure where they interact with users directly.",
        "created_at": "2025-05-02T05:03:54.297000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "Yeah I know that, but if that is the true motive didn't they be against from start?",
        "created_at": "2025-05-02T05:05:33.235000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "This is what make me think that this is an excuse",
        "created_at": "2025-05-02T05:06:33.728000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I don't think we need to assume bad intent here. Fine to disagree on what \"users\" want but it's generally unhelpful to question motives.",
        "created_at": "2025-05-02T05:21:46.773000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Yep. Reiterating my core point:\n\nThe PeerDAS timeline cannot be compromised due to fragmentation of focus, testing resources, and tail risk.\n\nThere is evidence on a reactive development of EOF vs proactive one which does not inspire trust after 5yrs of dev on the tail risk not compromising peerdas. Examples: ISCONTRACT being flagged by our team a few months ago, TXCREATE being discovered as a need recently, and nobody asking the Q: \"what will libraries need to do to adopt it\"?\n\nGiven the above, and the complexity of EOF as a change (which I helped PM/organize in our team and I appreciate both for it's good and bad elements) I cannot recommend rolling out EOF in production in such wartime.\n\nIf we had the benefit of a potential blowup delaying Fusaka by 3-4 months I could be fine with it, but we don't have the luxury of time.",
        "created_at": "2025-05-02T05:29:58.518000+00:00",
        "attachments": null
    },
    {
        "author": "abcoathup",
        "category": "general",
        "parent": "",
        "content": "Self-reported Foundry usage in latest Solidity developer survey:\n\n\u003e This year, Foundry takes over Hardhat as the most popular Ethereum-specific IDE with the highest percentage of users (51.1%). After rising in popularity from 1.6% in 2021 to 30% in 2022 and 32% in 2023, Foundry has been gaining more users within the Solidity community and Ethereum ecosystem in general.\n\nhttps://soliditylang.org/blog/2025/04/25/solidity-developer-survey-2024-results/",
        "created_at": "2025-05-02T05:30:38.238000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "This probably from your point of view not mine motive are all that matter here",
        "created_at": "2025-05-02T05:35:17.957000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "And to justify a decision like that motive need to be strong without left any doubt, and not unclear and opaque like are now",
        "created_at": "2025-05-02T05:36:46.451000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "I understand \u003c@486477492434239488\u003e position and reasoning on EOF. The concern is the seemingly arbitrary \u0026 capricious manner in which a large # of previously SFI'd eips were abruptly DFI'd  in what appears like a breach of the established EiP process. It has both undermined the perception of fairness in the process and disenfranchised a number of EOF devs, contributors \u0026 supporters.",
        "created_at": "2025-05-02T05:53:33.064000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Acknowledged and I think we should reflect on why we had to end up in \"bad process good outcome\" vs \"good process great outcome\"",
        "created_at": "2025-05-02T06:00:43.706000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "the point is that you have a bad process and the implication this have for the future are clear",
        "created_at": "2025-05-02T06:04:50.866000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "talking about it change nothing",
        "created_at": "2025-05-02T06:05:53.761000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "plus if peerdas delay was the main blocker you can have decided at least for the future what option pursuit, make them starting develop it and do a  temperature check of eof readiness two month before peerdas is ready (that is almost 6 month away at lest from what I read) and there eventually chose to dealy to glamsterm or an EL only fork to not hold back peerdas\nbut you chose insted of killing eof and any future EVM upgrade",
        "created_at": "2025-05-02T06:13:41.816000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "again the motivation stated here accrued only doubts without clearing any",
        "created_at": "2025-05-02T06:14:15.207000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "What is the reason why EOF is supposed to delay PeerDAS? How much overlap in required resources there is there? Now we seem to be shifting to this, as gas observability does not seem to be a good point to argue",
        "created_at": "2025-05-02T06:16:30.302000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Here was a strawman high ROI set of EVM upgrades! I know these have immediate benefit w/o breaking user space!",
        "created_at": "2025-05-02T06:16:53.754000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "yeah ready at best for 2028",
        "created_at": "2025-05-02T06:17:16.184000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "No it still is the issue, full EOF just wasn't tenable at all imho",
        "created_at": "2025-05-02T06:17:22.186000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "but you canned all EOF not only option A",
        "created_at": "2025-05-02T06:17:55.225000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "Gas observability is something that has to be given up in any case, if any kind of development strategy is proposed. I am pointing out that the reason gas observability seems to be a \"holy cow\" is exactly the absense of strategy. If we bother to create one, it will be clear that it has to go.",
        "created_at": "2025-05-02T06:21:05.806000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Yes because my arguments are not A or B, it's A and B and C And D...and all of them are a huge stack you just cannot ignore. (My arguments are ABCD in this example, not EOF options)",
        "created_at": "2025-05-02T06:21:38.088000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "currently we are at the \"strategic ambiguity\" zone (where did I hear this expression before?) 🙂",
        "created_at": "2025-05-02T06:22:04.622000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "so basically you brought opposition that force them to put again on the table all option previuosly proposed and then used as escuse to kill all EOF",
        "created_at": "2025-05-02T06:30:01.587000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "this is what my simple mind see",
        "created_at": "2025-05-02T06:30:34.620000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "I think the reason to overtrow the process need to be of several magnitude more critical than these motivation, to make it at least acceptable",
        "created_at": "2025-05-02T06:39:02.986000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "We can disagree on the criticality, I think I am actually under communicating how critical shipping Fusaka/peerDAS and a L1 scaling-focused Glamsterdam by Q1 2026 is for Ethereum to matter 5yrs out given competitive environment",
        "created_at": "2025-05-02T06:45:49.953000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "Just the fact that critical is opinabile make it not critical at all",
        "created_at": "2025-05-02T06:48:52.310000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "Plus is opinable also that kill eof like this will speed peerdas or glamsterdam",
        "created_at": "2025-05-02T06:50:49.300000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "and who will assure us that next upgrade a team dont pull again the same feat to block a major L1 upgrade going against majority consensus?",
        "created_at": "2025-05-02T06:57:13.656000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "the major implication here are not simply EOF vs no EOF",
        "created_at": "2025-05-02T06:57:57.382000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "\u003e The vast majority of software in the world does not require these features, and it still works 🙂\n\nmost (all?) major software platforms have tracing facilities. here are some off the top of my head, at different levels of the stack\n- https://www.intel.com/content/www/us/en/docs/trace-analyzer-collector/user-guide-reference/2021-10/cpu-cycle-counter.html\n- https://pubs.opengroup.org/onlinepubs/9699919799/functions/posix_trace_create.html\n- https://docs.python.org/3/library/sys.html#sys.settrace",
        "created_at": "2025-05-02T07:38:55.983000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "\u003e It also has an object format, and therefore can perform memory-mapping from storage to memory, and thus use regular programming structures, like struct and enum, instead of scattering everything with Keccak around a hash-table.\n\nwhat is the relation between the object format and memory mapping/hash table? these seem unrelated to me",
        "created_at": "2025-05-02T07:43:44.570000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "These are equivalent to the rpc trace methods; you aren't tracing in the same program running and then altering the execution flow based on the tracing (debugging aside, but you aren't going to onchain debugging of the same smart contract running as that would cost crazy gas) i.e. there is still trace introspection, geth trace, partity style traces etc via json rpc `debug_traceTransaction` etc",
        "created_at": "2025-05-02T07:56:43.494000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "what? ben 😂",
        "created_at": "2025-05-02T08:00:56.325000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "Object format allows you to specify the mapping between storage and VM memory prior to the execution of the code (data sections). Without object format, data has to be loaded explicitely into the VM memory by such instructions as `SLOAD`, etc. If Ethereum were to fix the incomprehensive state problem, it would need to migrate to linear (from hashtable) model of storage, and this requires the structure and semantics that object format brings. But I doubt very much this will ever happen. Against, because there is no strategy to make this happen",
        "created_at": "2025-05-02T08:01:10.899000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "you can definitely modify execution flow based on the cpu counter",
        "created_at": "2025-05-02T08:02:00.604000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "the ability to trace code does not require the tracing to be part of the VM instruction set. This can be achieved (and usually is) by the instrumentation of the runtime (physical or logical). This is not the same concern as gas observability, where control flow decisions are made based on the gas counter",
        "created_at": "2025-05-02T08:04:02.855000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "Then what happens when the gas schedules are radically changed https://github.com/imapp-pl/gas-cost-estimator/blob/master/docs/gas-schedule-proposal.md#radical-gas-schedule-proposal\n\nOr completely different (RISC-V, etc)\n\nIf you want to cap; can always have the dispatch call loop via legacy code",
        "created_at": "2025-05-02T08:06:12.213000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "https://stackoverflow.com/questions/52187221/how-to-calculate-the-no-of-clock-cycles-in-riscv-clang",
        "created_at": "2025-05-02T08:06:25.304000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "i'm not saying that gas/counter introspection is a need to have for VM designs in general. i'm just saying most software platforms have it",
        "created_at": "2025-05-02T08:07:18.645000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "For reporting or control flow?",
        "created_at": "2025-05-02T08:08:05.459000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "control flow. like you can definitely modify control flow based on cpu counter",
        "created_at": "2025-05-02T08:08:33.240000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "so you regularly do something different if you executed 8 cpu instructions vs 10 cpu instructions (not time based)",
        "created_at": "2025-05-02T08:09:37.977000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "this is definitely a good point",
        "created_at": "2025-05-02T08:10:09.879000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "not.. regularly, but it's part of the instruction set. like i don't think the ISA designers would throw that in if ppl weren't asking for it",
        "created_at": "2025-05-02T08:11:10.536000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "Normally use it for profiling; and then we have the rpc tracing for that",
        "created_at": "2025-05-02T08:11:51.078000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "\u003e If you want to cap; can always have the dispatch call loop via legacy code\n\nwhat is the point of removing the introspection if it's easily bypassed?",
        "created_at": "2025-05-02T08:12:51.800000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "there has been increasing concern in the context of timing sidechannels (Meltdown/Spectre/L1TF/etc) about these, to the extent that web browsers have been trying to remove high-precision timers precisely so people can't",
        "created_at": "2025-05-02T08:13:15.027000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "95% of gas() calls in OZ and Solady are passing all gas to calling function; is an unnecessary step in Option A as its the default behavior",
        "created_at": "2025-05-02T08:13:16.441000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "it's not an unalloyed good",
        "created_at": "2025-05-02T08:13:28.470000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "nothing in this kind of engineering is unalloyed good 😂",
        "created_at": "2025-05-02T08:13:52.788000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "sure, indeed",
        "created_at": "2025-05-02T08:14:05.740000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "regarding strategy, i think this is a good point and the lack of clarity here has really been muddying up the discussion the past few days. core devs don't even seem to agree on the goal of EOF - is it static jumps? enable fast EVM-to-native compilation? a container format? is it \"we need to break userspace because this is the last chance to ship any improvement to the EVM, ever\"? (is it the final, perfect version of the EVM that has escaped the cycle of suffering and samsara? 🤓 ). like these are all different goals and have different ways of getting there. and there is even design tension between some of these goals.",
        "created_at": "2025-05-02T08:18:06.717000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "like if core devs really want to ban introspection, then imo the \"proper\" migration path would be to *first* ship opcodes for all the use cases that are broken by the ban (e.g., PAY and EXTCODETYPE) and then ship the ban after it's had some time to settle and see if truly all user cases are addressed by these opcodes, and they have had time to migrate code to the non-introspecting versions",
        "created_at": "2025-05-02T08:19:32.800000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "I will rephrase my point from earlier, given the disscussion with \u003c@408154589494247424\u003e who brings valid critique. So the choice here is: should we assume that all those libraries and contracts that currently cannot work without gas/code introspection will not be redone/replaced, and this non-observability will not be used by them (but probably used by some others, their competitors perhaps?), and therefore we should not do EOF, or do we assume that they will do eventually? It is still my assumption that all those libraries and contracts that currently cannot work without gas/code introspection, can be redone (or replaced). The decision was made otherwise. \u003c@486477492434239488\u003e \u003c@273808422753796097\u003e will you want future RISCV system to also have gas observability? will it masquerade gas as number of clock cycles? Because you believe that it is not possible to change/replace things like Forge/Uniswap/Proxies?",
        "created_at": "2025-05-02T08:19:48.543000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "It is not that EOF core devs cannot decide what the purpose of EOF is. There is an opportunity to fix a few pain points in one go, and this was option A. The alternative is to fix them one-by-one, or perhaps only some of them, this will leave more EOF versions to maintain over time.",
        "created_at": "2025-05-02T08:21:26.589000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "shipping PAY and EXTCODETYPE does not even require multiple EOF versions. these can be shipped in the current EVM",
        "created_at": "2025-05-02T08:22:22.218000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "PAY should be shipped anyways. EXTCODETYPE i don't have a strong opinion on, but it would be a valid feature to ship as part of a migration path",
        "created_at": "2025-05-02T08:23:04.417000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "what i have heard repeatedly is that ACDE does not actually have faith that these things can be shipped in phases. so therefore they must all be bundled together, and not as individual pieces. i disagree with this logic, i don't think broken process justifies breaking userspace just because ACDE isn't able to ship in a migration-friendly way",
        "created_at": "2025-05-02T08:24:42.276000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "as far I understand, `PAY` has been added by some requests very recently, it has very little to do with EOF. But one of the features of EOF is that new opcodes (including multi-byte opcodes) can be added without needing to treat it as a new version of EVM.",
        "created_at": "2025-05-02T08:26:19.057000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "Does cause L2 fragmentation on deployment as there is no feature detect; had issues with PUSH0 for this reason for example (EOF fails on deploy as it does feature detect opcodes, legacy allows deploy but fails at runtime)",
        "created_at": "2025-05-02T08:26:35.745000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "And the reason why things cannot be shipped in phases is exactly the lack of overarching strategy on EL",
        "created_at": "2025-05-02T08:27:21.492000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "you cannot only ship 1 step ahead, this is no strategical approach",
        "created_at": "2025-05-02T08:27:48.985000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The people involved in EOF tried for a long time to ship features one at a time but they kept getting rejected by core devs because the core devs felt the individual changes didn't provide value on their own.",
        "created_at": "2025-05-02T08:28:04.294000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "deploy/no-deploy can be dealt with at the framework level. in fact i added this to titanoboa on account of PUSH0 -- https://github.com/vyperlang/titanoboa/blob/2a9600c7706696a85734a9c904a162fda34c0d70/boa/network.py#L107-L109. needing to switch a feature flag to deploy is very different from maintaining two sources with possibly different semantics.",
        "created_at": "2025-05-02T08:29:27.982000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "isn't that a problem? like the individual changes are judged not to provide value on their own, so we should bundle them all together in a huge package?",
        "created_at": "2025-05-02T08:30:10.656000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "just want a faster horse rather than a car?",
        "created_at": "2025-05-02T08:31:56.041000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "general",
        "parent": "",
        "content": "i'm not even convinced EOF is a car",
        "created_at": "2025-05-02T08:33:28.406000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "the strategic approach would be: formulate the goal, for example, fix EL issues that were fixed in Solana (and there is bunch). Identify those issues, develop the form in which they will appear. It cannot be done in a single change, break it up, but in a way which does not create too many \"scars\". Widely publish the strategy and waive it like a flag.",
        "created_at": "2025-05-02T08:34:08.075000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "instead, we are arguing like warring tribes",
        "created_at": "2025-05-02T08:36:54.725000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "What if it was called VEXF instead?",
        "created_at": "2025-05-02T08:37:38.477000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "raw.png",
                "content": "6a043789d527c96da4385a112bfef5bc9c2be4c9d55140ceede42326712bbed2"
            }
        ]
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "if completing with Solana is not the goal, let's please say it, and we will all go to other things",
        "created_at": "2025-05-02T08:40:48.069000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "to tending to our Forges, Uniswaps, L2s, and other things",
        "created_at": "2025-05-02T08:41:08.025000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "to selling more blobs 🙂",
        "created_at": "2025-05-02T08:42:55.021000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "yeah this is my main concern",
        "created_at": "2025-05-02T08:44:10.365000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Competing with Solana is definitely not my goal.  My goal is to build a better future, free from financial exclusionism and surveillance.",
        "created_at": "2025-05-02T08:46:26.079000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "but is an home staker goal, to not see their investment become dust",
        "created_at": "2025-05-02T08:47:00.412000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "because the main investment for a node operator are the 32 eth",
        "created_at": "2025-05-02T08:47:45.378000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Stakers are service providers.  We are not building Ethereum to make them or anyone else rich.  We pay what is necessary to get the needed service provided.",
        "created_at": "2025-05-02T08:47:54.784000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "and the main income are the annual %",
        "created_at": "2025-05-02T08:48:08.708000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "That goal is not good for all-coredevs, unfortunately",
        "created_at": "2025-05-02T08:48:13.765000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "so dont state at every proposal that home staker can be a blocker, because you simply dont care to have them participating",
        "created_at": "2025-05-02T08:49:09.078000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It used to be why almost all core devs participated.  These days I agree that the ethos of making the world a better place has declined in popularity among core devs in favor of getting rich and winning.",
        "created_at": "2025-05-02T08:49:11.028000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We need them, and that is why we pay them and will continue to pay them.  But we aren't designing the chain for them.",
        "created_at": "2025-05-02T08:49:51.568000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "you pay us with what? dust",
        "created_at": "2025-05-02T08:50:16.857000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "Solana will eventually change its commitment mechanism, which currently the main thing that prevents it from becoming its own rollup aggregator. Given its design, it will be relatively easy to change commitment, though with some performance penalty. And then, we shall see who is going to sell more blobs 🙂",
        "created_at": "2025-05-02T08:50:22.080000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "Ethereum will still be good for conferences though",
        "created_at": "2025-05-02T08:50:46.187000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "the cost/risk associated as now not make running a node from home profitable and if some are stopping node is for this",
        "created_at": "2025-05-02T08:52:42.515000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "or you think they run them to please Micah?",
        "created_at": "2025-05-02T08:56:01.596000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "we need home staker but we dont care what they think is a good approach to preserve them, really",
        "created_at": "2025-05-02T08:56:54.628000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "so basically you build ethereum only for coinbase L2 and big  app dev good to know (the only ones really rich)",
        "created_at": "2025-05-02T08:58:31.593000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "this make me understand that this(ethereum) is not my place anymore, sorry to bore you",
        "created_at": "2025-05-02T08:59:33.021000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "yeah conference payed to speak of other projects like the last ones",
        "created_at": "2025-05-02T09:03:37.530000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "It used to be why almost all core devs",
        "created_at": "2025-05-02T09:06:15.612000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "I don't go to talks anyway. It is usually the place where everyone (not only from Ethereum) goes - so in this sense Ethereum is the best of the best",
        "created_at": "2025-05-02T09:07:12.946000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Path dependence is a thing and we need to be thoughtful about the steps to get there. Agree with the goal of course as I come from an environment that has suffered financially over the last 25 years.",
        "created_at": "2025-05-02T10:12:01.172000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "Competing with Solana is definitely not",
        "created_at": "2025-05-02T13:53:29.324000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "How did you help PM/organize?  Feels a bit ovesold.\n\nISCONTRACT was part of the spec from last year, heavily discussed in meetings that at least one paradigm employee was at.",
        "created_at": "2025-05-02T14:25:36.541000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "TXCREATE was part of discussions since 2022.  It was delayed for pectra.  Discussed frequently in the same implementor calls.",
        "created_at": "2025-05-02T14:26:14.486000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "I understand and accept the desire to zero out the code impacts, but please lets keep facts straight.",
        "created_at": "2025-05-02T14:26:48.108000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "PeerDAS now has no EL itmes that can interefer with it's scheduling, so that's no longer an issue.  Clients should pivot to figuring out what their problems are as the gas limit increases to 100MGas or more (most already have done this, even while EOF was live)",
        "created_at": "2025-05-02T14:30:20.045000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "\u003e if completing with Solana is not the goal, let's please say it, and we will all go to other things\n\nPeople have explicitly said (though not with the exact words) that competing with Solana is not a Goal.\n\nPeople with equal standing have also said (though not with the exact words) that competing with Solana is the most important goal.\n\nHow do we reconcile these two contradictory positions from people with equal standing?",
        "created_at": "2025-05-02T14:39:18.778000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Internally at the team, to know the tradeoffs, not in your work..edited the original msg to avoid confusion",
        "created_at": "2025-05-02T15:05:59.504000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "You're not competing w Solana for super high tps L1 but you are competing for \"winning smsrr contract platform\"",
        "created_at": "2025-05-02T15:08:28.004000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "general",
        "parent": "",
        "content": "absolutely, we might or might not be competing w SOL but in eyes of the blockchain users we defintely are",
        "created_at": "2025-05-02T15:10:24.666000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "But there is also an equally important faction that help build this chain that place cypherpunk values (privacy, censorship resistance, true decentralizaiton) as higher than chain wars.  Do we tell them to leave?  There needs to be a reconciliation between those two camps.",
        "created_at": "2025-05-02T15:18:23.444000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "cant we try to work in parallel for both? serious question\nbecause with the cost of transaction of ethereum even if you achieve the perfect privacy, censorship resistance, true decentralization whats the point if is remain only a things for rich?",
        "created_at": "2025-05-02T15:26:29.003000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "do you think that an african guys with only hundreds of $ of portfolio can afford to waste 10$+ of fee on a single transaction?",
        "created_at": "2025-05-02T15:28:08.258000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "he'll die of fee on-chain",
        "created_at": "2025-05-02T15:28:22.920000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "think also accessibility is an aspect to consider",
        "created_at": "2025-05-02T15:28:47.637000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "Low fees are a different task than market cap.  Low ether price actually helps in that regard.",
        "created_at": "2025-05-02T15:35:36.162000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "The way we work in parallel for both is by distilling the preferences of 12ish client dev teams, and pursuing rough consensus. There are many devs for whom price is in fact a driving motivator, but the important bit is that it is the core devs that are betting their talent and labor on it.",
        "created_at": "2025-05-02T15:35:37.780000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "The conflict is we can achieve low fees, privacy, censorship resistance, true decentralization, and massive scale,  and ether can still sit out of the top 10 maket cap.  Market cap can find itself decoupled from every cyperpunk value.",
        "created_at": "2025-05-02T15:38:09.872000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "sorry misread the post thinked that the guys that you were answering was talking about gas limit raising",
        "created_at": "2025-05-02T15:39:28.061000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I think that you can do a lot of improvements before you actually hit cyberphunk valiues",
        "created_at": "2025-05-02T15:39:32.655000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "also you need to seriously evaluate what actually makes sense to be centralised and what does not make sense to centralised",
        "created_at": "2025-05-02T15:40:02.385000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "Let's not conflate decentralized with evenly distributed.",
        "created_at": "2025-05-02T15:40:25.710000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "for example I do not hate Reth's team idea to implement \"snap\" sync through S3 because initial sync has no real benefit from decentralisation (and honestly been thinking to switch erigon to the same model)",
        "created_at": "2025-05-02T15:40:45.064000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "decentralisation is for the most part even distribution",
        "created_at": "2025-05-02T15:40:57.548000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "geographical distribution makes up for 90% of what I would call \"deventralisation\"",
        "created_at": "2025-05-02T15:41:17.156000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "Decentralization for me is where no one party can force or block action. It's ok if it takes the unified effort of every other actor in scope to resist.  Decentralization is where all action must be multi-lateral.",
        "created_at": "2025-05-02T15:41:55.107000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "geographical distribution fixes this",
        "created_at": "2025-05-02T15:42:16.231000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "but for example, geographical distribution does not necessitates the existence of solo stakers",
        "created_at": "2025-05-02T15:42:35.342000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "solo stakers are a rounding error to that",
        "created_at": "2025-05-02T15:42:44.767000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "so the distinction is important",
        "created_at": "2025-05-02T15:42:51.049000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "also Ethereum is not designed around solo stakers but I digress",
        "created_at": "2025-05-02T15:43:58.450000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "if we can have all of this I dont mind but I seriously doubt that this can happen (I mean having all of this and sitting outside top 10 of MC)",
        "created_at": "2025-05-02T15:45:30.344000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "It is incorrect to think that Solana has more TPS only because it allows more TPS. It has a different (I would say more modern) design of the state and VM. If one takes Solana code, removes the bits that pump 1 block every 400ms, and instead makes it do 1 block every 12 seconds, and changes consensus, it would still be a very interesting chain. The most interesting feature in such mini-Solana (as I call it now) is that the history of the state (and retracing) is not required to figure out what is currently present in the state. So the history becomes.... just history, for auditing purposes and such, as it should be",
        "created_at": "2025-05-02T15:47:48.970000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Erigon would have no purpose to exist in solana :)",
        "created_at": "2025-05-02T15:48:35.634000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "No differentiating purpose, yes",
        "created_at": "2025-05-02T15:48:51.286000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "tbf, none of the client dev teams would since client diversity is not a principle they share. another principle which is divorced from market cap.",
        "created_at": "2025-05-02T15:52:04.759000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Erigon would be especially useless tho. the no1 we get run is because we have good rpc and our many \"customers\" are RPCs",
        "created_at": "2025-05-02T15:53:33.516000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "i think it does not matter. Sol is Sol. Eth is Eth",
        "created_at": "2025-05-02T15:53:49.490000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "I am not familiar at all with their principles etc., I am just talking about systems and code, on that level",
        "created_at": "2025-05-02T15:56:19.232000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "do you think principles and code/systems can be divorced?",
        "created_at": "2025-05-02T15:58:23.360000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "for the purposes of my analysis, yes, they can be. And it is often quite useful to separate them to understand things better",
        "created_at": "2025-05-02T15:59:13.008000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "code is code. ideas are ideas",
        "created_at": "2025-05-02T16:00:18.781000+00:00",
        "attachments": null
    },
    {
        "author": "alexsharp12",
        "category": "general",
        "parent": "",
        "content": "And then I would say: \"good luck not competing with Solana, because it definitely does compete with you\" 🙂",
        "created_at": "2025-05-02T16:04:25.186000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "general",
        "parent": "",
        "content": "i agree with the point, though want to point out that the value of ETH still participates in network security broadly and scales the magnitude of rewards the network can pay out, which also has impacts on geographic decentralisation and other nice things. there really is a virtuous circle between many of the cypherpunk use cases people care about (e.g., privacy, which is expensive onchain; hardness, or the ability to have trust-minimised access to your assets over long periods of time) and much more pragmatic concerns such as TPS/gas throughput or ETH/network value\n\nregardless of competition, doing our best on any of these dimensions improves the lives of our users and gives them the ability to do more things. it doesn't follow that we should blindly maximise market cap or max out TPS, it's more nuanced ofc, but we simply don't do ourselves a favour settling for a service that only works at reduced capacity and addresses a handful of users/use cases imo",
        "created_at": "2025-05-02T16:05:40.433000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If ETH is worth $0.01, and people are sending/receiving $1B per block, what attacks appear?  Assume staking is still decentralized for this exercise, because stake centralization isn't strictly correlated with ETH value and I'm curious specifically about economic security attacks.  What I can think of:\n* Stakers could sign two competing chains and eat the cost because it is so low, potentially double spending if receiver doesn't wait for finality and out of band bribery may make this net positive deal.\nAnything else?",
        "created_at": "2025-05-02T16:16:27.400000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003c@486501030046203915\u003e may know the answer to this.",
        "created_at": "2025-05-02T16:16:57.809000+00:00",
        "attachments": null
    },
    {
        "author": "glt80_79636",
        "category": "general",
        "parent": "",
        "content": "If the plan is try to max improvement while sticking to determinate principles price and MC are secondary in sense that are a reflection of these aspect and will follow if really we manage to accomplish these things (combine decentralizion with a meaningful scaling)",
        "created_at": "2025-05-02T16:29:52.720000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "It's not just Solana, fwiw, it's also HyperLiquid, the L2s etc",
        "created_at": "2025-05-02T16:34:09.233000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "(l2s in present state unless native rollup like solution)",
        "created_at": "2025-05-02T16:34:09.944000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Ethereum as the leader  is competing w every smart contract chain that attracts devs",
        "created_at": "2025-05-02T16:34:10.699000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "You cannot compete w centralization obviously",
        "created_at": "2025-05-02T16:34:52.410000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "But you cannot be 2-3 orders of magntidue away perf wise",
        "created_at": "2025-05-02T16:35:10.148000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "So that's the needle we gotta thread, how to be a fast, expressive but stable bitcoin, with a fast path on the L2 world",
        "created_at": "2025-05-02T16:35:39.607000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "can we just recognize where decentralization is actually useful in practice (ideologies aside)?",
        "created_at": "2025-05-02T16:44:15.215000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "just speaking aloud but i do not think that stuff like snap sync need to decentralised. my mind has changed quite a lot on this",
        "created_at": "2025-05-02T16:44:29.196000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "Yep good prompt",
        "created_at": "2025-05-02T16:47:20.599000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "what I am trying to say is that we need to actually stop and look at the system and actually evaluate it accordingly instead of saying that everything should decentralised (even if it is diminishing returns/or ideaology-based). I think it will be soon the right moment to explore these things because the topic is starting to be less and less taboo.",
        "created_at": "2025-05-02T16:50:08.663000+00:00",
        "attachments": null
    },
    {
        "author": "gakonst",
        "category": "general",
        "parent": "",
        "content": "No disagreement. Don't think these are zero sum with what we want, but aligned with your take on reconciliation",
        "created_at": "2025-05-02T17:25:06.418000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "I think many ecosystem observers are viewing the Fusaka breach of process to remove EOF and that it hasn't been replaced by anything else as a  `bad process, bad outcome` scenario. I understand the Reth/Paradigm position is that any delay of PeerDAS for EOF would be unacceptable. However, wasn't the plan always to run separate EOF devnets and then only merge with PeerDAS if it would not delay PeerDAS significantly?",
        "created_at": "2025-05-02T17:28:30.092000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "scaling EIPs will be a good replacement",
        "created_at": "2025-05-02T17:29:33.076000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "150m gas target is an insane UX and scaling upgrade",
        "created_at": "2025-05-02T17:29:45.518000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "the worry is not EOF's replacement. there are many cool things in ETH",
        "created_at": "2025-05-02T17:29:59.114000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "(not making promises on it yet tho :D - not even part of the EF myself)",
        "created_at": "2025-05-02T17:30:24.159000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "general",
        "parent": "",
        "content": "an incomplete list of problems that appear with lower ETH price:\n- becomes easier for a single entity to acquire a large portion of the ETH supply\n- less ability to punish misbehaving validators\n- more dependence on centralized fiat currency, both onchain and offchain\n- less support for validators to remain independent and invest in network+physical security\n- less ability for the EF and other ETH holders to fund devs/researchers/ops/publicgoods and buy irl resources to support the network\n\nincreasing ethereum's scaling and increasing the price of ETH both increase ethereum's power to project its values onto the world\n\nbuilding a network that merely follows every cypherpunk principle will not make the world a better place if barely anyone uses it. additional ingredients are needed \n\nmore scaling = more ppl can use ethereum. more ETH price = more ability to secure a large portion of the world's financial system. these together = more power for ethereum to project its values onto the world. if you truly care about building The Future of Finance then it doesn't make sense to be ok with hobbling ethereum's power by ignoring these important ingredients",
        "created_at": "2025-05-02T18:58:19.427000+00:00",
        "attachments": null
    },
    {
        "author": "wjmelements",
        "category": "general",
        "parent": "",
        "content": "EIP-1559 leads validators to want lower gas limits because higher gas prices reduce net inflation.",
        "created_at": "2025-05-02T19:00:49.466000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "higher gaslimits (if used/demand) also reduce net inflation",
        "created_at": "2025-05-02T19:03:44.495000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "general",
        "parent": "",
        "content": "this is just one effect of many. there are many other first order and second order effects that push in the other direction\n\ne.g. the ultrasound threshold drops by 10x from 20gwei to 2gwei if the gas limit 10x's",
        "created_at": "2025-05-02T19:04:36.963000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I don't think any of these are attacks on the system's liveness, censorship resistance, or other critical properties.  I'm looking for actual attacks against Ethereum's core features that come about if ETH price is low but stakers are decentralized.",
        "created_at": "2025-05-02T19:11:25.022000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "general",
        "parent": "",
        "content": "1) plenty of the things I listed are attacks 2) the premise of your question is faulty because decentralization itself becomes fragile when ETH becomes worthless",
        "created_at": "2025-05-02T19:13:19.326000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "Is the economic security issue; if price is $0.01 then someone can buy a large amount of supply and centralize the stake; slashing isn't as effective as a \"good behavior\" enforcer as there is low economic cost to being slashed etc",
        "created_at": "2025-05-02T19:14:14.579000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "My premise is that staking is decentralized and price is low.  I am curious about that set of attacks because stake centralization is not directly correlated with price (can be centralized and high price) so I want to know what exactly is the vulnerability caused explicitly by low price, not things that are hypothetical second order effects that may or may not be protected by aa high ETH price.",
        "created_at": "2025-05-02T19:16:56.968000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Also low ETH price means essentially that Eth is worthless. Tbf I do not want to spend my life building something worthless",
        "created_at": "2025-05-02T19:18:21.343000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I don't think anyone wants",
        "created_at": "2025-05-02T19:18:53.631000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "ETH being worth little does not mean the Ethereum blockchain is worth little.  A global censorship resistant database is incredibly powerful.  Can put other assets on it that have value for example.",
        "created_at": "2025-05-02T19:19:07.786000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "ETH being worth little does indeed mean that it is not even worth attacking it",
        "created_at": "2025-05-02T19:19:45.741000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Like",
        "created_at": "2025-05-02T19:19:47.037000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Idk",
        "created_at": "2025-05-02T19:19:48.216000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I have been noodling on how to build a censorship resistant global database that doesn't have any native currency for a couple years, I definitely want it.  I haven't been able to solve it though.",
        "created_at": "2025-05-02T19:20:01.834000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "When that happens, please let me know so I can move to greener pastures",
        "created_at": "2025-05-02T19:20:06.576000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "PoS has some relation to price in its security model; though you are taking an extreme low price",
        "created_at": "2025-05-02T19:21:18.653000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "\u003c@301186049323958275\u003e I think the premise that the validator set is decentralized is not compatible with ETH being worthless, therefore I believe your starting point is flawed. ETH being worthless lends itself for trivial concentration of the stake and this in itself leads to cheap double finalization attacks.",
        "created_at": "2025-05-02T19:21:49.213000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This is mat I have heard, but the only thing I can come up with that is actually correlated is double spends before finality may become profitable even if you get slashed in the process.  If we achieve single slot finality, that goes away and I am curious if any other attacks remain.",
        "created_at": "2025-05-02T19:22:25.890000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "\u003c@301186049323958275\u003e you are describing ZEC",
        "created_at": "2025-05-02T19:23:40.569000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The answer may be that double spends before finality are the only attack that opens up in my described scenario.  Whether high ETH price reduces risk of centralization or not, and by how much, is a worthwhile but separate question.",
        "created_at": "2025-05-02T19:23:43.917000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "If its cheap enough then its the attacker who is finalizing the chain",
        "created_at": "2025-05-02T19:23:50.262000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If stakers are decentralized and ETH price is low, then there are no attacks I know of against finality.  All an attacker can do is profitably double attest I think.",
        "created_at": "2025-05-02T19:24:45.291000+00:00",
        "attachments": null
    },
    {
        "author": "wjmelements",
        "category": "general",
        "parent": "",
        "content": "While you can squeeze usage out in the long-term, short-term gas demand (when I monitored it) is fairly inelastic. 10x the gas limit would send the base fee to zero.",
        "created_at": "2025-05-02T19:24:45.736000+00:00",
        "attachments": null
    },
    {
        "author": "wjmelements",
        "category": "general",
        "parent": "",
        "content": "So even if Ethereum can process more transactions (and it definitely can today), that doesn't mean the validators will raise the gas limit.",
        "created_at": "2025-05-02T19:25:35.084000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "if price is as low as you are suggesting; there is nothing keeping the stakers decentralized; because it means there is plenty of supply to buy at a cheap price to use to centralize the stake",
        "created_at": "2025-05-02T19:26:13.541000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "This is not true either: any entity with enough stake can censor arbitrarily. So worthless ETH leads to Ethereum losing its byzantine tolerance and its censor resistance",
        "created_at": "2025-05-02T19:26:20.040000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Again, my attack scenario is explicitly decentralized stake but low ETH price.  In that scenario I don't believe you can break censorship resistance compared to same but high ETH price.",
        "created_at": "2025-05-02T19:27:27.349000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "but what keeps the stake decentralized in you scenario?",
        "created_at": "2025-05-02T19:28:16.307000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I understand that centralized stake is a problem with multiple attack attack vectors.  I want to know if there are any attacks that only require ETH price to be low, if stake is decentralized.",
        "created_at": "2025-05-02T19:28:28.429000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "But then you are implying anyone with money can centralize the stake",
        "created_at": "2025-05-02T19:28:48.226000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "the attack is to centralize the stake with the low price (buying a high % of supply with low overall cost)",
        "created_at": "2025-05-02T19:29:06.449000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Doesn't matter, it is just a hard coded premise that I'm using to understand the attack surface of Ethereum.",
        "created_at": "2025-05-02T19:29:14.701000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I don’t think it’s a reasonable premise. It’s akin to saying that if we could trust a third party when we would have less attack surface.",
        "created_at": "2025-05-02T19:29:51.869000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I'm not sure how else to make it clear that I explicitly want to know only about attacks that open up with very low ETH price and decentralized stake.  It doesn't matter how the situation is achieved, and the answer may be that there are none.",
        "created_at": "2025-05-02T19:30:01.998000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "No attacks are possible. Why? Because if low value secure the chain. Assets will flee",
        "created_at": "2025-05-02T19:30:56.704000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "If they did not fleed before that is",
        "created_at": "2025-05-02T19:31:06.662000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Worthless chain = no consequences",
        "created_at": "2025-05-02T19:31:29.154000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "it isn't a stable or maintainable state; there isn't equilibrium in your scenario",
        "created_at": "2025-05-02T19:32:13.093000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I think there's no attacks on L1 under these premises. Rollup bridges may be a different form. But any way. From A and not A I can prove B for any assertion B. Your starting premise is false",
        "created_at": "2025-05-02T19:32:28.921000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "You don't think the attack I described above is viable?",
        "created_at": "2025-05-02T19:32:57.315000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I think it is essentially in a vacuum",
        "created_at": "2025-05-02T19:33:11.057000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "Such scenario cannot happen irl",
        "created_at": "2025-05-02T19:33:17.146000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "Note Eth doesn't need infinite price to maintain security; but it needs some value in the PoS security; or you literally have nothing \"at stake\"",
        "created_at": "2025-05-02T19:33:30.520000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "*As a function of TVS",
        "created_at": "2025-05-02T19:33:41.637000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "general",
        "parent": "",
        "content": "would you mind starting a thread for this hypothetical? it's pretty far off topic and at this point everyone is just talking in circles",
        "created_at": "2025-05-02T19:37:27.216000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think it is important for framing discussions.  Many people say ETH price must be high for Ethereum to be secure, but the more correct statement is that stake must not be consolidoted for Ethereum to be secure.  I believe we have been seeing stake consolidate over time, and Bitcoin hashpower is almost completely consolidated at this point.  Saying they are secure because they have high market cap is wrong in some scenarios (consolidated stake/hash power) and leads people to an incorrect sense of security.\n\nAlso, recognizing what your actual requirements are rather than proxy requirements is the first step to looking for alternative solutions.  As long as the solution to securing Ethereum is \"price must be high\" we won't look for other ways to prevent stakers consolidation.\n\nI'm not saying I have solutions to these problems, but anytime you do mechanism design or attack design the first step is to understand the *real* constraints on the system, not the second order constraints.",
        "created_at": "2025-05-02T19:39:41.192000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "What are the risks: ETH=$0.01, decentralized stake.",
        "created_at": "2025-05-02T19:41:18.903000+00:00",
        "attachments": null
    }
]