[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE in 20m**\nAgenda: https://github.com/ethereum/pm/issues/1306\nStream: https://youtube.com/live/tlezpGztpi8?feature=share\nZoom: https://us06web.zoom.us/j/86939519578?pwd=5U3qfDob0dwgOfXgcApqsZOKvUC5Qa.1",
        "created_at": "2025-02-27T13:41:18.328000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "\u003c@552133098075193354\u003e is it worth to post in the same doc the exact epoch at which we hope to coordinate the slashing db removal ? also, worth doing it during the last slot of the previous epoch",
        "created_at": "2025-02-27T15:36:50.461000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "So that we don't do this interactively during the call",
        "created_at": "2025-02-27T15:37:02.252000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "ForkID Update for Determinstic Generation and Evaluation TG group - https://t.me/+d8rLI1WcaY41MmY5 - for those interested or who have input.",
        "created_at": "2025-02-27T15:37:33.657000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**Minimal ACDE recap (longer one to come in the next couple hours)**\n\n1. **Holesky:** we are going to try and get an epoch finalized tomorrow by having validators disable slashing protection in a coordinated way. \n\nTo do this:\n - CL teams: open a PR here with their instructions for disabling slashing protection: https://github.com/ethereum/pm/blob/master/Pectra/holesky-postmortem.md#holesky-coordinated-slashings\n- Holesky node operators: get back online and be ready to disable slashing protection on **Feb 28, at 15:00 UTC**. We'll have a live call to coordinate. More info 🔜 \n\n2. **Sepolia:** fork time unchanged, but Besu, Geth, Nethermind and Lodestar have new releases out. I will update the blog post soon with those. \u003c@\u0026688090867927482525\u003e \u003c@\u0026836981603216654336\u003e \u003c@\u0026652918665943056397\u003e please post your Sepolia configs in a thread response to this post so people can verify the address manually. \n\n3. **CL root cause fixes:** CLs to look into implementing the ability for nodes to sync from a user-defined checkpoint (rather than the last finalized block). Conversation to continue on ACDC next week. \n\n4. **EL root cause fixes:** ELs to look into updating the Fork ID to incorporate fork-specific configs (see \u003c#1344794120731758654\u003e)  as well as standardizing config files across clients to simplify testing.",
        "created_at": "2025-02-27T15:43:41.974000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Can \u003c@\u0026595683849225240704\u003e  \u003c@\u0026595681804422479873\u003e \u003c@\u0026898338229407870986\u003e \u003c@\u0026595683609080365088\u003e  please confirm that the instructions to disable slashing protection in the doc below are correct?\n\nhttps://hackmd.io/ow8LvQJvQPy_RyiE5-mILg?view#Disabling-Slashing-Protection",
        "created_at": "2025-02-27T17:19:57.875000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "sort of, right idea:\n- the exact path will be dependent on individual configurations. that's a reasonable default though\n- if it closes successfully and cleans up its databases, yeah, it's that one file. if it doesn't, there's also `slashing_protection.sqlite3-wal` and `slashing_protection.sqlite3-shm`, i.e. sqlite WAL files",
        "created_at": "2025-02-27T17:23:14.688000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Can you add clear(er) instructions here then? \n\nhttps://github.com/ethereum/pm/blob/master/Pectra/holesky-postmortem.md#holesky-coordinated-slashings",
        "created_at": "2025-02-27T17:24:09.447000+00:00",
        "attachments": null
    },
    {
        "author": "pawandhananjay",
        "category": "general",
        "parent": "",
        "content": "looks right for lighthouse",
        "created_at": "2025-02-27T17:29:45.745000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "general",
        "parent": "",
        "content": "looks good for prysm with one minor comment",
        "created_at": "2025-02-27T17:34:36.676000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "It is a bit misleading though, I can see operators wiping their BN db",
        "created_at": "2025-02-27T18:03:22.242000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "also, for clients whose dopellganger protection actually waits 2 epochs at start, it is important to remove this. And also Jim mentioned a middleware that protects from slashings, it should be mentioned in this doc. Additionally, clients that have implemented flags to protect from slashings to other validators and stop serving duties, this should be disabled as well",
        "created_at": "2025-02-27T18:04:37.990000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "we'll need a service stop before removing slashing protection and a start afterwards for teku",
        "created_at": "2025-02-27T20:51:46.522000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "Basically for teku\n - make sure you're not using dopelganger protection feature (if you're using `--doppelganger-detection-enabled` remove that)\n - stop teku\n - remove as you've said, the contents of the slashprotection folder\n - start teku",
        "created_at": "2025-02-27T20:55:47.041000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "https://github.com/ethereum/pm/pull/1340",
        "created_at": "2025-02-27T21:10:05.581000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Note: we're moving the EL config issue to a discord channel instead of TG group, see \u003c#1344794120731758654\u003e \n\nAlso, it's unlikely I'll get a full ACDE recap up today, so if the updates above aren't sufficient, please rely on the livestream 🙏",
        "created_at": "2025-02-27T22:12:53.685000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "general",
        "parent": "",
        "content": "Hey, I know I am jumping ahead but I would like to add something to what I said at ACDC, which was that saving Holesky with mass slashings won't be applicable to Mainnet. I still stand by this because I can't imagine that everyone will just allow themselves to be slashed, but what can potentially happen in such a case? Either (1) the majority will be on a \"bugged\" chain, that chain will finalize and become the de facto canonical chain, or (2) the chain will collapse and will need a social intervention. Even if (1) happens there is a possibility that the bug will cause further technical/security consequences and will require a social intervention anyhow. Another point is that no matter how many devnets we spin up, each with a different failure scenario, there is always a non-zero possibility that something that we are not prepared for will fail on Mainnet.\n\nAll that leads me to believing we should have a nuclear option, which is a social intervention process. Now I have no idea how would the ideal process look like, but what came to my mind today is the following. Each fork has two steps: a justified step and a finalized step. The fork epoch that we currently use marks the justified step. From that point on we wait 24 hours and if the chain is stable (or stable enough) we mark the fork as finalized and continue as usual. However if we face an issue such as the current one, we roll back the last 24 hours as if the fork never happened and reschedule the fork to a later date. I expect 99.99% of critical errors will happen at the first few epochs of a fork, so waiting 24 hours should be more than enough. Of course there is no math behind this number, it just feels right to me (similarly how we wait 24 hours now before applying slashings). Since fork times are declared way in advance, users can prepare mentally for such a scenario.\n\nDo I like having this nuclear option? No. But I prefer it over a massive panic both here and on the user side.",
        "created_at": "2025-02-27T23:35:03.059000+00:00",
        "attachments": null
    }
]