[
    {
        "author": "ben_a_adams",
        "category": "general",
        "parent": "",
        "content": "Flashbots perspective on Glamasterdam  https://collective.flashbots.net/t/an-mev-perspective-on-glamsterdam/5116",
        "created_at": "2025-07-23T15:01:09.335000+00:00",
        "attachments": null
    },
    {
        "author": "christine_dkim",
        "category": "general",
        "parent": "",
        "content": "Hey all, I hosted a community call on Glamsterdam earlier today and wanted to share a quick summary on what was discussed and follow-ups: \n- Fiddy from Lido expressed support for some kind of slot pipeline restructuring in Glamsterdam to pave the way for slot shortening in future upgrades. He noted that while he is generally supportive of ePBS for the restructuring, there's still much about the specifications that don't seem finalized, so he stressed the need for more clarity on the latest design of ePBS. \n- Jerome from EthCC + home staker expressed support for 6 second block times as a way to improve UX and shared his support for how the EF and devs are doing more for this fork to get feedback from the community. \n- Both had really good things to say about the Forkcast tool and how that's a gamechanger for aggregating community views.\n- I'm hosting a follow-up community call after next Thursday's ACDE to discuss any decisions coming out of that call related to Glamsterdam. If devs want to join in for this one and have extended discussion on Glamsterdam with other community members, please do! https://x.com/i/spaces/1YqxooDERoExv\n- Full recording of today's call: https://x.com/christine_dkim/status/1948020381031223492",
        "created_at": "2025-07-23T16:46:03.065000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "Listening back to ACDE, it sounded like we're saying release, 30 days before first testnet for the audit etc, but that now implies we're looking at nearly 3 months of time between finishing dev and getting to mainnet...\nIt worries me more than a little when we're looking at that much time for testnet deployment, especially given the drive for 6 month release cycles.\nI guess explainer, \nrelease + 30 days -\u003e first testing\n2 weeks -\u003e second testnet\n30 days -\u003e mainnet\nadds to 2.5 months, so with that amount of time, i rounded up.\nIs that understanding correct?",
        "created_at": "2025-07-23T21:30:23.427000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "i think we should do something more like this: https://github.com/ethereum/pm/issues/1610#issuecomment-3075167383\n\nwhich takes some time from the first segment you have to put into hardening",
        "created_at": "2025-07-23T21:49:49.110000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "i was just writing my understanding from what was said on ACDE, im definitely not advocating for half of the 6 mths being deployment to test envs, just to be clear, that imo would be a problem... less of a problem on a 12 month cycle but thats a lot of overhead for a 6 mth cycle...",
        "created_at": "2025-07-23T21:52:07.879000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "your timeline you had there were more like my previous understanding before acde",
        "created_at": "2025-07-23T21:53:31.819000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "i do think the timing we had written out in that coordination doc is a bit tight with a strict 6 month cadence",
        "created_at": "2025-07-23T21:57:19.926000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "**ACDC #161 \u003ct:1753365600:R\u003e**\nAgenda: https://github.com/ethereum/pm/issues/1614\nStream: https://www.youtube.com/watch?v=U_oFzvFrqwY\nZoom: https://ethereumfoundation.zoom.us/j/85969202880?pwd=YUayBl1jRhwRFCHXwwajzKLkKX0afM.1",
        "created_at": "2025-07-23T23:43:59.181000+00:00",
        "attachments": null
    }
]