[
    {
        "author": "jimmygchen",
        "category": "general",
        "parent": "",
        "content": "Thanks for the recap \u0026 summaries! \nIt would be useful to include the chat in the recp/summary too (if it's not too much work or can be outsourced to AI) - the raw text is kind of hard to read afterwards. There were some good discussion there on 7907 and getBlobsV3, and i'm not sure if they were captured on the recording and the notes.",
        "created_at": "2025-07-18T01:12:33.961000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "There's a bot that adds the chat transcript on EthMag shortly after the call now 🙂\n\nsee this reply: https://ethereum-magicians.org/t/allcoredevs-execution-acde-216-july-17-2025/24770/5?u=timbeiko",
        "created_at": "2025-07-18T04:10:05.875000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "general",
        "parent": "",
        "content": "ah yeah I was reading the txt file from the \"Download Chat\" link (not the transcript of the call), but the raw form is quite hard to read, would be nice to have it summarised. I could just give that to ChatGPT, but others may find it useful too?",
        "created_at": "2025-07-18T05:15:50.448000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "general",
        "parent": "",
        "content": "I guess most of the decisions are usually mentioned verbally on the call, so probably not super important",
        "created_at": "2025-07-18T05:20:48.191000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "general",
        "parent": "",
        "content": "I see some _soft_ consensus in the chat to remove `getBlobsV3` from Fusaka scope to reduce distractions (also my preference) but wasn't recorded",
        "created_at": "2025-07-18T05:25:13.070000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "I think the final decision will be made on ACDT next Monday",
        "created_at": "2025-07-18T10:31:38.857000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "^ cc \u003c@795439202732867594\u003e",
        "created_at": "2025-07-18T10:49:31.012000+00:00",
        "attachments": null
    },
    {
        "author": "raulvk",
        "category": "general",
        "parent": "",
        "content": "i don't see anything in the meeting notes. for CLs, this PR means doing nothing (*), so it shouldn't distract. am i missing something? \n(\\*) assuming they haven't implemented v2 partial, and remained on v2 all-or-nothing. CLs don't need to consume v3 today.",
        "created_at": "2025-07-18T10:59:44.550000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "general",
        "parent": "",
        "content": "It was indeed discussed in the chat but not in the call, and I think Jimmy is correct in his reading of the chat's \"mood\" around this. The claim is essentially that it can't be used after Fusaka without having been tested and so CL clients will have to implement it anyway. What there is for sure consensus about is that a final decision has to be made so we can stop revisiting it every ACDT.",
        "created_at": "2025-07-18T11:08:36.897000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "What are thoughts on prioritizing FOCiL for Glamsterdam concurrently with ePBS? I think we have a potential staking centralization crisis on the horizon between all these US ethereum treasury companies (SBET, BMNR, etc) buying massive amounts of ETH and staking it.  Yesterday,  Blackrock also filed to convert ETHA to a staking ETF and the others will soon follow. They will all use overly compliant US based staking providers or in-house US based teams where censorship of OFAC \u0026 possibly other \"high risk\" transactions will likely be the norm. It seems important to get FOCiL in before these staking etfs approved in (likely) Q1 2026.",
        "created_at": "2025-07-18T12:49:02.521000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "general",
        "parent": "",
        "content": "FOCIL would be a massive value add. if it's possible to include in glamsterdam we should do it. some relevant factors at play:\n- **ambition**: we should be as ambitious and aggressive as possible. obviously not at the cost of safety. but maybe at the cost of everything else. ethereum deserves it\n- **scheduling**: there is a large chance that slot time reductions will be the focus of the H hardfork after glamsterdam. it will be harder to include FOCIL alongside slot time reductions. so FOCIL might need to be pushed back to the I fork or even later if not included in glamsterdam. this might be 2028 or beyond\n- **competition**: there is an interesting argument that ethereum currently has less CR than solana due to both 1) solana having 30x faster blocks and 2) solana having fewer censoring validators. solana would also like to implement multiple concurrent proposers over the next year, which will further reduce inclusion time of censored txs. I dont want to start a debate here, obviously there are lots of counterarguments, but I think it would be very valuable for ethereum to have indisputable best-in-class CR. FOCIL would accomplish that\n- **scaling**: FOCIL is also a scaling EIP. it allows for eventually bumping up the hardware req's on nodes without sacrificing the CR. \"scaling ethereum in a censorship resistant manner\" is synergistic with the scaling headliner theme, and it is a very ethereum-style twist on how blockchains should scale\n- **centralization**: the concerns raised by \u003c@798785877815459891\u003e about institutional capture are very real. if we wait on FOCIL there might be legal pressures that prevent us from pursuing it in the future. I'm not sure FOCIL needs to get included exactly before Q1 2026 to be valuable. but for example it seems valuable for FOCIL to be implemented while the USA government is still in crypto friendly mode, which could end in 2028 with a new president, or even sooner if there is some sort of high profile crypto incident",
        "created_at": "2025-07-18T13:50:05.373000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "general",
        "parent": "",
        "content": "Staking centralization vs FOCIL",
        "created_at": "2025-07-18T15:29:18.945000+00:00",
        "attachments": null
    }
]