[
    {
        "author": "barnabasbusa",
        "category": "general",
        "parent": "",
        "content": "Without the EL bug we would have never discovered the CL bug (thats currently on with LH). \n\nReproducing the LH bug on a local test would have been nearly impossible. LH unable to find suitable peers due to some peering constraint only came out on a large devnet. \n\nI think the findings of devnet 4 were super valuable. \n\nI still think the EL bug could/should have been caught earlier, but its also a pretty recent change in the EL clients, so it makes sense that it wasn't caught earlier.",
        "created_at": "2025-08-14T09:37:32.763000+00:00",
        "attachments": null
    },
    {
        "author": "cskiraly",
        "category": "general",
        "parent": "",
        "content": "I think if there is a long debate about the correct interpretation of an EIP, it is wrong to see it as a client bug (independent of whether it is EL or CL or which clients).\n\nWhat we were catching here is an ambiguity in an EIP. Do we have better tools to catch these? For parts of the EIPs yes, but not for all. Partly our test is to let many teams interpret and implement them, and see if they got to the same interpretation.\nThe real question to me is whether we can implement changes in the process that make it easier to find these ambiguities in the interpretations of EIPs.",
        "created_at": "2025-08-14T09:50:01.776000+00:00",
        "attachments": null
    },
    {
        "author": "abcoathup",
        "category": "general",
        "parent": "",
        "content": "We should do a last call for Glamsterdam non headliner EIPs. (August 21 was proposed cutoff). Champions should share presentations for async review. \nWe already have at least 11 PFId. If they each had 5 minutes that is a lot of ACD time. https://eips.ethereum.org/EIPS/eip-7773#proposed-for-inclusion",
        "created_at": "2025-08-14T11:10:24.192000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I think Aug 21st is too early of a cutoff (I was optimistic!), but we can discuss on the call 🙂 I'd propose having the cutoff for non-headliner EIPs be tied to Fusaka releases, either testnets or mainnet.",
        "created_at": "2025-08-14T13:29:22.729000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Call in 15m!\n\nhttps://ethereumfoundation.zoom.us/j/88269836469?pwd=haUFXY28SNvw9pJ5CamxgMlMlghHac.1",
        "created_at": "2025-08-14T13:44:43.027000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "**ACDE Recap**\n\n**Fusaka**\n-  The issues that came up in`devnet-4` warrant a new devnet. We'll have `devnet-5` to test the fixes (no other spec changes). \n- On Monday's ACDT, we'll determine when to launch `devnet-5` , ideally before ACDC next week\n- We didn't set dates yet, will wait until devnets \u0026 testing stabilizes before doing that \n\n**Glamsterdam**\n- EPBS \u0026 BALs are confirmed as headliners 🎉 \n- FOCIL still CFI'd, will decide on inclusion once EPBS \u0026 BALs are live on devnets\n- Deadline for other EIP PFI proposals is when we put out Fusaka mainnet releases (moved from Aug 21st)\n- We discussed many spec changes for BALs, \u003c@1126229231572094976\u003e update the EIP based on the conversation and set up a BAL breakout room to discuss further once we have an updated spec\n\nWe didn't have much time to discuss the other topics, but two EIPs were shared on the agenda, and we briefly continued the `safe` head discussion by \u003c@425572898787426305\u003e",
        "created_at": "2025-08-14T16:17:13.136000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Longer 🤖 -gen summary on EthMag: https://ethereum-magicians.org/t/all-core-devs-execution-acde-218-august-14-2025/24979/4?u=timbeiko",
        "created_at": "2025-08-14T16:41:18.536000+00:00",
        "attachments": null
    }
]