[
    {
        "author": "joshd4078",
        "category": "general",
        "parent": "",
        "content": "\u003c@552133098075193354\u003e do you have a Zoom link?",
        "created_at": "2025-06-05T13:54:31.258000+00:00",
        "attachments": null
    },
    {
        "author": "niard.eth",
        "category": "general",
        "parent": "",
        "content": "https://ethereumfoundation.zoom.us/j/88269836469?pwd=haUFXY28SNvw9pJ5CamxgMlMlghHac.1",
        "created_at": "2025-06-05T13:58:19.397000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "TY! See you on the call 🙂",
        "created_at": "2025-06-05T13:59:55.602000+00:00",
        "attachments": null
    },
    {
        "author": "sorpaas",
        "category": "general",
        "parent": "",
        "content": "Shouldn't we have a headliner proposal for EOF? Is anyone planning to write one? If not I'll co-champion it because I'll also need it for EVM64.",
        "created_at": "2025-06-05T15:00:36.896000+00:00",
        "attachments": null
    },
    {
        "author": "sorpaas",
        "category": "general",
        "parent": "",
        "content": "What's with all the popcorns? Looks like I certainly missed some pretty hard Ethereum politics over the years. 😱 \nI'm not the original author of EOF but I generally think it can be really useful with just one modification: https://github.com/ethereum/EIPs/pull/9834\n\nThis way we can have \"per code-section\" based execution rules. EVM256 is good at system interaction and accounts, RISCV or EVM64 is better at computational speed. Then their advantages can be combined in the same contract. Type 1 for EVM256 as it is now. Type 2 for EVM64 and type 3 for RISCV without system interactions (pure computational code sections). EVM64/RISCV code interacts with EVM256 via memory / inputoutput-stack-parameters. As someone who writes EVM implementations this also makes optimizations easy to write -- we only JIT the EVM64/RISCV parts (being purely computational they are much easier to write and optimize than the full EVM256).\n\nBesides EVM64, I'm actually also working on a RISCV proposal that can is also based on this (EOF+EIP-9834), which can be deployed immediately without all the wait of extra RISCV format or anything else. (We just need to convert stack parameters to register-based and back, but this can be done in EOF.)",
        "created_at": "2025-06-05T17:54:57.661000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Well, the last time it came up was as the centrepiece of a solid week of drama around going from SFI'd to DFI'd. So, round 2?",
        "created_at": "2025-06-05T17:57:26.835000+00:00",
        "attachments": null
    },
    {
        "author": "sorpaas",
        "category": "general",
        "parent": "",
        "content": "I would prefer... if we discuss things in their technical merits. Maybe if EOF is too much politics then we call it something else, like EthereumELF or something, but ultimately we still need exact things like this.",
        "created_at": "2025-06-05T17:58:53.396000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Yes, that's how people framed it at the time too, discussing technical merits, they just disagreed on them. To be clear, I personally (as then) don't have a stake in it, but I'd echo the 🍿 sentiment",
        "created_at": "2025-06-05T18:00:34.833000+00:00",
        "attachments": null
    },
    {
        "author": "sorpaas",
        "category": "general",
        "parent": "",
        "content": "I was the original author of account versioning (EIP-1702), EOF is sort of a successor on the path of account versioning (and much improved). Back then EIP-1702 was also full of drama (regarding backward compatibility). It doesn't mean we don't need it.\n\nPolitics are temporary. Tech stays forever.",
        "created_at": "2025-06-05T18:01:40.056000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Anyway, I'm certainly not going to discourage EOF as a headliner proposal, it would be, minimally, interesting to see play out.",
        "created_at": "2025-06-05T18:02:59.808000+00:00",
        "attachments": null
    },
    {
        "author": "sorpaas",
        "category": "general",
        "parent": "",
        "content": "I think that's the right mindset -- there's no need to be too emotionally involved. We can always entertain ourselves again for another week with EOF being DFI'd. 🙂\n(But seriously, what's the alternative? Do we want faster EVM and/or RISCV or not?)",
        "created_at": "2025-06-05T18:06:57.501000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "RISC-V was definitely proposed as one alternative, yes",
        "created_at": "2025-06-05T18:09:53.240000+00:00",
        "attachments": null
    },
    {
        "author": "sorpaas",
        "category": "general",
        "parent": "",
        "content": "What I meant is that it's better to build RISC-V on top of EOF. (Otherwise what are you going to use? ELF?)\nIf you check EIP-9834 you'll see what I mean -- it allows us to combine RISC-V/EVM64 and regular EVM in the same contract. You use regular EVM for \"normal functionality\", and when you need computationally heavy stuff, then switch to RISC-V/EVM64.\n\nThis solves a lot of problems of the alternative RISC-V proposals -- we do incremental upgrades and don't throw the whole ecosystem out. The majority of the contract is still written in Solidity, then the computationally heavy part can be a dialect or another language, as an \"extension\". I've seen so many blockchains trying to adopt the \"most shining tech\" but ended up pivoting back to \"Ethereum-compatibility\" or \"Solidity-compatibility\". If we don't do RISC-V in an \"incremental\" way it'll be the same fate -- it'll be really fast, but no one will use it.",
        "created_at": "2025-06-05T18:20:14.031000+00:00",
        "attachments": null
    },
    {
        "author": "sorpaas",
        "category": "general",
        "parent": "",
        "content": "Here you go 🍿 https://ethereum-magicians.org/t/glamsterdam-headliner-proposal-eof/24464\nAnyway because I wrote it I'll fulfill my duty to seriously champion for it.",
        "created_at": "2025-06-05T18:49:26.218000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "general",
        "parent": "",
        "content": "LFG \u003c@242032644232183808\u003e",
        "created_at": "2025-06-05T19:04:12.069000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "ACDE summary up on EthMagicians 🧙 \n\nhttps://ethereum-magicians.org/t/all-core-devs-execution-acde-213-june-5-2025/24414/5",
        "created_at": "2025-06-05T19:14:11.749000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "Screenshot_2025-06-05_at_12.13.46_PM.png",
                "content": "558e548faedd30a1b6076d124543ed0bf441db988d76b8000954dd44714b0581"
            }
        ]
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "PR to the specs: https://github.com/ethereum/EIPs/pull/9862\n\nI left 7212 as CFI'd for now as I can't mention 7951 until it's merged. \u003c@550420431744794624\u003e can you open a PR to swap them out when 7951 is ready 🙂 ?",
        "created_at": "2025-06-05T19:16:51.242000+00:00",
        "attachments": null
    },
    {
        "author": "carlbeek",
        "category": "general",
        "parent": "",
        "content": "Yes, of course!",
        "created_at": "2025-06-05T20:06:10.304000+00:00",
        "attachments": null
    }
]