[
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "right, i updated the summary to make it clear this was not a mainnet date\n\ni agree mainnet that early in the year (esp. with the BPO fork we will need to ship) is not realistic\n\nmoreover, i think we are early enough in the process that any speculation on dates for glamsterdam right now are just that, and only serve to help coordinate the work of the next fork across the core dev community\n\ni know we are all under a lot of pressure to ship fusaka this year and it is definitely not my intent to push past a breaking point with undue urgency around glamsterdam",
        "created_at": "2025-08-13T00:13:32.560000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "i will reiterate this point -- agreeing to rough timing does help everyone plan against each other and lets teams make judicious allocation decisions so that we can move faster, rather than slower\n\nthat being said, the \"rough timing\" we do converge upon should certainly be realistic (and hopefully ambitious 🙂 ). moving to a 6 mo hard fork cadence is certainly ambitious and something like June '26 would roughly be 6mos after fusaka this year",
        "created_at": "2025-08-13T00:19:53.414000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Amen",
        "created_at": "2025-08-13T00:26:39.025000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Agenda for ACDE tomorrow: https://github.com/ethereum/pm/issues/1652\n\nA few notes:\n\n- Given the devnet-4 issues, I think it's worth having a longer conversation about how we can better improve our testing process to avoid this in the future. We should probably time box it and extend on ACDT if needed, but it feels important to directly address\n- Relatedly, \u003c@539495253418180618\u003e shared some tentative dates for Fusaska deployment. It would be ideal if all teams could come prepared with their assessment of how realistic these are, esp. given the latest issues. \n- For Glamsterdam, we planned to finalize the headliner selection. One subtle concern that's come up over the past few weeks is the lack of clarity around whether headliners should be the biggest or most impactful feature in the fork. I think it's worth making sure we're aligned on this before we finalize the selection. \n- We should also discuss how we want to approach timelines for Glamsterdam once the headliners are set. It feels important to have shared expectation about how \"hard\" deadlines are, and what we are willing to do (or not do) to meet them. \n\nLastly, there were a couple non-headliner EIPs that were proposed for discussion on the agenda. I realize there's a lot going on now and was on the fence about including them vs. not. If people feel like we should push them back a call or two, LMK. It should be totally fine to say on the call that we're too busy to consider additional proposals beyond Fusaka + Glamsterdam headliners for now. \n\nHope this helps set the context for tomorrow's call!",
        "created_at": "2025-08-13T19:08:29.229000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "IMO devnets are exactly what we *want* to break, and if we don't occasionally break things we should probably get better at it... it's far cheaper to break a devnet to find an issue than a testnet (holesky for example)",
        "created_at": "2025-08-13T22:21:48.962000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "im very dubious about fixing time + scope + quality for the pure reason that we will end up having to cut scope to make a fixed time work, because we can't ship with dodgy code. this is just software theory, i've said it before - fixing all 3 is just not going to work in reality. this has been proven over many decades and we don't need to choose to be another case study on this.\nAlso if we want 6 month cycle AND a 2.5 mth window to get from test to mainnet, then we need to recognise we're not getting much done. adding things like 'a month between testnet release and first testnet' for example hurts the delivery of timelines.",
        "created_at": "2025-08-13T22:26:51.050000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "Also if we really want 6 months i've serious doubts that something like epbs+focil would work so that would be worth discussing if other ppl feel fine with the idea of delivery of something like epbs+focil even if the time baloons. most teams are yet to get into either feature so thats a little risky, esp given the 'no distractions because fusaka' idea.",
        "created_at": "2025-08-13T22:32:50.677000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Strong supporter of cutting scope to increase time predictability 😄",
        "created_at": "2025-08-13T22:51:51.826000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Yes, devnets are cheaper to break than testnets, but static tests are even cheaper to break than devnets 😃",
        "created_at": "2025-08-13T22:52:19.577000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "on the flip side if we can never break them why bother doing them... we'd save tons of time that way",
        "created_at": "2025-08-13T22:58:05.411000+00:00",
        "attachments": null
    }
]