[
    {
        "author": "abcoathup",
        "category": "general",
        "parent": "",
        "content": "Fusaka/PeerDAS: It doesn’t appear to be well known that Geth is the only client which supports conversion from blob proofs to cell proofs. \n\nThe first I heard of it was ACDE #222\n\nhttps://forkcast.org/calls/acde/222#t=887",
        "created_at": "2025-10-15T08:28:36.153000+00:00",
        "attachments": null
    },
    {
        "author": "gtrintinalia",
        "category": "general",
        "parent": "",
        "content": "Besu does support conversion as well, only for transactions sent after the fork.",
        "created_at": "2025-10-15T08:40:27.168000+00:00",
        "attachments": null
    },
    {
        "author": "abcoathup",
        "category": "general",
        "parent": "",
        "content": "Some teams got an unfortunate Sepolia upgrade surprise. \n\nI didn’t see this breaking change communicated. (Maybe I missed it).",
        "created_at": "2025-10-15T08:49:08.892000+00:00",
        "attachments": null
    },
    {
        "author": "smartprogrammer",
        "category": "general",
        "parent": "",
        "content": "nethermind supports it, but it is hidden behind a flag `--TxPool.proofsTranslationEnabled=true`",
        "created_at": "2025-10-15T08:52:32.280000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "I think getting the surprise on testnets is not the worst thing if you don't follow the core dev process closely.\nWe wish that more protocols would start testing on our devnets, so these issues can be flagged earlier, but its always a tradeoff between core dev's time and app devs time",
        "created_at": "2025-10-15T08:57:37.478000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "general",
        "parent": "",
        "content": "https://github.com/ethereum/pm/issues/1425#issuecomment-2785815081\nhttps://discord.com/channels/595666850260713488/1359248377635799230/1359444895177248818\n\nhttps://eips.ethereum.org/EIPS/eip-7594#networking\n```\nSince proof verification is much cheaper than proof computation, and the proof size is negligible compared to cell size, we instead require blob transaction senders to compute the proofs themselves and include them in the EIP-4844 transaction pool wrapper for blob transactions.\n```\n\nWe have communicated multiple times that fusaka-devnet-3 is spec ready, and any L2 was welcome to start testing on it before it would have break on sepolia. If L2s handle the testnets as \"prod\" environment, and don't wanna break then they need to start looking into a testing platform - devnets. \nYou can't have L2 saying that testnets are \"prod\" and not test their stuff anywhere. Or if they only want to test their stuff on testnets, then its not a prod platform. Its one or the other, but can't have both. \n\nHowever, I agree that we could have had a note somewhere - not hidden in the EIP/discord discussions that this will be a breaking change. Maybe we can have it on forkcast? \u003c@119818938845495298\u003e Its probably not too late still, as we haven't shipped anything to mainnet, and I'm sure there will be some L2s that will be using mainnet as their test platform 😄 \n\nPossibly also we should mention this in the ethereum blog posts going forward (or backwards) https://blog.ethereum.org/2025/09/26/fusaka-testnet-announcement, that for all L2s this is a breaking change. cc \u003c@539495253418180618\u003e. I think we can have a highlighted part on this past post, and also on the post for mainnet that will be coming out soon.",
        "created_at": "2025-10-15T09:56:12.659000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "I am working on a blog post to the ethereum blog in order to communicate this specific change again, since it doesn't seem to have reached the necessary parties.\nI do agree that we need to highlight these changes more noteably in the announcements going forward.\nAnd I also hope that L2s and other users of the baselayer will engage in the process more actively",
        "created_at": "2025-10-15T11:44:19.022000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "https://blog.ethereum.org/2025/10/15/fusaka-blob-update",
        "created_at": "2025-10-15T12:50:27.828000+00:00",
        "attachments": null
    },
    {
        "author": "wolovim",
        "category": "general",
        "parent": "",
        "content": "easy to miss any given update. ^encourage folks to email subscribe to all or specific blog post categories. also added the post to the top of the fusaka forkcast page and we'll explore stakeholder-specific pages in the future, e.g., `/fork/L2` for an aggregated view",
        "created_at": "2025-10-15T13:12:06.600000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "Screenshot_2025-10-15_at_9.08.07_AM.png",
                "content": "2f0f5729811bc42a42395038919b9393b2b01d69be28cdb878c76b6381ed519e"
            }
        ]
    },
    {
        "author": "nixo.eth",
        "category": "general",
        "parent": "",
        "content": "I think getting the surprise on testnets",
        "created_at": "2025-10-15T14:27:15.381000+00:00",
        "attachments": null
    },
    {
        "author": "koenmtb1",
        "category": "general",
        "parent": "",
        "content": "Hey all! I'm trying to post something on the Eth magicians forum around blob retreival changes we're running into at Aztec.\nTrying to make a new account but not getting the confirmation email... tried different emails and waited a few hours between requesting resends.\nWho do I reach out to about this?",
        "created_at": "2025-10-15T19:38:59.886000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "should also add something about tx gas limit cap / 7825",
        "created_at": "2025-10-15T21:17:41.857000+00:00",
        "attachments": null
    }
]