[
    {
        "author": "leeederek",
        "category": "general",
        "parent": "",
        "content": "Hello - I share the same ask and rationale as \u003c@919918363004784691\u003e on behalf of Offchain Labs for Arbitrum One and Arbitrum Nova. Upgrades on these chains are dictated through a 30d+ long governance process and so the more heads up between the announcement date AND the actual mainnet fork date, the better. Otherwise, we hold risk that some of the EL changes aren't reflected on L2s on day 1 of the mainnet fork (which is not the end of the world, but not ideal). I will +1 the comment on the ACD page as well.",
        "created_at": "2025-01-31T16:52:21.834000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Can you expand on the impact of L2s not reflecting the fork changes on day 1? My expectation (as an L2 user) is that it would be normal for the L2 to lag here. You could also argue you want to see the fork working smoothly on L1 before even opening an upgrade proposal for the L2.",
        "created_at": "2025-01-31T16:59:46.622000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "And I'm also curious if you care more about the final specs (which will ship on testnets before a mainnet slot is chosen) or the actual timing?",
        "created_at": "2025-01-31T17:00:51.752000+00:00",
        "attachments": null
    },
    {
        "author": "leeederek",
        "category": "general",
        "parent": "",
        "content": "My expectation matches yours. Our ideal target is Day 1 (this precedent was set in Dencun because blobs brought massive gas savings for L2 users), however, i don't think its the end of the world that we support fork changes at a later date. I just wanted to share this info with the group and that this concern exists for other teams re: timelines. \n\nWe care more about the actual timing of the mainnet fork to coordinate all the DAO-required actions in time (and if we're late, we're late so be it but I do want to try to be ready on Day 1 if possible).",
        "created_at": "2025-01-31T17:01:58.976000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "If it takes you guys `n` days to get ready, but an L1 mainnet fork can happen in `n-m` days where `m\u003e0`, how is that worse for you in absolute terms (not the optics of not being ready on \"day 1\")?",
        "created_at": "2025-01-31T18:16:55.048000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "The concern for me isn't having the new fork running on L2 on day 1 but ensuring the L2 works with the new L1 changes in time.  As an example the new transaction type for 7702 requires an update to the L1 derivation logic in OP Stack since those tranactions strictly speaking could contain batch data and so need to be parsed whcih means needing new code to parse the new tx type. That means all op-node instance need to be updated, but also that our fault proof implementation on chain needs to be updated in time and thus we need the changes to go through governance.\nWe have that under control but given the 7702 implementation hadn't actually merged into upstream geth (can't put 7702 tx into the mempool - there's a PR...), it's been a bit of a pain to test for us.\nThere's things we can do to improve things on our side, but the point is that L1 upgrades can and do break applications and L2s in all kinds of fun ways, so short timelines can be quite challenging.",
        "created_at": "2025-01-31T22:05:24.593000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I'd also say that this is an area where L1 should be setting an example.  If it's good for apps/L2 to have a fixed upgrade delay of 30 days then it seems like L1 should be enforcing that themselves to make sure that if users disagree with the upgrade they actually have time between the formal announcement and it activating to a) notice and b) withdraw their funds.",
        "created_at": "2025-01-31T22:06:31.534000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "general",
        "parent": "",
        "content": "I'd be interested if theres a cadence that's \"too short\" for L2 or stakeholders. Eg. if there were network upgrades in quick succession like quarterly, is that over-burdening downstream . It does seem like 1 year atm has been not ideal, but I presume there's a point at which its simply disruptive.",
        "created_at": "2025-01-31T22:06:55.138000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "I'm definitely sympathetic about the timelines L1 changes impose on L2. We will try to get the txpool changes into the release next week, but I don't know if I can promise. Ultimately we need to decide how long is acceptable between the announcement of a fork and the fork happening. I don't have strong feelings on this and happy to mostly defer to the groups who consume L1 and need time to make their changes",
        "created_at": "2025-01-31T22:31:04.499000+00:00",
        "attachments": null
    }
]