[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This sounds like a divergence from the unofficial historical strategy where all clients had fork veto power essentially.  Frustratingly, moving from an unofficial full consensus to a formalized supermajority fork system was on a road map I laid out somewhere for \"Path to Ethereum Core Dev Capture\".  😢",
        "created_at": "2025-03-31T02:01:19.278000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Formalized systems are easier to capture than abstract systems, and supermajority is easier to capture than full consensus systems, but both are eventually necessary to avoid ossification.",
        "created_at": "2025-03-31T02:02:16.586000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "To be clear and explicit, this means Lighthouse and Prysm, on the CL side, maybe Teku (but Teku might not have enough marketshare), and Geth and Nethermind on the EL side?\n\nOk. Good to know.",
        "created_at": "2025-03-31T02:05:15.598000+00:00",
        "attachments": null
    },
    {
        "author": "siladu",
        "category": "general",
        "parent": "",
        "content": "Have been using waybackmachine for reading older posts e.g. snapshot was end of Jan for https://web.archive.org/web/20250124093943/https://ethereum-magicians.org/t/eof-proposal-ban-code-introspection-of-eof-accounts/12113",
        "created_at": "2025-03-31T03:03:04.011000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I used to agree with this fairly strongly, but I think we’ve recently reached a tipping point where the downsides of informal approaches outweigh the benefits from them. My sense is many of our recent issues, from the lack of proper incident response to Holesky’s failures and now a miscommunication around setting mainnet dates, are a consequence of informal systems not working well enough. \n\nThis isn’t to say we should completely lean in the other direction, but we should be mindful of the failure modes of more formality and plan for them too.",
        "created_at": "2025-03-31T03:20:29.689000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Yes, that is exactly what I predicted.  😄  The complexity would grow and eventually necessitate formal processes to move forward, and this leads to easier/more \"capture\".",
        "created_at": "2025-03-31T03:24:19.570000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It was when I was arguing that ossification will *never* happen because bureaucracies are self sustaining and they will mutate as necessary to continue to exist and operate, avoiding ossification at all costs.",
        "created_at": "2025-03-31T03:25:09.396000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "To take this example, maybe it’s fine to make it a “full consensus”, but I don’t think this reflects the current reality. \n\nFirst, in practice delays between clients are often minimal. IIRC the largest “delay” we’ve ever seen by a team was when shipping Berlin, where Erigon was a couple weeks behind due to their mempool implementation. We put out the blog post with a “TBA” for the version number, eventually updated it, and it was fine. \n\nTo be clear, this isn’t to say Erigon did anything wrong. But to emphasize that the worst case I can remember was relatively minor and nothing went wrong by proceeding with the fork. \n\nSecond, the current informal process deals with this more gracefully, IMO, than a formal one. If we say “we don’t schedule the fork until literally every single client is 100% ready”, that opens up a clear governance attack: create a client and just refuse to be ready, stalling everyone else. \n\nThis example is obviously a strawman, but highlights that we need to draw a line somewhere. \n\nI’m very weakly opinionated about what that bar is (and, again, don’t think in practice it makes a huge difference). If we chose to do “rough consensus over the hard fork sign up sheet”, that works for me, but we should all be on the same page about what that mean, to avoid repeating our current mistakes.",
        "created_at": "2025-03-31T03:25:58.982000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Right, the complexity has grown, it does mean we need more processes, but I’m less convinced this is a clear path to capture than I used to be. \n\nI agree with you that ossification is the only way to avoid any risk of capture. \n\nIMO we should be better at delineating what parts of Ethereum should ossify vs. not. But, on the whole, Ethereum isn’t   planning to ossify in the short term.",
        "created_at": "2025-03-31T03:27:52.804000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "while continuing the \"not ossify\" (not sure what is opposite of ossification) way. Can we still try to figure out how we can minimize the risk of capture? Supermajority client voting sounds like quite suspectible for capture over long run. While you can trust the client devs now, can you trust them after X years?",
        "created_at": "2025-03-31T03:58:18.188000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Yes, 100%. \n\nTo be clear, my goal with the proposal above wasn’t to say we should absolutely move to a system where we set the fork time as soon as a supermajority is ready, but more that we should be deliberate in the criteria we choose for any formalization in the process.",
        "created_at": "2025-03-31T04:07:13.229000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "general",
        "parent": "",
        "content": "Well, there might be other concerns, such as delays in doing the fork, but the current mistakes, as far as I can tell, have exactly nothing to do with any client delaying things? So I'm not sure what repetition is intended here",
        "created_at": "2025-03-31T06:19:18.602000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "My core point is not about clients being late: it's about fixing a breakdown in process/communications/expectations. _That_ is what went wrong in Holesky incident response, and in setting a mainnet block, both because we didn't have the right inputs on the call, or a clear, shared understanding of the constraints (see Paul/Nixo's exchange earlier). \n\nMy proposal to fix this is to include \"setting the hard fork block\" as part of the async process we agreed to use in ACD last week, as we also said we'd agree to set people from each client teams to monitor the fork. \n\nMy (poorly introduced 😅) solution to prevent more miscommunication and failure modes of async processes is to explicitly define what our threshold should be for moving forward with a fork block. Perhaps \"supermajority\" is the wrong one. An alternative could be \"no strong objections by teams on the latest devnet by Date X\". Either is fine, but I want to avoid a situation where a team hasn't bothered to make a PR to the `.md` file and we're holding up the fork because of that 🙂",
        "created_at": "2025-03-31T13:29:48.869000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "Testing call starts now: https://ethereumfoundation.zoom.us/j/86466169680?pwd=x17cbD1lDCeQEWMTTOLARQhELiJV21.1",
        "created_at": "2025-03-31T13:59:44.602000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "general",
        "parent": "",
        "content": "https://ethereum-magicians.org/t/interop-testing-call-31-march-31-2025/23325",
        "created_at": "2025-03-31T16:42:59.661000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I have no formed opinion here, but a full consensus seems more prone to capture in this particular regard, since then your little new client that no one use and hasn't been tested by anyone suddenly has a veto power over forks. If I am advocating for ossification, adding a new client that is always boycotting forks would probably be a first move 😅",
        "created_at": "2025-03-31T17:55:22.381000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "housekeeping note: when an ethereum repo has no MAINTAINERS.md file, i.e. https://github.com/ethereum/execution-apis who should we harrass to approve and merge prs?",
        "created_at": "2025-03-31T19:55:42.592000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "i can likely route the request to the right place, if nothing else",
        "created_at": "2025-03-31T20:00:57.774000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e Informal processes are just captured by insiders. I think formal is much better",
        "created_at": "2025-03-31T21:08:57.970000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Another way to approach this, which may be less of a departure from our current process, is to default to always \"Propose\" a fork date on ACD{E|C} and \"Confirm\" it on the second call.  I think this would better convey that a date is tentative and avoid the \"non-confirmation\" being perceived as a delay. \n\nIt's always ideal to have as much input as possible in the first step, but this approach would leave everyone one week to review the date and raise concerns. We could still track the `Proposed` date in the meantime, and just switch it to `Confirmed` the week after. \n\nIf we went ahead with this, two things to figure out are:\n\n1. If we change a date on the next ACD, do we want to wait another week to confirm? For example, if this week we go from April 30th to something else, do we  want to then re-confirm the new date on ACDE next week?\n\n2. Where do we start the 30 day counter from? A `Proposed` date? A `Confirmed` one (If so, `Proposed` must be +37 days out).",
        "created_at": "2025-03-31T23:30:59.925000+00:00",
        "attachments": null
    }
]