[
    {
        "author": "alextes",
        "category": "general",
        "parent": "",
        "content": "ah, okay, ill be tuning in. we don't have a test env for the relay now 😅 , if holesky is getting saved in the next few days that's fine. if not, i better get going deploying to sepolia.\n\nbonus question, i read sepolia is closed node set. we get requests to test new out-of-protocol block building from time to time, i imagine those parties want to connect to us on open set networks where they can actually control block production. so *if* holesky gets dropped or post-recovery isn't stable enough to use, i'd be very curious to hear where people are expected to experiment with block production changes considering sepolia is closed set.\n\nglgl core devs",
        "created_at": "2025-02-26T08:44:27.852000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "If holesky dies then something like it will be reborn.  The community needs somewhere to test the consensus sdie of the process.",
        "created_at": "2025-02-26T08:46:22.948000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Holesky debrief call in 9 minutes: https://ethereumfoundation.zoom.us/j/86466169680?pwd=x17cbD1lDCeQEWMTTOLARQhELiJV21.1",
        "created_at": "2025-02-26T13:51:26.875000+00:00",
        "attachments": null
    },
    {
        "author": "yakimant",
        "category": "general",
        "parent": "",
        "content": "can you make a recording it possible? 🙏",
        "created_at": "2025-02-26T14:02:38.589000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "Just want to add here a request to please not move on to mainnet without a full testing of the hardfork on the only testnet where staking protocls can properly test the hardfork.",
        "created_at": "2025-02-26T15:02:48.089000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "It's really important for staking protocols to undergo the hardfork on something that is as close to mainnet as possible and holesky is / was the only option for that. Sepolia is not suitable at all. If we want to move on to test sepolia, let's do that, but it's really important to have a proper test of the hardfork on a non permissioned consensus testnet IMO, and it's crucial for a hardfork that touches as many consensus components as Pectra to be thoroughly tested.",
        "created_at": "2025-02-26T15:04:45.964000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "This isn't just a config issue for the network, staking protocols (and node operators) need to make changes to adapt to the changes being brought by Pectra, and holesky blowing up means these changes cannot be tested properly.",
        "created_at": "2025-02-26T15:08:14.434000+00:00",
        "attachments": null
    },
    {
        "author": "sauliusgrigaitis",
        "category": "general",
        "parent": "",
        "content": "That's why I'm pushing some kind of shadow fork of Holesky. I think we should just take the EL state before the crash and the same (or something similar if the same doesn't work) set of validators. Half of the validators are core devs and there are other professional entities from the community that we should convince to join and form \u003e2/3 of the stake.",
        "created_at": "2025-02-26T15:09:43.063000+00:00",
        "attachments": null
    },
    {
        "author": "pk910",
        "category": "general",
        "parent": "",
        "content": "I think a holesky shadow fork makes sense once we're confident that we can recover holesky in a regular way too.\nThen we can take the shortcut and avoid weeks waiting for recovery progress with a shadow fork.",
        "created_at": "2025-02-26T15:17:23.829000+00:00",
        "attachments": null
    },
    {
        "author": "cnupy",
        "category": "general",
        "parent": "",
        "content": "Coordinating a Holesky shadow fork would be next to impossible, and deploying all the infrastructure on the new dev net will take just as long as reviving Holesky. Pectra can't happen on the mainnet next month.",
        "created_at": "2025-02-26T15:18:55.924000+00:00",
        "attachments": null
    },
    {
        "author": "pk910",
        "category": "general",
        "parent": "",
        "content": "We're in the process to spin up another big public devnet with 1M validators to test pectra on.\nBasically a holesky replacement while it's unusable",
        "created_at": "2025-02-26T15:20:03.349000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Will share more detailed notes shortly, but here are the next steps coming out of today's call:\n\n**Before tomorrow's ACD**\n- Focus on getting as many Holesky validators and full nodes back online\n- Client teams to share their latest valid versions on the ACD agenda \n- If someone has a reason for delaying the Sepolia fork, please share it here. General consensus on the call was to **not** delay it. \n- EthPandaOps to start looking into launching `pectra-devnet-7`, which would have a comparable number of validators to mainnet, the ability to hand off some of them to staking pools, infra providers, DVT clusters, etc. and a faucet for people to do manual validator deposits.\n\n**On tomorrow's ACD**\n- If Holesky missed slot rate is \u003c25%, start coordinating slashings. If not, determine next steps to get it there (or start slashings earlier)\n- Final call on Sepolia fork time, client teams to confirm their releases\n- Discuss what we'd like to see before a mainnet fork\n\n**On next week's ACDC**\n- Assuming things have stabilized, teams should share their retrospective on the incident, and we should discuss longer term mitigations to better address and respond to these types of issues.",
        "created_at": "2025-02-26T15:21:12.890000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "Can you please DM me so that we can try to coordinate to get Lido on it? We would also basically need the HF to not happen \"super soon\" (like 5 epochs into the devnet) but after a few days so thatprotocol operations have run properly (there's stake deposited, etc).",
        "created_at": "2025-02-26T15:25:59.180000+00:00",
        "attachments": null
    },
    {
        "author": "pk910",
        "category": "general",
        "parent": "",
        "content": "yes,  current plan is to have electra activating 3-5 days after genesis.",
        "created_at": "2025-02-26T15:29:48.740000+00:00",
        "attachments": null
    },
    {
        "author": "pk910",
        "category": "general",
        "parent": "",
        "content": "we have a bunch of genesis keys that we can hand out to staking pools / providers (20 mnemonics a 5k keys each)",
        "created_at": "2025-02-26T15:30:41.066000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "Ideally we'd want to deposit the (or some of them) keys (i.e. not that they start \"active\"). Would that be possible?",
        "created_at": "2025-02-26T15:32:22.130000+00:00",
        "attachments": null
    },
    {
        "author": "pk910",
        "category": "general",
        "parent": "",
        "content": "sure,  we'll have a open deposit contract as usual.  but the deposit queue will be aa problem if you want them to be active before electra activation.\nwe can further delay electra activation if we see a high need for deposits tho",
        "created_at": "2025-02-26T15:33:30.993000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "We actually specifically want to test \"validators deposited before\", \"validator deposits occurring around the hardfork\" and \"validator deposits after the hardfork\", so the full buffet would be great.",
        "created_at": "2025-02-26T15:34:12.677000+00:00",
        "attachments": null
    },
    {
        "author": "juarce_yac",
        "category": "general",
        "parent": "",
        "content": "Will share more detailed notes shortly,",
        "created_at": "2025-02-26T15:34:45.460000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "On the call we discussed that only those that need to have validators activated (as opposed to being incorporated in genesis) would go through the activation process, which should keep the queue down a bit.  \u003c@77492786336636928\u003e any idea how long you would need from genesis to have your infra set up and to start to deposit?",
        "created_at": "2025-02-26T15:35:17.198000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "I will ask and get back to you ASAP",
        "created_at": "2025-02-26T15:35:33.215000+00:00",
        "attachments": null
    },
    {
        "author": "izz.y",
        "category": "general",
        "parent": "",
        "content": "If the queue is relatively small then the intended 3-5 days works for us, thank you.",
        "created_at": "2025-02-26T15:40:59.103000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Here are some longer notes, will upload the recording to YT shortly: https://ethereum-magicians.org/t/holesky-incident-debrief-february-26-2025/22998?u=timbeiko",
        "created_at": "2025-02-26T15:59:13.110000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Cross-posting from interop: here's a (still WIP) postmortem recapping the Holesky situation: https://github.com/ethereum/pm/blob/master/Pectra/holesky-postmortem.md",
        "created_at": "2025-02-26T19:48:38.465000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2025-02-26T19:49:01.945000+00:00",
        "attachments": null
    }
]