[
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "**ACDC #154 in ~25 mins!**\nAgenda: https://github.com/ethereum/pm/issues/1399\nStream: https://youtube.com/live/RWBhHHrZ48w?feature=share\nZoom: https://ethereumfoundation.zoom.us/j/85969202880?pwd=YUayBl1jRhwRFCHXwwajzKLkKX0afM.1",
        "created_at": "2025-04-03T13:36:29.348000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I feel good because this is an EIP that I have nothing against and I believe it to be a good one. But again and again we have promised in the last few years to not CFI an EIP the very first time it's presented in ACD and during a sync conversation decide on the spot to include it. Specially with an identification of \"no voices against\"=\"widely supported\". This is precisely what happened today with EIP 7917 which ironically was created 10 days ago and essentially no one but the people that supported it had any knowledge about it. We should really stop doing this and we shouldn't be in the position of being always the same ones looking like assholes by voicing against this",
        "created_at": "2025-04-03T15:38:07.170000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "thanks for raising this! i feel like settling on CFI for this EIP was a good middle ground for the time being given that we want to determine Fusaka scope by next week, there did seem to be some support for this EIP, and the fact that it came up relatively late in the pipeline\n\nCFI here gives us time to further vet the EIP and the framing to me is that ACD is saying \"we are interested in this EIP at this time, but are not commiting that it _must_ be in Fusaka",
        "created_at": "2025-04-03T15:43:21.551000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "There should not have even been a discussion about any kind of inclusion for this EIP, or any other one,  during the same meeting it was presented. It's a simple rule that should really be followed.",
        "created_at": "2025-04-03T15:44:49.623000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "yeah, i agree with not CFIing something the same day it is introduced\n\ni was on the fence about the timing here given the April 10th deadline and the relative timing of when these discussions are taking place in ACDC. having strict deadlines like this are new, and we are working out the kinks. \n\ni had hoped to get to a final CFI set today, but do think it is reasonable to take another call for this purpose.  to be clear, i dont think your raising this point or trying to flag it during the call is a negative thing -- we have this rule for a good reason 🙂\n\ni'll have a summary of today's call with decisions made soon, and will flag this. we will take next ACDC on April 17th to revisit the Fusaka CFI set and this will give everyone more breathing room to consider the additional CFI EIPs before we make a final assessment",
        "created_at": "2025-04-03T16:04:38.282000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "Key updates from ACDC #154:\n\n* Pectra timelines\n  * Mainnet date confirmed to be **May 7 2025**\n  * Client releases by **April 21 2025**\n  * Pectra mainnet blog post by **April 23 2025**\n* Fusaka EIPs\n  * SFI: EIP-7594 (PeerDAS)\n  * CFI: EIP-7892 (BPO)\n  * others pending (check summary)\n\nWill follow up with full summary soon.",
        "created_at": "2025-04-03T16:27:27.048000+00:00",
        "attachments": null
    },
    {
        "author": "linoscope",
        "category": "general",
        "parent": "",
        "content": "Thanks \u003c@755590043632140352\u003e for the feedback! I totally understand your point on this being too sudden, and apologize for that. It was actually very recent that we noticed how MaxEB impacts lookahead and preconfs, which led to this rather \"emergency\" EIP.\n\nAnd sounds good to continue the discussion next week after some time to consider. In the meantime, for whoever is interested, here is the Ethereum Magicians post of the EIP: https://ethereum-magicians.org/t/eip-7917-deterministic-proposer-lookahead/23259\n\nAll the relevant links (EIP, consensus-spec PR, some docs with context) are there. Also, feel free to leave any question/comments there, any feedback is greatly appreciated 🙏",
        "created_at": "2025-04-03T17:39:45.868000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I just published a proposal to reconfigure ACD on EthMagicians: https://ethereum-magicians.org/t/reconfiguring-allcoredevs/23370\n\n**TL;DR**\n\n* I propose reconfiguring AllCoreDevs such that ACDE \u0026 ACDC focus on scoping the next hard fork, rather than implementing the current one. In addition to welcoming existing attendees, these calls could more explicitly solicit input from a broader range of community stakeholders.\n* To complement this, the existing testing/interop call would formally become “ACDT(esting)”, focused on the current fork’s implementation details, rather than setting its scope, ensuring that resolving technical issues doesn’t compete with high-level feature prioritization.\n* With Pectra about to go live, and the Fusaka fork scope scheduled to finalize soon, Glamsterdam presents a good opportunity to test this process. Before then, I propose having a review and feedback period, aiming for a go/no-go decision shortly after Pectra mainnet releases are out.",
        "created_at": "2025-04-03T17:48:45.873000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "wen timestamp and forkids?",
        "created_at": "2025-04-03T18:12:32.573000+00:00",
        "attachments": null
    },
    {
        "author": "chay_z123",
        "category": "general",
        "parent": "",
        "content": "Is there going to be a timeline in which client teams will have final versions to support the mainnet hardfork?",
        "created_at": "2025-04-03T19:47:22.690000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Here \u003c@782760001050902579\u003e",
        "created_at": "2025-04-03T19:47:48.390000+00:00",
        "attachments": null
    }
]