[
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "It seems most the discussions of L1 execution scaling in the next couple upgrades focus mainly on default gas limit increases and optimizing the protocol to accommodate them. However,  I think even a modest reduction to even 9s L1 slot times in Glamsterdam should be considered (my understanding it easier to reduce to a slot time # divisible by 3 per the spec) .  It  would improve user UX, enhance base rollup sequencing, decrease mev and help with the ecosystem L1 scaling narrative.  This assumes it can be done safely and not kick off too many home stakers within the specs of eip-9270.",
        "created_at": "2025-05-13T02:17:32.044000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I wouldn't be against this if block size was disconnect from slot time (e.g., gas per second instead of gas per block).  This way the decision about slot time could be made independent of decisions about resource utilization over time.  At the moment, the way we configure things makes the two intertwined but there is really little reason to have them be dependent on each other.",
        "created_at": "2025-05-13T04:44:29.072000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e we should make the configuration be gas/s and not per block",
        "created_at": "2025-05-13T05:13:07.499000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e and I agree that a slot time reduction for Glamsterdam would be very valuable",
        "created_at": "2025-05-13T05:13:45.458000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "general",
        "parent": "",
        "content": "100%. slot time reduction in glamsterdam would be extremely valuable. maybe the premier CL feature. it might be a lot of work so we should be the ball rolling now",
        "created_at": "2025-05-13T17:37:33.153000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "general",
        "parent": "",
        "content": "how much can slot time be reduced? performance testnets focused on slot time will reveal the answer. we need nets that don't just have configurable slot time, but slot time that can hot swapped without downtime",
        "created_at": "2025-05-13T17:39:10.430000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "how much can slot time be reduced?",
        "created_at": "2025-05-13T17:53:55.016000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdankrad\u003e I think 6s is quite doable. Gnosis chain runs at 5s. We need to change the slot partition to something like 3/1.5/1.5 or 4/1/1",
        "created_at": "2025-05-13T18:36:26.545000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "general",
        "parent": "",
        "content": "Reminder, we have the second instance of our new protocol research call tomorrow. Normally \u003c@486501030046203915\u003e is the main host, but tomorrow I will lead the call.\n\nTopic will be short-term EL scaling features.\nPreliminary agenda: https://github.com/ethereum/pm/issues/1532\nTime slot is eth-o-clock (14:00 UTC, 90min). Will post zoom link before the call.\n\nHope to see many of you on the call tomorrow!",
        "created_at": "2025-05-13T19:00:23.808000+00:00",
        "attachments": null
    }
]