[
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "summary of ACDC #154 here: https://ethereum-magicians.org/t/all-core-devs-consensus-acdc-154/23340/3?u=ralexstokes",
        "created_at": "2025-04-05T21:35:17.100000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "reposting action items:\n\nAction items\n\n* Pectra timelines\n    * Mainnet date confirmed to be May 7 2025\n    * Client releases by April 21 2025\n    * Pectra mainnet blog post by April 23 2025\n* PeerDAS implementations should focus on the cell proof computation migration, and getBlobs support\n    * validator custody is another outstanding feature but can be rolled out later so focus should be on the prior features\n* FYI: EIP-7892 (BPO scaling) has been CFI’d for Fusaka\n* Review the set of PFI’d Fusaka EIPs so we can make a final call on Fusaka CFI’d EIPs on ACDC #155.",
        "created_at": "2025-04-05T21:35:52.914000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "there are two threads here: (1) the governance process of PFI -\u003e CFI -\u003e SFI, and (2) the technical merits of EIP-7917 itself.\n\ni'll let the EIP authors of 7917 speak to (2).\n\nregarding (1):\n\ni was biasing towards getting to a final CFI set on this call so that we can keep ACD momentum high (cf. April 10 deadline), and in this view i would lean towards CFI'ing something if there is _some_ chance it could go in the fork as that signals we are serious enough about the EIP to start investigating in-depth (cf. the vetting process you are calling out)\n\nan important distinction here is the difference b/t CFI and SFI -- SFI means it is _definitely_ going into the fork, CFI only indicates it _may_.  i'm not sure how clear this distinction is so i pinged Tim to take some time next week to review. i think Tim had a good model for how it should work on the call. i was also likely confusing the conversation with a misuse of CFI vs SFI terminology on the call and i do apologize for that.\n\ngiven this, and the points raised (rightfully so!) around being careful with inclusion from yourself, \u003c@755590043632140352\u003e, and \u003c@308223150725005322\u003e, we should take another ACDC to discuss the CFI set for Fusaka",
        "created_at": "2025-04-05T21:57:35.019000+00:00",
        "attachments": null
    }
]