[
    {
        "author": "abcoathup",
        "category": "general",
        "parent": "",
        "content": "\u003c@415548822983278593\u003e copied your summary to Eth Magicians.  Feel free to add any other actions/decisions.\n\nhttps://ethereum-magicians.org/t/all-core-devs-execution-acde-214-june-19-2025/24508/2",
        "created_at": "2025-06-20T02:29:01.529000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It would be helpful for these summaries (and \u003c@415548822983278593\u003e's summaries in chat) to include EIP titles, not only numbers.  Not everyone has every EIP memorized.",
        "created_at": "2025-06-20T02:35:31.533000+00:00",
        "attachments": null
    },
    {
        "author": "cperezz.eth",
        "category": "general",
        "parent": "",
        "content": "That was mainly a gutfeeling. As having EC, RSA is just there for compatibility with people that haven't upgraded.\n\nnevertheless, that's good to know, thanks for rising the hand here!",
        "created_at": "2025-06-20T07:13:08.458000+00:00",
        "attachments": null
    },
    {
        "author": "__flcl",
        "category": "general",
        "parent": "",
        "content": "A proposal to implement blob limit per tx via blob schedule was rejected quickly during ACD meeting, despite it was approved by a dozen of people before. I think it's still relevant:\n- DA is an important part of Ethereum that will only grow in requirements in the future, multiple times, the limit seems to be essential part of this future tuning\n- the chosen limit of 6 blobs seems to be an initial option that will change in the future for sure, to allow growing demand of L2s without losing atomicity of proofs sending\n- tx pool is kinda simple, but we already changed it to handle bigger txs, mostly by imposing stricter constraints; instead I'd suggest to spend more time on research of potential real scalability improvements, so the pool can handle more transactions and of bigger size",
        "created_at": "2025-06-20T07:56:37.035000+00:00",
        "attachments": null
    },
    {
        "author": "spencer_tb",
        "category": "general",
        "parent": "",
        "content": "For CLZ (7939) I remember hearing last week that people wanted to increase its gas cost from 3 -\u003e 5. Is that still the case?",
        "created_at": "2025-06-20T14:39:17.803000+00:00",
        "attachments": null
    },
    {
        "author": "frozenfire.eth",
        "category": "general",
        "parent": "",
        "content": "RSA",
        "created_at": "2025-06-20T15:25:51.520000+00:00",
        "attachments": null
    },
    {
        "author": "chay_z123",
        "category": "general",
        "parent": "",
        "content": "Could someone confirm the withdrawal contract address on Hoodi? This is in regards to EIP7002, checked the Hoodi configs on GitHub and only see the deposit contract.",
        "created_at": "2025-06-20T17:07:33.094000+00:00",
        "attachments": null
    },
    {
        "author": "chay_z123",
        "category": "general",
        "parent": "",
        "content": "Believe it’s this by looking at etherscan and at the EIP directly, but looking for confirmation the below is accurate on Hoodi: 0x00000961Ef480Eb55e80D19ad83579A64c007002",
        "created_at": "2025-06-20T17:10:55.602000+00:00",
        "attachments": null
    }
]