[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Because it makes gas limit calculations much harder?",
        "created_at": "2026-01-18T05:43:23.170000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "general",
        "parent": "",
        "content": "It changes only when gas limit changes, which is very rarely (at least significant changes) and slowly.",
        "created_at": "2026-01-18T07:04:44.715000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Gas limit changes every block doesn't it?",
        "created_at": "2026-01-18T07:06:43.657000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "general",
        "parent": "",
        "content": "Yeah sorry just edited to clarify. There will likely be some rounding to make the changes more rare (requiring bigger jumps in the gas limit, not just block by block noise) but anyway small fluctuations can be dealt with just by adding a bit of a safety margin to the tx gas limit",
        "created_at": "2026-01-18T07:09:27.926000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Going from \"set the gas limit to exactly what the user will need\" to \"set the gas limit to something that likely exceeds what the user needs\" is a pretty significant change.  It is a 0-\u003e1 sort of change, which is very different from a 1-\u003e2 sort of change.",
        "created_at": "2026-01-18T07:11:57.202000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Today, you can find the gas limit for a transaction and that will be stable for most transactions until at least the next hard fork (e.g., 6-12 months).  This change (IIUC) would make it so a gas limit is \"good\" for a potentially much more limited duration.",
        "created_at": "2026-01-18T07:12:25.100000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Importantly, this would break just about every app I have built, as they currently set the gas limit to the calculated gas limit by the client.  You could perhaps address this somewhat by having the RPC client do the padding, but then it is changing the meaning of `eth_estimateGas`.",
        "created_at": "2026-01-18T07:15:34.477000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "general",
        "parent": "",
        "content": "The alternative is to immediately set the gas costs much higher, to account for the highest gas limit that we think we might get to before another hard fork, e.g. as if gas limit was 300M already, in which case everyone would always have to pay 5x more for state, instead of just setting a 1% margin or something like that. Tx senders that really care about their txs having very high changes of being includable for months can always act as if all those gas costs were not dynamic and were instead 5x higher to begin with, and set a much higher gas limit. The vast majority of txs will benefit from the dynamic costs though.",
        "created_at": "2026-01-18T07:28:43.798000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "For clarity, I'm a big fan of separating gas pricing from compute and network pricing.  I have not followed closely with the current set of proposals to try to achieve this, but the above concerns make the proposal being discussed not obviously great.",
        "created_at": "2026-01-18T07:30:55.379000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Maybe it is the least bad solution to the problem of entangled compute + network + storage costs.  🤷",
        "created_at": "2026-01-18T07:31:21.969000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I'm assuming having two different limits and fees has already been discussed (multidimensional pricing)?",
        "created_at": "2026-01-18T07:31:57.216000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "general",
        "parent": "",
        "content": "Yes, just does not seem at all realistic for Glamsterdam. However, EIP 8037 in its current form is a precursor to that, because it introduces the separate metering of state growth operations, which we can later use to implement some form of EIP-7999, with separate prices and limits",
        "created_at": "2026-01-18T08:01:11.514000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I don't think we need to rush this.  If it needs more time to bake and work through that is fine IMO.  I also see no urgency in cranking the gas limit to 11 as fast as possible like many people these days though.",
        "created_at": "2026-01-18T08:07:59.056000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "I don't see us cranking the limit to 11, more like 3. We are (in my opinion) already close to the limit of state growth that clients can currently handle, while we are miles away from maxing out on compute. With the glamsterdam repricings alone, we can 3x compute, with bals hopefully another 3x due to parallelization and with epbs another 1.5-2x.\nIf we can not take advantage of these improvements, then why ship them at all?",
        "created_at": "2026-01-18T10:03:19.918000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If taking advantage of them in the next fork requires making sacrifices that we wouldn't have to make if we just waited a bit longer, then that would be the reason to wait.  We should be building for the long term, not for the next 6 months.",
        "created_at": "2026-01-18T10:04:13.781000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "The bigger change would be fully multidimensional gas, which is a much larger and more invasive change. I don't see us realistically shipping this by eoy",
        "created_at": "2026-01-18T10:07:11.207000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Why do you feel the need to ship by the end of the year?",
        "created_at": "2026-01-18T10:11:27.205000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "Because I think Ethereum needs a credible commitment to scaling. Without the necessary scale, we will not be able to get to the network effects that allow me to pay for my pizza in eth (or my subscription to a banned newspaper in my county)",
        "created_at": "2026-01-18T10:36:41.230000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "general",
        "parent": "",
        "content": "Imo there's also little gain in waiting to do the first step (multidimensional metering), because either way users will need to adjust, with 7999 (or any multidimensional pricing) there will be a new tx type that lets you set different limits. In the meantime, having to slightly pad your gas limit seems quite minor in comparison to what this unlocks",
        "created_at": "2026-01-18T10:48:35.823000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Will all JSON-RPC servers (e.g., Ethereum clients responding to `eth_estimateGas` requests) be doing this padding automatically?",
        "created_at": "2026-01-18T10:49:45.871000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The cost to send ETH right now is ~$0.002.  It is not clear to me that we are desperate to scale ASAP from this one metric at least.  I know it is a poor metric (I have argued against using it many times), but I haven't heard any strong arguments that suggest we need to move fast and break things rather than taking our time and making sure we implement the best possible solution to each problem in a slow and measured way.",
        "created_at": "2026-01-18T10:51:09.792000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Maybe the proposed solution *is* the best possible solution, but nowhere in the argument to support that should be the claim that \"it can be implemented before the next hard fork\".  An argument supporting it should show that it solves the target problem better than any other proposal with the least amount of negative consequences.",
        "created_at": "2026-01-18T10:53:11.103000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "yes, I am not thinking on the rate of change, more about they making architectural decisions based on gas pricing that may become invalid. Things of the form \"This is better to hardcode as contract store rather than send as calldata in every transaction\" may become invalid. Getting input from at least the major contract writers would be good.",
        "created_at": "2026-01-18T11:23:54.479000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "general",
        "parent": "",
        "content": "Importantly, this would break just about",
        "created_at": "2026-01-18T17:29:02.878000+00:00",
        "attachments": null
    }
]