[
    {
        "author": "pcaversaccio",
        "category": "general",
        "parent": "",
        "content": "hey guys, I wanted to quickly bring your attention to a recent zero-interaction attack in VS Code. Last Friday we (in this context SEAL 911 \u0026 SEAL Intel) discovered an attack vector where you only need to clone a repo, trust it, and open it in VS Code - _no further interaction_ is required to compromise your device:\n- This is my public warning tweet with a short explanation: https://x.com/pcaversaccio/status/2009931485202055168\n- Our fully-fledged deep-dive: https://radar.securityalliance.org/vs-code-tasks-abuse-by-contagious-interview-dprk/\n\nThe tl;dr is that `.vscode/tasks.json` hooks (that can be part of any repo) are _auto-executed_ for trusted repos when you open them in VS Code. This can install anything on your device (Windows, macOS, Linux doesn't matter) without you explicitly executing a task.\n\nI know you guys are all pros and will probably argue that the VS Code \"I trust this workspace\" modal is enough but believe me, its _not_. We found this because a number of prof devs got compromised after cloning and trusting technical assessment repos while job hunting. The damage is already \u003e$1m just saying.\n\nI don't know what IDE you all use and I'm not here to tell anyone what's best. I just want to highlight this so you're aware and can be extra careful.\n\nIf you have contacts at Microsoft / VS Code, here's my issue asking to disable automatic tasks even for trusted repos: https://github.com/microsoft/vscode/issues/287073\n\nIn your `settings.json` file you can already disable it like this:\n\n```json\n\"task.allowAutomaticTasks\": \"off\",\n```\n\nIf this is the wrong channel, lmk and I'll move it. Sharing this because I care about Ethereum and the core devs and don't want anyone getting compromised. Cheers. \u003c:eth2:595693639913570305\u003e",
        "created_at": "2026-01-14T10:01:26.531000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Is the attack fully mitigated by adding that line to `settings.json`?",
        "created_at": "2026-01-14T11:45:18.249000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Also, does the attack have any teeth if you do all development inside docker containers (VSCode Remote Docker)?",
        "created_at": "2026-01-14T11:45:45.592000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "To be more specific, is the VSCode part of the attack fully mitigated by that.  Reading over the article, it appears that the attackers are using many vectors to try to infect, with VSCode being one of them.",
        "created_at": "2026-01-14T11:54:34.307000+00:00",
        "attachments": null
    },
    {
        "author": "pcaversaccio",
        "category": "general",
        "parent": "",
        "content": "well this depends on whether you continue working on such a repo. Usually there are some additional ways to infect you, via eg malicious npm packages but this requires you to execute something (eg install something or run some code). If you don't do anything, disabling automatic tasks will save you yes.\n\nregarding your second q:\n\nsomeone could create eg something like a `.devcontainer/devcontainer.json` file in the repo:\n```yaml\n{\n  \"name\": \"my-project\",\n  \"dockerfile\": \"Dockerfile\",\n  \"runArgs\": [\"-v\", \"/:/mnt/host\", \"--privileged\"]\n}\n```\nNow the the person clones the repo, opens in VS code, and boom you're basically fucked since this mounts the _entire_ host root filesystem (`/`) into the container at `/mnt/host` \u0026 gives the container full kernel capabilities via `--privileged`. So for docker it's always a question what privileges you give.\n\nmaybe to not spam this channel we can create a dedicated thread if you (or anyone else) have further questions?\n\nPS: I'm happy to share an example for such a malicious repo in DMs.",
        "created_at": "2026-01-14T11:57:03.605000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "VSCode \u0026 Friends Attacks",
        "created_at": "2026-01-14T11:58:14.278000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "\u003c@892053833121923094\u003e do we have defined tests anywhere that we can use to go/no-go our clients for the eips being considered for devnet2?",
        "created_at": "2026-01-14T13:58:44.032000+00:00",
        "attachments": null
    },
    {
        "author": "danceratopz",
        "category": "general",
        "parent": "",
        "content": "Hi Justin, we're working on these now, but there's no release yet.",
        "created_at": "2026-01-14T13:59:32.065000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "ok, so between that and some of the underspecification being found, we might be a little reluctant to commit to all 4 of these going into BAL devnet 2 on ACDE tomorrow.",
        "created_at": "2026-01-14T14:07:53.467000+00:00",
        "attachments": null
    },
    {
        "author": "spencer_tb",
        "category": "general",
        "parent": "",
        "content": "Following: https://discord.com/channels/595666850260713488/1460389522092064798/1460639725726466214\nI think we should remove 7843 from devnet-2. And stick with only 8024, 7778 \u0026 7708.",
        "created_at": "2026-01-14T14:16:29.812000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "general",
        "parent": "",
        "content": "Not sure if this was talked about. We prefer EIP-8024 (SWAPN, DUPN, EXCHANGE) to be simpler and use previous version of `SWAPN PUSH2 0x0000` format as it is more straightforward on both jumpdest analysis and impl side.\n\nWas this discussed in ACDT?\n\nNot a blocker, EIP-8024 is important to add and any version of EIP would work for us!",
        "created_at": "2026-01-14T14:35:00.181000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "general",
        "parent": "",
        "content": "sure makes sense since it requires small CL changes. working on clarifying the details of engine api changes",
        "created_at": "2026-01-14T14:44:32.070000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "general",
        "parent": "",
        "content": "This makes sense, syncing CL and EL versions can be troublesome",
        "created_at": "2026-01-14T16:29:56.754000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "general",
        "parent": "",
        "content": "thanks for raising, I've opened a couple of draft PRs to the EIP and execution apis to clarify the engine api changes and standardise the names:\nhttps://github.com/ethereum/EIPs/pull/11083\nhttps://github.com/ethereum/execution-apis/pull/731",
        "created_at": "2026-01-14T17:29:59.366000+00:00",
        "attachments": null
    },
    {
        "author": "siladu",
        "category": "general",
        "parent": "",
        "content": "How are we deciding which EIPs all clients should implement first? \n\nWe are still scoping Glamsterdam and have a large list of CFI and a bunch more PFI. I thought the intention was to trim that CFI list down if we want a timely Glamsterdam, so not clear to me these EIPs are scheduled for Glamsterdam.\n...is the assumption here that all CFI EIPs will get SFId unless there's issues in implementation?\nOr is there a ranking within the CFI list I'm not aware of?",
        "created_at": "2026-01-14T20:26:20.315000+00:00",
        "attachments": null
    },
    {
        "author": "marioevz",
        "category": "general",
        "parent": "",
        "content": "There’s no ranking, it was poor decision from my side to try to get a head start and start testing sooner in order to not have all cfi’d eips implemented at once and then rush testing",
        "created_at": "2026-01-14T20:41:26.954000+00:00",
        "attachments": null
    },
    {
        "author": "siladu",
        "category": "general",
        "parent": "",
        "content": "My concern is that we waste effort only for these EIPs to not make it in due to scoping decisions made in a future ADCE. If there's a reason this won't happen for these EIPs then fair enough.\n\nMaybe one way forward if there is free time before scope is agreed: Instead of every client implementing the same 4 EIPs, we could divide the CFI EIPs up between client/test teams and start a prototype impl which will help with scoping.",
        "created_at": "2026-01-14T21:13:34.739000+00:00",
        "attachments": null
    },
    {
        "author": "marioevz",
        "category": "general",
        "parent": "",
        "content": "It's definitely possible they don't make it, I suggested these because they were the first ones CFI'd and seemed simple enough to get started. I think we should just wait until tomorrow to the final decision, sorry about this confusion.",
        "created_at": "2026-01-14T22:38:20.187000+00:00",
        "attachments": null
    }
]