[
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "Just read your docs on championing and breakouts, thanks.  I notice that \"engage in predictable venues (calls + Discord) when the EIP is being discussed\"  doesn't mention the \"discussion-to\" link to the EIP's Magician's thread.  This is often one of the best places to engage.  Discord threads can be scattered and hard to find, and attending calls can be difficult for people due to time zones and other commitments.  The Magician's thread for an EIP is  easy to find, asynchronous, and leaves a record of the discussion.",
        "created_at": "2026-01-17T00:18:16.776000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "And of course the job of Champion remains nearly impossible for one person to do.  We are asking engineers, often volunteers, to be product managers and marketers as well.  And technical decisions that should be left to a small group of experts become fodder for anyone with a following on Xitter.  I don't have an answer, but it's problem.",
        "created_at": "2026-01-17T00:19:29.180000+00:00",
        "attachments": null
    },
    {
        "author": "nixo.eth",
        "category": "general",
        "parent": "",
        "content": "feature champion support",
        "created_at": "2026-01-17T02:24:44.607000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "More information about EIP-8037 and why a simple bump to storage costs can be very harmful: https://notes.ethereum.org/@MariusVanDerWijden/SJD3CGdSbx\nPlease take a look before Mondays discussion",
        "created_at": "2026-01-17T18:24:01.038000+00:00",
        "attachments": null
    },
    {
        "author": "anderselowsson",
        "category": "general",
        "parent": "",
        "content": "\u003e \"A small bump will either underprice or overprice storage operations, 8037 will always correctly price operations relative to the block limit.\"\n\nThe current 8037 spec uses the 8011 mechanism for setting the base fee, which does not improve upon 1559 when it comes to this topic, assuming we try to balance the price also for compute. It can underprice or overprice storage operations to the same extent as a bump (and optional 8073 adjustment), because it requires us to try to predict the demand elasticity, and then setting the gas price schedule manually. To always correctly price state gas, we would require 8037 to employ the 8075 pricing mechanism, which sets a separate price for state creation based on demand.\n\nWhat Both the 8011 and 8075 mechanism do well is to not count state creation against the gas limit of other resources, thus improving scaling. This was the reason for reworking EIP-8037, given that state gas may come to otherwise crowd out compute. Ideally we will decide to use the EIP-8075 pricing mechanism for 8037 (if we accept adding new block header variables). Using the 8011 mechanism is otherwise also clearly preferable to a bump, given the improved handling of the gas limit, which is its main selling point.\n\nThe work on the `StateGasReservoire` looks intuitive.",
        "created_at": "2026-01-17T18:55:23.328000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "What did application developers say about this. A dynamical cost to sstore  seems like a brutal change from the outside",
        "created_at": "2026-01-17T23:04:46.021000+00:00",
        "attachments": null
    }
]