[
    {
        "author": "zsfelfoldi",
        "category": "general",
        "parent": "",
        "content": "I updated the agenda of Trustless Log Index Breakout #1:\nhttps://github.com/ethereum/pm/issues/1869\nAfter the feedback on EIP-7745 being very complex I explored some earlier alternative ideas again and now I managed to come up with a much simpler design variant. I did not decide to abandon the earlier version yet but it would be useful to discuss this over the first session and if possible then decide which direction to pursue further.\nI would also like to invite Nethermind and Erigon to discuss this if possible, as the main critics of the complexity of the current EIP.",
        "created_at": "2026-01-16T12:58:57.794000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "Here is some client diversity data courtesy of \u003c@680234424037670912\u003e  from Teku acquired by scraping some watermark data:\n`\nSlots: 1225121\nWithout watermarks: 72.28% (885492)\nincluding watermarks: 27.72% (339629)\n\nCL CLients found:\nLH 52.41% (178016)\nLS 2.44% (8296)\nTK 45.14% (153317)\n\nEL Clients found:\nGE 47.14% (160088)\nRH 2.21% (7513)\nBU 16.49% (56011)\nEG 0.16% (548)\nNM 34.00% (115469)\n`\nNo Prysm data included. Would be nice if watermarks in graffiti field were made the client defaults to get better data on client diversity. Would be better as an opt out vs the current opt in system employed by most clients.",
        "created_at": "2026-01-16T13:37:11.587000+00:00",
        "attachments": null
    },
    {
        "author": "manunlp",
        "category": "general",
        "parent": "",
        "content": "We have a PR for that, will be merged on next week.\nhttps://github.com/OffchainLabs/prysm/pull/16089",
        "created_at": "2026-01-16T15:52:00.561000+00:00",
        "attachments": null
    },
    {
        "author": "greystroke",
        "category": "general",
        "parent": "",
        "content": "It's great this is being set as the default graffiti as opposed to opt-in. It is a big lift to get operators to change from the defaults.",
        "created_at": "2026-01-16T16:18:38.303000+00:00",
        "attachments": null
    }
]