[
    {
        "author": "justanapproachablegasstation",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yo how long you been in there?",
        "created_at": "2021-06-21T00:45:39.176000+00:00",
        "attachments": null
    },
    {
        "author": "dj_zorbas",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hi tim, sorry to tag you but I have watched a lot of videos with you here and there explaining how London is going to work but I have a question (and dont consider it as a pro miner profits rant or something I genuinely dont understand this particular thing I am going to ask) \n\nSo  EIP 1559 is aimed at reducing high fees on Ethereum. right? \nI understand how potentially having the ability to increase block sizes up to 200% depending on EVM utilization/traffic is going to help towards that.\n\nWhat I don't get is how burning a portion of the gas fees is doing anything else than lowering miner income especially considering the scenario of 200% blocks which on its turn potentially means people/bots increasing the gas fee/tip to be included in the block first so what changes if you are going to burn some of the gweis/gas  after the fact?  \n\nTo put it more simply as far as I understand fees are going to stay the \"same\" (like as a mechanic) as far as \"client\" (traders etc) side of things go, traders or ones that move coins between wallets wont get a \"refund\" from the burned gas. \n\nSo how is burned gas helping towards lowering high fees? With my current understanding it seems like it is just a miner profit handicap",
        "created_at": "2021-06-21T06:36:10.053000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "No, 1559 does not attempt to reduce fees at all.  That isn't a goal nor an expected outcome.",
        "created_at": "2021-06-21T06:38:43.514000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The primary benefit of 1559 IMO is to improve user experience around gas prices.  This requires adjusting incentives in a way that prevents profitable miner manipulation.",
        "created_at": "2021-06-21T06:41:53.761000+00:00",
        "attachments": null
    },
    {
        "author": "dj_zorbas",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I thought that was what this paragraph implies on the abstract of EIP 1559 \"Inefficiencies of first price auctions: The current approach, where transaction senders publish a transaction with a bid a maximum fee, miners choose the highest-paying transactions, and everyone pays what they bid. This is well-known in mechanism design literature to be highly inefficient, and so complex fee estimation algorithms are required. But even these algorithms often end up not working very well, leading to frequent fee overpayment.\"",
        "created_at": "2021-06-21T06:46:06.205000+00:00",
        "attachments": null
    },
    {
        "author": "dj_zorbas",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "As for your second response how do you think/know burning a portion of the gas is going to prevent miner manipulation in terms of transaction priority since there still will be a \"tip\" +MEV ? I only see reduced income on miners without any other effect that I could think of",
        "created_at": "2021-06-21T06:48:25.896000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "When they say \"fee overpayment here\" it is being used in the economic sense.  Some people pay 18 when they could have paid 17.",
        "created_at": "2021-06-21T07:10:23.740000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Not \"gas prices are 200, but we want them to be 5\".",
        "created_at": "2021-06-21T07:10:33.362000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "When designing the system, the simplest way to design it is to give miners the entire fee.  However, that creates an incentive alignment problem where miners can profitably do certain things that increase cost to users and work around the system.  By burning the fees instead, we can solve that problem.",
        "created_at": "2021-06-21T07:11:42.128000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Burning the fees is a solution to a problem *create* by the actual solution of creating a better auction system.  Burning the fees isn't the primary target.",
        "created_at": "2021-06-21T07:12:09.826000+00:00",
        "attachments": null
    },
    {
        "author": "dj_zorbas",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "but this is what I ask and dont get",
        "created_at": "2021-06-21T07:12:36.690000+00:00",
        "attachments": null
    },
    {
        "author": "dj_zorbas",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "how burning fees solves this problem",
        "created_at": "2021-06-21T07:12:48.162000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I recommend checking out https://hackmd.io/@timbeiko/1559-resources, it has a large volume of great material that covers what you are trying to understand with a varying range of depth (some purely mathematic models, some simulations, some high level overviews, etc.).",
        "created_at": "2021-06-21T07:13:17.178000+00:00",
        "attachments": null
    },
    {
        "author": "dj_zorbas",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Thanks I will look into it",
        "created_at": "2021-06-21T07:13:52.687000+00:00",
        "attachments": null
    }
]