[
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Perhaps this is a bit heavy for chat, but I'm wondering how the core devs feel about \"the human cost of Ethereum\", or \"Ethereum is one of the missions of my life\", or both of these being true together.",
        "created_at": "2021-12-01T12:46:16.882000+00:00",
        "attachments": null
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There is a devcon diary of Greg on Youtube, where he mentions a feeling that there's a transition from a family to a community, and how it feels somewhat different. The culture of Ethereum-adjacency feels to me as rather distinct from those of the wider open source space for instance, and also a little different from the energy of academic economics, and people who like maths and CS, etc. I'm confident these perceptions are particular to me, though I'd love to hear what perceptions others have that they suspect are particular to themselves.",
        "created_at": "2021-12-01T12:50:19.195000+00:00",
        "attachments": null
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The recent tweetstorms stemming from Avalanche \u003c\u003e Ethereum relations unlocked quite a lot of energy. It was strangely bliss-evoking to see the latent become the expressed.",
        "created_at": "2021-12-01T12:52:45.061000+00:00",
        "attachments": null
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "One type of thread that arose was of the sort \"here I am, in some part of my home, at some peculiar hour, working on Ethereum\".",
        "created_at": "2021-12-01T12:54:02.048000+00:00",
        "attachments": null
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I have witnessed incredible excitement from academics, and seemingly destructive intensities of drive by founders, for instance.",
        "created_at": "2021-12-01T12:55:39.467000+00:00",
        "attachments": null
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I suppose the kernal-pursuit of this open-ended waterfall of text is \"what is it like to be a deep Etherean\", and \"what is the true price of Ether\".",
        "created_at": "2021-12-01T12:57:21.178000+00:00",
        "attachments": null
    }
]