[
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Thank you.  Can't say I'm convinced by the arguments in \"Why should we do EIP-7251 if we can’t guarantee consolidation?\" though.\n\n1) The idea that it's harder to look after 139,000 keys rather than ~8,600 keys doesn't fit with the reality that I have seen of managing keys at scale.  They are either all off the same HD seed, or managed through a process that largely doesn't care how many keys there are.\n\n2) \"solo stakers immediately can start to benefit from auto-compounding of their staking rewards\" I have stated before that this isn't a very accurate summarization of what 7251 brings, and given that at current it appears to be that you have to at least deposit an additional 1 ETH into your validator before you can take advantage of a validator cap above 32 ETH it's also somewhat selective.\n\n3) option 2 of the document linked in the argument here doesn't require variable balances.\n\nBut it appears that the ship has sailed regarding including 7251 in the next hard fork or not.",
        "created_at": "2024-04-15T08:40:21.717000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Separately, has consideration been given to delegation rather than consolidation?",
        "created_at": "2024-04-15T08:42:18.418000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "delegation as in my old PR? https://github.com/ethereum/consensus-specs/pull/2763",
        "created_at": "2024-04-15T11:23:08.707000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "that PR makes things worse with regards to slice size. I think you are underestimating the benefits of running a single key vs many. Not having to track many subnets, aggregate constantly and so on are clear winners.",
        "created_at": "2024-04-15T11:24:51.615000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "No, more of a consolidation but without moving the balance, and allowing undelegation.  So fewer validators still, but a more flexible system.",
        "created_at": "2024-04-15T11:25:26.239000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "that would be worse UX than sending from time to time a tx with the amount you want to withdraw... any \"undelegation\"  has to be churned on the exit queue",
        "created_at": "2024-04-15T11:26:41.638000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Those benefits cap out at what would currently be around 2048 validators, I think.",
        "created_at": "2024-04-15T11:27:38.656000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "For security reasons?  Perhaps, but although the stake could drop it couldn't go below 32 ETH in undelgating so there would still be stake at risk.\n\nBut I haven't thought it through, it was more a case of wondering if we can do something better than consolidation.",
        "created_at": "2024-04-15T11:29:11.739000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "not really I mean if you run 60 keys you' re most likely aggregating every single epoch, signing multiple messages per epoch and subscribed to a bunch of unnecessary subnets. If you instead consolidated, your node will run much lighter with less contention and if moreover everyone does this your attestation will get earlier and safer into blocks.",
        "created_at": "2024-04-15T11:29:53.410000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Agree, but once you have \u003e2048 validators then it wouldn't make much difference.",
        "created_at": "2024-04-15T11:30:32.383000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "yes, you can' t have effective balance changes being immediate, that's why we churn both in deposits and exits.",
        "created_at": "2024-04-15T11:30:42.616000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "We can't have major changes (to or from 0), but we can we have partial changes?  Or does that upset shuffling too much (although if that were the case, could they only change on epoch boundaries to avoid the issue).",
        "created_at": "2024-04-15T11:31:45.149000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "right for the running node, but not for the attestations making it on-chain. If you send just a few already aggregated messages those attestations are much more likely to be included than single bit attestations floating around after a reorg",
        "created_at": "2024-04-15T11:31:52.611000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "They only change on epoch boundary, but still we churn them.",
        "created_at": "2024-04-15T11:32:23.613000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "What do you mean by \"already aggregated\"?  I didn't think that we were allowing validators to aggregate attestations themselves (although I'd be very happy if that were to change, but get that it would require additional work with the signature).",
        "created_at": "2024-04-15T11:33:14.765000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I meant that if you hold say 2048*N keys, you will be sedning N messages instead of 2048*N such messages. Those \"big bit\"  attestations are much more likely to be included than single bit ones",
        "created_at": "2024-04-15T11:34:19.212000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "ahhh crap, discord italizized everything between the \\dot = \\* signs",
        "created_at": "2024-04-15T11:35:48.900000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "But they're both single-bit attestations, no?  They just have more weight due to the balance behind the validator.\n\nAnd thinking about it, isn't it a worry that an aggregate with the correct vote could be not included, whereas a partially incorrect vote could, due to the incorrect aggregate having more weight and so being worth more overall?",
        "created_at": "2024-04-15T11:36:57.187000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "yeah they are both single bit... but still it' s more valuable for me to include the big one than a single (small) bit one (unless I can aggregate it)",
        "created_at": "2024-04-15T11:38:22.335000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I didn' t get the issue of the weights here, attestations are only worth for the proposer when they are right",
        "created_at": "2024-04-15T11:39:19.964000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Say you had one aggregate with 128 correct (head, target) votes, but the validators are all 32 ETH validators.  And you have another aggregate with 3 partially correct (incorrect head, correct target) votes but with each validator being a 2048ETH validator.  The second aggregate is worth more to the proposer than the first, but doesn't have any correct head votes.",
        "created_at": "2024-04-15T11:50:52.543000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "well, yeah but rewards are actually compatible here, the second one is more valuable for the network as well to be included, since it helps to justify the target.",
        "created_at": "2024-04-15T11:53:04.365000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "In the extreme, though, we could end up with minimal (or 0) correct head votes due to this.  This isn't a concern?",
        "created_at": "2024-04-15T11:56:14.251000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I don't think it is, if attestations fit today, they'll continue fitting on Max EB. Bad inclusion happens always when there is a mandatory \"bad\" head vote since it happens on inclusion distance \u003e 1. I get your point that LMD can be affected by this, but I don't think this is really an issue.",
        "created_at": "2024-04-15T11:58:31.137000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Forkchoice is still off-chain and validators will count attestations even if not included.",
        "created_at": "2024-04-15T11:59:11.126000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I guess it depends on many things. Lido is saying that they will be submitting several hundred withdraw requests every 24 hrs. And operators likely will submit them in batches",
        "created_at": "2024-04-15T19:10:08.920000+00:00",
        "attachments": null
    }
]