[
    {
        "author": "philngo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Hey \u003c@688748669268132001\u003e \u003c@554799849288105986\u003e , I got a question for you in regards to custom ceilings... if we don't implement it in Electra, what is the complexity of adding that feature into a future hard fork? And what would that look like from a staker's perspective since by that time any 0x02 validators would already have a maxEB of 2048? cc: \u003c@731289513942450317\u003e",
        "created_at": "2024-04-11T02:07:40.158000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Has anyone published the rationale for the estimation on the number of transactions that we'd be averaging for partial withdrawals if we didn't have any custom ceilings?",
        "created_at": "2024-04-11T13:26:18.236000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Consensus Layer",
        "parent": "",
        "content": "also curious",
        "created_at": "2024-04-11T13:27:55.510000+00:00",
        "attachments": []
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Hi \u003c@578356786889752586\u003e Will be there a breakout room for maxEB today?",
        "created_at": "2024-04-11T14:43:08.295000+00:00",
        "attachments": []
    },
    {
        "author": "philngo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Tuesday at 1200 UTC is the next call: https://github.com/ethereum/pm/issues/1012",
        "created_at": "2024-04-11T15:25:27.354000+00:00",
        "attachments": []
    },
    {
        "author": "philngo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Based on Call #4, Lido estimated that it won't be often that node operators will skim balances: https://hackmd.io/@philknows/Sy2kQAq1C. We should encourage more response from other pools here",
        "created_at": "2024-04-11T15:31:18.066000+00:00",
        "attachments": []
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Thanks!",
        "created_at": "2024-04-11T15:40:44.717000+00:00",
        "attachments": []
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah. But it's hard to know where to find all staking pools in one place--I tried asking for a Telegram community for staking pools (e.g., similar to what Ethstaker does for solo stakers), but turned up no leads. I could make a tweet and tag a few staking pools, though.\n\nAlso, does this feature seem more important for solo stakers for whom paying gas fees for partial withdrawals has more impact? I'd send a message to the Ethstaker group to run a mini-survey, but my Reddit account is still under a shadow ban. \u003c@731289513942450317\u003e could help here.",
        "created_at": "2024-04-11T15:44:37.146000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "There's nothing as to rationale in that: it's explicitly stated as a guess",
        "created_at": "2024-04-11T15:55:09.410000+00:00",
        "attachments": []
    },
    {
        "author": "philngo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yes it's definitely more of a feature requested by solo stakers as they benefit more from the partial sweep by setting a ceiling lower than 2048. So it'd be good to at least get indications from the most likely users (pools) of partial withdrawals about how often they would use it. I believe \u003c@731289513942450317\u003e is working on something to gather more feedback from solo stakers",
        "created_at": "2024-04-11T15:55:21.814000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I don't even understand why solo stakers will benefit from this",
        "created_at": "2024-04-11T15:56:02.303000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I am a solo staker and definitely don't want this, I will compound my validators and will withdraw whenever I need money, I don't see why solo stakers will want to have this done automatically",
        "created_at": "2024-04-11T15:57:12.255000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Gas savings is not it IMO",
        "created_at": "2024-04-11T15:57:38.421000+00:00",
        "attachments": []
    },
    {
        "author": "philngo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think it partially is. But UX of the sweep is also useful for some. It just works without much intervention. 2048 ceiling in order to benefit from the sweep is useless to a lot of us individuals",
        "created_at": "2024-04-11T16:04:13.910000+00:00",
        "attachments": []
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah! That's the part I forgot to mention. Solo stakers will need to get to 2048 ETH under the current design before they can benefit from the sweep. I think the idea of receiving automatic withdrawals without, say, setting up a daemon/bot or worrying about sending an on-chain transaction to withdraw may sound compelling to some stakers? Depends on what \u003c@731289513942450317\u003e turns up, though.",
        "created_at": "2024-04-11T16:11:37.829000+00:00",
        "attachments": []
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The question imo would be: do solo stakers benefit from skimming in the status quo? If it's an overwhelming yes, then keeping it in should incentivize consolidation among solo stakers because they can sidestep waiting until \u003e 2048 ETH to skim rewards for free.\n\nMy two wei, though.",
        "created_at": "2024-04-11T16:13:57.158000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "A little bit of history here should give some perspective: the only reason we have the skimming is because we didn't have a mechanism to send partial withdrawals in Capella. We did not want to add an extra messaging layer on the CL and we assumed this would have to be solved anyway eventually with 7002. Skimming was just an interin solution to prevent the horrible UX of having to remove the whole validator and redeposit. In a world with 7002 and Max EB, we could in principle remove completely skimming and ONLY do full withdrawals from the CL. IMO in this fork we should aim for the interim solution of continuing skimming 0x1 vals and not apply these custom ceilings that seem mostly useless and extra techdebt without much proof that they help in a considerable way",
        "created_at": "2024-04-11T16:20:48.736000+00:00",
        "attachments": []
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "That's good context. So, since EIP-7002 already allows for partial withdrawals (of arbitrary amounts over 16 ETH), the automated skimming for \u003e 32 ETH validators isn't necessary since they can set up infra on their side to withdraw periodically? I can definitely see where you're coming from, especially now that EIP-7251 has a lot of moving parts right now.\n\nLet me get in touch with a few people who've self-identified as solo stakers in Twitter and see if they can run a poll to gauge sentiment. Twitter polls wouldn't be the most accurate, but it could help to an extent. I guess the most concern I'll see here is that we don't include custom ceilings now because no one seems to be speaking for it, but Pectra launches and suddenly everyone is clamoring for the feature (then it needs to come in a separate fork).\n\nIt'll also depend on how much R\u0026D overhead that particular feature incurs. If it's something that can be thrown in w/ other features, then hedging bets by including it doesn't sound terrible. If it's major, knowing someone has an immediate use for it is definitely important.",
        "created_at": "2024-04-11T17:25:37.032000+00:00",
        "attachments": []
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003c@578356786889752586\u003e: Is the deposit frontrunning mitigation feature proposed by the Lido team going into the EIP-7251 spec as well? I heard it was big enough to make it into a separate EIP.",
        "created_at": "2024-04-11T17:26:48.946000+00:00",
        "attachments": []
    },
    {
        "author": "philngo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Last I heard about it from breakout #4 was that \u003c@688748669268132001\u003e was working with Lido to include another EIP that mitigates the front-running. Haven't seen anything from it yet.",
        "created_at": "2024-04-11T18:42:10.244000+00:00",
        "attachments": []
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "That makes sense. Here's the document from Lido with the proposed design: https://hackmd.io/@lido/S1gtK9q1C\n\nIf the EIP was done up in the next few months, would it be included in Pectra? Btw, I left some comments about the sync committee slashing EIP on your Twitter. Can I send a DM on Discord with the information instead?",
        "created_at": "2024-04-11T18:55:14.132000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "There were other reasons as well. Not having to pay gas to (partially) withdraw was one, and avoiding having to manage a withdrawal queue was another.\n\nAllowing partial withdrawals from the consensus layer using an operation signed by the validating key would be something that would allow (non-custodial) staking services to continue to provide a similar service to what is available today.",
        "created_at": "2024-04-11T19:38:12.432000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Most solo validators have taxes to pay on the staking income, so purely compounding is often problematic from a financial perspective. Being able to withdraw some but not all earnings is of some interest, but I'm not sure that relative costs are in the favour of execution-layer-initiated withdrawals.",
        "created_at": "2024-04-11T19:44:05.404000+00:00",
        "attachments": []
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Now that I think of it, that's a great point. If a staker agrees to consolidate their validators, they'd need to sign for partial withdrawals all the time. But they can trade off instant withdrawals by choosing to (automatically) skim rewards at a set balance without needing to use the withdrawal key ever so often.\n\nThis is likely one reason I said to be careful about ditching the feature because \"no one seems to want it\". Your use-case is the first one I've heard that relies on automatic withdrawals, but there are likely other arrangements that depend on the feature too. And those people may be unaware until the EIP has shipped.",
        "created_at": "2024-04-11T19:55:24.709000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Non-custodial staking (service holding the validator key, ETH owner holding the withdrawal key) should definitely be considered, it's a pretty common situation.",
        "created_at": "2024-04-11T19:56:44.660000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Let's put some actual numbers to this, a typical withdrawal today is about 18 000 000 Gwei every 8.6 days. I don't know the gas cost of the withdrawal for 7002, but if it's even compatible with transfers of 21 000 this is absolutely negligible to keep the exact same as today. If validators even compound then the cost will be one single transaction per all validators at the same time",
        "created_at": "2024-04-11T19:58:30.718000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I honestly think that all gas-related considerations are over blown",
        "created_at": "2024-04-11T19:58:44.921000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Even if we assume 21000 at current base fee that's ~2.5% of the amount you quoted.  I need to take a closer look at this stuff, but I suspect that the actual cost of the transaction will be significantly higher.  But I can't find a version of 7002 that allows partial withdrawals; any pointers?",
        "created_at": "2024-04-11T20:03:54.500000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I don't follow the EL side so I can't help you, but from the CL side enabling partial withdrawals was trivial cause it only involved sending the amount in the tx. Not sure what the gas cost is. However: the above numbers need to be divided by the number of validators compounded (necessarily more than 1 ) and by the appropriate frequency",
        "created_at": "2024-04-11T20:06:46.940000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "In any case this can actually be rolled in stages if it does happen that validators send often these txs (which again I see no actual data pointing to it)",
        "created_at": "2024-04-11T20:08:06.372000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I would have expected the intersection of \na) Home validator that holds enough keys to make it worth to compound\nb) Needing to actually withdraw very often instead of using funds from elsewhere\nTo be close to zero.",
        "created_at": "2024-04-11T20:10:10.425000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Consensus Layer",
        "parent": "",
        "content": "it's here https://github.com/lightclient/7002asm\n\ni am working on an update to the eip now",
        "created_at": "2024-04-11T20:11:09.270000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Institutional validators that are in the middle range of say 1024 ETH instead of 2048, those may be a bit more, but then again a single transaction is zero gas compared to what they withdraw",
        "created_at": "2024-04-11T20:11:09.310000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I disagree with that.  If a home validator can compound by incrementing their validator in 1 ETH increments then they'd be more likely to have very little additional funds so would need to access rewards.",
        "created_at": "2024-04-11T20:11:47.473000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "There is also the point that this requires signing by the withdrawal address, where at current this happens automatically.",
        "created_at": "2024-04-11T20:12:12.139000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "yeah, there's no doubt that for validators that need to withdraw often this is a \"convenience\", I don't deny that. I claim that this is just too much of a hack (encoding values within the zero bytes of a slice), and complication, and adding spectests and techdebt to guarantee this convenience.",
        "created_at": "2024-04-11T20:14:58.856000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "So the plan is to remove the current skimming system and only allow withdrawals from the EL side (once validators have consolidated, anyway)?",
        "created_at": "2024-04-11T20:15:59.883000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "no, that's not the plan",
        "created_at": "2024-04-11T20:16:13.171000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Skimming remains AFAIK, what I don't want to add is the custom ceilings",
        "created_at": "2024-04-11T20:16:37.812000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I would eventually like to remove skimming though, but for that there's no consensus nor has it been discussed officially AFAIK",
        "created_at": "2024-04-11T20:17:12.929000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I tend to agree at first thought that the custom ceilings seem to be a bit of a waste of time.",
        "created_at": "2024-04-11T20:17:14.155000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "But if (for example) two validators are consolidated, no skimming will take place under the current proposal?",
        "created_at": "2024-04-11T20:17:41.631000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "that's right, if two validators are consolidated there won't be skimming. This will be my situation for example",
        "created_at": "2024-04-11T20:18:26.484000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "That's going to be a problem for non-custodial staking.",
        "created_at": "2024-04-11T20:18:55.024000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "IMO we don't really care about the few homestakers that have 2 keys to consolidate",
        "created_at": "2024-04-11T20:18:55.796000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "we care about the large stakers holding thousands to do so",
        "created_at": "2024-04-11T20:19:04.031000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Ahh I imagine that service providers will have to do something with their accounting if they want to use this",
        "created_at": "2024-04-11T20:19:46.572000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Or they just won't consolidate, which defeats the purpose as far as I can see.",
        "created_at": "2024-04-11T20:38:25.700000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Is there a specification somewhere?  I'd hoped my days of reading assembly were (far) behind me.\n\nMainly trying to understand gas costs, so the obvious questions are around storage.",
        "created_at": "2024-04-11T20:39:28.903000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Consensus Layer",
        "parent": "",
        "content": "the gas costs are roughly the same as in the current spec, we continue packing the data into 3 storage slots which make up a single time in the queue",
        "created_at": "2024-04-11T20:40:27.824000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Consensus Layer",
        "parent": "",
        "content": "generally that should be around 5k per slot because the slots are never cleared, they’re just over written and then queue indices are manipulated",
        "created_at": "2024-04-11T20:42:03.268000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Well, yeah, it's again a trade-off of complexity for a convenience of some validators. If there's data that points towards supporting the extra convenience I'm all for it. But in general I think we need to have these numbers to justify the change, instead of doing the change because some such custodial service exists",
        "created_at": "2024-04-11T20:47:31.398000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Not sure what that data would even look like: given that we aren't in a situation where it's possible to consolidate today it's going to be pretty hard to know how many validators won't consoildate at some point in the future.",
        "created_at": "2024-04-11T20:49:43.315000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I figure that this is the time to raise these issues, though.  If there are going to be one-off changes such as consolidation that will remain around as tech debt well after they are useful, then having something that has use for the entire validator's lifespan seems reasonable.",
        "created_at": "2024-04-11T20:51:45.341000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "More than not consolidating the issue here is how many won't because of the lack of skimming",
        "created_at": "2024-04-11T20:51:47.984000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "How many will actually take this feature as the tipping point?",
        "created_at": "2024-04-11T20:52:15.089000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I do need to take a look at the spec, but are there any advantages to stakers (as opposed to validators) in consolidating at current?  I'd need to look at them to see what there is, but if consolidating results in a net worse experience (and, commonly, changes from what people are used to are seen as initially negative so there need to be positives to outweigh them) then it's going to be a tough sell.",
        "created_at": "2024-04-11T20:54:36.190000+00:00",
        "attachments": []
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Speaking of data points, I asked a few contributors from Lido about custom ceilings and got this response:\n\n\u003e Can’t imagine any pool not being pro\n\n\u003e It’s a  huge cost savings compared to having to pay for a 7002 withdrawal.\n\n\u003e Plus it allows for organic form of stake reallocation but not all pools benefit from this.",
        "created_at": "2024-04-11T21:19:38.135000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Pools are different beasts from staking services, of course.  I can somewhat see it being useful for pools, but I'd imagine that if custom ceilings didn't exist they'd just top up validators to the new max effective balance and carry on as they do today.",
        "created_at": "2024-04-11T21:22:48.867000+00:00",
        "attachments": []
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The way I see things now, we have three different groups of stakers that may have different reasons for wanting custom ceilings:\n\n- Solo stakers: Will gas costs for accessing partial rewards add up over time? I think there was a feeling partial withdrawals would be free and not compete with full withdrawals, which isn't the case now.\n\n- Institutional staking services: \u003c@144468805697929216\u003e's point about skimming for consolidated validators is worth considering imo. Having to sign for partial withdrawals with WCs frequently--is that a tradeoff staking services are willing to accept?\n\n- Staking pools: Gas savings from automatic withdrawals also figure into the equation here. I think some pools have the automatic rewards flow baked into the stake reallocation process, so rewards come in → new validator is deposited → operator is assigned validator (I'm probably mangling things up a bit).\n\nSo, ideally, we'd need numbers from three different sets of players.",
        "created_at": "2024-04-11T21:29:05.734000+00:00",
        "attachments": []
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Staking 2048 ETH is probably a great leap of faith for most pools. I expect most will start out small (e.g., 128 ETH, 640 ETH, etc) and only complete full consolidation when DVT is  battle-tested enough. So, some skimming below 2048 ETH will likely be necessary.",
        "created_at": "2024-04-11T21:31:37.747000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Solo stakers will usually have to pay tax.  Obviously this is quite country-dependent, but there are various reasons why you may not be able to consider rewards in address A to be the same as ETH in address B, especially when one is on the consensus layer and the other on the execution layer.  But if they want to consolidate then they are likely to want to take a portion of the rewards each tax period, rather than either all or none of them.  So I don't see how custom ceilings help here.",
        "created_at": "2024-04-11T21:34:27.179000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I can't speak for every staking service, but those that are non-custodial (and realistically all institutional ones will be) are currently in a situation where staking rewards are returned automatically to the ETH holder.  Requiring additional work to obtain the rewards is not something that these entities are likely to be interested in undertaking.  The keys that protect these funds are often heavily secured, making any relatively frequent requirement to sign onerous.  I think that the question they would ask here is \"why would I bother signing withdrawal requests when I can leave the validators at 32 ETH and the rewards come back to me automatically?\"",
        "created_at": "2024-04-11T21:39:38.854000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I can't talk to staking pools.",
        "created_at": "2024-04-11T21:39:43.017000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e t’s a  huge cost savings compared to having to pay for a 7002 withdrawal.\nI claim that's blatantly false, I want to see the actual numbers, a pool with 100 validators will need to pay 0.2% in 8 days **if they don't propose a single block** which will not happen ever.",
        "created_at": "2024-04-11T21:39:59.789000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "instead of just guessing over here, I want to see what the frequency and values of required withdrawals will actually be. I don´t buy any of the above and it sounds to me like this is just *yeah, it'll save us from doing some special accounting*",
        "created_at": "2024-04-11T21:41:30.019000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Given what was said above aren't the numbers roughly 40K gas for a withdrawal transaction?  So around 5% of rewards for a single validator at 32 ETH withdrawing every 8 days, and scaling accordingly.",
        "created_at": "2024-04-11T21:42:21.538000+00:00",
        "attachments": []
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "And what makes this problematic imo is that it's harder to know who didn’t consolidate--especially if it's an institutional staking service, not a DAO w/ public metrics (or at least a visible way to cluster validators run by the same pool). So companies could quietly choose to run 32 ETH validators and never consolidate...even if they're running thousands of validators atm.",
        "created_at": "2024-04-11T21:43:35.439000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "that's the point, a 100 consolidated validator will make aprox 180 000 000 Gwei in that time **plus all execution and consensus earnings from blocks**",
        "created_at": "2024-04-11T21:43:38.222000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "so we are talking several orders of magnitude more for just 40K Gwei, this is zero",
        "created_at": "2024-04-11T21:44:00.643000+00:00",
        "attachments": []
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "So, it'd need to be an actual data job and not informal heuristics? I think we've been mostly guessing as to who needs or doesn't need it, but it ultimately boils down to economics.",
        "created_at": "2024-04-11T21:45:05.426000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Definitely, but I think the work is in producing the data to justify the complexity, not the other way around. At any rate my napking math is infinitely better than \"huge savings..\"",
        "created_at": "2024-04-11T21:46:30.963000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I don't think that execution rewards are relevant, given that they will come in on the execution chain regardless.\n\nI think that the gas fees may be less relevant than the fact that an action is required to obtain the rewards, in the use case I'm looking at.  But we've seen gas prices at 10-50x where they are right now, so picking a single figure and saying that it's cheap isn't taking into account the possible situations out there.",
        "created_at": "2024-04-11T21:47:35.337000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "(If partial withdrawals could be consensus layer operations this whole discussion would vanish.)",
        "created_at": "2024-04-11T21:48:07.478000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e I don't think that execution rewards are relevant, given that they will come in on the execution chain regardless.\nAhh that's right... it's only the consensus part of the blocks",
        "created_at": "2024-04-11T21:48:23.292000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e I think that the gas fees may be less relevant than the fact that an action is required to obtain the rewards, in the use case I'm looking at\nYes, this is something I agree with",
        "created_at": "2024-04-11T21:48:49.239000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "At any rate, I would favor a new list in the beacon state with 6-11 bits per validator to encode a number between 32 and 2048 for these ceilings instead of overloading the withdrawal credentials",
        "created_at": "2024-04-11T21:52:17.869000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Having skimmed the spec it looks like there really isn't any incentive for stakers (i.e. those putting in ETH, separate to those running the validators) to consolidate.  Having to go through the hassle (and maybe expense) of execution layer transactions for partial withdrawals (assuming they aren't at 2048 ETH, which was mentioned above as being apparently unrealistic to begin with) and having more ETH at risk in a slashing event seem to be the downsides.",
        "created_at": "2024-04-11T21:55:46.129000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "(The initial slashing penalty has moved from being a slap on the wrist to being a hard stare, but that appears to be regardless of if the validator is consolidated or not.  That's the only significant change I can see.)",
        "created_at": "2024-04-11T21:57:13.715000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "There's an incentive for stakers to push operators to consolidate since the rewards will be higher the more operators consolidate",
        "created_at": "2024-04-11T22:02:41.916000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "On what basis?",
        "created_at": "2024-04-11T22:03:12.155000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "As far as I can see two separate validators with the same votes will have the same rewards as if those two validators were consolidated.  Where do the higher rewards come from?",
        "created_at": "2024-04-11T22:04:08.417000+00:00",
        "attachments": []
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The automatic part of the skimming process is something we shouldn't underrate as well. Staking pools can operate infra to perform partial withdrawals, but I expect a solo staker doesn't have something similar.",
        "created_at": "2024-04-11T22:05:51.818000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Most of the missed attestations are due to reorgs and late blocks: validators struggle to reinsert attestations either because of failing to pack them or bad aggregation. If every pool consolidates we would go back to less than 1% bad head votes",
        "created_at": "2024-04-11T22:06:29.279000+00:00",
        "attachments": []
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Best thing I can see is that excess ETH doesn't sit in the withdrawal queue when maxEB exceeds \u003e 32 ETH.",
        "created_at": "2024-04-11T22:08:06.344000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Late blocks don't just come from network overload, we live in a world where relays are the critical path for most blocks and they don't deal with attestations themselves.\n\nBut even if that were totally true it leads to a tragedy of the commons: the best solution is for me to let everyone else consolidate, and me to keep my validators separate.  But that's true for everyone, so no-one will consolidate.",
        "created_at": "2024-04-11T22:09:20.896000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "It can allow faster increases in effective balance, yes, but I think I ran some numbers on that a while go on ethresearch and the difference over a period measured in single-digit years wasn't significant.  Compounding will always win over a long enough timeframe, but you know what they say about the long term.",
        "created_at": "2024-04-11T22:14:10.228000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I don't mean that late blocks will stop coming. I mean that the effect they cause on reorgs and less profitable attestations which make them less likely to be included is highly attenuated if everyone consolidates",
        "created_at": "2024-04-11T22:18:10.622000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Is this a fork choice thing?  I really must go read up on that one day...\n\nBut regardless, that still sounds like an \"other people\" problem.  No-one is jumping up and down with the level of reorgs and sub-optimal attestations we are seeing today, as far as I'm aware, so getting people to consolidate to fix it still sounds unlikely to happen without some sort of benefit to themselves (or, at the least, a neutral outcome for them).",
        "created_at": "2024-04-11T22:21:56.225000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I'm also not convinced by the statement about benefits: I'm a small staker and I will consolidate. My biggest problem is having different withdrawal addresses. I was hoping for a system that allowed me to consolidate to a different one",
        "created_at": "2024-04-11T22:22:21.927000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think there may be some optimal out-of-protocol strategies if 7251 comes in as-is, but I don't see it being any sort of slam dunk in terms of people consolidating.  The increased slashing event impact (with correlation penalty) could be enough to put most people off all by itself.",
        "created_at": "2024-04-11T22:29:14.138000+00:00",
        "attachments": []
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I honestly don't want they say about the long term. I think there's some hidden wisdom there, though. I'd like to know.\n\nOn a related note, I'd probably weigh up being able to stake 40 ETH vs. needing to stake exactly 64 ETH as a boost. Even if the rewards are small.",
        "created_at": "2024-04-11T22:31:02.082000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\"In the long run we are all dead.\"  Looking at compounded returns over a long period appears good, but reality is likely to cause much larger pertubations in the meantime.\n\nStaking an additional \u003c32 ETH is something that becomes possible, but the question is why someone would consolidate their validators so they have multiples of 32 ETH by definition.  The remainder may or may not be significant, but in most larger cases it wouldn't and they're the entities that will need to consolidate to bring the total number of validators down significantly.",
        "created_at": "2024-04-11T22:34:29.676000+00:00",
        "attachments": []
    }
]