[
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "From the r/ethstaker Discord: https://www.reddit.com/r/ethstaker/comments/1c18tav/max_effective_balance_custom_ceiling_discussion/",
        "created_at": "2024-04-13T06:07:37.843000+00:00",
        "attachments": null
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "It didn't attract lots of comments (simply because it's hard to coordinate the community), but I think this one captures what most solo stakers think:\n\n_\"I think that a custom ceiling must be included for solo validators.\n\nWHY?\n\nI think it's important for the Ethereum protocol to help solo validators as much as possible.\n\nSolo validators are the lifeblood of Ethereum. They are the most decentralized in terms of geography, internet provider, hardware, and client distribution. In my opinion the solo validator community is the most aligned to Ethereum because they are choosing to forgo the benefits of pooling their stake for what can be presumed decentralization's sake. Additionally, they retain their voting power and don't delegate it to these huge pools that can potentially be swayed to chase short-term profits to the long-term detriment of Ethereum.\n\n2. The manual withdrawal mechanism can be spammed by large actors to the detriment of small actors whether it be solo validators or smaller competitor pools.\n\n\"If we do not have a custom ceiling, then partial rewards must be manually withdrawn as a new type of transaction. There would be a target of 2 withdrawals per block with a fee mechanism like EIP-1559. It would be a real shame if large pools 'nudged' smaller pools or solo validators to consolidate with the big pools by keeping the fee to withdraw high. Additionally, there are a lot of validators, so even honest withdrawals would keep that fee high.\n\n\"Finally, we know that pools are likely to use these transactions because they are not likely to consolidate their validators to the max 2048 for slashing protection. They are likely to consolidate maybe 10-20 validators so let's say 320 ETH. They would need to withdrawal ETH every time a user wanted their ETH back, or every time a consolidated validator needed to be brought back down to their 320 ETH comfort zone.\"_",
        "created_at": "2024-04-13T06:10:08.049000+00:00",
        "attachments": null
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Is there a precedent for gathering data on which features will be included? I mean, someone could run a full-blown survey, but I thought most decisions came down to rough consensus and making assumptions with limited information?\n\nI don't which EIP it was, but I recall Danny saying something like \"we don't know what this will do yet, but it feels too useful to leave out.\" I feel that probably applies here as well: more info will come in, but for now, it looks like there are more reasons to include the custom ceiling than there are to exclude it.",
        "created_at": "2024-04-13T06:17:38.286000+00:00",
        "attachments": null
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I had a conversation with someone I believe probably runs a few solo validators about the custom ceiling. Same arguments around quality of life and convenience \u003c@144468805697929216\u003e mentioned.",
        "created_at": "2024-04-13T06:18:58.846000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "Screenshot_20240413-021658.png",
                "content": "0fda6010cc79340e289ddfe58652d62467dde1d9b4ee6f2029715fb003b33139"
            }
        ]
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Autocompounding feels like a low-risk, medium-return activity for solo stakers. As in, if I stake 45 ETH, I'll earn more (at the risk of getting slashed for higher amounts if I commit a slashable offense). But what's the alternative? Save up until I have 32 ETH and fund a new validator (the ETH withdrawn to the EL doesn’t earn rewards while I'm saving up as well).\n\nIt's not a lot, but it doesn't leave stakers worse off. I think in any situations, the more money you have, the more benefits you can extract from any activity--compounding rewards being an example.",
        "created_at": "2024-04-13T06:23:26.816000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think that we're talking about different things, I was discussing consolidation not custom ceilings.\n\nI know that the protocol folks won't like it so much, but rather than custom ceilings a far more useful function would be for the sweep to withdraw a percentage of rewards earned since the last sweep.",
        "created_at": "2024-04-13T10:30:27.282000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "This can then be set anywhere from 0 to 100, with 0 being fully compounding and 100 being fully sweeping.  And if I have to pay x% tax on my staking rewards I can set it to x and have the benefits of maximum compounding within the bounds of my tax requirements.\n\n(You can argue that there are various realities that may make this non-optimal, e.g. tax paid annually, but it's a more flexible option than the custom ceilings being proposed, and works well when paired with EL-based withdrawals.  It should also be relatively easy to fit into the current sweep system.  Downside is that there will need to be another list in the state of the validator balances at the last time a sweep was carried out.)",
        "created_at": "2024-04-13T10:38:01.387000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Hmm, I can see the usefulness of this for tax purposes for example. Problem is you need to keep two new  validator size lists for this. The percentage they want and the last sweep's balance.",
        "created_at": "2024-04-13T10:54:11.257000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yep.  But it's only one more than the custom ceilings suggestion.",
        "created_at": "2024-04-13T10:54:41.653000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think I've been quite vocal of protecting home stakers generally so I doubt anyone will take this as malice, but I really think solo stakers are not the target of Max EB. This feature is purely to reduce bandwidth and aggregation time and home staker adoption is not something that is critical to that.",
        "created_at": "2024-04-13T10:58:50.721000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah as per above I think that consolidation and compounding are two different things.  But MaxEB was sold as a Good Thing for solo stakers, so I think that it needs to have something in there for compounding.",
        "created_at": "2024-04-13T12:19:07.866000+00:00",
        "attachments": null
    },
    {
        "author": "nixo.eth",
        "category": "Consensus Layer",
        "parent": "",
        "content": "fwiw, solo stakers are quite engaged in that subreddit. if there aren't a lot of comments on the discussion post, i would say that it's lack of interest and demand",
        "created_at": "2024-04-13T12:23:55.693000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Or understanding as to the implications.",
        "created_at": "2024-04-13T12:24:18.467000+00:00",
        "attachments": null
    },
    {
        "author": "nixo.eth",
        "category": "Consensus Layer",
        "parent": "",
        "content": "help me educate - i painted the biggest cons as:\n- Once your ceiling is 2048, you can never decrease it. Ceilings are up-only\n- Partial withdrawals cost gas\nam i missing anything?",
        "created_at": "2024-04-13T12:25:10.209000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Increased penalties if your large validator is slashed, compared to having a small validator slashed and then being able to stop validating before other validators are slashed as well.",
        "created_at": "2024-04-13T12:26:17.988000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "(Are ceilings up-only?  I haven't seen this bit of the spec, but I don't see a reason for this being the case.)",
        "created_at": "2024-04-13T12:26:46.137000+00:00",
        "attachments": null
    },
    {
        "author": "nixo.eth",
        "category": "Consensus Layer",
        "parent": "",
        "content": "not really aimed at solo stakers, though, right? that sounds more consequential for large operators",
        "created_at": "2024-04-13T12:26:52.829000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "It's for anyone that has \u003e1 validators.",
        "created_at": "2024-04-13T12:28:41.055000+00:00",
        "attachments": null
    },
    {
        "author": "nixo.eth",
        "category": "Consensus Layer",
        "parent": "",
        "content": "i still think it's minimal impact on small operators. if i have 2 validators, i'm either going to consolidate or not - custom ceiling doesn't really affect my slashing risk. with 3 validators, i could potentially consolidate into a 64 ETH validator and leave a 32 ETH validator to minimize slashing risk, but even then the 2 can be consolidated into a 2048maxEB while leaving the 32maxEB. so this probably doesn't really affect people until you have numbers that you can portion out. and even then, you could still portion out into multiple 2048maxEB validators, right? if i have 10 validators, i could create 5 x 2048maxEB validators?\n\nstill seems like large operator concerns to me (i'm just trying to accurately represent the pros and cons to solo stakers)",
        "created_at": "2024-04-13T12:36:24.040000+00:00",
        "attachments": null
    },
    {
        "author": "nixo.eth",
        "category": "Consensus Layer",
        "parent": "",
        "content": "scratch the 10 -\u003e 5 comment. that would require exiting if they all have the same withdrawal cred",
        "created_at": "2024-04-13T12:39:42.089000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "If you have 2x32 ETH validators and one is slashed, you may have some time (between 0 and 62 slots) in which you can stop your validating systems before your other validator is slashed (assuming a systemic issue).  If you have 1x64 ETH validator then your entire stake is slashed without a chance for you to protect some of your funds.",
        "created_at": "2024-04-13T12:40:02.222000+00:00",
        "attachments": null
    },
    {
        "author": "nixo.eth",
        "category": "Consensus Layer",
        "parent": "",
        "content": "but if you have 2x32ETH, increased slashing risk doesn't factor in. because you can't create a new validator with a custom ceiling. you don't have enough ETH to make up 2 new validators, one with a custom ceiling. you're either going to consolidate or not",
        "created_at": "2024-04-13T12:42:28.424000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Perhaps I'm misunderstanding custom ceilings, but if you have 2x32 ETH validators why can't you consolidate them into a single MaxEB validator with whatever ceiling you desire?\n\nThe benefit of doing so is that you will compound your rewards faster.",
        "created_at": "2024-04-13T12:45:23.706000+00:00",
        "attachments": null
    },
    {
        "author": "nixo.eth",
        "category": "Consensus Layer",
        "parent": "",
        "content": "you can, but your slashing risk is going to be the same with or without custom ceilings",
        "created_at": "2024-04-13T12:45:59.479000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I assumed that you cannot have custom ceilings without consolidating validators, perhaps I'm wrong.  Is there a spec for custom ceilings somewhere?  I haven't seen one.",
        "created_at": "2024-04-13T12:48:34.144000+00:00",
        "attachments": null
    },
    {
        "author": "nixo.eth",
        "category": "Consensus Layer",
        "parent": "",
        "content": "i haven't seen one. but i think yes - in the case where custom ceilings existed, you'd have to go to 0x02 credentials to take advantage. i think i saw there was a necessary 1 ETH deposit to go to 0x02",
        "created_at": "2024-04-13T12:51:25.353000+00:00",
        "attachments": null
    },
    {
        "author": "nixo.eth",
        "category": "Consensus Layer",
        "parent": "",
        "content": "there's a writeup of informal discussion on custom ceilings here though: \u003chttps://hackmd.io/@philknows/BJCaLJf1A\u003e",
        "created_at": "2024-04-13T12:52:24.547000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Thanks.  Odd that for \"How do individual validators update to 0x02 compounding\" there appears to be no discussion aroud a beacon chain operation to do this when that seems the obvious place to do so.",
        "created_at": "2024-04-13T13:01:30.303000+00:00",
        "attachments": null
    }
]