[
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "It would be good to know validators per owning entity distribution to estimate potential effect of consolidation of validators run by such services. Could it be the case that most of the validators they run belong to different entities which prevents achieving high consolidation levels within such services in principle?",
        "created_at": "2024-04-12T09:37:57.202000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I can't speak to the others, but certainly for Attestant there is a lot of potential for consolidation.",
        "created_at": "2024-04-12T09:41:43.591000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Do you think that with the existing 7251 design Attestant would not consolidate?",
        "created_at": "2024-04-12T09:42:43.761000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "It would be up to our customers, but I don't think that we would recommend it.  There are no benefits to the customer, it would likely result in them having to sign additional transactions (which would be additional effort and/or cost to them) and any slashing event would have a higher impact if their validators were caught in it.",
        "created_at": "2024-04-12T09:59:20.727000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Could you please elaborate more on the slashing impact? And how many validators are run per node on the average?",
        "created_at": "2024-04-12T10:01:44.133000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "If you have 32 separate validators each running with 32 ETH and there is a slashing event due to local operational issues, the chances are that only 1 or 2 of the validators will be caught up in it before the issue is picked up and validating shut down, so 32 or 64 ETH worth of stake is slashed.  If you only have a single validator with 2048 ETH then as soon as the slashing event occurs you have 2048 ETH worth of stake slashed.\n\nObviously this varies with the number of validators, but I don't think that there is ever a situation where consolidating validators can result in the same level of risk as not consolidating.",
        "created_at": "2024-04-12T10:05:16.006000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "What kind of rationale are you seeking for? I think that assuming no more than `MAX_PARTIAL_WITHDRAWALS_PER_PAYLOAD` transactions per block is reasonable. Currently this parameter is set to `8`, which allows for partially withdrawing 1M validators within ~18 days",
        "created_at": "2024-04-12T10:17:59.222000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I'm looking for rationale in how many actual transactions and how often validators will submit them to justify the custom ceiling feature. I think adding this just on a hunch is plain wrong",
        "created_at": "2024-04-12T10:27:51.213000+00:00",
        "attachments": null
    }
]