[
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "1. I think \u003c@755590043632140352\u003e does a better job of describing what I had in mind by \"operational complexity of managing so many keys\". Having to sign multiple attestations, participate in multiple committees, and send multiple messages, because you happen to run a large number of validators doesn’t seem ideal. At least, I'd assume any operations manager wants to reduce redundancy to a large extent (and validator consolidation helps cut down significantly on redundancy for node operators).\n\n2. Fair point on the appeal of autocompounding for solo stakers. After writing the article, I started to see autocompounding for solo stakers as more of a \"nice- to-have\" and not EIP-7251's killer feature. Like \u003c@755590043632140352\u003e mentioned, the key objective to reduce the validator set (it's nearing 1M validators based on a post I saw from \u003c@731289513942450317\u003e recently). But it's also not that disadvantageous for solo stakers imo, so it doesn't hurt if a small fraction of solo stakers (especially wealthier solo stakers) consolidate for that reason.\n\n\u003c@755590043632140352\u003e is more familiar with the validator set contraction effort, but IIRC EIP-7251 is the lesser of three \"evils\" (validator consolidation, validator set capping, and validator set rotation). Changing rewards formula as a way of disincentivizing growth in validator set has also been floated in the past, but the pushback against modifying the issuance curve (which was proposed for a different reason) is evidence that it won't really work out smoothly.",
        "created_at": "2024-04-17T02:46:52.562000+00:00",
        "attachments": null
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e I know there's some work on making sure two validators that share the same withdrawal address can be consolidated if an EL transaction signed by the withdrawal address makes it to the Beacon Chain. Is there a parallel effort to have _two_ withdrawal addresses (one for source validator and one for target validator) jointly sign a consolidation object--so two validators that don't same share the same withdrawal credentials can be consolidated?\n\nI'm assuming this might increase the scope of EIP-7251 (and that scope is large already), but is there a possibility the feature is included in another fork? That might allow RocketPool validators consolidate, for example.",
        "created_at": "2024-04-17T03:03:29.855000+00:00",
        "attachments": null
    },
    {
        "author": "eawosika",
        "category": "Consensus Layer",
        "parent": "",
        "content": "A poll (in the absence of empirical data) sounds great. \u003c@755590043632140352\u003e had concerns about making the decision to include partial withdrawals based on gut feelings alone. But if the biggest staking pools (e.g., Lido, RocketPool, etc.) ran polls and asked community members to engage, that should provide some evidence as to whether node operators consider the feature useful or not.",
        "created_at": "2024-04-17T03:05:48.146000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Are there notes from the last breakout session (#6) anywhere I can look at?",
        "created_at": "2024-04-17T05:43:59.034000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "There is no effort in this direction afaik. I for one, would be a user of such system if available",
        "created_at": "2024-04-17T09:43:24.056000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "i don't know if anyone took notes, but here is the recording: https://www.youtube.com/watch?v=J1i3WtLE-6o",
        "created_at": "2024-04-17T12:46:33.725000+00:00",
        "attachments": null
    },
    {
        "author": "philngo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I have rough notes that I took, wanted to double check with some people before posting for accuracy, but here it is: https://hackmd.io/@philknows/Hywht12eR",
        "created_at": "2024-04-17T13:11:53.285000+00:00",
        "attachments": null
    }
]