[
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ctrent_vanepps\u003e we're looking to start a call this week or next week. it will run at least for the next few months, to give a synchronous space for people directly contributing to this project\n\nto accommodate the relevant contributors, it would have to be around 11:30 UTC (21:30 AEST, 13:30 CET 7:30 EST), let's aim for Thursdays (every two weeks?)\n\nfirst question - \u003c@405860945018093609\u003e do evenings work for you? another alternative is we focus on 2/3 timezones and then rotate",
        "created_at": "2022-06-07T14:16:14.464000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdannyryan\u003e If and how to upgrade the ceremony at future hard forks is a bit of an open question — can you do so in way that facilitates applications being able to upgrade trustlessly?\n\nTwo options\n1. some sort of versioning inside the EVM so past and present commitments are available\n2. a proof of continunity of commitment to be given to individual applications to allow them to trustlessly migrate to new commitment (h/t @CarlBeek)\n\nBoth are worth considering a bit more in the coming months because extending the ceremony is certainly valuable",
        "created_at": "2022-06-07T14:20:50.107000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e can't we already support this using the versioned hashes?",
        "created_at": "2022-06-07T14:21:51.820000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdankrad\u003e the updated ceremony would simply get a new version",
        "created_at": "2022-06-07T14:22:17.264000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ctrent_vanepps\u003e i guess there's also the separate questions about the social / process infra about soliciting or accepting new contributions, running the coordinating server in perpetuity",
        "created_at": "2022-06-07T14:23:22.060000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e the idea would be to upgrade it every 5 years or so just to keep the list of contributors fresh. i think we can eat the process costs on that timescale",
        "created_at": "2022-06-07T14:26:23.593000+00:00",
        "attachments": []
    }
]