[
    {
        "author": "kwitro",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "@here",
        "created_at": "2022-12-20T17:14:25.808000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hey Thanks for comepleting the test ceremony 🙏 \n\n The real one will start in Q1 though the workflow will be the same.\n\nIf this were the real one, you would tweet out that you contributed to the ceremony. Then when the ceremony is completed, you'd make another tweet. \n\nAll of this information will be communicated to you 🙂",
        "created_at": "2022-12-20T17:21:26.647000+00:00",
        "attachments": []
    },
    {
        "author": "trent_vanepps",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "echoing kev's comment, this is just the test ceremony - if you're interested in participating at a deeper level, check out the grants round we are running - funding available for new implementations and unique entropy generation/collection!\n\nhttps://blog.ethereum.org/2022/12/15/kzg-ceremony-grants-round",
        "created_at": "2022-12-20T17:28:08.068000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e Now that we are getting closer to the start of the ceremony, we should probably do a few stress tests to ensure that in the worse case, the sequencer does not cough.\n\nI could do it locally, but its best to do it in an environment as close to the live environment as possible. (We cannot get parity because we will need to disable the OAuth checks)\n\nWe should be able to use the same machine for the sequencer which would consequently allow us to double check the logging infrastructure, and things like how do we diagnose if something goes terribly wrong.\n\nIf there are no objections, there are a few action steps:\n\n- Modify the sequencer to remove the spam checks and allow a user to repeatedly contribute\n- Launch sequencer with modified rust code\n- Spam the sequencer (using a CLI) in an attempt to take it down with different combinations of attacks (continuously request the transcript while continuously getting the contribution spot and not contributing for example)\n\nMarcin any thoughts on this or are there vectors that you are interested in exploring?",
        "created_at": "2022-12-20T22:50:13.953000+00:00",
        "attachments": []
    }
]