[
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e Hmm for me its the fact that contributors are battling for a spot to contribute, I think its more reasonable for us to find parameters such that the queue is not congested by people who go offline and contributors should give themselves enough time to contribute (We can give them an upper bound/worse case estimate).\n\nFor example, If there are 10K people in the queue for example and it is 10PM, they should join the next day. Moreover, the coordinator will be be requesting that the top K people ping every X seconds, so those who have gone offline should be cleaned up well before they even reach the front of the queue.\n\nIf we say that the top 1K needs to ping every 30 seconds, and all 10K of these contributors have gone to sleep, then it will take 10*30 seconds to remove all 10K offline contributors for example.\n\nSaying that I do think the lobby approach will have faster process times, because I assume that those who get into the lobby will have good internet connections, which (maybe falsely) I assume correlates with good hardware. (They could also just be closer to the coordinator server)",
        "created_at": "2022-09-04T00:02:48.307000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cRecmo\u003e My reasoning is that the only thing that matters is that at any given moment someone is participating, i.e. %time utilized. You only need a very short queue to coordinate and eliminate gaps between participants. So with a very short queue and alwys people in the lobby, reach this goal.",
        "created_at": "2022-09-04T01:59:10.915000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cRecmo\u003e How people coordinate outside of this small queue I would defer to the social layer. Let people self-regulate. Show a nice graph of what the busy hours are (i.e. #people in lobby) at different times in the day. Show a github-commit-history style chart over time, etc.",
        "created_at": "2022-09-04T02:00:43.871000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cRecmo\u003e Lobby count can be a heuristic. It doesn't really matter how accurate it is. Just need some busyness feedback to the people.",
        "created_at": "2022-09-04T02:02:44.890000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cRecmo\u003e I don't expect a lot of users to want to wait hours in line. I wouldn't. The ceremony is going to last months, I'll just check back in a week.",
        "created_at": "2022-09-04T02:03:51.603000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cRecmo\u003e If I try to participate a couple times during the three months and each time the lobby is super crowded and I give up, then the busy% must have been enormous and the ceremony a success without me.",
        "created_at": "2022-09-04T02:06:13.200000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cRecmo\u003e I don't think contributors are battling for a spot. There is an abundance of spots during the n weeks this thing will run. It's a matter of spreading load out over weeks. The 8h queue case is imho not very relavant for this.",
        "created_at": "2022-09-04T02:09:16.014000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cglamperd\u003e I like the lobby + short queue idea. We will need to defend against those attempting to game it by frequently pinging. We could have rate limits to deter that.",
        "created_at": "2022-09-04T02:12:47.031000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cRecmo\u003e Basic DDOS procection, but who cares if someone elbows their way in? Let them fight it out, contribute, and GTFO. They'll be done after a week, if not the first day.",
        "created_at": "2022-09-04T02:14:19.514000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cRecmo\u003e I guess there's some status in being one of the first contributors. We can keep that in check by launching silently and inviting people slowly before we publically ask.",
        "created_at": "2022-09-04T02:18:17.708000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cRecmo\u003e The assumption I'm working from is that there's plenty of time for every one to participate and we need to communicate that there's no need to rush into it. These are not devcon tickets, there's enough for everyone.",
        "created_at": "2022-09-04T02:19:57.403000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e \u003e \u003ckevaundray\u003e  Yeah I agree, though I don't think the wait times are mitigated with this approach. If I want to participate while other people want to participate, then I could also be waiting for long hours. In this case, its more of an active wait, where I'm trying to get in, every few hours.\n\nIf I rephrase the idea as a max queue size, I'd be okay with it, if the upper bound was something like six hours in the worse case. So given that each participant will have a maximum time of 2 minutes, the queue size would be ~200.\n\nThis would mean that if you are in a country where the internet is really bad, you are only competing for a position if the queue is long, in that case you can come back. This differs from having a max size which is more skewed towards time utilised where one could be competing for a position in the average case (re @Recmo: I don't expect a lot of users to want to wait hours in line. I wouldn't. The ceremony is going to last months, I'll just check back in a week.)",
        "created_at": "2022-09-04T12:11:30.706000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e \u003e \u003ckevaundray\u003e  Ah thats a good point, I was not under this assumption because we don't know how many people will be contributing, so I just took the worse case scenario (re @Recmo: The assumption I'm working from is that there's plenty of time for every one to participate and we need to communicate that there's no need to rush into it. These are not devcon tickets, there's enough for everyone.)",
        "created_at": "2022-09-04T12:12:33.851000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e Under that assumption, I'd agree with the statement that we should prioritise time utilised.  I guess to first confirm or invalidate that assumption, we'd need to jot down a goal for number of participants and how long the ceremony will run for",
        "created_at": "2022-09-04T12:17:38.412000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e Throwing some numbers out there; 100K in 6 months?",
        "created_at": "2022-09-04T12:18:02.061000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cdannyryan\u003e Min 5k, max 200k\n(Just really core Ethereum, extended Ethereum and even good external marketing)\n\nMin 3 months, max 1 year\n(Ceremony is delayed and 4844 production engineering is well underway, ceremony is launched significantly before 4844 prod engineering starts in earnest)",
        "created_at": "2022-09-04T14:17:19.831000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e With those numbers, that leaves plenty of time:\n\n- 3 months is roughly 130K minutes\n- Assume that each person will take 5 minutes to contribute (this is extremely conservative to account for bad actors wasting time)\n\nThen 3 months will fit in 25K participants atleast, in one year it would be atleast 100K",
        "created_at": "2022-09-04T14:28:48.048000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e I assume that there is a constant influx of contributors because if there is not, then there is no queue contention anyways and we have a different problem in that case; trying to get a minimum number of contributors",
        "created_at": "2022-09-04T14:29:13.470000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cRecmo\u003e my mental model is there will be peak hours and empty hours during each day. when the daily busy% starts to sag we can PR more people in. But honestly I have zero idea on how much attention this will draw.",
        "created_at": "2022-09-04T15:04:27.803000+00:00",
        "attachments": null
    }
]