[
    {
        "author": "af77",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hi 👋 I’m Andrew, a PO from the PSE team. Was thinking about additional vectors to secure the trusted setup through incentives and had an idea I’d like to humbly share.\n\nCurrently, if you know Tau you get the benefit of generating false proofs which you could use for your own gain. What if there was a way to tempt an attacker to reveal they know Tau?\n\nTo do this, contributors and/or coordinators bond ETH to represent their confidence that they've done their part of the trusted setup properly. And in the event they’re wrong, instead of generating fake proofs being the only reward for knowing Tau, the **actor who knows Tau can cash in Tau for a large portion (80%~) of the bond pool** so that people using that trusted setup will be alerted 🚨 and know that it’s compromised.\n\nThe more critical the trusted setup is, the higher the bond can be backing it.  **A higher bond gives the one who knows Tau a bigger incentive to reveal they know Tau.**\n `If Value of Bonded ETH pool \u003e Value of generating false proofs and Bond is untouched` then one can have higher confidence that there are no fake proofs being made.\n\n(PS thanks to \u003c@213402680637259777\u003e and \u003c@405860945018093609\u003e for their help on refining the idea)",
        "created_at": "2022-07-25T17:22:57.562000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e \u003e \u003ckevaundray\u003e  Hey Andrew,\n\n- Can an attacker generate a false proof to extract value, then take 80% from the pool?\n- `Value of Bonded ETH pool \u003e Value of generating false proofs` Is this possible if the value of generating a false proof means extracting value from Ethereum?\n\nIf I were to obtain tau in a non-trivial way, I would probably not alert anyone as the value of generating a false proof in the future may be worth more than what is currently in the pool. Even moreso, if I can do it without detection (I don't know if this is the case) (re @kzg_ceremony_bot: \u003cafurmanczyk\u003e Hi 👋 I’m Andrew, a PO from the PSE team. Was thinking about additional vectors to secure the trusted setup through incentives and had an idea I’d like to humbly share.\n\nCurrently, if you know Tau you get the benefit of generating false proofs which you could use for your own gain. What if there was a way to tempt an attacker to reveal they know Tau?\n\nTo do this, contributors and/or coordinators bond ETH to represent their confidence that they've done their part of the trusted setup properly. And in the event they’re wrong, instead of generating fake proofs being the only reward for knowing Tau, the **actor who knows Tau can cash in Tau for a large portion (80%~) of the bond pool** so that people using that trusted setup will be alerted 🚨 and know that it’s compromised.\n\nThe more critical the trusted setup is, the higher the bond can be backing it.  **A higher bond gives the one who knows Tau a bigger incentive to reveal they know Tau.**\n `If Value of Bonded ETH pool \u003e Value of generating false proofs and Bond is untouched` then one can have higher confidence that there are no fake proofs being made.\n\n(PS thanks to \u003c@213402680637259777\u003e and @glamperd for their help on refining the idea))",
        "created_at": "2022-07-25T17:40:28.821000+00:00",
        "attachments": []
    },
    {
        "author": "af77",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hi Kevaundray 👋 \n\n\u003e Can an attacker generate a false proof to extract value, then take 80% from the pool?\nYes, the bond pool wouldn't stop them from being able to make false proofs, just tempt them to reveal their knowledge of Tau. \n\n\u003e `Value of Bonded ETH pool \u003e Value of generating false proofs` Is this possible if the value of generating a false proof means extracting value from Ethereum?\nThis is a really interesting question. Even thinking about this for a few minutes I'm not sure. Could you elaborate on this a bit more? \n\n\u003e If I were to obtain tau in a non-trivial way, I would probably not alert anyone as the value of generating a false proof in the future may be worth more than what is currently in the pool. Even moreso, if I can do it without detection (I don't know if this is the case)\nYes, if the value of knowing Tau and exploiting it with fake proofs exceeds the payout they could collect from the bond pool an attacker would choose to hold their knowledge of Tau. Perhaps one way to counter this dynamic is to have the bond pool start very high value but then slowly unlock back to the stakers over time. If the attacker knows Tau they would be incentivized to cash in quickly.\n\nExample:  Bond pool starts at $200 million, and will linearly decrease in value over 2 years to zero.",
        "created_at": "2022-07-25T18:26:46.560000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e \u003e \u003ckevaundray\u003e  \u003e Yes, the bond pool wouldn't stop them from being able to make false proofs, just tempt them to reveal their knowledge of Tau. \n\nIn this example, the attacker has extracted value by using a fake proof and they have taken 80% from the bond pool. This seems like the logical way to do it, instead of taking from the pool first and alerting everyone\n\n\u003e This is a really interesting question. Even thinking about this for a few minutes I'm not sure. Could you elaborate on this a bit more? \n\nI am not sure that this equation can be true, ie where the amount that is locked up is greater than what I would get by exploiting a fake proof.\n\n---\n\nThis is also under the assumption that an attacker who has obtained tau's main motivation will be monetary. This could be the case, though I don't think it is obvious, atleast to me\n\n\n---\n\nIts possible to do it orthogonally to the ceremony, though I am not convinced that it would solve the problem of an attacker knowing tau. It may open us up to additional problems, like what if the contract holding the bond gets hacked or someone figures out a way to extract value without tau (making us think that we need to redo the ceremony) (re @kzg_ceremony_bot: \u003cafurmanczyk\u003e [reply]: Hi Kevaundray 👋 \n\n\u003e Can an attacker generate a false proof to extract value, then take 80% from the pool?\nYes, the bond pool wouldn't stop them from being able to make false proofs, just tempt them to reveal their knowledge of Tau. \n\n\u003e `Value of Bonded ETH pool \u003e Value of generating false proofs` Is this possible if the value of generating a false proof means extracting value from Ethereum?\nThis is a really interesting question. Even thinking about this for a few minutes I'm not sure. Could you elaborate on this a bit more? \n\n\u003e If I were to obtain tau in a non-trivial way, I would probably not alert anyone as the value of generating a false proof in the future may be worth more than w \u003cclipped message\u003e",
        "created_at": "2022-07-25T18:34:45.338000+00:00",
        "attachments": []
    },
    {
        "author": "af77",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e In this example, the attacker has extracted value by using a fake proof and they have taken 80% from the bond pool. This seems like the logical way to do it, instead of taking from the pool first and alerting everyone\nYep that'd be the highest paying way to attack, however in the event the fake proof was detected the bond pool could have a kill switch to immediately disable the attacker from withdrawing using Tau. That way if the attacker wanted to generate fake proofs, they risk losing access to the bond pool if discovered.",
        "created_at": "2022-07-25T20:10:17.360000+00:00",
        "attachments": []
    },
    {
        "author": "af77",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e Its possible to do it orthogonally to the ceremony, though I am not convinced that it would solve the problem of an attacker knowing tau. \nBond pool wouldn't be for stopping the attacker from knowing Tau, that's the job of the ceremony.",
        "created_at": "2022-07-25T20:13:07.166000+00:00",
        "attachments": []
    },
    {
        "author": "af77",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e It may open us up to additional problems, like what if the contract holding the bond gets hacked or someone figures out a way to extract value without tau (making us think that we need to redo the ceremony)\nYes, this would add an additional point of failure, we'd need to consider if the potential benefits outweigh the risks. They may not.",
        "created_at": "2022-07-25T20:16:34.791000+00:00",
        "attachments": []
    },
    {
        "author": "af77",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e This is also under the assumption that an attacker who has obtained tau's main motivation will be monetary. \nI don't think this is true. If an attacker intended to use Tau to fake a proof for a purpose that is non-monetary in nature, but then is faced with a choice that they could instead withdraw the Bond pool instead, they could weigh the value between the non-monetary and monetary rewards. If they thought the risk to being caught was high enough and they could instead walk away with the Bond pool, it may tempt them to take the money and let people know Tau is known.",
        "created_at": "2022-07-25T20:20:29.020000+00:00",
        "attachments": []
    },
    {
        "author": "af77",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Edit *was high enough and **they valued the monetary reward more**, they could instead walk away with the Bond pool **",
        "created_at": "2022-07-25T20:22:19.448000+00:00",
        "attachments": []
    }
]