[
    {
        "author": "trent_vanepps",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "reminder that there will be an off schedule interface demo this thursday same time as usual. 11:30 UTC",
        "created_at": "2022-10-05T00:25:43.167000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e Unfortunately I won't be available then as I will be enroute to devcon",
        "created_at": "2022-10-05T00:26:28.119000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e Yeah same unfortunately, I don't think I'll be able to make it",
        "created_at": "2022-10-05T00:28:01.249000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "some new information - the final audit for the sequencer is slated to start a bit later than expected bc of people traveling around devcon: Nov. 7 \n\ntalking with \u003c@550420431744794624\u003e we agree it's probably best for the Ceremony to only open to the public only after this is complete. we don't want to have to deal with some unexpected downtime or issues with contributions which might effect the public perception\n\nthis does push the schedule a few weeks. therefore, the interface needs to be gated to prevent contributions before the audit concludes\n\nfrom chiali:\n\n\u003e who are suppose to validate the gate?\n\u003e last time Kev said the sequencer will build api to validate that\n\nchecking in with \u003c@427491045308235776\u003e or anyone else who might have perspective here",
        "created_at": "2022-10-05T15:08:08.602000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think the easiest solution with the current architecture for the sequencer, would be for the sequencer to pre-generate X amount of access codes, then in the frontend have some way of sending an access code when you request to sign in.\n\nOnce sign in is successful, the sequencer removes the access code from a Set, so it can no longer be used",
        "created_at": "2022-10-05T16:01:09.015000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The downside of this is that you have to decide upfront how many people will participate.\n\nA different approach which allows for participants to be added on the go is to:\n\n1. Have the sequencer generate a secret.\n2. Whenever someone needs to be added the sequencer hashes their secret plus none : y = hash(secret || nonce) \n3. A contributor sends none and y when they want to authorise\n4. Sequencer checks if they have seen ‘nonce’ and checks that the preimage is correct\n\nMethod like this allow you to generate access codes on the go, though I’m not 100% sure this is a needed requirement, if we just generate 10K access codes upfront",
        "created_at": "2022-10-05T16:13:46.237000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e an alternate proposal (which I am in favour of) is we launch it fully open to the public as a testnet",
        "created_at": "2022-10-05T16:19:25.633000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "IMO very hard to thread the needle on \"this is a testnet and there may be issues\" and when there are possibly issues having to explain \"here's why the issues with the testnet contributions dont affect the soundness of the final ceremony\" in addition to people thinking they have already contributed",
        "created_at": "2022-10-05T16:26:55.820000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This gets users accustomed to what they need to do, making it easier to see what needs to be put in an FAQ and it also allows us to see where the problem areas are, if any, in the sequencer.\n\nI imagine that announcing at devcon will be the best place to put stress on the system.\n\nSince contributions done on the testnet will likely stay valid once Mainnet launches, we could keep those contributions.\n\nIf that’s the case, it’s more of an pre-release than a testnet I guess",
        "created_at": "2022-10-05T16:27:13.619000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e \u003e \u003cCarlBeek\u003e  this is why I am calling it a testnet, not a mainet-beta. the expectation is that it could be insecure and not carried forward. (re @kzg_ceremony_bot: \u003cTrent Van Epps\u003e IMO very hard to thread the needle on \"this is a testnet and there may be issues\" and when there are possibly issues having to explain \"here's why the issues with the testnet contributions dont affect the soundness of the final ceremony\" in addition to people thinking they have already contributed)",
        "created_at": "2022-10-05T16:29:25.176000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e we can always use the output of the testnet as the initialTranscript.json if we want",
        "created_at": "2022-10-05T16:30:09.243000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "What happens if I want to contribute on testnet and then Mainnet with the same GitHub handle?",
        "created_at": "2022-10-05T16:31:15.637000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e and by output here, i just mean the powers, not the full transcript.",
        "created_at": "2022-10-05T16:31:24.143000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e we reset everything",
        "created_at": "2022-10-05T16:31:42.537000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "it's also possible that we don't have the entire site built out by devcon (eg. transcript viewing) gating it gives a few weeks to tighten the interface, improve the copy and present a really solid experience to the community",
        "created_at": "2022-10-05T16:33:00.128000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e the default is the the testnet is unrelated to mainnet",
        "created_at": "2022-10-05T16:33:27.833000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e the default is the testnet is unrelated to mainnet",
        "created_at": "2022-10-05T16:33:31.427000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e @trent_vanepps, are you arguing for gating the transcript so users only experience the complete experience (tm)?",
        "created_at": "2022-10-05T16:37:05.174000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "separately, i've started working on a comprehensive FAQ here https://github.com/ethereum/kzg-ceremony/blob/main/FAQ.md\n\nPRs welcome, let me know if there are existing FAQs we can combine here",
        "created_at": "2022-10-05T17:58:19.804000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cMarcin\u003e Assuming we do a permit list: rather than doing some custom solution, I'd much rather have the seqeuncer pull a fresh permit-list of user IDs (wallets / gh names) from a Google Spreadsheet. Can be done in ~20 lines of dumb code on the sequencer side, and we get what amounts to an awesome admin panel: anyone you want to have the ability to add people just gets write rights to that spreadsheet. Bonus points: can also integrate with google forms for even more free automation. The whole \"how to do a permit list\" problem is trivial technically, the pain lies in maintaining the list contents, making sure we don't send the same secret twice etc. This solution makes it all quite easy and mindless – fewer ways to screw it all up.",
        "created_at": "2022-10-05T18:02:41.901000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e \u003e \u003ckevaundray\u003e  We would not modify the sequencer for this, so its just a deterent on the frontend. If someone manages to figure out how to get around it, then thats fine also (re @Marcin: Assuming we do a permit list: rather than doing some custom solution, I'd much rather have the seqeuncer pull a fresh permit-list of user IDs (wallets / gh names) from a Google Spreadsheet. Can be done in ~20 lines of dumb code on the sequencer side, and we get what amounts to an awesome admin panel: anyone you want to have the ability to add people just gets write rights to that spreadsheet. Bonus points: can also integrate with google forms for even more free automation. The whole \"how to do a permit list\" problem is trivial technically, the pain lies in maintaining the list contents, making sure we don't send the same secret twice etc. This solution makes it all quite easy and mindless – fewer ways to screw it all up.)",
        "created_at": "2022-10-05T19:08:27.699000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e I've implemented a rough POC and launched it, just so we have the code laying around.\n\nI think it's upto the frontend team as to whether we move forward with it. \n\n\nGenerate Access Code:\n\n- put in url: ceremony-access-codes.fly.dev/generate\n- You will see something like this: {\"code\":\"EKKBPSVM\"}\n\nCheck Access Code:\n\n- ceremony-access-codes.fly.dev/?code=EKKBPSVM\n\nDelete Access Code:\n\n- ceremony-access-codes.fly.dev/delete?code=EKKBPSVM",
        "created_at": "2022-10-05T19:09:30.646000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e In reality, there will not be a generate access code as we would load from some file",
        "created_at": "2022-10-05T19:10:07.137000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e Re using spreadsheets, it looks like a good idea. I don't mind how it is implemented/managed internally, the external API would probably stay the same so frontend people can use it without worrying.\n\nThough would like to just confirm with Chiali, Trent, Takamichi etc, if this gate is needed and or whether they think the capacity is there to get it over the line",
        "created_at": "2022-10-05T19:15:30.325000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cMarcin\u003e I wonder why not make it part of the sequencer? We need a separate backend service and a whole different flow in the frontend, so we're trying to expend more effort to get a solution that's way easier to bypass?",
        "created_at": "2022-10-05T19:18:57.828000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e \u003e \u003ckevaundray\u003e  Mostly because its not mandatory and we don't want to really add any censorship code into the sequencer, we could just hide the url and only give it to trusted parties for example. Its all upto the frontend as to how we move forward with this\n\nIn terms of effort, the separate server is pretty low effort for what its worth. Once we are finished we can just throw it away and the sequencer is never affected (re @Marcin: I wonder why not make it part of the sequencer? We need a separate backend service and a whole different flow in the frontend, so we're trying to expend more effort to get a solution that's way easier to bypass?)",
        "created_at": "2022-10-05T19:22:56.844000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cnicoserranop\u003e \u003e \u003cnicoserranop\u003e  After the user gets the access code would go with the session id in every request to the API? (re @kevaundray: I've implemented a rough POC and launched it, just so we have the code laying around.\n\nI think it's upto the frontend team as to whether we move forward with it. \n\n\nGenerate Access Code:\n\n- put in url: ceremony-access-codes.fly.dev/generate\n- You will see something like this: {\"code\":\"EKKBPSVM\"}\n\nCheck Access Code:\n\n- ceremony-access-codes.fly.dev/?code=EKKBPSVM\n\nDelete Access Code:\n\n- ceremony-access-codes.fly.dev/delete?code=EKKBPSVM)",
        "created_at": "2022-10-05T19:29:49.621000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e \u003e \u003ckevaundray\u003e  Nope, because the sequencer knows nothing about access codes in this situation (re @nicoserranop: After the user gets the access code would go with the session id in every request to the API?)",
        "created_at": "2022-10-05T19:31:03.902000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cMarcin\u003e ACK. Suggestion to avoid changing the frontends then: put this service in the middle of the redirect chain (i.e. set the post-oauth redirect uri to the permit list manager, permit list managers verifies the identity and redirects to the actual frontend)",
        "created_at": "2022-10-05T19:31:51.536000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e \u003e \u003ckevaundray\u003e  With this you would store a list of valid github Ids and wallets? (re @Marcin: ACK. Suggestion to avoid changing the frontends then: put this service in the middle of the redirect chain (i.e. set the post-oauth redirect uri to the permit list manager, permit list managers verifies the identity and redirects to the actual frontend))",
        "created_at": "2022-10-05T19:33:19.123000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cMarcin\u003e yes",
        "created_at": "2022-10-05T19:33:28.764000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cMarcin\u003e but this is still totally bypassable if you use a frontend that skips the permit manager",
        "created_at": "2022-10-05T19:34:24.608000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cMarcin\u003e (but also can easily be made watertight by restricting the allowed redirect urls)",
        "created_at": "2022-10-05T19:35:19.350000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e \u003e \u003ckevaundray\u003e  That makes sense, so I agree that this solution would be more watertight. Though from my understanding of what we are trying to achieve, we don't actually want to censor people in any meaningful way, just make it difficult enough that there is no influx during devcon. If you create your own website or modify the cli, then I think that would be fine. cc @CarlBeek @trent_vanepps (re @Marcin: yes)",
        "created_at": "2022-10-05T19:36:57.946000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e \u003e \u003ckevaundray\u003e  Does that put things in a better perspective and do you think that we should probably still add it to the sequencer based on that? Or maybe we should actually deter users? (re @Marcin: but this is still totally bypassable if you use a frontend that skips the permit manager)",
        "created_at": "2022-10-05T19:38:55.568000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ctrent_vanepps\u003e \u003e \u003ctrent_vanepps\u003e  yeah, ideally we wouldn't have to troubleshoot interface stuff during devcon. and there are also a few pieces that need to be completed beforehand (eg. reviewing transcript) (re @kevaundray: That makes sense, so I agree that this solution would be more watertight. Though from my understanding of what we are trying to achieve, we don't actually want to censor people in any meaningful way, just make it difficult enough that there is no influx during devcon. If you create your own website or modify the cli, then I think that would be fine. cc @CarlBeek @trent_vanepps)",
        "created_at": "2022-10-05T19:41:45.038000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e So I guess the default solution is to not say what the URL is, then second to that we apply access codes to the frontend. Where these are just deterents to contributing during devcon and not any sort of censorship\n\nI'm a bit hazy on whether we will give any sort of support to those with access codes, I guess if it's a closed set of close people, then we could ask them to contribute at an alloted time, so that troubleshooting is only done at that time and we can simulate an influx",
        "created_at": "2022-10-05T19:47:11.996000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cMarcin\u003e \u003e \u003cMarcin\u003e  It seems strange to me that this would be purely \"decorative\" and it skews incentives for who gets in. Normally when you do a launch with a permit-list, the idea is to only let trusted participants in, then smaller cohorts from the general public. With this, your first cohorts is trusted people + the people who really like to mess with systems and will try all sorts of ways to break them. \"Security by obscurity\" is not really something you want to do when launching at devcon? I have a feeling that even a fully-open-on-day-one launch may be safer than limited-but-bypassable, at least you're not teasing people :P (re @kevaundray: Does that put things in a better perspective and do you think that we should probably still add it to the sequencer based on that? Or maybe we should actually deter users?)",
        "created_at": "2022-10-05T19:53:44.875000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e this is partly why i’m advocating for this to be a “testnet” to reduce demand for being able to get in",
        "created_at": "2022-10-05T19:56:35.223000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e i don’t expect serious community members to contribute during devcon even if we had the best audits and perfect ux",
        "created_at": "2022-10-05T19:57:08.900000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e you’d want to be in a controlled/relaxed environment on your normal pc etc",
        "created_at": "2022-10-05T19:57:59.051000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ctrent_vanepps\u003e \u003e \u003ctrent_vanepps\u003e  so in an ideal world, we can include the onstage contribution in the actual Ceremony assuming it's a valid contribution. is this possible?\n\nthis also means we need to update a lot of language/ banners on the site to very clearly say TEST CEREMONY NOT FOR PRODUCTION etc (re @CarlBeek: this is partly why i’m advocating for this to be a “testnet” to reduce demand for being able to get in)",
        "created_at": "2022-10-05T20:11:37.841000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e it is possible, but there is a question of how valuable it is to include. what are we really adding by including that contribution? (particularly without double signing)",
        "created_at": "2022-10-05T20:43:54.509000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ctrent_vanepps\u003e \u003e \u003ctrent_vanepps\u003e  it represents the broader Ethereum community's collective contribution from devcon. not the end of the world if it can't be included\n\ndouble signing is close, i think 🤞 (re @CarlBeek: it is possible, but there is a question of how valuable it is to include. what are we really adding by including that contribution? (particularly without double signing))",
        "created_at": "2022-10-05T20:45:05.182000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e I didn't realise y'all were so close on the double signing, that's great!",
        "created_at": "2022-10-05T21:39:08.023000+00:00",
        "attachments": null
    }
]