[
    {
        "author": "trent_vanepps",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "it's already been two weeks, we're back with **KZG Ceremony Call #2**\n\n\u003ct:1655983800:R\u003e Thursday June 23 11:30 UTC\n\nWill add the zoom link before the call\nhttps://github.com/ethereum/pm/issues/558",
        "created_at": "2022-06-21T20:05:33.782000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ctrent_vanepps\u003e \u003e \u003ctrent_vanepps\u003e  checking in again on \"3. Lets try and find someone to take the lead on \"Anaysis of trusted setup attack vectors\" as their full time focus\"\n\nhow strongly should we be pursuing this (is it a nice to have or very important)? would it need to be done before the ceremony itself starts?\n\nif it's very important, the lead time to surface and hire someone means we'd need to start this process now, and i don't have the experience to evaluate/ hire someone with this background. and they'd likely end up on the PSE team anyways (re @Barrywhitehat: My takeaways are \n\n1. Lets schadual the audit with gorth16 power of tau as an indication of how much work it will be , but we have not decided to use that. \n2. Lets find a way to review Kev's (https://hackmd.io/@6iQDuIePQjyYBqDChYw_jg/Bk6sERCH9) proposal and see if that is better for our needs rather than the groth16 based one \n3. Lets try and find someone to take the lead on \"Anaysis of trusted setup attack vectors\" as their full time focus)",
        "created_at": "2022-06-21T21:07:09.139000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e my gut feel on this is that it is not very important for the actual security of the setup. maybe @Barrywhitehat disagrees?\n\nit could help enhance the narrative tho.",
        "created_at": "2022-06-21T21:18:40.403000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ctrent_vanepps\u003e \u003e \u003ctrent_vanepps\u003e  right, i can imagine it similar to the Roughgarden report on 1559 (re @CarlBeek: my gut feel on this is that it is not very important for the actual security of the setup. maybe @Barrywhitehat disagrees?\n\nit could help enhance the narrative tho.)",
        "created_at": "2022-06-21T21:28:15.630000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e yeah, and to be clear, i’m not against such a report",
        "created_at": "2022-06-21T21:39:03.052000+00:00",
        "attachments": []
    }
]