[
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cglamperd\u003e \u003e \u003cglamperd\u003e  The main mitigation for this is to have contributors' attestations saved somewhere that's timestamped and immutable. Say, an on-chain notarising contract? (re @frozenfire89: Or, swap out the entire transcript mid-way through with an entirely-contrived one.)",
        "created_at": "2022-05-17T02:58:24.231000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cfrozenfire89\u003e \u003e \u003cfrozenfire89\u003e  Perhaps we could use a semi-independent third party's cost-free infrastructure, such as Snapshot (re @glamperd: The main mitigation for this is to have contributors' attestations saved somewhere that's timestamped and immutable. Say, an on-chain notarising contract?)",
        "created_at": "2022-05-17T03:10:57.068000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cfrozenfire89\u003e Posting the web3.storage-backed prior Telegram logs here, for anyone in the Discord: https://bafybeicusqb3otp6ojvjhnbn4nevosb3blj3wafefmb4zuzj565vyhrqoy.ipfs.dweb.link/messages.html",
        "created_at": "2022-05-17T03:13:27.223000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cglamperd\u003e \u003e \u003cglamperd\u003e  The computation part is a subset of the full Groth16 PPoT. The main consideration to my mind is the output data structure. With snarkjs, we get a file format that's widely used, has the transcript baked in, and anyone can run the verification command with readily available software. The drawback is it's Groth16. We can live with that to get started. I think it'd be good if we could work with iden3 to get a KZG release of snarkjs. (re @trent_vanepps: when i spoke with @glamperd last week he said that kev's work deviated from the ppot construction, i think he said something like \"snark-js bindings would be different\" which would result in more work to get both approaches to parity (geoff please correct me if i'm wrong!))",
        "created_at": "2022-05-17T03:21:17.335000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cglamperd\u003e \u003e \u003cglamperd\u003e  It has little impact on the stuff I'm working on. (re @trent_vanepps: ok, so should geoff stop the work until we have it in circom? or can they happen in parallel)",
        "created_at": "2022-05-17T03:22:42.481000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cBarrywhitehat\u003e \u003e \u003cBarrywhitehat\u003e  Sounds good. Seems like after we schedual our audit next priority is to get jordi to implment this. He already commited to doing it just got to get him the proposal and have him prioritize that. (re @glamperd: The computation part is a subset of the full Groth16 PPoT. The main consideration to my mind is the output data structure. With snarkjs, we get a file format that's widely used, has the transcript baked in, and anyone can run the verification command with readily available software. The drawback is it's Groth16. We can live with that to get started. I think it'd be good if we could work with iden3 to get a KZG release of snarkjs.)",
        "created_at": "2022-05-17T17:49:07.712000+00:00",
        "attachments": []
    }
]