[
    {
        "author": "_pablop",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hey guys, is there any reason why we are using the OIDC provider in the siwe flow? why can’t we just use the direct auth flow in our case?\n\n- The UX problem I see when using the OIDC approach is that we will need to force the user to connect his wallet again to do the contribution. And we will need to verify that he is using the same wallet. Is this flow something that we have already decided to follow?\n- If we use a direct auth flow with our backend (https://kzg-ceremony-sequencer-dev.fly.dev) we could have more control and we could request the user to connect just once",
        "created_at": "2022-11-08T13:50:17.636000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e combining them would definitely smooth out the flow \u0026 makes a lot of sense from a UX perspective. the major down side is forcing participant implementations to keep the entropy around longer (although the primary website already does that) \u0026 of course needing to implement that in the sequencer now that it is already in audit.",
        "created_at": "2022-11-08T13:54:57.239000+00:00",
        "attachments": []
    },
    {
        "author": "_pablop",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Got it, thanks.\n\nSo, given that we need to connect the user again to do the contribution, I think we should implement the same web3modal that the OIDC provider is using (which is https://github.com/spruceid/siwe-web3modal) in order to give the user the possibility to connect to the same wallet he used before. Right now we are just allowing them to connect to MM in this step",
        "created_at": "2022-11-08T14:13:43.751000+00:00",
        "attachments": []
    },
    {
        "author": "_pablop",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "if that is correct then I could try to tackle that",
        "created_at": "2022-11-08T14:15:34.357000+00:00",
        "attachments": []
    },
    {
        "author": "_pablop",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "left a comment on \u003chttps://github.com/zkparty/trusted-setup-frontend/issues/54\u003e about this",
        "created_at": "2022-11-08T14:25:48.160000+00:00",
        "attachments": []
    },
    {
        "author": "wackerow",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003chttps://github.com/zkparty/trusted-setup-frontend/pull/64\u003e FAQ Page... cc: \u003c@550420431744794624\u003e let me know if you want/need a hand with reviewing and updating the copy here... the PR is in draft mode until we finalize the copy.",
        "created_at": "2022-11-08T19:43:57.543000+00:00",
        "attachments": []
    }
]