[
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cnicoserranop\u003e Guys! I have a problem with double signing:\n\n1. User logs in to the sequencer using SIWE (it lets him use WalletConnect (with different wallets including Metamask if installed as an extension), Portis, Torus, Fortmatic and Coinbase Wallet).\n\n2. User has to EIP-712 sign his potPubkeys with the same wallet as the one used to sign in. The problem here is that so far the only wallet that supports EIP-712 (eth_signTypedData_v4) is Metamask and Portis. Fortmatic and Exodus in WalletConnect are discarded. I am trying to make it work with Torus and Coinbase.\n\n\n\nSolutions:\n\n1. I was thinking that there might be a way to build the EIP-712 message and sign it using eth_sign which is a bit more generic and would have broader support from non-Metamask wallets. Do you think it is a good idea?\n\n2. \u003c@293496799854067712\u003e suggested to put a message stating: \"The following wallets are supported because they have the EIP-712 signature feature\" right before the SIWE to the sequencer. That way users would know what to use.\n\n3. Could we allow participants to upload their contribution without EIP-712? Just like we are doing with the Github contributions?\n\n\n*MEGA UPDATE: I got it working except with some WalletConnect desktop wallets. Fortmatic, Portis, Torus, Coinbase, Metamask and WalletConnect QR scanned*",
        "created_at": "2022-11-10T17:29:28.907000+00:00",
        "attachments": null
    },
    {
        "author": "wackerow",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@550420431744794624\u003e Just wanted to circle back on the front end copy... Can you confirm the link you posted above is the latest correct copy? (it doesn't seem to match the latest in the codebase)\n\nAnd also there is a PR up \u003chttps://github.com/zkparty/trusted-setup-frontend/pull/64\u003e for the FAQ but at least one answer is missing, and there are a couple placeholders that would still need to be filled in. \n\nWant to try and move this along for the sake of getting the translations going, so let me know about the first and let me know if I can help for the second. 🙂",
        "created_at": "2022-11-10T18:30:41.254000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cMarcin\u003e \u003e \u003cMarcin\u003e  The signatures are specified as optional, so it's totally fine for a frontend to not include when it has such need. Given the goal of this is to be as democratic as possible, I'd allow contributing without signature. (re @nicoserranop: Guys! I have a problem with double signing:\n\n1. User logs in to the sequencer using SIWE (it lets him use WalletConnect (with different wallets including Metamask if installed as an extension), Portis, Torus, Fortmatic and Coinbase Wallet).\n\n2. User has to EIP-712 sign his potPubkeys with the same wallet as the one used to sign in. The problem here is that so far the only wallet that supports EIP-712 (eth_signTypedData_v4) is Metamask and Portis. Fortmatic and Exodus in WalletConnect are discarded. I am trying to make it work with Torus and Coinbase.\n\n\n\nSolutions:\n\n1. I was thinking that there might be a way to build the EIP-712 message and sign it using eth_sign which is a bit more generic and would have broader support from non-Metamask wallets. Do you think it is a good idea?\n\n2. \u003c@293496799854067712\u003e suggested to put a message stating: \"The following wallets are supported because they have the EIP-712 signature feature\" right before the SIWE to the sequencer. That way users would know what to use.\n\n3. Could we allow participants to upload their contribution without EIP-712? Just like we are doing with the Github contributions?\n\n\nWhat are your thoughts?)",
        "created_at": "2022-11-10T19:31:43.905000+00:00",
        "attachments": null
    }
]