[
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e one interesting idea @Recmo came up with is to implement an aggressively short queue (say max 4 participants) and everyone else just keeps trying to get in from a lobby. it means we don’t have to track many people and their progress through the queue and contributors don’t have to keep their pc online for hours once they enter the queue.",
        "created_at": "2022-09-03T19:43:36.576000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e \u003e \u003ckevaundray\u003e  This doesn't seem like great UX for the clients when a lot of people want to come online. I'm also not sure about how one would rate limit contributors in this context either as this desigm seems to encourage clients to keep pinging the API to get in.\n\nWith the new strategy we discussed this week, the coordinator only keeps track of K members in the queue instead of every member in the queue, so every K+1 member and above can go offline as they please. I can see some problems with this approach too in terms of UX, for example if the queue goes fast in some places and slow in others.\n\nFor clients going offline, Instead of kicking we _could_ push them to the back of the queue with a strike? (re @CarlBeek: one interesting idea @Recmo came up with is to implement an aggressively short queue (say max 4 participants) and everyone else just keeps trying to get in from a lobby. it means we don’t have to track many people and their progress through the queue and contributors don’t have to keep their pc online for hours once they enter the queue.)",
        "created_at": "2022-09-03T20:00:20.853000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e i think the point is the ux is not all that different between a fifo queue where you only get to participate in 8 hours time and lobby where you probabilistically get in in 8 hours. especially because most people are not going to keep their machine from going asleep for 8 hours",
        "created_at": "2022-09-03T20:36:00.148000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e \u003e \u003ckevaundray\u003e  Yeah I think most people will not keep their machine on for long hours too. Most likely they will turn it off while going to sleep.\n\nRe the ux, in the first case you are guaranteed a slot to participate,  while in the second case its more of a race where you will need to take into account when other participants are likely going to come online as you want to avoid peak times. Given that the ceremony will be international, I'm not actually sure when peak time will be. For me, these are two different user experiences (re @CarlBeek: i think the point is the ux is not all that different between a fifo queue where you only get to participate in 8 hours time and lobby where you probabilistically get in in 8 hours. especially because most people are not going to keep their machine from going asleep for 8 hours)",
        "created_at": "2022-09-03T20:49:57.971000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e Taking a step back, the problem we are trying to solve here is a queuing system which is not going to easilly DoS the coordinator but also gives flexibility to contributors so they can eventually contribute before _some_ deadline. The probabilistic nature of the second approach seems like its solving the first problem for the coordinator but at the expense of the second.\n\nThe biggest unknown for us, is what the traffic will be like for the queue. So I always tend to keep in mind the worse case:\n\n- Queue is large\n- Contributors are still being added very quickly\n- A majority of contributors are taking up the max alloted time either intentionally or due to device constraints\n\nNo approach will do great here, as most of these factors cannot be controlled, or predicted I think",
        "created_at": "2022-09-03T21:01:53.148000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e my point is, with a long queue, you are effectively not guaranteed a slot if the average user is not capable of keeping themselves online for extended periods.",
        "created_at": "2022-09-03T22:04:27.805000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e i imagine the queue to blow up when someone prominent draws attention to it and then the majority of those users to drop from the queue when it is their time to contribute hours later which also means queue time estimates become untrustworthy",
        "created_at": "2022-09-03T22:06:28.370000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e also, the _some_ deadline for inclusion is on the scale of months, not hours",
        "created_at": "2022-09-03T22:08:28.422000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e Yeah I think in the worse case, long queue times are unavoidable. \n\nWhere this approach has its advantage is that someone in America will not need to wait for the queue being congested from the contributors in Europe, since there is only a lobby with four slots. \n\nIf someone prominent draws attention to this, I think both strategies will have problems:\n\n- Lobby suggestion will have users continuosly pinging the coordinator trying to join the lobby whom I assume will give up after hours also (I'm guessing that those in countries where data is not cheap or internet connections are bad, will most likely give up sooner)\n\n- K top people suggestion; the wait times become hours and the queue becomes congested (Users will be kicked from the queue after waiting for hours if they go into the top K spot and go to sleep)",
        "created_at": "2022-09-03T23:48:39.539000+00:00",
        "attachments": []
    }
]