[
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cglamperd\u003e \u003e \u003cglamperd\u003e  I'm not sure removing cookies is a good idea. It's fine for the happy case, but in the case where the queue is long and and a user goes offline and comes back later, they'll have to go through the login/metamask popup/sign sequence again. And for a subset of users that might involve getting their ledger out of storage. This could be avoided if the JWT is stored as a cookie. What's the downside? (re @kevaundray: Summary of the important points from meeting:\n\n1)  Landing page should focus on the value of the ceremony and less on the cryptography behind it\n\n2)  POAP should be given after the user has verified that they were included in the final ceremony. \n\n3)  Remove usage of cookies for returning users who did not contribute\n\n4)  Start an MVP frontend for DevCon which will have the same theme as the final designs\n\n\nExpanding:\n\n1) As a regular user, we want to feel like the activity we are doing is important and explaining the cryptography doesn’t convey this. Instead, we can explain to the user, what impact they will have on the Ethereum ecosystem, if they contribute honestly.\n\n2) There are two attestations for the ceremony that a contributor can make. The first is that they participated in a trusted setup and can be done once they’ve contributed (in the middle of the ceremony). The second is that their participation was included in the final output of the ceremony. This can only be done once the ceremony has completed. We want to incentivise users to come back and share the second attestation and we do this by only giving them the POAP at this stage.\n\n3) Currently in the designs a user can sign in with github/Ethereum and they will need to sign some message in the case of Ethereum. If they do not contribute, and come back again, we use cookies to ensure that they don’t need to sign some message again. \n\nWe can remove cookies by changing the workflow such that when a user signs in \u003cclipped message\u003e",
        "created_at": "2022-08-25T07:01:55.903000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ckevaundray\u003e \u003e \u003ckevaundray\u003e  That's a good point about users getting their ledger out of storage if they go offline and come back. I didn't  have strong opinions on this, though that ledger edge case has convinced me that it would hurt a (small/large) subset of users. @CarlBeek can you elaborate on this edge case?\n\nThe one unknown in this, is how the queue will progress and I think taking the worse case scenario (very long queues) would make sense here (re @glamperd: I'm not sure removing cookies is a good idea. It's fine for the happy case, but in the case where the queue is long and and a user goes offline and comes back later, they'll have to go through the login/metamask popup/sign sequence again. And for a subset of users that might involve getting their ledger out of storage. This could be avoided if the JWT is stored as a cookie. What's the downside?)",
        "created_at": "2022-08-25T12:08:46.735000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e My primary argument is that the easiest and best way to convince everyone that we are not storing any secrets is just to store nothing at all. A website sans metrics and cookies is the best from a safety and auditability standpoint. It means that users can just open the browser dev tools and see that nothing funny is afoot.\n\n\nThat said, I have had to re-login to several services with my hw wallet at it sucks every time. I still think it is preferable to choose better security/auditibility over UX in this case.",
        "created_at": "2022-08-25T15:11:20.696000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003ctrent_vanepps\u003e \u003e \u003ctrent_vanepps\u003e  thanks for the summary, very useful for me catching up! (re @kevaundray: Summary of the important points from meeting:\n\n1)  Landing page should focus on the value of the ceremony and less on the cryptography behind it\n\n2)  POAP should be given after the user has verified that they were included in the final ceremony. \n\n3)  Remove usage of cookies for returning users who did not contribute\n\n4)  Start an MVP frontend for DevCon which will have the same theme as the final designs\n\n\nExpanding:\n\n1) As a regular user, we want to feel like the activity we are doing is important and explaining the cryptography doesn’t convey this. Instead, we can explain to the user, what impact they will have on the Ethereum ecosystem, if they contribute honestly.\n\n2) There are two attestations for the ceremony that a contributor can make. The first is that they participated in a trusted setup and can be done once they’ve contributed (in the middle of the ceremony). The second is that their participation was included in the final output of the ceremony. This can only be done once the ceremony has completed. We want to incentivise users to come back and share the second attestation and we do this by only giving them the POAP at this stage.\n\n3) Currently in the designs a user can sign in with github/Ethereum and they will need to sign some message in the case of Ethereum. If they do not contribute, and come back again, we use cookies to ensure that they don’t need to sign some message again. \n\nWe can remove cookies by changing the workflow such that when a user signs in, they should be aware that they will immediately be placed into the queue to contribute. We can check if a user has contributed before by checking their ID in the “global” transcript. Noting from the last meeting about the transcript now including oAUTH IDs such as github/Ethereum.\n\n4) With DevCon fast approaching, we want an MVP  \u003cclipped message\u003e",
        "created_at": "2022-08-25T15:49:53.433000+00:00",
        "attachments": null
    }
]