[
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Can everything be run from IPFS yet?",
        "created_at": "2022-12-03T03:23:55.150000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cglamperd\u003e \u003e \u003cglamperd\u003e  Yes, that works (re @kzg_ceremony_bot: \u003cMicah\u003e Can everything be run from IPFS yet?)",
        "created_at": "2022-12-03T05:18:44.671000+00:00",
        "attachments": null
    },
    {
        "author": "plasmapower",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I have a few questions about the ceremony.\n- The test ceremony seems to have quite a long queue right now. Is that due to the sequencer URL being moved / some other sequencer issue, or are there actually a bunch of people in line? E.g. https://github.com/zkparty/trusted-setup-frontend/issues/96\n- Is there still concern about griefing attacks in the current protocol? I have some ideas for how to prevent them if so.\n- Why is this a \"test ceremony\" in the first place? Couldn't the output of this ceremony be used as the start of the real ceremony / is there any downside for that?",
        "created_at": "2022-12-03T21:54:25.396000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "- Not sure about this, it shouldn't be because the url was moved though.\n\n- What griefing attacks are you referring to?\n\n- Yes it's possible to use the output of this \"test\" ceremony to start the \"real\" ceremony, however while there was no audit, it would also be possible that we throw it away due to a serious bug. \n\nThere are no downsides except storing the information for the test ceremony so it doesn't look suspicious I guess",
        "created_at": "2022-12-03T22:03:24.154000+00:00",
        "attachments": null
    },
    {
        "author": "plasmapower",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "For the last point, there should be a guarantee though that any one contribution being honest is good enough right? So even if the test ceremony was completely compromised it should be fine to start with it for the real ceremony.",
        "created_at": "2022-12-03T22:11:06.143000+00:00",
        "attachments": null
    },
    {
        "author": "plasmapower",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Griefing attacks meaning just waiting in line but not contributing when the time comes",
        "created_at": "2022-12-03T22:11:26.452000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yes, though there are some bugs which could \"zero\" out contributions and for those it's probably better to just start again imo. Also having it as a test would make it so that there is no expectation that it would be included and there are no expectations for uptime or bug-free code. \n\nFor that you get put on a blacklist, and if you had bad connection and still want to contribute while the ceremony is being carried out, you will need to use a different valid github or eth address and re-join the lobby",
        "created_at": "2022-12-03T22:17:22.687000+00:00",
        "attachments": null
    },
    {
        "author": "plasmapower",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Makes sense",
        "created_at": "2022-12-03T22:18:04.190000+00:00",
        "attachments": null
    },
    {
        "author": "plasmapower",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I read through the sequencer code, and the only way I could find for it to get stuck was for this block of code to fail: https://github.com/ethereum/kzg-ceremony-sequencer/blob/6da76be4cbf2444bcd7e6acd3344c3f6c2eabf46/src/api/v1/contribute.rs#L88-L98\nI.e. either signing the receipt failed or writing the json file failed (maybe out of disk space?)",
        "created_at": "2022-12-03T22:45:52.846000+00:00",
        "attachments": null
    }
]