[
    {
        "author": "kevaundray",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "For Nginx, I’m not sure what remco had in mind, one usecase that comes to mind is the fact that it allows you to handle multiple concurrent connections so it may make it easier to serve the static transcript file to slot of clients. I don’t use nginx that often, but it’s usually a way to harden your server, I’ll get a link to an article on it\n\n- I’d say vvv ; though this should be setup in the dockerfile too \n\n- hmm I’m on mobile, I’ll have to check when it was added when I come off of my flight. Marcin or Greg might be able to provide better information here about Prometheus. It might be a stub, in that case you can ignore it and when an impl is added the docker file should take care of setting it up on localhost",
        "created_at": "2022-10-23T12:30:31.450000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Link: https://www.digitalocean.com/community/tutorials/understanding-nginx-http-proxying-load-balancing-buffering-and-caching",
        "created_at": "2022-10-23T12:30:57.796000+00:00",
        "attachments": []
    },
    {
        "author": "parithosh",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "You'd also use Nginx for SSL termination, so you'd need it to provide HTTPS connections to the sequencer. Additionally you can set a 301 redirect if someone tries to use HTTP, you can then redirect them to use HTTPS.",
        "created_at": "2022-10-23T16:24:35.350000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003cCarlBeek\u003e Thanks Pari \u0026 Kev for the explanations and theory. I'm now on the SSL theory side of things. (Altho caching would also be helpful)",
        "created_at": "2022-10-23T19:18:03.969000+00:00",
        "attachments": []
    }
]