[
    {
        "author": "treyzania",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Oh thanks for the feedback, so I had tried go-kzg-ceremony-client after dropping the cpp- client, but it didn't build on the Raspbian distribution of Go *or* the latest release, but I had to try a version from the *next* to latest major release to get it to build.  What I ended up doing since the lobby was empty for ~15 minutes while I was working on it was trying the same contribution file but contributing through my old GitHub account, so I did end up successfully making a contribution using what I had generated on the Pi.  I had also looked at that -alt repo, but I wanted to do an \"offline\" setup without the Pi connected to the internet, which it seems to not support.  I also tried building Chotto on the Pi, but I encountered a mysterious Gradle error that I had no idea how to resolve, possibly because OpenJDK 10 is the newest one supported on Raspbian?  Although in retrospect I suppose I could have tried running the released build.",
        "created_at": "2023-07-18T02:44:20.777000+00:00",
        "attachments": []
    },
    {
        "author": "treyzania",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "What tripped me up was that I got the `Can't enter the lobby, are you sure we're on your reserved slot? Waiting %v for retrying...` message printed to the console using the Go client using a fresh session ID, so I thought something was broken.  I'm not sure what happened with the GitHub account I was trying to submit from, but when I tried registering using my old one and passing the session ID with that instead (somehow nobody had made a contribution for ~20 minutes at this point).  That *still* printed that error, but I just left it for ~2 minutes and it ended up submitting successfully.",
        "created_at": "2023-07-18T02:47:11.566000+00:00",
        "attachments": []
    },
    {
        "author": "treyzania",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I don't know if this is valuable to anyone, I haven't looked at the code and with only a week left it might not be useful to improve the coordination.",
        "created_at": "2023-07-18T02:47:44.236000+00:00",
        "attachments": []
    },
    {
        "author": "treyzania",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "¯\\_(ツ)_/¯",
        "created_at": "2023-07-18T02:47:54.969000+00:00",
        "attachments": []
    },
    {
        "author": "treyzania",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "either way, happy I finally got that out of the way",
        "created_at": "2023-07-18T02:48:00.191000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@129305432891195393\u003e, just to clarify about that message of `reserved slot`. So.. the offline contribution feature of go-kzg-ceremony-client was originally thought for the _special contributions_ phase where participants had a reserved slot; that means, their contribution was expected in a defined datetime timespan. That meant that when they do the offline contribution, the sequencer _must_ accept the contribution immediately (i.e: on the first try). If that wasn't the case, they were doing the contribution at the wrong time or there was some misconfiguration in the sequencer. So.. that's the reason why you saw that message. That feature wasn't thought fo \"normal\" contributions (for which there's the usual worfklow of \"online\" contributions).\n\nBut considering you were (IIUC) trying to do some mix of a kind of _special contribution_, but without being in that \"phase\"... that was pretty creative on your side :) glad it worked.",
        "created_at": "2023-07-18T12:24:57.251000+00:00",
        "attachments": []
    },
    {
        "author": "stefanbratanov",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hi, regarding Chotto, you can use the release artifacts, but you need to update OpenJDK to at least 11, you can just do `sudo apt install -y openjdk-11-jdk` . Raspberry Pi should support updating the java version.",
        "created_at": "2023-07-18T13:30:20.474000+00:00",
        "attachments": []
    }
]