[
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We've had a Swagger API kicking for a while with the intention of proposing it -- I'll get onto it now",
        "created_at": "2019-08-21T01:15:13.005000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I've just noticed that it seems like validators can propose blocks at slot 0, meaning you end up with two distinct blocks at slot 0 in the same chain -- the genesis block and the proposed one. This seems strange from a consistency PoV, and there doesn't seem to be a test for it currently, so just wanted to confirm this is the intended behaviour?",
        "created_at": "2019-08-21T02:30:37.794000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Oh, actually it looks like fork choice forbids this with the check `assert block.slot \u003e compute_start_slot_of_epoch(store.finalized_checkpoint.epoch)`, here: https://github.com/ethereum/eth2.0-specs/blob/v0.8.2/specs/core/0_fork-choice.md#on_block",
        "created_at": "2019-08-21T02:38:07.795000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You are correct in that there is nothing really stopping a proposer from proposing for slot 0, but the state transition would prevent ever processing a block other than genesis as valid for slot 0.\n\nTo process a block, you must have a valid pre-state _and_ the block must be at a slot greater than the slot of the pre-state. The genesis state is the only valid pre-state that you can start with and is defined as slot=0, so no proposed block at slot=0 will be valid",
        "created_at": "2019-08-21T02:56:01.222000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "assuming you could produce a valid block at slot 0 other than the genesis block, then yes, the fork choice does protect in this case as well",
        "created_at": "2019-08-21T02:56:52.350000+00:00",
        "attachments": []
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Just posted an issue in the API repo about if we should use markdown instead of Swagger\n\nhttps://github.com/ethereum/eth2.0-APIs/issues/1",
        "created_at": "2019-08-21T03:41:30.832000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "also opened an issue to gather feedback for the api we've been working on last 2 months",
        "created_at": "2019-08-21T03:59:55.733000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "https://github.com/ethereum/eth2.0-APIs/issues/2",
        "created_at": "2019-08-21T03:59:57.364000+00:00",
        "attachments": []
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@363800010518822915\u003e, I see \"blocks by slot\" returns _all_ blocks at that slot, not just the canonical ones?",
        "created_at": "2019-08-21T04:00:26.127000+00:00",
        "attachments": []
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "How do you determine which is canonical?",
        "created_at": "2019-08-21T04:00:35.508000+00:00",
        "attachments": []
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I would have thought \"blocks by slot\" should return _only_ the canonical block? (I'm not sure how eth1 works, trying to figure it out)",
        "created_at": "2019-08-21T04:01:26.901000+00:00",
        "attachments": []
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Also, regarding \"blocks by epoch\", I think there's an opportunity for confusion between \"I want all blocks in an epoch\" vs \"I want the start block, because I'm trying to get the finalized/justified block from an epoch\"",
        "created_at": "2019-08-21T04:02:40.766000+00:00",
        "attachments": []
    },
    {
        "author": "prestonvanloon",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@361447803194441738\u003e that is a good point that if you don't specify that you only want canonical blocks back in the response, then you wouldn't be able to identify which blocks are canonical in the beacon node's point of view with the ListBlocksResponse. The only use case we had imagined for this returning non-canonical blocks is during a time of contention in the network and it would make for some visual representation of what is going on.",
        "created_at": "2019-08-21T04:05:43.551000+00:00",
        "attachments": []
    },
    {
        "author": "prestonvanloon",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Great feedback that the intention isn't clear with \"blocks by epoch\". The original intent is that \"by epoch\" would be the grouping modifier as we have \"by slot\" or \"by root\" grouping.",
        "created_at": "2019-08-21T04:07:01.615000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "so technically, there's nothing preventing the network being launched without a public/common api really - as long as the consensus is working and the eth2 network itself is healthy, public api's and the like are cherries on top - true, it would be somewhat dissatisfying not to have something, but I don't think of the api as a critical launch feature (unlike base networking layer etc), specially not a \"common\" one, because we have nothing that can inform us of real user needs and there's a clear risk of overdesigning it at this stage",
        "created_at": "2019-08-21T12:02:09.562000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "similar to the networking API, it seems prudent to err on the side of caution before throwing all kinds of requests in there that \"could\" be useful - every request you have to implement carries a cost in terms of bandwidth, attack surface, performance (think database indices etc), etc",
        "created_at": "2019-08-21T12:04:51.623000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e so technically, there's nothing preventing the network being launched without a public/common api really\n\nVery much agreed. That's one reason these APIs have been pulled out of the eth2.0 specs. I standards to be formed over time through discussions and single-client experimentation, and I really wanted the release cycle of these standards to be decoupled from the mission critical core specs.\n\n\u003e similar to the networking API, it seems prudent to err on the side of caution before throwing all kinds of requests in there that \"could\" be useful \n\nAlso agreed. We can move slowly in the API repo and make it clear that these things are not core specs and are in heavy R\u0026D",
        "created_at": "2019-08-21T17:30:06.222000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e every request you have to implement carries a cost in terms of bandwidth, attack surface, performance (think database indices etc), etc\n\nIt is important to note that these RPC calls are _not_ to be generally open on the p2p network as opposed to what is in the network spec. The manager of a client should have the ability to turn these features on/off and dictate who is actually allowed to tap into and call them. There is  certainly an attack surface, but in the normal case in which the user running the node is the user accessing the node via RPC, a lot of the attack surface is reduced",
        "created_at": "2019-08-21T17:32:17.477000+00:00",
        "attachments": []
    }
]