[
    {
        "author": "prestonvanloon",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think we agree on the same points here. We chose to document the API in the protobuf defintions as a way to realize that the decisions made in this API have impact on downstream implementors. Reordering, renaming, and other invasive operations on message types has a real impact on teams building on ETH2 in phase 0 and future phases. We support JSON over HTTP as well as gRPC, which is why you'll see http paths on every service method. \n\nIt sounds like the main issues are around the format, perhaps for readability sake? \nWe can generate markdown with ease using the protobuf definitions. See this example: https://github.com/pseudomuto/protoc-gen-doc/blob/master/examples/doc/example.md. We still gain the generative properties and ridge format of protocol buffer definitions without hindering reader experience. \n\nThe second issue seems to be around the amount of endpoints; this can be a non-issue by only implementing a subset and indicating this with ListImplementedServices.\n\nWe would love more eyes on this in general, we have documentation rational backing API decisions and we'd be happy to add any reasoning that was not captured in the documentation.\n\nI'll address your PR comments in the PR, if thats OK",
        "created_at": "2019-08-23T00:12:38.347000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Cool, sounds good. Thanks!\n\nBasically, I'm expressing a preference for a loosely-typed spec that is more-often-correct vs a less-often-correct, strongly-typed spec. I assume a loosely-typed markdown document will be more actively maintained by a wider base of contributors than something like protobuf or swagger.\n\nMy preference is for a loosely-typed, often updated base specification and additional strongly-typed superset specifications (e.g., protobuf for gRPC, openapi for HTTP, openrpc for JSON RPC, etc).",
        "created_at": "2019-08-23T00:29:13.450000+00:00",
        "attachments": null
    },
    {
        "author": "prestonvanloon",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think that might be our disagreement. Once we launch with an API, it is difficult to undo or make radical changes as downstream projects have already built on it. Likewise, markdown is hard to test for breaking changes. How is a protobuf definition less correct?",
        "created_at": "2019-08-23T00:31:52.946000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Presently our core data model (the spec) is unstable so I don't think anyone is going to be getting a stable API for a few months at least.\n\nThe protobuf definition is incorrect whenever the spec data model structures change. A loosely defined spec can stay correct through a much larger set of spec changes.",
        "created_at": "2019-08-23T00:41:58.723000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "In fact, \"loosely-typed\" is not really the right word here. I'm talking about type-aliased. Markdown just aliases to the whatever spec version you're using, something like protobuf or openapi needs to be either incomplete or redefine the datastruture AFAIK",
        "created_at": "2019-08-23T00:49:42.575000+00:00",
        "attachments": null
    },
    {
        "author": "prestonvanloon",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The spec is frozen for phase 0, why wouldn't we have a stable API for months?",
        "created_at": "2019-08-23T00:49:48.409000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I don't think it's frozen forever? There's a bunch of `post-freeze` changes.\n\nRegardless, we're going to have to start the following phases soon and they're not stable.",
        "created_at": "2019-08-23T00:50:58.567000+00:00",
        "attachments": null
    },
    {
        "author": "prestonvanloon",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "In any case, the `alpha` indicator in versioning signals that it is not the final final one. Personally, I wouldn't start building/designing an API until the spec is final. I understood that only bug fixes were allowed for phase 0, which wouldn't likely have model changes",
        "created_at": "2019-08-23T00:56:01.298000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think although it's frozen, things like the temporary removal of transfers need to be considered. And then there may be new change proposals based on interop lock-in. Just defining a minimal base will also help test the complicated queries, and provide a fallback when these more complicated API break for whatever reason.",
        "created_at": "2019-08-23T01:03:15.944000+00:00",
        "attachments": null
    },
    {
        "author": "raulj",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Why not just proceed with the `alpha` versioning approach for now? We have had very, very few model changes",
        "created_at": "2019-08-23T01:20:46.043000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I don't really mind what the versioning scheme is. I'm just not convinced that we should define the API in protobuf when it seems the status quo is to provide HTTP as a minimum. If we're going to support HTTP, gRPC, JSON RPC, etc. then I don't see why we would pick protobuf instead of some other format.",
        "created_at": "2019-08-23T01:25:02.211000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'm totally down with the gRPC service being defined in protobuf, and openapi being used to concretely define the HTTP service.",
        "created_at": "2019-08-23T01:25:54.554000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It just seems to make sense to base both of those specifications from some base, more abstract specification",
        "created_at": "2019-08-23T01:26:35.626000+00:00",
        "attachments": null
    },
    {
        "author": "prestonvanloon",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We do provide HTTP and none of this is a requirement. Clients may choose only to implement the JSON over HTTP, or clients may choose to implement the gRPC model (and get JSON over HTTP for free)",
        "created_at": "2019-08-23T01:26:38.989000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I know you provide HTTP, what I'm talking about is how we all agree upon common API endpoints. I don't think that protobuf is the right language for that task.",
        "created_at": "2019-08-23T01:27:15.792000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It's ideal if your HTTP service is a wrapper over your gRPC service, like in your case",
        "created_at": "2019-08-23T01:29:04.274000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "But I don't see how this is going to be the case for other teams",
        "created_at": "2019-08-23T01:29:34.288000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It doesn't seem natural to define a HTTP API as a translation of a protobuf file if you're not already using gRPC",
        "created_at": "2019-08-23T01:31:04.573000+00:00",
        "attachments": null
    },
    {
        "author": "prestonvanloon",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Clients don’t have to literately use the protobuf gRPC stubs, they can use the generated openapi if that is their preference. The markdown alternative doesn’t provide any code generation, but all three formats can be derived from protobuf files",
        "created_at": "2019-08-23T01:31:07.677000+00:00",
        "attachments": null
    },
    {
        "author": "prestonvanloon",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We probably will never get 100% agreement on either approach. I had suggested that this new repo can be a markdown mirror where the API are aligned at least. It may cause some confusion when there is conflicting in either repository so maintenance costs are increased. We thought this was a great idea to solve many problems, but we understand not everyone will agree",
        "created_at": "2019-08-23T01:35:18.161000+00:00",
        "attachments": null
    },
    {
        "author": "raulj",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Would be great to get some input from other teams as well regarding these approaches so we can have a holistic picture of pros/cons, what do you all think?",
        "created_at": "2019-08-23T01:38:09.185000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Good call \u003c@311971895828283393\u003e! I might go do something else for a while and come back to it with a fresh mind 🙂 Perhaps we can raise it in the next eth2 call.",
        "created_at": "2019-08-23T01:40:57.886000+00:00",
        "attachments": null
    },
    {
        "author": "prestonvanloon",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sounds good to me",
        "created_at": "2019-08-23T01:53:12.401000+00:00",
        "attachments": null
    },
    {
        "author": "prestonvanloon",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "thanks!",
        "created_at": "2019-08-23T01:53:14.677000+00:00",
        "attachments": null
    }
]