[
    {
        "author": "bitfalls",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hey all, been talking to  \u003c@545555441518772225\u003e about this and we've been racking our brains on how there can ever even be a fork on the beacon chain, if there's only ever a single proposer per slot, who everyone knows about at least an epoch in advance.\n\nThe only scenario I could think of was latency - if V1 in S1 proposes but S1.block doesn't reach V2 in S2 before S2 block has already been submitted and proposed, so S2.block is based on S0.block, then we can fork.\n\nWhat other scenarios are there?",
        "created_at": "2019-08-08T13:10:09.250000+00:00",
        "attachments": []
    },
    {
        "author": "bitfalls",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "🦗🦗🦗",
        "created_at": "2019-08-08T18:30:25.074000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Danny is offline this week, and Justin/V only read gitter/telegram. I can give you the short answer though; there may always be actors that either do not care enough, or simply try to attack, and build on older blocks. Pretty simple, need more context to see what you really mean with \"forking\". You are concerned about the forking in an everyone-is-honest case?",
        "created_at": "2019-08-08T18:35:25.540000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@387303511626350593\u003e",
        "created_at": "2019-08-08T18:36:41.454000+00:00",
        "attachments": []
    },
    {
        "author": "bitfalls",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "No, in general, when can a fork even happen. If the proposer is known, there's no way for someone else to propose a block and stay unslashed, it's immediately visible, no? I was thinking some more about the fork case in Justin's slides from my post (https://our.status.im/two-point-oh-justification-and-finalization/) and couldn't figure out when / how it would occur.",
        "created_at": "2019-08-08T18:39:16.635000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So, someone may not see a block, or wants to prevent a certain transfer/slashing from being included, and then builds on an older block. Short term that could work, but yes, longterm there is justification and finalization to pull through the will of the majority",
        "created_at": "2019-08-08T18:41:10.762000+00:00",
        "attachments": []
    },
    {
        "author": "bitfalls",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Right, so censorship by temporary god-validator, or latency, that's the scenarios we came up with too. So can we discuss the censorship scenario a bit, how that would work? Why it would even need J/F if it's pulled off, attested to, and successfully included in the chain? If it's auto-legit now, what would make it less legit in one to four epochs of time to discard it?",
        "created_at": "2019-08-08T18:43:49.563000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If someone censors (or carelessly doesn't include) others can still do so on top of the minimal work of the censor. No problem there. The problem is when someone decides to undo more work by others, and forks to achieve that.",
        "created_at": "2019-08-08T18:48:19.006000+00:00",
        "attachments": []
    },
    {
        "author": "bitfalls",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e The problem is when someone decides to undo more work by others, and forks to achieve that.\n\nLet's dive into this. The way I see it, we have 3 attack types in Eth2:\n\n- DoS of beacon nodes or validators, because they're known at least 1 epoch in advance.\n- Smoke bomb attacks by masking votes with timed attestation messages and causing a split.\n- what you said above.\n\nCan we go into the mechanics of doing that undo? In my mind that's still not feasible - a proposer picks a block he'd like to start the fork from. Let's assume that's _after_ the last finalized block, so within, what, 3 epochs or so? Anyway, let's assume the attacker wants to change 2 epochs old work, so some 128 slots. He picks a slot to start from, and then what? He can't hurry time, he's already behind and will be ignored. He can't propose if it's not his turn to propose, so he'd have to pick a slot where he was proposer and hope it's before his target reversal slot, but after the last finalized epoch. Tough sell. How can he do it?\n\nSorry if this is stupid, I'm just trying to catch up and get my head in sync with this. No matter how much stuff I read, it doesn't seem feasible to attack the network like this, unless a proposer's word is automatically confirmed (and thus attested to by the rest of the committee) in which case it's unclear to me how that proposer would ever be defeated.\n\nIs there a paper or overview of this type of attack I could read? Scenarios in which it works and how to prevent it.",
        "created_at": "2019-08-08T19:04:12.443000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You're right that a lot of things make it quite hard to execute, but that's the intention, to justify/finalize fast.",
        "created_at": "2019-08-08T19:06:35.087000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think there's another paper coming up on \"gasper\", you can ask Danny when he is back to dive deeper into their work with you.",
        "created_at": "2019-08-08T19:16:19.740000+00:00",
        "attachments": []
    },
    {
        "author": "bitfalls",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I read that, it's quite good and digestible, though it diverges from eth2 a bit... in terms of attacks it only covers smoke bombs, this not so much.",
        "created_at": "2019-08-08T19:22:05.746000+00:00",
        "attachments": []
    },
    {
        "author": "agemanning",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Have you considered network fragmentation. Two subsets of nodes receive blocks faster amongst themselves. They often each see the other subset as not proposing a block and create competing chains.",
        "created_at": "2019-08-08T22:15:35.536000+00:00",
        "attachments": []
    }
]