[
    {
        "author": "pscott1337",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hey y’all!\nI had a question that fits perfectly with the last message haha.\nI was thinking about what happens if a user accidentally removed his slashing db (where the record of published blocks and attestations are kept).\nI know we always assume that BN can be malicious, but in the event where someone removed his slashing db, could he recover it by querying from the bn ?\n\nI **think** this could be safe if you stop querying at the last finalized epochs (since you won’t be publishing attestations on finalized epochs?). Your VC would need to be sure it doesn’t then publish any block / attestation between the last finalized block and the time it started recovering the db.\n\nAm I missing something here, and would it be useful for clients to implement this recovery function?\n\nThanks! 🙂",
        "created_at": "2020-08-22T23:49:07.355000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "yeah its an important question as some slashings from the medalla event were effectively due to this",
        "created_at": "2020-08-22T23:57:40.507000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "the first step is just making the key pair + history portable across clients -- client teams are working on this aiui after the medalla event",
        "created_at": "2020-08-22T23:58:18.769000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "the next step is then making sure the keys + history are available",
        "created_at": "2020-08-22T23:58:40.751000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "a particular client would be able to generate the history for any validator according to its view of the network,",
        "created_at": "2020-08-22T23:59:07.665000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "so anything on chain is likely safe (wrt being sure of inclusion)",
        "created_at": "2020-08-22T23:59:20.118000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "if you publish an attestation and it only ends up in a node's operation pool (that then goes down..!) you may be in trouble",
        "created_at": "2020-08-22T23:59:44.976000+00:00",
        "attachments": null
    }
]