[
    {
        "author": "pscott1337",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!476250636548308992\u003e I think this echoes to what I wrote before about recovering a slashing DB from your keys.\n\nAs you mentioned, duplication of histories might get cumbersome in terms of space on device (imagine after a couple of years...).\n\nThe issues you mentioned all seem to have an easy 90% fix:\nOn client start, check if slashing db is empty.\nIf it is empty, issue a warning like \"It seems like you forgot to add the path to your db!\".\nOf course, the client should have a flag like `--first-start` or `--empty-db` to bypass that check.\n\nThis does not, however, fix the case where the db is present but invalid. \n\nEchoing back to what I wrote earlier, if clients had a slashing db recovery mechanism, then we could \"sanity check\" the db up to a certain degree of confidence (something like last finalized epoch?).\nAnd, in the event really has lost his slashing db, this could become really helpful. (the recovery mechanism could even accept multiple bn to check against).\n\nI'm interested in hearing everyone's thoughts 🙂",
        "created_at": "2020-08-25T08:55:28.318000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Binding keys to slashing protection information more tightly is always going to be difficult, because there is ultimately nothing that can be done to stop someone from taking the key and signing whatever they like with it.\n\nNot sure about the idea of failing if a slashing DB doesn't meet requirements is practical: there are a lot of situations where it would be hard to keep this sane (addition of a new validator, restart after being offline for a couple of days, _etc._)  Transient flags aren't necessarily a good solution, as they don't fit in well with automated services.\n\nIt so happens that I finally managed to write up an article on our keymanager, which we use to solve this problem by having distributed keys and requiring validator clients to go through an API for signing rather than having any access to the keys directly.  Of course, it won't fix the \"admin can take the keys and do what they want\" piece, but it does provide additional layers of security (and availability) and significantly reduces the attack surface.\n\nhttps://www.attestant.io/posts/introducing-dirk/",
        "created_at": "2020-08-25T09:30:36.324000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "ah nice, will be reading that article now \non this \n\u003e Binding keys to slashing protection information more tightly is always going to be difficult, because there is ultimately nothing that can be done to stop someone from taking the key and signing whatever they like with it.\n\nThat is true, although I wanted to reduce the potential spots for where the average user can accidentally slash themselves. If a user takes the key and signs whatever then not much we can do to stop them.\n\n\u003e The issues you mentioned all seem to have an easy 90% fix:\n\u003e On client start, check if slashing db is empty.\n\u003e If it is empty, issue a warning like \"It seems like you forgot to add the path to your db!\".\n\u003e Of course, the client should have a flag like --first-start or --empty-db to bypass that check.\n\u003c@!212146572736200704\u003e  I guess that would be one way but it  might potentially confuse users\nwho are starting up the first time, as their slashing db's will be empty. You could end up in a situation where users just end up bypassing it with a flag and continue doing this in the future (which might miss cases where their db actually is missing).",
        "created_at": "2020-08-25T10:03:32.180000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e That is true, although I wanted to reduce the potential spots for where the average user can accidentally slash themselves. If a user takes the key and signs whatever then not much we can do to stop them.\n\nYep agreed.",
        "created_at": "2020-08-25T11:51:27.313000+00:00",
        "attachments": null
    }
]