[
    {
        "author": "chaserxy",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "is beaconcha.in's liveness chart correct? (https://beaconcha.in/charts/network_liveness) as far as I understand Gasper, whenever a boundary slot is missed, that epoch will have a liveness of 3 epochs, and the following epoch also. in the epoch after it can go back to 2 if it's only that one initial boundary slot missed.\n\n(this doesn't apply to epochs close to the genesis because slot 0 is by definition proposed and finalized instantly, so even though epoch 1's and epoch 2's boundary slots were missed, it only introduces +1 epoch liveness at epoch 3. epoch 3's boundary justifies epoch 2, and epoch 4's finalizes epoch 2, so by epoch 4 we're back to a lag of 2 epochs (4 - 2 = 2).)\n\nbut there's also a missed boundary slot in epoch 5:\nhttps://beaconcha.in/epoch/5\n which should increase that epoch's liveness to 3 epochs (last finalized epoch is epoch 2, 5 - 2 = 3). epoch 6 has a boundary block, which finalizes epoch 3, again leading to a liveness of 6 - 3 = 3 epochs.",
        "created_at": "2020-12-01T23:15:28.098000+00:00",
        "attachments": [
            {
                "type": "",
                "origin_name": "unknown.png",
                "content": "bf470f21406d3a95ee98ef3bb2eb1a4d1fe68ef71176ae7772b6cb715363ccec"
            }
        ]
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Finalization happens at epoch transition with or without a block (assuming enough attestations were received in earlier blocks).",
        "created_at": "2020-12-01T23:17:31.931000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Though I may be misunderstanding exactly what this metric is trying to report on.",
        "created_at": "2020-12-01T23:17:47.420000+00:00",
        "attachments": null
    },
    {
        "author": "chaserxy",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "so far I thought their \"liveness\" means the distance between the current epoch and the last epoch with a finalized checkpoint. but now I'm less sure.",
        "created_at": "2020-12-01T23:25:42.813000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Missed blocks wouldn't affect that metric then and I'd say that's exactly what it's reporting and getting it right.",
        "created_at": "2020-12-01T23:27:07.059000+00:00",
        "attachments": null
    }
]