[
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'm not sure that argument holds, mainly because of this bit:\n\n\u003e This honest actor very well might just broadcast the found slashings on the gossip channels for any proposer to pick up rather than waiting until they get a chance to propose.\n\nUnless I'm missing something in the spec (or my understanding of python, which is a significant possibility), there is no reward for finding a slashing, only for proposing it.  `slash_validator` takes three arguments `(state, slashed_index, whistleblower_index)` but `whistleblower_index` is never specified in any of the calls made to it hence all rewards go to the block proposer.  And even if it were the case that a `whistleblower` could be supplied, there's nothing to stop a proposer  stripping the relevant information from a slashing and making its own to incorporate in to its block to gain the reward.\n\nSo anyone that finds a slashing condition will hold on to it until they can propose a block, at which point they will include the slashing.  But they won't broadcast it as that would be giving money away.\n\nOr did I miss something?",
        "created_at": "2020-01-19T00:39:31.685000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The whisteblower argument there was put in place for later uses in phase 1+. Indeed, for phase0 the proposer has the ability to take the reward, even though someone else may found it and benevolently put it on the gossip.",
        "created_at": "2020-01-19T00:43:37.197000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Selfish validators may choose to not share the slashing, but that does not mean others cannot discover the slashable event themselves, and so we just need any other validator to share it on gossip for proposers. And proposers would all have to be oppressed/bought each slot (until the slashing is uneffective some time far in the future) to keep the slashing from going on chain.",
        "created_at": "2020-01-19T00:47:54.416000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If you assume everyone is just lazy, and even though otherwise honest, not going to catch slashings, then it indeed reduces to only proposers being incentivized to search for slashings, and others only very minimally (deflation). Agree that would be nice to improve, but how much of a problem it is in practice is debatable",
        "created_at": "2020-01-19T00:51:41.879000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Two points here:\n\n  1) I don't see how this jives with Danny's argument that a malicious actor could slash themself to reduce their cost, given they have to be quite lucky to propose the next block (luck being inversely proportional to the % of validators they control) or at least the next block before someone notices the slashing themself.  Surely, in a world where there are active slashing police, this would be a minimal reduction.\n\n  2) The fact that detecting slashing goes unrewarded seems to be a significant weakness.  The network is relying on altruism from slashing police for it to provide a proper deterrent, and that doesn't appear to be a great assumption.  (If everyone is running a slasher then this changes somewhat, but that goes back to the original question of resources spent Vs. reward)",
        "created_at": "2020-01-19T01:01:11.762000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e given they have to be quite lucky to propose the next block \nThey don't have to be lucky, they can just time publishing of their bad act whenever they see the chance to propose. Looping back resources to the possible attacker is dangerous, as that's the very thing that can make new types of attacks sustainable.\n\n\u003e detecting slashing goes unrewarded\nIncluding them is however. And agree that incentives could be better, but we do have the most minimal trigger: just any single non-lazy actor in the system (not even a validator possibly) is sufficient to get the slashing on the radar.",
        "created_at": "2020-01-19T01:10:36.737000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So on the first point I'd agree, if it were possible to do anything interesting with a single bad act.  But you'd realistically need thousands of bad attestations, would you not?  With max 8 attestation slashings per block that wouldn't be a significant reduction.\n\nAs for the second point, I don't get \"non-lazy\" as the trigger.  What you need is \"altruistic\", given that at the moment they broadcast the slashing condition they lose the ability to claim the reward for finding it (unless they are about to propose, but then they'd hang on to it anyway).",
        "created_at": "2020-01-19T01:17:16.190000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I do think it is a reasonable assumption that archive actors (block explorers, etc) will run slashing policing altruistically, and that validators would police a small fraction of the space semi-altruistically (but they are more primed to save the attestation for self-inclusion that broadcasting)\n\nSlashing policing has a much larger problem in that we expect slashings to be exceedingly rare -- especially large ones that might be profitable to find. The expected payout for slashing policing regardless of reward then approaches 0 and we at this point _must_ rely upon some level of altruism rather than rational behavior. \n\nI've explored the idea of inducing faults via the protocol rules to continuously incentivize policing (validator locally knows they should create a fault, others find their fault, validator proves they were supposed to create the fault -- finder and participant validator win a reward). Unfortunately these schemes can be gamed by just passing your fault messages along to other validators that are in your control, and they introduce added consensus complexity. Open to surveying more potential schemes here, but we haven't found something that is reasonably simple and avoids such pitfalls",
        "created_at": "2020-01-19T15:19:40.969000+00:00",
        "attachments": null
    }
]