[
    {
        "author": "wschwab",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hey all, William from the Cat Herders here. This tweet got me thinking: https://twitter.com/mysticryuujin/status/1302051842332000257\n\nDo you (any/all of you) think that there is a good way to implement war games for the Beacon Chain? I don't really have an idea about how structured games could provide useful context for the chaos of the system actually going live, but your opinions are certainly more educated than mine. Even if we don't have a good implementation for war games, should there be clearer protocols about under what conditions a fork would happen?\nI'd be happy to present any ideas to the Cat Herders, and to help wherever I can.",
        "created_at": "2020-09-06T10:44:00.534000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Wouldn't it just be a matter of \"he who has the most nodes wins\"?",
        "created_at": "2020-09-06T10:44:55.869000+00:00",
        "attachments": null
    },
    {
        "author": "wschwab",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Or maybe he who can coordinate the most nodes. Though I'm not sure what that would look like, either. That's one of the reasons I'm asking, seeing if anyone has a vision for how such a thing might work. I could see value in a full fork rehearsal, but I would think that's different than trying to add in some kind of adversarial aspects.",
        "created_at": "2020-09-06T11:48:17.865000+00:00",
        "attachments": null
    },
    {
        "author": "_0xuser",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There are attacknets running, and I've seen discussions about doing a hard fork on Medalla to test the process",
        "created_at": "2020-09-06T12:37:05.276000+00:00",
        "attachments": null
    },
    {
        "author": "wschwab",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Does this need a proposal on the call? How might this move forward?",
        "created_at": "2020-09-06T14:23:27.825000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Also worth nothing that we've seen what happens when there are chain splits on various test networks. If you have a reasonable split of clients finality stops, client devs fix the bugs and eventually everything converges on the same chain and carries on again (this effectively happened in the Medalla chaos in a few different ways). If one client has more than 2/3rds of the validators, then the chain finalizes with whatever bug that client happens to have.  That's really messy and would require a lot of out of band coordination to sort out.  We saw this with one of Prsym's testnets (maybe Sapphire?) but since it's goal was to be a single client testnet anyway we just left it run as-is and only Prysm could ever sync it.",
        "created_at": "2020-09-06T20:53:51.855000+00:00",
        "attachments": null
    }
]