[
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "What's the rationalte behind the whistleblower reward being so low?  Given the criticality of being able to detect slashings for safe operation of the network, the effort required to keep track of the data to calculate a slashing, the fact that whistleblowing rewards are a race, and the expectation that slashings will be rare, a max reward of ~0.05 Ether seems cheap.\n\nI know it could be argued any way, it just seems to me that the whistleblower reward is out of whack with the benefit it provides the network and the punishment meted out to the slasher.",
        "created_at": "2020-01-18T10:23:41.307000+00:00",
        "attachments": []
    },
    {
        "author": "kiwi.eth",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Agreed, the people running a slashing client will probably be running them entirely out of goodwill. They're not very common under normal conditions no?",
        "created_at": "2020-01-18T18:36:34.756000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So any amount of whistleblower reward technically reduces the theoretical accountable safety because the attacker could in theory just slash themselves (knowing they are going to get caught, just got ahead and turn themselves in).\n\nImagine for example that the whistleblower reward was 100% of the offending validator's balance, in this case the attacker performs the attack, then turns themselves in (with another validator ID) for what ends up being a cost-free attack.\n\nThis is the extreme case, but even at moderate amounts, you reduce the total cost of attack. The current value in the spec is an attempt to find the balance between incentivizing policing and this implicit attack cost reduction. \n\nThe nice thing about slashing protection is that there only needs to be at least one honest (not necessarily rational) and well-connected actor on the system policing. This honest actor very well might just broadcast the found slashings on the gossip channels for any proposer to pick up rather than waiting until they get a chance to propose. In such a case the 0.05 ETH for a proposer listening to and picking this up off the gossip channel now looks like a great TX fee for including it in the block.\n\nBeyond this min(1) actor assumption, it makes a lot of sense to split up the policing domain randomly across validators so that they contribute to policing but are not over burdened. I think this should be a strong default in clients out the gate.",
        "created_at": "2020-01-18T23:58:36.419000+00:00",
        "attachments": []
    }
]