[
    {
        "author": "kiwi.eth",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hey \u003c@!291925846556540928\u003e , looking at how we can improve double block detection\nChecking the network spec, I'm seeing that if a block for a slot and proposer index has already been seen, clients aren't supposed to broadcast it\nSpec here: https://github.com/ethereum/eth2.0-specs/blob/dev/specs/phase0/p2p-interface.md#global-topics\n\nIs this a validation condition that should be ignored for sending blocks to the slasher?",
        "created_at": "2020-05-29T17:49:00.161000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "if you're running a slasher, I think that you should drop the block on the network, but forward to your local slasher",
        "created_at": "2020-05-29T18:02:26.219000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "problem is that if you see more than 2 and keep forwarding, you've created a dos vector for yourself",
        "created_at": "2020-05-29T18:03:00.332000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "so you might still cap the number to send to the slasher",
        "created_at": "2020-05-29T18:03:08.062000+00:00",
        "attachments": []
    },
    {
        "author": "kiwi.eth",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I see, thats a good point, thanks",
        "created_at": "2020-05-29T18:04:02.763000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "so it's beyond the scope of the basic network spec. It might be worth a note that it's dropped on the network but might be worth checking for slashing... hmm not sure if the network spec should concern itself with this case or not",
        "created_at": "2020-05-29T18:04:44.314000+00:00",
        "attachments": []
    },
    {
        "author": "kiwi.eth",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "No worries if its out of scope for the spec, wanted to ask to make sure if it was the right way to approach this",
        "created_at": "2020-05-29T18:05:50.117000+00:00",
        "attachments": []
    },
    {
        "author": "kiwi.eth",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Also, we've been seeing some issues of having the slasher rely on the beacon node, notably the requirement for indexed attestations. Curious on whats your thoughts are regarding having the slasher client be a beefed up beacon node, vs. a separate client that relies on a beacon node for indexed attestations and blocks",
        "created_at": "2020-05-29T18:06:09.597000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "what does the unification buy you in terms of the indexed attestations? presumably, they would need to be created regardless of whether it was integrated or separated\nI think i'm missing something",
        "created_at": "2020-05-29T18:15:49.785000+00:00",
        "attachments": []
    },
    {
        "author": "kiwi.eth",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Since the slasher is a separate entity right now, a few benefits could probably be made if it acted more like a beacon node:\n- Attestations could be saved in the DB as indexed attestations, this saves a lot of expensive computing for historical slashing detection, since currently the beacon node needs to first generate the historical state needed to convert the attestations.\n- Because of ^, requesting historical indexed attestations is intensive and the beacon node chokes, preventing it from giving roles to validators. This means if you want to perform historical detection, its best performed on a beacon node that has no validators connected to it.\n- There are quite a few places of logic that require modifying the beacon node to adapt to the slasher being a separate client like above in the network spec^^^, whereas if the slasher were a beacon node, it could be adapted to handling everything without cluttering the beacon node with additional logic.\n\nAlso, we've been adding functionality to the slasher that lets it serve as a \"slashing protector\", letting the validator query the slashers history to make sure the validator isn't committing a slashable vote, but this Beacon Node -\u003e Validator -\u003e Slasher -\u003e Validator -\u003e Beacon Node process is rather cumbersome. This is probably the main benefit we'd get from a change like this",
        "created_at": "2020-05-29T18:29:40.600000+00:00",
        "attachments": []
    }
]