[
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!291925846556540928\u003e, I noticed that `ATTESTATION_PROPAGATION_SLOT_RANGE == 32`. I assume this is set to one mainnet epoch. If we were running a minimal-spec testnet, should this be `8`?\n\nI'm not so much interested in the answer to this question as much as this larger one: does the spec actually support \"minmal\" testnets across-the-board or are they just a testing concept?\n\nWe currently allow for starting a \"minimal\" testnet, but if the specification is going to evolve without respect to it then perhaps we will remove this feature. I don't think ditching support for a minimal spec would necessarily be a _bad_ thing for us; we're now at a stage where a small mainnet spec testnet is trivial to run on low-spec hardware and it would reduce complexity.",
        "created_at": "2020-03-29T07:45:44.686000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If it will be useful for some purposes I haven't thought about (e.g., other clients would like it) then it's not an issue to keep supporting it for now. We'd probably have to add a little \"no guarantees\" cavet though.",
        "created_at": "2020-03-29T07:48:26.835000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "One thing it is useful for is to minimize size of tests. Distributing full mainnet states is bad, and already at its limit (there are more minimal size tests). One thing that could help is a new testformat that deduplicates state between tests, but that requires clients to support a new state loader. If you have ideas, or feedback on what your client is willing to implement for more tests, but higher input complexity, let me know.",
        "created_at": "2020-03-29T17:20:47.571000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Another possible approach; if there was some program provided with the test-suite, to read/extract the state from a bigger (optimized) compound of states, can it be integrated into clients? Something in-between loading raw files (status quo) and completely orchestrating tests (eth1 hive)?",
        "created_at": "2020-03-29T20:54:47.440000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I wasn't thinking of removing it for the tests, I was thinking about actual application-level functionality.",
        "created_at": "2020-03-29T22:11:41.645000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "e.g., `lighthouse --spec minimal beacon_node`",
        "created_at": "2020-03-29T22:11:57.331000+00:00",
        "attachments": null
    },
    {
        "author": "sly_gryphon",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e In general, I feel like we should just standardize on a \"display format\" that includes checksums \n\u003c@!273808422753796097\u003e \n\nIf this is done before release, then that would make sense. The example at the moment would be for communicating the Withdrawal Hash, i.e. person A has the secrete key for withdrawal, generates the hash and sends it to person B, who has the hot secret key for the validator.\n\nThe validator pub key would be derived directly from the secret key that needs to be available to sign, so no issue there. But the withdrawal hash might be sent on mobile via Signal and be typed into the deposit generator application... so that is where a checksum would be useful.",
        "created_at": "2020-03-29T22:28:20.255000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e If we were running a minimal-spec testnet, should this be 8?\nYes you are correct. it would be better for that to be defined wrt `SLOTS_PER_EPOCH` and for those new networking values to make their way info config",
        "created_at": "2020-03-29T22:37:36.562000+00:00",
        "attachments": null
    }
]