[
    {
        "author": "philcares",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Have you ever thought about a decreasing reward for stakers with larger stakes? e.g. to avoid huge staking pools? What have been your thoughts about it?",
        "created_at": "2020-06-19T07:20:36.042000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The unit of work is already set in units of a maximum effective balance of 32eth. If you go above that, you have to run more validators for it to be effective. The challenge we are really facing is to encourage running validators on different machines as much as possible. By making that accessible, and modeling slashing cost to be higher when more get slashed at the same time, that is at least a start.",
        "created_at": "2020-06-19T07:30:25.319000+00:00",
        "attachments": []
    },
    {
        "author": "philcares",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hmm maybe decrease rewards with increasing numbers of validator per node? I am trying to think about other incentives for people to run their own validator. Any other ideas than modeling slashing?",
        "created_at": "2020-06-19T07:52:35.678000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You'd need to start with a foolproof way of knowing which validators are on which nodes.",
        "created_at": "2020-06-19T07:54:19.542000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Knowing which validators run on which node would also be terrible for privacy. What we should be doing is lowering the cost of decentralization as much as possible, so that there's little to no reason left for anyone to run too many on a single machine",
        "created_at": "2020-06-19T08:20:32.728000+00:00",
        "attachments": []
    },
    {
        "author": "sacha6557",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e trustless staking pools are a key part of this puzzle  (it's actually a design goal of the spec to support them, but we've done a terrible job at communicating it so far)",
        "created_at": "2020-06-19T13:29:42.024000+00:00",
        "attachments": []
    }
]