[
    {
        "author": "Deleted User",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "what happens to someone who havent updated in time for the beacon chain hardfork? will they be losing money?",
        "created_at": "2021-05-28T20:22:06.856000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "whats the name of the hardfork again.",
        "created_at": "2021-05-28T20:37:21.871000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Validators who don't update their node will stay attesting and producing blocks, but spin off in their own fork. Assuming they are a minority and stay in consensus with other non-updated validators, you get two chains:\n- The legacy chain, which will not perform well with just a minority of validators online, and an inactivity-leak kicks in, causing the online validators to not earn the common rewards, and all updated validators will appear as inactive and get penalized at an accelerated rate. It will leak out all offline validators (a lot!), and eventually stabilize. When it manages to leak out that many validators, it can technically finalize again, and continue to exist. But if we're talking about a 5% fork, it will likely be very chaotic on this chain.\n- The upgraded chain, where all updated validators will operate like normal. The inactive minority will appear as inactive, but if there are not many, the chain will keep finalizing, and the accelerated inactivity leak will likely not kick in. The non-updated validators will get penalized just as if they were offline. The non-updated validators can safely update, and then their node will reorganize to join the canonical chain.",
        "created_at": "2021-05-28T20:38:50.830000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Altair",
        "created_at": "2021-05-28T20:39:06.579000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "tyvm.",
        "created_at": "2021-05-28T20:39:24.010000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Will the stakers signal readyness before it locks in or will it just be a specific date no matter what?",
        "created_at": "2021-05-28T20:40:30.772000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Makes it easier to research the HF when u got the name. Might i suggest pinning it or something 🙂 Have a nice day.",
        "created_at": "2021-05-28T20:49:11.226000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@456226577798135808\u003e you can find the specs here, with all planned upgrades in the main landing doc: https://github.com/ethereum/eth2.0-specs",
        "created_at": "2021-05-28T20:56:11.520000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Thank you that site is super informative",
        "created_at": "2021-05-28T20:58:21.258000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Not sure about fork-readiness signaling yet. Maybe we'll ask validators to signal readiness via the graffiti in blocks, but I expect we'll do bigger public testnets, hardfork existing testnets, and communicate a lot with community, before we actually do the mainnet fork.",
        "created_at": "2021-05-28T20:58:24.101000+00:00",
        "attachments": []
    }
]