[
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "In the last implementer's call it was mentioned that a better approach to the balancing attack was already being explored and that it wouldn't need a hard fork. Also in the closed PR this was hinted. I know that not necessarily a fix for this attach needs to include a fix for the late-block problem. But since this was mentioned in the first public release of this issue, I still have my hopes up that Aditya's research is along these lines.",
        "created_at": "2021-03-30T00:30:03.903000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yes research is on going, though this is the second fix we've wound up abandoning I think...\nAnd it won't require a hard fork because fork choice is not actually part of consensus so the upgrade doesn't have to happen in sync as long as in most cases nodes will select the same chain and that they'll eventually coalesce if they do pick different heads at some point.",
        "created_at": "2021-03-30T00:31:54.508000+00:00",
        "attachments": null
    },
    {
        "author": "dkdkdkdkdkdk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "from https://github.com/ethereum/eth2.0-specs/blob/dev/specs/phase0/validator.md#attestation-data\n\u003e A validator should create and broadcast the attestation to the associated attestation subnet when either (a) the validator has received a valid block from the expected block proposer for the assigned slot or (b) one-third of the slot has transpired (SECONDS_PER_SLOT / 3 seconds after the start of slot) -- whichever comes first.\n(b) sounds like it's voting for an empty slot?",
        "created_at": "2021-03-30T08:15:52.257000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It would be voting for the previous head here",
        "created_at": "2021-03-30T08:28:39.507000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "not an empty slot",
        "created_at": "2021-03-30T08:28:43.814000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If you are late for your slot, will your block eventually fill in as something akin to an uncle (with reduced rewards)?  Or if you miss then your slot is permanently empty?",
        "created_at": "2021-03-30T12:37:46.934000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "it's permanently empty on the fork you were supposed to propose a block",
        "created_at": "2021-03-30T12:38:59.173000+00:00",
        "attachments": null
    }
]