[
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@602753420033785856\u003e I didn't want to hijack the discussion in the LMD fix. But regarding your comment in \u003chttps://github.com/ethereum/consensus-specs/pull/2353#issuecomment-950238004\u003e, I think it's going to be hard to get clients to adopt an orphaning approach cause regardless of the statistical degree of certainty that you may have that the block was counted as late and therefore without the boost (for example if you're packing almost zero attestations for block `N` and you are proposing `N+1`)  it is still an unnecessary risk with the only benefit of getting a few more attestations. The boost creates an incentive post merge if it's the case that the MEV that you can get by orphaning the block upsets  the risk of your own block being orphaned. But I think the MEV argument makes it very hard to analyze all the nuances that this PR is going to bring from a game theoretic perspective. For the proposer of slot 1 (right after slot 0) it may become particularly easier to hijack and steal the MEV from slot 0, since those blocks are naturally slower, both to broadcast as well as to validate. My personal gut feeling about this PR is that there's something smelly when we put in the spec, and in particular in our fork choice,  different scores for events we cannot prove that happened (for example that the block arrived late).",
        "created_at": "2021-10-24T02:33:52.972000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think there’s probably a threshold at which it’s quite safe to orphan. My idea is an extension of the existing subjectivity around block proposal: if the previous block arrives after the 12s mark I have no choice but to orphan it, and if I get it really late (e.g. 11.5s) I have plausible deniability about having never received it.\n\nThe fact that the orphaning would rely on the attestation weight rather than the block’s arrival time also makes it less subjective. If you look up a block long after it was published and find that it has a minuscule number of votes and lots of attestations to its non-existence – that’s pretty good evidence that it was published late. Or in other words: it would be difficult to trick a proposer into accidentally orphaning a block because you would have to delay not only the previous block’s propagation but also all the attestations to it\n\nIn the case of a single skip the attestation block reward paid is almost double that paid for a regular block, so the expected value starts to look very appealing for probabilities of success significantly above 50%. And as you say, MEV probably makes it even more appealing, although I’m not familiar enough with MEV to know what the natural limit is (on the beaconchain you eventually run out of block space/messages go stale)",
        "created_at": "2021-10-24T08:48:26.531000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I hear you and I'm with you on orphaning blocks in general, and I agree there must be a threshold. I find it hard to determine and specify it though. Currently orphaning a late block in phase0 is a win-win situation for every party involved except the late proposer: besides the extra attestation reward for the new proposer and getting the right head for the late attesters, there's the issue that for voters of the late block, when they are only a few, it is more convenient to get the head wrong and be included in the next slot than actually voting for the right head. Altair makes it a little worse for everyone in this situation since everyone, late or not, would not get timely head. The problem I see with a policy that encourages for subjective orphaning post-merge is that MEV is potencially infinite (and practically is wrt to attestation rewards) and then we run into issues with censorship. I suspect \u003c@!301186049323958275\u003e will want to weigh-in in these matters and probably that PR.",
        "created_at": "2021-10-24T09:52:17.726000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I myself  think that we should find a way to orphan every block that is produced after aggregation. I don't know if this is possible though, but something that I think may be worth considering that may help alleviate the issue of late blocks, is shortening the time between attestation and aggregation. I haven't seen experiments around these and these parameters were chosen without a highly peered network to actually test. I have been firing attestations at 6 seconds on pyrmont without any penalty.",
        "created_at": "2021-10-24T09:54:41.883000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I haven't been following the conversation closely, why would I have an opinion on this matter?  😬",
        "created_at": "2021-10-24T09:56:28.523000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "take a look at the linked PR up there, it's a proposed fix for a possible balancing attack on the consensus layer. It adds a subjective score that may encourage orphaning of late blocks. The problem I find with these proposals is that it may also help (albeit it may be minimal) to censor certain blocks, since you are a paladin of anti-censorship, I figured you'd want to take a look at this.",
        "created_at": "2021-10-24T10:00:32.539000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The relevant comment is the one by Michael",
        "created_at": "2021-10-24T10:01:20.431000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think \"Zealot\" may be a more apt term to describe what I am.",
        "created_at": "2021-10-24T10:01:20.655000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It is unclear to me why individual clients in the network scoring a slot based on the time they saw the block is a censorship problem?",
        "created_at": "2021-10-24T10:07:53.591000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "MEV can definitely incentivize people to build on top of an old (not latest head) block, but this seems unrelated to the fork choice rule using time of receipt for its decision making.",
        "created_at": "2021-10-24T10:08:59.640000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If I build a block on top of `N-2` instead of `N-1` as I am supposed to, current fork choice will make my block be orphaned since the block in `N-1` will have higher LMD score. If however a block `N-1` is late under the propsal in this PR, and I build on top of `N-2`, my block will have a boost in the LMD score while `N-1` is highly likely not to have it, so attesters at `N` will follow my fork. Currently, if I am proposing at `N` and see a late block `N-1`, I still build on top of `N-1` cause the risk of getting my block `N` orphaned is high",
        "created_at": "2021-10-24T10:13:24.992000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If `n-1` is late for everyone, then it *should* be orphaned.",
        "created_at": "2021-10-24T10:14:23.323000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "What you are describing seems incentive aligned with the goal of proposers proposing blocks as early as possible, rather than as late as possible.",
        "created_at": "2021-10-24T10:14:52.121000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Extractable value drives block proposers to propose as late as they can, and it does seem like we want some mechanism to counterbalance that.",
        "created_at": "2021-10-24T10:15:08.781000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "More generally: individual proposers can mitigate the risk of orphaning that is introduced in this PR by engaging in a behavior that the protocol finds desirable.",
        "created_at": "2021-10-24T10:16:22.301000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If everyone mitigates their own risk of orphaning (by proposing early), then this proposal will have no effect on censorship because no one would be down-ranked for being late.",
        "created_at": "2021-10-24T10:17:21.446000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It only affects censorship if proposers are proposing late, and this specifically is introducing incentives to prevent people from proposing late.",
        "created_at": "2021-10-24T10:18:23.342000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e I *would* agree with your assessment on two potential conditions:\n1. If there was no grace period for being penalized.  For example, if someone who got a block out after 0.5s was scored higher than someone who got a block out after 1s (with no 4 second grace period), then I would agree with your assessment.\n2. If it is not *reasonable* for everyone to be able to get a block out and propagated across the network within the grace period.  I think you are alluding to this point a little bit for the first slot in an epoch, but I am not informed enough to know if the grace period is long enough despite the additional work required.",
        "created_at": "2021-10-24T10:24:28.038000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I also didn't look at the proposal closely, but I'm operating under the assumption that your score decreases as a function of how late you were.  So if you are 0.0001 seconds late from the point of view of a particular client, then that client will score you insignificantly lower than a block that was received within the grace period.  If the penalty is flat, then I disagree with that strategy and think the penalty should be a function of tardiness.",
        "created_at": "2021-10-24T10:25:50.398000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I can see an argument being made for (2).  4 seconds does seem aggressive for propagation across a global peer to peer network, especially given that non-zero amount of work needs to be done at each hop in the journey, and a non-trivial amount of work needs to be done to create the block in the first place.",
        "created_at": "2021-10-24T10:27:52.847000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "However, I have been told by people who have researched this more than me that \"4 seconds is fine\" and I blindly Trust the Science. 🧑‍🔬",
        "created_at": "2021-10-24T10:28:18.893000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There's no \"scale\" as far as I can see, the boost depends on the `commitee_weight` only. I think we are all in line with orphaning late blocks in the happy situation. The only thing that worries me of these subjective scores is that if I get a block say at 7 seconds, and I see it has 1% of the usual votes for it. This is a \"valid\" block that I can probably safely orphan with this PR, and not currently. How about if I see it with 20% of the usual votes, and how about 40%? I claim that there is a number where my \"orphaning a late block\" becomes my \"censoring a valid block\" and my incentives to do so change after this PR, giving me a different reward/risk quotient, and when MEV is present, this is exaggerated.",
        "created_at": "2021-10-24T10:42:10.760000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Because of MEV, you are almost always incentivized to orphan a block if you can get away with it.  I don't think this proposal moves the needle on that front significantly.",
        "created_at": "2021-10-24T10:43:35.960000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Again though, I have imagined the technicalities of this proposal and maybe my mental model is wrong.",
        "created_at": "2021-10-24T10:43:49.784000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "That is to say, you should pretty much *always* try to orphan a block if you can get away with it within the protocol rules.",
        "created_at": "2021-10-24T10:44:22.980000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This change introduces a scenario that will cause you to be able to get away with orphaning a block, but IIUC that scenario happens only when the previous block producer failed to do their job.",
        "created_at": "2021-10-24T10:45:31.518000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e Do you agree or disagree with the following two statements (feel free to add nuance):\nA. If everyone submits blocks in a timely fashion, this proposal doesn't have any effect.\nB. If someone submits a block late, that block producer should be punished in some way.",
        "created_at": "2021-10-24T10:46:59.592000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I agree with both statements, the only problem I find is that proving that B happened is hard. And doing it subjectively is smelly to me. I think it boils down to your statement:\n\u003e  I don't think this proposal moves the needle on that front significantly.\nI am not sure about this statement, and I think a good evaluation of this may prove difficult.",
        "created_at": "2021-10-24T10:52:44.696000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I don't believe we need B to be done objectively.",
        "created_at": "2021-10-24T11:07:14.760000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Each validator follows their own fork-choice rule/logic, and we cannot change that.",
        "created_at": "2021-10-24T11:07:40.247000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This proposal is suggesting that the *default* fork-choice logic built into clients should prefer block producers who are quick rather than those who are slow.",
        "created_at": "2021-10-24T11:08:07.242000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The hope is that if most people run stock clients, then the network as a whole will incentivize the behavior we find desirable (produce blocks as fast as possible, rather than waiting until the last moment).",
        "created_at": "2021-10-24T11:08:44.039000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yeah I find that statement above convincing 👍",
        "created_at": "2021-10-24T11:10:45.745000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Will have to mull over this to figure out why I find this whole thing smelly",
        "created_at": "2021-10-24T11:11:40.207000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "My guess is that what you really find smelly is the fact that fork choice rules are entirely subjective, and this situation just draws that to your attention.  😄",
        "created_at": "2021-10-24T11:22:22.507000+00:00",
        "attachments": null
    }
]