[
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "In the standard API you should be able to query for the block header for a given slot, and the beacon node will tell you (a) if it has the block and (b) if it is canonical or not.",
        "created_at": "2021-11-20T08:54:35.785000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "(And yeah, most beacon nodes remove orphaned blocks when they recognize them as orphans, so attempting to fetch historically orphaned blocks can be an issue.  I'm sure that we have already lost any number of orphaned blocks to the winds, 'block archaeologist' could be a thing in the future.)",
        "created_at": "2021-11-20T08:55:55.963000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Querying by slot should only give you canonical blocks - otherwise it would have to support returning multiple blocks in the response.",
        "created_at": "2021-11-20T08:57:11.104000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This is for block _headers_, not blocks.  The block headers returns an array, for the purpose of being able to have a link to non-canonical blocks without overburdening the blocks endpoint with returning an array (which we decided was something that very few people would ever want).",
        "created_at": "2021-11-20T08:59:12.120000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "(Sorry realized that that was not at all clear in my initial response.  Way too early for me to attempt to be cogent.)",
        "created_at": "2021-11-20T08:59:58.016000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hmm I’m not familiar with that endpoint and if I had to guess I’d say that’s not what teku does but I could easily be wrong.",
        "created_at": "2021-11-20T09:50:55.443000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Or possibly it was wrong and \u003c@680234424037670912\u003e fixed it as part of our work to store orphans…",
        "created_at": "2021-11-20T09:52:01.139000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yeah, just did a quick check and teku does not return orphaned block headers (or blocks, even in archive mode).  Lighthouse does the same, and prysm returns block headers but doesn't return the block (quick test on mainnet block 2547130).",
        "created_at": "2021-11-20T11:48:15.884000+00:00",
        "attachments": null
    }
]