[
    {
        "author": ".vbuterin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I like this",
        "created_at": "2021-11-25T18:49:11.991000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I definitely think \"asking a friend for their WS checkpoint\" should be as easy as possible",
        "created_at": "2021-11-25T18:49:31.121000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Maybe the WS checkpoint should even be somewhere in the corner of the client UI or regularly outputted in command line logs",
        "created_at": "2021-11-25T18:49:58.910000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I wonder if we can get some numbers on the percentage of nodes that are syncing vs those that are serving. This is an easy number to get from our current nudes. If this number is not high as I suspect. We could simply chunk the ws state and require beacon nodes to serve chunks. Even relying on the fact that from your peers, you will have a few running on stock clients not modified to not serve it. It should be easy to accomplish a quick sync without the need to enforce good behavior and without a steep take on bandwidth",
        "created_at": "2021-11-25T21:49:45.704000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The key problem is finding which state to trust - you can't trust the network because of weak subjectivity.  If you have a source you trust to identify the right state, its pretty trivial to just transfer it over HTTP from there.",
        "created_at": "2021-11-25T22:05:19.645000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Those are two separate issues, you do your `N` calls to `checkpoint_root(epoch)` and then you request the different chunks of the state to your peers. If only one is malicious you will fail your check and then you move on to more centralized actors as in the document. The disadvantage is a slightly longer liveliness problem in the case of a malicious peer, with the same overall security and a much better UX in the happy case",
        "created_at": "2021-11-25T22:22:16.522000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Why would we go to all the effort of being able to connect to the network without knowing your finalized state, finding peers, defining topics and chunking etc when we need to use HTTP to request the checkpoint root in the first place?  Why not just use HTTP - faster, simpler and no loss of trust (you can verify the state matches the checkpoint root)",
        "created_at": "2021-11-25T22:36:15.228000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Because instead of relying on a few trusted or semitrusted organisms that send the states we can rely on our own network of 260K+ validators that have the state. And if you prefer to take it from elsewhere via http that's still an option, I'm not saying to forbid clients from getting the state from anywhere I'm saying for the protocol to require clients to serve it (even if capped) without any actual penalization if they don't",
        "created_at": "2021-11-25T22:41:19.074000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "But you *can't* trust the network, that's the whole point of needing the WSS state in the first place.  And any service that can calculate the wss checkpoint to return the root, could just as easily return the state itself. There's just no reason to go to the complexity of getting the state via p2p - it's massively more complex and slower but has no actual benefit.",
        "created_at": "2021-11-25T22:50:41.632000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "All the trust in the system comes from the servers you're getting the checkpoint root from. If they're not available you can't progress, if they return the wrong root you're done. You aren't reducing the level of trust in those servers by getting the state from elsewhere - you're just increasing the complexity and adding more points that you now need to depend on.",
        "created_at": "2021-11-25T22:51:53.904000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I agree I'm not reducing the level of trust, I'm questioning your assumption that getting the state from a few centralized servers that have to serve every one syncing is faster than getting it from the 100 peers I have right now at over 60Mbps",
        "created_at": "2021-11-25T22:53:29.191000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'd be fine with people setting up bittorrent or other alternatives outside the protocol - I don't think it's at all worth it for a relatively small file like the state, but don't add this extra complication and the associated DoS vectors to the p2p spec.",
        "created_at": "2021-11-25T22:55:14.246000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It also places an additional storage burden on validators (in addition to the bandwidth) because they currently have no requirement to store any state beyond the latest finalized one (and Teku doesn't by default).",
        "created_at": "2021-11-25T22:55:32.614000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Can you import a file as well, or does it need to be a URL?",
        "created_at": "2021-11-25T22:55:39.524000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yep you can import a file.",
        "created_at": "2021-11-25T22:55:50.831000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Awesome 🙂",
        "created_at": "2021-11-25T22:55:54.685000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So I can just give people a state file (~60 MB or sth right) as a p2p type of trust system. Seems good enough to me, and I'd say it's even preferable to have it out-of-band",
        "created_at": "2021-11-25T22:56:48.191000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The problem of having it out of band is the problem of having it current",
        "created_at": "2021-11-25T22:57:59.755000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yes if you have a friend running a node the easiest thing is to just get them to send you the state from their node and run with that.",
        "created_at": "2021-11-25T22:58:21.338000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This is actually not that difficult since it doesn't need to be perfectly up to date.  Before Infura added the ability to download states directly I used to just push a state to a github repo when people wanted it.  Having to trust me wasn't good but the distribution system worked fine.",
        "created_at": "2021-11-25T22:59:26.186000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "As long as it's within the WS period it's fine right?",
        "created_at": "2021-11-25T22:59:38.201000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Which is precisely what I'm saying: force every validator to be your friend",
        "created_at": "2021-11-25T22:59:43.115000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You can't do that. You can't trust the network for this.",
        "created_at": "2021-11-25T22:59:59.188000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If you have a source you can trust to get the root, just get the state from them - it's trivially easy.",
        "created_at": "2021-11-25T23:00:26.282000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'm not trusting the network, it fails just the same (actually worse because it requires only one bad peer) than any other method. Trust is only on the root you get",
        "created_at": "2021-11-25T23:00:55.825000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "But if you can get the root, it's just as easy to get the whole state.",
        "created_at": "2021-11-25T23:01:12.047000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I've got a ton of experience doing this in the real world and distributing the state is trivial.",
        "created_at": "2021-11-25T23:01:44.446000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And we're going in circles: I can't believe this actually. I'm getting a state in a matter of seconds from my peers currently",
        "created_at": "2021-11-25T23:01:56.635000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Your peers don't provide a state currently.",
        "created_at": "2021-11-25T23:02:25.587000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We'd have to build all that infrastructure which is pointless because getting the state is already a solved problem.",
        "created_at": "2021-11-25T23:02:39.631000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "My peers know how to send me ssz objects, I claim that the infra to do this is trivial at least from prysm codebase. Is true that it would require validators to keep the last ws checkpoint state, but that was the whole point of my proposal: we already have a p2p network in place, use it",
        "created_at": "2021-11-25T23:04:26.147000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You have to rework clients to support connecting to the p2p network before the genesis state is available. We actually went the other way to require the network to NOT be started prior to genesis being known.\n\nBut again, why add *any* complexity to clients? We're not gaining anything at all.",
        "created_at": "2021-11-25T23:06:07.914000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You've just made a HTTP request to a server which is alive and returning the right state root where you could have just got the whole state, but instead you now need to go find peers and hope they're prepared to altruistically send you the state and that it is actually the same state or go find another peer when its not and so on. Why?",
        "created_at": "2021-11-25T23:07:21.741000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Because anyway you will go to the trouble of finding those peers anyway to stay connected to the network. Initial sync would go like this 1) i feed a root I got from a friend in cli just like in the document 2) my client starts discovery and asks peers to give them ws roots, if there's a threshold of discrepancy I stop. 3) my clients asks all it's peers to give them different chunks of the state. In a few seconds I'm up synced and already connected",
        "created_at": "2021-11-25T23:10:32.368000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If there's any failure I go the centralized route",
        "created_at": "2021-11-25T23:10:46.149000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "How is that better than just getting the state from your friend?",
        "created_at": "2021-11-25T23:11:58.564000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You've already gone the centralised root btw - the centralisation point is your friend.",
        "created_at": "2021-11-25T23:12:15.182000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Which is optional if I expect statistically to have at least a couple of honest peers out of 100",
        "created_at": "2021-11-25T23:14:46.392000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "As I will get contradictory roots",
        "created_at": "2021-11-25T23:15:03.044000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And abort",
        "created_at": "2021-11-25T23:15:07.728000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If you bail out because of contradictory roots you will never start up. It's a trivial DoS vector to spam the network with invalid roots. So then you start to balance how much you trust the network vs your friend and things get pretty complex pretty quick.",
        "created_at": "2021-11-25T23:16:09.994000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There's also the point that in the happy case, which is the case in 99.9% of cases in which the network is doing fine an I'm a new user, I should rely first on the network and fallback to centralized manual intervention",
        "created_at": "2021-11-25T23:16:17.489000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "For PoW I'd say sure, for PoS with WS I'd say no",
        "created_at": "2021-11-25T23:17:16.379000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You should absolutely not rely on the network. We've seen attacks in the past with nodes misleading geth in its selection of fast sync pivot block and we will absolutely see the network try to mislead nodes.",
        "created_at": "2021-11-25T23:17:17.873000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "don't default to something that can very much be wrong",
        "created_at": "2021-11-25T23:17:23.885000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Even in PoW, using the network to pick the fast sync pivot block is a weakness. It usually works out but there have been successful attacks in the past - those just used a very early block from the chain which caused nodes to effectively full sync but since that has a low total difficulty they could just as easily substituted a different chain entirely.  More mitigations have been added so it's harder now but you should always check your head against block explorers when syncing a new node.",
        "created_at": "2021-11-25T23:20:10.442000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "In the case of PoW that we're talking about a day to sync and find out if we agree with the root we got that I understand. But in PoS we launch, gather 100 roots, all agree, get the state in 5 seconds, start attesting. Period.  If I launch, one root is different (or two or whatever) I abort, lost 1 second and continue with the previous approach. Third scenario, I launch get 100 roots equal download the state in 5 seconds and it doesn't check. Lost 5 seconds and I go back to whatever other method. For the vast majority of users this is a win: they launch, they are synced and they are attesting. For the few that are in the unhappy path, they lost a few seconds.",
        "created_at": "2021-11-25T23:30:56.397000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "PoW selecting a fast sync pivot block is almost identical to the process of PoS selecting an initial state. The time to download doesn't really matter - you have to be able to verify that the root you picked is correct and that happens quickly.  Short term eclipse attacks are much, much easier than long term ones so having a client start up and make a permanent decision (selecting initial state or pivot block) in a short period is a problem.\n\nSimilarly, having a client shutdown if it sees mismatching roots on the network is a trivial DoS vector because you can guarantee there will be conflicting roots out there both from malicious nodes and just the random stuff you get on a public network.",
        "created_at": "2021-11-25T23:34:25.391000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yes but this DoS is just a couple of seconds and then I go Danny's route so we're really taking about a penalty of a few seconds in the case of one bad peer as I said in my first message",
        "created_at": "2021-11-25T23:36:03.657000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "But if you know you can't trust the network why would you first try to trust it before going to a route that actually can work?",
        "created_at": "2021-11-25T23:36:33.445000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We are indeed repeating ourselves : \nhttps://discord.com/channels/595666850260713488/595701173944713277/913567362026967040",
        "created_at": "2021-11-25T23:37:29.670000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I know I'm repeating myself - I keep trying to identify an advantage to getting the state from the network.\nThe complexity of getting the state from the network opens up additional burdens on network participants, and increases risk to both existing participants and people syncing. We already have experience with distributing states and it turns out it's really simple to do out of band.  Since we need the point of trust to be out of band anyway because we can't trust the network, there's only downsides to doing the state distribution as part of p2p.",
        "created_at": "2021-11-25T23:39:16.601000+00:00",
        "attachments": []
    },
    {
        "author": "bd_0",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hi everyone, I do have a question about the sync committee signatures. Does an inclusion delay play a role for the rewards dedicated for the sync committee participants? From what I've read at the specs so far (and the annotated specs), the sync committee participants are rewarded for each block header signature they produce per slot, and the signature inclusion is checked at the next slot. If their signature for slot `n` is included in slot `n+1` they get rewarded. This means if their signature is delayed, then they won't get rewarded at all. Am I getting this correct?",
        "created_at": "2021-11-25T23:44:15.496000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sync committee signatures must be included in the next slot or they are considered missed.",
        "created_at": "2021-11-25T23:46:58.307000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "so yes you're understanding is correct. In fact they will be penalised for not getting the signature included.",
        "created_at": "2021-11-25T23:47:27.955000+00:00",
        "attachments": []
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "For the record, I'm also hesitant about serving `BeaconState` over the network. It's complex to implement safely and I don't see the value in it when you can download it from *anywhere* and just check the root.",
        "created_at": "2021-11-25T23:48:28.437000+00:00",
        "attachments": []
    },
    {
        "author": "paulhauner",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I find it very hard to imagine a world where the Beacon Chain functions but it's infeasible to obtain a `BeaconState` via any other route than the P2P network.",
        "created_at": "2021-11-25T23:49:58.137000+00:00",
        "attachments": []
    },
    {
        "author": "bd_0",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "yes the penalties are also in the documentation, but I forgot to mention them. Thanks a lot 🙂",
        "created_at": "2021-11-25T23:52:46.690000+00:00",
        "attachments": []
    }
]