[
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Another article related to the beacon chain, this time charting inactive Ether: https://www.attestant.io/posts/charting-inactive-ether/",
        "created_at": "2021-01-21T10:52:53.241000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@144468805697929216\u003e, in the article you cite \n```\nGiven that the participation for the beacon chain is, as of time of writing, above 99% this source is not considered significant enough to include in this analysis at the present time...\n```\nHowever numbers say otherwise, the numbers you computed for Dec 15 indicate 6500 ETH inactive, at that time, the contract address had `1,482,401 ETH` locked, so even if you consider that half of it was active it still means that the validators that aren't correctly voting account for a much larger chunk of inactive ether than the excess and the exited unwithdrawn ether. By orders of magnitude.",
        "created_at": "2021-01-21T11:18:30.635000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Two things about that.  Firstly, the numbers are quite variable in terms of which validators are inactive; it isn't always the same number (there are a few that are, but a lot are on-again-off-again).  Second, the point of the article was to bring across the Ether that could be repurposed to be active, so Ether that isn't-currently-active-but-may-be-next-epoch isn't a useful part of the calculation.\n\nI will take another look at the amount of Ether that is sitting in this category, however, and see what it looks like as a percentage.",
        "created_at": "2021-01-21T11:24:46.429000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "yes I took that article as a point towards transfers, and that's why I'm replying indeed",
        "created_at": "2021-01-21T11:25:33.849000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "With time however there is a nice interplay in the amount of inacive ether because of earnings as a fraction of the total active earnings. As the number of validators entering is capped, the fraction entering daily goes like 1/n while the excess grows like 1/\\sqrt{n} so eventually is does become relevant",
        "created_at": "2021-01-21T11:31:12.771000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Inactive Ether is one of those things that can be a huge issue or no problem at all, depending on how you look at it.  Either way it will go away at some point \"soon\", so perhaps extrapolating it out to 2 years to give some sort of upper bound on it may make sense, as that would show the impact of being able to activate it sooner.  A job for another time, though (I'm approaching the stage where I *really* need to build out some sort of Ethereum 2-aware reporting pipeline for all this data, but just don't have the time now)",
        "created_at": "2021-01-21T11:33:35.756000+00:00",
        "attachments": []
    }
]