[
    {
        "author": "kavka3",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "HI, can anyone point me to any good sources of chain reorganization?",
        "created_at": "2021-08-23T12:14:57.519000+00:00",
        "attachments": null
    },
    {
        "author": "sauliusgrigaitis",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The problem is not building GUI. Grandine has a GUI in Electron that runs beacon node and validator client. It's far from perfect, but this shows that it's doable.\n\nThe real problem is that the promise of staking was that everyone can do home staking. This is a great idea for sure that brings many benefits. However, home staking on commodity hardware is unlikely when the execution layer is added to the mix. We would embed some execution layer client in Grandine GUI just like we did with beacon node and validator",
        "created_at": "2021-08-23T12:16:17.916000+00:00",
        "attachments": null
    },
    {
        "author": "sauliusgrigaitis",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": ", but there isn't much sense realy.",
        "created_at": "2021-08-23T12:16:32.205000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "people are currently sucessfully running on a raspberry-pi including geth, nothing indicates that this will not be possible after the merge, I'd say that a NUC i5 also counts as consumer hardware (which is what I'm running). There are other clients with GUIs, prysm has one as well. But naturally they won't include a GUI for the eth1 node. I claim that the actual solution to these UX problems will come when clients stop worrying about UX and actually just produce a server with a standardized API, and front-end developers take care of the rest.",
        "created_at": "2021-08-23T12:20:46.211000+00:00",
        "attachments": null
    },
    {
        "author": "sauliusgrigaitis",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "well, given how much stakers gave up local eth1 clients and either use Infura or even don't use anything - I don't think that it's as lightweight and easy as \"people are currently sucessfully running on a raspberry-pi including geth\". There would not be initiatives such as Erigon if the situation was so great. If the world state is not a problem anymore we are actually should be looking at increasing block sizes by 10x 🙂\n\nI also don't think that standardized API is the solution. I'm myself don't know about any software with GUI that is made using this approach, I'm sure there is some, but I doubt that it's a common approach. Usually, it's the opposite - GUI is bundled with whatever else is needed to run the full thing and optimized for the particular pieces bundled together.",
        "created_at": "2021-08-23T12:35:07.048000+00:00",
        "attachments": null
    }
]