[
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "No, because I think there is value in miking and matching clients.",
        "created_at": "2021-08-22T02:00:49.992000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I do support someone building a universal installer that installs one execution client and one consenus client though, and we encourage everyone to use that rather than individual minstallers.",
        "created_at": "2021-08-22T02:01:23.645000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There are efforts around this but from a purely implementation perspective and a UX one, I think the whole ambient will benefit when clients move towards a purely server point of view under a common RPC API. In an ideal world the coding of a QT/GTK frontend (and Windows API and  Cocoa or whatever is called on Mac OS) should be generic and the execution/consensus engine should just be a drop in.  Currently users need to know about chaindata folders, wallet folders, be looking at logs, synchronize relaunching of different pieces of software and updating those individually. There is no way that staking or running a node will ever be mainstream is there's no click-and-install Windows binary that runs in the background and leaves an icon in the tray (or whatever is called in Windows).  Part of this, at least on Linux, is the lack of the familiar upstream/downstream separation, where client teams should focus on their software and not their integration with the OS. Linux packagers (presumably someone from the client team itself initially) should take care of providing the means to write something like `pacman -S prysm` . This is actually not that hard to maintain for a single person on multiple Linux distros, just that nobody really has the time.",
        "created_at": "2021-08-22T08:33:56.591000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I would love to see the UI be a third and separate piece from the clients.",
        "created_at": "2021-08-22T08:41:32.498000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "In a perfect world, you download a bundle installer that prompts you to pick your execution client, your consensus client, and your UI.  It would randomly select one of each for you if you don't care or don't know what to choose.",
        "created_at": "2021-08-22T08:42:16.346000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "yep, I remember someone was doing a very rough version of this on r/ethstaker, the problem was that it was just an installer, not a frontend, and also that coding this currently is not generic, it requires different logic for different clients.",
        "created_at": "2021-08-22T08:47:29.877000+00:00",
        "attachments": []
    }
]