[
    {
        "author": "timhc22",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hey, question about how Ethereum 2.0 handles slashing..\n\nIf I understand correctly, if a node acts maliciously (or is hacked), then they could lose up to their 32 staked eth..\n\nWhat what happens to this eth, is it burned like a base fee, or does it get locked, or go to someone else?\n\nAnother thought.. Could staking be seen as sort of underwriting yourself? Ie saying \"I'm confident in in my tech ability here\"?",
        "created_at": "2021-12-04T06:46:21.181000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e If I understand correctly, if a node acts maliciously (or is hacked), then they could lose up to their 32 staked eth..\nWith emphases on the \"up to\". Only if many thousands of validators are slashed at the same time (within the same 18 days) does it get into the multiple ETH. Here's the first Altair-era slashing: https://beaconcha.in/validator/261 . A 0.5 ETH slashing penalty, plus a few weeks of inactivity leakage until the remaining funds become withdrawable [0].\n\n\u003e What what happens to this eth, is it burned like a base fee, or does it get locked, or go to someone else?\nThe 0.5 ETH is just subtracted from the validator balance, just like any other penalties there might be (like inactivity leak). There is a reward for the proposer that includes the slashing offense, so you could say that the difference is burned.\n\n\u003e Another thought.. Could staking be seen as sort of underwriting yourself? Ie saying \"I'm confident in in my tech ability here\"?\nStaking is about underwriting your attestations (otherwise we get the \"nothing at stake\" problem). And indeed implicitly therefore also about your software stack, etc.\n\n[0] Referring to the status \"withdrawable\" here, as opposed to e.g. a validator status \"exited\". Withdrawals are not yet enabled.",
        "created_at": "2021-12-04T10:27:48.060000+00:00",
        "attachments": null
    },
    {
        "author": "timhc22",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "amazing thanks \u003c@!397389662085185547\u003e , do you have twitter? I'll tag you in a response to someone (if you are happy with that)",
        "created_at": "2021-12-04T10:57:01.511000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I do not, it's all public information though, so just pretend you found it yourself 😉",
        "created_at": "2021-12-04T11:02:27.557000+00:00",
        "attachments": null
    },
    {
        "author": "timhc22",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I owe you a drink sometime then",
        "created_at": "2021-12-04T11:02:37.847000+00:00",
        "attachments": null
    },
    {
        "author": "timhc22",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I have lots of questions about PoS, so I might be back sometime, but I'll see if I can find the best docs first!",
        "created_at": "2021-12-04T11:02:57.281000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sure, the annotated specs are great (benjamin has some, and so does vitalik): \nhttps://benjaminion.xyz/eth2-annotated-spec/phase0/\nhttps://github.com/ethereum/annotated-spec\n\nThis one is also a nice overview (particularly if you're interested in the rewards and penalties like slashing):\nhttps://consensys.net/blog/codefi/rewards-and-penalties-on-ethereum-20-phase-0/",
        "created_at": "2021-12-04T11:09:38.096000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Terminology around the merge/sharding/\"2.0\" and other large upgrades has changed over time. If you're diving into it now, expect to be confused by terms like Phase 0 (\"Is Altair the successor to Phase 0, why not Phase 1?\").  [0]\n\nThe term \"2.0\" /\"Eth2\" is/was a deliberately somewhat vague umbrella term to refer to several large upgrades like PoS and sharding [1]]. With those upgrades (and others like state expiry) becoming more separate and concrete, it's not always as useful a term to use in communication anymore. [2]]\n\n[0] See https://blog.ethereum.org/2021/10/15/amphora-merge-milestone/ for a somewhat recent post about the path to PoS, and the names of forks/upgrades/devnets along the way.\n[1] Note that these are introduced via hard forks just like other past upgrades.\n[2] Vitalik posted a recently updated roadmap with some catchy names for some of these upgrades https://nitter.snopyta.org/VitalikButerin/status/1466411377107558402#m . Half-joking I presume, but maybe they'll catch on.",
        "created_at": "2021-12-04T11:23:47.559000+00:00",
        "attachments": null
    },
    {
        "author": "timhc22",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think my biggest questions are around how the network actually comes to a consensus..\n\nI know that in PoW, all the nodes pick transactions from a shared mempool (obviously copied to each node (I just thought actually, I wonder what the latency is between the 'state of the mempool being the same across all nodes..))\n\nthe nodes then order transactions into a block, and race to be the first to add this new block to the blockchain (by solving the PoW puzzle). I was wondering, in PoS, which parts of this system are the same, and which are different",
        "created_at": "2021-12-04T11:57:09.912000+00:00",
        "attachments": null
    },
    {
        "author": "timhc22",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I know these are probably quite basic questions, so the best place to read about them would be ideal",
        "created_at": "2021-12-04T11:57:32.585000+00:00",
        "attachments": null
    },
    {
        "author": "timhc22",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "re altair, that is just simple 0 indexing though right haha?",
        "created_at": "2021-12-04T11:57:55.247000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e by solving the PoW puzzle\nThis is the part that's different in PoS. There is no puzzle. It's random selection for the block proposer each slot, and attesting by validators to \"certify\" it (throw their economic weight behind it). There are incentives in place to reward good behavior, and penalize bad behavior. A quick overview of how PoS in Ethereum in Phase 0 worked is this: https://www.youtube.com/watch?v=-qwSAFcicg8 . Some small changes in Altair (more duties for validators, etc), but mostly still the same.\n\nThe current beacon chain has no transactions. It's coming to consensus on itself. Filling blocks with transactions (\"execution payload\"), the transaction ordering, which transactions are valid, etc. is the same after the merge. It's even the same set of clients that will handle it as now (the EL = execution layer clients, geth/besu/nethermind/erigon). The only thing that'll change with the merge is that a EL client will defer to a CL (=consensus layer) clients for the consensus, i.e. the \"what is the head of the chain?\" part. [0]\n\nThere's probably much better explanations of PoS out there on e.g. Youtube or the wider internet than I can give you. One of the big differences in Ethereum compared to other (D)PoS systems (until others start using it as well) is signature aggregation with BLS. [1] This is comparatively a recent invention/technology, and wasn't around when Ethereum started.\n\n[0] It's not _that_ easy of course, there's a lot of edge cases to be handled and communication both ways (e.g. a CL client needs to be able to ask an EL client to make it a block to propose, and to ask an EL client to verify the execution payload in a block it received). But the high level part is indeed just that.\n[1] To read an interesting story of this BLS signature stuff came about: https://www.reddit.com/r/ethfinance/comments/jghide/daily_general_discussion_october_23_2020/g9sz7jm/?context=1",
        "created_at": "2021-12-04T12:26:52.103000+00:00",
        "attachments": null
    },
    {
        "author": "timhc22",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'm mostly interested in finding out what algorithm is used to determine the random block proposer",
        "created_at": "2021-12-04T12:41:54.075000+00:00",
        "attachments": null
    },
    {
        "author": "timhc22",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "But, it makes sense what you said about validators certifying the 'randomly selected proposer' though, because I guess if someone tries to attack the system (in the PoS version of 51% attack), then if the Validators join in with the falsehoods, they loose their stake",
        "created_at": "2021-12-04T12:43:22.088000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "In that case, look for \"RANDAO\" (in the specs, online, ethresear.ch).",
        "created_at": "2021-12-04T14:19:02.805000+00:00",
        "attachments": null
    },
    {
        "author": "timhc22",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "will do, thanks a lot for the help!",
        "created_at": "2021-12-04T14:33:12.001000+00:00",
        "attachments": null
    }
]