[
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This is an interesting idea and one that I think we might be able make incentive-compatible. At the moment there's no Nash equilibrium for the honest behaviour because validators have incentives to A) publish blocks late for MEV extraction and B) attest late in order to avoid missing late published blocks (particularly if execution block processing is slow). This also disincentivizes slower minority clients, as you say.\n\nWith the \"block arrival cutoff\" that you propose I think we can establish a Nash equilibrium where:\n\n- If a block doesn't arrive before say 2s in the slot, honest validators commit to voting for the previous block instead. They are expected to publish attestations at say 6s, allowing 4s for block processing (exact numbers may vary).\n- Fork choice is modified such that votes for the parent block compete with the child (AKA `(block, slot)` fork choice).\n- Attestation accounting is modified such that a vote for the parent followed by a skipped slot is rewarded the same as a vote for the correct head block with no skips.\n\nThis creates a Nash equilibrium for the honest behaviour because:\n\n1. If any single validator tries to wait longer to attest they risk disagreeing with the majority and missing their reward. Voting honestly based on the time the block was received dominates either always voting for the head, or always voting for the parent.\n2. If the block proposer publishes their block late they risk being re-orged if it is received late by \u003e50% of attesters. However there's still a problem where they only need to clear a 50% threshold of attesters, and will publish as late as possible while still being reasonably sure of achieving that.",
        "created_at": "2022-10-18T02:41:27.149000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Other complications:\n\nA. There's _another_ Nash equilibrium where block proposers all wait as long as possible and attesters do too. The system could get knocked into this equilibrium by the movement of a few large actors (i.e. collusion).\nB. Changing fork choice to block-slot is hard (we don't know how to handle asynchrony)\nC. Changing attestation reward accounting requires a hard fork, and there might be problems with block capacity (we need to fit all the attestations for the previous K skipped slots into the next block).",
        "created_at": "2022-10-18T02:42:25.801000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "My proposal for proposer-boost re-orgs achieves some of this by disincentivizing late blocks, although if any late block gets more than 20% of the committee vote it won't get re-orged (so the proposer can still grief 80% of attesters).",
        "created_at": "2022-10-18T02:43:49.995000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "To minimize griefing further I've thought a little about having attesters set their cutoff randomly in some interval, e.g. 2-3 seconds. Then the proposer would find it harder to guess the time at which they need to publish to get at least 50%+ of the committee vote, although they could still probably publish late around the expected value of the distribution, or aim for ~60% instead. It's hard :\\",
        "created_at": "2022-10-18T02:50:50.288000+00:00",
        "attachments": null
    },
    {
        "author": "arnili",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e - Attestation accounting is modified such that a vote for the parent followed by a skipped slot is rewarded the same as a vote for the correct head block with no skips.\nSomething around this may be the key takeaway here because this is what made me look into it in the first place\nIt's only safe for me to vote for the parent if I can be sure there won't be an early majority finishing the race in time for the next block\nIf they do I get penalized for not voting for the best available block even if the cutoff for this may be a few milliseconds tight\nUnfortunately this is where incentives start to go backwards:\nIf I have seen the block but it's still in validation but I have to make the attestation I'm probably incentivized to either wait for for validation to complete and try to race vote aggregation or worse become a lazy validator and just vote for the block that hasn't yet passed EL validation.\nThere is a difference of 17Gwei (~3Gwei penalty for voting HEAD-1 vs ~14Gwei reward for a fully valid attestation) between the two outcomes which are solely determined by the outcome of the race to early majority while I'm just attesting to the honest state of the chain at attestation deadline.\n\nThe interval in which validators have to make up their mind on what to vote may be the most critical for consensus, but currently we put it in the same interval as block propagation where others have an incentive to game it and send out the block as late as they can possibly get away with.\n\nFurther reading up on the spec and how these things are defined there it may make sense to increase INTERVALS_PER_SLOT by one and put block propagation and import/validation/housekeeping/voting into their own slots. If the block is not there at the end of the propagation interval just don't bother and consider it missed (unless someone brings it back in by building on top of it)",
        "created_at": "2022-10-18T13:31:26.560000+00:00",
        "attachments": null
    },
    {
        "author": "arnili",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "All that being said, I'm very happy that you are already looking into orphaning late blocks with current consensus.\nThere already is an incentive to orphan blocks if you're sure you can get away with it (you can build yourself a larger block and effectively steal block rewards if i'm not mistaken)\nIt's getting gamed right now. If we don't start punishing for it it's only going to get worse (there are larger proposers consistently pushing out blocks 4 seconds late without getting orphaned)",
        "created_at": "2022-10-18T13:36:06.142000+00:00",
        "attachments": null
    },
    {
        "author": "arnili",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Further thinking about is I think the quintessence of the problem is that we can't have misaligned incentives inside the same interval where one party is incentivized to do their part as late as possible but others best interest is to do things as early as possible.",
        "created_at": "2022-10-18T14:57:32.833000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I did an early analysis about voting on late blocks on Pyrmont and the game theory is a bit different. Everyone losses with late blocks. Those that vote for the parent (assuming the late block is not reorged) lose because they get the wrong head. But those that vote for the right head lose even worse because the committee size is minimal. This was before Altair changing rules though.",
        "created_at": "2022-10-18T19:49:23.039000+00:00",
        "attachments": null
    }
]