[
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "For large irregular state changes (like The DAO), it may be too much to be done in a single block due to the operational cost of mutating that many state entries.",
        "created_at": "2022-06-15T05:40:54.207000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Changing the state may cause huge capital losses depending on the depth of rewrite and the portion of state affected by the bug the network should be recovered from. I am not sure there is a solution that could help to overcome this problem",
        "created_at": "2022-06-15T06:45:44.084000+00:00",
        "attachments": null
    },
    {
        "author": "albusdompeldorius",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "One method that might help reducing the amount of state affected would be to isolate the rewrite to the transaction level. So, for instance, if there is a bug in the majority of clients that causes one transaction in a block to be processed wrongly, one could revert only the processing of this transaction and still include all other transactions. The post-state of the affected block (and all subsequent blocks) would also need to be changed.",
        "created_at": "2022-06-15T12:02:09.472000+00:00",
        "attachments": null
    },
    {
        "author": "albusdompeldorius",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Also, exchanges should verify each block with all execution clients and pause if the clients disagrees on the execution.",
        "created_at": "2022-06-15T12:03:37.969000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We really should build tools for this.  It is very important for anyone doing anything off-chain verify that multiple clients agree before proceeding.",
        "created_at": "2022-06-15T12:07:37.885000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I agree with the method. We should reduce the size of the damage as much as it's possible. But checking clients agreement and stopping to read the blockchain when clients are disagree seems to be the only safe guard that could protect services from losses in case of a split",
        "created_at": "2022-06-15T12:21:54.080000+00:00",
        "attachments": null
    }
]