[
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Ignoring technical complexity for a moment (focusing on mechanism design), is there a reason we couldn't have validators selected via a multi-unit uniform price auction?  If we want 10,000,000 ETH staked at any given time we could allow an unlimited number of participants deposit and submit a \"bid\" for the minimum yield they will accept.  The system would then select the 10,000,000 staked ETH with the lowest bid, and give theme all a yield equal to the bid of the highest bidder from that set.  Everyone else would just have their ETH sitting there until such time as they withdraw, update their bid, or the going rate surpasses their bid.",
        "created_at": "2022-08-26T14:56:53.815000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The idea here is that this should approximately result in the lowest amount of issuance possible while still ensuring that a target amount of ETH is staked.",
        "created_at": "2022-08-26T14:57:30.638000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We would need to handle the case where there is less than 10M deposited ETH, and probably have some kind of cap on the annual yield to ensure a very large cartel can't drive the returns ridiculously high.",
        "created_at": "2022-08-26T14:59:16.813000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "🤔 I guess if this is an open bidding then a large staker cartel could bid a very low yield until most people are driven away, and then once less than 10M are in the pot they can jack it way up  (price gouging).",
        "created_at": "2022-08-26T15:01:13.429000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Another problem (worse) is that it makes it possible for a very wealthy individual to *completely* take over staking.  Someone with 10M ETH could simply bid 0% or negative % (if allowed) and drive everyone else out.  While I'm pretty comfortable with staker centralization because of the ability to UASF/UAHF, it feels like a 100% cartel is extremely problematic.",
        "created_at": "2022-08-26T15:02:29.489000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "OK, I'm convinced this isn't a good idea.  Thanks!",
        "created_at": "2022-08-26T15:02:35.955000+00:00",
        "attachments": null
    }
]