[
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@602753420033785856\u003e a question about you recent change to `get_proposer_head`. What are potential cases when this function is called by honest proposer not at the beginning of a slot?",
        "created_at": "2022-12-08T07:00:16.848000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "if there’s latency between the VC and the BN, the call to propose a block may come a little bit after the exact start of the slot",
        "created_at": "2022-12-08T07:45:04.320000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "this is a check that I already had in Lighthouse, so I think it should probably be in the spec too",
        "created_at": "2022-12-08T07:46:12.229000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Do you think the latency can be that high to exceed 2 seconds? Assume BN starts building a block 2 seconds into a slot, it will take time for EL to build a payload (~500ms at least), I am a bit worried that in this case the built block can be non-timely but I don't have numbers on the average block dissemination time. Probably reduce this boundary to 1 second?",
        "created_at": "2022-12-08T09:34:36.518000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Locks can be quite long",
        "created_at": "2022-12-08T10:03:36.642000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "what locks?",
        "created_at": "2022-12-08T10:07:31.713000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yeah I think 1 second is probably fine for mainnet. It will be ~400ms on Gnosis chain, which might also be fine",
        "created_at": "2022-12-08T10:12:47.186000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Currently the spec rounds the time offset down to a whole second so it will technically be 0 seconds for gnosis chain. But I’m not sure it’s worth messing with the spec for that, clients supporting GC can always adapt their implementation",
        "created_at": "2022-12-08T10:15:07.941000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sorry jumping in to this a little cold, but is `time_into_slot` the time at which a validator client requests a beacon block proposal from the beacon node?\n\nReason that I ask: for validators using MEV-boost Vouch starts the proposal process by fetching bids from relays and selecting one of them.  Only after this process is complete will it talk to the beacon nodes to obtain a blinded block.  So it's entirely possible for Vouch to be 1s+ in to the slot before it requests a blinded block from a beacon node, dependent on relay performance.",
        "created_at": "2022-12-08T10:33:20.674000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If this boundary is exceeded nothing too bad happens. Instead of orphaning non-timely block a BN will produce a regular block. If Vouch isn't always exceeds this limit but just from time to time then I think it should be fine",
        "created_at": "2022-12-08T10:45:28.960000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "processing blocks is sequential and can take a lot, it is possible the validator requests something in time, but the beacon is locked importing some old blocks for example and will not release those locks for a while. 2 seconds is a lot, but no matter what time you put, it will be tested in production eventually",
        "created_at": "2022-12-08T10:46:54.602000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "On another topic. I am curious how Vouch does pass selected bid to a BN?",
        "created_at": "2022-12-08T10:48:19.883000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'd certainly be more comfortable with 2 seconds than 1, I'd perhaps argue that it should be 4 seconds - (average time seen in the wild to generate blocks) to map back to the general \"block should be produced within 4 seconds\").",
        "created_at": "2022-12-08T10:48:28.836000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It runs a mini-server that mimics the relay API, and the beacon nodes point to that as their relay.  Means that all of the beacon nodes obtain the same execution payload without having to do lots of work individually.",
        "created_at": "2022-12-08T10:49:15.875000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This boundary is a maximal start of a proposal procedure. Setting it to 4 almost equals to have no limitation at all. We do want to decide what the head we use to propose the next block, and debating on the last moment when this decision must be made",
        "created_at": "2022-12-08T10:50:36.933000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I see, it kind of surrounds BN",
        "created_at": "2022-12-08T10:52:07.531000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yeah but if the average time to generate blocks is 2 seconds it would be set to 2, if average time to generate blocks is 1 second it would be set to 3.  The idea is that it would be set so that `proposing_on_time` would be true for most situations where you would expect the block to be broadcast within 4 seconds.\n\nBut I know that words like \"average\" here are quite fluff.y",
        "created_at": "2022-12-08T10:53:09.299000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e This boundary is a maximal start of a proposal procedure. \nWhen orphaning non-timely block can be applied -- this is important part that I forgot",
        "created_at": "2022-12-08T10:53:15.517000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I agree. I am not opposed to this parameter set to 2, just worry that a block is risking to become non-timely if its producing begins 2 seconds into a slot",
        "created_at": "2022-12-08T10:55:47.232000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I agree that that's too late to be starting production of a block, I guess that my point is that \"starting production\" and \"requesting a blinded block\" aren't necessarily the same point in time.",
        "created_at": "2022-12-08T10:58:28.417000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The `get_proposer_head` change may also affect the way Vouch decides which payload to use as the parent payload for bid selection.\n\n\u003c@602753420033785856\u003e I am also curious how this change affects mev-boost in general, ideally, builders will need to be capable of providing two payloads, one atop of the head, the other one atop of proposer head",
        "created_at": "2022-12-08T11:06:51.341000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yeah from discussions with \u003c@388610194608750595\u003e it seems some of the relays and builders are already doing this. However when I was testing on Ropsten none of the relays were giving me blocks. I need to try again on Goerli",
        "created_at": "2022-12-08T21:34:06.093000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I’m not sure how the Vouch thing will work, it seems like Vouch could select a payload and then the BN would ignore it and request one with a different parent. What does the relay intercept do in this case \u003c@144468805697929216\u003e ?",
        "created_at": "2022-12-08T21:35:04.999000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Vouch would fail to provide the execution payload, so the blinded proposal would fail and Vouch would fall back to requesting a local block. At current that's not too bad given the infrequency, however if it is more common that could be an issue.\n\nI suspect if we have a couple of seconds in which to fetch the execution payload and request the blinded block we should be okay in all but extreme scenarios, one second may see higher numbers of these failures.\n\nAn alternative would be some sort of API request that states that block building is starting, and locks in the parent. But that seems quite niche for now (not sure how DVT are handling blinded blocks but if they do something similar to Vouch the issue may become more widespread.)",
        "created_at": "2022-12-08T22:37:36.243000+00:00",
        "attachments": null
    }
]