[
    {
        "author": "jimjamlin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hello all, I am wondering which validators are allowed to \"whisteblow\" another validator to punish them for breaking any of their PoS responsibilities? Does it have to be a validator (i.e. an individual who has placed 32 ETH stake), does it have to be a validator selected for one of the committees for the epoch that they are \"blowing the whistle on\", or does it have to a validator in the exact same committee as the validator in the epoch they are blowing the whistle on?",
        "created_at": "2022-02-21T04:01:36.430000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'd recommend reading https://eth2book.info/altair/part2/incentives/slashing particularly the \"The value of reporting a slashing\" section",
        "created_at": "2022-02-21T04:03:41.002000+00:00",
        "attachments": []
    },
    {
        "author": "jimjamlin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Thank you for sending that through! It gives me these general impressions: a) that you only need to be in operation of a node to submit evidence of a slahsable offence (not necessarily a validator), and b) that there is a particular field in each block where evidence of slashable offences can be included i.e. not the same field as other transactions. Therefore one could set up their very own node and start making reports of slashable offences without an investment on ETH? I also got the impression from this resource and others that there is not necessarily a punishment for \"frivolous reports of slashable offences\"?",
        "created_at": "2022-02-21T04:23:06.278000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think you missed the bit:\n```However, this functionality is not currently used on the beacon chain, and the proposer receives both the whistleblower reward and the proposer reward, as above```\n\nSo yes you can detect and submit slashings without being a validator but you won't get paid for them. Only the validator that includes them in the block gets paid. You can't include slashings that aren't vaild and you'll be disconnected and likely banned if you try to publish invalid slashings on the gossip network.",
        "created_at": "2022-02-21T04:28:30.318000+00:00",
        "attachments": []
    }
]