[
    {
        "author": "ctrl_alt_lulz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Would it make sense to create a second class validator of higher effective balance? Eg if you stake 3200 Eth you can do so on one validator slot voting power (the rewards mechanism can be an equivalent aggregate or some other suitable replacement) but you gain the efficiency of less computing resources. Eg a way to allow larger centralized pools to gain efficiency and lower their block proposal power in favor of smaller decentralized operators.",
        "created_at": "2022-09-10T07:40:26.890000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Do you have information/data for what the computing resources are of 1 vs  100 validators in a single node?",
        "created_at": "2022-09-10T07:48:10.580000+00:00",
        "attachments": []
    },
    {
        "author": "ctrl_alt_lulz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "With sync committees which increased CPU loads (post Altair) 300 validators are now being run on 12 core machines.",
        "created_at": "2022-09-10T07:49:31.861000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "That doesn't really answer my question though, then the requirements would be still the same for 1 vs 300 no?",
        "created_at": "2022-09-10T07:50:57.183000+00:00",
        "attachments": []
    },
    {
        "author": "ctrl_alt_lulz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You have the overhead from additional signature aggregation and verification, so reduces the CPU load by a lot with a reduced validator count for greater staked",
        "created_at": "2022-09-10T07:51:53.764000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hmm, still sounds a bit off to me. Maybe \u003c@144468805697929216\u003e can chime in (or any other large node operator).\n\nAside from that, I doubt you'd convince enough to change consensus rules (risky and costly) in favor of pools and larger validators. There has been work in the _opposite_ direction",
        "created_at": "2022-09-10T07:56:57.015000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "(Sorry, maths wrong will recompute)",
        "created_at": "2022-09-10T07:59:40.721000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If you have 300 validators your chance of having a single validator in any given sync committee is around 30%.  If you spec for, say, 6 validators in sync committees you're looking at a less than 1-in-a-thousand chance of having more than this number.\n\nBeing an aggregator in a sync committee would involve more work, but that is even rarer (roughly 1 in 8 committee members are aggregators).\n\nP2P bandwidth and processing is higher with the number of validators, but that caps out long-term at ~100 validators.\n\nAnd I agree with \u003c@397389662085185547\u003e that we don't need to be helping large validators with extra efficiencies of scale.  They already have lots.",
        "created_at": "2022-09-10T08:08:02.815000+00:00",
        "attachments": []
    },
    {
        "author": "ctrl_alt_lulz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Oh I wasn’t meaning to say it was win-lose. Meaning it was a win-win trade off. By creating this second class validator they are giving up their additional block proposal rate to the 32 Eth first class validators which are more likely to come from solo and decentralized operators.",
        "created_at": "2022-09-10T08:12:43.793000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Do you by chance also have numbers on how much work sync committees and aggregates are, and if that work overlaps (i.e. 2 validators = double the sync committee work, or does it scale sub-linearly)",
        "created_at": "2022-09-10T08:14:29.552000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It will be sub-linear in a decent client implementation as you could have multiple aggregators in the same committee.  But given the number of signatures that are being created inside a validator client anyway I'm not sure that another couple per slot is going to have any noticable impact.",
        "created_at": "2022-09-10T08:15:26.625000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The potential benefits for proposing a block would be way higher than the marginal costs of running another validator, so I don't see anyone taking this option if it were available.",
        "created_at": "2022-09-10T08:16:00.374000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You will forego at least 1/8th of the total/yearly rewards (based on post altair distributions), and that's not counting MEV",
        "created_at": "2022-09-10T08:16:07.479000+00:00",
        "attachments": []
    },
    {
        "author": "ctrl_alt_lulz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yeah I agree that MEV changes the value by a good amount. Just a proposed thought on how a trade off could be made with a second class reward system validator that reduces their block proposal power in a way that makes control of the network less centralized. The mechanism of how and what exactly that reward system could be that works for everyone though is up in the air",
        "created_at": "2022-09-10T08:20:28.162000+00:00",
        "attachments": []
    },
    {
        "author": "butta9417",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "this is actually a really interesting idea.  It's a lot of work obviously but it's a path towards mitigating the LSD threat.  Lets say 320 Eth buys you a \"Pooled Validator\" that only gets 1 vote but alter the payout so that total payout (mev/attestation/blockreward) was setup so that Pool - Pool Fee \u003c solo validator \u003c Pool, you could keep the incentive for those with 32 eth to solo validate and incentivize Pools to move into pooled validators.  You would need MEV-Smoothing or somthing like it at the protocol level to properly distribute the Mev rewards",
        "created_at": "2022-09-10T19:51:04.302000+00:00",
        "attachments": []
    },
    {
        "author": "ctrl_alt_lulz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "thank you 🙂 hmm maybe a trailing window of tx fees averaged? i think also a rewards system that pays higher for attestations vs block proposals could be an idea too",
        "created_at": "2022-09-10T19:52:22.923000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Enshrining fees and averaging thereof is really hard because it opens up side-channel payments, especially for larger actors. Attestations are most of the yearly rewards a validator gets, assuming their votes are timely and correct (14/64 for head, 26/64 for target, and 14/64 for source, as fractions of the base reward)",
        "created_at": "2022-09-10T20:05:32.587000+00:00",
        "attachments": []
    },
    {
        "author": "ctrl_alt_lulz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "^ yeah good point, avg fees is way more tricky. i do think though if the abstraction of larger validator -\u003e same block proposal power as smaller one but equal rewards (or very close), could be beneficial. changing the reward base could also come with other restrictions like a longer time frame before they can withdraw (or pay a penalty)",
        "created_at": "2022-09-10T20:09:22.986000+00:00",
        "attachments": []
    }
]