[
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We haven't finished implementing this as we are waiting for the spec to consolidate, will `get_proposer_head` on prysm be useful to you? In particular, we are thinking on being a bit more aggressive than currently in the calls to FCU, so currently we declare the block as missed at 6 seconds and we call to start building a block. We will need statistical analysis and it will take some time adjusting constants but I strongly suspect that an optional strategy is to do this a little after 4 seconds instead. On the other hand, is a block comes now at say 5 seconds, we will call FCU with that head. When we implement this we will never call fcu on late blocks until at least 10 seconds. No matter when the block arrives. Please do get in touch with me or \u003c@363800010518822915\u003e  if any design decision of prysm in this space affects builders as this may disturb the network",
        "created_at": "2022-12-11T05:09:42.933000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The 6 seconds is a number we arbitrarily used to declare a block was late and call fcu if no block has arrived. This is of no consequence currently since we will update this FCU as soon as the incoming block is synced, so having a number less than 6 would result in many calls to the engine to produce blocks that will then be updated immediately afterwards. With the proposed changes we will delay calling FCU to a later time (I believe LH does it still at 11.5 and we will be aiming for 10s) so that allows us to lower that 6s to something much smaller like 4",
        "created_at": "2022-12-11T05:14:25.110000+00:00",
        "attachments": []
    },
    {
        "author": "ruteri",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Can you point me to the spec or PR?\nCurrently we had to implement a custom call (payloadAttributes, https://github.com/flashbots/prysm) - would be great if we could use get_proposer_head instead. The builder does need to know when to call it though. We could trigger it after every newPayload/FCU/4s into a slot if it’s not a “push”.",
        "created_at": "2022-12-11T12:00:56.663000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Not yet, here's a first PR but we stopped developing it until the spec merges \u003chttps://github.com/prysmaticlabs/prysm/pull/11511\u003e",
        "created_at": "2022-12-11T15:25:37.943000+00:00",
        "attachments": []
    }
]