[
    {
        "author": "odyxes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I have a question regarding justification:\nLet's say that during an epoch there is a fork splitting validators on two chains. But all validators still send their attestation with a valid FFG vote. Does the checkpoint of the current epoch gets justified? \n\nMy understanding is that it will not. Because of the following condition: to justify a checkpoint there needs to be a chain containing ffg votes with the same target and source amounting to more than 2/3 of the total stake. But I don't know if I make this condition up or not...",
        "created_at": "2022-09-24T19:42:44.414000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If the fork happens during the epoch, and all validators attest for the same target and all attestations are seen by both branches, then the justified checkpoint will advance since both chains will contain all attestations",
        "created_at": "2022-09-24T20:52:22.252000+00:00",
        "attachments": null
    },
    {
        "author": "odyxes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The attestations are seen from both side but I don't know if they're tallied up together. The fact that the function `get_matching_source_attestations` is using the state to check the attestations:\n```python\ndef get_matching_source_attestations(state: BeaconState, epoch: Epoch) -\u003e Sequence[PendingAttestation]:\n    assert epoch in (get_previous_epoch(state), get_current_epoch(state))\n    return state.current_epoch_attestations if epoch == get_current_epoch(state) else state.previous_epoch_attestations\n```\nMakes me wonder if votes on different branches actually get added together",
        "created_at": "2022-09-24T21:10:22.727000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The same attestations can be included in both branches, in odd slots the proposers of branch A will include the attestations for the current branch from the attesters in that branch and the attestations for the previous even block in branch B. At the same time the proposers of B will include A's votes as well. Each one will get the wrong head, but they will get the right target",
        "created_at": "2022-09-24T21:44:12.036000+00:00",
        "attachments": null
    },
    {
        "author": "odyxes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Ok I understand, so the last question:\nLet's say that at the end of an epoch, there is only one chain but the checkpoint is 10 attestations short to be justified. If the proposer of slot 2, which has not proposed until then, proposes its block (thus creating a fork) with 10 unseen attestations then the checkpoint will not become justified, is that right? \nUnless of course these attestations are included in the next epoch in the right chain",
        "created_at": "2022-09-24T22:15:58.067000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Correct",
        "created_at": "2022-09-24T22:45:06.431000+00:00",
        "attachments": null
    }
]