[
    {
        "author": "nishant0",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@602753420033785856\u003e Has lighthouse been deliberately causing re-orgs in goerli ? If you guys have, from which day did you start with it.",
        "created_at": "2022-12-13T06:10:52.387000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yes sorry, I meant to announce this. We've been running the re-org strategy since 9 December 07:00 UTC\n\nWe are not purposely proposing late blocks though",
        "created_at": "2022-12-13T06:15:37.766000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "ah ok, that is a relief\ncc \u003c@755590043632140352\u003e \n\nWe saw a spike in re-orgs for our latest release candidate and thought we had broken something. But we can rest easier now that we know it isn't our fault 😆",
        "created_at": "2022-12-13T06:18:05.143000+00:00",
        "attachments": []
    },
    {
        "author": "arnili",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "since we're in the context of maximum extractable value here shouldn't the choice always be to orphan if you can orphan? this allows you to build a larger block and pick up all the value of the orphaned block yourself\nso looking at the incentives it should not be about how late a block can be to allow us to still build on top of it, but the other way around: how certain are we that we can orphan it",
        "created_at": "2022-12-13T16:35:38.748000+00:00",
        "attachments": []
    },
    {
        "author": "arnili",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "as a proposer I always want to orphan the previous block and take the value for myself or not?",
        "created_at": "2022-12-13T16:36:27.089000+00:00",
        "attachments": []
    },
    {
        "author": "arnili",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "so proposers are incentivized to tweak this as hard as the network will let them get away with and orphan as many blocks as they can",
        "created_at": "2022-12-13T16:39:22.715000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This has nothing to do with MeV, this is about incentivizing timely blocks",
        "created_at": "2022-12-13T16:41:23.906000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "depends on if the previous block is more valuable than one you could build yourself\n\ne.g. a block full of simple eth sends w/ nominal prio fees vs a 100 ETH liquidation that just hit your mempool",
        "created_at": "2022-12-13T16:46:42.754000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "i do think mev is relevant -- an incentive to delay publishing your block is precisely bc you have more time to gather more valuable mev-carrying txns and/or see if some kind of ex ante reorg is worth it",
        "created_at": "2022-12-13T16:47:42.549000+00:00",
        "attachments": []
    },
    {
        "author": "arnili",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "orphaning  a block allows you to build a larger one yourself - that will almost certainly yield a bigger reward for yourself than trying to build on top of a late block",
        "created_at": "2022-12-13T16:49:31.418000+00:00",
        "attachments": []
    },
    {
        "author": "arnili",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "unless you're part of a bad p2p neighbourhood you can be quite sure you can and should orphan already at the 4 second mark",
        "created_at": "2022-12-13T16:50:07.637000+00:00",
        "attachments": []
    },
    {
        "author": "arnili",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "there is only a need to squeeze the block back in if for some reason a majority saw the block before you - it might even be possible to ignore that edge case",
        "created_at": "2022-12-13T16:53:49.880000+00:00",
        "attachments": []
    },
    {
        "author": "arnili",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "what i'm saying is: trying to orphan should be the default for late blocks, not the exception",
        "created_at": "2022-12-13T16:54:32.331000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "MEV is relevant only in that proposers have an incentive to produce blocks as late as possible. If this didn't cause any trouble to the network we wouldn't be changing the specs. Remembering that currently, until Michael's PR merges it's just blatantly against the spec to orphan late blocks. Hence our choice to call at 6 seconds was an optimization and a gamble rather than a conservative choice",
        "created_at": "2022-12-13T17:07:34.432000+00:00",
        "attachments": []
    },
    {
        "author": "arnili",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "that clearly shows how early we still are in this staking game, if this were anything as competitive as mining is/was larger stakers would hire own developers to make their nodes take the decision that yields the highest returns no matter what some spec says",
        "created_at": "2022-12-13T17:16:23.508000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "That may be happening, but won't happen on stock clients as it didn't on PoW",
        "created_at": "2022-12-13T18:50:51.576000+00:00",
        "attachments": []
    },
    {
        "author": "arnili",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "which may turn out to be a bad thing, if larger stakers can yield higher returns because they run a private client that is better aligned with the incentives this favours centralisation\n\nthis is also where this misunderstanding came from: in my eyes incentives are the spec, doing whatever yields the highest returns is fair game to me - if we don't like the results we should change the incentives",
        "created_at": "2022-12-13T19:21:14.884000+00:00",
        "attachments": []
    },
    {
        "author": "arnili",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "probably won't matter though - it will only take a few orphaned blocks to get these chronic late proposers in line and we'll not hear from it again",
        "created_at": "2022-12-13T19:38:33.345000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "this is what the new spec aims to do as much as possible, while minimising complexity",
        "created_at": "2022-12-13T20:26:56.186000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I mostly agree with this, the re-org strategy has been viable ever since proposer boost was added and yet I don’t know of any large stakers that have run it on mainnet. More than a year later we’ve merged the implementation in Lighthouse and will publish it in our next release.\n\nI also agree the protocol incentives need tweaking, even the re-org strategy isn’t really good enough to fully incentivise timely block publishing. A proposer can still grief the network if they publish their block on time to ~40%+ of validators, I want to see if we can do better than that and get as close to ~50% as possible. This will likely require tweaks to fork choice (“block-slot fork choice”) which are still a matter of active research",
        "created_at": "2022-12-13T20:34:06.668000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Worth noting that outside of malicious intent, the current system also punishes attesters who are timely in the face of proposers who are not.  Harsher punishments for late proposers (_i.e._ non-inclusion of the block) is very much something that the wider staking community would welcome.",
        "created_at": "2022-12-13T20:37:30.923000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "(Although I do worry about it going in on something other than a hard fork boundary, given the instability that was seen when proposer boost went in piecemeal to the network.)",
        "created_at": "2022-12-13T20:38:13.828000+00:00",
        "attachments": []
    },
    {
        "author": "arnili",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "distributing a \"secret\" to 40% of any population of which most participants are honest and share it further seems rather impossible unless i'm missing something here",
        "created_at": "2022-12-13T20:43:27.865000+00:00",
        "attachments": []
    },
    {
        "author": "arnili",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "and yes, it surprised me too that really nobody is orphaning late blocks with proposer boost - even a naive approach such as \"i believe my view on the network is correct and i orphan everything i haven't seen until see 4 second mark\" would probably yield a net positive outcome in rewards",
        "created_at": "2022-12-13T20:47:13.538000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The proposer can broadcast the block with a delay such that it will reach 40% of the network before the 4s attestation deadline. It’s non-trivial, but one of the attack papers tested this and determined it was feasible",
        "created_at": "2022-12-13T20:48:01.509000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003chttps://arxiv.org/pdf/2110.10086.pdf\u003e",
        "created_at": "2022-12-13T20:49:04.819000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "True, that was chaotic, however I think this is *much* safer to roll out piecemeal. The re-orgs are at most 1 block deep, the parameters are set conservatively by default (re-org under 20% rather than 40%)",
        "created_at": "2022-12-13T20:51:54.034000+00:00",
        "attachments": []
    }
]