[
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If a validator provides an attestation that only contains the source and target, then providing a second attestation later in the epoch that contains source, target and head will make the validator eligible for a slashing, since double voting violates the first Casper Commandment. [if not this is my present understanding]\n\nWhy is this the case?",
        "created_at": "2022-07-29T00:21:47.232000+00:00",
        "attachments": []
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'm wondering whether it's feasible to allow for \"superset/backwards-compatible attestation updates\" such that a validator could submit:\n\n[1] source\n[2] source + target\n[3] source + target + head\n\nFor the same source and target (s.t. there are no conflicting submissions).\nOf course the signatures will be different, but the content is such that [1] ⊆ [2] ⊆ [3].",
        "created_at": "2022-07-29T00:25:44.928000+00:00",
        "attachments": []
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The head needs to be received within 1 slot in order for a validator to receive the corresponding reward.\nIt seems the source must be received within 5 slots, while the target can be received anytime during the epoch.\n\nThe principle benefit I see would be to allow message [1] to be sent early *without guaranteed forgoing of the head reward*, since the source is known at the start of the epoch. This would lead to greater network burden however.",
        "created_at": "2022-07-29T00:33:59.352000+00:00",
        "attachments": []
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "My mental model might be far off: I'm imagining that if a validator knows it's attesting in slot 12 of an epoch, then it is able to construct a source-only attestation during earlier slots (and wait until slot 12 to propagate). Hence the question is whether making early propagation free in opportunity cost is possible.",
        "created_at": "2022-07-29T00:35:20.131000+00:00",
        "attachments": []
    }
]