[
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Francesco noticed this oscillation behaviour as well and suggested that instead we could track the number of blocks observed late locally in the last N epochs. And then only re-org if \u003e70% are timely.\n\nThe finalization check seems _simpler_ to me (and you can intuit it from looking at a block explorer). What do you reckon?",
        "created_at": "2022-12-06T06:08:31.104000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Lighthouse will do this already (we steal all attestations from blocks), but I can add a paragraph to the spec to require it.\n\nI don't think _not stealing_ can cause instant failures though. The attestations in the block should already have been applied to fork choice, so if they tip the head block over the threshold where it is no longer re-orgable, the proposer will know this before attempting the re-org",
        "created_at": "2022-12-06T06:10:52.010000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The reason being if the head is at slot `n`, we run fork choice at the start of slot `n + 1`, dequeue the attestations queued from slot `n` and _then_ determine whether or not to attempt a re-org",
        "created_at": "2022-12-06T06:11:52.497000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If \u003c70% isn't timely then more than a half of them can be orphaned (depends on non-timely block's distribution) leading to finality not being advanced. It that sense `REORG_TIMELINESS_THRESHOLD = 70` and `REORG_MAX_EPOCHS_SINCE_FINALIZATION = 2` are kind of equal. I would not care about `N` epochs into the past as long as finality is tight.\n\nI think `REORG_MAX_EPOCHS_SINCE_FINALIZATION = 2` is a good base ground. We can employ `REORG_TIMELINESS_THRESHOLD = 85` or whatever else on top of that if we want an improved safeguard. If finality is ok and in the last epoch more than 85% (put your number here) blocks were timely than we can reorg; otherwise, something bad has happened with the network and `get_proposer_head` can lead to compound effect.\n\nI don't think we need to take several epochs into consideration. If an effect impacting timeliness is instant, then a portion of non-timely blocks may be 99% in N-2 and 75% in N-1, and be 87% in total. I think only the previous epoch should be considered.",
        "created_at": "2022-12-06T10:02:07.996000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think the finality check is perfect, you can even perfect participation if you want in the sense that \"unrealized_justified\" is at least previous epoch checkpoint if current slot \u003c 11 and and current epoch checkpoint otherwise.",
        "created_at": "2022-12-06T10:47:57.420000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "For us stealing the attestations is still a bit difficult though 😦",
        "created_at": "2022-12-06T10:48:40.488000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think we previously reasoned it was OK, by the logic I repeated above? I.e. we won’t attempt a re-org if we know of that attestations that make it inviable",
        "created_at": "2022-12-06T11:01:14.166000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Oh I don't think it's an issue, just that we may hurt the attesters included in that block.",
        "created_at": "2022-12-06T11:30:19.840000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Attestations included into orphaned block may carry votes for its parent making the branch where these blocks does belong to a canonical chain. And if they haven't been received from attestations gossip by a proposer doing a reorg the only way to get them would be by stealing them from an orphaned block. This is edgy though",
        "created_at": "2022-12-06T11:36:11.662000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I don't think realized justification does buy us somewhat substantial. You still may have realized justification advance with worsen rate of timely blocks. I feel like finality check that we already have is pretty much enough, and if we want to improve on that then we need to factor in timely blocks with a higher threshold",
        "created_at": "2022-12-06T11:43:23.935000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The spec for `on_attestation` requires that attestations from blocks are processed as the block is processed, so if we’ve seen the orphaned block then we’ve also imported its attestations",
        "created_at": "2022-12-06T11:55:15.255000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Right. The problem for prysm is that we won't have those attestations in the pool anymore",
        "created_at": "2022-12-06T11:56:00.738000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So the chain may not have enough votes to be considered as canonical. Nothing bad should happen in most of the cases, those attestations will likely be included on chain later on. In some weird synchrony conditions when orphaned block hasn't been observed by a portion of nodes these nodes may not have those attestations applied to their fork choice -- this edge case and may even not worth consideration; but ideally we have attestations from orphaned block included on chain as soon as possible",
        "created_at": "2022-12-06T12:02:00.251000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Ah right, I see what you’re getting at now",
        "created_at": "2022-12-06T12:03:59.070000+00:00",
        "attachments": []
    }
]