[
    {
        "author": "hroussille",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hi everyone !\nCurrently working on Ethereum 2.0 particularly the notion of safety. \nThe inactivity leak in the case of a fork and network partition seem to allow finalizing both forks. Is that correct?\nIf so, is there any reconciliation mechanism? (not really sure about what could be done here if two validators have conflicting canonical chains anyway).",
        "created_at": "2023-09-08T09:30:13.580000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e The inactivity leak in the case of a fork and network partition seem to allow finalizing both forks. Is that correct?\nYes, this has happened before in test setups as well\n\n\u003e If so, is there any reconciliation mechanism? (not really sure about what could be done here if two validators have conflicting canonical chains anyway).\nThe canonical one (as far as a validator is concerned) would be the one the validator has been following and has been attesting to for months/years, not the other one that appears out of nowhere. This weak subjectivity period is also why we have checkpoint sync",
        "created_at": "2023-09-08T17:25:40.032000+00:00",
        "attachments": null
    },
    {
        "author": "hroussille",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Thanks for your answer ! \n\nOkay I think I get it, then a syncing node would end up on chain A or B depending on it's subjectivity checkpoint I guess ? \n\nWould syncing even be possible without a subjectivity checkpoint ?",
        "created_at": "2023-09-08T19:14:07.616000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e Okay I think I get it, then a syncing node would end up on chain A or B depending on it's subjectivity checkpoint I guess ? \nCorrect. You have to ask your (trusted) friends what the current head of the chain is, and walk backwards from there. If you're synced, you can just keep following the head without issue. It's only when you're behind a couple months (weak subjectivity period), you have to ask your friends again.\n\n\u003e Would syncing even be possible without a subjectivity checkpoint ?\nSure, I think you're then just relying on luck to end up on the right chain. I think, without checkpoint, clients sync block by block starting from genesis. Actual CL devs probably know better what clients do though, maybe they listen to gossip for the latest block.",
        "created_at": "2023-09-08T20:12:21.237000+00:00",
        "attachments": null
    }
]