[
    {
        "author": "namngrg",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hi, is there a good resource to read about all the consensus mechanisms?",
        "created_at": "2023-10-13T05:49:54.917000+00:00",
        "attachments": []
    },
    {
        "author": "abcoathup",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Ben's Upgrading Ethereum book: https://eth2book.info/",
        "created_at": "2023-10-13T07:29:43.794000+00:00",
        "attachments": []
    },
    {
        "author": "namngrg",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This is particularly for pos, I was asking in general - diff types possible.",
        "created_at": "2023-10-13T08:13:58.221000+00:00",
        "attachments": []
    },
    {
        "author": "namngrg",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Vague idea - is it possible to have a unified pool for staking for a consensus mechanism for different l2s with **decentralized sequencer** (otherwise staking wont be needed (?) ).\n\nMaybe some research has been done on this or similar previously",
        "created_at": "2023-10-13T08:17:14.805000+00:00",
        "attachments": []
    },
    {
        "author": "namngrg",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e any views?",
        "created_at": "2023-10-13T08:29:41.357000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There are a number of shared sequencer solutions. Re-staking can also be considered as a security pool provider for different solutions including L2s",
        "created_at": "2023-10-13T08:37:16.652000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Quite a lot of literature has gone in the later years about decentralized sequencers. What you're mentioning with staking sounds like Drakes \"based rollups\". Decentralizing the sequencer does not even need to stake it in principle. There are solutions without the sequencers being permissionless. There are solutions that only guarantee for censorship and there are solutions that also take into account tx ordering and MeV extraction. I'd recommend reading this survey to at least take a look at the kinds of properties that people have been looking at. \u003chttps://arxiv.org/pdf/2310.03616.pdf\u003e",
        "created_at": "2023-10-13T10:52:48.745000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Interesting reading! Based rollups are definitely the way to decetralize a sequencer with an ultimate security properties because in this case a rollup relies on L1 security which is the utmost one. My gut on emerging shared sequencers technology is that L1 consensus is slow and it could be too costly to frequently interact with L1 (even if consensus would be faster). Cross-rollup composability that shared sequencers announcing to provide seems arguable to me",
        "created_at": "2023-10-13T14:31:40.099000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I would disagree with this, I think there are many different guarantees that L2 users want from their decentralized sequencers without affecting their UX. I think there are many much more efficient ways of decentralizing sequencers that cater less to a MEV extracting market of off-protocol builders and protect users interests instead.",
        "created_at": "2023-10-13T14:36:45.763000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Is the point about slow and expensive L1 consensus the one you disagree with?",
        "created_at": "2023-10-13T14:38:52.163000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There are many tradeoffs, centralized setups are inherently faster, off-loading block production also benefits some players without any single way of policing transaction order. There are decentralized systems that provide censorship and no-frontrunning guarantees, with the same latency or similar latency to fast L2s, the tradeoff being that the sequencers are not permissionless. Decentralization != permissionless.",
        "created_at": "2023-10-13T15:06:33.516000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I pretty much agree with what you're saying, especially, with the point on many tradeoffs. In my view permissionless sequencing can be achieved with relatively low overhead on the BFT consensus side, this consensus can also enforce censorship resistance and no-frontrunning. The tradeoff here is the level of security that this BFT consensus can provide and UX (including transaction costs). L1 provides high level of security but as of today can be expensive and slow depending on user needs",
        "created_at": "2023-10-13T15:16:35.093000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I believe you in all, except perhaps the no-frontrunning part, I'm aware of some such mechanisms, but none practicable with the L1 validator set",
        "created_at": "2023-10-13T15:20:18.874000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If anything it seems to me that all the based rollups mechanisms (and even our own L1 structure right now) tend to be centralized and trusting in very few players to prevent front-running.",
        "created_at": "2023-10-13T15:21:47.772000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "A small validator set if trusted can agree on the order of transactions with relatively low overhead. The problem here would be trusting the validator set",
        "created_at": "2023-10-13T15:22:41.934000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "With a small validator set you can do this in a trustless manner",
        "created_at": "2023-10-13T15:24:02.814000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "or at least you can bound the number of malicious validators in a set that break the system",
        "created_at": "2023-10-13T15:24:27.645000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The problem is that a small validator set is susceptible to bribing. The trust assumption depends on how this set was elected and who are the real authorities behind its participants. Though, if there is evidence of bribery then the set can be changed, potentially via social consensus",
        "created_at": "2023-10-13T15:27:33.525000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sorry, i have to sign off for today (late Friday evening). Thanks a lot for discussion! I think it remains open and we can proceed with it here or in some other venue",
        "created_at": "2023-10-13T15:28:43.127000+00:00",
        "attachments": []
    }
]