[
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Curious about fork choice (which I'll happily admit is an area in which I have very little knowledge).  Recent block on holesky https://holesky.beaconcha.in/slot/250369 arrived at my beacon node late (~6.5s into the slot).  Because of this it had 0 attestations.  But the next block still built upon it.  Is this correct/expected behavior?",
        "created_at": "2023-11-02T08:15:15.611000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yes that’s expected. But some clients will try to reorg out late blocks and proposer boost makes that possible. I think that’s close to getting merged into the actual spec but I don’t think it’s there yet (might be wrong).",
        "created_at": "2023-11-02T08:42:21.198000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Attestations only choose between two forks. If there’s no other choice you just keep following down the chain to the last block even if it has no attestations (otherwise you wouldn’t see it as the chain head so wouldn’t attest to it and the chain would go nowhere)",
        "created_at": "2023-11-02T08:43:20.508000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'd have assumed there would be a different rule for \"block for current slot\", as you say otherwise you would never add it to the chain, but when it comes to build on top of it that there would be an implicit \"parent or grandparent?\" style rule that would allow the current head to be removed if there had been no votes for it.\n\nWould proposer boost address this, though?  I thought that it gave lower weightings to attestations for late blocks, but if a block with 0 attestations is built upon it doesn't seem that relative weights will count for much in this situation.\n\nOr alternatively: why, as a block proposer, wouldn't I wait for ~5s into the slot before proposing given that I'm likely to gain higher transaction rewards as a result?  It doesn't seem that my chances of being orphaned are that high as long as the block is propagated before the next slot starts.",
        "created_at": "2023-11-02T08:54:15.293000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Proposer boost is what allows proposers to reorg the block out and because they’re on time they can outweigh the late block even if it got some attestations. But if the proposer doesn’t choose to reorg the block out then it will get included. That’s why Lighthouse has been so keen to get the late block reorg rolled out - without it there is no incentive to not just wait longer. Now that some clients do support it you risk having your blocked reorged out if it’s late but will sometimes get away with it.",
        "created_at": "2023-11-02T09:39:18.934000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Eventually I suspect all clients will try to reorg out late blocks to punish late block producers.",
        "created_at": "2023-11-02T09:39:54.926000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It also stops proposers from waiting 11s to harvest more MEV, and griefing all the attesters as a result",
        "created_at": "2023-11-02T09:40:28.353000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The late re-org spec is getting very close to being merge-able",
        "created_at": "2023-11-02T09:43:23.144000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Also notice that the client distribution on Holesky may be very different than mainnet. With lighthouse and prysm reorging by default, getting away with late proposals is hard on mainnet since about a year ago",
        "created_at": "2023-11-02T12:44:14.470000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Does this mean that lighthouse and prysm are using the method outlined in  https://github.com/ethereum/consensus-specs/pull/3034 ?",
        "created_at": "2023-11-02T12:59:27.955000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yeah for about a year now",
        "created_at": "2023-11-02T13:21:12.218000+00:00",
        "attachments": null
    }
]