[
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The ejection procedure helps in case there's a large chunk of validators (say 34%) that are offline or equivalently on a different fork. Then those validators will bleed at a different rate than the active validators in the current fork. Eventually the offline validators are gone and finality is restored. This mechanism does not help recover from a bug in which 100% of the network can't produce a block and everyone is offline. Now, answering your question explicitly, the ejection mechanism triggers `initiate_validator_exit` which is just like any other exit",
        "created_at": "2023-09-20T01:18:11.171000+00:00",
        "attachments": []
    },
    {
        "author": "yokem55",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "That effectively means that there is a minimum viable participation rate needed to effect a recovery?  So, do we know what that minimum viability rate is? Right now - the first holesky attempt seems to be producing a block in about 10% of slots. Because the block rate is too low,  an otherwise properly attesting node seems to only be getting 15-20% of its attestations into the chain. That's probably too low to ever be able to recover it. Would something like 30% of slots getting proposals be needed?",
        "created_at": "2023-09-20T02:00:44.067000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "No? It's a quadratic leak (for the offline validators) if there's no finality, so it'll resolve itself quickly",
        "created_at": "2023-09-20T14:30:49.656000+00:00",
        "attachments": []
    },
    {
        "author": "yokem55",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The question is - how 'online' do the online validators have to be to avoid hitting the ejection balance themselves while they wait for the exit queue to clear? Is getting 10-15% of your attestations in enough? Or if not, what is that threshold?",
        "created_at": "2023-09-20T16:01:08.198000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Well, to avoid hitting the _ejection_ balance, just about anything non-zero would suffice assuming there are a lot of others that are fully offline. To avoid losing any ETH at all, I think about 80%",
        "created_at": "2023-09-20T16:52:23.038000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Found this explanation good way back when current accounting was introduced https://youtu.be/iaAEGs1DMgQ?t=1042",
        "created_at": "2023-09-20T16:54:11.584000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Well, on second thought, I think you're right that even with 10% you might end up hitting the ejection balance, just because exiting (but offline) validators still have proposal duties",
        "created_at": "2023-09-20T16:58:12.958000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "but the blocks that _are_ there should have plenty of room for attestations is my guess, but that depends on the size of the network",
        "created_at": "2023-09-20T16:58:32.183000+00:00",
        "attachments": []
    }
]