[
    {
        "author": "zemse",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hey guys, I'm working on a proof of exploit impl, just have a consensus related question. \n\nScenario: There is a hacker who has proved to team (using zk magic) that they know an exploit that would steal $100M from a smart contract and starts to negotiate bounty with team e.g. $1M (which may or may not be deemed fair). However, the team thinks they can just spend around $100K on security experts to guess the exploit given enough time. So the team wants to call `pause()` on their smart contract asap. Hacker has already warned the team to not do this kind of thing. But the team actually goes ahead and patiently waits until their friend validator gets chance as block proposer who sneaks in a pause tx avoiding mempool. The friend validator does not agree to accept any bribe from the hacker.\n\nDoes the hacker has any way to deal with this situation? How can the hacker to use portion of $100M to bribe some validator to put their exploit tx before the pause tx? (Otherwise it will be common for teams to just pause the contract and it won't make sense for some hackers to responsibly disclose the exploit).",
        "created_at": "2023-05-11T15:32:36.645000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hmm i don't think there is a way to quickly enough bribe validators to not attest to the block and reorg the pause out",
        "created_at": "2023-05-11T15:39:32.227000+00:00",
        "attachments": []
    },
    {
        "author": "zemse",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Is it feasible in theory to reorg?\nedit: i've come across a related article\n\u003chttps://www.paradigm.xyz/2021/07/ethereum-reorgs-after-the-merge\u003e",
        "created_at": "2023-05-11T15:42:05.678000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "maybe if validators join a \"bribe network\" and give 100ms for bribes to come in before they submit their attestation, but otherwise i don't know if the bribe can be organized fast enough from the block being revealed to a large number of validators simply submitting their attestations",
        "created_at": "2023-05-11T15:45:57.037000+00:00",
        "attachments": []
    },
    {
        "author": "0x_osprey",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "well thankfully gasper did it's thing...",
        "created_at": "2023-05-11T20:49:22.471000+00:00",
        "attachments": []
    }
]