[
    {
        "author": "fradamt",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The way approach 3 is described in the post, it is possible to be in a scenario where most of the stake is held by pools that spread out their stake among small validators, so that even the trick of including all validators with balance \u003e= M in every committee does not result in high economic finality (e.g. all validators just have balance 32 eth, M must be set higher than 32 eth to keep committee size \u003c 4096, economic finality ends up being 4096*32/3 ~ 40k ETH). There are some things we can do to improve on what the worst case scenario is:\na) Cap in the worst-case, i.e., reduce to approach 1: set a minimum amount of economic finality. Do not activate new validators if they would cause economic finality going below this amount. In the good case (good stake distribution, not too much sybilling basically), we have high economic finality and no cap. \nb) Cumulative finality: we modify the protocol so that economic finality is cumulative over the committees. At the cost of added protocol complexity, the worst case goes from low economic finality to just a longer time to full finality (e.g., now we might get 40k of finality after the first finalization, a bit more after the second one etc... up to to 1/3 of the whole stake eventually). In the good case (one committee has enough economic finality), we basically revert back the non-cumulative protocol, have fast (full) finality and low lookahead, so we can still have fast withdrawals in the normal case\n\nWe might also be able to incentivize the good case. In option b for example, we could make issuance dependent not only on the total amount of stake but also on the stake of a committee relative to the total (which determines how fast fast full finality is): the higher the latter is, the more issuance approaches the maximum issuance for this total amount of stake. Pools are then incentivized to consolidate because they want overall higher issuance to collect more fees (h/t to \u003c@555483069038198827\u003e for the general idea).",
        "created_at": "2024-01-15T13:13:41.768000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Another approach is to just run a slower full finality protocol with the whole validator set, which always guarantees full economic finality. For example this could work similarly to today, spaced out over multiple slots and epochs, but now only attempt to finalize checkpoints that are already \"committee-finalized\". This ends being quite similar to option b, where in the worst case we just have slower finality, except here it isn't cumulative. This is a small downside, but perhaps the whole protocol can be simpler this way.",
        "created_at": "2024-01-15T16:00:17.750000+00:00",
        "attachments": []
    }
]