[
    {
        "author": "draganrakita",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Looking at EIP-6780. I got confused by this \n`Note that when verkle tries are implemented on Ethereum, the cleared storage will be marked as having been written before but empty. This leads to no observable differences in EVM execution, but a contract having been created and deleted will lead to different state roots compared to the action not happening.` \n\nIf we create the account inside tx, we can assume that we will not touch database storage (merkle or verkle) as we know it is in memory.\n\nSo should Crate -\u003e Selfdestruct be just in memory things and not effect the tries?",
        "created_at": "2023-09-11T11:17:51.794000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You mean have a special case for create and self destruct within a single transaction?",
        "created_at": "2023-09-11T11:37:25.443000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hmm, I guess not a special case if self destruct is removed/neutered.",
        "created_at": "2023-09-11T11:38:10.086000+00:00",
        "attachments": []
    },
    {
        "author": "draganrakita",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This, it is now noop operation, if storages needs to be saved it becomes different thing from before",
        "created_at": "2023-09-11T11:52:37.033000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It may add complexity if a client does in-memory tree updates perhaps?  That is, your proposal is simple if we assume that treeification isn't done until *after* the transaction is completed.  If you are doing them as you go though, then perhaps it is harder?",
        "created_at": "2023-09-11T11:53:49.203000+00:00",
        "attachments": []
    },
    {
        "author": "draganrakita",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You would still need to go thought all of them to mark them as \"empty\" (not sure if this means every storage slot or storage in general).",
        "created_at": "2023-09-11T13:16:47.096000+00:00",
        "attachments": []
    },
    {
        "author": "draganrakita",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Maybe I need clarification on what does it mean for \"storage to be written empty\"",
        "created_at": "2023-09-11T13:19:20.671000+00:00",
        "attachments": []
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This was left in because Optimisim uses it in their L2 intentionally. As far as I know that's the only existing use case that depends on it, and it was instituted prior to the deprecation notice.  \n\nMy instinct is that we should leave this in place until we do the final change to migrate SELFDESTRUCT to a SENDALL operation. (as part of the verkle migration?)  That should give optimism enough time to craft another solution.",
        "created_at": "2023-09-11T16:18:48.062000+00:00",
        "attachments": []
    }
]