[
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "what were the arguments against?",
        "created_at": "2024-02-28T02:47:13.237000+00:00",
        "attachments": []
    },
    {
        "author": "wjmelements",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Nobody addressed it at all. The purpose of my presentation was to get feedback on the alternative specifications, but they only discussed motivation, which was not the topic I had prepared. I don’t think this means they have no preference on the specification. I think it means they have no interest in CODE_ADDRESS or any other variant.",
        "created_at": "2024-02-28T17:16:52.263000+00:00",
        "attachments": []
    },
    {
        "author": "wjmelements",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Their main concern with the motivation is that proxies can delegatecall. But this method will always lose gas auctions to non-proxies because of the base fee. The result is centralization of trading into top firms that can afford to relocate all of their assets each upgrade due to economies of scale. ACDE got confused when I said this though; they think I am proposing a carve-out for MEV bots. But everyone has to participate in auctions in DeFi, and only the most-successful bots can afford to migrate their assets between addresses during an upgrade.\n\nI suspect there are other reasons to prefer SETCODE over DELEGATECALL but this is the impact for me. Selfdestruct removal is about to make my upgrades much more expensive so I have to focus on developing smart contracts for the next two weeks.",
        "created_at": "2024-02-28T18:10:39.814000+00:00",
        "attachments": []
    },
    {
        "author": "wjmelements",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "https://www.youtube.com/live/FhMBatolkOM?si=rZ6HpW_ur0wCGs24\u0026t=3226\nPresentation starts at 53:53\nACD Response begins at 59:29",
        "created_at": "2024-02-28T18:54:42.596000+00:00",
        "attachments": []
    }
]