[
    {
        "author": "thesafernet3304",
        "category": "general",
        "parent": "",
        "content": "Hi all, probably this is not the channel, but i got scammed and was robber of more than 100k worth of crypto coins. The bandits just drained my account and is sitting on my hard earned loot and he's also active cleaning out many other accounts with his account containing eth worth millions. This was thru the metamask extension and i have not even shared my private key nor accessed it for a long time. All these scammer and bandit are just robbing innocent people and while vitalik vision was to empower the little people, i cant help but feel that this vision hasn't really been realised. We may have built a secure blockchain, but we live in an imperfect world. Furthermore, new methods using social engineering are capable of robbing not only people but exchanges of money which includes currencies pooled from people who have toiled and worked hard to get into the crypto space. Ethereum was born in 2017, but much has passed in the actual world with the introduction of 2FA as a mandatory requirement. Shouldn't our mission be to to protect our users first. While innovation must keep forth, but so must security and i am not just talking about the \"block chain\" security but security as a whole. I am still working out some ways in which we could develop a governance protocol to stop these and make the crypto environment a safer place and if anyone would be keen to collaborate and chat to brainstorm and discuss possibilities it would be great. My aim is to see if we can make crypto space a safer environment where everyone would feel safe and comfortable while still maintaining the anonymous nature of the platform. If anyone is keen to discuss or collaborate or just in general point out issues with my statement, please reach out to me at \"thesafernet@gmail.com\"",
        "created_at": "2021-12-14T12:41:41.652000+00:00",
        "attachments": []
    },
    {
        "author": "rushil5834",
        "category": "general",
        "parent": "",
        "content": "+91 9595646404 spam \u003c#844188570101350470\u003e",
        "created_at": "2021-12-14T12:47:38.778000+00:00",
        "attachments": []
    }
]