[
    {
        "author": "cheng_wang",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I see the whole design now after a bit more read. I agree with you that the cost is not that insane.",
        "created_at": "2021-10-31T00:40:56.753000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Out of interest how do we see that fitting in with PoS where taking a few seconds to produce a block can be problematic?\nIs it rare enough to not likely cause issues or can it be started ahead of time (eg start building a bit before the start of slot)?",
        "created_at": "2021-10-31T00:57:57.153000+00:00",
        "attachments": null
    },
    {
        "author": "dankrad.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It's the same as now -- if you want to propose a block at time T and you need X time to generate that block, you have to start generating at T-X",
        "created_at": "2021-10-31T17:27:12.993000+00:00",
        "attachments": null
    },
    {
        "author": "dankrad.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "so I don't see it as a major problem unless it is quite common to take several seconds to generate",
        "created_at": "2021-10-31T17:27:32.080000+00:00",
        "attachments": null
    },
    {
        "author": "dankrad.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And also, you do have control over how long it takes. If for example a transaction accesses a lot of state, you could decide to discard it and use a different one instead that will be faster to produce witnesses for",
        "created_at": "2021-10-31T17:28:45.339000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is a problem in slot 0 where you do not know at all beforehand that you need to produce a block.",
        "created_at": "2021-10-31T18:12:28.409000+00:00",
        "attachments": null
    },
    {
        "author": "dankrad.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think that's a mistake that should be fixed 🙂",
        "created_at": "2021-10-31T20:38:40.570000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Most of the time you do actually know ahead of time even for slot 0. As soon as the last block of the previous epoch is received you can perform the epoch transition and calculate duties.  Even when it's an empty slot you could perform epoch transition a couple of seconds before the end of slot on the assumption it won't be received - you'd have to recalculate duties if it does turn up in those couple of seconds but you're still no worse off.",
        "created_at": "2021-10-31T20:45:32.852000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Wouldn't it be nice if there was an API event to let us know that the epoch transition has been performed 😄",
        "created_at": "2021-10-31T20:55:00.207000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "True, still if we're talking about seconds, this happens after 8 seconds plus aggregators processing plus network transfer plus local processing plus epoch transition.",
        "created_at": "2021-10-31T21:01:05.087000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In Teku (and Lighthouse I think) the `head` event is all you need.  That shows when the last block is imported and you can handle empty slots with system clock itself.  The beacon node should process epoch transition if not already cached when the duties are requested.",
        "created_at": "2021-10-31T21:01:30.949000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If we're having problems currently with empty slots, I can't believe this won't be an issue at the merge",
        "created_at": "2021-10-31T21:01:47.233000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think we're getting wildly off topic but aggregates don't matter here. You only need the block.  Teku and Lighthouse already precompute the epoch transition in this way.",
        "created_at": "2021-10-31T21:02:08.066000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You need the aggregates to include in your own block",
        "created_at": "2021-10-31T21:03:15.230000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So if I receive a `head` event for a slot where `(n%32==31)` I can immediately request the next epoch's proposer duties and it will be accurate (reorgs notwithstanding)?",
        "created_at": "2021-10-31T21:03:37.234000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But you can precompute epoch transition, duties, execution payload etc etc before you have the aggregates (you probably don't want to do execution payload that early but you could).\nThat said, it does make me quite nervous to make block production take longer given we already have issues with blocks arriving late. I suspect developing good strategies for managing the proof construction time is going to be essential.",
        "created_at": "2021-10-31T21:06:20.724000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes.",
        "created_at": "2021-10-31T21:07:08.701000+00:00",
        "attachments": null
    }
]