[
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hello everyone! I am new to Ethereum's Discord group and this is my first message 🙂 I would like to share a new result on key-value commitments that \u003c@!799700309752152134\u003e and I published in Asiacrypt recently (ia.cr/2020/1161).\n\nOur commitment scheme KVaC (pronounced 'quack') allows one to commit to any number of key-value pairs and prove efficiently that a certain pair(s) is contained in the commitment. In particular, the commitment and the proofs consist of just two and three group elements respectively (in groups of unknown order like RSA/class groups). Verifying and updating proofs involves just a few group exponentiations, and so does additive updates to values.",
        "created_at": "2021-05-26T20:11:32.602000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We believe that KVaC could be a very good commitment scheme for building stateless clients. We found out that Verkle tries with Kate commitments are being considered for this purpose, so here we compare the two.\n\n**KVaC vs KZG (Kate) commitments**\n\n*Similarities*\n- Both have very short commitments and proofs.\n- Both support short multiproofs too: one can prove that the commitment contains several values with a proof whose size is the same as the one for a single value.\n\n*Pros of KVaC*\n- Kate relies on a trusted setup while KVaC doesn't (if class groups are used). In Kate, the size of trusted parameters limits the number of values that could be committed.\n- KVaC is a key-value commitment, a more general primitive than vector commitments. So KVaC could enable more use-cases than Kate. \n- In KVaC, inserting new key-value pairs or updating the value of an existing pair is very efficient (just a few group operations in either case). The cost of these operations in Kate is not clear.\n\n*Cons of KVaC*\n- KVaC operates in groups of unknown order while Kate is defined in elliptic-curve groups. So group operations will be faster in Kate and the elements will be shorter. (However, verification in Kate involves pairings which tend to be expensive.)\n- Commitment and proofs in Kate consist of just one group element whereas they consist of two and three group elements, respectively, in KVaC.\n\n**Merkle Trees and Commitments**\n\nKVaC could be used in a Merkle Tree like fashion just as Kate commitments. In other words, KVaC could be a replacement for Kate in Verkle Tries. In particular, just as proofs for different commitments could be combined in a clever way for Kate, one could also combine proofs from different KVaC commitments to produce a short proof for all the values.",
        "created_at": "2021-05-26T20:12:25.919000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hope the main benefits of KVaC and the comparison with Kate commitments is clear. \u003c@!799700309752152134\u003e and I will be happy to answer any follow-up questions.",
        "created_at": "2021-05-26T20:13:37.927000+00:00",
        "attachments": null
    }
]