[
    {
        "author": "peter.davies",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think there is a DOS attack if you don't implement extension nodes in the trie. Using a cycle finding algorithm, even a not particularly well funded adversary can create two accounts whose hashes (as used in the trie) have a large common prefix (100 bits cost approx $10). Anyone who wants a witness for an account with a collision that bad has to resolve 13 verkle nodes rather than 4.",
        "created_at": "2021-06-16T11:15:02.249000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Do you mean that it is easy to find H1= H(account1) and H2=H(account2) such that H1 and H2 share their first 100 bits, for only $10? \n\nWhere H is Sha256",
        "created_at": "2021-06-16T12:00:45.096000+00:00",
        "attachments": []
    },
    {
        "author": "peter.davies",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, using a cycling finding algorithm you can find a n bit prefix collision in 2^(n/2) hashes (this is the birthday bound). It was estimated that for addresses (which require 2^(160/2) = 2^80 hashes) would cost an adversary $10Bil. Based on that I did the division and estimated 2^50 hashes would cost about $10.",
        "created_at": "2021-06-16T12:06:43.949000+00:00",
        "attachments": []
    },
    {
        "author": "peter.davies",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The $10 estimate is only accurate to about an order of magnitude. See https://eips.ethereum.org/EIPS/eip-3607.",
        "created_at": "2021-06-16T12:08:04.973000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Oh, I’ll give this a read when I get on my laptop.\n\nCorrect me if I’m wrong, but since the accounts are hashed using Sha256, even if you find 80 bits to be the same in both accounts, it would not matter?",
        "created_at": "2021-06-16T12:18:48.986000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So the security of the trie is reduced to finding 100 bits collision in sha or 160 bit collision in the account I think. (I only skimmed the document, so I could be missing something)",
        "created_at": "2021-06-16T12:21:34.906000+00:00",
        "attachments": []
    },
    {
        "author": "peter.davies",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The cost of generating a collision is the square root of the cost of finding a preimage. To steal your 160 bit address account requires 2^160 hashes (infeasible), but to generate two accounts with the same address costs 2^80 hashes (feasible, bitcoin has done 2^90 hashes). You can do nasty tricks if you generate a smart contract whose address you also have the private key for (see https://eips.ethereum.org/EIPS/eip-3607).",
        "created_at": "2021-06-16T12:27:40.168000+00:00",
        "attachments": []
    },
    {
        "author": "peter.davies",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My attack was that a long common prefix allows an adversary to make trie access expensive (if the trie doesn't have extension nodes).",
        "created_at": "2021-06-16T12:28:51.284000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Right yep, I understood this point.\n\nThe part I think where I am misunderstanding is how this applies if everything is hashed using sha256 before entering the trie.\n\nSo if you were to find two Ethereum addresses that were the same except for 1 bit, once you hashed it using sha256 for the trie, it wouldn’t matter right? We’d use the hash as the key",
        "created_at": "2021-06-16T12:50:49.437000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Where I would agree, is if the account was being used directly in the trie as a key. So I think your attack would be applicable if you managed to find a full collision of the account, which would allow you to update the key.\n\nBtw I don’t know much about Ethereum, so take what I say with a massive grain of salt 😅",
        "created_at": "2021-06-16T12:54:09.046000+00:00",
        "attachments": []
    }
]