[
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Have merged this 🙂 One thing I think we need to explain is why each suffix node is committed to using two pedersen commitments C1 and C2 as you noted and not just 1 pedersen commitment.\n\nI wasn’t sure if that document was the right place to put it, or if there will be a separate document focussed solely on the different types of nodes",
        "created_at": "2022-11-17T01:55:40.841000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Writing reason here incase it’s not available anywhere else: each value is 32 bytes/256 bits, but the structure which will hold the values (field elements) can only store ~253 bits of information, it essentially truncates the top 3 bits away. So we instead split the 32-byte value into its low and high 128 bit components. \n\nSince we can only commit to 256 things with pedersen, and each suffix node holds 256 32-byte values, when we split it up, we will have 512 values, so we need two commitments to commit to all of the values.",
        "created_at": "2022-11-17T02:04:44.835000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "https://blog.ethereum.org/2021/12/02/verkle-tree-structure\nThis article was great for me to understand the underlying go-verkle implemention. It explains that with detail.",
        "created_at": "2022-11-17T03:42:43.907000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ah forgot about that, thanks for the relink",
        "created_at": "2022-11-17T09:00:41.524000+00:00",
        "attachments": []
    },
    {
        "author": "jefferson8477",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Sweet. Ahh gotcha yea will include that in a future PR.\n\nIs this limit of being able to commit to only 256 things an implementation detail from the spec, rather than an intrinsic mathematical property of the Pedersen commitment?",
        "created_at": "2022-11-17T10:59:57.261000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yep it’s an implementation detail, in the past, the node width used to be 1024 instead of 256",
        "created_at": "2022-11-17T11:19:53.887000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "1024 allowed for shallower tries due to more children being on a single level, but it was not nice to use since 10 bits crosses over two byte boundaries whereas 8 bits fits perfectly inside of a byte",
        "created_at": "2022-11-17T11:21:32.518000+00:00",
        "attachments": []
    }
]