[
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "---\nI created a document that dives into details and benchmarks around Merkle Patricia Tries and Verkle Tries, mostly around moving from Keccack to Pedersen Commitments.\nTries to cover both the theoretical angle, but also having real numbers about the overhead by benchmarking current Go implementations to be used in geth.\nhttps://hackmd.io/@jsign/verkle-tries-exploration-about-keccak-vs-pedersen-commitments\n\ncc \u003c@353136597522448385\u003e \u003c@555483069038198827\u003e \u003c@427491045308235776\u003e , open to feedback or comments!",
        "created_at": "2022-10-26T21:34:23.045000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks for this! So this aims to assist in answering the question of “How slow should Verkle tries be in relation to Patricia merkle tries”",
        "created_at": "2022-10-26T21:48:11.611000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yep, actually it dives into some details about what that question really means apart from \"raw\" numbers. \nFor example, I tried to come up with amortized cost \"per value\" for Pedersen Commitments to have a fair comparison with Keccak. (Since PC are vector commitments, not single value ones).\nSo apart from the amortized cost, the remaining questions are about to come up with a reasonable assumption about how many \"values\" on average land on the same leaf, since the cost is linear to the non-zero values.\nBut that only is entirely relevant for new leaves. For updating leaves, there's another trick used by the implementation (if I connected correctly reading the code and my theoretical knowledge) that changes things a bit.\n(The EIP to map account state values to addresses in the trie is mixed in the scene too)\n\nAnyway, hopefully all this better explained there. But yeah, tried to answer that question \u003c@427491045308235776\u003e ! 😅",
        "created_at": "2022-10-26T21:51:45.062000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yep makes sense 🙂 \n\nI believe it will be reasonable to assume that the average depth will be 3/4. So that’s 3/4 mandatory scalar multiplications on each insert since modifying an inner node requires a scalar multiplication (a pedersen hash where there is only one non-zero entry)\n\nFor, how many values are updated which are close together; in the eip under “header values” values for the same address are “forced” to be neighbours. So I think the question could be rephrased to be about address access patterns",
        "created_at": "2022-10-26T23:18:17.392000+00:00",
        "attachments": []
    }
]