[
    {
        "author": "controlcthenv",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "To summarize what future changes should be pursued -\n1. 10k edit + 10k proof benchmarks\n2. Move code to tokio for async functions to help parallelizations efforts begin\n3. Change code to use `Result\u003c\u003e` paradigm instead of dangerous unwraps\n4. Cleanup code removing db + other unused funcs\n\nThen could something like Verkle-Akula be built?\n\n(then after this begins efforts of ensuring verkle lib parity alongside testnets?)",
        "created_at": "2022-09-20T00:24:05.910000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hi. I had divided as this:\n\nhttps://github.com/JEAlfonsoP/Verkle-Tree-and-Stateless-in-Ethereum-101/blob/main/Algorithms/Topological%20Sorting/Algorithms\n\nAnd finally adding: Uniqueness and Hamiltonian path definition (description)",
        "created_at": "2022-09-20T07:20:01.534000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks for taking a look on it.",
        "created_at": "2022-09-20T07:20:24.736000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "1. Yep\n2. Would have to discuss further as async and parallelisation are different concepts. It’s not immediately clear to me where you would add this \n3. Some code paths at the moment use unwraps as there should be no way to get into that particular state, I think clients would prefer a Result though, I haven’t checked in any node code to see if there are any rules to this exception.\n4. Hesitant yes for the latter part\n\nI haven’t looked at Akula in any meaningful detail, so I cannot comment \n\nI think Guillaume is working on modifying go-verkle to match rust-verkle",
        "created_at": "2022-09-20T09:52:09.996000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hmm I guess I’m not sure about their relevance to verkle tries, can you elaborate?",
        "created_at": "2022-09-20T09:53:31.077000+00:00",
        "attachments": []
    },
    {
        "author": "controlcthenv",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I phrased that poorly, I meant making some functions async with Tokio, then seeing if threading or anything beyond async could be used",
        "created_at": "2022-09-20T12:28:11.647000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Oh thats interesting, we should discuss this more. It may be help in the context of batch inserts; the current code inserts in two stages:\n\n1. Get the \"trace\" of the insert; ie we create instructions that tell us all we need in order to insert into the tree\n2. Execute the trace; this is the step that does the insertion and modifies the database.\n\nFor step 1, it is possible to be sped up with threading. It was what the KZG version of the code was doing.\n\nIt was also removing any extra work needed before touching the database. So if a state went from x -\u003e y - \u003e z , it would cut out y and just compute the diff between x and z for example",
        "created_at": "2022-09-20T13:03:11.361000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Sure. I am with this idea that a proof tree might be treated in a simpler way for vector generation (or chunk validated via a specific proof). I may be wrong but I think that based on the data structure for the proofs if uniqueness is presented (which I believe validators during time would take care of it) and a path or simple ordering (vector) could be found. I am still thinking if this is possible or not (due to size and time functionality). I do not have any problem just leaving this into my verkle-tree-101 repo (as it is for personal study) . If you want something more mathematical (algebraical) I can show you a possible model when I finish it (as I said it's just an idea). I hope this makes sense (as a possible explanation of why I was proposing to include some material for Topological Sorting), as usual feel free to point me your ideas anytime. Ty",
        "created_at": "2022-09-20T13:21:04.084000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Oh thanks for elaborating, I think it may be possible to include it in the future, though for now I think we should include the things in the docs which we know are needed. \n\nWe can revisit topological sorting once you've hashed it out and we are certain that it does indeed help readers gain a better understanding of verkle tries. If you want me to take a look from time to time, feel free to create an issue and I can add comments/questions 🙂",
        "created_at": "2022-09-20T13:26:59.080000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks Kev. I will edit the PR and will wait for your approval to proceed. !",
        "created_at": "2022-09-20T13:34:03.709000+00:00",
        "attachments": []
    }
]