[
    {
        "author": "bridge-bot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003cdankrad\u003e \u003e \u003cdankrad\u003e  I think it's mostly ok. The only downside I can see is that you need to know the other values — e.g. you cannot access only one of them if you don't know the others. But that seems a fairly minor concern here (re @verkle_bot: \u003cGuillaume Ballet\u003e @dankrad could you please shine some light on this?)",
        "created_at": "2022-09-12T15:57:15.296000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003cdankrad\u003e \u003e \u003cdankrad\u003e  I guess my question is if this is a large amount of the stored data? I kind of imagine that it's a tiny part when compared to contract storage, but I don't know (re @verkle_bot: \u003cfunnygiulio\u003e But on a more serious note, if we can get the verkle tree to be compact, it would be really nice, if it is just hard to implement I think it should at least be attempted. current Erigon is taking 1 day to generate verkle trees while Geth 6 days, so a tree more compact would be appreciated.)",
        "created_at": "2022-09-12T15:59:24.074000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003cdankrad\u003e Thinking about it, I think it does not make any difference. accessing 3 elements in the suffix tree has very minimal overhead over accessing 1. That's what we actually optimized for. So for the witnesses and witness verification it barely matters.\n\nFor database size, I guess the only question is if you can simply store these values in a compressed form. Or is there a fundamental reason why you'd keep them as 32 byte values?",
        "created_at": "2022-09-12T16:01:07.668000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003cdankrad\u003e If for some reason it is much easier to implement the database if you compress these values into one, and that is actually a majority of the state data storage, then yes I would agree that this is a worthy consideration",
        "created_at": "2022-09-12T16:02:05.470000+00:00",
        "attachments": []
    }
]