[
    {
        "author": "bridge-bot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003cdankrad\u003e awesome! Looking forward to the analysis",
        "created_at": "2022-12-16T13:08:23.171000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003cdankrad\u003e can we get it for MPT and VT in comparison?",
        "created_at": "2022-12-16T13:08:43.126000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That would be interesting, but doesn't that mean that we'd need a fully migrated mainnet state from MPT to VKT?\nThat would allow to know the depth of the VKT for the mainnest state... and from there, we'd simply know that for all contracts (since they're all in the same trie) the expected depth in the access is the depth of the tree.\n(Thinking out loud here, so correct me if wrong!).\n\nFor that full migration, we need to have access to all preimages from an archive node. I think there's some work going on by other people in preparing that, so I think could take a while to be able to do a \"fair/precise\" comparison.",
        "created_at": "2022-12-16T21:09:03.690000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@555483069038198827\u003e, since I only have a full node (snap synced), I can do something a bit more creative to have some angle of comparison.\nWhat I could do is try to compare both MPT and VKTs a bit \"on the fly\". So while I'm tracing the execution of mainnet blocks (and collecting the MPT depth access for each LOAD/STORE slot), I could generate the corresponding VKT key on the fly (since technically I've the preimage from the VM stack).\n\nDespite that won't tell me the depth of the VKT (since that requires migrating all the state), I could figure out how the \"locality optimization\" would play out.\nSo for example, if the txn execution accessed slots 0, 2 and 3... those would be 3 branch accesses in a MPT; but in a VKT I could figure out that those three accesses are part of the seam leaf (since they fall in the same 256 bucket (being a bit informal here)).\n\nSo, we can have an idea that transactions would move from 3 tree accesses, to 1 (in that example; in the worst case if the contract is jumping around would be the same).\n\nMaybe a bit wildish but sounds \"doable\". (Thinking out loud here; so I can be missing something but I think makes sense to me)\nWhat do you think?",
        "created_at": "2022-12-16T21:15:58.083000+00:00",
        "attachments": []
    }
]