[
    {
        "author": "bridge-bot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003cdankrad\u003e \u003e \u003cdankrad\u003e  Very cool. This is only MPT for now? (re @verkle_bot: \u003cignacio (jsign)\u003e @dankrad, coming back to something you've hinted to explore some weeks ago, I created a report that analyzes the depth of MPT in mainnet both for the State Trie and Storage Tries. (Took me a while just because I had to buy a 2TiB SSD and sync a node at home; not only for this but for other future things I'm interested too)\nYou can access it here: https://hackmd.io/@jsign/geth-mpt-analysis\n\nThe tool I created to generate this report can be inspected here: https://github.com/jsign/verkle-vs-patricia/pull/5 (no need to look at code, just mentioning it if somebody else is interested).\nAnyone with a Geth node can run this tool to reproduce the results (you have to stop it, and provide in `--chaindata` the path of the chaindata folder so the tool can access directly the leveldb database).)",
        "created_at": "2022-12-04T03:03:05.224000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003cdankrad\u003e I think we discussed that ideally we want the averag depth of accesses (rather than the full tree) over a number of blocks?",
        "created_at": "2022-12-04T03:04:09.188000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@555483069038198827\u003e , in my notes I had this captured that made me go back to do this:\n\u003e \u003cdankrad\u003e The most interesting thing now would be good average depth estimates for MPT\n\u003e \u003cdankrad\u003e that is (1) average accound depth and (2) average depth of storage trees inside accounts",
        "created_at": "2022-12-04T13:31:57.051000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But the avg depth of accesses in a block range sounds quite interesting, since that's trying to include into the equation which contracts are more frequently accessed.\nLooking at the trie in general, even if ~60% SC have depth 1, if most of the transactions call SCs in the tail of the curve (e.g: uniswap) then clearly the access depth will be way higher.",
        "created_at": "2022-12-04T13:33:53.035000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Last Tuesday I'd a call with Guillaume and Kev. I think our next steps is trying to compare both MPT and VKTs more closely.\nGuillaume has mentioned some times he has a \"replay block\" benchmark that I think is pretty close to what you're proposing. I'd love to run that locally, but I think he's trying to wrap it up to be available (and I'd guess it needs to share some state).\n\nIn the meantime, I'll be taking a closer look to comparing our MPT and VKT implementations on inserting 10k (or parametrizable) accounts. It's reasonable that we can still find the reasons for the current performance differences.\nBut ideally, the block replay benchmark is the ideal thing to be looking closely.. any other bench prob introduces some kind of artificial assumption that isn't representative of a real run. That's why I'd like to look at \"block replay\" benchmark when ready since seems to be the perfect target to look at.",
        "created_at": "2022-12-04T13:40:26.965000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "After reading the above report, \u003c@353136597522448385\u003e  said it would be interesting to see for the branches that have an Extension node, which was the average length of those Extension nodes.\nI tuned a bit the tool to answer this and leaved this running at night (not a full trie run, but 163 million leaves). \nSharing here the results if are also interesting for others:\n```\nWalked 163065487 (EOA + SC) accounts:\nState Trie - Extension Length:\n1: 93.30% (3609877)\n2: 5.74% (221891)\n3: 0.56% (21654)\n4: 0.31% (11882)\n5: 0.09% (3410)\n6: 0.01% (220)\n7: 0.00% (16)\n```\n(I added it as an appendix in the report)",
        "created_at": "2022-12-04T13:54:56.978000+00:00",
        "attachments": null
    }
]