[
    {
        "author": "0xraino",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Can I get a tl;dr of the discussion around temporary gas cost increases during the transition? The thorniness of more complicated sync with the writable MPT is much more salient to me but it could be because there's something about the downsides of the gas cost increase I'm not appreciating.",
        "created_at": "2023-09-07T02:17:56.200000+00:00",
        "attachments": []
    },
    {
        "author": "namngrg",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hey \u003c@774033563732541451\u003e , I was reading this https://hackmd.io/@jsign/mpt-depth-vkt-locality-in-block-executions#Results , amazing work I must say. What do you think about going one step further and generating files containing the access operations done to the verkle trie, so we can replay it at ease without needing a full client with the full blockchain evaluating transactions?\n\nContext - I was working to solve this issue https://github.com/status-im/nim-eth-verkle/issues/7 , I think its similar to what you have done only difference is generating files. \n\nAny other suggestions are also appreciated",
        "created_at": "2023-09-07T07:09:01.264000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Glad that you found that useful/interesting. :)  \nWhat is mentioned in that issue looks useful. Not only to gain some insights as discussed there, but can also be a good quick-\"e2e\" test to check the correcteness of your impl while doing changes/optimizations. (i.e: the final state root should be the same).\n\nFor geth tests and optimizations, we've been replaying some chain history which clearly is heavier... but we re interested in testing the whole thing: a) The state migration using the overlay tree method  (thus having dual tree access + extra load migrating state), 2) After the transition finishes, keep going with the VKT with the full state (which I think is what you're trying to focus).\n\nOf course as you imagine the setup for that is not light enough to be pushed to your gh repo... so I think that middle point is good. it might mask some bottlenecks since it's simplifying some things (e.g: if your state is artificially smaller, then the depth of the VKT won't match the true depth... but maybe you can also inject fake data that that you know in your setup won't be ever accessed or doesn't interfere, just an idea (how to \"truthfully\" inject data needs some assumptions so  requires some thought)).",
        "created_at": "2023-09-07T12:02:17.002000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The TL;DR is just that whatever inefficiency/extra-overhead of the state-transition strategy might have, has to surface to an increase of gas costs _during_ the transition phase.\nIn the case of the Overlay Tree method, what has been discussed up to now is that some state access could require double reads since you can't predict if the next storage access is on the VKT or MPT.\nThe downside is \"just\" the fact of increasing gas costs for some time. \"some time\" current estimations is less than a month (with caveats since 4844 overhead isn't accounted yet). (also, could be faster for a \"normal\" machine, but you'd push too hard on setups like rock5b)\n\nBut... there could be still be ideas to avoid this gas cost increase with the overlay tree method, so the gas increase during the trasition might not be a \"fact\" yet. just explaining a bit where this comes from.",
        "created_at": "2023-09-07T12:13:02.820000+00:00",
        "attachments": []
    },
    {
        "author": "0xraino",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "thanks. makes sense. and the transition is entirely observable from within the protocol so if we went the route of temporary gas cost increases, they could return back to their previous levels automatically, correct?",
        "created_at": "2023-09-07T16:00:37.254000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, exactly. Actually, \"return back to their previous levels\" should actually be \"return back to the designed new gas accounting changes\" (i.e: https://eips.ethereum.org/EIPS/eip-4762).\nSo yes, the gas overhead we're talking about here reg the transition should disappear as soon as the migration finishes... that's why it's important to:\n- Keep pushing for perf improvements. Can allow to migrate more key-values per block in the current strategy. [As always, while not trying to push validators too much to lag behind]\n- The sooner we do the migration, the smaller the state to be migrated thus the transition duration is (so less time with this _potential_ gas overhead or performance hit in all validators in general).",
        "created_at": "2023-09-07T16:14:12.214000+00:00",
        "attachments": []
    },
    {
        "author": "0xraino",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "do you have any data on how much new state is added per unit time these days?",
        "created_at": "2023-09-07T16:20:25.186000+00:00",
        "attachments": []
    },
    {
        "author": "namngrg",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks for this!",
        "created_at": "2023-09-07T19:28:52.963000+00:00",
        "attachments": []
    }
]