[
    {
        "author": "ngweihan_eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Wrote a guide on how to join the latest verkle testnet, may refer to it if anyone is interested in running a node on it:\nhttps://hackmd.io/gZP7Yti0Tna3lgZEgammhQ?view",
        "created_at": "2023-12-01T06:19:15.479000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "To summarize your proposal: for accounts, pack balance+nonce+codesize in a single 32-byte value (i.e: offset 0) — having to do bit-(un)packing to access/write those. \n\nLet’s assume that for circuits this adds some overhead that we’re willing to accept to help out of circuit impls (i.e: short/medium term). \n\nSharing extra thoughts (might be others):\n- This can reduce witness size and number of openings to prove/verify. [Which is related to the gas cost reduction you mention]\n- For reading the tree: we don’t save “work” in the tree-accessing part, since calculating the tree is per stem, so that was already one MSM. (Edit: Regarding disk lookups, I dont' think it makes a diff. If the client uses flatdb is already O(1). If uses a tree, all values are saved as \"unit\" probably))\n- For updating the tree: in some cases it save some work, reducing the number of scalar muls to update C1.\n- I don’t think state bloat is a problem, since clients can optimize their leaf node serialization in any way possible. e.g: for EOA leafs (which they can identify), they can pack values in the most efficient way for their db. (Actually, it will be recommended they do that for other cases in storage slot ranges probably)\n- This design optimization “leaks” into the external world. For example, if you’re looking at post-state values in the witness, as a lib you have to be aware that nonce+balance+codesize need this byte-unpacking work. (Not sure it’s a big deal, but just mentioning — today each value has a clean interpretation)\n\nEvery time I said “some cases”, mostly means cases in which both the nonce+balance gets mutated (for tree writes). Or nonce+balance(+codesize) gets read (for the witness). \n\nI don’t know if this idea was ever considered — maybe \u003c@353136597522448385\u003e  or \u003c@555483069038198827\u003e  know.",
        "created_at": "2023-12-01T11:09:51.171000+00:00",
        "attachments": []
    },
    {
        "author": "philogy",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Very good summary of my proposal 👍",
        "created_at": "2023-12-01T11:12:16.680000+00:00",
        "attachments": []
    },
    {
        "author": "holgerd77",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Just jumping in here: trying to trace a transaction/block (block 13) on the current Kaustinen iteration from https://verkle-gen-devnet-2.ethpandaops.io/.\n\nI trie both `eth_traceBlockByNumber` and `eth_traceTransaction`, also both with both tracer options (`callTracer`/`prestateTracer`).\n\nHere is an example call:\n\n```shell\ncurl -X POST -H \"Content-Type: application/json\" --data '{\"jsonrpc\":\"2.0\",\"method\":\"debug_traceBlockByNumber\",\"params\":[\"0xd\", {\"tracer\": \"prestateTracer\"}],\"id\":1}' https://rpc.verkle-gen-devnet-2.ethpandaops.io/|jq\n```\n\nAll variants give me the following:\n\n```json\n{\n  \"jsonrpc\": \"2.0\",\n  \"id\": 1,\n  \"error\": {\n    \"code\": -32000,\n    \"message\": \"tracing failed: nonce too low: address 0x687704DB07e902e9A8B3754031D168D46E3D586e, tx: 0 state: 13094\"\n  }\n}\n``` \n\nFor now I assume this is known and tracing is just not yet implemented into verkle-geth version. If this assumption is false and/or this could be easily fixed, please ping me. Guess this would ease debugging on our side a lot if tracing in some form would be available.",
        "created_at": "2023-12-01T12:17:01.043000+00:00",
        "attachments": []
    }
]