[
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Better to ask here and apologies in advance for the noob question, I feel is early enough that I don't have any shame in asking. For background, the way currently on the CL side works if I want to know if my ex girlfriend slashed a validator 2 years ago, I could checkpoint sync a node right now (download the current beacon state) at the same time download all blocks and validate them only checking the beacon blockroot and then go back from genesis executing state transition to get to the state in question (I could do fancier things, but this is good enough to describe my question). \n\nIs the situation similar if I now start a Verkle node (2 years after the transition) and I want to know if my ex-girlfriend paid some ETH two years before the transition? is the mechanism the same? meaning I can download the current state in a similar form to snap sync and then all blocks, validate them all through genesis and then start regenerating the state in a pre-transition version?",
        "created_at": "2023-05-05T14:45:22.583000+00:00",
        "attachments": null
    },
    {
        "author": "gballet",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "as mentioned during the call, here is the link to the EIP requiring clients to enable preimage recording https://github.com/ethereum/EIPs/pull/6873 But we all seem to agree that spreading preimages over the network is the better solution, so this is just for reference.",
        "created_at": "2023-05-05T15:02:50.469000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "rollup appreciation week has already started 😆",
        "created_at": "2023-05-05T18:02:45.114000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "image.png",
                "content": "77e29c47b07a3139b03f1c003dcd988cddffa8e1d3c32a137375f2eec9b94d07"
            }
        ]
    },
    {
        "author": "rudolf6",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Notes and recap from today's call:\nhttps://github.com/ethereum/pm/issues/776",
        "created_at": "2023-05-05T20:09:37.648000+00:00",
        "attachments": null
    }
]