[
    {
        "author": "dragan2836472",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hey there, I've been reading about the verkle tries for some time and have done some small projects around verkle, and my understanding so far is that the main reason the transition is happening from merkle to verkle is because it will help ethereum reach weak statelessness and help onboard more validators, but also because it is much cheaper and easier to prove verkle trie than merkle trie in circuit for zk rollups, which means it should be easier to have type 1 zk-evm (because of the removal of keccak and having eliptic curve operations (pedersen commitment + IPA)).\n\nI have a few questions:\n- Is there any project working on Verkle tries zk circuit implementation (in the pse zkevm, Halo2 lib or something else(rollups), etc.)?\n- Is keccak only used for merkle tries inside ethereum, or are there more parts of the protocol that use keccak? Are there more parts of the protocol that make having zk-evm type 1 expensive/slow to prove?\n- In general, how important are verkle tries for scaling ethereum and zk rollups? Priority is statelessness, but there are some mentions of scaling, and the curve chosen (bandersnatch/banderwagon) is snark-friendly, so that's why I'm asking.\n- Is the decision to have Verkle tries storage data structure in Ethereum final?\n\nMaybe I'm overthinking the next question and my understanding is wrong, but still:\n- Does achieving zk-evm type 1 with reasonable proof (and/or execution?) time (12 sec) mean that the ethereum full-nodes around the network could be(in some future) prover machines where submitting a transaction would mean only 1 full-node could execute and make the state transition proof, and other nodes should only verify the proof and make changes to state? I guess there are still many problems with this architecture (fullnode-prover software requirements, consensus layer, mempool, etc.), but still wanted to ask if that even makes sense - it would be a non-rollup ecosystem with many changes to current architecture",
        "created_at": "2023-07-24T22:02:41.826000+00:00",
        "attachments": []
    }
]