[
    {
        "author": "dragan2836472",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "is there any work still around in-circuit performance(zkSNARK friendlieness) of post-quantum additively homomorphic PCS?\n\nI'm trying not just to throw random words, but I guess some of the people understand what I mean by that: verkle tries add more non-post-quantum cryptography to ethereum and I'm researching about which other PCS could be used here, and stumbled across this paper https://eprint.iacr.org/2022/1368.pdf which describes \"functional commitments\" and they seem to be a vector commitments, additively homomorphic, and post-quantum safe too(but require \"transparent\" setup). But I've asked the guy who did more research around this ( https://github.com/Lev-Stambler/CP22-function-commitment ) and his comment on the possible performance in-zk-circuit of this VCS is this:\n\n\"The problem with this paper is that it forces one to use boolean fields rather than larger arithmetic ones. This comes at a substantial blow up to the overall circuit, not to mention there is a constant blowup (something like each boolean is represented by ~1_000 bits).\"\n\nBut would like to learn if anyone is still researching about this or the decision to go with pedersen+IPA is already made since geth and nethermind already have it and maybe this just adds more complexity to already complex topic of migrating MPT-\u003eVKT and general development of crypto libraries",
        "created_at": "2023-08-24T00:35:05.637000+00:00",
        "attachments": []
    },
    {
        "author": "dragan2836472",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "my understanding is that verkle enables separation of \"stateless\" clients and full node clients where stateless clients could pariticipate in the network by validating blocks via small proof that VKT enables without storing state, which means having lower software requirements for people running stateless clients. In future hopefully on mobile devices for example. So stateless clients would only store current state of all accounts and their storages, transation trie, receipets trie etc. in 1 verkle trie. Stateless clients wouldn't be able to propose new blocks which need historical on-chain data. But i think they could propose blocks with the on-chain data that is non-historical.\n\nMaybe I answered something wrong, I'm not the biggest expert here, but hope it helps",
        "created_at": "2023-08-24T01:05:57.803000+00:00",
        "attachments": []
    },
    {
        "author": "draganrakita",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Mostly yes but \"stateless\" clients is what the light client are, as name says it they dont have state but can verify proof of the state, the verkle trie helps that the proofs be reasonable in size. So if it have full state it is more aligned to the current full node, more info here if you like: https://rakita.github.io/blog/blog/zombie-nodes/ \nWith the question i was more interested to pick the Dankrad brain on the topic/insights and reasoning behind his thinking.",
        "created_at": "2023-08-24T13:31:26.670000+00:00",
        "attachments": []
    },
    {
        "author": "draganrakita",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "hm it seems i messed this up, light clients and stateless clients are a different things",
        "created_at": "2023-08-24T15:50:49.575000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'd say that the cryptography part of VKTs is mostly a final decision, so pretty sure we won't be changing that. Going post-quantum is mostly about allowing the protocol to be upgradable. There even more basic things today, like signatures, that aren't post-quantum so I'd guess the general approach needs more thought in general. This apart from performance or security aspects or introducing new assumptions (like trusted setups you mention).",
        "created_at": "2023-08-24T16:29:19.362000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e Stateless clients wouldn't be able to propose new blocks which need historical on-chain data\nMight worth noticing the difference between \"proposing\" and \"building\". For \"building\" you need the whole state, but in a world with enshrined PBS maybe stateless clients can also propose blocks.",
        "created_at": "2023-08-24T16:31:57.412000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The most obvious/simpler use-case is stateless clients only generating attestations. I think there's some research going on to understand the incentives/implications of this.",
        "created_at": "2023-08-24T16:33:39.218000+00:00",
        "attachments": []
    },
    {
        "author": "ethdreamer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Since we brought up PBS I had some thoughts. Certain constraints around enshrined PBS are motivating us to completely disallow local block building and force all builders to be registered in the protocol (\u0026 potentially staked heavily).\n\nThis is a worse situation than today. Even though the vast majority of blocks are built by a small number of builders, if they were to all go simultaneously, the protocol would immediately revert to local building and continue.. if we disallow local building that won't be the case.\n\nBut in a stateless world are we in the exact same place anyway?",
        "created_at": "2023-08-24T16:59:59.049000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks for mentioning that consideration... I guess that's the case. Still sounds like an interesting research topic to understand the tradeoffs. My first reaction is that local building is always a good fallback to have. \nMaybe stateless clients could still register, and be a fallback option if there's some fast/cheap way to reconstruct full state (being full sync or download from other sources). Just thinking out loud; I'm not that into PBS.",
        "created_at": "2023-08-24T17:13:58.618000+00:00",
        "attachments": []
    },
    {
        "author": "sleepingshell",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hi all, hope this is the right section. I'm working on my own rust verkle tree implementation and I'm wondering if anyone has links to 1) The cryptography on aggregated proofs for the underlying commitment scheme (IPA), specifically in evaluation form, and 2) How these aggregation techniques are utilized in the verkle trie itself?\n\nAnd regarding evaluation form, although the width of the tree isn't the large, I'm implementing it in that form for performance reasons as opposed to in coefficient form",
        "created_at": "2023-08-24T20:47:42.750000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Probably the best way to have an idea of both 1) and 2) is reading Dankrad's article: https://dankradfeist.de/ethereum/2021/06/18/pcs-multiproofs.html\nThere's also a Rust library implementing all this: https://github.com/crate-crypto/ipa_multipoint [mentioning only for reference, if helps]\nAlso a Go lib: https://github.com/crate-crypto/go-ipa",
        "created_at": "2023-08-24T20:50:44.730000+00:00",
        "attachments": []
    },
    {
        "author": "sleepingshell",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks, I had read that article a little bit ago but you're right this probably has the info I need 🙂",
        "created_at": "2023-08-24T20:51:42.339000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Actually, this is the spec-ref in python, maybe it's better to look there for understanding to avoid being confused by some further optimizations: https://github.com/crate-crypto/verkle-trie-ref",
        "created_at": "2023-08-24T20:53:11.484000+00:00",
        "attachments": []
    },
    {
        "author": "sleepingshell",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Oh yeah this is super helpful, thanks",
        "created_at": "2023-08-24T20:56:42.079000+00:00",
        "attachments": []
    }
]