[
    {
        "author": "milos88",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hey, that would be great. I will dm you",
        "created_at": "2023-09-29T05:51:34.956000+00:00",
        "attachments": null
    },
    {
        "author": "rudolf6",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hey all, I was recently chatting with \u003c@429719902363058177\u003e from the reth team, and figured it would be helpful to share here as it is relevant to some of the above discussions.. I mentioned to Dragan there has been some interest in rust implementations / getting rust-verkle into reth (https://github.com/crate-crypto/rust-verkle) \n\nSee below for quick summary. TLDR: reth verkle implementation still somewhat tbd. Dragan will discuss with the team, and then circle back 🙏 \n\nFor anyone interested in exploring or learning more, please let us know here in channel. Would be great to make sure to confirm things with Reth team before starting, to avoid stepping on toes etc\n\nReth current status: \nHaven't actively started working on verkle. There is probably a need to add functionality to rust-verkle so it would behave the same as in merkle tree.",
        "created_at": "2023-09-29T15:08:21.837000+00:00",
        "attachments": null
    },
    {
        "author": "milos88",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks for the update. I would be interested in learning more.\nI already added this topic for Tuesday meeting. Should we discuss it there or should I chat directly with \u003c@429719902363058177\u003e and reth team?",
        "created_at": "2023-09-29T15:37:35.760000+00:00",
        "attachments": null
    },
    {
        "author": "rudolf6",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Great thanks! I think on Tuesday’s call is great! And in the meantime we can keep the convo going here. Feel free to share any thoughts/questions here any time 🙂",
        "created_at": "2023-09-29T15:48:56.456000+00:00",
        "attachments": null
    },
    {
        "author": "milos88",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Last few days I have been looking into `rust-verkle` and `reth` repos and I was under impressions that it would have to been adopted (or reimplemented), so your update confirms that.\nI guess the next steps would be to understand if/when reth team would be able to work on that and if I can help to speed up the process (and how to organize that).\n\nWe would also like to discuss the option of integrating reth into trin (portal client), and that's not strictly related to verkle but it's connected.",
        "created_at": "2023-09-29T16:02:56.877000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hello \u003c@261161007982968833\u003e, we still didn't start actively working on it. Integrating it inside `reth` is maybe main thing as that would probably require modification to the tree. So maybe first steps would be to check how merkle tree works inside `reth` so it is easier to see functionality that we have. Would recommend checking out Merkle stage it is one of stages in pipeline that calcualted Merkle Tree (First call full state calculation and incremental one): https://github.com/paradigmxyz/reth/blob/main/crates/stages/src/stages/merkle.rs#L281",
        "created_at": "2023-09-29T16:36:30.305000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Just to say this is sensitive part of code for exnaple we spend a lot of time on merkle to make it usable for us, so we dont want to rush verkle (and we have different priorities rn), but help on rasearch on integration or adding needed functionality can be useful.",
        "created_at": "2023-09-29T16:43:38.606000+00:00",
        "attachments": null
    },
    {
        "author": "milos88",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hey \u003c@429719902363058177\u003e , thanks for the pointers. I will check it out before Tuesday's meeting and we can discuss in details there",
        "created_at": "2023-09-29T16:58:25.685000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Didn't plan to join, maybe best to do it async.",
        "created_at": "2023-09-29T17:01:40.093000+00:00",
        "attachments": null
    }
]