[
    {
        "author": "build4c",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hi, is there some data about verkle tree vs merkle tree in eth mainnet dataset comparison? about storage size? state root calculation? proof size?  etc.",
        "created_at": "2023-06-25T03:17:21.342000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We've been using more and more recent network state to run some benchmarks, but I don't think (guillaume may correct me) we have come to any full or overlay migration close to the tip yet.\nEven if that's the case, I don't we have final-ish numbers to be sure about storage size since there's currently some effort in trying to see how VKT play with path-base state storage in Geth... the Geth team has some ideas around how to optimize internal tree node serialization exploiting some benefits of PBSS, which could could definitely compress total storage size compared with \"hash based\" node storage. This is work in progress but we might know more concrete numbers soon. Of course, depending on how clients are storing state, the answer to this question may differ.\n\nReg \"state root calculation\" I'm not sure what do you mean. The state root in VKT is an elliptic curve point of the Bandersnatch elliptic curve, which serialized can be thought as a 32 byte chunk. If you mean \"how it's calculated\", it is a similar idea to the Merkle Patricia Trie but using vector commitments of a much wider/shallower tree instead of hashing. I'd recommend taking a look at https://dankradfeist.de/ethereum/2021/06/18/pcs-multiproofs.html  \"Connection to verkle tries\" section to get a good general idea.\n\nReg \"proof size\" that would depend on each block. The proof size isn't constant and depends on how many values are \"opened\" in the block execution. The proof is basically a list of (commitments, eval point, value) and a single Inner Product Argument proof. (The \"Introduction\" section of https://dankradfeist.de/ethereum/2021/07/27/inner-product-arguments.html can give you more details). I guess we could get an estimation by doing historic analysis on how many openings were needed in the last X blocks in mainnet and get a rough number.",
        "created_at": "2023-06-25T18:59:27.855000+00:00",
        "attachments": null
    }
]