[
    {
        "author": "yperbasis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "At the next EL ACD call on 31 Aug I'm suggesting to discuss our strategic vision around Verkle and state expiry. To my mind https://notes.ethereum.org/@vbuterin/verkle_and_state_expiry_proposal  makes a lot of sense. If we follow it, we don't need to translate a chunk of the Merkle–Patricia trie into Verkle with every block, which is IMO in-elegant and complicated. I'm a fan of both Verkle and state expiry and Vitalik's proposal offers a nice path to reach both.",
        "created_at": "2023-08-21T06:49:14.363000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003cdankrad\u003e I think we have decided that state expiry can at the very least postponed by several years if we implement verkle, if it is required at all. So we intentionally now restructured most of the work to not be based on state expiry anymore and make verkle viable even if state expiry is never implemented",
        "created_at": "2023-08-21T08:02:43.735000+00:00",
        "attachments": []
    },
    {
        "author": "draganrakita",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "How is it being postponed by verkle? There are other good reasons to, but just wondering what is this connection",
        "created_at": "2023-08-21T08:48:52.140000+00:00",
        "attachments": []
    },
    {
        "author": "yperbasis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "A bigger state is a constant toll you pay on each state access operation. Fundamentally, it's some kind of trees all the way down (either in memory or on disk), so roughly speaking the cost of each access operation is `O(log n)`, where `n` is the size of the state. Even if `n` is not big enough to present a problem for the sync time or the disk space, a bigger `n` is always a drag on the performance.",
        "created_at": "2023-08-21T10:59:38.553000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003cdankrad\u003e Verkle massively reduces the number of nodes that need to keep the state locally, in particular, you will not need the state (and keep updating it) if what you need to know is just which block is the current head",
        "created_at": "2023-08-21T15:31:28.302000+00:00",
        "attachments": []
    }
]