[
    {
        "author": "devaviral",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I had the same question",
        "created_at": "2023-07-19T11:14:08.464000+00:00",
        "attachments": []
    },
    {
        "author": "devaviral",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Also I am new to verkle trie concepts, can someone suggest some resources to get started",
        "created_at": "2023-07-19T11:15:13.183000+00:00",
        "attachments": []
    },
    {
        "author": "ngweihan_eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I've gathered all materials that I could find, you may refer here:\nhttps://github.com/weiihann/awesome-verkle",
        "created_at": "2023-07-19T12:38:35.002000+00:00",
        "attachments": []
    },
    {
        "author": "devaviral",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks! Is this in order of complexity?",
        "created_at": "2023-07-19T12:40:58.604000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@606464909907197983\u003e , \u003c@936500607316004875\u003e , reg your question about stateless client:\nThe idea is somewhat simple: if you have a block and want to execute it, at some point the EVM will ask you for state-related information. If you have all the pre-state needed for _that_ block execution, every time the EVM ask you for required state to execute _that_ block you will/must find it in the block pre-state.\n\nTechnically, that idea isn't new really... the crux lies on how cheap/small is to prove that whoever gives you the state, really matches with the state root of the chain at that point. With MPT you could do that but the proof is too big. With VKT, that proof is much smaller making it more viable to build a stateless client.\n\nHow to architect that in a client depends. For regular state (e.g: account info, storage-slots) you could technically put the information in the database and in theory the EVM should only query for that and find what it needs. Where it can get a bit more hairy (again, depends on the client!) is on how the EVM manages smart-contract code, since today there's some reasonable assumption that you can pull the complete code from the db and take what you want... but technically that isn't the case for VKT. (This is more like an implementation detail)",
        "created_at": "2023-07-19T13:11:54.863000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "btw, cross posting something i shared in the EFP chan. \nlatest talk from Guillaume last monday in EthCC:\nhttps://www.youtube.com/watch?v=F1Ne19Vew6w",
        "created_at": "2023-07-19T13:23:37.161000+00:00",
        "attachments": []
    },
    {
        "author": "ngweihan_eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "unfortunately no 😦\n\nbut I would recommend starting with this video:\n\nhttps://www.youtube.com/watch?v=Q7rStTKwuYs\n\npersonally, I really liked the pirate analogy and it makes so much sense when comparing MPT vs VKT",
        "created_at": "2023-07-19T14:57:41.601000+00:00",
        "attachments": []
    }
]