[
    {
        "author": "uink45",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hi, is there a networking specification available for Verkle trees? I have been able to find documentation about the 'wit' protocol in DevP2P, however, i am not sure if it is being actively used in any of the Verkle testnets.",
        "created_at": "2023-10-30T05:42:30.440000+00:00",
        "attachments": []
    },
    {
        "author": "dragan2836472",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Question:\n\nImagine we have 2 storage slots that we want to save to the trie. For that we need to derive the trie-keys for them. Example:\n\npedersen_hash(address1,trieIndex1 / 256) -\u003e 0x0c8ca4aa6d74880db2c2bf3adfae2ac9cf01ebeb590403293d9c70aa07c3090a\n\nand\n\npedersen_hash(address2,trieIndex2 / 256) -\u003e\n0x0c8ca4aa6d74880db2c2bf3adfae2ac9cf01ebeb590403293d9c70aa07c3090b\n\nThese 2 only differ in last byte - i guess this is possible. Since we are chopping of last byte for the subIndex(trieIndex % 256) that means the value would be overwritten in the trie. Or it could be they differ in first byte (it could be that we reverse bytes here, but the issue is the same)\n\nSo:\nIs having same 31bytes(first 248bits) for different input in pedersen(MSM which produces a banderwagon element serialized to base field (x coordinate), so its 253 bits (which is still larger than 248bits)) considered negligable?\n\nI know \u003c@774033563732541451\u003e did some testing regarding this here: https://gist.github.com/jsign/cb633d1439050b81906a53ea3f083405\n\nBut I'm not sure how to interpret those (I guess the case I described above is considered negligable, but want to confirm?)",
        "created_at": "2023-10-30T14:17:57.817000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That case that you describe should be negligible (if I understand your question correctly). This fact is not specific to Verkle Trees but any other kind of hashing function, since your output domain is bounded in size.\nThe same applies to sha256 or any other hashing function... there will be collisions for sure, just that they're designed to be hard to be intentionally found.",
        "created_at": "2023-10-30T14:25:37.040000+00:00",
        "attachments": []
    },
    {
        "author": "dragan2836472",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "aham thanks. so even if we chop off last byte",
        "created_at": "2023-10-30T14:26:30.207000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes. I mean, chopping bits of course increase the probability by  2^bits but if you still consider all the remaining ones is quite a lot. (assuming all output bits are uncorrelated/uniform)",
        "created_at": "2023-10-30T14:27:34.455000+00:00",
        "attachments": []
    },
    {
        "author": "dragan2836472",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "what i meant is here we are not using Hash() directly, but chopping of last byte and puting something \"fixed\"",
        "created_at": "2023-10-30T14:29:31.407000+00:00",
        "attachments": []
    },
    {
        "author": "dragan2836472",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "makes sense",
        "created_at": "2023-10-30T14:31:46.044000+00:00",
        "attachments": []
    },
    {
        "author": "rudolf6",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Agenda for tomorrow's VIC below. Feel free to add any items to the agenda 🙏\n\nhttps://github.com/ethereum/pm/issues/882",
        "created_at": "2023-10-30T17:24:08.956000+00:00",
        "attachments": []
    },
    {
        "author": "gballet",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "no wit isn't used in any of the verkle testnets. In its current specification, it seems only useful to beam sync and verkle proofs make it unnecessary to query individual nodes out of band.",
        "created_at": "2023-10-30T19:14:42.145000+00:00",
        "attachments": []
    },
    {
        "author": "uink45",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks \u003c@353136597522448385\u003e! Are nodes free to query only specific portions of state (for the purpose of getting to know their account balance or starting a full sync) from other stateful nodes via the snap protocol? And do nodes get down scored in terms of peer scoring if it is unable to fulfill requests from other if it doesn't have the state? I am assuming this is not currently present in the testnets.",
        "created_at": "2023-10-30T20:52:41.183000+00:00",
        "attachments": []
    }
]