[
    {
        "author": "techbro_ccoli",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What does a witness proof look like exactly, does it contain all the proofs to verify every transaction within a block? Or is it more of an aggregated single proof for the entire block? 😄",
        "created_at": "2023-11-29T13:21:51.721000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Note that the witness isn't proving execution of transactions, it's proving the provided data needed to execute the block. So it's a _state proof_ not an _execution proof_.\nThe witness contains:\n- All the key-values needed to execute the block (i.e: pre-state)\n- A proof that all these provided data is indeed contained in a partial view of the tree with root equal to the state root fo the previous block. (i.e: this data isn't invented, manipulated, etc -- similar-ish to a merkle proof)",
        "created_at": "2023-11-29T13:23:37.948000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "BTW, I'm currently writing an article that tries to dive deep into this _witness_: what it is, how is built, how is verified, etc. So hopefully soon-ish it can help many people understand all this without (necessarily) reading code.\n(Still feel free to ask -- just mentioning)",
        "created_at": "2023-11-29T13:27:43.217000+00:00",
        "attachments": null
    },
    {
        "author": "techbro_ccoli",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ahh okay perfect, that makes sense thanks for clarifying!",
        "created_at": "2023-11-29T13:39:01.069000+00:00",
        "attachments": null
    },
    {
        "author": "techbro_ccoli",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The reason I am asking is for test generation within `execution-spec-tests`, as I think we should update how we generate tests within the framework. We essentially have an input alloc (pre-state) and output alloc for every block that is processed using an external client t8n tool. For each block it looks like we should retrieve the witness from a client (either from the t8n tool or another command), and verify that the key-values within the returned witness match the pre-state (input alloc) we pass into the client t8n tool",
        "created_at": "2023-11-29T13:39:07.520000+00:00",
        "attachments": null
    },
    {
        "author": "techbro_ccoli",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Also would it make sense for us to generate a proof for each block and verify it matched the proof within the witness returned from a client (t8n tool or another)? That way when we generate tests, at each block we verify the entire witness matches instead of the only the key-values",
        "created_at": "2023-11-29T13:39:26.987000+00:00",
        "attachments": null
    },
    {
        "author": "techbro_ccoli",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This sounds great! 😄",
        "created_at": "2023-11-29T13:39:44.303000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@755913785620824175\u003e, nice, yes I like how that sounds -- I think all those points are good ideas.",
        "created_at": "2023-11-29T13:41:21.973000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I believe most clients will leave the witness generation to the end. Like, after coding the new verkle tree datastructure, doing the gas accounting changes, and the state migration code.\nSo there's definitely time before these witness tests will be used -- but I think is a good idea to think about them for sure.",
        "created_at": "2023-11-29T13:42:38.020000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Witnesses are mostly relevant to enable stateless clients (so not entirely urgent), and (apparently for now) probably used in syncing. (If we can make witness generation fast enough after seeing how much resources hosts are left after 4844...)",
        "created_at": "2023-11-29T13:43:33.837000+00:00",
        "attachments": null
    },
    {
        "author": "techbro_ccoli",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If we had this, we could use this within hive! The verified witness in our generated fixtures could be checked against the witness returned from an rpc call (not sure if eth_getProof will be used or another, i.e eth_getWitness) before clients execute a block",
        "created_at": "2023-11-29T13:43:49.567000+00:00",
        "attachments": null
    },
    {
        "author": "techbro_ccoli",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ahh great to know! Thanks 😄",
        "created_at": "2023-11-29T13:44:45.831000+00:00",
        "attachments": null
    }
]