[
    {
        "author": "milos88",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Is https://eips.ethereum.org/EIPS/eip-6800 the best documentation (should be used as a reference) regarding Verkle Trie and how it works?\nIs there such documentation regarding generating proofs and verification?\nI can't find single location where that is cleanly described. It feels like information is scattered across multiple posts/websites and it's unclear if they are still relevant (some were written quite some time ago). And let's say I don't care about correctness or fully understanding math and why it works, just how to implement everything from the start.\nOr is recommendation to look at code of some existing implementations and try to understand how that works?",
        "created_at": "2023-10-23T09:08:05.597000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "To understand the Verkle Tree datastructure, I'd recommend: https://blog.ethereum.org/2021/12/02/verkle-tree-structure (and 6800, yes)\nFor a \"spec\" python impl, I'd recommend:  https://github.com/crate-crypto/verkle-trie-ref (I'd _definitely_ not recommend \"porting\" other clients implementations)",
        "created_at": "2023-10-23T13:02:07.373000+00:00",
        "attachments": null
    },
    {
        "author": "milos88",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But to understand how exactly proof generation and verification works, I would have to read and understand the code in details, right? (the link and 6800 focus on tree itself, not the proof). \nThe best explanation that I found (and was studying carefully last few days) is this: https://dankradfeist.de/ethereum/2021/07/27/inner-product-arguments.html . I understand it on high level only, but I feel like I'm missing some key details.",
        "created_at": "2023-10-23T13:15:34.530000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "well I was based on your expectation of:\n\u003e And let's say I don't care about correctness or fully understanding math and why it works, just how to implement everything from the start.",
        "created_at": "2023-10-23T13:16:55.638000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There're definitely things that could be better documented.",
        "created_at": "2023-10-23T13:17:45.973000+00:00",
        "attachments": null
    },
    {
        "author": "milos88",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I do need to understand some details in order to implement it :). I don't need to understand why somebody can't fake the proof, or why this specific curve was selected or how to optimize all calculations, etc.",
        "created_at": "2023-10-23T13:20:04.977000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I've been thinking for a while to write some doc that explains some parts of proof generation that today are \\ undocumented. \nThe proof generation has two parts: the \"tree part\" (which I conisder undocumented), and the \"cryptography part\" which I think is documented (but maybe scattered).",
        "created_at": "2023-10-23T13:21:59.445000+00:00",
        "attachments": null
    },
    {
        "author": "milos88",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I did spend last couple of weeks learning about many aspects that are here that I didn't know previously, and I do understand most of it. It's that I'm missing some details, and they are mostly related to proof generation.",
        "created_at": "2023-10-23T13:22:01.129000+00:00",
        "attachments": null
    },
    {
        "author": "milos88",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "and I can't find some really good explanation of that part (e.g. compared to how Verkle tree itself), at least how exactly to use it in the Verkle Tree context",
        "created_at": "2023-10-23T13:23:58.446000+00:00",
        "attachments": null
    },
    {
        "author": "milos88",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yes, that would be very helpful 🙏",
        "created_at": "2023-10-23T13:24:54.270000+00:00",
        "attachments": null
    }
]