[
    {
        "author": "rudolf6",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Reminder: next Verkle Implementers Call is Oct. 3rd at 13:30 UTC. \nAdd topics to the agenda here: https://github.com/ethereum/pm/issues/866",
        "created_at": "2023-09-26T18:49:52.961000+00:00",
        "attachments": []
    },
    {
        "author": "jason.carver",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Josh asked me about whether Portal could help serve preimages. (I found this writeup, so my understanding is based on that: https://hackmd.io/@jsign/vkt-preimage-generation-and-distribution )\nIt seems plausible that Portal might help here in distribution (but not obviously of help in generation). I think most of the risk is timeline risk: when could we implement it and make it available to execution clients, vs when Verkle would go live. The simplest solution might be the best: a by-hash lookup for every hashed address, where the returned value is the preimage. Of course that means that the data would have to be requested on-demand, you need to know the hashed addresses to get the pre-images (rather than just getting a complete lookup table locally). But that's kind of the point of Portal. If that on-demand strategy isn't a good fit, then Portal probably isn't either. 🙂 Also, I don't love that there's no obvious way to limit the preimages to actual keys on the network. That means anyone could dump fake data in (as long as it's a hash of *something* and that hash and preimage are supplied), and maybe squeeze out the real data. It could be possible to counteract that, but only after getting our State network launched, which could be a while...",
        "created_at": "2023-09-26T23:27:07.967000+00:00",
        "attachments": []
    },
    {
        "author": "jason.carver",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Anyway, I'll try to make it to the next call, and see if it makes sense to try to work together on that",
        "created_at": "2023-09-26T23:27:26.367000+00:00",
        "attachments": []
    }
]