[
    {
        "author": "namngrg",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@774033563732541451\u003e  can you please direct me to any tests and docs related to bulk conversion method",
        "created_at": "2023-10-06T12:50:11.951000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm not sure there're docs and tests related to that conversion method. The TL;DR of that migration style is basically walking the state tree and re-inserting all key-values in a fresh VKT.\nSo, \"long\" time ago when this migration method was considered, Guillaume did a Geth tool that does that. It does use the snapshot feature of geth which is convenient reg how the walk order matches the snapshot ordering.\nhttps://github.com/gballet/go-ethereum/blob/verkle/convert-through-files-rewrite/cmd/geth/verkle.go#L56\nSo if you run it with: `geth verkle to-verkle` (without args means latest known root), _it should_ do the right thing. _I think_ this should still work, but be aware this is ~deprecated now.\n[btw, you'll need the preimages which can be painful]",
        "created_at": "2023-10-06T13:01:59.599000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@898791107566112818\u003e, the new Kaustinen testnet is close to be up again. After that is stable, Guillaume had the idea of trying to export the initial state plus some blocks and start building a kind of test-vector based on the testnet.\nThat's pretty useful to have some self-contained test data that you (and others) can use to test some stuff maybe.  I don't know if you want to wait for that (lots of things happening so don't know _when_ so it can take some time, but just mentioning depending on your urgency).",
        "created_at": "2023-10-06T13:05:51.274000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Or maybe you can even help doing that if you can join Kaustinen with a geth node. just thinking what can be a good strategy.",
        "created_at": "2023-10-06T13:06:41.827000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Like, join kaustinen, at some point dump all the VKT state in a format that is friendly for others to import, and maybe export some extra blocks so you can replay and see if state root match etc.\n(Or can be more granular if you only want to test parts of stuff: pedersen hashing for trie-key, or maybe some fact about your vkt data structure impl, etc without fully integrating into kaustinen)",
        "created_at": "2023-10-06T13:09:51.281000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "[BTW, yesterday I generated some test-vectors reg pedersen hashes and commitments for \u003c@973535409013411850\u003e  who is working on Besu.. if anyone is interested, lmk. Quite honestly, these things should be generated from a spec implementation and not geth, but at least to unblock him a bit and have some signal. at some point more formal test-vectors should be generated from a spec impl]",
        "created_at": "2023-10-06T13:15:19.497000+00:00",
        "attachments": null
    },
    {
        "author": "dragan2836472",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "if anyone is interested, here are the test cases from \u003c@774033563732541451\u003e (thanks for the support as always 🙂 ):\n\n\n-- Pedersen hashing: https://pastebin.com/0RrL3Ryc\nThe format is:\n- addr: bytes in hex\n- treeIndex: The big int number in decimal notation (base 10). It's a \"string\" because I can put such a big integer in a JSON.\n- treeKey: the result of the perdersen hash bytes\n\n-- Vec comm: https://pastebin.com/dJyzwXnB\nThe format is:\n- frs: a slice of 256  integers (the Frs)\n- commitment: The resulting big int. [Remember that Pedersen Commitment gives you a point, then you have to do MapToScalar which gives you a Fr. This Fr is here as a big integer]",
        "created_at": "2023-10-06T13:22:13.392000+00:00",
        "attachments": null
    }
]