[
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "my take in order:\n- not that i'm aware\n- maybe someone from a zk-rollup team might have a more detailed answer, but i think the biggest painpoint is keccak related to the state mutation which is included in the snark.\n- Yes, the main goal of VKT is statelessness; but any solution included in the L1 should be also aligned with everything else. in particular, if SNARKs will be the long term solution for scaling, then the statelessness solution can't get in the way. thus, that's why bandersnatch being a curve embedded in bls13-381 is very useful... since you don't have to emulate fields in circuits.  can have also other usual SNARK benefits, but mainly i think is not creating another problem to be solved in the future.\n- unless we find some blocking problem, seems to be the case.\n\nreg your last one:\n- yes. i guess zk-rollups will already have to deal with that risk, which is a liveness risk (i.e: relying on big machines out there), so we could learn from there. i guess you can also have censorship risk but i guess depends on other changes that probably will get included. so probably, as expected, zkrollups will keep pushing for better proving systems and hardware advancements... so ideally the network always have a safe fallback option that can be easily be activated if something goes wrong with powerful actors.",
        "created_at": "2023-07-25T16:15:19.414000+00:00",
        "attachments": null
    },
    {
        "author": "dragan2836472",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "very cool, thanks!",
        "created_at": "2023-07-25T18:27:28.723000+00:00",
        "attachments": null
    },
    {
        "author": "rudolf6",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Sharing our new Verkle overview site: http://verkle.info \n\nGoal is to have all the latest Verkle info in one place, for anyone looking to get involved, or just see the latest updates. You can find answers to everything from \"what is Verkle\" to latest updates on implementation work. Feel free to ping me with any questions/feedback. \n\nh/t \u003c@774033563732541451\u003e + \u003c@353136597522448385\u003e 🙏",
        "created_at": "2023-07-25T22:16:15.044000+00:00",
        "attachments": null
    }
]