[
    {
        "author": "zkhardware",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hi all. I'm interested in any benchmarks you may have on the cost of conversion and also prover performance after the verkle migration.",
        "created_at": "2023-08-19T00:42:08.671000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In the Overlay Tree migration strategy, the cost ~is: (Overhead of walking \"key-order\" X key-values in the MPT) + (cost of pulling the preimages of those X keys) + (cost of rehashing into VKT keys) + (Insert and update the X key-values in the VKT)\n\nYou can benchmark that independently for a rough idea, but we've been doing some \"e2e\" benchmarking while importing some historic chain into a geth impl candidate. The tentative conclusion is that X=5k seems to be a reasonable config for a Rock5B, which is currently some assumption of the lowest setup to support. \n\nAll these are tentative conclusions since:\n- The Overlay Tree migration strategy has yet to be confirmed to be final since other options are still being evaluated.\n- The cost of each term described before has a different impact on every client (e.g: cryptography libs perf, database design can impact MPT walking or preimages pulling (for good or bad), etc.)\n- We still need to account for 4844 overhead, which _might_ leave a smaller \"performance slack\" in clients than today. (e.g: for block proposers)\n\nReg \"proving benchmarks\", you might be interested in looking:\n- Go lib bench: https://github.com/jsign/vkt-proof-bench\n- Rust lib bench: https://github.com/crate-crypto/ipa_multipoint/pull/11\nBoth are only benchmarking the \"cryptography layer\". Generating the block proofs also involves collecting all the commitments from the tree (which requires extra disk lookups in clients), and serialization costs. We plan to enable proving in our \"e2e\" benchmark (soon) for a more realistic idea of the \"total cost\".",
        "created_at": "2023-08-19T12:56:48.278000+00:00",
        "attachments": []
    }
]