[
    {
        "author": "rudolf6",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Reminder: Verkle Implementers Call in 10 mins\n\nlink: https://meet.google.com/odf-tghm-ttu",
        "created_at": "2024-07-01T14:50:59.072000+00:00",
        "attachments": null
    },
    {
        "author": "rudolf6",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@456226577798135808\u003e sorry for slow reply.. faucet should be working. Were you having a specific issue when trying to use it? https://faucet.verkle-gen-devnet-6.ethpandaops.io/",
        "created_at": "2024-07-01T14:56:21.292000+00:00",
        "attachments": null
    },
    {
        "author": "adityagupta1010",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@122421399213047814\u003e dm'ed you something",
        "created_at": "2024-07-01T16:03:41.974000+00:00",
        "attachments": null
    },
    {
        "author": "adityagupta1010",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "was it recorded?, if yes then can you upload it please",
        "created_at": "2024-07-01T16:04:41.260000+00:00",
        "attachments": null
    },
    {
        "author": "spencer_tb",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Our first release of the verkle test fixtures: https://github.com/ethereum/execution-spec-tests/releases/tag/eip6800%40v0.0.1\nThese will be our most basic transition tests. Filled with 0 stride set and using a small pre init mpt (based entirely on the start state of existing tests). Ideally all EL clients should pass these before we add more complex transition tests, i.e with stride enabled.\n\n\u003e 0 stride here means that we are keeping the MPT frozen. So the MPT is not being converted to the VKT within these tests.\n\u003e This is to keep the tests as simple as possible so we don't overcomplicate things before adding stride (when the MPT starts being converted on each block to VKT).\n\u003e So currently in these tests only blocks that are officially in the Verkle will update the VKT. Note an empty Verkle block will also write to the VKT (and change the state) due to the 2935 system contract.\n\nIf there are any issues running the test fixtures please send a message! 😄 \nWe plan to release genesis tests (starting at Prague/Verkle, no transition) next including tests for verkle specific EIPs.",
        "created_at": "2024-07-01T16:10:51.370000+00:00",
        "attachments": null
    },
    {
        "author": "spencer_tb",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "On a separate note, we were wondering if a method should exist to go from VKT stem -\u003e MPT account info in a post verkle world. Specifically in relation to debugging future devnets \u0026 mainnet issues. Or whether full VKT seems suitable for most? cc-ing \u003c@892053833121923094\u003e",
        "created_at": "2024-07-01T16:17:32.326000+00:00",
        "attachments": null
    }
]