[
    {
        "author": "mpn9737",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Just throwing this question out there (not sure if it has been already discussed):\n\nIs it really a good idea to transition to EC-based Verkle Tries right now given that Quantum Computing is progressing and may be used to attack the state in the future? Shouldn't we primarily look for purely hash-based alternatives? (or at least quantum-safe)",
        "created_at": "2024-04-02T10:05:39.213000+00:00",
        "attachments": []
    },
    {
        "author": ".naddison",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Noob question, does the verkle implementation change the merkleization of the consensus layer? Or is it isolated to the execution layer?\nI ask as I'm looking at constructing proofs of validator balances from the consensus layer to the execution layer using the Beacon block root hashes that are now available in the EVM from EIP-4788. There's no point in doing this work now if its going to change with the verkle implementation.\nThanks",
        "created_at": "2024-04-02T11:29:50.537000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003casqyzeron\u003e \u003e \u003casqyzeron\u003e  the consensus layer will keep using the merkelization for the forseeable future, only the execution layer will use verkle proofs (re @verkle_bot: \u003c.naddison\u003e Noob question, does the verkle implementation change the merkleization of the consensus layer? Or is it isolated to the execution layer?\nI ask as I'm looking at constructing proofs of validator balances from the consensus layer to the execution layer using the Beacon block root hashes that are now available in the EVM from EIP-4788. There's no point in doing this work now if its going to change with the verkle implementation.\nThanks)",
        "created_at": "2024-04-02T11:36:35.797000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003casqyzeron\u003e \u003e \u003casqyzeron\u003e  yes, it's really a good idea: quantum computing is still years down the road - if it ever becomes practical at all - and hash-based trees create proofs that are too large to realistically be propagated along with the block in a timely manner (re @verkle_bot: \u003cmpn9737\u003e Just throwing this question out there (not sure if it has been already discussed):\n\nIs it really a good idea to transition to EC-based Verkle Tries right now given that Quantum Computing is progressing and may be used to attack the state in the future? Shouldn't we primarily look for purely hash-based alternatives? (or at least quantum-safe))",
        "created_at": "2024-04-02T11:38:45.198000+00:00",
        "attachments": []
    },
    {
        "author": "milos88",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Did anybody do analysis on what impact would Verkle tree have on the storage if it would be applied on the current state?\nFor example, average number of updated trie nodes (either just leaves or total or both)?",
        "created_at": "2024-04-02T14:55:22.966000+00:00",
        "attachments": []
    },
    {
        "author": "milos88",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I assume the exact storage would depend on the implementation, so that's why I'm looking at more common metric, i.e. number of updated nodes",
        "created_at": "2024-04-02T14:56:38.875000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@261161007982968833\u003e, we were in the path of doing that with some shadow fork attempts but some big rebase got in our way (and other vkt tasks of course). we also have a verkle style chain importing for geth but we have run it with some oldish (smaller) data -- we're planning to run it with newer state to gather those interesting metrics, and probably have better estimations on others (e.g: witness size, etc).",
        "created_at": "2024-04-02T15:00:10.531000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "also getting a sense on how 4844 extra overhead plays with vkts and have a better intuition how low hardware setups would perform (now there's real mainnet load history).",
        "created_at": "2024-04-02T15:01:34.390000+00:00",
        "attachments": []
    },
    {
        "author": "milos88",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "thank you for the quick response. do you have some estimate on when those interesting metrics would be available?",
        "created_at": "2024-04-02T15:06:16.348000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "no estimate, but hopefully we can work that in the next months.",
        "created_at": "2024-04-02T15:08:47.592000+00:00",
        "attachments": []
    },
    {
        "author": "rsscno1",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I am willing to do such an analysis as it marks an essential step in my current research project on Eth storage data structure optimization. The major deficiency is that, as \u003c@774033563732541451\u003e mentioned, there is yet an official implementation of vkt applied in Eth next upgrade. Even when it's limited to the theoretical protocol, there is neither evidence that the final vkt is like single-layer or multiple layers, nor the details of how a subtree's polynomial commitment is maintained or upgraded.",
        "created_at": "2024-04-02T20:09:51.071000+00:00",
        "attachments": []
    },
    {
        "author": "rsscno1",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I would like to ask for an official document of the protocol actually used to build the mkt for the next upgrade.",
        "created_at": "2024-04-02T20:11:02.418000+00:00",
        "attachments": []
    }
]