[
    {
        "author": "rudolf6",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We are still working on updated numbers here. \u003c@774033563732541451\u003e is working on a \"Kaustinen analyzer\" which should be able to answer this 🙏",
        "created_at": "2024-01-15T13:17:17.596000+00:00",
        "attachments": []
    },
    {
        "author": "rudolf6",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "**Reminder: Verkle Implementers Call in ~40 minutes. **\n\nAgenda: \nhttps://github.com/ethereum/pm/issues/930\n\nLink: \nhttps://meet.google.com/odf-tghm-ttu",
        "created_at": "2024-01-15T13:22:01.016000+00:00",
        "attachments": []
    },
    {
        "author": "rudolf6",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Also just to clarify: we don't expect \"block size\" changing meaningfully compared to Merkle, ignoring the potential inclusion of the \"execution witness\" in the block. \n\nAnd for the \"execution witness\", it's possible/likely it will be propagated via a separate subnet (rather than in the block itself)",
        "created_at": "2024-01-15T14:23:09.703000+00:00",
        "attachments": []
    },
    {
        "author": "mempirate",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ah yes I was referring to the size of the witness! And wrt propagating it through a different subnet, what are the benefits here besides networking? Isn't the block+witness a single logical unit?",
        "created_at": "2024-01-15T14:28:43.323000+00:00",
        "attachments": []
    },
    {
        "author": "rudolf6",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Benefits are mostly around flexibility/upgradeability of the proof/witness in the future (e.g. changing the format without a hard fork, easier pruning of proofs/witnesses past a certain finalization point, not forcing all validators to have to \"understand\" proofs, etc).. the block+witness doesnt necessarily need to be a single logical unit. \n\n\n\u003c@774033563732541451\u003e or \u003c@353136597522448385\u003e may have more context to add if im forgetting anything",
        "created_at": "2024-01-15T16:01:03.071000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003casqyzeron\u003e yeah that's it",
        "created_at": "2024-01-15T16:10:43.838000+00:00",
        "attachments": []
    },
    {
        "author": "rudolf6",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Recording from today's call: \nhttps://youtu.be/r7CA6L6yOWI (should be done processing in a few mins)",
        "created_at": "2024-01-15T22:49:01.727000+00:00",
        "attachments": []
    },
    {
        "author": "gakonst",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "BTW just read Oliver's notes, I wonder how yu guys think about Verkle priorities? From our POV it's felt like figuring out a rock solid migration path seems the top prio, or is that off?",
        "created_at": "2024-01-15T23:01:04.967000+00:00",
        "attachments": []
    },
    {
        "author": "rudolf6",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah, I think most agree it's still a top priority in terms of how critical and hairy it is. \n\nIt hasn't received as much attention on the most recent calls, as there had previously (further back) been a good bit of discussion and solid progress made on that front (by Guillaume/Ignacio and several others). Though ofc still more work to do. The next big milestone is the shadowfork and some add'l testing. \n\nWill let \u003c@353136597522448385\u003e / \u003c@774033563732541451\u003e share any thoughts, but probably will soon get resurfaced on an upcoming call for us to dive into the latest, gain more confidence that we are still on the right track \u0026 everyone is on the same page when it comes to the transition strategy 🙏",
        "created_at": "2024-01-15T23:14:00.988000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@486477492434239488\u003e , yeah, we've dedicated several calls before to the migration to describe the current plan \"detailed enough\" to have a POC (which we've in for geth) and looks performant enough for the data set we've used (whihc is a reduced dataset compared to mainnet).\nSo the current plan on that front is that Guillaume is working on a shadow fork so we can test the current implementation with a bigger database to do a more data-driven decision making on the current plan (if it's good enough, new bottlenecks, etc).\nAlso, it would be useful when more clients do the impl and see the performance on their side since there might be more custom bottlenecks (or not) depending on the client architecture.\n\nAt some point when the plan looks solid, we should definitely put the state migration mechanics as part of the spec... but for that we'd like to get first more data (from clients, from the shadow fork, etc) to solidify more the plan.",
        "created_at": "2024-01-15T23:40:31.151000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In the meantime we're touching in VIC calls other parts of the spec that need some definition (e.g: today we touched mostly on the BLOCKHASH situation for VKT, which is still an undecided and is also important to have a plan on that to not leave holes in the spec). So we're kind of trying to progress in as many directions as possible.",
        "created_at": "2024-01-15T23:41:51.452000+00:00",
        "attachments": []
    }
]