[
    {
        "author": "prajwolrg",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks \u003c@774033563732541451\u003e  for your amazing article on the Anatomy of a Verkle Proof.\nI learned a lot of new things.\n\nOne thing that I'd like to learn more is on how do we get new state_root from the partial view of the tree?\n\nMy understanding is that the commitment is \u003cf, G\u003e where f is the coefficients of polynomial obtained by interpolating values v=(v_0, v_1, ... v_255).\nIf we were to update any value v_i, we would have to recompute all the coefficients. \n\nBut to recompute all the coefficients, we would need the entire f right? or the entire v..",
        "created_at": "2024-05-07T10:44:15.965000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Glad you found the article useful. :)\nReg your question, the vector commitment that we use is additively homomorphic. That means that if you have `C = ... + v_i * G_i + ...`, if you change `v_i` to `v'_i` then you can get the new `C'` by doing `C'=C+(v'_i-v_i)*G_i`, thus not requiring all the rest of entries.",
        "created_at": "2024-05-07T11:38:06.308000+00:00",
        "attachments": []
    },
    {
        "author": "prajwolrg",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So the commitment is not of the coefficients of the polynomial, but the values itself? i.e. vector **a** is the vector of the values.\nIn that case what would vector **b** be?",
        "created_at": "2024-05-07T12:14:12.948000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The commitment is a commitment to a vector of field elements, which I guess is what you're calling `a`. Now, that vector of field elements can be interpreted as a polynomial in evaluation form in a paritcular domain. Thus, to evaluate that polynomial (without switching to coefficient form) you can use the barycentric formula to come up with another vector `b` of field elements, such that multiplying `a` and `b` gives you the evaluation at another point. \nBut note that all this world lives in one layer \"below\" in the cryptography layer... for your original question most of this is not relevant. Your commitments are simply MSMs, and due to the additively homomorphic nature you can see how you can update the commtiment only with a partial view of the vector entries.",
        "created_at": "2024-05-07T12:23:00.375000+00:00",
        "attachments": []
    },
    {
        "author": "prajwolrg",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yup makes sense. Barycentric formula seems to be the missing piece in my understanding.",
        "created_at": "2024-05-07T12:32:03.103000+00:00",
        "attachments": []
    }
]