[
    {
        "author": "somnergy",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Depending on the hardware, 7-10 days of syncing. This will be greatly improve later this year, with Erigon 3. I will send you over the files on DM, soon-ish (sorry bogged down by Pectra)",
        "created_at": "2024-10-04T09:22:03.346000+00:00",
        "attachments": null
    },
    {
        "author": "matkt0",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "thanks will be happy also to have the guide like thatt I will be able to it on my side",
        "created_at": "2024-10-04T14:06:19.073000+00:00",
        "attachments": null
    },
    {
        "author": "rudolf6",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "🪧 hey all, heads up that there's no Stateless Implementers Call this upcoming Monday (Oct 7th) . Few folks are unavailable, so will try to keep things async this week. If anyone has anything to share, or topics for discussion, plz drop them here 🙏",
        "created_at": "2024-10-04T20:11:28.899000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Sharing some async updates here:\n- A new version of `execution-spec-tests` for Verkle tests has been tagged: https://github.com/ethereum/execution-spec-tests/releases/tag/verkle%40v0.0.4 These were filled with a geth version that will be used for devnet7. (h/t to \u003c@755913785620824175\u003e  helping on the testing library front)\n- While doing ^, we discovered (and fixed) some bugs in Geth and Nethermind (h/t \u003c@822845173016166410\u003e  for double checking filled tests before the tag, which is how we found bugs in both clients).\n- AFAIK, at least two other EL clients are working on running those tests as a reparation for devnet7-readiness.\n- I created EIP-7709 tests, some extra system contract tests, and I’m close to finish ~30 tests vectors reg insufficient gas border cases that are much more interesting... all which will be part of a v0.0.5 release (maybe in next week).\n- There were fixes in CL clients during preparations for devnet7 launch.",
        "created_at": "2024-10-04T20:13:35.394000+00:00",
        "attachments": null
    }
]