[
    {
        "author": "alexf5200",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hello everyone 👋\nMe and \u003c@703292811969036399\u003e are trying to run some benchmarks on the cost of ERC-4337 after Verkle. I was looking for a way to apply post-verkle gas costs in `go-ethereum` but so far I wasn't able to use it.\nIs there currently a way to do it? If so, could anyone please help us with some instructions on how to bring up such a node locally?\n\nI didn't see any documentation on the topic, but what I have tried is setting `VerkleTime` and/or `OverrideVerkle` parameters in config/genesis file. I tried the `master` branch and a few others, but got crashes every time.\n\nThank you!",
        "created_at": "2024-04-06T09:36:43.876000+00:00",
        "attachments": null
    },
    {
        "author": "rudolf6",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In addition to what Vitalik helpfully explained here, for those curious on the quantum topic I'd also recommend checking out:  \n\n1) Ignacio's explainer on the tradeoffs of using EC-based Verkle (wrt quantum), and other areas elliptic curves currently used (1:09:21): https://www.youtube.com/live/H_M9bjwtMhU?si=L5c0YsIu0LeN7cSg\u0026t=4161\n\n2) Vitalik's recent ethresearch post on how to hard-fork in a quantum emergency: https://ethresear.ch/t/how-to-hard-fork-to-save-most-users-funds-in-a-quantum-emergency/18901 \n\n(my own 2c is there are solid reasons to debate verkle vs potential other solutions, and quantum-readiness is a variable but shouldn't be a driving factor at this current point in time)",
        "created_at": "2024-04-06T11:07:52.653000+00:00",
        "attachments": null
    },
    {
        "author": "rudolf6",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "cc \u003c@353136597522448385\u003e who may be able to provide guidance (sidenote: \u003c@703301497194152108\u003e may also be helpful to attend the next Verkle Implementers Call if you are able 🙏  April 8 @ 14:00 UTC and agenda here: https://github.com/ethereum/pm/issues/1005)",
        "created_at": "2024-04-06T11:09:45.571000+00:00",
        "attachments": null
    }
]