[
    {
        "author": "__lithp__",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "They're very similar! And now that I've read though Oil again I think you're right, this is Oil with a few changes. I think there are two contributions here:\n- Realizing that a problem we had with Oil isn't a real problems: We thought that increasing prices would break contracts but it will only break transactions which set too low of a gas limit. Contract devs might want to do some rewrites so that they require smaller witnesses but any transaction which does not require \u003e10M gas worth of witness data will continue to work without any rewrites, though it may be more expensive than users would prefer.\n- Since we're not breaking smart contracts we can drop some of the complication in Oil which was meant to mitigate that problem. Oil proposed separate gas / oil schedules where we would keep gas prices fixed and going forward only ever decrease oil prices, this adds a lot of complexity both for smart contract developers and ourselves as we try to make changes to eth. This proposal introduces a separate schedule but doesn't add constraints on how it can be changed and sets prices which directly correspond to how large of a witness each operation requires. This is much easier to explain and maintain.\n  - Another way in which this version is simpler: this version of Oil doesn't need to worry about changing how refunds work, I'm pretty sure.",
        "created_at": "2020-12-22T01:21:36.402000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Why do you consider it a massive burden to attach witness data?",
        "created_at": "2020-12-22T01:40:45.740000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Oh, because witness data invalidates with each block as the merkle root changes?",
        "created_at": "2020-12-22T01:41:21.584000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Would it be reasonable for clients to retain the last 256 blocks of \"state\", so as long as your transaction is mined within 256 blocks your witness proof will be valid?",
        "created_at": "2020-12-22T01:44:08.122000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Would also allow transactions to include smaller witness data if the state they are touching was touched very recently.",
        "created_at": "2020-12-22T01:44:46.139000+00:00",
        "attachments": []
    },
    {
        "author": "__lithp__",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "- If you're a stateless client you presumably don't want most of the state: to attach it to your txns you'll need to first fetch it somehow and random access into the state data will be slow no matter which protocol we use: you do a round trip and then continue executing until you hit the next piece of state to be fetched, then you round trip and repeat.\n  - This is made easier in a ReGenesis world which does what you're talking about, some state is kept around so we can patch up witnesses and require less witness data, but you'll still need a mechanism for fetching stale data.\n- If you'll pay for witness data then some kind of commitment to the witness needs to be part of the signed transaction data, I'm not sure what that requires, it likely means someone will need to update the firmware for every hardware wallet? Every part of the ecosystem which generates transactions needs to be upgraded and anyone who doesn't upgrade will no longer be able to send transactions\n- It's impossible (in the general case) to predict exactly what witness data will be required. Clients / smart contracts could build out some mechanism for predicting which state might be touched and intentionally including too large of a witness just in case some state changes before the transaction is mined. ReGenesis also alleviates this. But at the end of the day some number of transactions will fail and require the user to eat the gas cost and resubmit. Submitting a transaction now becomes a multi-step flow where you submit and monitor the blockchain and resubmit until the transaction finally makes it in.",
        "created_at": "2020-12-22T01:55:31.653000+00:00",
        "attachments": []
    },
    {
        "author": "__lithp__",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think we'll always be able to patch up witnesses against older state roots. Under ReGenesis the state root you'd be proving against changes very infrequently. In some non-ReGenesis world I don't think it's unreasonable to think miners will patch up witnesses whenever a new block is mined, as long as we give them a mechanism for doing that, though you're right there's some complication there.",
        "created_at": "2020-12-22T01:57:34.587000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hardware wallets generally just know how to secp256k1.  It is the app layer that interprets that (so hardware wallet app update, not firmware update).",
        "created_at": "2020-12-22T02:05:07.692000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Would state touches *reduce* witness size, not increase, if there is a concensus requirement to retain last 256 blocks of state changes?",
        "created_at": "2020-12-22T02:07:15.854000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think the piece I missed at the beginning of this conversation is that you are talking about miner provided witnesses, while I am talking about signer provided witnesses.",
        "created_at": "2020-12-22T02:09:19.378000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Miner provided witnesses have some very nice properties, but I don't think the incentives are as aligned as well as they are with signer provided witness.",
        "created_at": "2020-12-22T02:11:30.933000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Usability is a bit more awkward with signer provided, but it pushes storage costs out to the people who care about the data rather than requiring data storage costs be socialized at the miner level.",
        "created_at": "2020-12-22T02:12:19.473000+00:00",
        "attachments": []
    },
    {
        "author": "__lithp__",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Ah, that would be nice. I'll look into it more. I have a KeepKey which shows the transaction amount on the screen for confirmation before it signs anything. Hard to imagine it would sign a transaction it couldn't parse, but maybe other hardware wallets are more forgiving",
        "created_at": "2020-12-22T02:14:10.522000+00:00",
        "attachments": []
    },
    {
        "author": "__lithp__",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Huh, why do you think the incentives are wrong?",
        "created_at": "2020-12-22T02:14:49.470000+00:00",
        "attachments": []
    },
    {
        "author": "__lithp__",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Currently we pay miners to process transactions, which requires holding onto the state. With miner attached witnesses nothing changes in that respect, we keep the existing incentive structure which is working pretty well",
        "created_at": "2020-12-22T02:15:23.179000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Ledger has both applications and firmware.  Firmware is more secure and holds keys and signs secp256k1.  Apps are slightly less secure (easier to update) and do presentation.",
        "created_at": "2020-12-22T02:15:50.765000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yeah, and incentives are currently wrong.  :)",
        "created_at": "2020-12-22T02:16:08.291000+00:00",
        "attachments": []
    },
    {
        "author": "__lithp__",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I agree signed provided witnesses are prettier and I would love a world where they were possible, but I think it's enough of a burden that it's a net-negative. In particular that last point about how it's impossible in the general case to build a correct witness is pretty serious.",
        "created_at": "2020-12-22T02:16:18.509000+00:00",
        "attachments": []
    },
    {
        "author": "__lithp__",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm pretty surprised to hear that ledger blindly signs whichever bytes are passed to it, I'll look more into that",
        "created_at": "2020-12-22T02:17:08.763000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I don't think it is impossible if we require 256 blocks of state changes as part of concensus.",
        "created_at": "2020-12-22T02:17:15.053000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It doesn't, you need an app.  It is just that apps are easier to update than firmware.",
        "created_at": "2020-12-22T02:17:38.098000+00:00",
        "attachments": []
    },
    {
        "author": "__lithp__",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "That ruins the point of a hardware wallet! The app runs on your computer, if you trusted your computer you wouldn't be using a hardware wallet",
        "created_at": "2020-12-22T02:18:04.623000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Like a phone OS upgrade vs app update.  One is a much bigger issue.",
        "created_at": "2020-12-22T02:18:10.997000+00:00",
        "attachments": []
    },
    {
        "author": "__lithp__",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Requiring miners to hold onto older state helps with the problem you mentioned: witnesses prove state against older state roots. There's a bigger problem though: if the state changes between when you signed the transaction and when the transaction is mined you might need a different witness than was proven. Say you have an order book and you submit a transaction which matched against some order: your witness includes that order. If, when the transaction is mined, it now matches against a different order, your witness doesn't prove that other order, so your transaction fails.",
        "created_at": "2020-12-22T02:20:07.473000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Ah, I see what you are saying now.  🤔",
        "created_at": "2020-12-22T02:22:59.300000+00:00",
        "attachments": []
    },
    {
        "author": "__lithp__",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It's a surprisingly hard problem 😦",
        "created_at": "2020-12-22T02:33:31.747000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@296630428754771968\u003e have you published your write up on pre-committed transaction buffers (decoupling transaction ordering with proof of work sealing) ?",
        "created_at": "2020-12-22T04:21:58.766000+00:00",
        "attachments": []
    },
    {
        "author": "__lithp__",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I have not, but I should before everybody goes on vacation. I'm still trying to iron out some details, I had a call with Jason where he found a problem and introduced a new way of thinking about things",
        "created_at": "2020-12-22T04:23:00.573000+00:00",
        "attachments": []
    }
]