[
    {
        "author": "__lithp__",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I've been trying to figure out how we should charge for witnesses and think I have something reasonable, wonder if anyone has feedback:",
        "created_at": "2020-12-18T23:38:34.469000+00:00",
        "attachments": []
    },
    {
        "author": "__lithp__",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "**Some background**: In a world where transaction senders attach their own witnesses things are easy. We require transaction senders to include the witness in the signed data. Before we start executing the transaction we know how big the witness is and we can start processing the transaction with a `gasUsed` high enough to pay for the witness. We then continue as normal: if the transaction runs out of gas it reverts. If the `gasLimit` for a transaction is too small to pay for the witness it can't even be mined and network participants drop the transaction instead of gossiping it.\n\nIf you ignore how often these transactions would be invalidated this almost works, but asking transaction senders to attach witnesses is a massive burden, even in a ReGenesis world where transactions are less likely to be invalidated. We would prefer if transactions could remain the way they are, and witnesses were attached later (probably by miners)\n\nIn a world where transactions do not come with signed witnesses we cannot start the transaction with a higher `gasUsed` because we do not yet know what the correct witness size is (if you are a stateless client and you were given a witness, you do not yet know you were given a correct witness). What we want is something which has the same behavior as the transaction-attached-witness world but where we do not need to invent the ability to see into the future.",
        "created_at": "2020-12-18T23:38:59.804000+00:00",
        "attachments": []
    },
    {
        "author": "__lithp__",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "**I propose**: Currently we track `gasUsed` during transaction execution, I propose we also track `gasUsedWitness`, which increments whenever an operation is performed which requires adding data to (or reading data from) the witness.  If the sum of `gasUsed` and `gasUsedWitness` ever exceeds `gasLimit` the transaction reverts. Miners only need to provide enough witness to prove that the transaction runs out of gas.\n\nThis seems like it has a problem: if you make some kind of CALL with a limited gas stipend it's possible for the callee to inflate the witness and revert your entire transaction instead of failing the call. However, this problem also exists in the original model of transaction-attachd-witnesses! And it's not much of a problem, Transaction senders who have access to enough state to attach their own witnesses also have enough state to notice that the transaction would revert due to an internal CALL and bump the `gasLimit` before sending the transaction or choose not to send it.",
        "created_at": "2020-12-18T23:39:29.017000+00:00",
        "attachments": []
    }
]