[
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@456226577798135808\u003e Is there some research on \"state caching\" to address the state problem? As an alternative to state rent and stateless approaches.\n\nI.e. storage slots touched in the last N blocks are cheaper to write/read than those outside, such that clients know there is something like 2-4GB that should be kept in memory and the rest can be in storage and will be priced accordingly. \n\nE.g. (random values) if storage slot is considered in \"state RAM\", then SLOAD is 100 and SSTORE is  1000 - 5000 but those outside of this have SLOAD: 2000 and SSTORE 30k - 50k",
        "created_at": "2020-06-12T18:20:10.965000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!278762485497069569\u003e I think there is something like this implemented in RSK. But my thinking lately that doing something like this now would be premature. We still have not sufficiently explored the tradeoffs to find an optimal pricing model for the mid-term. By trade-offs I mean RAM, storage technology, network bandwidth and latency. These tradeoffs shift significantly when we make changes in the client's architecture. Therefore I would like that \"dust\" to settle before we introduce re-pricing, otherwise we might make things worse than they are now",
        "created_at": "2020-06-12T18:33:10.767000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "My thinking on the State Rent has also evolved in the meantime",
        "created_at": "2020-06-12T18:43:25.326000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think a realistic way of implementing it is to create a new architecture for state space usage and then nudge smart contract into using them instead of the existing way, then deprecate the old way. And I now also believe that we would have time to do it if we wanted to",
        "created_at": "2020-06-12T18:46:22.418000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "because my experience with turbo-geth makes me convinced that we can give Eth1.0 quite a lot of extra runway by utilising hardware more efficiently, but perhaps giving up some esoteric functionality",
        "created_at": "2020-06-12T18:47:33.304000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "if anyone is interested, I can describe what this new architecture of the state space would look like, I've been saving it for my eth3 tweets 🙂",
        "created_at": "2020-06-12T18:48:12.223000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I like the idea of nudging smart contract developpers to use the new state space architecture, seems like the only reasonable way forward (I don't think deprecating old way would work however). That being said, if the goal is to keep the state trie small (because it needs to be access often), it seems to me like charging a lot more contracts that are rarely used could lead to similar outcome, where clients can optimize to only keep a small amount of state in memory and get paid approprietly for when a rarely accessed state must be accessed.",
        "created_at": "2020-06-12T19:37:05.216000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It seems like in practice it achieves the same goal of keeping the \"accessible\" state small, like how stateless clients only need witnesses and no state at all in memory.",
        "created_at": "2020-06-12T19:37:50.674000+00:00",
        "attachments": []
    }
]