[
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "What are people's thoughts on retiring the 2300 min call gas limit outright and instead just issuing a standardized log when eth is transferred?",
        "created_at": "2020-03-28T16:00:55.448000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm inclined to look further into an ungas style approach to remove observability but to try and figure out a way to preserve meta transaction functionality. Removing the stipend feels like more of a bandaid than an actual fix. I'm in favor of it conceptually but it just feels like part of a larger problem that I wasn't to better investigate and understand",
        "created_at": "2020-03-28T16:54:09.048000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think removing the stipend is an actual fix (ie. goes in the direction of increasing cleanness)!",
        "created_at": "2020-03-28T17:11:51.882000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The reason is that it removes a magic number",
        "created_at": "2020-03-28T17:12:00.841000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "👍 maybe a better way of saying whatever I was trying to say is that I see the logic in doing that, just as part of a larger fix",
        "created_at": "2020-03-28T17:27:43.170000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yep, I agree it's not the only thing that should be done!",
        "created_at": "2020-03-28T18:20:04.293000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e So two other ideas I had. Both involve doing (2), charging *at time of execution*, but then solving the backwards compatibility issue in a different way.\n\u003e \n\u003e 1. Replace the 63/64 constant with 3/4. This way if you have a transaction that requires a computation and then some \"post-failure\" work in case the inner computation fails, you can still do it with the remaining 1/4.\n\u003e 2. Allow the transaction sender themselves to select the above constant, or possibly even allow the transaction sender to supply a gas budget per contract as part of the transaction\n\u003e \n\u003e The principle behind the second idea is that ultimately the party that would lose money if an internal call \"betrays\" them is the sender themselves, so the sender should choose which addresses to trust",
        "created_at": "2020-03-28T18:20:23.252000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I still support ^^",
        "created_at": "2020-03-28T18:20:26.480000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I've been trying to think about this like python context managers. For the meta transaction use case the two are very similar. To preserve meta transactions we would need the ability to guarantee the execution of the code in the exit block (but that unfortunately depends on the execution of the external call which is the equivalent of the code from the python context block). I don't have any breakthrough ideas but the mental model at least helps understand the behavior  we're trying to preserve.",
        "created_at": "2020-03-28T21:18:33.156000+00:00",
        "attachments": null
    }
]