[
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!555483069038198827\u003e and I are coming to the same conclusion. Basically, in the short term, it's much easier to just go stateless block verification but stateful block production, and we have quite a long time before that gets too centralized and over the next 5 years we can finalize a state minimization scheme",
        "created_at": "2021-02-15T21:49:51.667000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There's also the strange fact that Verkle trees, by far the most viable strategy to get short term stateless verification, are not friendly to stubs or partial state storage or other things needed to have stateless block producers or even rent, but in the long term we'll have to move to a STARKed binary tree for quantum-safety reasons, and those *are* friendly to all of those things",
        "created_at": "2021-02-15T21:51:17.140000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "So it feels like everything just lines up for that kind of roadmap",
        "created_at": "2021-02-15T21:51:28.321000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Is there a risk that block producers will actually only hold the most profitable part of the state?  Whether that's possible or not I'm sure depends on the particular scheme used and your comment on Verkle trees suggest maybe it won't be possible with what we're going with. I could see a strong incentive to store the current state for things like uniswap and SOCKS which have a large number of high paying transactions but not bother storing state that is rarely used.\nThough as long as that state is available from somewhere it may just naturally lead to having to offer higher gas prices/miner tip for transactions that access less used state which isn't necessarily bad.",
        "created_at": "2021-02-15T22:16:45.591000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "How do we deal with the fact that stateless clients don't have witnesses to validate txs, so the gossiping could be filled with invalid txs",
        "created_at": "2021-02-15T23:52:05.727000+00:00",
        "attachments": []
    }
]