[
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Why not let the miners build the witnesses as they build the block? Cost is non-deterministic for users, but that's already the case with gas and hence why we use a `gasLimit` instead of an exact gas amount.",
        "created_at": "2021-02-13T22:00:37.660000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Miners would need to stay stateful, but I really don't think that's important because miners/validators are already assumed to be well capitalized.",
        "created_at": "2021-02-13T22:02:07.040000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hmm I’m not sure that’s true. A lot of stakers are finding it very hard to run a full eth1 node because of the disk requirements. And if they have to stay fully Stateful state growth rates remain a massive problem limiting scalability.",
        "created_at": "2021-02-13T22:10:33.779000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I mean, stakers need to have ~$60k of capital locked at their disposition, possibly at lot more in the future. I don't think a $1-2k setup is much to ask / expect",
        "created_at": "2021-02-13T22:15:34.537000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Imo scaling nodes is a lot more important than scaling miners/stakers and seems like asking users to come-up with the witnesses is a recipe for ux disaster and end up with a lot more gas wasted on failed txs, which everyone will pay for.",
        "created_at": "2021-02-13T22:17:48.044000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "One of the aims is that stakers can run on fairly modest hardware so that staking is accessible.\n\nIt might be a reasonable stepping stone but stakers have to be across all shards so it’s exceptionally limiting for scalability if they have to hold all state. \n\nMight be solutions and different trade offs - I didn’t mean to reject the option but wanted to push back on the assumption that it wouldn’t be a burden for them. It would definitely have a major impact on the current set of stakers we have.",
        "created_at": "2021-02-13T22:24:57.754000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "No worries, I understand the concern. My main concern is user experience and predictability and I can guarantee that devs and users will be very vocal if witnesses need to be generated by the client. It would make interacting with protocols like Uniswap pretty much impossible since everyone interacts with the same storage slots.",
        "created_at": "2021-02-13T22:27:41.360000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This is imo a much bigger problem than requiring stakers and miners to have slightly better hardware than regular nodes.",
        "created_at": "2021-02-13T22:28:28.287000+00:00",
        "attachments": []
    },
    {
        "author": "keepersway",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "1 TB SSD is 60$... and can carry on staking for at least 1 year if you can afford to pay these gas fees you can afford this hardware..",
        "created_at": "2021-02-13T22:30:24.154000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If it was slightly better I think it would be fine. I suspect that it will wind up needing to be way better if not now in the relatively near future. And enough that it would remain a key bottleneck for scalability. \n\nI agree with the major challenges to having users generate the witnesses though.",
        "created_at": "2021-02-13T22:30:54.956000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If it only took $60 to solve I don’t think we’d worry about it for normal nodes either. 🙂",
        "created_at": "2021-02-13T22:31:23.887000+00:00",
        "attachments": []
    },
    {
        "author": "keepersway",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Just hardware is being given too much priority when clearly hardware is definitely not the main concern.",
        "created_at": "2021-02-13T22:32:30.908000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Doesn't requiring clients to generate the witnesses also pushes a burden for people to store all the state? Seems like this approach will require the need of an additional layer of state provider service for clients to consume, otherwise the clients need to store a bunch of state.",
        "created_at": "2021-02-13T22:34:25.328000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "And if such services are expected / needed for clients to generate witnesses, why couldn't miners/validators with lower tier hardware rely on these services instead if miners were to generate the witnesses?",
        "created_at": "2021-02-13T22:35:11.167000+00:00",
        "attachments": []
    }
]