[
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "They’d only need to store the state they actually use. \nStakers would have to store the entire world state because anyone could use any part of it.",
        "created_at": "2021-02-14T00:45:38.432000+00:00",
        "attachments": null
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Most users don't know which state they need or not, so either they have a node and store everything ahead or use a data provider service that gives them the data they need on the fly (e.g. a dapp).",
        "created_at": "2021-02-14T01:52:18.545000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm a fan of the latter model.  We can still have services like Infura for data availability, but we no longer need to explicitly trust them.",
        "created_at": "2021-02-14T02:07:47.579000+00:00",
        "attachments": null
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "And how do they guarantee the data they receive is correct?",
        "created_at": "2021-02-14T02:38:19.401000+00:00",
        "attachments": null
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Nevertheless, data service for clients is not relevant if having clients generating witnesses is not viable in practice.",
        "created_at": "2021-02-14T02:39:59.787000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "They cannot right now.  With stateless clients, they will be able to.",
        "created_at": "2021-02-14T02:43:41.166000+00:00",
        "attachments": null
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "How so?",
        "created_at": "2021-02-14T02:51:31.549000+00:00",
        "attachments": null
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "They would compare it to the state-trie root the provider is also giving them?",
        "created_at": "2021-02-14T02:52:03.521000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Wouldn't they be able to process blocks statelessly then compare the proof to the state trie root they already have?",
        "created_at": "2021-02-14T02:53:36.763000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "A stateless client can follow/validate the chain without storing any state.  This means they trustlessly know what the latest block is, and thus the latest state root.  This allows theme to send a request over to Infura (or similar) to execute a transaction and Infura can send them back state proofs necessary so the client can execute that transaction locally against head state without having to trust Infura.",
        "created_at": "2021-02-14T03:07:40.347000+00:00",
        "attachments": null
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yes agree, makes sense. A nice property!",
        "created_at": "2021-02-14T03:46:32.066000+00:00",
        "attachments": null
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It's useful regardless if miners or clients are generating the transaction witnesses, but my original complaint was around the fact that asking clients to provide witnesses is not feasible without breaking a massive number of dapps",
        "created_at": "2021-02-14T03:48:38.873000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "In the intermediate world that I envision, clients will get witness information from someone running a stateful node (like Infura).  \u003c@364458974906548225\u003e has a long term goal where they can fetch witness information from a global distributed state network, where each \"stateless\" client stores a little bit of the state (e.g., 100MB each or something).",
        "created_at": "2021-02-14T04:14:19.685000+00:00",
        "attachments": null
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e clients will get witness information from someone running a stateful node (like Infura).\nHow would that work for users using Uniswap though? You can have 10s / 100s of transactions interacting with that same storage slot in a single block",
        "created_at": "2021-02-14T04:16:23.279000+00:00",
        "attachments": null
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Means only 1 will be successful since all other witnesses will be invalid after the first tx mutates the state",
        "created_at": "2021-02-14T04:16:42.764000+00:00",
        "attachments": null
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Which clients can't predict unless contract forces people to use a third party that act as a tx sequencer and construct the witnesses for the clients",
        "created_at": "2021-02-14T04:17:00.143000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It is an open question exactly how user included witnesses for highly dynamic state will work.  I'm personally a fan of the idea that the proof just needs to be \"recent enough\", and miners will retain the last `n` blocks of state changes so they can \"upgrade\" the witness information.",
        "created_at": "2021-02-14T04:24:54.618000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The core of what you are getting at is certainly a big part of the problem with stateless and why it isn't trivial though.",
        "created_at": "2021-02-14T04:25:12.608000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "A stateless miner would have a cache of recent state proofs and changes essentially, and blocks would come with a block witness that doesn't necessarily match exactly the set of witnesses provided by transactions.",
        "created_at": "2021-02-14T04:26:26.622000+00:00",
        "attachments": null
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Isn't this problem trivially solved if miners are the one generating the witnesses though?",
        "created_at": "2021-02-14T04:27:07.726000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "In such a scenario, transaction witnesses are *not* part of consensus, they are part of gossip.  This means that you could (in theory) submit a transaction without a witness directly to a miner with a high gas fee and maybe they will accept it without witness.",
        "created_at": "2021-02-14T04:27:22.238000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yes, but that doesn't allow for stateless block producers, which is a desirable goal especially with sharding.",
        "created_at": "2021-02-14T04:27:44.752000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Stateless block producers allows block producers to bounce between shards easily.  Requiring fully stateful block producers means that a block producer needs full state for the shard they are producing blocks for, or they produce empty blocks (which is arguably worse).",
        "created_at": "2021-02-14T04:28:44.788000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think there was some other downside to block producer provided witnesses.... but it is slipping my mind at the moment.",
        "created_at": "2021-02-14T04:29:08.495000+00:00",
        "attachments": null
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "What are the main benefits of having stateless block producers? They would have to be pretty massive to justify the added implementation complexity and UX costs",
        "created_at": "2021-02-14T04:29:11.698000+00:00",
        "attachments": null
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Ok that's fair, but can't block producers just get their data from a data provider like clients would?",
        "created_at": "2021-02-14T04:30:05.921000+00:00",
        "attachments": null
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "And thanks for answering my questions before I ask them haha",
        "created_at": "2021-02-14T04:30:57.100000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The idea of having semi-centralized stateful nodes as data providers is considered by many/most to be an intermediate solution.  I don't think most people like it long term.",
        "created_at": "2021-02-14T04:31:27.432000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "That is, we want to design for the long term, and then build short term solutions that provide value that are on the path to that long term goal.",
        "created_at": "2021-02-14T04:32:01.892000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "For me, the compelling argument is that the people who *care* about state are the people submitting transactions, and by pushing the burden of generating witnesses to them we correctly incentivize the people who care about the problem to be the ones who have to solve the problem.  Miners don't *actually* care about state so much, other then as much as it is needed to do their job, and they are not in a good position to decide what pieces of state are valuable and what aren't.",
        "created_at": "2021-02-14T04:33:42.640000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm a big fan of incentive alignment, and I feel like stateful block producers isn't quite incentive aligned.  It isn't terrible, and we can probably make it work, but it isn't ideal.",
        "created_at": "2021-02-14T04:34:18.675000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Also, the further we push the witness problem toward the edges (users), the more likely we are to see independent third party innovation in state access mechanisms.  It is much easier to build a profitable business that target all of the Ethereum users than it is to build a business that targets miners.",
        "created_at": "2021-02-14T04:35:15.529000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "None of these arguments are nailing any coffins shut though, just a lot of little things that aggregate make transaction provided witnesses desirable.",
        "created_at": "2021-02-14T04:36:01.201000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Block producer provided witnesses is still definitely a hot topic of debate and comes up pretty much every time we discuss this.",
        "created_at": "2021-02-14T04:36:24.325000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It is just sooo much easier than transaction provided witnesses.",
        "created_at": "2021-02-14T04:36:50.613000+00:00",
        "attachments": null
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Sure, agreed with that. Along these lines i would go with the following:\n\n**V1 (easy to implement)**- Full stateless for clients and have miners  provide witnesses (they stay statefull).\n\n This allows us to increase gas limit where most nodes can stay synced (only miners have bigger burden, which they already have). It's also simple to implement, no need for any additional service provider.\n\nStateless block producers is important for sharding, but fortunately sharding is far away still, so plenty of time to move from V1 to a V2 where either block producers are stateless or block producers can securely get data from other shards and validate it.",
        "created_at": "2021-02-14T04:37:05.372000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Oh!  I remember the other reason (and it is a big one)!\n\nWithout transaction provided witnesses no one can propagate transactions because you cannot verify transaction validity without state.",
        "created_at": "2021-02-14T04:37:30.993000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "So block provided witnesses still require all gossiping nodes in the network to be fully stateful.",
        "created_at": "2021-02-14T04:38:03.275000+00:00",
        "attachments": null
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "To me, starting a v1 with client side witness means we are year(s) away from statelessness, but could be months away if miners are the one making witnesseses. Then iterate",
        "created_at": "2021-02-14T04:38:08.459000+00:00",
        "attachments": null
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Stateless clients and statefull miners is a net improvement to current status imo",
        "created_at": "2021-02-14T04:38:35.545000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e Stateless clients and statefull miners is a net improvement to current status imo\nNot if it leads to people having to submit their transactions directly to miners (rather than through gossip) as it leads to centralization of mining power.",
        "created_at": "2021-02-14T04:39:02.046000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Small miners will not be able to acquire transactions from end-users because they don't individually have enough hashing power to be worth directly sending your transaction to, and if everyone other than miners is stateless then no one can gossipy our transactions to those miners.",
        "created_at": "2021-02-14T04:39:42.974000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "(and miners won't gossip among themselves because that hurts their bottom line)",
        "created_at": "2021-02-14T04:39:55.832000+00:00",
        "attachments": null
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "People thought this would be the case for data availability and communication, but these took *years* to be somewhat ready and are still quite poor. I would expect it to be the same when we move to statelessness",
        "created_at": "2021-02-14T04:40:45.520000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "We would essentially end up with TaiChi (and similar) as the only way for a stateless client to get a transaction mined, which means the biggest pools will get the most transactions and lead to people centralizing hashing power toward the biggest pools as you can't get transactions otherwise.",
        "created_at": "2021-02-14T04:41:33.658000+00:00",
        "attachments": null
    },
    {
        "author": "phabc",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Ah, that's a good one. Opens up the room for ddos, i get it. Will think over that one",
        "created_at": "2021-02-14T04:42:49.061000+00:00",
        "attachments": null
    }
]