[
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!311971895828283393\u003e the prysm PR does not include instructions to run a validator?",
        "created_at": "2021-04-26T13:55:33.424000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "ahh strike that",
        "created_at": "2021-04-26T13:55:51.798000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I just saw the different sections",
        "created_at": "2021-04-26T13:55:57.930000+00:00",
        "attachments": []
    },
    {
        "author": "raulj",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yep, we havent had a chance to finish some remaining problems from client interop",
        "created_at": "2021-04-26T15:32:50.584000+00:00",
        "attachments": []
    },
    {
        "author": "raulj",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "We’ll be back on action on this by wed",
        "created_at": "2021-04-26T15:32:58.041000+00:00",
        "attachments": []
    },
    {
        "author": "kommstar",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Is there a project board or taskboard somehwere?",
        "created_at": "2021-04-26T17:15:35.441000+00:00",
        "attachments": []
    },
    {
        "author": "trent_vanepps",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "let me just say it's really awesome to be able to follow along with this project! you are all doing amazing work, and getting a devnet up is going to be a signficant milestone 💪",
        "created_at": "2021-04-26T17:43:59.254000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Office hour quick notes:\n- \u003c@!628018527470616606\u003e is working on more nethermind instructions, maybe a video\n- \u003c@!425567222635954178\u003e is implementing the sharding spec and making PRs with fixes. We'll list test vector ideas and start implementing them after initial Merge work\n- \u003c@!363800010518822915\u003e shared a quick Prysm update. The SSZ nest-list type for transactions isn't working with their current library. We'll make a minimal eth2-test-vector pre-release with ssz-tests for the Merge.\n- \u003c@!415548822983278593\u003e is working on a KZG pre-compile prototype to proof shard-data in the EVM, and is looking for inputs from rollup devs. We'll chat with Optimism, and maybe others are interested?\n- The 1-day interop Devnet was delayed to Thu setup, Fri launch.\n- We are putting together a script for multi-client local testnet setup.\n- \u003c@!203220829473996800\u003e will port that over to ansible to get the devnet running with",
        "created_at": "2021-04-26T17:48:45.320000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!404111065383829514\u003e we've a meta-spec for sharing updates and a rough planning: https://notes.ethereum.org/@protolambda/rayonism\nAnd spec here: https://github.com/ethereum/rayonism And site here: https://rayonism.io It's up to clients to make their own planning, and with the shared office hours we then try to coordinate the shared things like devnets and spec questions.",
        "created_at": "2021-04-26T18:07:19.850000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "wheel is not there on arch by default, but I managed to install everything without it, it just uses setuptools though",
        "created_at": "2021-04-26T18:41:24.143000+00:00",
        "attachments": []
    },
    {
        "author": "0xraino",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Just started onboarding to rayonism and have a noob question. Who cares about the effects of `setHead`? `assembleBlock` and `newBlock` already specify parents.",
        "created_at": "2021-04-26T21:05:27.230000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "sethead would help internal representations of state and block tree\n\nyou could theoretically keep the entire non-finalized block tree and associated state easily accessible but knowing the head is likely useful for a more optimal representation in the normal case of blocks being built on and added to the head\n\nfor example, geth constantly tries to keep a \"pending\" block around that extends the head with the current state of the tx pool. Set head would need to be used to make sure that any beacon chain re-orgs could be translated to the execution engine\n\nalso note that *unlike PoW* the eth2 pos fork choice is not only a funciton of the block tree. Thus you could have an entirely static block tree but get new info that had you reorg. So the newblock insert method is not entirely sufficient to knowing the head",
        "created_at": "2021-04-26T21:27:48.406000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "we discussed *not* having head to build on as part of `assembleBlock` and only being able to be built on head because there could be an implicit, temporary re-org due to the params of `assembleBlock`.\n\nI really like this sethead requirement in a 1:1 architecture between consensus and beacon, but you could imagine this being limited in more diverse architectures, like a multiple beacons relying on a single execution engine.\n\ntbh, I don't know if we need to optimize for such use cases. In such a case, you'd might not want `setHead` at all or at least restrict it to a single trusted beacon. or just have a super verbose and heavy execution engine that doesn't really have a notion of head and is ready to serve anything non-finalized\n\nessentially, if someone wants to do an execution engine as a service, they can do the work to make it happen... and I'm not sure we should make it super easy anyway 😅",
        "created_at": "2021-04-26T21:37:11.548000+00:00",
        "attachments": []
    },
    {
        "author": "0xraino",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Have any other execution node implementers found any issues with repurposing methods introduced to support `test_rewindToBlock` for `consensus_setHead`?",
        "created_at": "2021-04-26T21:58:11.993000+00:00",
        "attachments": []
    }
]