[
    {
        "author": "protolambda",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "**Wed 7 April, 20:00 UTC** we'll host the early-bird Rayonism ☀️ call!\n\nThe majority prefers this time of the day, but since it is inconvenient for some, do not expect this call time to repeat.\nInstead, we will host **office-hours**: regular, open, optional, calls. These will be every other day, at alternating times (TBD, some schedule that avoids timezone problems).\nI will try to be there at all times, to bridge the conversation.\nThis way everyone can ask questions, discuss the latest issues, and generally stay in the loop.\n\nIf you cannot make the initial call, please introduce yourself and your project here in the discord instead, \nand see if you can attend one of the office-hours later this week to catch up with the technical discussion.\n\nAgenda for Wednesday:\n- New meta-spec draft presentation: we are closer to stabilizing the hackathon specs.\n  The main thing to improve on until first devnet is the dependency on the `difficulty` block data.\n- Share-your-project: there are many different teams, let's sync what every early contributor is working on, or could help with.\n- Office hour scheduling\n- Questions / discussion\n\nI'll share a zoom link on Wednesday before the call. If you want a calendar invite, please DM me your email address.",
        "created_at": "2021-04-05T16:01:15.900000+00:00",
        "attachments": []
    },
    {
        "author": "bd_0",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hi guys, is everyone welcome for the call on Wednesday? I find this project really interesting and was thinking if there is any way to collaborate on this? Also have ideas about a dapp/project on a merge testnet, if that's acceptable. Haven't read everything yet from this channel, so please excuse me if I ask silly questions",
        "created_at": "2021-04-05T18:45:56.199000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Before we've any devnet running it will mostly be protocol oriented, no dapps yet, but if you like to contribute you're welcome.",
        "created_at": "2021-04-05T18:53:56.738000+00:00",
        "attachments": []
    },
    {
        "author": "bd_0",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "tnx 🙂",
        "created_at": "2021-04-05T21:20:30.222000+00:00",
        "attachments": []
    }
]