[
    {
        "author": "chrishobcroft",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Great work... keep it ephemeral... no baggage to slow things down... they're going to write books about what you guys are doing! You are all massive credits to the ecosystem!",
        "created_at": "2021-05-15T10:28:51.891000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There are more than one or two bugs in deposit processing and eth1 data voting. This period is all over the place. Here are the main combinations that are being seen\n```\nVoting summary for slot: 21259\nVoting period starts:20480  ends:22528\n(ae13f0c11...,83bca220c...) : 286\n(f936f4395...,d70a23473...) : 233\n(89f222f09...,d70a23473...) : 82\n(89f222f09...,0d07b654d...) : 4\n```\nAnd a bunch of 1 votes. The pair with only 4 votes is the right one! is the one voting for the eth2 block `18432` and eth1 block `14687`. Now this vote is only my own prysm node! those four votes are in blocks  21020, 20769, 20719, and 20552. The deposit count for that root is 310. So this is including my last round of 40 deposits that were included in https://nocturne.rayonism.io/block/17441. That block happened with timestamp `1621030092`, the beginning of the period is `1621066560`, so that's more than `2048*12` seconds difference and those deposits should have been counted. I believe therefore that I have the only node that is voting correctly in nocturne.",
        "created_at": "2021-05-15T11:46:13.267000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The second lowest number there is `82` votes. That's the right eth1 hash but the wrong deposit count, these are nodes that are following correctly eth1 head by timestamp, but are not processing deposits at all. I've traced them to be Lighthouse team in it's majority. I am not sure if the bug is in their eth1 nodes not giving them logs or in lighthouse not being able to process deposits. The one with `233` votes is every prysm node except mine! still voting for the genesis hash with no deposits. I do not know why this happens. The only changes I myself made to my node is the PR https://github.com/prysmaticlabs/prysm/pull/8887 that should only change slightly the behaviour in an init sync. The ones with `286` votes is Teku and Lighthouse, which is voting for the eth1 block `12997` included in https://nocturne.rayonism.io/block/16384, this is the beginning of the previous period! so they are off by an entire period of voting \u003c@!425572898787426305\u003e your nodes are also voting for this (as is my own Teku node running your patch).",
        "created_at": "2021-05-15T11:46:14.803000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "So in short, you guys need to get your !$#$!@% together 😛  I'm the only one with the right votes seeing all deposits.",
        "created_at": "2021-05-15T11:46:56.917000+00:00",
        "attachments": null
    }
]