[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It would be valuable to figure out why these were added originally.",
        "created_at": "2023-02-28T01:51:12.563000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Chesterton's is Fence and all that.",
        "created_at": "2023-02-28T01:51:47.673000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "FWIW in the yellow paper sections `4.3.1` and `4.3.2 (33)` it's used to as a means to calculate the header's `logsBloom` but of course as the geth code I pointed to above shows it's not really necessary since the bloom could be redefined as \"the bloom over all the logs in every receipt\" without actually changing the computed value.",
        "created_at": "2023-02-28T04:05:36.697000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Is there perhaps something one could do with light clients that allows them to utilize this (in theory) to validate some value from an untrusted source?",
        "created_at": "2023-02-28T05:23:26.207000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm not able to think of anything, but 🤷.",
        "created_at": "2023-02-28T05:23:35.628000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is not reliable, I hope they are not doing this",
        "created_at": "2023-02-28T09:10:03.058000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Dropping bloom from new transaction types seems like a very  straightforward way as it does not \"break\" anything.",
        "created_at": "2023-02-28T09:12:34.246000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hmm, `logsBloom` could become quite useful, if regular transfers would also emit an entry. They essentially allow easy searching / filtering of transactions affecting a certain wallet. Not for validation, but just to know what transactions likely affect you. As for 4844 / type 5, not sure it's worth there. there are 0-4 type 5 transactions per block, and receipts do not _have_ to persist in that same format in a database if an implementation has a more compact representation. If type 5 transactions are allowed to emit logs, I'd personally prefer the simpicity of keeping it consistent, or at least well thought-out.",
        "created_at": "2023-02-28T12:19:58.019000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "just to clarify, receipts do not end up in consensus `ExecutionPayload` — only the overall logs-bloom of the entire block does",
        "created_at": "2023-02-28T12:22:18.985000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You are of the opinion that it is easier to search log blooms in receipts rather than just searching the logs in the receipts?",
        "created_at": "2023-02-28T12:31:29.806000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I do acknowledge that it is technically faster under the right conditions, but I would be fairly surprised if those conditions were met in reality in any existing client, or if the performance benefits are worth building a client that hits those conditions.",
        "created_at": "2023-02-28T12:32:20.874000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hmm, what I'm saying is just that the EL implementation can pick themselves how they want to the search. The logs bloom doesn't necessarily have to be materialized on disk, it could be computed on-demand when serving JSON-API request. It's not part of `ExecutionPayload`, so the space savings simply are not necessarily as big as assumed here, especially when only targeting type 5 tx.\n\nAs for whether one or the other search method is preferrable, my focus so far has been on the transactions, so I don't have a strong opinion yet. It could indeed be that the logs bloom per receipt indeed doesn't make sense, and that those blooms should not be computed anymore for new receipts. If that is the case, I'd rather see them removed for all new blocks, instead of only for a single transaction type. Receipts / logs are not signed, their format could be determined by the spec-fork of the block that holds the corresponding `receipts_root`, and they do not carry state across blocks, so it might be relatively straightforward to say, starting from the fork that changes receipts to SSZ, all receipts simply don't have that field anymore.\n\nIn praxis, I think that it should be possible to build a light client on a 2$ embedded system (64 MHz — 512 KB flash — 64 KB RAM). If the logs are guaranteed to never exceed those 64 KB RAM, it's alright to just search them, I guess. Otherwise, the bloom may be more efficient.\n\nFurthermore, I wonder if it is easier to create a proof that a server did not withhold any transactions from you that match your bloom query. Would have to analyze.",
        "created_at": "2023-02-28T12:44:55.867000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "and, also, as a transition period, it could be made so that the field is simply not present in the SSZ representation of the receipt, but still gets synthesized on JSON-RPC API for a while to have a sane deprecation process",
        "created_at": "2023-02-28T13:08:49.522000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Anyhow, have tracked it as part of EIP-6466 (receipts), to not forget: https://ethereum-magicians.org/t/eip-6466-ssz-receipts-root/12884",
        "created_at": "2023-02-28T13:10:12.691000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As for tomorrow's SSZ breakout call: https://github.com/ethereum/pm/issues/727\n\nI have updated EIP-6404 with thorough measurements for SSZ Union vs Normalized Transaction representations\n– Discussion: https://ethereum-magicians.org/t/eip-6404-ssz-transactions-root/12783/17\n– Measurements: https://eips.ethereum.org/EIPS/eip-6404#test-cases\n– For EVM and zk circuits, I have included a section about the verifier complexity, lacked the time / experience to accurately measure them. \n– There is .c and .py code underneath the complexity / embedded section of the measurements. The .c code uses as little abstractions as possible.",
        "created_at": "2023-02-28T13:25:04.421000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ah I wasn’t aware of -6466 that does seem like a cleaner place to make the change if it happens.",
        "created_at": "2023-02-28T14:38:53.441000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "When eip-2718/eip2730 was first introduced there was a talk that new transactions will be in ssz format but it was decided iirc that it was easier to continue to use rlp. Now same story is with blooms, i would like if they are removed from all receipts but that would potentially break some compatibility, a alternative is to remove it where we can and with introduction of new tx this seems like a good place to start. It is more question if clients align with notion that we want to remove receipt blooms or how useful it is.",
        "created_at": "2023-02-28T15:33:07.498000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It is easier to add a bloom field later than it is to remove it later!",
        "created_at": "2023-02-28T15:37:19.592000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Start with the absolute minimum, and then add later if there is demand for it.",
        "created_at": "2023-02-28T15:37:34.261000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Not sure re compatibility. The change will break the `receipts_root` format from MPT to SSZ already, so using this as a chance to also kill the per-receipt bloom would be feasible. It could still be exposed on JSON-RPC for a deprecation period, just couldn't use it in proofs. As of now, there is no JSON-RPC endpoint to obtain a receipts proof, don't see the problem with just killing it, if there is no use case for it",
        "created_at": "2023-02-28T20:10:11.611000+00:00",
        "attachments": null
    }
]