[
    {
        "author": "ryanleeschneider",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Is the expectation that `eth_sendRawTransaction` will continue to take txs in -2718 format or will that endpoint be switched to SSZ as well?",
        "created_at": "2023-02-20T00:37:04.179000+00:00",
        "attachments": []
    },
    {
        "author": "etan_status",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "2718",
        "created_at": "2023-02-20T07:05:11.768000+00:00",
        "attachments": []
    },
    {
        "author": "etan_status",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "2718 is kinda mixed btw, some in rlp, 0x05 type in ssz. if the ssz thing takes off, it may make sense to also have a plain SSZ tx (without blobs)",
        "created_at": "2023-02-20T07:06:47.842000+00:00",
        "attachments": []
    },
    {
        "author": "etan_status",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "but, for now, the representation that I'm focusing on only affects transactions _after_ they are processed and packed into a block",
        "created_at": "2023-02-20T07:07:38.377000+00:00",
        "attachments": []
    },
    {
        "author": "ryanleeschneider",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Makes sense, as I understand it the whole point of 2718 was to allow a mix of potentially totally different encodings based on the first byte. I was mainly curious/concerned that any post -6404 processing of incoming txs (e.g. a relayer) would need significant changes. Sounds like -2718 is still being followed though so glad to hear that. \n\nIf we ever wanted to deprecate raw RLP txs my suggestion would be to keep -2718 and simply deprecate types 0-4.",
        "created_at": "2023-02-20T16:20:51.180000+00:00",
        "attachments": []
    },
    {
        "author": "etan_status",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There are three core representations of transactions currently.\n– (1) is devp2p Transactions gossip / PooledTransactions response. These are 2718, full tx (4844 with blobs), whatever form\n– (2) is devp2p GetBlockBodies response (for backfill). These are also 2718, but may only have partial content, e.g., for 4844 tx it doesn't have blobs anymore\n– (3) is consensus ExecutionPayload structure. This is currently same as 2, except the RLP is put into a List of SSZ ByteVectors.\n\nA commitment to (2) is included as `txs-root` in the execution block header. Likewise, a commitment to (3) is included as `transactions_root` in the consensus executionpayloadheader. In JSON-RPC, the `txs-root` is called `transactionsRoot`, adding some more confusion.\n\nIn 6404, the primary goal is to align those two commitments to the one used by (3). Namely, to replace the current Merkle-Patricia Trie `txs-root` in the execution block header with the same SSZ `transactions_root` from consensus.\n\nFurthermore, while visiting this area, the secondary goal is to make those opaque SSZ ByteVectors in the consensus ExecutionPayload more accessible to light clients and smart contracts. That's what this \"SSZ Union\" vs \"Normalized `Transaction`\" discussions are about.\n\nRegarding devp2p networking, the only thing that will change in a breaking way is the `txs-root` changing from MPT to SSZ. \nThe devp2p GetBlockBodies response could be aligned with the new `Transaction` representation as well, but that's just an optimization and non-breaking.\nThe devp2p Transactions gossip / PoolTransactions response is not affected at all.\n\nRegarding transaction types, yes, what you suggest seems reasonable. Introduce a new SSZ type that can do what the existing RLP types can do, e.g., type 6, and then gradually move tooling away from producing new txes of types 0-4. However, I doubt that types 0-4 can be fully deprecated anytime soon.\nBTW, do you know what types 3 and 4 are? I only know 1, 2, 5, and legacy (0 in json-rpc)",
        "created_at": "2023-02-20T23:11:53.009000+00:00",
        "attachments": []
    },
    {
        "author": "ryanleeschneider",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I’m actually not sure why 4844 uses type 5. IIRC there were some withdrawal and account abstraction EIPs that were considered that used new tx types but I don’t recall the exact EIPs or which numbers they used, if I had to guess 5 was chosen so as not to conflict with those but I’m not certain on that.",
        "created_at": "2023-02-20T23:39:55.685000+00:00",
        "attachments": []
    }
]