[
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "# evmone baseline\n\nHi \u003c#706868829900505180\u003e people,\n\nWithin evmone project I'd like to implement yet another EVM interpreter called \"baseline\". It is suppose to be a naive interpreter implementation with quick startup time (no additional code preprocessing except for JUMPDEST analysis).\nI want to compare the performance with \"heavy\" evmone variant to answer the question if sophisticated preprocessing step is actually beneficial.\n\nI started working on PoC, and progress is quite good as I can copy a lot of code from evmone. This can be tracked in `baseline` branch: https://github.com/ethereum/evmone/tree/baseline.\n\nI'd like to know if I should continue and if I can submit work hours for this to 1.x budget.\n\nPS. Any better name alternatives to \"baseline\"?",
        "created_at": "2020-07-08T11:27:13.053000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "what is the pre-processing you are referencing?",
        "created_at": "2020-07-08T11:29:14.137000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i have recently thought about the possibility of using evmone to supplement the python interface to lmdb (in the context of turbo-geth). Specifically, I thought \"would it be possible to use evm one together with lmdb and the turbo-geth's database to provide transaction re-tracing capabilities and have python bindings to them?\". And in my thinking I stumbled upon the fact that evmone, being an implementation of EVMC, requires the implementation of EVMC host, which it calls back. It can be quite inconvenient. On the other hand, I remembered the API offered by SputnikVM, where there is no Host interface, and the host simply calls Sputnik VM over and over again, providing more missing data, until the tx execution is done. This may turn out to be more convenient for all kinds of bindings because instead of two interfaces (EVMC impl and EVMC host), you only need to care about 1 interface. What do you think about re-designing EVMC to be more like Sputnik?",
        "created_at": "2020-07-08T11:38:02.886000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "or perhaps making the new version evm one to have only 1 interface (and also thus better support nested invocations)",
        "created_at": "2020-07-08T11:40:01.280000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Preprocessing is:\n- computing gas costs and stack requirements per bock of instructions,\n- converting push data to final form (little endian number),\n- converting bytecode to a table of function pointers.",
        "created_at": "2020-07-08T12:57:23.080000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ok, so in the \"baseline\" version these things will be done \"lazily\", i.e. on demand",
        "created_at": "2020-07-08T12:58:50.084000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "No, I will not do them at all.",
        "created_at": "2020-07-08T12:59:24.325000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "so it will be just a more straightforward interpreter?",
        "created_at": "2020-07-08T13:00:43.090000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes. A \"naive\" one. Some cooperation between baseline and optimizing interpreter can be thought about later.",
        "created_at": "2020-07-08T13:58:00.916000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I actually finished the PoC.",
        "created_at": "2020-07-08T13:58:06.604000+00:00",
        "attachments": null
    },
    {
        "author": "_drinkcoffee",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!425274498732916736\u003e , You might consider using another name. \"baseline\" is used in the context of the Ethereum Oasis project's Baseline Protocol: https://github.com/ethereum-oasis/baseline#:~:text=The%20Baseline%20Protocol%20defines%20a,auditable%20common%20frame%20of%20reference.",
        "created_at": "2020-07-08T21:37:48.562000+00:00",
        "attachments": null
    }
]