[
    {
        "author": "roshanroshan",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "has there been discussion around allowing contracts to replace their own (complete) bytecode through an EVM opcode?\ncan maybe even repurpose SELFDESTRUCT by handling empty bytecode differently\nseems like a pretty elegant solution to upgradability, deprecating all the patterns developed over the years (which waste precious gas on every call)\nI'm not entirely sure about the security/other implications though (beyond auditing the contract to not mutate in undesirable ways)",
        "created_at": "2021-07-27T15:10:40.020000+00:00",
        "attachments": null
    },
    {
        "author": "wjmelements",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I support SETCODE as an alternative to CREATE2+SELFDESTRUCT. It was discussed recently in \u003c#812719315136675850\u003e, though that devolved into personal attacks against me.",
        "created_at": "2021-07-27T23:02:59.979000+00:00",
        "attachments": null
    },
    {
        "author": "roshanroshan",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "also, on further reading, I came across https://hackmd.io/@vbuterin/selfdestruct which gives reasons as to why `SELFDESTRUCT` needs to be nuked\nmost of the issues there won't really apply to the above opcode since it leaves the storage as is, and only changes the code\nhowever, there's one specific section titled \"`SELFDESTRUCT` is the only opcode which can cause the code of a contract to change\" and details the implications\nwould love to know how strongly people feel about this (mutable contracts) being a blocker in general (esp. \u003c@!273808422753796097\u003e who authored the above doc)\n\npersonal opinion: the immutability ship has kinda already sailed with the proxy-delegate pattern 🤷‍♂️ might as well streamline it",
        "created_at": "2021-07-27T23:53:49.386000+00:00",
        "attachments": null
    }
]