[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I actually think we *should* allow for irregular state changes in our process.  I doubt this will be the last time that we need to fix/adjust an outlier or two in order to cleanly solve a problem.  By taking a hard line stance against any irregular state changes I suspect is going to result in more and more unresolved technical debt that will make Ethereum less and less competitive with new blockchains over time.",
        "created_at": "2021-10-26T04:04:18.525000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "While I fully agree that we need to be credibly neutral, I think on this particular topic we should strive to find a line further down the spectrum as our schelling fence rather than the extreme point.",
        "created_at": "2021-10-26T04:05:22.553000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I had a long response started, but to keep this mostly on topic I'll summarize it as the only durable fence on this topic is the \"never again\" fence.",
        "created_at": "2021-10-26T04:14:20.357000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Given the original plan dealt with contracts popping up with an EF prefix anyway, I'm really struggling to see why we think just following that plan adds technical debt or maintenance burden - we just look for 0xEF00 instead of 0xEF and the rest of the code stays the same.\nOn the other hand, an irregular state transition does add code that only executes on MainNet so is higher risk of causing consensus failures and has to then be maintained for as long as we want to sync the chain anyway.",
        "created_at": "2021-10-26T04:18:57.707000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Part of my reason for lobbying for this kind of change is that I think regenesis is something we really will have to do at some point.  I think continuing to build from genesis is unsustainable long term.  If we accept this, then an irregular state change isn't a permanent piece of technical debt.",
        "created_at": "2021-10-26T04:37:38.467000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Possibly true at some point in the future. It's still a lot more complex and dangerous in the meantime.  Whereas a longer prefix doesn't add any technical complexity and I suspect the storage increase is going to be completely negligible for even the smallest useful contract.",
        "created_at": "2021-10-26T04:41:54.965000+00:00",
        "attachments": null
    }
]