[
    {
        "author": "vorot93",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Proxy-delegate does not involve modifying deployed contract.\n\nI think the big problem in this community is ppl speaking out of their butt, without knowing how Ethereum clients are actually written.\n\nProliferation of such proposals in the past has led us to a situation that only a handful of people actually know how Ethereum implementations work. As a result - client maintenance crisis on our hands.\n\nThe more sources of complexity we remove, the sooner said crisis will resolve. SELFDESTRUCT is a _major_ source of complexity.",
        "created_at": "2021-07-30T03:31:28.004000+00:00",
        "attachments": null
    },
    {
        "author": "jules4691",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hey guys, John Adler mentioned in his ETHcc talk that Piper Merriam gave a talk on statelessness. Does anyone happen to have a link to this talk (ETHcc)?",
        "created_at": "2021-07-30T15:48:00.829000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!708639842216444014\u003e https://www.youtube.com/watch?v=jAX_bgcESoc\u0026list=PLhM7rBgpVV-K3Dko5_PUhwy0DnwzR1lgN\u0026index=24",
        "created_at": "2021-07-30T15:48:59.902000+00:00",
        "attachments": null
    },
    {
        "author": "roshanroshan",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "well yeah, ofc proxy-delegates don't mutate contracts, apologies if I wasn't clear there, I was talking more from the _user's_ perspective\nas a user today, I can not rely on \"immutable\" behaviour as long as proxy-delegates are a thing\nI would have to audit the contract to see how it might change in the future, at which point it doesn't really matter if the contract can mutate, I'm auditing it anyway\n\nand I'm not arguing against removing `SELFDESTRUCT` either, literally don't care if this stays or not\nin fact, me referencing the above post by Vitalik was more to understand what sort of second-order effects to _avoid_ when debating a new opcode\n\npoint well taken about client complexity though",
        "created_at": "2021-07-30T17:37:13.147000+00:00",
        "attachments": null
    },
    {
        "author": "roshanroshan",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "people can do proxies, yes, (and they do it today) but the main thing I'm trying to address is the gas that's wasted in all this crap (bonus: save some witness size, albeit small)\nit was completely fine when `SLOAD` costed 200, but its currently 10x that and makes reading _any_ storage an expensive proposition, especially when it lies in the hot path for _every_ transaction made to a contract\nnot to mention, state size is still growing (at least until we get some sort or pruning/archival to stabilize it), which potentially means costs go up _regularly_\n\nand its not just about upgrades, another big example is governance parameters which currently reside in contract storage\neach param is an extra `SLOAD` on almost _every_ call made to the contract, which is a total waste, an ideal world would have it encoded in the contract bytecode itself and mutate when it changes (paying higher upfront costs for lower ongoing costs)\n\nI'm sure other use cases will pop up...\n\nI'll admit that I'm kinda just handwaving a lot of things here, maybe I should try to get some numbers on how much gas is being wasted on all this BS\nI think that will probably put it into context (for me, included) if its _worth_ the client complexity or not",
        "created_at": "2021-07-30T18:03:40.264000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There has been discussion about making the first `n` bytes of contract storage cost less in the future, I think it is related to some upcoming feature (I forget which, maybe verkle tries?).",
        "created_at": "2021-07-30T18:27:47.564000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There has also been discussion in the past about paged storage and being able to do bulk contiguous reads and writes rather than random access 32 bytes at a time.",
        "created_at": "2021-07-30T18:28:13.231000+00:00",
        "attachments": null
    },
    {
        "author": "jules4691",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "ty ❤️",
        "created_at": "2021-07-30T18:30:23.838000+00:00",
        "attachments": null
    },
    {
        "author": "roshanroshan",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "oh, thanks, very interesting, will read up",
        "created_at": "2021-07-30T20:03:23.872000+00:00",
        "attachments": null
    }
]