[
    {
        "author": "jules4691",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!713071416521785444\u003e , Ser, just listened to your talk at ETHcc. Super interesting, thank you! A question. If your L1 is a pure data availability layer, wouldn't that imply that the rollups (L2) do NOT share L1 security in such a L1/L2 construction? (Since all execution is done on L2 there is no way to \"detect\" fraud of a rogue L2 on L1 anymore, or is there?)\n\nMore generally, I was a bit surprised that you didn't mention any disadvantages of a pure data availability L1 with respect to what we have now. The bottom line of all my learnings in this space so far was that there are usually compromises. Is that really not true in this case? \n\nlink to the talk: https://www.youtube.com/watch?v=YoWMLoeQGeI",
        "created_at": "2021-08-01T16:48:08.441000+00:00",
        "attachments": null
    },
    {
        "author": "jadler2664",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e If your L1 is a pure data availability layer, wouldn't that imply that the rollups (L2) do NOT share L1 security in such a L1/L2 construction? (Since all execution is done on L2 there is no way to \"detect\" fraud of a rogue L2 on L1 anymore, or is there?)\nIn a DA layer model, there is no need for the L1 to actually verify fraud or validity proofs, as that can be done client-side. The only reason for something that's not a client of the rollup to verify fraud or validity proofs is to accept messages (to be general) from that rollup. In the case of rollups on Ethereum, this looks like withdrawals from the rollup, processed by a smart contract. In a DA layer model, you can accomplish this by either:\n1. Have the chain that accepts messages run a light client of the sending rollup client-side, e.g. with IBC.\n2. Have a chain that accepts messages from multiple rollups, e.g. run an EVM rollup on top of a DA layer, and have additional rollups connect to it.\n\n\u003e  I was a bit surprised that you didn't mention any disadvantages of a pure data availability L1 with respect to what we have now. The bottom line of all my learnings in this space so far was that there are usually compromises. Is that really not true in this case?\nNot everything has meaningful compromises. Though rare, there are cases of things being strictly better or worse. This is one such case. The DA layer model is more flexible and scalable than the world computer model, and is just as secure.",
        "created_at": "2021-08-01T17:04:51.620000+00:00",
        "attachments": null
    },
    {
        "author": "jules4691",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "wow thanks a lot. That was super illuminating!",
        "created_at": "2021-08-01T21:30:17.944000+00:00",
        "attachments": null
    }
]