[
    {
        "author": "poupash",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hi everyone, is there currently a gas-efficient way to do BLS12-381 (single) signature verification on the EVM?",
        "created_at": "2021-10-10T14:51:05.212000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I've found some references to EIP-2537 and EVM384, but these seem to be on the discussion phase still, correct?",
        "created_at": "2021-10-10T14:53:31.610000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yes those are the main proposals atm",
        "created_at": "2021-10-10T15:53:41.544000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thank you. Is there any timeline (even if very provisional) for any of them being included?",
        "created_at": "2021-10-10T15:54:47.652000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i think 2537 is on the table as a potential shanghai EIP and not sure the current status of EVM384",
        "created_at": "2021-10-10T15:56:20.355000+00:00",
        "attachments": null
    },
    {
        "author": "jwasinger",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "EVM384 is dead in the water at the moment.  The core idea seems sound and there is an evm implementation of bls12381 pairings using evm384 (https://github.com/poemm/evmcurves).  Also there is a mostly-complete Geth/pure-go implementation (https://github.com/jwasinger/go-ethereum/tree/evm-mod-ext) of the latest proposal (https://notes.ethereum.org/@poemm/eip_draft_evm_modular_arithmetic_extensions).\n\nIt really needs two things:\n* more input from people with serious crypto skills to help drive the development direction: e.g. the original proposal specified that only odd moduli  up to 384 bits were to be allowed, but then was decided to increase the maximum size up to at least 784 bits or higher, also to explore allowing for even moduli.  The ultimate proposal should be flexible for the sake of completeness but this also blows up the complexity.\n* performant implementations of montgomery multiplication at higher bitwidths (preferrably in non-asm  to appease core devs who would have to maintain this code if the proposal went live).  Right now, there is a huge slow-down in the current Go implementation over 640 bit width.\n\nAnd  this is overshadowed by the prioritization of the merge and the moratorium on other protocol changes (like nontrivial evm improvements).",
        "created_at": "2021-10-10T17:15:57.232000+00:00",
        "attachments": null
    },
    {
        "author": "poupash",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thank you for the detailed response, and for your work on the Go implementation",
        "created_at": "2021-10-10T19:59:54.225000+00:00",
        "attachments": null
    }
]