[
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I just wanted to make them aware of what I reported by way of timing individual operations way back then.  What they are doing is much more thorough.  But they seem to be trying to measure overheads and subtract them out of their tests, and I found I couldn't get stable results that way.",
        "created_at": "2021-11-10T19:46:33.752000+00:00",
        "attachments": null
    },
    {
        "author": "pdobacz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hi, this is Piotr from the Gas Cost Estimator team. We're aware, for now keeping OE in for comparison and because we've already got it set up at phase 1. As the landscape changes, we'll accommodate.",
        "created_at": "2021-11-10T20:00:06.832000+00:00",
        "attachments": null
    },
    {
        "author": "pdobacz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thank you for reaching out. Can you elaborate on what do you mean by (un)stable results and interpreter overhead?",
        "created_at": "2021-11-10T20:03:07.120000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The only viable client in your comparison is Geth.  I think that is skewing findings TBH.",
        "created_at": "2021-11-10T20:08:18.758000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It's been a long time, and I haven't studied what you are doing very closely,  but...   I linked above (https://github.com/ethereum/evmone/issues/71) to an old discussion of some measurements I made using code from an even older set of tests (https://github.com/gcolvin/evm-drag-race):\n\u003e The tests (except exp) do a million loops over blocks of about three hundred opcodes, mostly consisting of dup2 \u003cop\u003e pairs for each tested op, with occasional breaks to reset the stack.\nSo I was trying to drown out the overhead of startup, warmup, looping, and timing with the time taken by the blocks of operations.  The tests took from about a second to a 130 seconds (for exp) to run.\n\nI also ran tests to estimate overhead:\n\u003e The nop test uses blocks of jumpdest jumpdest, and the pop test uses blocks of dup2 pop.  They can be helpful in estimating interpreter overhead, being very little but overhead, but understanding the interpreter code helps.\n\nI found that subtracting these numbers from the operation tests was unstable - the differences varied a lot between multiple runs and were sometimes negative.  I think this was partly numerical instability from subtracting values of similar magnitude, and probably more due to the \"startup, warmup, looping, and timing\" overhead varying too much.\n\nI didn't pursue it too much more, as we more interested in the relative values so far as whether the gas costs were well balanced and how much the VMs differed.  I'd say they are not well balanced: between ops, within ops with different sizes of operand, and between VMs.",
        "created_at": "2021-11-10T23:29:00.088000+00:00",
        "attachments": null
    }
]