[
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The report of the **Stage I of the Gas Cost Estimator** research project has been published recently. This work (stage I) has been sponsored by ESP.\n To my understanding, this is rather exploratory stage to plan stage II with more complete results. There are also some preliminary results of the option to instrument EVM interpreter loop and record array of instruction timings which later can be compared with an offline trace of the same execution.\n\nhttps://github.com/imapp-pl/gas-cost-estimator/blob/master/docs/report_stage_i.md",
        "created_at": "2021-03-14T14:44:59.802000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "https://raw.githubusercontent.com/imapp-pl/gas-cost-estimator/af6b77e0e75b5484bebf9d26ce4d7a44affca834/docs/report_stage_i_assets/implementation_relative_all_opcodes.svg",
        "created_at": "2021-03-14T14:45:32.935000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "**VM Matters: A Comparison of WASM VMs and EVMsin the Performance of Blockchain Smart Contracts**\n\n\u003e WebAssemly is an emerging runtime for Web applications and hasbeen supported in almost all browsers. Recently, WebAssemblyis further regarded to be a the next-generation environment forblockchain applications, and has been adopted by Ethereum, namelyeWASM, to replace the state-of-the-art EVM. However, whetherand how well current eWASM outperforms EVM on blockchainclients is still unknown. This paper conducts the first measurementstudy, to measure the performance on WASM VM and EVM forexecuting smart contracts on blockchain. To our surprise, the cur-rent WASM VM does not perform in expected performance. Theoverhead introduced by WASM is really non-trivial. Our resultshighlight the challenges when deploying WASM in practice, andprovide insightful implications for improvement space.\n\nhttps://arxiv.org/abs/2012.01032",
        "created_at": "2021-03-14T14:52:21.083000+00:00",
        "attachments": null
    }
]