[
    {
        "author": "mempirate",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hi everyone, I'm doing some research on how much the EVM is a bottleneck right now and how much of an improvement we would get using eWASM instead, do you guys have any recommended reading / research?",
        "created_at": "2021-06-08T14:05:48.321000+00:00",
        "attachments": null
    },
    {
        "author": "evanvanness",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "https://arxiv.org/abs/2012.01032",
        "created_at": "2021-06-08T19:05:39.335000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "To decide if the EVM is the bottleneck serious investigation needs to be put into other bottlenecks. \n\nOne thing that I didn't seen in my brief skim of that paper that is a major consideration of the time spent in block validation and production unrelated to the EVM vs. the time spent in the EVM. That would be worth investigation.  \n\nAlso worth looking at is the impact of the size of the backing store.  While clients are moving to leaf-based storage the \"trie climbing\" penalty is only seen in large account environments (eth has 150m) and large state storage contracts.  Some databases also see performance penalties when the DBs get larger (500GiB and 10TiB on-disk DB size would provide near future benchmarks for a pruned and archive nodes respectively) This is why there is research into pulling \"ancient\" blocks out of the key-value store or dismissing them entirely. I've had several optimizations that worked great in integration testing that became useless to harmful at mainnet scale.",
        "created_at": "2021-06-08T19:34:12.734000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Also, complex mulit-contract smart contract calls seemed to be out of scope of the paper. The typical sort of thing you might see in a meta-transaction or DeFi arbitrage. This would increase the time in non-EVM block execution.",
        "created_at": "2021-06-08T19:37:29.175000+00:00",
        "attachments": null
    },
    {
        "author": "mempirate",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thank you both, and \u003c@!403707149043105803\u003e I will take note of this",
        "created_at": "2021-06-08T20:27:46.873000+00:00",
        "attachments": null
    }
]