[
    {
        "author": "shamatar",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Perfect claim about performance: \"To explore the reason why Openethereum runs slower, we manually analyzed the source code of Geth EVM and Openethereum EVM, and found that the different implementation of opcode might be the leading reason. As shown in Figure 2, Geth and Openethereum implement the same opcodes in quite different ways. For example, the opcode ADD (Figure 2(a)) is implemented with a simple Add operation in Geth, however, Openethereum will further check if an arithmetic overflow occurs\"",
        "created_at": "2021-03-22T15:21:58.847000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e Answer to RQ2: For the two most popular Ethereum EVM\n\u003e engines, the performance of contract execution on Geth is better\n\u003e than that on Openethereum. Our investigation suggests that\n\u003e the opcode-level implementation of EVM engines would greatly\n\u003e impact the overall performance of smart contract execution.\n\u003e Moreover, 64-bit and 265-bit smart contract have shown no obvious performance gap during their execution on EVM engines,\n\u003e as the native data type of EVM bytecode is 256-bit.\n\nAnd the performance of evmone was not tested, but everything I've done and seen says it would be much better.  Do you have a notion of the ratio for their tests \u003c@!425274498732916736\u003e?\n\n\u003e Answer to RQ4: While standalone WASM VMs are faster than\n\u003e EVMs, the blockchain flavored WASM VMs are slower than EVMs\n\u003e for all of the 256-bit benchmarks and most of the 64-bit benchmarks on both Geth and Openethereum clients. This is because\n\u003e of the overhead introduced by gas metering before the execution of WASM bytecode and the inefficient context switch of EEI\n\u003e methods.\n\nI probably didn't read carefully enough, but they didn't seem to look at how much of the overhead was gas versus EEI.  Also not sure how optimized the gas metering was.  But these results don't surprise me much.",
        "created_at": "2021-03-22T20:09:55.018000+00:00",
        "attachments": null
    }
]