[
    {
        "author": "zemse",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hey guys, just curious about the reason why EVM does not allow to read storage slots of another contract, is there any flaw if EVM would allow it?\n\nsome potential benefits:\n- many public marked view variables/structs/mappings (in Solidity) perform multiple unnecessary sloads. e.g. `uniswapv3pool.ticks(tickIndex)` has to read 4 slots even if some contract is interested in just a particular value. so if there could be some opcode, like GETSTORAGEAT that pops an address and slotid, and pushes back the slot value on the stack, that can help gas improvements.\n- could potentially reduce bytecode by decreasing number of view functions (contracts can keep view functions like totalSupply() for adhering to standards).\n- the EVM would not need to load the bytecode of the contract and process it, in order to read a storage variable, hence CALL cost might not be needed? just an SLOAD cost (just wondering)",
        "created_at": "2021-12-18T10:42:23.328000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "From a protocol level EXTSLOAD shouldn't be too hard, pass in (address, slot) and then get the value.  There are some performance implications that can be addressed by the clients or, more likely, be reflected in the gas cost.",
        "created_at": "2021-12-18T15:17:44.030000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "However when it gets to the solidity/vyper level calculating the slot number gets very fragile.  You would either need to have the source of the target contract or some export of the slot assignments, then you would need to make sure they both used the same or compatible compiler options and versions (pragmas can ensure this).  When you throw in the developer fragility and the potential gas overhead I don't see it being as valuable as one would think.",
        "created_at": "2021-12-18T15:17:45.428000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "EXTSSTORE?  Nope nope nope.",
        "created_at": "2021-12-18T15:18:03.841000+00:00",
        "attachments": null
    },
    {
        "author": "sendmoodz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "existing eip here btw https://eips.ethereum.org/EIPS/eip-2330",
        "created_at": "2021-12-18T18:13:31.228000+00:00",
        "attachments": null
    },
    {
        "author": "sendmoodz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "and def wish it existed, the way positions are stored in nft position manager it requires 6 sloads to get the position info even if you only care about one slot",
        "created_at": "2021-12-18T18:14:36.580000+00:00",
        "attachments": null
    },
    {
        "author": "sendmoodz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "this is much better than status quo for the usecase, but it prohibits the use of mappings which makes our worst case number of accesses pretty bad",
        "created_at": "2021-12-18T18:18:46.694000+00:00",
        "attachments": null
    }
]