[
    {
        "author": "jordanmmck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "this has probably been addressed, but is there any reason why ethereum doesn't support self-executing contracts?",
        "created_at": "2021-06-21T00:50:23.444000+00:00",
        "attachments": null
    },
    {
        "author": "jordanmmck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "ie. execute some function at block X, as long as contract has enough eth to pas for gas of course",
        "created_at": "2021-06-21T00:50:52.803000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "How do you decide what gas price to offer? There's a huge potential for DOS vectors there as well, or even just the burden of long ago forgotten contracts that continue firing off transactions that no one actually cares about. Paying gas provides some protection against this but it's quite expensive just to track whether a tx should be fired for all the contracts in the world state and gas is only paid when they actually trigger.",
        "created_at": "2021-06-21T00:52:59.768000+00:00",
        "attachments": null
    },
    {
        "author": "jordanmmck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "good points. definitely don't want contracts spamming network, even if they have the ETH to pay for it. and yeah, i guess it becomes much more complex for EVM. it would have to keep a huge list of all contracts with automatic execution",
        "created_at": "2021-06-21T01:04:36.175000+00:00",
        "attachments": null
    },
    {
        "author": "jordanmmck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "thank!",
        "created_at": "2021-06-21T01:04:39.011000+00:00",
        "attachments": null
    },
    {
        "author": "greg_vardy",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Not really but kind of. Front ends  usually take a high level language and translate it to an AST then IR , I’m interested  in going from evm bytecode to a high level language. So reverse",
        "created_at": "2021-06-21T11:19:57.295000+00:00",
        "attachments": null
    },
    {
        "author": "greg_vardy",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It’s not really the same as trying to recover contract code from bytecode , it’s more akin to transpiling bytecode compiled from Solidity to a different contract language",
        "created_at": "2021-06-21T11:21:52.848000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@823926145950548069\u003e does this high level language has an optimizer?",
        "created_at": "2021-06-21T16:05:30.889000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "https://discord.com/channels/595666850260713488/745077610685661265/856606582015131659\ncontinuing this here (cc \u003c@!619138323776012307\u003e \u003c@!301186049323958275\u003e)",
        "created_at": "2021-06-21T19:05:25.374000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e that’s a thing. you cannot really. You still need to update your account. So I get why some empty blocks are actually not empty and full the whole space with gas token (account update for block reward + predefined state update for the whole gas token creation)\nNot sure what you mean by this, updating just the coinbase balance is only around a dozen hashes where an entire block could be many more. Miners are starting with \"empty\" blocks full of gas tokens now because they're also simple and quick to build\n\n\u003e But I still don’t get if there are actual empty blocks in Eth like we have in Bitcoin\ndo empty blocks in btc not pay out to the coinbase?",
        "created_at": "2021-06-21T19:09:05.860000+00:00",
        "attachments": null
    }
]