[
    {
        "author": "jlokier",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This idea that EVM implementations must analyse and reject CFGs with non-constant stack per instruction in order to obtain good performance on well-formed CFGs seems wrong to me.\n\nI think an implementation optimised for performant x86/Wasm code generation would run linear time analysis (or quasilinear time, O(n log n)) on every contract _including older deployed contracts_, isolate fixed stack CFG subgraphs relative to an entry instruction and emit code for those, with stack overflow checks occurring at subgraph boundaries.  Boundary checks are necessary if there is any kind of function recursion, and they are a general solution that works with all CFGs including the hypothetical loop that adjusts the stack on each iteration.  The above only covers overflow, but underflow checks are detectable and eliminable when the CFG has matching entry and exit points (i.e. proper nested function structure, even allowing recursion), and are cheap when they are not.\n\nSo the new analysis prevents some types of generated code from being deployed in future, but I don't see how it can be used to improve EVM performance.  The Geth benchmarks above show a speedup to be expected from eliminating stack checks, but that optimisation is available regardless, even on contracts which are deployed already, by using the same analysis for opportunistic optimisation.  That optimisation implies two instances of the EVM interpreter core, with and without stack checks, but that's required anyway under the current proposal because old contracts still need to be run.\n\nIf it can't improve EVM performance, can it make it worse?  I think in some cases yes, just by removing some code generation opportunities.  Does that matter?  I'm not sure if they are really used anyway except in hand-rolled code.  The other cost is requiring analysis to run each new deployment, instead of as a heuristic when the EVM deems it worth it on balance.",
        "created_at": "2022-11-13T11:47:23.061000+00:00",
        "attachments": null
    },
    {
        "author": "jlokier",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Btw, I'm not intending to disagree with the code rejection based on stack analysis, in case it comes across that way.  I'm just saying I don't think making it mandatory provides an execution time performance boost, compared with not doing so.",
        "created_at": "2022-11-13T12:48:10.460000+00:00",
        "attachments": null
    }
]