[
    {
        "author": "ajsutton",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'd have guessed that there's no way to specify a gas limit because a hard coded gas limit (as seen with CALL particularly) causes all kinds of problems when gas pricing for opcodes increase and can result in the contract being unusable.  Whereas if all the gas (or 7/8th or whatever it is) gets passed through then the end user can always increase the tx gas limit if needed.  CREATE2 is new enough to have been added after we learnt about those kinds of problems.",
        "created_at": "2022-04-06T00:09:07.189000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Been thinking on your notion of charging by edge in a CFG in addition to bytes in the code for validation.  Two problems I see.  One is that you can't count the edges before doing some analysis of the code, and that will get more difficult in the absence of JUMPDEST.   The other is that the number of edges goes up so fast with the number of possible destinations that the cost of validation will be too high for it to be of use.",
        "created_at": "2022-04-06T02:41:25.005000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As SELFDESTRUCTs are processed at the end of a transaction, do you know if the related ETH transfer happens immediately in SELFDESTRUCT execution or also in the transaction end?",
        "created_at": "2022-04-06T13:40:17.796000+00:00",
        "attachments": null
    },
    {
        "author": "yperbasis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "ETH transfer happens immediately, account deletion is postponed to transaction's end.",
        "created_at": "2022-04-06T14:27:25.175000+00:00",
        "attachments": null
    },
    {
        "author": "yperbasis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "While on the topic of SELFDESTRUCT. If we're not ready to commit to EIP-4758: Deactivate SELFDESTRUCT in Shanghai, should we at least prohibit it in EOF code as part of EIP-3540 or 3670? I think \u003c@!425279588009246720\u003e suggested that some time ago.",
        "created_at": "2022-04-06T14:30:29.060000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think that is a good idea.",
        "created_at": "2022-04-06T21:56:22.663000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\"7. Contract Creation\" in the Yellow Paper specifies how the the initialization code creates the actual code of the contract.  Solidity doesn't use it dynamically -- I think it just has the contract code as data which it copies -- but it can be used to dynamically generate code, and sometimes is.\n\n\u003c@273808422753796097\u003e.  A simplification that EOF might be able to provide is to be rid of dynamic initialization.",
        "created_at": "2022-04-06T22:49:47.555000+00:00",
        "attachments": null
    }
]