[
    {
        "author": "zemse",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e My main objection to extsload is still the fragile developer experience.\nI think it is still possible to preserve the dx. Contracts (as objects) are currently thought as: they have private storage variables and contain within themselves some \"view\" function bytecode that read and return these private variables on being CALLed. \nWhat if the \"view\" part of contract is kept outside/made available as library, i.e. included in the consumer. The contracts can just include non-view methods in it's bytecode and the view functions may be written as a library (they can definitely include view methods to adhere to standards like ERC20 for e.g.).\n\n```solidity\n// example solidity code\ncontract Hello {\n  uint counter;\n  uint deployTimestamp = block.timestamp;\n\n  function inc() public {\n    counter++;\n  }\n}\n\nlibrary HelloView {\n  // trivial read\n  function counter(Hello hello) internal returns (uint val) {\n    assembly {\n      val := extsload(hello, 0); // assuming counter is at slot 0.\n    }\n  }\n  \n  // read and process\n  function age(Hello hello) internal returns (uint val) {\n    assembly {\n      val := extsload(hello, 1); // assuming deployTimestamp is at slot 1.\n    }\n    val = block.timestamp - val;\n  }\n}\n\ncontract Consumer {\n  using HelloView for Hello;\n  function run(Hello hello) public {\n    if(hello.age() \u003e= 1000 \u0026\u0026 hello.counter() == 0) {\n      hello.inc()\n    }\n  }\n}\n```\n- This would reduce unnecessary bytecode in the Hello contract by not including a public counter method, as someone it can be just extsloaded.\n- Also some view methods read lot of slots. Consumer may be just interested in one. Such a consumer can just add/modify the View library to achieve that.\n(I understand this is solidity specific, I am assuming other languages that compile to EVM should also be able to do similar).",
        "created_at": "2022-01-02T10:47:49.298000+00:00",
        "attachments": null
    }
]