[
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Personally, I love fixed size stack space. Especially, when it fits exactly 5 4K memory pages (compatibility with 16K memory pages would be even better).\n\nAnyway,\n\u003e The PUSH gas cost does get more complex, but all stack overflow checking goes away\nI'm guessing you meant \"any instruction pushing to stack more than consumes\" gas cost get more complex. Fair, but you don't need to check stack overflow for any other instruction. So you traded the stack overflow check for additional gas rule. This is harder do justify.",
        "created_at": "2022-07-13T13:08:00.526000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I get that.  But for most machines the stack can take as much space as memory.   And it's a pain that recursive algorithms can't just go as deep as the user can afford to make them go.",
        "created_at": "2022-07-13T13:10:29.890000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e So you traded the stack overflow check for additional gas rule. This is harder do justify.\nTrue.  The rule can be simpler than for memory, since only PUSH grows the stack. We have to check gas for PUSH anyway, and the amount PUSH needs is a simple function of how deep the stack already is.  So a few lines added and a few taken away.",
        "created_at": "2022-07-13T13:14:18.755000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Basically, this makes the stack much more like the traditional one that grows from one end of memory while the heap grows from the other.",
        "created_at": "2022-07-13T13:15:42.816000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "No, there are more: `ADDRESS`, `CALLER`, `TIMESTAMP`, etc. Also `DUP*`. The DUPs are the worst. They can cause both stack overflow and underflow.",
        "created_at": "2022-07-13T13:16:01.047000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah, I see the tradeoffs.  Would it work to just keep the maximum stack size as a state variable and use it instead of 1024?",
        "created_at": "2022-07-13T13:18:54.066000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So miners can decide what the stack limit is? That's horrible 🙂 I want to know the values so I can design software for these. Otherwise I'm playing estimation game.",
        "created_at": "2022-07-13T13:22:37.372000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It's always a guess whether there will be enough gas to run a program to completion.",
        "created_at": "2022-07-13T13:24:03.189000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But yes, you can write code that you know will not overflow stack now, with some effort.",
        "created_at": "2022-07-13T13:24:49.630000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But you have the same gas cost problem with memory already: a program might need a big data structure that is unaffordable.",
        "created_at": "2022-07-13T13:28:06.372000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I meant EVM implementation. I don't care about EVM users. 😈",
        "created_at": "2022-07-13T13:28:43.633000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm not sure this is a good idea.  It's just that from a users point of view it's a pain to be bouncing up against hard limits on stack.",
        "created_at": "2022-07-13T13:28:44.878000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I love users.",
        "created_at": "2022-07-13T13:29:35.774000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Breakfast.  Then two hours of meetings.  Thanks for the feedback.",
        "created_at": "2022-07-13T13:32:28.985000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e \u003e The PUSH gas cost does get more complex, \u003e but all stack overflow checking goes away\n\u003e ...  there are more: ADDRESS, CALLER, TIMESTAMP, etc. Also DUP*. The DUPs are the worst. They can cause both stack overflow and underflow.\nIn the Yelllow Paper every instruction is specified as if it first removes some number of items from the stack and then adds some back.  Those specs can be used at validation time to prevent underflow.  So I still say that all stack checking code can go away, and that's a win.  But the gas cost of making the stack bigger does become dynamic.  The implementation doesn't seem too difficult -- calculate the new stack pointer the same as ever.  Compare it to the high-water mark for the stack and charge more gas if it's higher.  Check for OOG the same as ever.",
        "created_at": "2022-07-13T19:46:54.472000+00:00",
        "attachments": null
    }
]