[
    {
        "author": "async0295",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hi, I am reviewing EIP-4399 and have a question about an attack vector. In the security considerations section it says:\n\n\u003e The beacon chain RANDAO implementation gives every block proposer 1 bit of influence power per slot. Proposer may deliberately refuse to propose a block on the opportunity cost of proposer and transaction fees to prevent beacon chain randomness (a RANDAO mix) from being updated in a particular slot.\n\u003e \n\u003e An effect of proposer’s influence power is limited in time and lasts until the first honest RANDAO reveal is made afterwards. This limitation does also exist in the case when proposers of n consecutive slots are colluding to get n bits of influence power. Simply speaking, one honest block proposal is enough to unbias the RANDAO even if it was biased during several slots in a row.\n\u003e \n\u003e Additionally, semantics of the PREVRANDAO (0x44) instruction gives proposers another way to gain 1 bit of influence power on applications. Biased proposer may censor a rolling the dice transaction to force it to be included into the next block, thus, force it to use a RANDAO mix that the proposer knows in advance. The opportunity cost in this case would be negligible.\n\nI just want to make sure I understand this correctly. Suppose a proposer is selected for 2 consecutive blocks. Prior to their first block, they place a large bet in a lottery game that relies on `block.prevrandao` to generate pseudorandomness. Since the proposer controls 2 consecutive slots they can explore 4 possible outcomes of the value that relies on `block.prevrando` and propose whichever is most advantageous to their profit.  This could mean that they do not propose a block in slot 1 and do propose a block in slot 2 or vice-versa. \n\nIs this a correct understanding of how a proposer might gain influence in an application using `PREVRANDAO`?",
        "created_at": "2022-06-26T01:02:37.455000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, this is pretty much correct. Validators can affect `PREVRANDAO` return value by refusing to propose a block plus censor transactions as long as they are eligible to propose in a slot, the more consecutive slots they are chosen to propose in the more reveal and censorship power they have.\n\nFrom RANDAO perspective *PREV* is the weak part in `PREVRANDAO`. If it was `RANDAO(n)`, where `n` is a slot number, the scheme would be more restrictive for potential attacker.",
        "created_at": "2022-06-26T07:30:31.655000+00:00",
        "attachments": null
    },
    {
        "author": "async0295",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "From the author himself! Thanks for the reply! Can you expand on your last statement? It’s my understanding that ‘block.prevrandao’ is able to be accessed in a deployed contract but ‘block.randao’ is not. \n\nAnother question for you. In the tips for developers section of the EIP the example uses a lookahead of 4 epochs. Are you aware of any literature that examines the security of using a shorter or longer lookahead?",
        "created_at": "2022-06-26T16:22:26.376000+00:00",
        "attachments": null
    }
]