[
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I guess I don't have super strong opinion either direction, but to argue the other side - i don't see why this distinction is all that important. Looking at how this would be handled in geth, it is more work to validate the init code in the txpool than it is to allow users to send txs with invalid init code and charge them\n\nfurthermore, my general take is that imo transaction validity is a mechanism to deal with denial-of-service attacks and therefore we should keep that interface as simple and straightforward as possible. Creating txs that attempt to deploy invalid EOF containers are not DDOS concerns (as long as the gas prices are appropriate) because they are authorized by the user. Other checks in txpool help keep nodes from propagating txs which either i) are replays or ii) can't afford to go into the chain and therefore just take up bandwidth. I don't think either of these cover the invalid EOF initcode scenario",
        "created_at": "2022-11-30T18:09:28.196000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I would be more comfortable if there were an explanation why retaining the \"consistency\" is important at the vm level",
        "created_at": "2022-11-30T18:11:29.792000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is not super important to me.",
        "created_at": "2022-11-30T18:24:09.514000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In that case, I think I would prefer to allow invalid EOF initcode in txs and charge them the standard intrinsic costs",
        "created_at": "2022-11-30T18:44:58.440000+00:00",
        "attachments": null
    }
]