[
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!425279588009246720\u003e , \u003c@!275684146658148352\u003e, \u003c@!425274498732916736\u003e  I'd really like to move https://eips.ethereum.org/EIPS/eip-4200 to CFI.  As I said on the Magician's thread , \"It’s very easy to implement, has been implemented, tested, timed, and discussed here and elsewhere to mutual consensus.\"  I can add it to the agenda for tomorrow if there are no objections.\n\nI also think some version of subroutines/functions/procedures can be ready for CFI for Shanghai soon enough.  I'm disinclined to slide those into an upgrade after Shanghai as that could mean another year of delay in getting the EVM to where we have been trying to get it to for six years now.",
        "created_at": "2022-02-17T20:57:49.663000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I agree that static jumps is a big step towards where we want to be at, and with discussions within Solidity this was also reaffirmed. It does needs to be implemented in Solidity too properly (we have some preliminary implementation) so that we can show accurate differences (in terms of code size / deployment gas and runtime gas on representative samples, like uniswapv2).",
        "created_at": "2022-02-17T23:24:06.501000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Sounds good.  My impression is that we don't need to get that far for CFI.",
        "created_at": "2022-02-17T23:26:44.997000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "FWIW, I think we also need to consider everything else when deciding what to put in CFI (otherwise it doesn't really mean anything...). On the last call, there seemed to be a consensus towards fee-reducing efforts \u0026 beacon chain withdrawals (see: https://github.com/ethereum/pm/issues/450#issuecomment-1030197796). \n\nI agree with Axic's next steps, but I think it's unlikely this gets moved to CFI tomorrow given the two other proposals are still in much earlier stages and it'd be helpful to know exactly what we're committing to before making further commitments for Shanghai.",
        "created_at": "2022-02-17T23:30:53.172000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "OK.  My impression is that Shanghai could be as much as year away, and the upgrade after that could be another year.  I'd like to start getting toward some consensus that we want some version of the proposals on the table in the future.  Shanghai would be better for me, and I suspect others, given how many years have already been invested.  Either that or an upgrade very soon after Shanghai for EVM changes that doesn't get crowed out by other stuff.  At this point I fear the community does not expect to ever see progress on the EVM.",
        "created_at": "2022-02-17T23:37:45.325000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Right, I understand what you're saying. I think the answer to \"do we want this\" is obviously \"yes\", but the harder question is \"is this the most important thing we want, now?\", and to that question, it seems like the answer was roughly \"lower l2 fees + beacon chain withdrawals\".  The challenge here is that we don't know how the priorities will change when Shanghai is closer to done, so it's hard to commit to an EVM fork right after Shanghai, because there might be something more important at that point. \n\nThat said, it's worth noting that 3540 and a handful of others were clearly highlighted as a huge priority recently given they are, right now, the only CFI EIPs.",
        "created_at": "2022-02-17T23:43:58.255000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I hear you, I just fear that there will _ always_ be something more important.  We've talked for a year or more about an  EVM-only fork for that reason.  A lot of the people working on the EVM aren't on the critical path for other EIPs, and it's technically independent, so to a large extent it needn't delay other stuff much.  And slipping it in piece by piece could take a long time .",
        "created_at": "2022-02-17T23:52:43.909000+00:00",
        "attachments": null
    }
]