[
    {
        "author": "0xkitsune",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I was curious, why is it that there are specific global variables that the EVM can access and others it can not? For example, you can access the `blockHash` on chain but not the `transactionsRoot`? I ran into a situation where it would have been very beneficial to validate if a tx was included in a specific block on chain. \n\nWhy isnt more of the blockHeader's information like the `transactionsRoot` accessible on chain?",
        "created_at": "2022-03-29T02:42:36.994000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think to limit complexity.  With blockhash, you can prove any other part of the header so the only advantage to direct access would be gas cost reduction for that operation, so it ultimately is a \"gas vs complexity\" tradeoff and we generally side on lower complexity in those cases.",
        "created_at": "2022-03-29T04:26:05.913000+00:00",
        "attachments": null
    },
    {
        "author": "jlokier",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There isn't much point in making `transactionsRoot` available. You can't do much with it except verify the block body (list of txs) as a whole. You can't use it to determine if a particular tx is included in a specific block.",
        "created_at": "2022-03-29T04:33:12.149000+00:00",
        "attachments": null
    },
    {
        "author": "0xkitsune",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "How would you prove any other part of the header? Wouldnt you have to pass in the entire block header and hash it?",
        "created_at": "2022-03-29T04:33:13.986000+00:00",
        "attachments": null
    },
    {
        "author": "jlokier",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Some of the fields available to the EVM are parts of the header which are independent of which txs are included in the block.  Other fields in the header are not known at tx execution time.",
        "created_at": "2022-03-29T04:35:18.202000+00:00",
        "attachments": null
    },
    {
        "author": "0xkitsune",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah true, it would be limited to validation but I think that having the ability to validate a tx happened and the contents of that tx would be valuable. \n\nNot sure when you would use things like difficulty or coinbase on chain (maybe there is a strong use, I just havent come across one)",
        "created_at": "2022-03-29T04:37:04.645000+00:00",
        "attachments": null
    },
    {
        "author": "0xkitsune",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes I saw those opcodes when researching potential approaches for how to get the transactions root.",
        "created_at": "2022-03-29T04:37:33.038000+00:00",
        "attachments": null
    },
    {
        "author": "jlokier",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Difficulty is typically used as a (slightly dodgy) source of quasi-random numbers.",
        "created_at": "2022-03-29T04:37:48.531000+00:00",
        "attachments": null
    },
    {
        "author": "0xkitsune",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ive never actually seen that used as a source of randomness because its predictable with enough effort. That alongside any other block header property for randomness as well.",
        "created_at": "2022-03-29T04:40:16.814000+00:00",
        "attachments": null
    },
    {
        "author": "jlokier",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "https://eips.ethereum.org/EIPS/eip-4399\n\u003e \"Given prior analysis on the usage of `DIFFICULTY`, the value returned by the instruction mixed with other values is a common pattern used by smart contracts to obtain randomness.\"",
        "created_at": "2022-03-29T04:41:35.260000+00:00",
        "attachments": null
    },
    {
        "author": "0xkitsune",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Huh interesting, ill have to check this out, thanks for linking this.",
        "created_at": "2022-03-29T04:42:34.850000+00:00",
        "attachments": null
    },
    {
        "author": "0xkitsune",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As far as getting the transactions root, the only way im aware of is to pass all the necessary parts of the header that you can't get on chain and hash them. Is there any other way that might be more efficient than passing a ton of calldata? (I get the feeling that its the only way)",
        "created_at": "2022-03-29T04:43:23.306000+00:00",
        "attachments": null
    },
    {
        "author": "jlokier",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Another reason old `transactionRoot` values aren't readily available is because a tx is not supposed to depend on intimate knowledge of exactly what other txs are being executed that it has no connection with, no knowledge of.  If you want to know about a _particular_ contract that you know about being called, it's reasonable to store a flag or counter in the contract's state. But getting (or verifying) a complete list of _everyone's_ unrelated transactions that are executed at any point in time seems like more than an EVM contract should be depending on.",
        "created_at": "2022-03-29T04:48:12.870000+00:00",
        "attachments": null
    },
    {
        "author": "0xkitsune",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah I see what you are saying. By a complete list of everyones transactions are you just referring to the transactions root? You mentioned a list but I figured you didnt mean that literally.",
        "created_at": "2022-03-29T04:58:58.765000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes.  This is possible though.",
        "created_at": "2022-03-29T05:01:08.945000+00:00",
        "attachments": null
    },
    {
        "author": "jlokier",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I meant that using `transactionsRoot` for something useful implies doing something with the tx list of a block, probably to verify it after obtaining it by some other means.",
        "created_at": "2022-03-29T05:01:36.072000+00:00",
        "attachments": null
    },
    {
        "author": "0xkitsune",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, I have already run some tests by passing the parts of the header in as calldata, its just the calldata is very large which would make the call very expensive",
        "created_at": "2022-03-29T05:01:50.694000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Also, keep in mind that anything we add to the EVM is extremely hard to remove.  If clients stop retaining historic transactions contracts break.",
        "created_at": "2022-03-29T05:01:59.296000+00:00",
        "attachments": null
    },
    {
        "author": "0xkitsune",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Doesnt the blockchain already store the transactions root though? Or does that not directly translate to the EVM?",
        "created_at": "2022-03-29T05:02:37.621000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Or if we switch to some sort of inclusion and availability proof system not all clients may have all transactions.",
        "created_at": "2022-03-29T05:02:55.739000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It does currently, but maybe in the future we won't.  Everything we add to the EVM reduces the set of options we have for future chain design changes.",
        "created_at": "2022-03-29T05:03:29.634000+00:00",
        "attachments": null
    },
    {
        "author": "0xkitsune",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ok got it, I understand what you are saying.",
        "created_at": "2022-03-29T05:03:32.510000+00:00",
        "attachments": null
    },
    {
        "author": "0xkitsune",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Got it, thats something I didnt think about before, thanks for the insight.",
        "created_at": "2022-03-29T05:04:04.755000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "All of this is to say that your suggestion isn't a *bad* idea, but historically it has not met the necessary bar to offset all of the related costs associated with implementing it.  A lot of design decisions come down to stuff like this.",
        "created_at": "2022-03-29T05:08:57.405000+00:00",
        "attachments": null
    },
    {
        "author": "0xkitsune",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "All good, I was more interested in why it was not accessible rather than having it become accessible. I definitely gained some insight regarding  accessibility of block header information on chain so thanks for the info!",
        "created_at": "2022-03-29T05:11:17.929000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We are hoping to move (eventually) to SSZ blocks (rather than RLP).  This, along with verkle trees, would make proofs of stuff like this much smaller.  To prove that a particular transaction is in a block with hash X and that block is somewhere in history, you would need a relatively small proof.",
        "created_at": "2022-03-29T05:18:15.270000+00:00",
        "attachments": null
    },
    {
        "author": "0xkitsune",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Very interesting, well ill have to keep my ear to the ground in the discord server to keep updated on this. Sounds awesome!",
        "created_at": "2022-03-29T05:21:26.837000+00:00",
        "attachments": null
    },
    {
        "author": "jwasinger",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I did some analysis of selfdestruct usage as a follow-up from the last analysis (https://nbviewer.org/github/adompeldorius/selfdestruct-analysis/blob/main/analysis.ipynb), which was written before the London hard-fork.\n\nMy analysis looks at post-london chain data and identifies some large ether holding contracts that should be looked at if we end up disabling selfdestruct through https://github.com/ethereum/EIPs/pull/4758.\n\nThe analysis is here:   https://github.com/jwasinger/eth-selfdestruct-analysis",
        "created_at": "2022-03-29T07:20:34.234000+00:00",
        "attachments": null
    },
    {
        "author": "jwasinger",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "one thing that would be really useful for me is getting a way to look at the value of ERC20 balances for a given address.  I'm wondering if anyone knows of an API that can do this?",
        "created_at": "2022-03-29T08:21:52.964000+00:00",
        "attachments": null
    },
    {
        "author": "sendmoodz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "could you maybe use a bloom filter of set storage slots for an account that is always loaded to avoid the reads in most cases?",
        "created_at": "2022-03-29T14:57:33.542000+00:00",
        "attachments": null
    },
    {
        "author": "sendmoodz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "this way reading slots with 0 values could be 100 gas",
        "created_at": "2022-03-29T14:58:03.101000+00:00",
        "attachments": null
    },
    {
        "author": "jlokier",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Loading one bloom filter entry by itself costs about the same as loading one storage slot by itself, so it's not a saving.  It's free-ish if the implementation always loads a small bloom filter when it loads the account (i.e. inlined into the account record).  But a small filter is only useful if there are only a few non-zero storage slots, and in that case an implementation can inline those storage slots instead, or some other slot index.",
        "created_at": "2022-03-29T15:14:39.752000+00:00",
        "attachments": null
    },
    {
        "author": "jlokier",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Whatever the tradeoffs are made by each implementation, it looks to me like in most cases, a small bloom filter doesn't save I/O reads over a storage lookup for just one read, or even for multiple reads (because they either hit the same cached parts of storage, or the account is large and the filter would need to be large as well).",
        "created_at": "2022-03-29T15:19:12.566000+00:00",
        "attachments": null
    },
    {
        "author": "sendmoodz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "ok yeah i thought a 256-bit bloom filter would be more effective but it clearly fails with a larger number of storage entries https://hur.st/bloomfilter/?n=100\u0026p=1.0E-7\u0026m=256\u0026k= (29% false positive rate for 100 entries in a 2 by 256 bit bloom filter)",
        "created_at": "2022-03-29T15:20:41.623000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The problem with bloom filters is that unless they're implemented with a hash function that incorporates the storer's secret information, a worst-case attacker can make them very ineffective",
        "created_at": "2022-03-29T20:55:35.304000+00:00",
        "attachments": null
    }
]