[
    {
        "author": "eyooo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "thanks danno. you should be correct but that server is pretty much exclusively trolls and spammers. apologize for the off topic discussion",
        "created_at": "2022-10-27T01:06:02.503000+00:00",
        "attachments": null
    },
    {
        "author": "jlokier",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think your questions are mostly generically about Ethereum, not particularly Geth.  Storage hashes belong to individual contract accounts, and don't match block hashes.\n\nStorage hashes are the roots of storage Merkle tries; each storage Merkle trie belongs to one account, and the storage hash is in the account record where it's called `storageRoot`.   Only contract accounts can have a non-empty storage trie; it is always the same empty trie for end owner accounts (i.e. user's accounts).\n\nAll the accounts at a single point in time form an account Merkle trie.  State hashes (not the same as storage hashes) are the roots of account Merkle tries; each account Merkle trie belongs to one block, and the state hash is in the block's block header record where it's called `stateRoot`.\n\nBlock hashes are hashes of block headers (not Merkle tries), and each block header contains the block hash of its predecessor block in the chain called `parentHash` (along with other hashes about the block itself, like `stateRoot` and `transactionRoot`).\n\nYou might find this diagram useful. https://i.stack.imgur.com/afWDt.jpg (from https://ethereum.stackexchange.com/a/6413). All the execution clients hold a data structure equivalent to this in their databases, though there are many different ways they encode it for speed and space optimisation.  In Geth, I think it is stored differently depending on whether the snap or non-snap databases are being used:",
        "created_at": "2022-10-27T17:04:17.821000+00:00",
        "attachments": null
    },
    {
        "author": "eyooo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "thank you so much jamie",
        "created_at": "2022-10-27T17:09:07.347000+00:00",
        "attachments": null
    },
    {
        "author": "eyooo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "appreciate all you guys very much, this has been great info",
        "created_at": "2022-10-27T17:09:15.851000+00:00",
        "attachments": null
    }
]