[
    {
        "author": "perelyn",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks, it is helpful. Although I'm not math inclined so I'll skip those parts",
        "created_at": "2022-10-17T00:00:21.920000+00:00",
        "attachments": null
    },
    {
        "author": "jlokier",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If you're comfortable reading a lot of code and prefer a code description, I would actually suggest reading one or two of the EVM implementations in your preferred languages. Most parts are fairly clear, if long: They are bytecode interpreters and most opcodes are fairly simple, almost explain themselves. Some obscure corner cases aren't so obvious but there's usually a reference to the appropriate EIP. If you want to understand the EVM as a bytecode stack machine, I suggest don't get drawn into the details of the storage database or Merkle tree implementation, because those are almost separate to the EVM itself, and their implementations are complicated for performance reasons.  On the other hand, if you like database performance optimisation, they are the more interesting part 🙂",
        "created_at": "2022-10-17T00:10:45.447000+00:00",
        "attachments": null
    },
    {
        "author": "perelyn",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Awesome, thanks for the guide",
        "created_at": "2022-10-17T06:49:37.090000+00:00",
        "attachments": null
    },
    {
        "author": "jwasinger",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "what's the best bytecode-\u003eopcode/mnemonic tool that works locally?  I've been using etherscan's bytecode to opcode disassembler in-browser tool previously.  but it's not compatible with what I'm working on rn.",
        "created_at": "2022-10-17T21:56:00.119000+00:00",
        "attachments": null
    },
    {
        "author": "jwasinger",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "looking for something that's bare-bones simple.  I don't need anything fancy.  I just need a human-readable list of opcodes from an EVM bytecode string",
        "created_at": "2022-10-17T21:57:29.466000+00:00",
        "attachments": null
    }
]