[
    {
        "author": "abcoathup",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "https://twitter.com/leonardoalt/status/1600845724618326016",
        "created_at": "2022-12-09T08:12:46.179000+00:00",
        "attachments": null
    },
    {
        "author": "holgerd77",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I am still confused/unclear about what makes up for a new EOF version, triggered thinking about this again after stumbling upon this post from the new Cancun Magicians thread https://ethereum-magicians.org/t/cancun-eip-consideration/12060/2 and I couldn't really answer the version question on this one respectively give the rationale (although I deem to remember from ACD from yesterday from the chat or somewhere that someone said that this wouldn't trigger the need for a new EOF version).\n\nFrom my own thinking I would assume that every new opcode (or opcode behavioral change) would now trigger a new EOF version, this would be based on the assumed loose definition of an EOF version that \"all bytecode sequences within an EOF version should be assured to behave the same over time\" (or similar, just came up with this).\n\nIf this is not the case respectively the above definition is wrong: could someone clarify what *is* actually the defined behavioral scope of an EOF version? I guess this would be generally beneficial to have some clear view on this (feel free to point me to something if already discussed/written down as well).\n\nThanks a lot! 🙂",
        "created_at": "2022-12-09T10:12:14.278000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "grafik.png",
                "content": "cbaec9efef1565f25b129ba639d23a9f4c5738c2b648155ed7ccf73cb137f285"
            }
        ]
    },
    {
        "author": "ajsutton",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "A new opcode wouldn’t need a new version because no EOF code can use an invalid opcode and so the new opcode is known to not be used.",
        "created_at": "2022-12-09T10:14:40.441000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It’s the upfront validation that means a greater range of changes can be made to the EVM without it affecting existing code (because any code that would be affected would have been invalid and thus rejected)",
        "created_at": "2022-12-09T10:15:55.138000+00:00",
        "attachments": null
    },
    {
        "author": "holgerd77",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ah ok, that makes a lot of sense, thanks for jumping in so quickly 👍.\n\nAm I right with the assumption (I have right now) that *every* gas cost change we do on an opcode *would* make up for a new EOF version from EOF-deployed onwards?",
        "created_at": "2022-12-09T10:17:40.038000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I’ll have to leave that one for people who know it better.",
        "created_at": "2022-12-09T10:19:06.613000+00:00",
        "attachments": null
    },
    {
        "author": "holgerd77",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks, yeah, it would really help if someone (who knows it better) could chime in with a generic definition for an EOF version.\n\n(I think it would be beneficial to also add this to the EIP-3540 specification https://eips.ethereum.org/EIPS/eip-3540 directly)",
        "created_at": "2022-12-09T10:25:56.827000+00:00",
        "attachments": null
    },
    {
        "author": "marioevz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This had me so confused until you put it this way, makes a lot of sense. I was worried about 4844 new opcode but not anymore.",
        "created_at": "2022-12-09T15:56:52.164000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e Am I right with the assumption (I have right now) that every gas cost change we do on an opcode would make up for a new EOF version from EOF-deployed onwards?\n\nGas costs are not part of the semantics of an opcode so I don't see why a new version would be needed.",
        "created_at": "2022-12-09T16:06:54.567000+00:00",
        "attachments": null
    },
    {
        "author": "yperbasis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "From EIP-4200: \"Note: EIP-3670 should reject PC\". I find this confusing. I suggest to either update EIP-3670 to reject `PC` or remove this note from EIP-4200.",
        "created_at": "2022-12-09T16:42:42.205000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "with EOF we move from a 1D (fork) rules set to a 2D rule set (eof_version, fork) -- so things like gas costs would generally change based on fork, not eof_version. It's possible that we could update eof_version _every_ fork so that you only need the eof_version to know the rules set, but I think the consensus so far is to not do that",
        "created_at": "2022-12-09T17:25:09.347000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My expectation is that only _removing_ valid behavior requires an EOF version change.  Adding new opcodes expands what is valid but does not make what was once valid now invalid.  Removing an opcode does create suddenly invalid EOF.",
        "created_at": "2022-12-09T17:38:41.329000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So my expectation is that there may be EOF code that is invalid in Shanghai but is valid in Cancun, because it uses a new opcode.",
        "created_at": "2022-12-09T17:39:26.641000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Before I go too deep down the re-write path, is the container structure in https://notes.ethereum.org/@ipsilon/eof1-unified-specification \"final\"?",
        "created_at": "2022-12-09T19:41:02.325000+00:00",
        "attachments": null
    }
]