[
    {
        "author": "0xbosky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I hope this is the right channel to address a smart contract question. My question relates to a a smart contract created by a contract factory. \n\nDo contract created by a smart factory pull the latest github code ?",
        "created_at": "2022-03-08T06:24:49.179000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This isn't the right Discord server for such questions.  You may want to try https://discord.gg/9UEshRmv",
        "created_at": "2022-03-08T06:30:51.349000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "How do people feel about a new EOF format that is ZK proof friendly (no backward jumps)?  I feel like we should start working toward a world where we have a ZK provable blockchain, and IIUC backward jumps are a pretty significant problem for ZK proofs (someone else may know more).",
        "created_at": "2022-03-08T06:50:42.789000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Now that we have a validation phase it would be straightforward to ensure that bytecode is ZK-friendly, or meets any other constraint, so long as the validation is of near-linear complexity.  I think all that EOF would require is a table indicating what levels of validation each code sections meets.",
        "created_at": "2022-03-08T17:22:45.049000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Note that someone would need to propose this, and it's not an EIP I want to champion (yet).  We are looking at the upgrade after the upgrade after Shanghai before this could go in, so no hurry.",
        "created_at": "2022-03-08T17:55:20.280000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "A way to deal with constraints that are to hard to validate might be for the EOF to carry proofs of code section validity, where producing the proof is hard, but verifying it is easy.",
        "created_at": "2022-03-08T17:55:24.485000+00:00",
        "attachments": null
    }
]