[
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The stack height invariant is valuable for future proofing, it  allows for linear time transpilations.  So if we go to EOFv2 and have a standard transformation from v1 to v2 we can immediately sunset v1 on chain and then convert them to v2 on first use or in the background.  Three versions on chain (legacy+2 EOFs) is a no-go.",
        "created_at": "2023-06-30T14:17:19.322000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I understand the linear time issue, the strategy I provided above should allow you to analyze/compile/transpile code in linear time without the stack height invariant",
        "created_at": "2023-06-30T15:38:17.916000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We need to consider malicious code.  If compiler bombs are possible we need to plan that some troll will do it for the lulz",
        "created_at": "2023-06-30T15:38:55.870000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My understanding is that without the invariants compiler \"bombs\" can be written that are O(n^2) or worse.",
        "created_at": "2023-06-30T15:39:38.266000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "IIRC JVM and .net have the invariant, based on discord discussions when the invariant was first proposed.",
        "created_at": "2023-06-30T15:40:50.098000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "no, i'm pretty sure you can out-line code for a small runtime cost",
        "created_at": "2023-06-30T15:54:04.224000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i'm like 95% sure about this but not positive as i haven't written out the implementation - can maybe write out a PoC with \u003c@425274498732916736\u003e as we were mentioning on the call",
        "created_at": "2023-06-30T15:55:00.281000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e i think having a single, global code section will result in better optimization opportunities\n\nThis was the approach of 2315.  But both 2315 and EOF depend on stack validation to ensure that functions are called with the correct number of arguments and return the correct number of arguments.",
        "created_at": "2023-06-30T15:58:58.457000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "For 2315 \"correct\" means \"everywhere the same.\"  For EOF it is the stronger \"as specified in the header.\"",
        "created_at": "2023-06-30T16:00:59.304000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "right i mean i'm sure they do, but they also don't really care about bytecode size afaict. probably wasm cares more about bytecode size, but they also don't have a hard limit like we do. (JUMPFI and CALLFI would solve the bytecode size issue though)",
        "created_at": "2023-06-30T16:03:53.179000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think those instructions would be OK.  I've also suggested that functions could be organized into modules, and that within a module relative jumps should be allowed to cross functions boundaries so long as the stack remains valid.",
        "created_at": "2023-06-30T16:06:02.828000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And I'm 100% certain that the invariant is needed to allow for linear-time validation of code . (Or any analysis that requires traversing the control flow graph.)\n\nThe simplest case to consider is a loop.  If the stack is not the same after an iteration then you  have to traverse the code again with the new stack - the validator will not stop when it should.",
        "created_at": "2023-06-30T19:30:34.386000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is particularly obvious when the loop represents a block with typed local variables in the source language.  Every interation of the loop would look like a new block of code with a different set of typed locals.",
        "created_at": "2023-06-30T19:33:46.041000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Function calls follow the same rules as any other function --  the stack invariant holds.  EIP-2315, EIP-615, and EOF require a stronger condition -- at every call to a given function the stack invariants are the same.  And for EIP-615 and EOF every function call must also conform to its specified  interface. \nSo these conditions are pretty",
        "created_at": "2023-06-30T19:44:16.878000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And yes, these conditions hold for Solidity, Wasm, Java, Pascal, C, and many more.",
        "created_at": "2023-06-30T19:45:49.080000+00:00",
        "attachments": null
    }
]