[
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My concern is it would make gas charges within a transaction depend on the other transactions within the same block.  This would degrade the developer experience as there would be a new way for gas charges to become variable.",
        "created_at": "2023-03-20T01:29:21.688000+00:00",
        "attachments": null
    },
    {
        "author": "greenforer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But, if developers assume that all first accesses within the context of the transaction are cold (as they currently are), that shouldn't be an issue, right? You're guaranteed it will at the worst be as expensive as before (in respect to accesses), but a lucky transaction can get extra saves",
        "created_at": "2023-03-20T11:42:41.720000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There is also MEV, block construction, and tracing/replay to worry about, not just developers.  I would want to see a compelling reason to make all those parties lives more complex to support this, other than \"saves gas for defi.\"  I think the complexity imposed on these downstream users imposes a high burden of need on the proposal.  Since 2929 was initially implemented to address security and stability issues then I would expect a good reason to change it would also address security and stability.",
        "created_at": "2023-03-20T14:23:33.829000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e  the current suggestion for all changes\n\nJust to be clear, this would be the set of changes proposed for Cancun, right? If so, probably worth explicitly covering on the next ACD",
        "created_at": "2023-03-20T18:35:57.889000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We have an evm implementors call wednesday and will have a better feel then,\n\nAs far as I know single step or two step EOF are both viable options and IMHO would depend on the desired schedule for Cancun.  My view is that SSZ transactions are what is driving that part and that most of the devs are a somewhat orthagonal group between those two tasks.",
        "created_at": "2023-03-20T23:53:30.350000+00:00",
        "attachments": null
    }
]