[
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Quick summary of how I feel about flags.  The three proposed flags I don't find compelling to add to the spec, as (a) it has no impact on an interpreter and (b) a compiler analysis will figure this out.  There is the corner case where a JUMPF calling into a non-returning function could bypass the stack return size checks.  That may be worth discussiong when JUMPF comes back.\n\nWhat I do find compelling, however, is using the flags to say \"this function is used in initcode\" and (not mentioned on the call) \"this function may be used during Account Authorization (for account abstraction)\"\n\nSo, repacking type information into 4 bytes, 8 bits for flags, 7 each for inputs and outputs, and 10 for total stack height, is something I would support.  Just right now we should be stingy with what we allow to be flagged.  And in the Cancun spec I don't think we should add any and keep them all reserved.",
        "created_at": "2023-02-23T00:00:29.014000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Unless JUMPF returns.",
        "created_at": "2023-02-23T00:01:07.221000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Oh we'd like to bring JUMPF back with adding the non-returning flag. Sorry could have made it clearer.",
        "created_at": "2023-02-23T00:03:15.862000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I personally lean towards the 4-byte packed option, but do have a slight aversion because it is packed and nothing else is packed in EOF.",
        "created_at": "2023-02-23T00:03:46.061000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Considering we charge _per byte_ for initcode and storage, byte packing will reduce the per-function overhead.  And I think we want that barrier as low as possible.  It is the first time, but I think it's warranted.",
        "created_at": "2023-02-23T00:04:33.237000+00:00",
        "attachments": null
    }
]