[
    {
        "author": "zcstarr",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I guess why is it problematic that a contract copies arb data from a contract, owned or not owned?  In theory I think there's a benefit that all the contract code is available for read/ consumption from any context, by any contract . \n\nI'm not sure about the benefit of limiting reads or adding access control mechanism to reading contract code from a smart contract, do you have any thoughts on what those benefits are or is it to just restrict access to smart contract data from other smart contracts . Seeing as it's read data and not write it doesn't seem to be a sec risk to read the code segment 🤔",
        "created_at": "2023-04-11T00:10:19.003000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I could see zkevm or other transpiled optimizations where if data isn't accessed in a way that escapes the function it doesn't write it out to however it handles it.",
        "created_at": "2023-04-11T00:33:27.490000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If we are wrong, extdatacopy can be added in a follow on fork, but it can never be taken out once added.  Since data contracts can still serve data without the opcode to me it seems like the more prudent course.",
        "created_at": "2023-04-11T00:36:10.141000+00:00",
        "attachments": null
    },
    {
        "author": "zcstarr",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Not sure what you mean by escapes the function that it doesn't write it out to? \n\nI think alot of the benefit of extcodecopy atm is tied to  gas cost reduction, especially because nodes tend to limit requesting response gas, so if you were to read the data in other ways, alot of ecosystems will simply not return the data. \n\nFrom a dapp ecosystem perspective, higher read gas consumption becomes difficult to deal with. It might push developers into using different RPC providers or eating client side RPC consumption cost by requesting data from cap less rpc providers. That in turn nudges request behavior from being generally replicable. It might make some of the data generally only accessible with RPC providers that have higher caps. On l2s or alt nodes it can be tricky to know where providers place those gas caps, can't remember what geth defaults to... .   I think for example Infura is one of the node providers that has a cap on gas consumption that's easy to hit when dealing with returning data from data contracts.\n\nFrom the developer side it looks like a failed view transaction, RPC nodes will just terminate the request",
        "created_at": "2023-04-11T15:25:03.454000+00:00",
        "attachments": null
    },
    {
        "author": "zcstarr",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "just also an aside people using this pattern include NounsDAO and artblocks, to name some of the larger users of this functionality",
        "created_at": "2023-04-11T15:38:44.183000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Do you have concrete examples of how this would change?  How much data does nouns read per call?  how many reads?  The memory expansion will dominate any extra per-call unless you are doing something crazy like copying an entire 24k contract word by word.",
        "created_at": "2023-04-11T19:24:57.488000+00:00",
        "attachments": null
    },
    {
        "author": "zcstarr",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It's unclear, I pinged who I know at Nouns earlier this morning to bring it to their attention, and to more of the onchain community at mathcastles here https://discord.com/channels/885696225796571136/898735608049061918 as well, so I've been bringing up the EOF changes as well to get more eyes on what's changing or what is up for change.  I know Nouns has nouns builder which presumably launches new data contracts for peoples data, I know the folks at indeliblelabs use it in approximately 2k chunks I think to create generative art layers for generative onchain nfts. \n\nI think one thing that would be useful helpful would be a shortlist of how data contract access, will  change or is up for changing.  I think it's still unclear how it'll change. I think most people would be happy with the eip-3540 current proposal where you put in the magic number, and then first 20bytes is a signal that it's data contract, it's up to you to copy the rest past the 20 bytes or whatever you need, without a restriction on what data you could request to copy.  I'm sure there are other people that use this technique for other types of write once cheaper immutable storage.\n\nIs there a list or summary of the data contract proposals, impact from EOF. For things like can no longer use extcodecopy for retrieving arb. data from a contract. Extdatacopy is available for use, or Extcodecopy will revert on data contracts...",
        "created_at": "2023-04-11T20:03:56.347000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The size of EXTCODECOPYs and the total number per ETH_CALL would be the stats we need.  Not that datacopy _within_ a contract is still avout the same price, so if you lock in stuff like your pool pairs as smart contract constants that won't be impacted.",
        "created_at": "2023-04-11T20:27:55.908000+00:00",
        "attachments": null
    }
]