[
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ok.  So for rjumpv let's keep it consistent.  It's always the entire imemdiate argument, regardless of size.  Smaller than most memory dumps anyway 😉",
        "created_at": "2023-04-25T02:50:10.249000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That also frees the tracer from having to re-evaluate the operation in those two cases",
        "created_at": "2023-04-25T02:50:40.660000+00:00",
        "attachments": null
    },
    {
        "author": "purplehat.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@543900561460822016\u003e Not sure the best place to hash this out, PLMK if Discord is better than the Forum – sharing here https://ethereum-magicians.org/t/evm-object-format-eof/5727/57?u=purplehat",
        "created_at": "2023-04-25T20:29:44.321000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "👋  i think either is fine, you'll probably get a faster response in this channel though",
        "created_at": "2023-04-25T20:31:16.892000+00:00",
        "attachments": null
    },
    {
        "author": "purplehat.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Rad – good to know. \n\nCopy-and-pasting then here for discussion and I'll loop back and answer my own question there for broader vis 🙂\n\n---\n\nI was looking into https://notes.ethereum.org/ZOEv9yyHQdmxTVaYiJmy9Q#Modified-Behavior + https://eips.ethereum.org/EIPS/eip-3540#contract-execution and it was a bit unclear to me when the following items from the megathread are targetted for EIP-wise:\n- If the target account of EXTCODECOPY is an EOF contract, then it will copy 0 bytes.\n- If the target account of EXTCODEHASH is an EOF contract, then it will return 0x9dbf3648db8210552e9c4f75c6a1c3057c0ca432043bd648be15fe7be05646f5 (the hash of EF00, as if that would be the code).\n- If the target account of EXTCODESIZE is an EOF contract, then it will return 2.\n\nIs the EIP that this is targeted for still TBD? \n\nIIUC this is not the behavior effective as of EIP-3540 itself based on this section from EIP:\n* `EXTCODECOPY/EXTCODESIZE/EXTCODEHASH` with the EOF *target* contract - works as with legacy target contract\n  * `EXTCODESIZE` returns the size of entire target container\n  * `EXTCODEHASH` returns the hash of entire target container\n  * `EXTCODECOPY` can copy from target’s code section\n  * `EXTCODECOPY` can copy from target’s data section\n  * `EXTCODECOPY` can copy from target’s EOF header\n  * `EXTCODECOPY` can copy entire target container\n  * Results don’t differ when executed inside legacy or EOF contract\n\nHowever, I'm not sure if there are other EIPs targeted for the same hard fork that would have this impact or if that is a later stage, \n\nNot sure if this is better suited to ask here or in the Core Devs Discord, so opted to post here and cross-link in the Discord – my apologies if I missed it in my search here and there is a better place to post this.",
        "created_at": "2023-04-25T20:37:41.842000+00:00",
        "attachments": null
    },
    {
        "author": "purplehat.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Also, unrelated, wanted to understand that this part being struck-through: \n\n\u003e If a DELEGATECALL crosses an EOF\u003c\u003elegacy boundary, then it returns 0 to signal failure (i.e. legacy-\u003eEOF and EOF-\u003elegacy DELEGATECALLs are disallowed).\n\nIs indeed indicative of the line below it being the new expected behavior of:\n\n\u003e DELEGATECALL from an EOF contract to a legacy contract is disallowed, and it returns 0 to signal failure. We allow legacy to EOF path for existing proxy contracts to be able to use EOF upgrades.",
        "created_at": "2023-04-25T20:43:44.044000+00:00",
        "attachments": null
    }
]