[
    {
        "author": "gumb00",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "No, CREATE3 can reference only code in container section of the same contract. CREATE4 can reference only code in initcode data of transaction",
        "created_at": "2023-06-21T09:13:34.745000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Right, so that's the issue I was saying",
        "created_at": "2023-06-21T13:42:38.593000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "One of the objectives that EOF is trying to meet is to remove code observability.  So referencing code in another contract breaks that, unless it was a pure copy of what existed prior to adding more data as part of the constructor call.",
        "created_at": "2023-06-21T17:14:24.441000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So if we kept \"intrinsic\" data somehow separate from \"initcode data\" then we could, in theory, copy any other existing contract and say \"but the extra data (such as tokens for a swap pool) is this instead of what was there before\"  Currently CREATE3 and CREATE4 don't support that.",
        "created_at": "2023-06-21T17:16:09.070000+00:00",
        "attachments": null
    },
    {
        "author": "demiurgos_23",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@539495253418180618\u003e abt Eip4788, is there any spec about how will the CL communicate the BeaconParentRoot to the EL ? or am I missing something in the spec?",
        "created_at": "2023-06-21T18:09:01.753000+00:00",
        "attachments": null
    },
    {
        "author": "purplehat.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e  unless it was a pure copy of what existed prior to adding more data as part of the constructor call\nThis capability itself seems very useful for some use-cases; IIUC the implication here it definitely is for Art Blocks' use case.\n\nOtherwise, I believe we're in a place of just needing to create a \"psuedo-standard\" for contracts that allow you to read their storage via calling a method into the contract that itself calls `DATACOPY` within the correct active container and passes this data along to the method caller. \n\nThis approach is _fine_ but it seems suboptimal from my perspective vs. just exposing this via how these new EOF opcodes work and standarizing this approach across application contracts that make use of the \"contracts as storage\" approach.",
        "created_at": "2023-06-21T18:26:24.506000+00:00",
        "attachments": null
    }
]