[
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We were rehashing the single remaining issue for the current EOF spec for a while. This is when exactly initcode validation should happen and what effects it will have. There are two options what seem individually consistent.\n1. Initcode validation happens just before initcode execution. If it fails it looks like the execution ended with an exception with all consequences: the caller nonce is already bumped and it stays this way, the transaction with invalid initcode is valid and can be included in a block. This works as close as you would execute 0xEF bytecode before EOF.\n2. Initcode validation happens in the CREATE instruction _before_ switching context. Similarly to checking ETH balance or call depth. The caller nonce is not bumped and the transaction is invalid.\n\nThe current spec states 1.\n\nI was a bit in favor of 2 and this is a reason this discussion surfaced at all. But I don't have strong preferences any more.\n\n\u003c@211091239112671234\u003e \u003c@543900561460822016\u003e \u003c@275684146658148352\u003e \u003c@403707149043105803\u003e \u003c@450651770243252225\u003e \u003c@508125616940515329\u003e",
        "created_at": "2023-02-01T17:25:54.495000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "For #2, my first thought was is there enough gas to validate and fail, then I remembered create(2) is 32k out the door.  So create of an invalid eof is very gas efficient.  Other than nonce (non-)bump what are the observable effects?",
        "created_at": "2023-02-01T17:29:13.640000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It was mostly about the nonce IIRC. We have an implementation doing close to 2 and the disagreement was about the nonce value.",
        "created_at": "2023-02-01T17:32:02.293000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Can be also gas difference. In 1 you loose all 63/64 gas, in 2 only the initcode metering cost.",
        "created_at": "2023-02-01T17:33:42.992000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But \u003c@211091239112671234\u003e does not have problems with 2 from the security perspective.",
        "created_at": "2023-02-01T17:34:25.842000+00:00",
        "attachments": null
    }
]