[
    {
        "author": "ben_a_adams",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Increasing contract size; I see as a security thing (once it can safely be supported) as a lower contract size doesn't reduce the amount of code deployed but makes devs do multi-contract deploys or diamond patterns and then opens risk vectors from permissions on inter-contract communication to act as a single contract",
        "created_at": "2024-10-04T02:51:33.385000+00:00",
        "attachments": null
    },
    {
        "author": "daniellehrner",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Totally agreee with that. I was a Solidity dev for a few years and the 24kb limit forces you add much more complexity to already very critical code. I would really urge everybody working on EOF to reconsider and increase the contract size limit directly when EOF goes live. \n\nIt would be a huge milestone for smart contract devs and make EOF one of the most beloved upgrades ever.",
        "created_at": "2024-10-04T08:16:52.344000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Somewhat of a side note, the contract size limit was once introduced (IIRC) for the reason that if a contract gets called, the complete contract code has to be loaded (for JUMPDEST analysis). EOF already gets rid of this analysis. Also, if we have Verkle, then the contract will  be divided up in \"code chunks\" and the verkle witness will only include the parts which a block / transaction touches. So I would naively say for EOF contracts we can raise the contract limits (because we dont have to do JUMPDEST analysis), and with Verkle the witness will only include whatever code parts are touched, so that gives even more reason to raise the limit 🙂",
        "created_at": "2024-10-04T09:12:32.345000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We still have the jumpdest analysis, its just at deploy time now, so there still is some need to limit contract size, maybe not as strictly as we do right now. But imo we can never get rid of the limit altogether",
        "created_at": "2024-10-04T10:59:59.831000+00:00",
        "attachments": null
    },
    {
        "author": "daniellehrner",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Just to be clear, I am not suggesting to remove it completely. But raising it a few multiples from today would already help a lot. After this first increase we can observe the nodes and get real world data and decide if we want to further increase or not.",
        "created_at": "2024-10-04T11:21:21.431000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What would be helpful is a collection of such contracts",
        "created_at": "2024-10-04T11:44:15.660000+00:00",
        "attachments": null
    },
    {
        "author": "daniellehrner",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Do you mean contracts that are too big and need to be split into several parts?",
        "created_at": "2024-10-04T11:56:56.581000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, some examples. The best would be also to have a version before the split.",
        "created_at": "2024-10-04T11:58:21.831000+00:00",
        "attachments": null
    },
    {
        "author": "daniellehrner",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "To be honest I am not sure how to get the before and after.  I can ask around a bit. Maybe I can find some open source contracts on Github \u0026 co with the diff.",
        "created_at": "2024-10-04T12:03:57.841000+00:00",
        "attachments": null
    },
    {
        "author": "daniellehrner",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But I agree it makes sense to collect some data before.",
        "created_at": "2024-10-04T12:04:14.233000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My proposal would be to lift/remove the limit for EOF contracts, as their validation is only required at transaction creation time, or when read from a genesis allocation.  I concur that JUMPDEST analysis makes uncapping legacy EVM unsafe.",
        "created_at": "2024-10-04T14:36:42.533000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "is JUMPDEST analysis cost reflected in EOF contract creation? (i've never fully understood why or when it's a potential DoS vector -- isn't that addressed by correctly pricing it?)",
        "created_at": "2024-10-04T19:32:39.284000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "https://eips.ethereum.org/EIPS/eip-3860#gas-cost-per-word-32-byte-chunk - possibly underpriced for jumpdest analysis because it's just for keccak, but the mis-pricing is a constant multiplier.  Without this it went parabolic.",
        "created_at": "2024-10-04T19:34:57.814000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "re: medium-long term roadmap, what about migration of legacy evm contracts to EOF? is the idea that this should eventually happen?",
        "created_at": "2024-10-04T19:41:39.104000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Should?  long term yes, at least to some zk friendly form.  How is an open question.  I had a rejected DevCon talk that would have outlined one possible way it could be done. May put it onto a hackmd, but I got other priorities first.",
        "created_at": "2024-10-04T20:32:41.130000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i'd be very interested in that!",
        "created_at": "2024-10-04T20:45:59.885000+00:00",
        "attachments": null
    }
]