[
    {
        "author": "big_tech_sux",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "why isn't this an ERC instead of an EIP? like -- there is a convention that metadata goes in the first data section for instance",
        "created_at": "2024-12-07T02:17:47.240000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It's part of the validaed EOF container, so it has to pass through consensus if the header bits are wrong.  What goes in the metadata section would be ERCs as it's opaque to the EVM.",
        "created_at": "2024-12-07T04:22:41.888000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i believe this is discussed in the Motivation section of the EIP no?",
        "created_at": "2024-12-07T04:34:29.575000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e 1. It is not straightforward to distinguish the metadata part in the `data_section`, which poses the same problem as the pre-EOF bytecode.\n\u003e 2. Any change to the metadata's size within the data section will change the executional bytecode, e.g. through shifting `DATALOADN` offsets. With that, two identical contracts with different metadata sizes will not match during source code, since the code will be different.\n\u003e 3. The metadata can theoretically be reached by the code, e.g. via manipulating the `DATALOADN` instructions.\n\nmm i think all of these are kind of solved if there is a convention that the metadata always goes at the end of the data section. and maybe being able to load metadata from code is a feature not a bug! 🤔",
        "created_at": "2024-12-07T04:44:25.756000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "are you suggesting to put the metadata after even the auxiliary data? so the init container would append the metadata after any auxiliary data it needs\n\n\u003c@425046919346257922\u003e can this work?",
        "created_at": "2024-12-07T14:31:57.443000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it only really addresses point 2, and by introducing an annoying fixed deployment cost\n\nthe metadata section remains hard to distinguish and accessible by the code\n\nthe issue with the latter is that you can write a contract whose behavior changes depending on the metadata part. this is not \"clean\"\n\nthere's also an issue where if the developer disables metadata a user of the contract may be able to generate aux data that looks like metadata. not a huge issue because metadata should never be trusted blindly",
        "created_at": "2024-12-07T14:40:55.513000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I see making metadata inaccessible to the code as a feature, not a bug.  One of the desireable breakages like removing code introspection and gas introspection that may have utility, but have more baggage than value.",
        "created_at": "2024-12-07T16:56:07.262000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "what is the fixed deployment cost that is introduced?",
        "created_at": "2024-12-07T21:46:01.294000+00:00",
        "attachments": null
    },
    {
        "author": "big_tech_sux",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "btw vyper does not have metadata in the runtime code anyways, kind of along the same reasons actually -- it increases deployment cost and can change code behavior",
        "created_at": "2024-12-07T21:46:46.084000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "the memory operations to append metadata, whereas a metadata section would be built into the container",
        "created_at": "2024-12-07T22:38:42.763000+00:00",
        "attachments": null
    }
]