[
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't have much for the call today.  Mostly waiting for pectra 5 so we can launche osaka-0",
        "created_at": "2024-11-27T03:57:19.377000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "One open question I have from my fuzzng work: If a state test file has an account with an invalid EOF contract, what should happen?  If it doesn't parse?  If it parses but viilates stack rules?  More generally if an invalid EOF contract appears in a genesis file what do we do and how is it treated?",
        "created_at": "2024-11-27T03:58:44.284000+00:00",
        "attachments": null
    },
    {
        "author": "pdobacz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "At one point I've asked a question which I think we should answer before: do we want to specify behavior for executing invalid EOF?\n1. if executing invalid EOF is undefined behavior, we should validate state test and genesis containers and refuse to start if invalid. Evmone e.g. already validates state tests and aborts if invalid. Validation of genesis might be something we might actually need to add to the spec (similar to the references to EIP-3541 we have now)\n2. if executing invalid EOF should be defined behavior, we need to put that in the spec I guess. Then we should have a means to test that, which would be via state test files / genesis. Then we should not validate these containers.\n\nI strongly prefer (1.) at this moment, but I still have some doubts whether or not we are well prepared for a situation where a buggy/under-specified EOF validation does let bad code into the state, which then, for instance, stack underflows or overflows in runtime (overflows not in CALLF ofc).",
        "created_at": "2024-11-27T08:01:19.320000+00:00",
        "attachments": null
    },
    {
        "author": "pdobacz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm definitely down to discuss that.\n\nThere already is a topic posted to discuss the metadata section. Lastly, I wanted to add to the agenda the EOFCREATE hashing scheme (the new proposition which sufaced recently).\n\nAgenda is here https://github.com/ethereum/pm/issues/1192, I think having been closed is by accident",
        "created_at": "2024-11-27T08:02:00.635000+00:00",
        "attachments": null
    },
    {
        "author": "gumb00",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Tests with invalid EOF in prestate are malformed, treat them similar to invalid json in test file",
        "created_at": "2024-11-27T10:45:05.794000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e Agenda is here https://github.com/ethereum/pm/issues/1192, I think having been closed is by accident\n\nI've requested team to re-open the Issue.",
        "created_at": "2024-11-27T14:19:57.235000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I am hoping the call is as scheduled. In case of any change, let me know and I'll update date on the Agenda.",
        "created_at": "2024-11-27T14:21:58.806000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Join Zoom Meeting\n\nhttps://us02web.zoom.us/j/88940506383?pwd=aTdsbHVyMTNDSUFHYmhTWlI2ZEVldz09",
        "created_at": "2024-11-27T14:50:26.292000+00:00",
        "attachments": null
    }
]