[
    {
        "author": "d.x.o",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm a bit confused about the status of https://eips.ethereum.org/EIPS/eip-7610. I can't find it in any hard fork, but it seems to be implemented in geth and also part of the expected behaviour in ethereum/tests?",
        "created_at": "2024-11-02T08:42:08.725000+00:00",
        "attachments": null
    },
    {
        "author": "onthisday30",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The Energi ecosystem is a unique and multifaceted blockchain platform designed to bring cryptocurrency to the mainstream through a combination of cutting-edge technology, user-friendly interfaces, and strong community involvement. Here's a comprehensive overview of its key components and features:\n\n\nEnergi was launched in 2018 with the goal of creating a self-sufficient and self-funding cryptocurrency ecosystem. Unlike many other cryptocurrencies, Energi focuses on sustainability and long-term growth through its treasury system, governance model, and focus on security.\n\n\n\nOne of the standout features of Energi is its self-funding treasury system. Unlike other projects that rely on donations or ICOs, Energi allocates 40% of its coin emissions to a treasury. This fund supports development, marketing, and community incentives, ensuring that the project has the resources to grow and evolve without external dependencies.\n\n\nEnergi employs a decentralized governance model, allowing stakeholders to participate in the decision-making process. This model gives the community a voice in shaping the future of the project, promoting transparency and inclusivity. Through a masternode voting system, community members can propose and vote on changes to the network.\n\n\n\nMasternodes play a crucial role in the Energi ecosystem. They help secure the network, enable instant transactions, and provide governance functions. Operators are rewarded with a share of the block rewards, creating an incentive for more users to run masternodes and support the network's infrastructure.\n\n\n\nEnergi places a high emphasis on security, evident through its unique Energi Defense (Energi Bureau of Investigation)",
        "created_at": "2024-11-02T08:43:12.200000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It's retroactively activated - https://eips.ethereum.org/EIPS/eip-7675\n\nNo transaction has been created that triggers this EIP, and hence none has been recorded on the chain, so wether or not it was activated in spurious monkey/tangerine whistle or formally recognized in Petcra is moot.",
        "created_at": "2024-11-02T17:07:56.695000+00:00",
        "attachments": null
    }
]