[
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "why does EOFCREATE need to charge gas for hashing the init container? why isn't this a one time cost paid when the parent container was deployed? that would correspond to precomputing the hash and storing it alongside the code",
        "created_at": "2024-11-04T04:18:18.837000+00:00",
        "attachments": null
    },
    {
        "author": "pdobacz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I haven't though a lot about it, so just off the top of my head, this sounds like an interesting alternative but:\n- requires storing the precomputed hash somewhere in a currently non-standard way (as an EOFCREATE immediate? as a new container header section/field? maybe code could be delivered with the hashes and deployment would only re-hash and check 🤔, then it's OK if we place it as an immediate arg)\n- introduces a concept of charging gas during (and depending on) the instruction validation process (`EOFCREATE` instruction spotted =\u003e charge gas according to subcontainer size), which is something we don't need to do rn, so it's added complexity.\n- with the hashing, cost of validation stops being linear wrt. code size (?) so we should be extra careful about (think: a string of nested EOFCREATEs).\n- adds more code-introspection gotchas, while we're trying to remove them\n\nIt would be I guess better if code hashing in EOFCREATE was removed, which we're trying to do now, just so far without much success. If we removed the hashing we could also remove the cost.",
        "created_at": "2024-11-04T09:08:09.119000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e requires storing the precomputed hash somewhere in a currently non-standard way\n\ni guess the thing i don't understand is why the specification would need to standardize it, rather than leaving it up to implementations to for example have a separate hash cache database. what's the reason to standardize this kind of detail across clients/implementations?",
        "created_at": "2024-11-04T13:49:56.805000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e introduces a concept of charging gas during (and depending on) the instruction validation process (`EOFCREATE` instruction spotted =\u003e charge gas according to subcontainer size)\ni was thinking every subcontainer would be hashed on deployment, not only those that show up as EOFCREATE immediates. this is inefficient though as they may not all be needed...",
        "created_at": "2024-11-04T13:54:46.651000+00:00",
        "attachments": null
    },
    {
        "author": "pdobacz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "this would move the charging out of instruction validation, but still during EOF validation, I think similar thing. I'll amend my post, instruction validation part was irrelevant",
        "created_at": "2024-11-04T17:12:36.522000+00:00",
        "attachments": null
    },
    {
        "author": "pdobacz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think it needs to be in the state as it impacts subsequent state transition validity (via new contract address)",
        "created_at": "2024-11-04T17:17:49.120000+00:00",
        "attachments": null
    }
]