[
    {
        "author": "mariusvanderwijden",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "QQ: A transaction with invalid initcode should still be a valid transaction and just consume all gas, right?",
        "created_at": "2024-08-29T09:14:33.908000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "True, initcode is not checked in txpool so any kind of initcode is considered valid tx",
        "created_at": "2024-08-29T09:19:19.291000+00:00",
        "attachments": null
    },
    {
        "author": "pdobacz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Valid transaction, but not consume all gas:\n\u003e If EOF header parsing or full container validation fails, transaction is considered valid and failing. Gas for initcode execution is not consumed, only intrinsic creation transaction costs are charged.",
        "created_at": "2024-08-29T09:26:03.744000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Did the spec for that change at some point?",
        "created_at": "2024-08-29T09:27:29.030000+00:00",
        "attachments": null
    },
    {
        "author": "pdobacz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't recall this changing, as far as I'm involved. Even in TXCREATE times EOF validation wasn't done in tx validation time. Maybe the \"not consume all gas part\", but that was decided long ago, in TXCREATE times.",
        "created_at": "2024-08-29T09:35:22.614000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Same timeframe as the EXTCALL operands got re-ordered",
        "created_at": "2024-08-29T13:42:32.270000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\"consume all gas\" would charge against the block limit, but that's not the only way to DDOS gas, a far or large MCOPY is too.",
        "created_at": "2024-08-29T13:43:28.068000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@411317441688371202\u003e For the proxy contract update, would requiring a handshake call be acceptable?  And then the proxy does an EXTDELEGATECALL to it, failing on an exception result (return code 1) and proceeding on a handshake exists (call succeed, return code 1) or the call in-contract (return code 2, indicating in solidity no fallback handler and the callback isn't on the contract)?  you could also lock into requiring the call to revert to prevent the handshake from changing state.  And EOA would return without a revert, so the proxy can reject upgrades to an EOA.",
        "created_at": "2024-08-29T16:45:51.919000+00:00",
        "attachments": null
    }
]