[
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I would love to read this!",
        "created_at": "2024-10-05T05:38:56.179000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The base case is essentially replacing every dynamic jump with a jump table, right?",
        "created_at": "2024-10-05T05:39:30.379000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "so the gas cost of each individual jump in a jumpdest-bomb contract goes through the roof but that's fine",
        "created_at": "2024-10-05T05:40:31.364000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "though I guess with more sophistication you could make it a binary tree",
        "created_at": "2024-10-05T05:40:48.293000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Depends on the dynamic jump.  PUSHx/JUMPx combos are direct mappings.  Its when the stack value is dynamic we need the table. We would want to audit the code and see how many.",
        "created_at": "2024-10-05T14:15:18.953000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There are other issues like how to migrate 721/1155 (need slight code introspection) , 3557 invokers (need gas based call operations), and existing contracts that use available gas as a security mechanism (why we had to delay constantinople).",
        "created_at": "2024-10-05T14:18:15.775000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "4 broad steps: \n1) EOF needs to reach full parity with, or at least with features we intend to keep (i.e. do we plan on an AA migration or not is the main open question).  The main holdup is committing to which patterns to keep and which to disable, such as do we allow EOA detection?\n2) prohibit new create TXes with legacy code, and shutdown open CREATE/CREATE2 contracts like Nick's deterministic deployer. EOF parity extends to having similar solutions to what is shut down, so TXCREATE or a COPYCREATE would be needed.\n3) Audit existing mainnet code, identifying hard cases and 1-off cases\n4) Transition all existing code to a final EOF form.  Maybe to EOF1 directly or a special EOF0 to handle corner cases like vector JUMPS and gas limited calls, maybe those become system contracts to enable EOF breaking behavior that only some contracts can call. Only when step 3 is close to done will we know what it looks like.",
        "created_at": "2024-10-05T14:24:45.905000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We could instead of prohibiting legacy is to make it clear that certian bad practices for new contracts will not be kept in the EOF transition.  Kind of like how self-destruct was deprecated then nerfed. Then legacy deployments goes through a standard contract translator.  But that feels like a higher technical risk than the political risk of just banning new legacy code outright",
        "created_at": "2024-10-05T14:26:51.306000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But that's the sub-orbital view, not really getting ito details yet.",
        "created_at": "2024-10-05T14:27:08.573000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e 1) EOF needs to reach full parity with ...\n\nthis is why i'm thinking about the topic. basically if we'll inevitably end up with full EXTCODE* opcodes in EOF for migrated contracts, introducing new opcodes like HASCODE now might lead us to an \"endgame VM\" with more complexity rather than less, compared to just enabling [limited forms of] EXTCODE* for EOF from the start \n\ni get that we don't yet know if it's actually inevitable without doing the work you listed. i wonder if, since EOF has been taken out of pectra, we could use the extra time to do that research?",
        "created_at": "2024-10-05T20:28:07.736000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Listen to wednsdays implementors call.",
        "created_at": "2024-10-05T22:47:08.525000+00:00",
        "attachments": null
    }
]