[
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I would like to know if there are any conceptual EOF changes/EIPs to add \"fractional gas allocation\" to `EXT*CALL` opcodes. It is clear we want gas introspection gone. But, it feels to me that sending a fraction of the currently available gas as limit is a legacy feature which we should keep. I came across a good example today here: https://ethereum-magicians.org/t/ethereum-is-turning-into-a-labyrinth-of-unnecessary-complexity-with-eof-lets-reconsider-eof/23136/57?u=jochem-brouwer\n\nAlthough this seems not implemented in this specific multicall, I could imagine (also now with 7702, where we can now change our EOA to basically pack multiple txs inside one!!) that we want the flexibility here to send a fraction. So for instance for the 7702 \"send multiple txs inside one tx\" we want to keep the freedom that we dont forward all gas to the call, but instead send a fraction to it.\n\nI also realize that we can fit this in later (via a new opcode SETFRACTION where the fraction defaults to 1, but you can SETFRACTION to set the fraction of gas to send on the next `*CALL`) operation. Still feels like this feature should be kept in because I think there are more use cases to this than just the multicall example.",
        "created_at": "2025-03-27T05:16:16.744000+00:00",
        "attachments": null
    },
    {
        "author": "pdobacz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "No, none that I know of. The idea gained some support in the post you link to, but apparently it's not a silver bullet, and there are also a bunch of design decisions to make there. So there isn't anything written down yet.",
        "created_at": "2025-03-27T08:09:47.621000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ok, yeah it's also not a big blocker. If it turns out there is demand for this feature we can fork this in later after we think on how to implement it",
        "created_at": "2025-03-27T08:11:50.884000+00:00",
        "attachments": null
    },
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "How to encode this is secondary. The main question is if it solves the described problems. It probably is not worse than current EVM, but what is the perfect solution?\n\nThe idea I've seen recently was to be able to specify the x/64 fraction, 63/64 being the default.",
        "created_at": "2025-03-27T08:38:34.040000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If I think about it, I'm currently in the phase where I'm seeing problems when I don't know if these are even problems at this point. So if EOF is currently unable to specify this gas fraction the question is: is this a problem? I'm sure you and your team has a better overview of it than me, I could think of some applications (for instance the multicall gas split example) but I'm completely unaware what is being used in practice. If, in the end, it turns out that some feature is missing, we can think about it and add an alternative back in 🙂",
        "created_at": "2025-03-27T08:56:24.113000+00:00",
        "attachments": null
    },
    {
        "author": "pdobacz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "One opinion I've heard is that it doesn't solve the 4337-AA usecase, where fixed absolute gas is required. Supposedly 7701 or similar protocol-level-AA are OK.\n\nIt only seems to solve the \"call-third-party-contract-and-not-have-my-execution-gas-grieved\" case, but also coming up with a good x is non-trivial for the contract developer/user. Lots of unknowns",
        "created_at": "2025-03-27T09:03:03.588000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Fixed gas can't happen because that's not in the spirit of EOF. So in that case I guess 4337 must change 😬 \nWhat do you mean with `call-3p-contract`? Not understanding this reference 😅 \n\nI think one general \"problem\" here might be a rather gap between the EOF research (or actually: EVM research in general) and actual contract programmers. So when they try to use EOF for something they could notice that a certain feature is not supported anymore, and that is when they will raise an issue about this. We'd rather know that now, of course. But it's also good to see that some people are reaching out and we also already have compiler support 🙂",
        "created_at": "2025-03-27T09:14:26.078000+00:00",
        "attachments": null
    },
    {
        "author": "pdobacz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e call-3p-contract\nthird party contract, edited, sorry 🙂",
        "created_at": "2025-03-27T10:55:23.535000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ah right 🙂 Thanks 😄",
        "created_at": "2025-03-27T10:55:59.561000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "if we continue to find use cases that need a fixed gas limit i think we would have to include these limits as transaction parameters and the CALL_WITH_LIMIT opcode would read directly from there",
        "created_at": "2025-03-27T15:15:54+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I couldn't find a EIP that describes this but there were few talks about something similar. So i made a EIP draft that explores it: https://github.com/ethereum/EIPs/pull/9558",
        "created_at": "2025-03-27T16:33:07.421000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Cool, I'll check 🙂",
        "created_at": "2025-03-27T16:33:56.520000+00:00",
        "attachments": null
    }
]