[
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "An idea for EOF TXCREATE without a \"to\" field:\n\nTXCREATE does not allow txs with empty initialization containers. However, if the tx has `to: null` (so CREATE A contract) then the first index of the transaction (so index `0`) MUST be empty. The initcode which is then being ran will be the container at index 1. This:\n\n- Has this special kind of tx where we explicitly want to create a contract. The empty index 0 is a guard which either flags the intention of the tx as `to: null` or `to: Address`\n- Removes the need for a simple \"create this EOF container contract\" which still has to run legacy code (this looks weird to me, since we want to essentially get rid of legacy code). So I think one of the ideas was to use the calldata and run that in legacy mode, and then thus invoke TXCREATE in the calldata to deploy the container, but this somewhat enshrines running \"legacy code\" in EOF, which I don't think is what we want",
        "created_at": "2025-04-14T14:52:56.054000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Sorry for this late reply! I just",
        "created_at": "2025-04-14T15:42:11.531000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "🎉 The `main` branch of EEST now contains all of the container changes for eof-devnet-1 (as enumerated here - https://notes.ethereum.org/@ethpandaops/eof-devnet-1) This is as of commit `a1c4eef`.  Client devs can start validating their changes against the EEST tests.  \n\nThere will be more tests, especially around TXCREATE and contract change mechanisms that have been proposed over the past week.  We will discuss this on Wednesday's call, and hopefully will have a pre-read doc collecting the propsals with advantages/disadvantage.  Once finalized we will remove the support for EIP-7698 and have the validation tests use the selected mechanism.",
        "created_at": "2025-04-14T22:33:04.969000+00:00",
        "attachments": null
    }
]