[
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "what i was thinking for EXTCODETYPE was to return TYPE_DELEGATED plus the delegation target, so if you want to know the type of the target you can do a second check",
        "created_at": "2025-01-13T00:30:39.389000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it would be more than the \"code type\" at that point so the opcode would be more like \"EXTCODEINSPECT\" and allow you to learn: does an account have code, is it a delegation designator and if so what is the target, if not a delegation is the code legacy or eof",
        "created_at": "2025-01-13T00:33:46.819000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As long as the legacy EXTCODECOPY only returns the fist two bytes of a delegation there is no need to update EXTCODETYPE.  I am of the opinion that all contracts should worry about is if it's a delegate, not where it's delegated to.  If they care about what the delegate is then I don't think delegation is the model they are looking for, what they really want is a proxy contract.  This is the gymnatics we are contorting ourselves into to make an EOA not an EOA.",
        "created_at": "2025-01-13T01:46:00.441000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "lightclient is presenting a use case where it seems we do need to know the target of a delegation. it's necessary to construct a system where auth tuples can be relayed by third parties and trustlessly rewarded for doing so",
        "created_at": "2025-01-13T13:03:49.069000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Why not return the full delegation in extcodecopy then?",
        "created_at": "2025-01-13T15:18:08.924000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That is then requiring code introspection.  It's not any different from rewarding contract deployments be forwarded and being rewarded for doing so.  Having extcodecopy return the full value would be something EOF could not support per it's mandate to remove code introspection",
        "created_at": "2025-01-13T15:19:11.661000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Is this a hypothetical construct or is there actual discussion for such a use case?",
        "created_at": "2025-01-13T15:19:53.393000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it was brought up by \u003c@177224966398279680\u003e on ethmagicians: https://ethereum-magicians.org/t/eip-7702-set-eoa-account-code/19923/342",
        "created_at": "2025-01-13T15:34:15.825000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i don't think it's hypothetical at all. i always assumed there would be a way to relay auth tuples and reward the relayer. the point of 7702 is to address EOA UX issues and removing the need for gas token is one of the issues that 7702 can deal with, but only if there's a way to convince people to relay your stuff",
        "created_at": "2025-01-13T15:35:20.037000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "we can and should(?) do this and it may be enough. but EOF code doesn't have access to extcodecopy, so the reward code can't be written as EOF code. not sure if \u003c@543900561460822016\u003e was thinking of some other interaction with EOF",
        "created_at": "2025-01-13T15:44:07.192000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "EOF also cannot currently handle 4337 because it depends on limiting gas per call.  so this wouldn't be the only 'legacy thunk' needed.",
        "created_at": "2025-01-13T15:46:07.810000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "actually think we need to think about this reward mechanism a little more to understand if access to the designator is necessary. i mean you could have a  `claimSetCodeReward` function in the delegate contract that checks a storage slot unique to that delegate contract and account, rewards tx.origin if zero and sets it to nonzero. you dont even need codecopy",
        "created_at": "2025-01-13T15:49:07.520000+00:00",
        "attachments": null
    },
    {
        "author": "grubby_the_orc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "hey guys i have a few question on eip 7702 which is part of pectra. can anyone help?\n\n1) the code under the eoa that contains the address to which to delegate is stored permanently right? This might be obvious but i read a bunch of places where it said temporarily\n\n2) the special type of transaction that includes an authlist and sets the delegations for EOAs also acts as a normal transaction with a \"to\" and \"data\" right?\n\n3) Once the eoa has been upgraded via 7702 and the code field is set, anyone can call the eoa's address and the smart contract that is pointed to will be executed. That person that sends this transaction ethereum signature will still be veriefied by the node i presume but it is irrelevant right? Cause the only thing that is relevant is the \"Data\" being sent which auth will be validated in the smart contract logic\n\n4) When someone sends a transaction to an eoa that has been delegated under eip7702 the smart contract will be executed under the eoa's context. But the msg.sender, tx.origin will be the EOA that sent the transaction correct?",
        "created_at": "2025-01-13T17:19:13.347000+00:00",
        "attachments": null
    }
]