[
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "reenable extcodecopy in EOF and make it return the full designator instead of the prefix for delegated accounts?\n\nas a more radical alternative, add a \"calldata\" field in 7702 tuples and make 7702 txs execute that data on the accounts. this allows payment to tx.origin. this feature has been requested for other reasons too (easier initialization without frontrunning risk)",
        "created_at": "2025-01-12T02:12:19.278000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "could also do something with the proposed EXTCODETYPE opcode like returning the full designator on delegated accounts https://github.com/ethereum/EIPs/pull/9229",
        "created_at": "2025-01-12T02:14:51.706000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If we let EXTCODETYPE return a TYPE_DELEGATED_EOA then we cannot figure out if the target code is EOF code, which is the point of code type instead of a simple HASCODE or just EXTCODESIZE. The first use case was to allow a proxy written in EOF to determine if the new target is also an EOF contract (and revert if not).  \n\nIf we can only get the delegated status of the address and not the type of what it is delegated to then we have a way to subvert the check.  Of course you could have the proxy go to a delegated account and update the delegation to a legacy account after the fact. It makes me wonder if we should allow TYPE_DELEGATED_EOA and provide no further info as the type can change underfoot anyway, (implying that a good proxy impl would reject anything that is not TYPE_EOF)",
        "created_at": "2025-01-12T21:53:10.779000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Also keep in mind for this I plan to pitch EIP-7819 (CREATE_DELEGATE opcode) in one of the next two forks (unless 7702 update is bad).  So we will want to consider if we want to distinguish between EOA delegation and contract-controled delegation.",
        "created_at": "2025-01-12T21:55:47.906000+00:00",
        "attachments": null
    }
]