[
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Sorry for this late reply! I just realized indeed if we VLQ this has the upside that it optimizes (not sure if minimizes) the size of the output format specifically for the code locations, but the downside that we do not know which bytes we should read to get the size of sector X. And that was my \"goal\" to keep witnesses smaller.\n\nI have two remaining questions which specifically focus on this \"witness\" point. We assume that the all EVM code (so also all EOF containers) stored are at some poin stored in a trie-like structure (for instance key: 32-byte key and value: 32-byte code value and then saved as MPT (this is just an example, likely other trie type would be choosen)). For the witness we have to include the code parts which we need in order to execute the touched code in the block.\n\nQuestions:\n\n1. Is there another data format to store the code section metadata in? We now considered storing (relative?) offsets and code sizes. From it the code section starting position and size can be calculated (or is given). I'm wondering if there are any other more exotic formats\n\n2. (not really a question, more a \"point\") Since we likely will end up with these witnesses at some point, and we want to keep the witnesses small, for the format which we currently have (sizes) we would thus like the property that if we look at the container and which sections it calls, these sections are ordered. The 0-code section is always called so this is obviously the most important one, and then we would expect the 1-code section to be the next section to be called the most. To measure this, for each tx mark each EOF container which is called and then +1 each code section which was called in that tx. For the smallest witness size (in total of all these calls to the contract/container) we would thus want that the containers are sorted by popularity (most popular first). \nIs there already some work done on this? (How to predict popularity? 🤔 ) Are compilers aware of this nice-to-have?",
        "created_at": "2025-04-13T10:16:44.800000+00:00",
        "attachments": null
    }
]