[
    {
        "author": "chfast",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Any links?",
        "created_at": "2025-05-07T07:57:44.532000+00:00",
        "attachments": null
    },
    {
        "author": "ben_a_adams",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Think is Zisk? (for RiscV-64) https://github.com/0xPolygonHermez/zisk",
        "created_at": "2025-05-07T08:02:56.363000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Right -- dynamic jumps interfere with building the CFG, and EOF Functions fix that.",
        "created_at": "2025-05-07T18:11:10.891000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The EVM-\u003eRust idea was just an hack.  A brain-dead, code-by-code transpiler. Then let Rust compiler do the work and integrate the output into the environment they already have for testing.",
        "created_at": "2025-05-07T18:21:49.836000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "`How to introduce functions without a breaking change:`\n\n1) Just do it.  RJUMP and the rest are no different than any other instructions that take intermediates.  And *the semantics of their execution does not depend on E0 magic*.  This is a bare minimum.  It is a backward-compatible change that simply adds new operations to the VM. \n\n2) Shazam!  E0 magic guarantees that the code will not fail in specific ways, like stack underflow or invalid instructions.  *The semantics of the execution does not change*, but the VM and other tools can rely on those guarantees to e.g:  Use JITs to use less gas.  Or  perform deeper verification of contract correctness.  Over time the EO magic can be extended for further validation, CALLF and other new instructions, and metadata to lay out entry points and structured code sections. \n\nI think further evolution so far as any structure imposed on EVM code needs to have compiler and static analysis people at the table --  the disagreements between Solidity and Vyper are a problem, and we have a lot to learn about what our formal analysts need.",
        "created_at": "2025-05-07T18:23:34.199000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Note that there remains only a single EVM that can run any new operations.  It remains a simple state machine where each EVM operation changes the state of the machine.  Click, click ... it needs no metadata.\n\nThe E0 magic metadata supports guarantees about properties of the code that are useful, even essential, to app developers, client developers, contract auditors and analysts, blockchain security researchers, and many others.",
        "created_at": "2025-05-07T20:27:01.282000+00:00",
        "attachments": null
    }
]