[
    {
        "author": "agemanning",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hey all. Is anyone using gossipsub 1.1 in testnets? Wondering about how it performs and/or scoring settings. In particular, I'm wondering about how a peer that is syncing gets scored. \nA syncing peer shouldn't propagate any attestations and/or blocks because it cannot verify them. It will then look like a censoring peer and I think gossipsub will negative score such a peer. I guess potentially we need to be careful with when to subscribe to channels and/or adjust the scoring parameters. Anyone had a look into this yet?",
        "created_at": "2020-06-22T05:46:50.890000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "that's an interesting observation - we're juggling this for the purpose of our own nbc-level peer scoring as well",
        "created_at": "2020-06-22T05:53:47.907000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "we're considering something like delayed scoring, but it's a bit awkward - ie when queueing up orphans, if they fail to apply when the parent comes around we can score the peer accordingly",
        "created_at": "2020-06-22T05:55:47.109000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "not subscribing while syncing is a bit awkward as well - ideally one would subscribe as a listening-only peer and not forward blocks in this period, because from a distributed synchronization point-of-view, subscribe-then-sync plugs all the race conditions that otherwise happen",
        "created_at": "2020-06-22T05:57:24.508000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "yeah its a bit tricky there, a syncing peer could easily be penalised due to a low `Mesh Message Delivery Rate` , and eventually removed from the mesh. There would probably need to be a way to signal to other peers\nin the mesh that you are 'syncing' , so that the new peer is not booted out before it can get fully synced.",
        "created_at": "2020-06-22T10:21:10.081000+00:00",
        "attachments": null
    }
]