[
    {
        "author": "ansgar.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Presumably a very basic question, but looking at my validator node over the past few hours struggling to keep up with the network, I noticed that for epochs where the node is unable to perform its attestation duties my validator balance is going down quite a bit (~0.0009 ETH for the latest epoch), which I understand to be the inactivity leak, currently increasing in magnitude over time while the network is not finalizing. However, for the rare epochs in between where my attestations do get included, I also see a (considerably smaller) decrease in balance (~0.00001 ETH), where I would have expected positive rewards instead. Can someone explain what is happening there?",
        "created_at": "2020-08-16T11:49:18.335000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "(first time participating in a testnet, haven't followed phase0 closely)",
        "created_at": "2020-08-16T11:50:13.003000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminion",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@415548822983278593\u003e No-one gets any positive rewards for attesting during a period of non-finalisation. The best you can do is to keep performing your duties, in which case your position will be neutral (no gain or loss).",
        "created_at": "2020-08-16T12:17:42.290000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Ah okay, thanks. I assume the small decrease is then the result of delayed attestation inclusions due to the network health. So if I were able to reliably keep up with the head of the chain and have my attestations included immediately, I should get to a best case of neutral rewards (while the network is still not finalizing), makes sense.",
        "created_at": "2020-08-16T12:24:04.302000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Not sure that works in the real world.  If you're in a finality leak then by definition at least 1/3 of the blocks wont' be produced (outside of something *really* funky going on with the network).  As such, you would expect to have a significant number of your attestations not be included in a timely manner, and hence still lose money.\n\nNot as much as if you weren't attesting, obviously, but I don't see how you'd come out even in such a situation even if you were personally behaving perfectly.",
        "created_at": "2020-08-16T12:28:21.390000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminion",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yes, I should have said that the best you can hope for is to lose nothing in these circumstances. In practice, you'll most likely leak some stake.",
        "created_at": "2020-08-16T12:40:13.628000+00:00",
        "attachments": null
    },
    {
        "author": "superphiz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Is anyone able to issue a daily status report on the state of the network and the mitigations?",
        "created_at": "2020-08-16T13:10:54.117000+00:00",
        "attachments": null
    },
    {
        "author": "prestonvanloon",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I can try. Medalla is currently experiencing a highly chaotic chain event and is just over 400 epochs since finality. Participation is around 25%. Prysmatic Labs team has a PR in progress to improve initial sync and we are expecting to have that released today. Following that, we're resuming our root cause analysis of the original clock skew issue for our formal report, to be released Monday or as soon as possible this week.",
        "created_at": "2020-08-16T14:01:20.585000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm failing to track down a bug of some sort in the testnet due to its lack of finality, so wanted to highlight it here so that the client teams can take a look.\n\nSlot 1005, the first aggregated attestation.  The aggregation bits are different across different clients.  Lighthouse and Teku think they are `0x69b9f5fd2ff39f3a46ce7a65fce35ceff97fbc*3*f`, and Prysm thinks they are `0x69b9f5fd2ff39f3a46ce7a65fce35ceff97fbc*1*f`.\n\nThis discrepancy is echoed in many other attestations both in that block and others.  In general it seems like the high bit of the low byte is going missing in Prysm (or being added in Lighthouse and Teku).\n\nOne possibility that springs to mind immediately is that prysm is either sending data in its internal bitfield format over the wire, or assuming that incoming data is in its internal bitfield format.  This would explain why the high bit goes missing, as that bitfield format uses that as a start-of-field marker (see https://github.com/prysmaticlabs/go-bitfield/blob/master/bitlist.go#L9-L17 for details).  But by the time I'd set up some instrumentation to see what was going on on the wire the network died so can't test my theory.\n\nSo I'm afraid I'm providing a problem without a solution; hopefully the client teams will be able to work this one out pretty easily.",
        "created_at": "2020-08-16T18:48:44.023000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "these are attestations seen on the wire? or on chain?",
        "created_at": "2020-08-16T19:14:33.983000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm assuming on the wire, because on chain would imply a consensus failure",
        "created_at": "2020-08-16T19:14:47.289000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "or is this just a data export issue?",
        "created_at": "2020-08-16T19:15:03.656000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "if these are on chain and clients didn't have a consensus failure, then it just seems to be a read/export issue right?",
        "created_at": "2020-08-16T19:15:29.264000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The last byte has a delimiter bit that may be printed with/without depending on implementation",
        "created_at": "2020-08-16T19:16:32.298000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yep it could just be a presentation issue.  The values came from the APIs of the clients.",
        "created_at": "2020-08-16T19:19:03.179000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "From memory, Teku and Lighthouse are serializing the bitlist as SSZ so it has the last byte delimiter.",
        "created_at": "2020-08-16T20:44:16.286000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Indeed, 3 = 0011 in last nibble (left hand last byte), whereas prysm prints 1 = 0001 in the last nibble. So the delimit bit may be missing there",
        "created_at": "2020-08-16T20:50:45.208000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If you are formatting as hex, it makes sense to include the delimit bit, otherwise there would be no way of telling how many bits in the last byte are part of the bitlist",
        "created_at": "2020-08-16T20:52:21.658000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Prysm value I obtained from grpc so it would make sense for the delimiter to not be present",
        "created_at": "2020-08-16T20:57:31.333000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Do they encode the bitlength separately?",
        "created_at": "2020-08-16T20:57:58.825000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Not sure of the encoding on the wire but the resultant struct has a Len() function that returns number of bits",
        "created_at": "2020-08-16T21:01:34.071000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "In many clients, as well on the wire, the bitlist is presented as a byte array with delimit bit in last byte, to save space (compared to separate length, or bool array). The delimit bit is sufficient to tell the length from, and does not need to be encoded separately if you do it this way.\nJust details though, I think it's only a presentation difference issue here",
        "created_at": "2020-08-16T21:04:26.231000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yep looking that way. Apologies for the confusion",
        "created_at": "2020-08-16T21:07:18.806000+00:00",
        "attachments": null
    },
    {
        "author": "goldbbb",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm interested in being a test net validator, is there a step by step of how to get setup as a validator on medalla?",
        "created_at": "2020-08-16T23:58:15.059000+00:00",
        "attachments": null
    }
]