[
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cgr3999\u003e re: **@tcoratger**\n\u003e Yes I see we need to think about this further, this could probably be integrated into the VM relatively well. I need to think about this further. For now we are on the simplest case of Aggregate/Merge and this is already super complex but yes I guess once the VM is stable with these 2 features we could think about it further as I know this should be possible\n@tcoratger  @Benewagner actually we might need the new feature right away:\n\nsince proposer would now pack and sign their vote as the block signature, with full block as data (because of the OTS limitation we will already need to go beyond simple merge/aggregate",
        "created_at": "2025-10-11T12:52:10.983000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cgr3999\u003e comments are invited on the proposed container changes for devnet 1:\n\nhttps://github.com/leanEthereum/leanSpec/pull/67/files#diff-2125e997632f26307bfecdca904ab86653f70f04d2e3a1041f5d3ad97b422609",
        "created_at": "2025-10-11T13:19:43.661000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cBenewagner\u003e re: **@gr3999**\n\u003e @tcoratger  @Benewagner actually we might need the new feature right away:\n\nsince proposer would now pack and sign their vote as the block signature, with full block as data (because of the OTS limitation we will already need to go beyond simple merge/aggregate\nI don’t understand what you mean.",
        "created_at": "2025-10-11T18:52:36.121000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cgr3999\u003e since there is no separate proposer vote because of OTS limitation and will be embedded in block body directly, there is no corresponding vote signature but signature over the entire block.\n\nso if that vote needs to be repacked by some other block/aggregator, one will need to use the block aggregated signature proof as the input to the aggregated VM\n\nso the signature VM needs to handle such proving from day 1 (devnet2, in devnet1 we can just do vote signature by the proposer instead of full block signature so that dependency on this part being ready is reduced)",
        "created_at": "2025-10-11T18:56:44.776000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cBenewagner\u003e I thought devnet 1 has signatures but no leanVM / proving / aggregation yet. Wasn’t that the plan?",
        "created_at": "2025-10-11T19:00:56.892000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cgr3999\u003e yes in devnet1 we can just do vote signature by the proposer instead of full block signature so that dependency on this part being ready is reduced\n\nso for devnet2",
        "created_at": "2025-10-11T19:01:31.799000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cgr3999\u003e just bringing up the scenario that we will need to consider aggregated block signature as some vote signature for further aggregation in the lean VM from day 1 unless we just say that the block proposer vote can't be repacked (so in another branch)",
        "created_at": "2025-10-11T19:05:44.099000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003ctcoratger\u003e I would say that for the moment we don't have to worry more than that as we won't have an aggregation in devnet1.\n\nThen we can bring this back to the table but I think that we will need some doc to clarify exactly what are the different scenarios we envision, in order to reach a global agreement between everyone on exactly what we will need to support or not support.\n\nTo give you more context, in the next few weeks the focus for us will be 100% on achieving the required performances for the Aggregate/Merge program. This is already a very very challenging cryptographic challenge. For now, we need a 6x performance improvement only for the simple Aggregate program to reach the 1000 signatures aggregated per second and we have not started to take care of the full Merge program. Then as the VM is designed to be modular, we can add new programs in there, but we will need to reach agreement on the exact needs that we have.",
        "created_at": "2025-10-11T20:19:53.191000+00:00",
        "attachments": null
    }
]