[
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cgr3999\u003e I don't think we should try to have parity with BLS and that is the point of lean consensus, to fundamentally rethink this. the  work/PR I am proposing is to just have one signature for the entire block, which can eventually be replaced by just one proof for the block which verifies blocks as well as signatures\n\nSo being able to recursively rely on a previous block's proof for validity of the data packed in it would be a huge upside and what could be a truly ZK native approach",
        "created_at": "2025-10-10T09:00:16.002000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cpotuz0\u003e I think this also depends on forkchoice. For the current forkchoice it is not true that an attestation that is valid on one side of the fork will be valid to be included in the other branch. When we reorg we need to extract attestations from the reorged blocks, *revalidate them* and then insert them again. From what you guys are saying above the aggregation itself comes with a proof of validity that both a) ties it to a branch and b) proves its own validity. I don't see how these two will allow that aggregation  to be placed on a different branch without reproving",
        "created_at": "2025-10-10T09:47:29.451000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cgr3999\u003e the repackaging in the new block will revalidate them according to the STF and hence it will be re-proved, but one also needs to assert that they were validly casted by the validator relying on proof recursion since you won't have the original signature",
        "created_at": "2025-10-10T09:54:48.115000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cpotuz0\u003e re: **@gr3999**\n\u003e the repackaging in the new block will revalidate them according to the STF and hence it will be re-proved, but one also needs to assert that they were validly casted by the validator relying on proof recursion since you won't have the original signature\nI mean something else: unless you've changed validity of attestations, some cannot even be included on the other side of the fork. In fact if you're on a fork in which two different blocks A and B exist at slot N, attestations included in a block A will most likely be invalid in B",
        "created_at": "2025-10-10T10:39:34.412000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cgr3999\u003e yes I understand, I just want to cover edge cases where they might be",
        "created_at": "2025-10-10T10:50:14.899000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cgr3999\u003e the votes for different heads but same target can be useful to move the justification forward",
        "created_at": "2025-10-10T10:51:10.066000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cpotuz0\u003e Even if the target is the same validity depends on the branch. So the mechanism should allow for cheap verification of the aggregate and reinclusion. Otherwise forkchoice itself should make this whole on chain reintroduction irrelevant",
        "created_at": "2025-10-10T11:00:12.938000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cpotuz0\u003e Hmm actually I take this ^  one back: with same source and target I think validity is the same at the same slot. Shuffling couldn't have changed.",
        "created_at": "2025-10-10T11:17:48.948000+00:00",
        "attachments": null
    }
]