[
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003ctcoratger\u003e Hello everyone,\n\nFor your information, with the help of @mo_0x2 for a few days we pushed a lot of efforts to have a clean minimal spec:\n- SSZ is feature complete, probably very tiny adjustments/rare bugs could be found but this is usable as is and it seems to pass all the reference tests of the remerkleable library. So that you can find this here: https://github.com/leanEthereum/leanSpec/tree/main/src/lean_spec/subspecs/ssz and the test suite in the test folder. Of course, we want this to be super lean so that we are open to any contributions, Pythonic adjustments, more tests. And @mo_0x2 will check this soon also, probably bringing even nicer things to the game.\n\n- I've implemented everything related to the state including state transition function here: https://github.com/leanEthereum/leanSpec/blob/main/src/lean_spec/subspecs/containers/state.py with the tests in the test folder.\n\nI merged these things without a review because it's way too big to review this properly and I made a lot of changes along the way so it wasn't appropriate for a review but more in a fast iteration mode. In all cases we will become aware of potential bugs as we go along, we will also add tests. Please if you are interested or involved, check the code carefully and reach ouf or open a PR if you find something is unclear or wrong.\n\nAlso the good news is that we will now be able to write everything in Python from day 1 for each new part of the spec. For example, @gr3999, I think it might make sense to directly make this in Python https://github.com/leanEthereum/leanSpec/pull/29. Of course, if this represents too much work for you at this time, as the PR is now well advanced, I can take care of this once merged.\n\nBut for future use, I'd say it's better to do everything directly in Python and even delete the elements we have in the `doc/` folder, as we have the equivalent (with tests that provide much more security) in Python. \u003cclipped message\u003e",
        "created_at": "2025-09-11T20:38:20.985000+00:00",
        "attachments": null
    }
]