[
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Just to clarify, read values (=the pre-tx values; what you would find on disk before executing the transaction) is out of discusion as it led to too big blocks. With state locations, or storage locations, or sometimes referred to as \"the read locations\", is just address, storage key pairs that indicate the location of a to-be-toched storage slot, but not what it contains. For that, even with having the BAL, you'd still need to do I/O.",
        "created_at": "2025-08-05T12:46:23.297000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e Just to clarify, read values (=the pre-tx values; what you would find on disk before executing the transaction) is out of discusion as it led to too big blocks.\nWhen/where did this discussion occur?  It seems I missed it.  That is very sad to hear as this was supposed to be a way to build trustless RPC light clients.  Arguably, the only reason I ever backed/supported BAL.",
        "created_at": "2025-08-05T12:47:43.443000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Or are you suggesting that it was never part of the discussion in the first place and I misunderstood the proposal?",
        "created_at": "2025-08-05T12:49:41.968000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "I had [this post](https://ethresear.ch/t/block-level-access-lists-bals/22331) that described the different variants, and based on what clients wanted to do with them, we went for the variant with state locations (tbd) + state diffs. Pre-tx values would have led to block that are bigger than wors-case calldata blocks, and those are already problematic, imo. In the end it's supposed to do primarily one thing - enabling parallelism. \n\nAt some point it was discussed but the question is, what would you want to do with it? Since it's not real statelessness where you get witnesses attached and could engage as a validator, you could not trust the head of the chain (and attest). You could run an RPC but for that you might also want to be at least partial stateless such that you use the BAL to keep your state in sync with the chain.\nUsing BALs, you can do an executionless RPC provider.",
        "created_at": "2025-08-05T12:54:45.693000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "You cannot do low-state validating RPC providers though, which is where the big win is since the number one problem with RPC servers right now is state size.",
        "created_at": "2025-08-05T13:04:24.926000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Even Besu's flat DB is still ~80GB (last I heard), which is substantially more than what the vast majority of people need (probably less than 10GB for most users).",
        "created_at": "2025-08-05T13:05:05.092000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks for the link, I'm not sure how I missed this conversation.  😖",
        "created_at": "2025-08-05T13:09:34.878000+00:00",
        "attachments": null
    }
]