[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hello, it seems that BALs without ePBS are a problem because we need to change the beacon state and this is the reason why \u003c@363800010518822915\u003e had to cook an entirely separate branch to be able to test  BALs in isolation. \n\nThe reason why it requires a beacon state change is what is in my opinion the tech debt that whenever the payload header changes we need to change the state because the beacon state caches the header. ePBS removes this header entirely from the state (at least in the current iteration of the spec). So what I am asking is if BALs aren't expecting any other change from the CL structures besides this one. If all the changes that are expected are going to be in the engine API, then we can start actually merging our structure PRs to our develop branches, we could test BALs with ePBS enabled and it would make our lives easier when we get to have ePBS implemented",
        "created_at": "2025-09-18T00:21:34.990000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think it would be great if we could have a throwaway branch for at least one of the CLs for BAL only, so we can start setting up networks and testing it, without having to wait for epbs to be finalized",
        "created_at": "2025-09-18T06:05:47.011000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah we discussed that just yesterday and \u003c@845691100072509460\u003e and \u003c@363800010518822915\u003e  are working on a branch with no epbs and only the engine api changes (with the state changes), such that we can start with first BAL devnets right away.\nI agree yeah, for the first devnet we should test them together, and then, removing the EL header from the beacon state makes a lot of sense.",
        "created_at": "2025-09-18T06:09:39.684000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "FYI, this is the \u003c@363800010518822915\u003e's branch with engine APIs but without ePBS: https://github.com/OffchainLabs/prysm/pull/15712",
        "created_at": "2025-09-18T06:39:41.939000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Cross-layer",
        "parent": "",
        "content": "if the activation is on glaos/glamsterdamtime, then you should be already able to put those images into kurtosis and make it work",
        "created_at": "2025-09-18T07:17:21.701000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Let me make the devnet 0 work. I'm based on the following branches and with a Kurtosis config that has Fulu at epoch 0 and Gloas at epoch 1. It gives me some errors but Terence gave us a great first step. I think we also need to modify Dora as it modifies beacon state but I'll focus on client prototypes first.\n\nPrysm: https://github.com/OffchainLabs/prysm/pull/15712\nGeth: https://github.com/ethereum/go-ethereum/pull/32263",
        "created_at": "2025-09-18T08:06:45.076000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I just want confirmation that there's no expectations at all to change the beacon state or related structures for Gloas, so that I can start merging on our main branch as soon as the next spec release",
        "created_at": "2025-09-18T10:56:12.965000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah all good! Initially, since the EL header was in the state, BALs would have changes the state but with your changes this is no longer the case.",
        "created_at": "2025-09-18T11:16:35.558000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Great!\nI have a PR for Dora ready. Since we only read specific variables from the beacon state it didn't need any changes but we can check then.",
        "created_at": "2025-09-18T11:18:03.614000+00:00",
        "attachments": null
    },
    {
        "author": "jwasinger",
        "category": "Cross-layer",
        "parent": "",
        "content": "Just want to say that there's a bug  in Geth with the RLP encoding of BAL-containing-blocks that may or may not show up if you try to spin up a devnet.\n\nI'm still trying to figure out the root cause.\n\nI've only seen it manifest when trying to bulk-import a large set of blocks, so it may not apply in the devnet scenario.",
        "created_at": "2025-09-18T11:26:22.978000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Can I see the PR or have an access to the Dora image?",
        "created_at": "2025-09-18T11:28:36.646000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "https://github.com/nerolation/dora/tree/add-eip7928",
        "created_at": "2025-09-18T11:36:00.320000+00:00",
        "attachments": null
    },
    {
        "author": "nflaig",
        "category": "Cross-layer",
        "parent": "",
        "content": "is there already an EL image to test with on kurtosis (and config if anyone did already), since it's pretty simple for us to add BAL required changes I went ahead and quickly did it but would like to test it https://github.com/ChainSafe/lodestar/pull/8426 (maybe having more than 1 CL can be useful too)",
        "created_at": "2025-09-18T17:32:34.763000+00:00",
        "attachments": null
    }
]