[
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's not unconditionally for 1 and 2.\nWe need the coinbase to be included with a balance change in case the balance changes. This is for every transaction that changes the coinbase's balance, we'd see a balance change.\nIf the balance does not change in a tx, the coinbase would be included as a read (no changes), and overwritten (later when building the BAL) by the write/balance change entry of another tx.",
        "created_at": "2025-10-12T12:17:51.291000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "The result would be that the coinbase address is always included in the BAL, at minimum with all empty changes.",
        "created_at": "2025-10-12T12:22:55.946000+00:00",
        "attachments": null
    },
    {
        "author": "raxhvl",
        "category": "Cross-layer",
        "parent": "",
        "content": "You are right, we took the example too far. Coinbase is like any other account that a transaction touches.",
        "created_at": "2025-10-12T14:05:36.874000+00:00",
        "attachments": null
    },
    {
        "author": "raxhvl",
        "category": "Cross-layer",
        "parent": "",
        "content": "Discussion originated from this case, coinbase for an empty block with no tx. What would happen here?\n\nWe only capture system operations in bal right? Coinbase will not be included, coz there are no tx to tag?",
        "created_at": "2025-10-12T14:08:31.946000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Right yeah. Blocks with no txs won't have the coinbase in the BAL as it's never receiving any fees. So, only the 4 system contracts (at max. 4 addresses) and the withdrawal recipients are included.\nWould it make sense to have a test that does the opposite what \u003c@427903869226582018\u003e proposed: check that a block with  no txs doesn't include the coinbase. And maybe add another one where the coinbase receives ETH through a 4895 withdrawal (in which case must be included, even though the block has 0 txs. Just in case one wrongly assumes that no txs means no coinbase in the BAL?)",
        "created_at": "2025-10-12T19:38:18.826000+00:00",
        "attachments": null
    }
]