[
    {
        "author": "ethpandaops-devnet-pulse-v2",
        "category": "Cross-layer",
        "parent": "",
        "content": "",
        "created_at": "2025-10-27T01:00:00.303000+00:00",
        "attachments": null
    },
    {
        "author": "matkt0",
        "category": "Cross-layer",
        "parent": "",
        "content": "Besu is currently working on the state root in parallel. We already have transaction parallelization without BAL so it shouldn't be too difficult to adapt it for BAL\n\nWe have configurable history. We usually keep the last 512 states in cache so maybe something similar. Just a thought.",
        "created_at": "2025-10-27T05:26:38.623000+00:00",
        "attachments": null
    },
    {
        "author": "jwasinger",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e How many BALs (for how many blocks) will clients keep (e.g. treated similarly as receipts - using txlookuplimit or enforce a minimum)?\n\nFor now, we keep any that we also have the block for.  That may change in the future.\n\n\u003e 2.\n\nParallel loading from disk is not something we really think about, as the db/OS handles that for us.\n\nParallel tx execution was pretty straightforward to implement in Geth: we just naively attempt to schedule each tx simultaneously.  And the Go runtime seems to do a decent job, because the performance is vastly improved compared to serial execution.\n\nRight now, the parallel state root calculation is the most complex piece and also the performance bottleneck.  And the slowdown here has to do with the fact that we can no longer warm modified trie nodes from disk in the background while we do serial tx execution.  So with BAL, the state root calculation takes a much larger IO hit.  I'm working on some optimizations here, but they're not complete yet.",
        "created_at": "2025-10-27T05:49:55.110000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hey \u003c@762919002196410400\u003e \u003c@796570016966770688\u003e I think there are a few potential SELFDESTRUCT edge cases not covered here for OOG and static calls. Had to make quite a few changes to match the spec https://github.com/NethermindEth/nethermind/pull/9425/commits/dc8e5d6a4ecc09ee64e5d54a2b03dcc3cad1402e",
        "created_at": "2025-10-27T12:46:04.185000+00:00",
        "attachments": null
    },
    {
        "author": "m0_ox",
        "category": "Cross-layer",
        "parent": "",
        "content": "As of this morning, we \"functionally\" completed The Weld™ (merging EEST and EELS into `execution-specs`) related to BALs development. I recreated `forks/amsterdam` to include the updated changes and have rebased the BALs feature branch on top of this so we should be good to start adding new test cases and making updates to the spec. And this is now all done in the same repo! 🙂\n\nThere's a bit of a hiccup for our feature releases flow for tests that we are working to iron out (BALs is a feature release for us)... but we are working to iron this out ASAP and we'll be able to have a new BALs release very soon. As of this morning, PRs for test cases are very welcome to `execution-specs`! cc: \u003c@762919002196410400\u003e",
        "created_at": "2025-10-27T18:17:06.188000+00:00",
        "attachments": null
    }
]