[
    {
        "author": "ethpandaops-devnet-pulse-v2",
        "category": "Cross-layer",
        "parent": "",
        "content": "",
        "created_at": "2025-12-19T01:00:00.355000+00:00",
        "attachments": null
    },
    {
        "author": "b.hartnett",
        "category": "Cross-layer",
        "parent": "",
        "content": "Considering that BALs are no longer going to be stored in block bodies, will BALs still need to be shared over devp2p for blocks within the BAL retention period (WSP)?",
        "created_at": "2025-12-19T05:23:49.171000+00:00",
        "attachments": null
    },
    {
        "author": "matkt0",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think it would be a good idea to make sure we have what we need during the snapsync healing",
        "created_at": "2025-12-19T06:08:34.577000+00:00",
        "attachments": null
    },
    {
        "author": "garyrong",
        "category": "Cross-layer",
        "parent": "",
        "content": "```\nAddresses accessed without state changes, including:\n\n    - Targets of BALANCE, EXTCODESIZE, EXTCODECOPY, EXTCODEHASH opcodes\n    - Targets of CALL, CALLCODE, DELEGATECALL, STATICCALL (even if they revert)\n        Note: For call operations (CALL, CALLCODE, DELEGATECALL, STATICCALL), the target address is only included in the BAL if gas checks (memory expansion, access cost, transfer cost) pass; if gas shortage causes the operation to fail before state access, the target address MUST NOT be included.\n    - Target addresses of CREATE/CREATE2 (even when creation fails)\n    - Deployed contract addresses from calls with initcode to empty addresses (e.g., calling 0x0 with initcode)\n    - Transaction sender and recipient addresses (even for zero-value transfers)\n    - COINBASE address when receiving transaction fees\n    - Beneficiary addresses for SELFDESTRUCT\n    - System contract addresses accessed during pre/post-execution; the system caller address, SYSTEM_ADDRESS (0xfffffffffffffffffffffffffffffffffffffffe), MUST NOT be included unless it experiences state access itself\n    - Withdrawal recipient addresses\n    - Precompiled contracts when called or accessed\n```",
        "created_at": "2025-12-19T07:50:14.780000+00:00",
        "attachments": null
    },
    {
        "author": "garyrong",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hey guys, I am reading the latest BALs spec again and it confuses me a bit.\n\nIt said for call operations (CALL, CALLCODE, DELEGATECALL, STATICCALL), the target shouldn't be recorded as the accessed accounts if the corresponding gas measurement fails.\n\nUnfortunately, the gas measurement of these opcodes are dependent on the state data. Specifically, for opCall, we charge account creation if the destination was not empty. It's possible that the state retrieval has been performed and gas shortage occurs afterward (e.g., insufficient gas for memory expansion). According to the spec, the target won't be included in the BALs while it may be read already.\n\n\nSimilarily, for SELFDESTRUCT we charge additional CreateBySelfdestructGas if the beneficiary is empty and balance transfer occurs. Gas shortage may occur after the state retrieval and in this particular case, the beneficiary should be tracked in the BALs accordingly. \n\nIt feels these two scenarios are not aligned with each other or maybe I miss something?",
        "created_at": "2025-12-19T07:50:15.905000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hey guys, I am reading the latest BALs",
        "created_at": "2025-12-19T08:41:13.886000+00:00",
        "attachments": null
    }
]