[
    {
        "author": "funnygiulio",
        "category": "Execution Layer",
        "parent": "",
        "content": "It will be part of the execution block afais",
        "created_at": "2025-05-28T15:42:46.415000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "Execution Layer",
        "parent": "",
        "content": "so it is already signed with the block proposer signature",
        "created_at": "2025-05-28T15:43:05.708000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Execution Layer",
        "parent": "",
        "content": "yep, I figured it out. header will have these 3 fields:\n```\n    bal_root: Root  # Root hash of the block access list\n    balance_diffs_root: Root  # Root hash of the balance diffs\n    nonce_diffs_root: Root  # Root hash of the nonce diffs\n```",
        "created_at": "2025-05-28T15:44:51.009000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution Layer",
        "parent": "",
        "content": "If I'm reading this right, we may be able to skip the \"heal\" step in snap sync if we have all of the block access lists.  All of the changes from the heal step should be captured in the BAL \"value after\" fields.\n\n* Download all leaves with he pivot as currently specified\n* Download new blocks as the EL tells us\n* When an epoch is finalized, from the BAL we can calculate the \"net writes\" of the epoch\n  * We can aggregate epochs into larger write sets\n* After inital trie leaf download we write all of the \"net writes\" to the trie\n  * We don't compare the \"before\" as the leaves will have a variable times they were read\n  * What we really get from the \"sweep\" is unwritten leaves\n* we repeat these inserts until all finalized epochs are inserted\n* re-play or \"net write\" the non-finalized blocks as appropriate\n* sanity check the root, and perhaps \"heal\" if there were bugs in the client that missed data.",
        "created_at": "2025-05-28T16:50:08.770000+00:00",
        "attachments": null
    }
]