[
    {
        "author": "ethpandaops-devnet-pulse-v2",
        "category": "Cross-layer",
        "parent": "",
        "content": "",
        "created_at": "2025-11-25T01:00:00.308000+00:00",
        "attachments": null
    },
    {
        "author": "m0_ox",
        "category": "Cross-layer",
        "parent": "",
        "content": "We need to align on blob parameter values for the tests. Since named forks are getting removed from the `blobSchedule`, how do we feel about using only the scheduled BPOs for now and updating this as new BPOs are scheduled? For now BPOs 1 and 2 are scheduled, so both filling the tests with, and configuring hive for, BPO2 params.",
        "created_at": "2025-11-25T19:40:42.700000+00:00",
        "attachments": null
    },
    {
        "author": "m0_ox",
        "category": "Cross-layer",
        "parent": "",
        "content": "Actually we're reworking this in the test infrastructure, I'm just going to just turn off BPOs for now in hive for these simulators and we'll use Osaka's values for now.",
        "created_at": "2025-11-25T20:33:01.767000+00:00",
        "attachments": null
    },
    {
        "author": "m0_ox",
        "category": "Cross-layer",
        "parent": "",
        "content": "Released [bal@v1.8.0](https://github.com/ethereum/execution-spec-tests/releases/tag/bal%40v1.8.0) with one small update revealed from Besu tests on checking all static gas checks upfront before any state access in call opcodes (thanks \u003c@465903001156976682\u003e).",
        "created_at": "2025-11-25T22:51:48.320000+00:00",
        "attachments": null
    },
    {
        "author": "m0_ox",
        "category": "Cross-layer",
        "parent": "",
        "content": "This also gave us a tag to point to that fixes setting of the hive env vars to not use BPOs (as we weren't when filling the tests, we shouldn't set them in hive just yet) and to remove the gas schedule for named forks. I tested this against Nethermind locally and it seems to fix the issue with blob tests. This is a configuration and not part of the test vectors so if this needs any more updating, we can configure this without a new release.",
        "created_at": "2025-11-25T22:52:48.652000+00:00",
        "attachments": null
    }
]