[
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Anything that is optional has a good chance of being unavailable.",
        "created_at": "2025-08-04T02:52:04.699000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "If it is unavailable (ever) then we can't have stateless or partial state trustless clients.",
        "created_at": "2025-08-04T02:53:15.563000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Geth had or maybe still has a lightclient server that people need to run for a certain flavor of lightclients to exist.  No one ranthe server.  😢",
        "created_at": "2025-08-04T02:54:16.435000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution Layer",
        "parent": "",
        "content": "But this is data that can be reconstructed and the hash provides an in protocol verification.  Perhaps not much different from eth_proof but it is a middle step to stateless.",
        "created_at": "2025-08-04T03:20:00.787000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Execution Layer",
        "parent": "",
        "content": "Regarding system contracts, in particular 7002 and 7251, I was thinking that we can put the first 4 storage slots + post_values into the BAL. This should be everything needed to have a complete state diff (since the state changes in those system contracts at slots 3+ are all attached to transactions). Put differently, the system contract call can change the first 4 slots.",
        "created_at": "2025-08-04T09:39:21.452000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Execution Layer",
        "parent": "",
        "content": "Another argument for keeping storage locations is that it provides the protocol a complete overview over _ALL_ storage operation that occur in the block. I can see that this could be helpful in the future for block-level warming: by being able to statically infer storage accesses from the block, we can fairly distribute warming costs across transactions and and charge for the warming during execution (not relying on first executing all transaction to know how often a storage slot is touched).",
        "created_at": "2025-08-04T12:45:35.722000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "The reads can only be reconstructed if you have all of the state.\nThe writes can be reconstructed only if you execute the whole block.\nThe idea with a light RPC client is that you may not have all of the state (because you are disk constrained), and you may not execute every block (because you are CPU constrained).",
        "created_at": "2025-08-04T15:54:17.657000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Importantly, you may be disk constrained but not CPU constrained, and vice versa.  A light RPC client may not have pre-state, but may want to verify EVM execution (perhaps they are doing deep tracing to look for transactions involving a certain account).  Another light client may have a big disk for archiving purposes, but they are running on a resource constrained device like a cell phone that cannot afford to execute every block.",
        "created_at": "2025-08-04T15:55:41.135000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution Layer",
        "parent": "",
        "content": "But the light client doesn't care who constructs it.  It may come from the  network chatter, or it could be from someone with all the data re-creating it and sharing it somehow (interally, via a portal network mechanism, via paid service from a block explorer).  The utility here isn't just the traditional light client but analytics and offline evaluation would find it useful.  I don't think it is helpful to only consider this via the lens of traditional light client utility.",
        "created_at": "2025-08-04T15:56:48.195000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "That is why there are many of us, so I can ignore everything but light RPC clients and other people can lobby for features that help other node types.  😄",
        "created_at": "2025-08-04T15:57:34.105000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "My claim is that two different classes of light RPC clients benefit from either not needing to execute blocks (they need post-state) or from not having to store all state (they need pre-state).",
        "created_at": "2025-08-04T15:59:11.146000+00:00",
        "attachments": null
    }
]