[
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Just for context, with pre  and post we're talking about system contract calls that happen before transaction execution vs those that happen after tx execution.\n\nPre execution, we have the parent hashes and the beacon roots. \nPost execution, we have the withdrawal + consolidation contracts that change the state through dequeuing. Additionally we have balance changes through withdrawals.\n\nMy suggestion would be to put all system contract related state changes into the bal and link them to the tx index len(transactions) +1 = pretending system contract happen as the last transaction.\n* This keeps the tx index in block -\u003e tx index in bal mapping intact. Tx at index 0 in the block has tx index 0 in the BAL.\n* By looking at how many transactions the block contains, and checking the entries in the bal that have tx index = len(transactions) + 1, one gets the system contract changes and knows that those that happen pre execution need to be directly applied to the cache while the withdrawals + post execution states are important for post-state root calculation and sync.",
        "created_at": "2025-07-31T06:02:15.719000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Cross-layer",
        "parent": "",
        "content": "Can someone try to sell me on the value of sticking an SSZ structure in the middle of an RLP block body? I find \"possibility to create compact proofs\" kinda vague and unconvincing when weighed against needing to partially adopt SSZ on the EL.",
        "created_at": "2025-07-31T20:04:12.931000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah, this is a good point where more input is needed. \u003c@301186049323958275\u003e had some thoughts around it, and I can see why compact proofs against the BAL might be a nice feature in the future. \nAs stated above, I don't have a strong opinion here.",
        "created_at": "2025-07-31T20:08:56.921000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Cross-layer",
        "parent": "",
        "content": "i think the utility may hinge on if reads are included or not - aren't those important to a zk state proof?",
        "created_at": "2025-07-31T20:14:02.159000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "A proper light client would store current state in a flat DB, like Besu has a mode for now, and they would be able to process verify their state changes against a state change present in the header.",
        "created_at": "2025-07-31T20:29:25.266000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "It would be cool if we could *also* get a flat DB state hash to compare to, but I think that may be impossible (which is why MPTs are generally used).",
        "created_at": "2025-07-31T20:29:48.123000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Regarding SSZ though, we have had many opportunities to start the transition of ELs over to SSZ, and every time everyone seems to agree that SSZ is better than RLP and we should move to it, but every time the argument against it is, \"not this time, next time though\" (more or less).",
        "created_at": "2025-07-31T20:31:22.211000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "At some point we have to bite the bullet and just start the process.",
        "created_at": "2025-07-31T20:31:45.144000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Cross-layer",
        "parent": "",
        "content": "j'accuse!",
        "created_at": "2025-07-31T20:37:45.226000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Cross-layer",
        "parent": "",
        "content": "ok yeah i thought this was a \"can we get it in\" attempt. we should talk about it more",
        "created_at": "2025-07-31T20:38:10.012000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Cross-layer",
        "parent": "",
        "content": "not against it out of hand, but not sure i want to do it here.",
        "created_at": "2025-07-31T20:38:26.439000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Cross-layer",
        "parent": "",
        "content": "re the EIP, it doesn't seem to specify where in the block the new ssz structure goes. The bal_hash is spec'd to go at the end of the header, but the bal structure only gets:\n\n`The block body includes a BlockAccessList containing all account accesses and state changes.`",
        "created_at": "2025-07-31T20:39:32.090000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is exactly what someone has said about every prior attempt at including SSZ in the EL.  😖",
        "created_at": "2025-07-31T20:42:01.039000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "This does seem underspecified.  I would guess at the end of the current block ~~header~~ body, but certainly not clear from that quote at least.",
        "created_at": "2025-07-31T20:42:39.757000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Cross-layer",
        "parent": "",
        "content": "i am rekindling the ssz on the el discussion in \u003c#1295427781722898505\u003e",
        "created_at": "2025-07-31T20:47:50.949000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Cross-layer",
        "parent": "",
        "content": "spec actually says block BODY, not header",
        "created_at": "2025-07-31T20:49:38.480000+00:00",
        "attachments": null
    }
]