[
    {
        "author": "_shemnon",
        "category": "Cross-layer",
        "parent": "",
        "content": "That's independent of a forced linear TX chain.  All txes could increment the same slot, and incorporate that into observed outputs such as logs or args passed to other contracts, so there will always be a way to linearize a block. We would need to add explicit TX groupings into the block definition (and check for violations) to properly inceintivize it.  Way past what BAL proposes.",
        "created_at": "2025-07-20T03:50:21.180000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Cross-layer",
        "parent": "",
        "content": "The speedup I see is not parallel block execution, but aggregated data fetching from the DB. That is the bigger stopper, and until we get to some stateless form (if that comes before zk) DB will always be what dominates execution.",
        "created_at": "2025-07-20T03:51:49.105000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Even if all txs modify the same slot you can perfectly parallelize them with BAL. Assuming the tx gas limit cap is gas_limit/cores, then your total execution time will be the execution time of the heaviest tx - all txs run in parallel. The info in BALs is enough to get to an efficient grouping. With infinte cores, you can fully parallelize the block.",
        "created_at": "2025-07-20T04:43:47.877000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Cross-layer",
        "parent": "",
        "content": "Didn't slot sate pre-tx get cut from the spec?  That is what would be needed in this case, but is mostly not needed in the typical case.",
        "created_at": "2025-07-20T14:06:23.226000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Cross-layer",
        "parent": "",
        "content": "If we had delta writes to slots all we would need to prove is that the slot value can handle the range and parallel execution wouldn't need to worry about pre-execution values, just what the delta is. It also has privacy preserving aspects like the tx execution not needing to know the senders or receivers token balance.",
        "created_at": "2025-07-20T14:08:03.415000+00:00",
        "attachments": null
    }
]