[
    {
        "author": "jwasinger",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@402853454126776320\u003e  had an idea for simplifying the gas handling for CALL that we think is worth adopting.\n\nCurrently the logic is:\n\n* charge costs that aren't dependent on state lookup:\n  - access list costs for the target account\n  - memory expansion cost\n  - value transfer cost\n* check that we have enough gas to proceed\n* charge costs that depend on state lookup:\n  - new account creation cost\n  - eip 2929 access list costs if the target is a delegated contract\n  - calculation of gas available to sub-call per 63/64 rule.\n\nWe want to restructure the logic to:\n\n1. charge access list costs for the target account\n2. check that we have enough gas to proceed\n3. charge access list costs if the target is a delegated contract\n4. value transfer cost\n4. memory expansion cost\n6. new account creation cost\n7. calculation of gas available to sub-call per 63/64 rule.\n\nThe advantage here is that steps 4-7 are the \"legacy\" gas handling logic from before 2929/7702.  It allows us to reuse existing a lot of existing code, reducing the diff significantly.\n\nWhereas, as it's currently specified in 7928, the gas charging logic requires to break the legacy rules into the stateless and stateful components, interleaving the legacy logic with 2929/7702 logic.  This requires a larger change in a consensus-critical and complicated part of the code.",
        "created_at": "2026-01-21T05:32:13.197000+00:00",
        "attachments": null
    },
    {
        "author": "matkt0",
        "category": "Cross-layer",
        "parent": "",
        "content": "Besu tests",
        "created_at": "2026-01-21T07:10:00.107000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "Cross-layer",
        "parent": "",
        "content": "This looks very impl specific, this order does not mean it is done in all clients in that way.",
        "created_at": "2026-01-21T10:14:26.027000+00:00",
        "attachments": null
    }
]