[
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003cMarekM25\u003e Sorry for delayed answer.\n\nI think block gas smuggling is a great topic to cover in the next breakout (cc: @ben_a_adams )\n\nTogether with @marcin_d_s, we’ll prepare an EIP for ModExp.\n\nAt the moment, I’m personally super busy finalizing Pectra! :) (re @kevaundray: For the action items, does this seem correct?\n\n- @jacekglen to share the updated rsults for Gas Cost Estimator\n\n- (unassigned) to explore the impact of different repricing approaches on mainnet transaction throughput\n\n- (unassigned) to prepare a EIP proposal for adjusting the pricing of one or more operations based on the benchmark results\n\n- Possibly @MarekM25 / @ben_a_adams to investigate the feasibility and implications of using gas smuggling to decouple gas refunds from block gas usage\n\n- Possibly @davidecrapis to schedule follow-up call to discuss medium-term gas pricing roadmap\n\n- @nero_eth to share his work on block-level state warming)",
        "created_at": "2025-01-20T19:33:35.338000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003czhengxun_wu\u003e Wow something really changed? the first ever time eth insider open their exclusive discussion to some outsiders wow it was privilege of the same couple known names to even able to participate such discussion and make any change or proposal to eth lol",
        "created_at": "2025-01-20T20:16:48.923000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003csophiagold0\u003e ACD and breakout calls like this have always been open. We just haven’t done a great job of publicizing them (re @zhengxun_wu: Wow something really changed? the first ever time eth insider open their exclusive discussion to some outsiders wow it was privilege of the same couple known names to even able to participate such discussion and make any change or proposal to eth lol)",
        "created_at": "2025-01-20T20:28:46.026000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003craxhvl\u003e https://m.youtube.com/@EthereumProtocol/playlists (re @sophiagold0: ACD and breakout calls like this have always been open. We just haven’t done a great job of publicizing them)",
        "created_at": "2025-01-20T20:31:37.190000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003czhengxun_wu\u003e never knew it's something joinable thought it's internal dev call or something (actually somehow didn't even know what's ACD lol), but seem to be a good place (re @sophiagold0: ACD and breakout calls like this have always been open. We just haven’t done a great job of publicizing them)",
        "created_at": "2025-01-20T20:37:16.633000+00:00",
        "attachments": null
    }
]