[
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003civokub\u003e Hi all - I just saw this working group. I'm with Linea and we're interested in aligning EVM gas costs with actual proving costs. I finished yesterday a summary on the hash proving cost overhead compared to \"average-block\" proving cost. The writeup is available at https://hackmd.io/@ivokub/H1t9SIg2kl.",
        "created_at": "2025-03-18T11:51:05.914000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003cdavidecrapis\u003e this is very interesting and concrete analysis ivo, do you want to give a brief presentation of it (5-7min) in the next breakout? (re @ivokub: Hi all - I just saw this working group. I'm with Linea and we're interested in aligning EVM gas costs with actual proving costs. I finished yesterday a summary on the hash proving cost overhead compared to \"average-block\" proving cost. The writeup is available at https://hackmd.io/@ivokub/H1t9SIg2kl.)",
        "created_at": "2025-03-18T17:52:52.871000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003cdavidecrapis\u003e just scheduled next breakout for next Wed Mar 26, 2025, 16:00 UTC\n\nhttps://github.com/ethereum/pm/issues/1391",
        "created_at": "2025-03-18T17:53:44.931000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003cdavidecrapis\u003e pls comment to the issue or here with any topic you would like to discuss, we will finalize the agenda in the coming days",
        "created_at": "2025-03-18T17:54:22.921000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003cthogard\u003e Do you foresee zk rollup opcode costs diverging from L1 opcode costs to account for this? (re @ivokub: Hi all - I just saw this working group. I'm with Linea and we're interested in aligning EVM gas costs with actual proving costs. I finished yesterday a summary on the hash proving cost overhead compared to \"average-block\" proving cost. The writeup is available at https://hackmd.io/@ivokub/H1t9SIg2kl.)",
        "created_at": "2025-03-18T19:28:25.321000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003cchfast\u003e This report suggest that blake2bf is unused, but this is actually not true (https://etherscan.io/address/0x0000000000000000000000000000000000000009/advanced#internaltx). So either your sample of transactions is too small, or you collected the data incorrectly, or etherscan is wrong. (re @ivokub: Hi all - I just saw this working group. I'm with Linea and we're interested in aligning EVM gas costs with actual proving costs. I finished yesterday a summary on the hash proving cost overhead compared to \"average-block\" proving cost. The writeup is available at https://hackmd.io/@ivokub/H1t9SIg2kl.)",
        "created_at": "2025-03-18T19:35:55.767000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003civokub\u003e That would be great - I'll comment on the issue. (re @davidecrapis: this is very interesting and concrete analysis ivo, do you want to give a brief presentation of it (5-7min) in the next breakout?)",
        "created_at": "2025-03-18T20:19:37.049000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003civokub\u003e This may happen - there are a few rollup improvement proposals for unifying the different discrepancies rollups have (for example L1SLOAD seems to get a bit of traction https://github.com/ethereum/RIPs/blob/master/RIPS/rip-7728.md). But with proposed `EXECUTE` precompile it may become important that the proving cost corresponds to the hash cost, so I think there could be interest both for L1 and zk-L2s (re @thogard: Do you foresee zk rollup opcode costs diverging from L1 opcode costs to account for this?)",
        "created_at": "2025-03-18T20:22:50.562000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003cthogard\u003e Hmm. I think it would be very unfortunate if Ethereum L1 apps had to subsidize the gas cost of zk L2s by paying zk-proof-based gas costs for hashing functions that don’t need to be proved.",
        "created_at": "2025-03-18T20:26:06.150000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003cthogard\u003e Maybe the cost difference could be altered only inside of the execute precompile?",
        "created_at": "2025-03-18T20:26:54.792000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003cthogard\u003e Although I may be misunderstanding how that’s used.",
        "created_at": "2025-03-18T20:27:35.807000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003civokub\u003e Yup, I sampled 670 blocks 21733089-21733759 which contain a bit more than 100k transactions. The goal was to prove all the blocks and having significantly more blocks would have increased the proving time. When I'm looking at the linked list then it seems the sender seems to be 0x71518580f36FeCEFfE0721F06bA4703218cD7F63, this sender has only a single transaction within the sampled range 0x31b5c97fcea72cab8c87c447ef86d8ccf53eab90a704721d36f5eb4aa37208cd which doesn't contain blake2f precompile call. So I guess it just wasn't in my sample (re @chfast: This report suggest that blake2bf is unused, but this is actually not true (https://etherscan.io/address/0x0000000000000000000000000000000000000009/advanced#internaltx). So either your sample of transactions is too small, or you collected the data incorrectly, or etherscan is wrong.)",
        "created_at": "2025-03-18T20:27:40.751000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003civokub\u003e Indeed - I also tried to trace all the transactions to see how much gas is actually spent in the transactions. For keccak hash it is about 0.59% of total gas used (on average), so repricing the hash function gas wouldn't affect total gas usage that much considering the proposed 3x increase. (re @thogard: Hmm. I think it would be very unfortunate if Ethereum L1 apps had to subsidize the gas cost of zk L2s by paying zk-proof-based gas costs for hashing functions that don’t need to be proved.)",
        "created_at": "2025-03-18T20:30:12.401000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003cthogard\u003e I’d caution against using a smoothed-out average",
        "created_at": "2025-03-18T20:31:20.522000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003civokub\u003e This could be an option - but would mean that the precompile pricing would become a lot more difficult. Currently it is proposed as `gas_used*gas_price` (re @thogard: Maybe the cost difference could be altered only inside of the execute precompile?)",
        "created_at": "2025-03-18T20:31:51.184000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003cthogard\u003e Things like verifying a merkle proof would get hit hard. Many other apps wouldn’t be affected at all",
        "created_at": "2025-03-18T20:31:52.818000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003civokub\u003e Completely agree! I also looked at transactions, senders and receivers which use the most gas. The maximum hash function gas usage was at 6% for total transaction gas usage. (re @thogard: I’d caution against using a smoothed-out average)",
        "created_at": "2025-03-18T20:32:52.295000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003cthogard\u003e Hmm. Thats actually not too bad - I was expecting higher. I guess Sstore remains king since you wouldn’t really ever hash something without reading or writing to storage (re @ivokub: Completely agree! I also looked at transactions, senders and receivers which use the most gas. The maximum hash function gas usage was at 6% for total transaction gas usage.)",
        "created_at": "2025-03-18T20:34:31.827000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003civokub\u003e Indeed - for this the possible mitigation would be to redefine the dynamic gas computation mechanism - keccak internally works on 136byte rounds (keccak permutation rate), but we price them according to 32-byte word lengths. Proving wise it doesn't make a difference if we run keccak-f permutation on 64-byte or 128-byte input, so the applications can potentially use wider Merkle trees, requiring less keccak calls (re @thogard: Things like verifying a merkle proof would get hit hard. Many other apps wouldn’t be affected at all)",
        "created_at": "2025-03-18T20:34:37.665000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003civokub\u003e I need to leave now, it is already late here, but the questions are spot on. I'd love to explain further at the next call and also in the chat",
        "created_at": "2025-03-18T20:37:15.758000+00:00",
        "attachments": null
    }
]