[
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e \u003c@!574864862338088960\u003e Can't we do most stress testing, economic simulations, etc. on a single-client test network rather than an integration test network?\nIMO we _could_ but I'm not sure it's optimal. I feel like it's equivalent to testing the \"happy path\" in a way, especially given a lot of the issues we've seen aren't necessarily about the consensus, but just all the other parts of the client",
        "created_at": "2020-09-04T02:43:03.642000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e I think perhaps the reason we aren't all in agreement on the path forward is because we don't agree on how \"certain\" we are about 1559 inclusion.  For example, I do not feel a need for the stress testing because I think that the 1559 change is sufficiently small/uninteresting and I don't feel a need for economic modeling because I'm confident in what has been done so far.\nYeah, I feel I'm roughly a polar opposite here 😄 My intuition is mostly guided by how hard it has been to bring large changes onto mainnet. For example, EIP-1962 got shut down partially because of potential complications, and it was much simpler. ProgPow, which you could argue had less of an impact (only miners, not actual transactions) was much more developed when it was brought forward than 1559 is now. \n\nI wasn't really into protocol development in the early days, but IMO 1559 is the largest mainnet change since I've been following from roughly 2017. Someone with more historical knowledge will probably know better though 😅",
        "created_at": "2020-09-04T02:45:45.035000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e So one thing we don't talk about enough perhaps is the possibility of doing 1559 at first without the new transaction type\nCan you expand on this \u003c@!273808422753796097\u003e ? Are you saying we make the base fee part of the block header, double the block size, keep the same increase/decrease based on the 50% block utilization and you just burn the difference between the total fee and base fee?",
        "created_at": "2020-09-04T02:48:40.740000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In that case, wouldn't you keep much of the UX improvements? You can query the BASE FEE in the block header and get much better estimation",
        "created_at": "2020-09-04T02:49:20.161000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You just can't be super granular about what tip you want to put in, which seems like a pretty minor thing.",
        "created_at": "2020-09-04T02:49:48.053000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e It is unclear to me why the changes are slowing things down?  The impression I am getting (from the outside) is that Geth and Besu are done with implementation until there is agreement on what to do next, and no other client is actively implementing.\n\u003c@!301186049323958275\u003e ICYMI we have \u003c#749160974506000444\u003e for the details of the implementations 🙂",
        "created_at": "2020-09-04T02:51:15.536000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "ProgPoW is a pretty large *technical* change IMO, and it is code that is pretty difficult for most developers to evaluate and audit due to the nature of its design.  It also comes with a whole world of political problems.  1559 is a very simple technical change, which any developer should be able to easily evaluate/audit.  It also comes with a bunch of political problems.",
        "created_at": "2020-09-04T03:05:50.408000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If we are just talking about the technical side, I think that 1559 is actually on the simpler end of the spectrum with regards to consensus changes.  On the economic side, it is definitely pretty big.  On the political side, it is also on the large side of the spectrum.",
        "created_at": "2020-09-04T03:06:50.864000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e In that case, wouldn't you keep much of the UX improvements? You can query the BASE FEE in the block header and get much better estimation\n\u003c@!552133098075193354\u003e With 1559 transactions, the user can pick a large number of base fee (e.g., 2x current base fee) and they'll only pay the actual base fee which in almost all cases will be less.  With legacy transactions auto-converted to 1559, if the user picks a similarly large number, they will pay any excess to miners.  The big UX win with 1559 transactions is that the users can just set a maximum, and they'll pay the minimum required to be included in the block, rather than being guaranteed to pay the maximum (like they do now).",
        "created_at": "2020-09-04T03:12:14.536000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e ICYMI we have \u003c#749160974506000444\u003e for the details of the implementations 🙂\nYeah, I have been following that channel and the only issue I have seen is just \"oops, we didn't program the same thing\".\n\u003e IMO we could but I'm not sure it's optimal. I feel like it's equivalent to testing the \"happy path\" in a way, especially given a lot of the issues we've seen aren't necessarily about the consensus, but just all the other parts of the client\nTo be clear, I *do* think that we need to integration test all of the edge cases sometime before production release to make sure that we don't have a post-release consensus failures.  What I don't think we need to do is stress testing or economic modelling on an integration test network as we don't really gain anything and it makes doing those tests much harder because we have to ensure everyone is in sync for it.",
        "created_at": "2020-09-04T03:16:15.902000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e In that case, wouldn't you keep much of the UX improvements? You can query the BASE FEE in the block header and get much better estimation\n\u003e You just can't be super granular about what tip you want to put in, which seems like a pretty minor thing.",
        "created_at": "2020-09-04T15:14:43.603000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah I agree with this",
        "created_at": "2020-09-04T15:14:46.779000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think 1559 without the new tx type gives ~50-60% of the UX improvements of full-on 1559",
        "created_at": "2020-09-04T15:15:04.137000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "1559 is absolutely simple technically, the only complexity is in the consequences",
        "created_at": "2020-09-04T15:16:07.798000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If we want \"more assurance\", then I recommend talking to filecoin devs more, they got the testnet that's already using it!",
        "created_at": "2020-09-04T15:19:38.320000+00:00",
        "attachments": []
    },
    {
        "author": "afdudley",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah, but they don't have any legacy clients.",
        "created_at": "2020-09-04T16:02:22.952000+00:00",
        "attachments": []
    },
    {
        "author": "afdudley",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "or full blocks?",
        "created_at": "2020-09-04T16:02:26.907000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "IIRC they have mostly empty blocks, but they have some full ones periodically.",
        "created_at": "2020-09-04T16:19:27.743000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So their base fee is *usually* 0, but sometimes pops up above 0.",
        "created_at": "2020-09-04T16:19:41.207000+00:00",
        "attachments": []
    }
]