[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!707707212184944702\u003e I tried to integrate your feedback, splitting the article into a \"feels\" portion a technical portion. I also included a bit about 1559 solving the problem in the feels portion so if someone only reads that half of the article it has a conclusion.",
        "created_at": "2020-11-07T04:10:32.695000+00:00",
        "attachments": []
    },
    {
        "author": "philcares",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e I like it, cause you sent a clear message that EIP-1559 will end the current mess and yet you spurred me to read all of it, cause I wanted to dig through the more technical stuff 🙂",
        "created_at": "2020-11-07T06:24:41.469000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I went ahead and published, if anyone has additional feedback I'm open to changes/edits: \u003chttps://medium.com/@MicahZoltu/a-tale-of-two-pricing-schemes-dc9c8717906\u003e",
        "created_at": "2020-11-07T06:25:17.477000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i missed the draft! I like the story you weave at the beginning, definitely captured some of my experience when i started with ethereum lol\n\ntwo comments I have, curious to hear what you think\n1) i don't expect \"average users\" to be on layer 1 in about one to three years from now. if they are doing payments as the coinbase wallet helps them do, they will definitely be on L2. so i don't expect they would even have to set anything but how much they are sending and to whom. but eip1559 isn't just a UX improvement for the average user, it's also one for \"power users\" e.g., rollups closing their batches on L1 and all the other txs they need to do\n2) that said, assuming the user is on L1, I don't even think coinbase wallet would ask them their maximum willingness to pay for the transaction. they could just quote the current price for them, set the max fee to twice the basefee and likely their transactions would go through. the user would only need to decide if they are willing to pay the current gas price. then a metamask user (assumed more knowledgeable than a coinbase one) could have an additional screen when basefee is increasing rapidly where they set their parameters more finely, but even for them a yes/no UX would work well most of the time",
        "created_at": "2020-11-07T06:44:13.887000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Layer 2 is going to have the same problems as layer 1 in terms of deciding who gets into a block.",
        "created_at": "2020-11-07T06:47:44.305000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Unless you are referring to centralized layer 2, which I don't *personally* care about at all.  🙂",
        "created_at": "2020-11-07T06:47:57.161000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e To make matters worse, you always pay the full amount of gas price that you estimate, even if you over-estimate! This means there is a strong desire for everyone to try to low-ball their gas price in hopes of getting a deal. Even if you don’t want to low-ball, you often want to at least not overpay by a large amount so you choose a middle-of-the-road number that you suspect will get you included in a block relatively quickly.\nthis is really on point btw, nice description of the current state",
        "created_at": "2020-11-07T06:48:25.022000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e I don't even think Coinbase wallet would ask them their maximum willingness to pay for the transaction.\nYeah, I believe this to be the case as well.  I tried to express that somewhere in there, but I'm guessing it got lost in the wall of text.  😢",
        "created_at": "2020-11-07T06:48:57.391000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e Layer 2 is going to have the same problems as layer 1 in terms of deciding who gets into a block.\n\u003c@!301186049323958275\u003e true, and I think some are even looking at 1559 to deal with this. but at least you don't have that transaction pending problem crashing with all your other transactions",
        "created_at": "2020-11-07T06:51:20.590000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "at least it feels being on L2 there is more space for operators to deal with the transaction issues than there is for anyone else other than the user to at L1",
        "created_at": "2020-11-07T06:51:51.632000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I believe you likely still will on Layer 2, unless L2 solutions come up with some novel solutions.",
        "created_at": "2020-11-07T06:51:59.251000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I suspect we may be talking about different \"layer 2\"s.",
        "created_at": "2020-11-07T06:52:14.203000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm pretty firmly in the camp that Layer 1 should be a data availability layer, which means all transactions touch layer 1.",
        "created_at": "2020-11-07T06:52:37.257000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If you are *only* broadcasting your transaction on layer 2 then you have a data availability problem that is actually very hard to solve in a censorship resistant way, and if you do you basically end up authoring another entire blockchain.",
        "created_at": "2020-11-07T06:53:13.762000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "All transactions should show up on layer 1 IMO, even if *execution* is on layer 2.  That way Ethereum solves the very hard problem of data availability.",
        "created_at": "2020-11-07T06:53:34.736000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "hmm makes sense, i guess in my mind coinbase could do what loopring or zksync are currently doing, operate their own payment network and shield the user from ever going on L1",
        "created_at": "2020-11-07T06:56:57.291000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Sure, if you are just looking for a fully trusted solution that works.  Coinbase Wallet is *supposed* to be trustless though.",
        "created_at": "2020-11-07T07:01:33.173000+00:00",
        "attachments": []
    }
]