[
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I just had a call with \u003c@!552133098075193354\u003e, \u003c@!574864862338088960\u003e and Ratan Sur about EIP-1559. Just wanted to clarify where we stand regarding geth integration. We have an open PR for it, which we reviewed a bit. The PR is too complicated right now and we will need to redo it. There are some open questions on our side about the EIP:",
        "created_at": "2020-10-14T17:48:13.003000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(1) The block gas elasticity is required by the EIP, but I think moving the limit to 2x current gas limit at the time of fork is a bit much. We agreed that it might be better to set it less high initially.",
        "created_at": "2020-10-14T17:49:28.401000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(2) There is no definitive TX scoring function in the EIP. It would be nice to define one. This would really simplify the txpool implementation.",
        "created_at": "2020-10-14T17:51:08.105000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We also talked about improving block propagation. Long term, we will need to improve it in order to allow for larger blocks. One idea that came up is to add a network operation that fetches a selected subset of block transactions. This would help with propagation because the full nodes will have most of the transactions anyway.",
        "created_at": "2020-10-14T17:54:14.386000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think it would be nice to have this in general because it also provides some incentive to send TXs in public before including them in a block (if you just publish a full block with transactions that were unknown to everyone else before, propagating this block will be much slower)",
        "created_at": "2020-10-14T17:54:54.260000+00:00",
        "attachments": null
    }
]