[
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!636212126939217941\u003e I've started running a full node using DAppNode, it was very easy (once you have the hardware). I was using this data to look at such things: https://ethereum.github.io/rig/ethdata/notebooks/explore_data.html",
        "created_at": "2020-07-07T09:14:26.241000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "happy to chat more! there are really cool things to explore there",
        "created_at": "2020-07-07T09:15:01.559000+00:00",
        "attachments": []
    },
    {
        "author": "abdel.stark",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I initiated a tool to fill the future EIP-1559 testnet with transactions. The goal is to check whether the network can handle larger blocks and also to simulate the impact of EIP-1559 itself as described in https://github.com/hyperledger/besu/issues/1167. The tool generates random value transfers and can submit transactions to a list of predefined nodes (handling new RLP encoding and signature process for EIP-1559 transactions). Ideally the tool would also deploy smart contracts (including big ones) and generates random calls to those smart contracts. The tool is modular and can take input transactions from an external source through a message broker(NATS). We can then connect many different agents to generate transactions simulating different behaviours. I am working with \u003c@!486501030046203915\u003e to implement a proof of concept, the idea is that the agent based simulators generate realistic transactions, with different scenarios, and publish the different parameters (gasPrice, gasPremium, feeCap) to a specific topic and the transaction fuzzer will consume those data and create and sign transactions to submit them to nodes using eth_sendRawTransaction RPC endpoint. We will try to create a publicly available NATS server connected to the future EIP-1559 testnet. If anyone is working on simulations i can share more details on how to connect things. The tool is available here: https://github.com/PegaSysEng/eip1559-tx-sender/",
        "created_at": "2020-07-07T16:29:25.010000+00:00",
        "attachments": []
    },
    {
        "author": "abdel.stark",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The tool is in experimental status but I think it could be used more generally if we get good results with EIP-1559 simulations.",
        "created_at": "2020-07-07T16:34:46.967000+00:00",
        "attachments": []
    }
]