[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That seems like it is just asking the core devs to write the \"hard\" (not actually very hard) part of the script for you.",
        "created_at": "2020-09-16T01:48:51.070000+00:00",
        "attachments": []
    },
    {
        "author": "tjayrush",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It's not hard at all actually (see the article). But it removes the 'doubt' that the maxis take advantage from the equation. (Yes, political considerations -- especially when you can remove them -- sometimes matter.) It's a compromise between not doing anything and doing something that has a negative effect on the consensus and/or the size of data on disc.",
        "created_at": "2020-09-16T03:07:37.443000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My general problem is that I don't think we should be engineering based on the whims of a group of people whose sole goal is to throw shade and have no intention to ever using the platform.  Calculating the total supply is not particularly hard, and many people have done it, many people have gotten the same result from separate implementations, and no one particularly cared when the results were announced.",
        "created_at": "2020-09-16T03:11:24.205000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If we move to a mud slinging process for engineering, we'll just end up spending all of our time/resources catering to the mud slingers latest whims and desires rather than building actually useful software.",
        "created_at": "2020-09-16T03:11:56.413000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Also, I believe that introducing this into the clients is just training the maxis that if they throw enough mud they can derail our development.",
        "created_at": "2020-09-16T03:12:22.684000+00:00",
        "attachments": []
    },
    {
        "author": "tjayrush",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Granted. No-one seemed to care. Granted. Don't want to train people to complain and get what they want. What's the engineering downside? There's no effect on consensus or size of data on disc, so it's a one time 20? line code?",
        "created_at": "2020-09-16T03:13:05.928000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If any client wants to add this I definitely don't think we should stop them.  I am just against:\n1. Introducing it into consensus\n2. Asking core developers to spend their very limited time on this (even if it is a small amount of work)\n3. Introducing some standard mechanism for this (standards take time and energy to design, build, and test)",
        "created_at": "2020-09-16T03:14:19.584000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Just the \"increasing technical debt/code complexity/code volume\" aspect alone may be enough to warrant not merging it into a client even if someone else does the work.",
        "created_at": "2020-09-16T03:15:36.247000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Core developers are *incredibly* engineering constrained, and anything we can do outside of the clients probably *should* be done outside of the clients just to reduce the amount of code they have to maintain.",
        "created_at": "2020-09-16T03:16:12.369000+00:00",
        "attachments": []
    },
    {
        "author": "tjayrush",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks for the consideration. I guess we're off topic...Cheers.",
        "created_at": "2020-09-16T03:21:53.205000+00:00",
        "attachments": []
    },
    {
        "author": "madeof_tin7509",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e My general problem is that I don't think we should be engineering based on the whims of a group of people whose sole goal is to throw shade and have no intention to ever using the platform. \n\u003c@301186049323958275\u003e  \n\nTo not do it because they are mud slinging gives them equal power. We should really consider it on its own merit and not let their opinion swing it either way. Imo",
        "created_at": "2020-09-16T05:32:40.244000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Agreed.  I am not personally convinced that there is a sufficiently good reason to add it once we ignore the mud slinging aspect.  Definitely not a sufficient reason to task core developers to it.",
        "created_at": "2020-09-16T05:34:49.940000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "1. How long implementing this would take for ETH1 and ETH2 respectively?\n2. How much value does this have as a feature for Ethereum?\n3. What do we push aside to prioritize this supply auditing feature?",
        "created_at": "2020-09-16T05:35:30.998000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Imo it sounds like ETH2.0 has already plenty of features to deliver that are critical for its success and working on non-essential ones until then seems like a distraction. I don't think it's a useless feature at all, I just think there are much more important ones to be completed at the moment and for the forseable future",
        "created_at": "2020-09-16T05:36:54.820000+00:00",
        "attachments": []
    },
    {
        "author": "tjayrush",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The suggestion I made (adding RPC commands -- which are of dubious necessity) is the minimal amount of work devs would have to do and still improve the ability to get the numbers easier. No change to consensus. No increase in on-chain data size. push--\u003eback burner",
        "created_at": "2020-09-16T11:52:53.717000+00:00",
        "attachments": []
    }
]