[
    {
        "author": "afdudley",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "conceptually if we just replace \"spec freeze\" with \"spec versioning\" i think everything is fine, that's what I took the air quotes to mean anyway.",
        "created_at": "2020-09-01T00:34:15.906000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Sorry for the lack of clarity.  I think integration testing is valuable, but I don't think there is a whole lot of value in running those early integration testnets for extended periods of time.  I believe most integration testing bugs showed up basically as soon as a new client tried to connect, not after it was running for 2 weeks?",
        "created_at": "2020-09-01T03:02:01.079000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Basically, I think there are incredibly steep diminishing returns on integration testnets, where you get almost all of the value up front.  Sometime before launch we *should* do a long term integration testnet, but Ropsten, Rinkeby, Kovan, etc. are better for that IMO.",
        "created_at": "2020-09-01T03:03:05.054000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And maybe one integration testnet that is explicitly designed to exercise some edge cases (doesn't need to run for a long time, but it does need to hit a bunch of edges).",
        "created_at": "2020-09-01T03:03:37.630000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "For test scenarios, I think it would be interesting/useful to see what happens when individual actors have a fee threshold, and when the base fee is higher than that they leave and come back to try again after some period of time (e.g., an hour, a day, a week).",
        "created_at": "2020-09-01T03:36:40.430000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "right I guess my more detailed view is that I think we should have a testnet, but it should be a testnet with actual usage",
        "created_at": "2020-09-01T07:19:16.168000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Not a \"hey let's spin up a thing, and then artificially throw some transactions on it\"",
        "created_at": "2020-09-01T07:19:20.811000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Lobbying strongly for one in the (Ropsten, Goerli...) family to adopt 1559 quickly would be nice",
        "created_at": "2020-09-01T07:20:01.138000+00:00",
        "attachments": []
    },
    {
        "author": "rinku6993",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "@jhg saying. There's always the authoritarian monetary policy inflation trick: reduce the cost of all operations by 90% in an emergency hard fork.\n\n(N.B.: this is not a serious suggestion)",
        "created_at": "2020-09-01T07:45:43.377000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Agreed that versioning would help, yes. This way we can run one version of the spec and also implement others. It's also helpful to push back things to \"farther\" versions if they are good ideas but not the bottleneck right now.",
        "created_at": "2020-09-01T12:13:54.463000+00:00",
        "attachments": []
    }
]