[
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e Has anyone looked at the Celo implementation of 1559?\n\u003c@!332923501079953409\u003e from what i gather, it's a fairly different implementation. There is a deployed contract, \"GasPriceMinimum\" (here: https://explorer.celo.org/address/0xba53ef24579b1b505f823ac6be85e7ae3b0b38e5/contracts, with the update rule in the last function) that is called by the client code (here: https://github.com/celo-org/celo-blockchain/blob/16e1c70f363451b66712a99540bc03716d93c565/contract_comm/gasprice_minimum/gasprice_minimum.go) to obtain the basefee (`GasPriceMinimum`)",
        "created_at": "2020-08-25T04:15:21.916000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "the blocks are mostly empty, and there is a gas price floor set in the contract. I am not sure what the basefee is now but likely it has hit the floor by now",
        "created_at": "2020-08-25T04:16:44.219000+00:00",
        "attachments": []
    },
    {
        "author": "afdudley",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So there is a decent chance that it simply doesn't work?",
        "created_at": "2020-08-25T11:40:57.049000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "how do you mean? the implementation or the fact that basefee is low? if the latter it would be strictly due to the current low volume of transactions rather than collusion i would say",
        "created_at": "2020-08-25T13:23:04.695000+00:00",
        "attachments": []
    },
    {
        "author": "afdudley",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What I'm trying to say is we probably don't know what their implementation actually does, or rather how would we go about figuring that out without running our own testnet?",
        "created_at": "2020-08-25T17:47:39.474000+00:00",
        "attachments": []
    },
    {
        "author": "pintail_xyz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "really grateful for any thoughts/input on this article: https://medium.com/@pintail/ethereum-fee-market-reform-eip-1559-as-a-question-of-fairness-567c52dac017\n\nIt's intended partly as a reference as it's full of links to relevant papers (mostly by \u003c@!273808422753796097\u003e), but also just because there's an awful lot of hype around the EIP. For people trying to understand the proposal, there are now resources spread through quite a few places and it may be hard to find them buried in the noise.\n\nThe other aspect to it is the \"fairness\" part - the argument that at present miners are essentially extracting rent from a community resource (blockspace), and it makes much more sense to return surplus fees to Ether holders, who pay to keep the blockchain running through issuance. I don't think I've really seen people making this argument, so I thought perhaps it would add something useful to the discussion.",
        "created_at": "2020-08-25T17:58:17.786000+00:00",
        "attachments": []
    },
    {
        "author": "afdudley",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "you don't see that argument a lot because it's fairly indirect...",
        "created_at": "2020-08-25T22:38:02.506000+00:00",
        "attachments": []
    }
]