[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What is the argument for taking block sizing power awafsy from miners?",
        "created_at": "2020-05-08T13:11:35.461000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As we have seen with Bitcoin and now Ethereum, governance by fork is hard and we should try to limit the set of things that require governance for ongoing maintenance.  Currently, the block gas limit is set by miners and they *should* be raising it as block processing costs go down (improved clients, better hardware).  Requiring core devs to decide when to raise the block gas limit and do so via a fork (with all of the conflict that comes with that) feels like a big step backwards.",
        "created_at": "2020-05-08T13:13:57.798000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It seems like we could retain miner-voted block gas limits while still implementing EIP-1559.  Why was the removal of mdneroted block gas limits bundled with 1559?",
        "created_at": "2020-05-08T13:14:59.116000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e I think we could do that by leaving miners to choose the block size but still aiming for them to be 50% full",
        "created_at": "2020-05-08T13:56:26.521000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But maybe there are some ways in which this creates weird incentives.",
        "created_at": "2020-05-08T13:56:49.574000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I thought maybe that was the case (weird incentives) but I wasn't able to think of anything after 2 minutes of thought.  🙂",
        "created_at": "2020-05-08T13:57:25.821000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Without a weird incentive, it feels like the block size being set by core devs instead of miners is a rider, which I think is a sign of unhealthy governance.",
        "created_at": "2020-05-08T13:58:51.476000+00:00",
        "attachments": []
    }
]