[
    {
        "author": "amanusk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hi All 👋 \nI'd like to join the convo with some questions. I'll try and go through this entire thread when possible, so please excuse me if I repeat answered questions and please refer me to the right place when applicable. \n\nI'd like to understand what would be the user experience once this EIP goes live. From what I understand, the only fee the user will have to provide is the fee cap. Out of that, the base fee will be burned, depending on what is the base fee in the given block, and the bribe will be paid to the miner. Or are there more parameters the users should provide when creating a tx?",
        "created_at": "2020-10-20T13:16:25.388000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!641937777482792991\u003e In theory, the user can set the fee cap and the miner bribe.  However, I believe most (if not all) wallets will set the miner bribe for the user based on historical miner bribe demands.  It is possible that a wallet may present the miner bribe selection as a \"transaction speed\" variable, where it looks at historical miner bribes across blocks and gauges probability of the miner bribe being high enough for the next block.",
        "created_at": "2020-10-20T13:33:21.623000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The fee cap could be set by the user as well, though one can imagine the fee cap being automatically set to `base_fee * 2 + miner_bribe` or something, which is a very reasonable default.",
        "created_at": "2020-10-20T13:34:02.975000+00:00",
        "attachments": null
    },
    {
        "author": "amanusk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What I find confusing about this, is that although the base fee is known for the next block (correct me if I'm wrong), but not so much for blocks in the future.\nSo as a user (or wallet), i'd like to give some a fee quote, that is not necessarily for the next block, but for some number of blocks in the future.\nIn that time both base fee and bribe will change according to network behavior and what miners chose to do.\nSo does it make sense to set only the feecap, (pretty much similar to what is done now)?\nAfter all, as a user I don't really care if the fee is burned or goes to miners",
        "created_at": "2020-10-20T14:13:22.839000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e What I find confusing about this, is that although the base fee is known for the next block (correct me if I'm wrong), but not so much for blocks in the future.\n\u003e So as a user (or wallet), i'd like to give some a fee quote, that is not necessarily for the next block, but for some number of blocks in the future.\n\u003e In that time both base fee and bribe will change according to network behavior and what miners chose to do.\n\u003e So does it make sense to set only the feecap, (pretty much similar to what is done now)?\n\u003e After all, as a user I don't really care if the fee is burned or goes to miners\n\u003c@!641937777482792991\u003e The base fee can move by a maximum amount each block, so we can predict the range of possible base fees an unbounded number of blocks out.",
        "created_at": "2020-10-20T14:41:58.843000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!641937777482792991\u003e The big win of 1559 in terms of UX is that the fee cap is not all spent if it isn't needed.  With gas price, you *always* spend the full gas price even if you over-bid by a large amount.  With the 1559 fee cap, you will spend the smallest amount possible up to the fee cap you set, but you can be confident that you didn't spend any more than you had to on the base fee.",
        "created_at": "2020-10-20T14:43:16.732000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!641937777482792991\u003e vitalik released slides recently describing some of these aspects (https://vitalik.ca/files/misc_files/EIP_1559_Fee_Structure.pdf)\ni've also presented a deck at ETHTaipei last week (https://docs.google.com/presentation/d/1AHQAgLqAIsiF_Vd2pcYaMBvg0v8d-01_yzsWJLOLj4I/edit) if you are keen to check more",
        "created_at": "2020-10-20T15:33:23.431000+00:00",
        "attachments": null
    },
    {
        "author": "amanusk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks \u003c@!486501030046203915\u003e I'll go over these 🙂 \n\nThanks for the explanation \u003c@!301186049323958275\u003e. I see now why would need to specify both.\n\nAnother question I had, is how do you invasion miners will behave in network conditions similar to what they are now, or a month ago. i.e. when there is always more demand for block space. How are miners expected to operate?\nI assume they will always try to increase the block as much as possible until there are no more tx available with a cap higher than the base fee. Only then will they be forced to decrease the block.\nWhat I'm trying to say is, seems that in the steady-state, all the fee cap will be used up. Does this make sense?",
        "created_at": "2020-10-20T16:21:37.258000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Rational miners should set their miner bribe demand to just above opportunity cost of inclusion.",
        "created_at": "2020-10-20T16:31:50.263000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As for the block limit, historically miners have not behaved rationally on that front, so I'm not sure what they will do.",
        "created_at": "2020-10-20T16:32:22.967000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "1559 does remove a disincentive for increasing the block size, but it doesn't add an incentive.",
        "created_at": "2020-10-20T16:33:19.563000+00:00",
        "attachments": null
    },
    {
        "author": "amanusk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Maybe I'm not imagining this right, but let's say that blocks are now all 10M gas, and base fee is, say 30.\nEveryone sets their fee cap to 2*30+1, as you suggested.\nThe rational thing for a miner to do, is to include as many txs as possible up to 20M.\nNext block base fee is 32, but still has there are plenty of txs willing to pay 60.\nSo on and so on, until base fee is 60.\nOnly then will blocks start getting smaller, because there are not enough txs willing to pay the high basefee.\nSo as a user, seems like I still don't know when will my tx be included, and also don't know how much will I pay (only upper bound).\n\nJust as a thought experiment, how do you envision this paly out?",
        "created_at": "2020-10-20T16:43:24.373000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Oh, yes.  What you described is correct.",
        "created_at": "2020-10-20T16:48:19.055000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "However, what you have to keep in mind is that once equilibrium is reached, it requires a sudden spike in transaction volume to fill a block.",
        "created_at": "2020-10-20T16:48:54.415000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Start your mental exercise with a pending pool filled with transactions below 60, and current base fee of 60.",
        "created_at": "2020-10-20T16:49:29.080000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@641937777482792991\u003e",
        "created_at": "2020-10-20T16:49:31.607000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "During times of sudden congestion, inclusion time becomes more uncertain.  However, times of *sudden* volatility is rare.",
        "created_at": "2020-10-20T16:50:16.605000+00:00",
        "attachments": null
    },
    {
        "author": "amanusk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'll think about it 🙂 \nIs the plan to have some sort of time-based priority, so that if I've quoted 50 base fee, and was waiting for it to drop from 60 to 50, I'll get prioritized over someone who has just joined and also quotes 50 base fee?\n(This of course can only be a default impl, not a requirement for miners)",
        "created_at": "2020-10-20T18:23:39.903000+00:00",
        "attachments": null
    }
]