[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The todos in the spec are meant to indicate that someone actually implementing should do that thing around there.",
        "created_at": "2021-07-30T02:44:06.961000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There was never any intent in filling that in.",
        "created_at": "2021-07-30T02:44:15.811000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Test cases section I agree we should remove.",
        "created_at": "2021-07-30T02:44:32.939000+00:00",
        "attachments": null
    },
    {
        "author": "simon5219",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "After the completion of the Ethernet merger, assuming that the chain activity maintains the data of the past year, the average daily handling fee is 8376 ETH, and the beacon chain issues up to 2700 ETH per day, then the total amount of Ethernet deflation. Assuming that the chain activity maintains the data of the last two months of market cooling downturn, and the average daily fee is 2662 ETH, then the next long time probability of destroying the fee is greater than the POS increase, then the total Ether deflation. Assuming the market becomes a complete bear market, the chain activity compared to the bear market in 2019, the average daily handling fee is 511 ETH, which is less than 1400 ETH, that is, the total amount of Ether will continue to be deflationary, but considering the booming development of Defi in the past two years in Ether, the chain activity and the number of Defi users, which is not comparable to 2019, so this deflation occurs is extremely unlikely. Right?",
        "created_at": "2021-07-30T05:46:53.807000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Please don't spam multiple channels with the same message.",
        "created_at": "2021-07-30T06:02:16.172000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Also, this is not an appropriate server for price speculation.",
        "created_at": "2021-07-30T06:02:38.321000+00:00",
        "attachments": null
    },
    {
        "author": "axic3354",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think the wording could/should be improved, as in the current state it can suggest the EIP is not complete. Even just stating `# The rest of the block validation rules follow here.` could be okay?",
        "created_at": "2021-07-30T11:39:37.539000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I would be fine with that.",
        "created_at": "2021-07-30T12:12:19.013000+00:00",
        "attachments": null
    }
]