[
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Just a thought, would like some feedback:\n\nWhat if we use a (normally tiny) portion of the basefee to finance a 'constant minimal_inclusion_fee' for all transactions in a given block.\nI think I saw \u003c@!301186049323958275\u003e mention that the inclusion_fee is likely to end up at a constant 1 Gwei (per gas) for acceptance by the majority of miners. Say, for example, that the basefee is currently 100 Gwei per gas. Now, instead of paying:\n100 (basefee) + 1 (inclusion_fee) = 101 Gwei per gas. (Where 100 Gwei is burned.)\nThe user would pay:\n100 (basefee and minimal_inclusion_fee) + 0 inclusion_fee = 100 Gwei per gas (Where 99 Gwei is burned, and 1 Gwei goes to pay for this 'minimal_inclusion_fee').\nUsers could still bid a higher total inclusion fee, but the idea is that a reasonable constant minimum is already included, since the user has effectively already paid for it.\n\nIt's a tiny tweak, yet I see a lot of advantages:\n~~- Prevents unnecessarily inflated transaction cost under low fee conditions. Say fees are around 10 Gwei (as it was just a year ago), having to pay 11 Gwei for inclusion is a fat 10% increase for no good reason.~~\n- Simplifies clients. The clients gas price oracles are guaranteed a decent stream of (on-chain) data to determine their current inclusion fees from.\n- Prevents transactions with an effective inclusion fee of 0 gwei. This solves two problems: 1. Fix inequality between regular users and mining-pool owners, as the latter will not be able to mine their own transactions with 0 gwei effective inclusion paid. (Cementing the value of ETH in the inclusion_fee.) 2. Prevents 0 gwei inclusion_fee transactions that will sit around the mempool forever as no miner is interested.\n- Disincentivizes mining empty blocks in protest as a reasonable inclusion minimum is essentially guaranteed via social contract.\n\nIt would make EIP-1559 a little more balanced from a 'user vs holder' perspective also.",
        "created_at": "2021-03-21T03:43:37.194000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We try very hard not to assert what the market price of a good/service is.  We *expect* 1 nanoeth per gas to be around the order of magnitude miners will choose, but ultimately the market will decide.",
        "created_at": "2021-03-21T03:45:02.399000+00:00",
        "attachments": []
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I understand. But I think we can all agree that 0 Gwei per gas is not it (allowing it even causes some weirdness, as I mentioned above). If we have a reasonable estimate, we should use it as it is always a net positive:\n- If the actual minimal inclusion fee is higher than our estimate then most of the advantages either still hold entirely or relatively. Users still pay less for inclusion, pools are only a bit more privileged, transactions will very likely still not sit around forever.\n- If the actual minimal inclusion fee is lower than our estimate then ALL of the advantages hold. The 'casualty' is an absolutely minimal inefficiency of [estimate - actual] that is not burned. A completely _negligible_ cost for 'holders' to great benefit of all users. Definitely a cost/reward that should be implemented.",
        "created_at": "2021-03-21T04:14:06.078000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There is nothing wrong with `0`.  It is entirely up to the miner that includes the transaction what price they want to accept.",
        "created_at": "2021-03-21T04:14:33.661000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The `inclusion_fee_per_gas` is part of a negotiation between the user and the miner.  It is not a transaction between the user and the network.",
        "created_at": "2021-03-21T04:15:03.615000+00:00",
        "attachments": []
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There is definitely something wrong with 0, it allows for the complete _off-chain_ settlement of the inclusion_fee. The EIP says it will 'cement the economic value of ETH', it forgets to do that for the inclusion_fee part. Pool owners paying themselves a 0 Gwei inclusion_fee _off-chain_ while the rest has to pony up, is just an example. They could technically hold their own off-chain auction. By having a minimal_inclusion_fee we guarantee it is either entirely on-chain at negligible network cost and zero user cost (estimate too high) or at least mostly on-chain, with zero network cost and, effectively, zero user cost (estimate too low).\n\n\"We try very hard not to assert what the market price of a good/service is\". That is most of what this EIP interferes with though 🙂\n\nI feel like we're arguing over technicalities. I laid out _many_ advantages above, the tweak to the EIP is tiny, the cost is negligible, the advantages still work if the estimate is off, I think it's a better proposal with it included.",
        "created_at": "2021-03-21T05:09:07.531000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e it allows for the complete off-chain settlement of the inclusion_fee\nThis is fine.",
        "created_at": "2021-03-21T05:09:34.056000+00:00",
        "attachments": []
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I disagree, (yes I know MEV). But we're talking inclusion_fee, not 'ordering_fee'.",
        "created_at": "2021-03-21T05:11:13.229000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It is not our place to meddle in the transactions of two independent voluntary participants.  One party wants to be included, the other party has power of inclusion.",
        "created_at": "2021-03-21T05:11:27.972000+00:00",
        "attachments": []
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think we should so as to both fix the 'conflict of interest' surrounding pool-owners and to consistently 'cement the value of ETH'. But fine, agree to disagree.\nThere is still the remaining list of advantages.",
        "created_at": "2021-03-21T05:16:46.776000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If you remove that aspect, all you are doing is setting an inclusion fee floor which means the cost of inclusion cannot go down should the market price be below the hard coded value.",
        "created_at": "2021-03-21T05:24:21.855000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And if the cost of inclusion is higher than the hard coded value, either transactions won't be included or some secondary payment channels will be created.",
        "created_at": "2021-03-21T05:24:55.107000+00:00",
        "attachments": []
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "~~No, I'm also making sure that this minimum_inclusion_fee has precedence over the basefee. This prevents users from paying grossly inflated fees under low basefee conditions, as the inclusion_fee is not likely to change much (if at all) during low fees.~~ Maybe the network is less utilized then but this (dis)advantage holds _for all miners_. The initial reward for uncles does not change dynamically either. ~~(Image having good scaling with rollups/sharding/etc and then having to pay a 10 - 100% upcharge _for no good reason_).~~ That 'secondary payment channel' can not possibly be a negative as that is literally 100% the situation with this EIP right now. It also only occurs _partially_ if we estimate too low. Besides, they could always use the higher inclusion_fee (again, like now).",
        "created_at": "2021-03-21T06:08:59.893000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e Prevents unnecessarily inflated transaction cost under low fee conditions. Say fees are around 10 Gwei (as it was just a year ago), having to pay 11 Gwei for inclusion is a fat 10% increase for no good reason.\nIf congestion leads to total cost of inclusion of 10, and the `inclusion_fee` is 1, then the `base_fee` will be 9.",
        "created_at": "2021-03-21T06:14:44.909000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e Simplifies clients and UX. The (non-trader) clients are no longer required to analyse the current inclusion fees to come up with an estimate, nor do they have to come up with a 'minimal_inclusion_fee' themselves.\nIt makes the UX worse IMO because anyone who wants to participate in gas price auctions would have to utilize secondary payment networks/channels rather than the protocol.",
        "created_at": "2021-03-21T06:15:34.400000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e Prevents transactions with an effective inclusion fee of 0 Gwei. This solves two problems: 1. Equalization between regular users and mining-pool owners, as the latter will not be able to mine their own transactions with 0 Gwei effective inclusion paid. 2. Prevents transactions that will sit around the mempool forever as no miner is interested.\nThis isn't a goal that I think anyone cares about.  Transaction inclusion has opportunity cost for the miners no matter what and this is true today, was true years ago, and will be true in the future.",
        "created_at": "2021-03-21T06:16:57.498000+00:00",
        "attachments": []
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't get this one? They can still just pay a higher inclusion_fee. It's just a minimum. It's no more or less part of the protocol as this EIP right now.\n(Also, I saw you write somewhere here that you suspected that wallets would not offer the inclusion_fee knob that comes with this EIP anyway 😉 ).",
        "created_at": "2021-03-21T06:17:10.801000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e Disincentivizes mining empty blocks in protest as a reasonable inclusion minimum is essentially guaranteed via social contract.\nThere is already financial incentive to mine non-empty blocks, which is exactly why most blocks aren't empty.  Incentives are working great here as it is so we don't need a fix.",
        "created_at": "2021-03-21T06:17:37.979000+00:00",
        "attachments": []
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This not guaranteed in 1559, it is under the current (as in today) simple auction though.",
        "created_at": "2021-03-21T06:17:59.700000+00:00",
        "attachments": []
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Not convinced of this one _at all_. At least part of the idea of this EIP is that users are bad at simple auctions, so they end up paying too much. It may be that the 10 Gwei total fee is 'acceptable' for the user, so the transaction is made anyway. But he most probably did end up paying 'too much', to the network (instead of to the miners as happens today). Taking an estimated minimal_inclusion_fee out of the basefee moves that inefficiency from the user (where it is a significant part of the fee) to the network, where it is completely negligible as compared to issuance caused by the block reward.",
        "created_at": "2021-03-21T06:36:26.565000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It sounds like you may misundestand how EIP-1559 works.  It specifically makes it so users *don't* have to be good at auctions, they can always bid as much as they are willing to pay and they pay as little as possible (below their max) to get included in the next block.",
        "created_at": "2021-03-21T06:37:24.548000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Very abstractly, if there are 10 transactions that want to be included with a range of gas prices they are willing to pay, but there is only room for 5, we want to sort the transactions from highest willingness to pay to lowest, choose the top 5 transactions, and then have them *all* pay the price of the 6th highest transaction.",
        "created_at": "2021-03-21T06:38:59.823000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "EIP-1559 achieves this (though not in quite so direct of a fashion).",
        "created_at": "2021-03-21T06:39:13.843000+00:00",
        "attachments": []
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "No, you don't understand what I mean. Saying total congestion cost of 10 Gwei will move the basefee to 9 Gwei implies that users are reasonably good at simple auctions.",
        "created_at": "2021-03-21T06:39:18.992000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It assumes that all users bid willingness to pay and they do not participate in any advanced bidding strategies.",
        "created_at": "2021-03-21T06:42:05.063000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(though it also works if people execute advanced bidding strategies)",
        "created_at": "2021-03-21T06:42:26.598000+00:00",
        "attachments": []
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, and now why should they pay more then they have to? If fees are low enough that 90% of users say 'whatever' then the fee could have been 1 Gwei lower with this proposal.\nAt that point 1 Gwei is very likely a significant part of the fee too.",
        "created_at": "2021-03-21T06:43:29.543000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If there is so little congestion that the `base_fee` is epsilon (meaning demand is lower than supply without any price pressure) then the `base_fee` will be epsilon no matter what users bid.",
        "created_at": "2021-03-21T06:44:53.743000+00:00",
        "attachments": []
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Nah, that again implies competency at auctions. At some point fees are low enough that blocks don't hit the required low utilization for the basefee to go down.\nThe majority of users can (and will not) look at the market and see that \"Hmm... the basefee could/should be lower\" if the current fee is acceptable for their purpose. It is essentially a tragedy of the commons by not caring.\n\nAlso, at that point it is basically an auction of the user vs the network. They're getting fleeced for a significant percentage by the network, for the same reason they are being fleeced today by the miners.",
        "created_at": "2021-03-21T06:51:24.123000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Going back to the example above, imagine we still had space for 5 transactions but only 4 people were interested.  They could all bid a million and when we sort by bid and take the top 5 we would end up with all 4 people getting in.  We would then charge them the bid of the 6th person which is 0, so they would all pay 0.",
        "created_at": "2021-03-21T06:52:00.574000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e At some point fees are low enough that blocks don't hit the required low utilization for the basefee to go down.\nThat means there is still more demand than supply and we need the base fee to be non-zero in order to correctly choose who gets included.",
        "created_at": "2021-03-21T06:53:01.242000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The base fee will go to zero only if demand for inclusion (without negative price pressure) is lower than supply.  In your description above this hasn't occurred yet, demand is still higher than supply so we need negative price pressure (base fee) to lower the demand.",
        "created_at": "2021-03-21T06:53:53.168000+00:00",
        "attachments": []
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e I think I get what you are saying (also I misread your epsilon comment earlier). I will concede this specific point (I'm still running scenarios \u003e=)).  (Took me too long to realize the UX can/will offer a _single_ maximum fee setting and how that effects a 'not-caring' minimum of (base)fees, oops).\n\nYou said that (the current idea for the UX is that) users will be able to set a maximum fee they are willing to pay. How does that relate to the inclusion fee? will clients automatically set a constant inclusion_fee as part of their bid always?\n\nWhat about inclusion_fee savings? Could be a significant % under low fee conditions (when the network scales well). If clients have to monitor the past inclusion fees/block space/etc for potential savings it becomes essentially a bot participating in the simple auction, are they really better than the overpaying humans?\n\nI assume non-trader clients will not participate (too much) in the upwards degradation to a simple auction of the inclusion_fees. But there could be savings in the downwards portion too. If one client's bot does not do this (well) then you could literally save ETH on transactions by moving to a different one with a better bot. Even more, a lot of clients are open source. Meaning users, traders, and miners can just figure out how that bot is going to react and exploit it for maximum gains (until the code is adjusted, cat and mouse). That could promote more closed-source/private clients (and more paid ones). Fixing a good estimated minimum_inclusion_fee (with preference over basefee) completely removes the downward auction client complexity at no extra user cost and negligible network cost.\n\nIf non of this will happen because everyone is _expected_ to settle around 1 Gwei under non-spikes, then we may as well guarantee it by using the estimate in the protocol instead of some loose convention. (and get the other benefits: 'cementing the value of ETH \u0026 no conflict of interest', for free).",
        "created_at": "2021-03-21T10:22:35.064000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e How does that relate to the inclusion fee? will clients automatically set a constant inclusion_fee as part of their bid always?\nA transaction will specify a max fee and an inclusion fee.  They will never pay more than max fee, and the miner will receive the lesser of the specified `inclusion_fee` and `max_fee - base_fee`.",
        "created_at": "2021-03-21T10:58:57.245000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The opportunity cost of transaction inclusion is pretty stable over time for individual miners, so the expectation is that miners will set a fixed minimum inclusion fee and run with that for long periods of time.  There is no incentive for them to fiddle with it short of extremely complicated costing schemes (which to my knowledge no one has created at this point) or because they just want to troll the network (at cost to themselves).",
        "created_at": "2021-03-21T11:00:25.260000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This means that most users can generally know what percentage of hashpower any given inclusion fee will get inclnuded in.",
        "created_at": "2021-03-21T11:00:43.420000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I suspect that around 1 nanoeth will be the inclusion fee that miners settle on, but they can set it to whatever they want.  It is literally a bribe to get them to include your transaction in a block they mine, so you **must** at least pay them their opportunity cost (unless they are altruistic).",
        "created_at": "2021-03-21T11:01:59.890000+00:00",
        "attachments": []
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e Thank you for clarifying.\n\nI assume that 'regular users' will only see the max_fee slider then.\nObviously miners will also sort by inclusion_fee value (plus any off-chain stuff, like MEV) to determine inclusion (among users which have enough max_fee for current base_fee etc etc).\n\nClients would still have to monitor inclusion_fees and adjust (even if miners would, so to speak, advertise their minimum). If they don't adjust then one can just set their own inclusion_fee to `\u003cclients_determine_this\u003e + 1 wei` (or whatever maximal decimal miners check for) and both 'jump the regular users queue' and potentially save some ETH, during congestion. Even if others had a higher max_fee. Not that a 'minimum_inclusion_fee' would help here.\n\nWhat I find odd is how it's assumed that clients will just determine a sane inclusion_fee out of thin air. The market could be entirely off-chain. There is no guarantee (although highly improbable) that every single inclusion_fee will not be `0` once EIP-1559 launches. Clients could run up a simple auction, they would overpay like they do now. I took a quick look at the Geth codebase for 1559, seems they pick the 60th percentile from a list with the single lowest inclusion_fee of the last _N_ blocks? (someone correct if wrong). You would need most of those inclusion_fees to be 'the whole thing' (no consistent off-chain stuff) for that to work. Setting the minimum_inclusion_fee estimate should mostly guarantee that their gas price oracle would yield a sane inclusion_fee.\n\n\u003e The opportunity cost of transaction inclusion is pretty stable over time for individual miners, so the expectation is that miners will set a fixed minimum inclusion fee and run with that for long periods of time. \n\nThis strongly implies that determining an accurate estimate is possible.\n\n\u003e This means that most users can generally know what percentage of hashpower any given inclusion fee will get inclnuded in.\n\nNot if you can't see the off-chain stuff.",
        "created_at": "2021-03-21T14:21:53.512000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e I assume that 'regular users' will only see the max_fee slider then.\nThat is how I would design a UI.",
        "created_at": "2021-03-21T14:46:00.789000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e jump the regular users queue\nWith 1559 in the normal situation this simply isn't necessary.  The base fee should deal with congestion so you never need to try to \"get in the front of the line\" because there is always space (if you are willing to pay the base fee).",
        "created_at": "2021-03-21T14:47:09.796000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e every single inclusion_fee will not be 0 \nIf miners want to accept transactions at 0 inclusion fee that is fine.  The inclusion fee is basically a convenience mechanism for making it *easy* to have a market for inclusion.  We would *prefer* it to be used since it is public, anonymous, and censorship resistant but we cannot force miners to use it.",
        "created_at": "2021-03-21T14:48:46.400000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You seem to have a desire to end the gas price market, but it is unclear why?  The gas price market has worked well historically, even in the face of congestion.  We can do *better* by separating congestion fees from inclusion incentives, but generally speaking I think most are pretty happy with just letting the market do its thing.",
        "created_at": "2021-03-21T14:50:29.516000+00:00",
        "attachments": []
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It just seems logical and consistent to me,\n-Basefee: Guaranteed to be 100% on-chain \"Cementing the value of ETH\".\n-Flashbots: (Tries to) make MEV transparent and fair, \"Illuminate the Dark Forest\".\n-Inclusion_fee: Inefficient opaque auction, clear conflicts of interest, whatever??\n\nWe can clearly do better than that! With a best effort estimate we can drag 90+% (don't quote me on that number) of that auction on-chain 'into the light'. Cementing the value of that portion of ETH, guaranteeing data for gas price oracles, fixing the rampant conflict of interest with self-mined transactions. At negligible cost.\n\nWhen fees eventually become lower the inclusion_fee might be a significant part of the total fees. I don't see why it should not get the same good treatment as the rest.\n\n(Full disclosure: I am a miner, so I was not to happy with EIP-1559 cutting 50% of my income. But now that it's going in, I would like it to be the best version I can think of. I will back off a bit now 😅 )",
        "created_at": "2021-03-21T15:29:02.138000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It is unclear to me why you think the inclusion fee is a conflict of interest?  Its entire purpose is to give an avenue for people to convince miners (via financial incentives) to include their transactions in blocks.  Given no incentives, miners will produce empty blocks.  We don't know exactly how much it costs to convince a miner to include a transaction in a block (though we have guesses/estimates), but we do know that it costs more than 0.",
        "created_at": "2021-03-21T15:37:07.854000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Taking that incentives market away doesn't make the protocol better, it just makes it less able to adapt to an ever changing environment.",
        "created_at": "2021-03-21T15:37:36.485000+00:00",
        "attachments": []
    },
    {
        "author": "maxvoltage.",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Quick question and sorry if this is off topic...   Since all transactions will pay the same in a block with 1559, will this affect MEV?  Will this affect where bots are trying to be located in a block ahead or behind a specific transaction in the mempool?",
        "created_at": "2021-03-21T15:49:56.924000+00:00",
        "attachments": []
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e It is unclear to me why you think the inclusion fee is a conflict of interest?\n\nBecause pools can/will mine their own transactions for `0` inclusion_fee, while charging others. (like they do with `1` Gwei transactions now).\n\n\u003e We don't know exactly how much it costs to convince a miner to include a transaction in a block (though we have guesses/estimates), but we do know that it costs more than 0.\n\nWe also don't know exactly what the optimal block reward is, or what the optimal auction scheme for the basefee portion is, or the optimal formula for staking rewards. I would like to think a best effort with clear benefits/consequences is worth considering. The upper side of the auction would still be completely open for all the regular market shenanigans.\n\nAnyway, good discussion.",
        "created_at": "2021-03-21T16:01:39.692000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e Because pools can/will mine their own transactions for 0 inclusion_fee, while charging others. (like they do with 1 Gwei transactions now).\nHow would forcing a non-zero inclusion fee help if they have to pay it to themselves?",
        "created_at": "2021-03-21T16:40:38.761000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Race for position will continue as always, by specifying higher inclusion fees/miner tips. Or side-channel payments of course, of mining pools running their own MEV clients. EIP-1559 addresses the pricing of block space, not the pricing of position _in_ a block.",
        "created_at": "2021-03-21T16:43:00.086000+00:00",
        "attachments": []
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Because the 'minimum_inclusion_fee' is financed out of the basefee, which both regular users and pool owners are forced to pay equally.\nIf the estimate (for miner inclusion) is any good they should end up paying roughly equal amounts for 'regular user' transactions.",
        "created_at": "2021-03-21T16:57:40.860000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I really don't see what you're getting at here. If I send a transaction I have to pay a cost to the miners to get them to include my transaction, because they have to perform some work (and run some risk). If a miner wants to include their own transaction, they will already to the work. They can pay themselves, or not, it doesn't really matter.",
        "created_at": "2021-03-21T17:02:02.322000+00:00",
        "attachments": []
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I see what you mean. What I'm getting at is separating the miner when sending a transaction (as a user) vs the miner when mining a transaction (as a mining pool). Overly verbose example:\n\nSo say you own a mining pool with a lot of users. Currently when you have to make a bunch of payouts you can do this very cost effective for you by sending transactions with a 1 gwei fee and mining them on your own pool. Your users lose a bit of income (because the income from fees is lower than expected), but too bad for them. Most of your users either don't know or don't care. (You could probably even mix in personal 1 gwei transactions, how would they know?).\n\nUnder EIP-1559 you can still somewhat do this. Sure you have to pay basefee now, but the inclusion_fee can be set to 0. So your miners still lose out on their fees.\n\nWith the minimum_inclusion_fee (from basefee) as described above you can no longer do so. You're paying roughly the same amount of inclusion_fee as the rest of the network, even though you own a mining pool. Sure, you are guaranteed a place in your block, but if EIP-1559 functions as expected then that should not be a problem for anyone willing to pay the basefee.  Furthermore the fee will actually go to your users.\n\nThis is not meant as some sob story for miners. The point is that the transactions (with at least a fair inclusion_fee) are on-chain and easily verifiable, whether you're a regular user or a block proposer.",
        "created_at": "2021-03-21T17:47:16.914000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e when sending a transaction (as a user) vs the miner when mining a transaction (as a mining pool).\nI still don't see how this is relevant. Sure we can force everyone to pay a minimum fee, but it doesn't really matter if the pool sends a transaction and gets this inclusion fee back. The result is exactly the same as if the transaction had an inclusion fee of zero.\n\n\u003e Under EIP-1559 you can still somewhat do this\nAs far as payouts are concerned, I don't think much changes. Currently the pool spends 21k * \u003c\"lowest highest\" gas price\u003e (by missing out), and in the future they will spend 21k * base_fee + inclusion fee (the former by actually spending it, and the latter by missing out).\n\n\u003e Furthermore the fee will actually go to your users.\nI feel like you're trying to force pools to pay everything they earn to their miners?",
        "created_at": "2021-03-21T18:31:35.375000+00:00",
        "attachments": []
    },
    {
        "author": "cronoss5638",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e I still don't see how this is relevant. Sure we can force everyone to pay a minimum fee, but it doesn't really matter if the pool sends a transaction and gets this inclusion fee back. The result is exactly the same as if the transaction had an inclusion fee of zero.\nI'm sorry I can't explain this any better than the example above. The point is transparency/fairness. The third situation is the only one where miners would genuinely not care if you mined e.g. personal transactions on your pool. As long as your users are receiving their share of block rewards / fees as seen on the chain, they don't have to trust you as much as before.\n\n\u003e I feel like you're trying to force pools to pay everything they earn to their miners?\nI don't see why you would think that from above. There are pools that do stuff like this. I don't mine with them. I have zero personal benefit from this whole proposal (starting to regret it a little 😅 ).\n\n\u003e Currently the pool spends 21k * \u003c\"lowest highest\" gas price\u003e (by missing out)\nI don't understand this line. The 21k is needed gas for a transaction. is \u003c\"lowest highest\" gas price\u003e supposed to translate to 1 gwei?\n\n Pools are just a small part of \"forcing everyone to pay a minimum fee\". The idea is to get most of the lower bound of the inclusion_fee on the chain _since it is not really an auction below that point_. Miners all have roughly the same constant minimum inclusion_fee at which a transaction would be worth including. Users are going to pay the minimum fee one way or another anyway. Instead of it being an inefficient auction (potentially entirely off-chain, maybe paid in dollars or cookies), we identify that minimum and force it on-chain to be paid in ETH (\"Cementing the value of ETH\", as the EIP calls it). As a bonus the clients get 'nice' data with guaranteed minimums to base inclusion_fee on, and pools don't have to differ minimum inclusion_fees either (if the estimate is accurate).",
        "created_at": "2021-03-21T19:13:36.820000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e is \u003c\"lowest highest\" gas price\u003e supposed to translate to 1 gwei?\nNo, it's a bit lower than the median gas price. It's the lowest gas price in the block, which is higher than the highest gas price in the remaining mempool (assuming they fit in same gas limit/usage).\n\n\u003e force it on-chain to be paid in ETH\nI don't think you can \"cement the value of ETH\" with your approach. For the base fee this \"cementing the value\" only works because ETH has to be _burned_. It does not work if you force a minimum and this minimum value is _transferred_. The reason it doesn't work is the same as why you can't give the base fee to the miner of the block. The forced transfer of value can easily be undone via side-channels (e.g. a kickback).\n\nI somewhat understand what you would want to accomplish, and I agree that a sane minimum inclusion fee makes sense. And that it would also be nice if one can _guarantee_ somehow that the highest paying txs (in ETH) in the mempool actually end up in the block. But as far as I know, this is a hard/impossible problem to solve.",
        "created_at": "2021-03-21T20:11:14.762000+00:00",
        "attachments": []
    }
]