[
    {
        "author": "trent_vanepps",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "https://blog.coinbase.com/the-technical-benefits-of-eip-1559-c41bb85f5924",
        "created_at": "2021-10-05T20:08:28.628000+00:00",
        "attachments": []
    },
    {
        "author": "luigylemon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I understand the technical benefits of burning the base fee compared to other changes in the fee implementation. But is there an ongoing discussion about the economical benefits of the burning in the ecosystem? \nWhat is the underlying reasoning that tipped the scale towards burning over growing a treasury for ecosystem grants, retroactive grants, broader ecosystem growth, and eventually world issue solving grants. Ethereum is going to be bigger than any state... we have the power by being a global economy to align any and every country into our goals. It makes the most sense to use this power to solve major global issues than \"return value to ether holders\".",
        "created_at": "2021-10-05T22:10:09.339000+00:00",
        "attachments": []
    },
    {
        "author": "luigylemon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think the problem doesn't end at the opportunity cost alone. But i believe that's the higher one at stake.",
        "created_at": "2021-10-05T22:12:42.793000+00:00",
        "attachments": []
    },
    {
        "author": "luigylemon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I guess at a higher level the question will be: Is the ethereum community against the idea of ethereum becoming a governance token? Or is it simply not been considered?",
        "created_at": "2021-10-05T22:17:37.099000+00:00",
        "attachments": []
    },
    {
        "author": "luigylemon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Even if the common sense is that we are not ready for that step forward due to immaturity of the DAO space (i would agree). If the community feels like that's the right move in the future we are currently burning an unrecoverable amount of wealth that could be used so solve major global issues, block by block. So it genuinely feels like an urgent matter to me.",
        "created_at": "2021-10-05T22:27:43.507000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I believe there has been a decent bit written on why we have to burn it.",
        "created_at": "2021-10-05T22:27:57.563000+00:00",
        "attachments": []
    },
    {
        "author": "luigylemon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Wouldn't the ether go into a treasury have a very similar effect to burning in terms of circulating supply. As long as it only got back into circulation for purposes that enrich the ecosystem it's hard to reason for me.",
        "created_at": "2021-10-05T22:30:16.439000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I can only answer the question from my own perspective, others may have other opinions.  If you collect the fee instead of burning it someone has to be in charge of that money.  And since nobody is in charge of ethereum, there's nobody to be in charge of that money.",
        "created_at": "2021-10-05T22:30:48.194000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And every solution you can propose to that, puts someone in charge of a very large pile of money.  And even if that someone is a DAO, then it's a group of someones.  And we have no definition of who that group would be, nor do I personally wish to make such a massive decision to give anyone that amount of power, myself included.",
        "created_at": "2021-10-05T22:33:11.916000+00:00",
        "attachments": []
    },
    {
        "author": "luigylemon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "`Is the ethereum community against the idea of ethereum becoming a governance token? ` that's why i mentioned that as the real big question",
        "created_at": "2021-10-05T22:33:59.847000+00:00",
        "attachments": []
    },
    {
        "author": "luigylemon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "When you say people... i say... everyone \u003ca:peepoHeHee:401946781208018944\u003e",
        "created_at": "2021-10-05T22:34:22.251000+00:00",
        "attachments": []
    },
    {
        "author": "luigylemon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And don't mention coin-voting articles... it would have to be an hybrid system. DAOs are too new and funds should be frozen somewhere until there's an actual valid system. And ethereum is hard to snapshot. I'm not saying there's no technical limitations right now to do this. But there's the two paths.",
        "created_at": "2021-10-05T22:39:26.339000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This server isn't a place to discuss governance so we have to halt very soon because..... rules....\n\nMy own opinions about governance have been that \n\n- we have a process that works well enough for governing things.  ACD isn't perfect but it works adequately.\n- we have a mission of providing decentralized application blockchain thing that scales sufficient to actually be used.  Hard to define the exact metric but some large number of transactions per second and low congestion (low gas fees)\n\nUntil we actually accomplish that mission, governance just isn't our biggest problem and it is certainly a hard problem, so I'm of the opinion that putting energy towards governance is a distraction that only matters if/when we accomplish the \"scalable decentralized application blockchain thing\".\n\nI'm sure other people have their own opinions and reasons.  Whatever those reasons/opinions are, the result is that \"we\" aren't focusing on governance.... yet....",
        "created_at": "2021-10-05T23:46:55.858000+00:00",
        "attachments": []
    },
    {
        "author": "luigylemon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I am not talking about governance over the protocol, i agree the current process has been working adequately. If there is however a better place to discuss this topic, where would it be?",
        "created_at": "2021-10-05T23:52:02.762000+00:00",
        "attachments": []
    }
]