[
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Question for you \u003c@!301186049323958275\u003e (and others):\n\nEIP-1559 really only allows users to know the BASE_FEE of the very next block to be mined, since we only know the latest block gas usage and from it we can calculate the BASE_FEE of the very next block. This means that users only have 1 block where they know what the BASE_FEE is and if they miss that window, they will need to add a 0-12% margin to the BASE_FEE to account for the uncertainty in BASE_FEE in future blocks.  Is this correct? If so, then now consider that miners pick txs from the mempool the moment a new block is announce. This mean that it's practically impossible for a user to use the BASE_FEE as a reliable value since they can't really send a tx right after block `A` is mined and get into block `A+1`. it would require an incredible timing + luck. If that's the case, then users will be somewhat forced to add a safety margin on top of the BASE_FEE, which seems to defeat the point of the EIP in the first place. \n\nIf this is all true, perhaps one solution to this to ensure this works as expected would be to only update the BASEFEE every `n` blocks instead of every block, and change it based on the past `n` blocks instead of the very last block. While making the basefee a bit less flexible, this would account for network latency and response time, giving users a minute or more where the BASEFEE is known and hence can be used **as is** without needing to add a safety margin.",
        "created_at": "2021-03-31T02:37:11.014000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I guess since user always pay the basefee, the standard will be to have users use a basefee + 25% or something? That would guarantee at least 2 blocks where basefee is valid.",
        "created_at": "2021-03-31T02:40:18.970000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You can estimate the base fee range for the next `n` blocks, but it widens by 1/8 every block out (thus the range widens fairly rapidly, but not instantly).",
        "created_at": "2021-03-31T03:22:10.925000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e then now consider that miners pick txs from the mempool the moment a new block is announce\nWe know how miners (generally) select transactions, and they (usually) rebuild the block every few seconds with the top pending transactions.  In the case of a fast block, then whoever was in the pool when it *started* to be mined gets in.  If it is a slow block, then showing up a bit later is fine.  Also, with 1559 the strategy can change slightly to just append all new valid transactions to the block as they come in without recalculating the whole block, just execute another transaction and update the state root, receipt root, and transaction root.",
        "created_at": "2021-03-31T03:23:55.755000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Separate from the above, I think you are missing the most critical piece to 1559 which is that it is no longer a first price option so you don't have to guess accurately!",
        "created_at": "2021-03-31T03:24:46.706000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You simply set the max fee to the maximum you are **willing to pay** and walk away.  You don't even need to know what the base fee is or will be.  You simply state your max willingness to pay without looking at *any other information*.",
        "created_at": "2021-03-31T03:25:17.507000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You will *always* pay the minimum required to be included in the next block a miner builds after you submit your transaction if you are *willing* to pay the base fee of that block.  Since you expressed your max willingness to pay, you either get in because the base fee was below your willingness to pay or you don't get in because the base fee was above your willingness to pay.",
        "created_at": "2021-03-31T03:26:17.538000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, i understand you always pay the base_fee, not the max you specified, but it seems to me that wallets will somewhat need to force users (especially new ones) to put a max base fee 10%-20% above, if not more, otherwise users will have the same bad UX as today if they use the \"live\" base fee. It just doesn't seem ideal that clients need to force this on users nor that the fee displayed will always be an overestimate.",
        "created_at": "2021-03-31T05:07:57.057000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Oh, I would do like 2x above current base fee.",
        "created_at": "2021-03-31T07:20:02.311000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And present it to the user as \"fee will be between \u003ccurrent_base_fee\u003e and \u003c2 * current_base_fee\u003e\".",
        "created_at": "2021-03-31T07:20:24.639000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "More advanced wallets will have a button to edit the maximum (but probably not the minimum), and the most advanced wallets will let you tune everything.",
        "created_at": "2021-03-31T07:20:56.680000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Right, that's probably safer indeed, though this seems like a weird UX, especially for noobs, though it's probably the best that can be done for now",
        "created_at": "2021-03-31T13:15:56.470000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm not quite sure what's more foolproof than a \"You will pay between $5 and $10. Do you accept?\" prompt. No configuration possible, no underestimating gas price, no overestimating/overpaying either.",
        "created_at": "2021-03-31T13:29:52.303000+00:00",
        "attachments": []
    },
    {
        "author": "mrabino1",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "while initially it looks to be focused on Users UX, from my lens the real angle here is that rollups get almost certainty to settle back on L1 while having programmic \"almost certainty\" as to the fee to pay..  that is huge!",
        "created_at": "2021-03-31T13:29:55.961000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah that's fair, just worried that with fees being much higher, users are looking at a range of 200$ to 400$, which can make a big difference when deciding if a tx is worth it for the smaller fishes. Would rather if the 200$ was enough on its own",
        "created_at": "2021-03-31T13:41:51.305000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Fees being high is a separate problem that 1559 doesn't try to solve.",
        "created_at": "2021-03-31T13:42:13.038000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I understand, but I think there is a version of EIP-1559 where the current base_fee can be used without users needing to add a margin",
        "created_at": "2021-03-31T13:42:41.653000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So they would see a flat 200$ for the tx, instead of a range",
        "created_at": "2021-03-31T13:42:55.222000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If you have a full design for such a thing I encourage presenting it.  🙂",
        "created_at": "2021-03-31T13:43:50.658000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Currently it's only possible to \"guarantee\" this if your tx is signed after block A and included in block A+1",
        "created_at": "2021-03-31T13:43:51.376000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I have heard a lot of people make that claim though, and so far no one has been able to come up with a full design.  😄",
        "created_at": "2021-03-31T13:44:10.002000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The most simple UI could simply tell the user \"the fee is $400\" and then surprise them with a refund in most cases.  🙂",
        "created_at": "2021-03-31T13:45:06.798000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Then they would get an *effective* guarantee of inclusion (in all but the most pathological cases).",
        "created_at": "2021-03-31T13:45:25.229000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And *sometimes* they would get a significant cash-back discount.  🙂",
        "created_at": "2021-03-31T13:45:40.502000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah, don't think I have the time to do a fully fleshed proposals, but what did you think of this ; \n\n\u003e Update the BASEFEE every n blocks instead of every block, and change it based on the past n blocks instead of the very last block.\n\nwhere n could be 3-5, doesn't need to be large and should be kept small for obvious reasons. But it does mean that you have a few blocks where the current BASEFEE will be valid",
        "created_at": "2021-03-31T13:46:10.530000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That's almost how taxes work! 😆",
        "created_at": "2021-03-31T13:46:56.778000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This will result in a slower adjustment speed.  There has been talk about tuning the adjustment speed, but at the moment we don't have enough real-world data about user willingness to pay to get an idea of what the \"right\" adjustment speed is for Ethereum today.",
        "created_at": "2021-03-31T13:47:30.674000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think the expectation is that we'll probably tune it in the future once we have real data coming in.",
        "created_at": "2021-03-31T13:47:43.522000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think what you want is for the base fee adjustment for block `n` to be based on the fullness of block `n-3`, rather than the fullness of block `n`.  This in effect delays base fee adjustment by 3 blocks.",
        "created_at": "2021-03-31T13:48:38.405000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, that's what I meant, should've been clearer, thanks for pointing it out. It effectively gives users 3 blocks where the base_fee is \"safe\" to use before it might get updated upward.",
        "created_at": "2021-03-31T14:51:43.633000+00:00",
        "attachments": []
    },
    {
        "author": "ankur2534",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That still doesn't give guarantee of inclusion because if the block is full, inclusion still depends on tip",
        "created_at": "2021-03-31T15:39:13.426000+00:00",
        "attachments": []
    },
    {
        "author": "ankur2534",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think after 1559 launch, we'll have a rush of wallets working on basefee range estimations and UI approaches to exposing this to users. My hope is that we'll get to a point where ~95-99% of the time, a wallet can provide a fairly tight time and fee estimate for a given tx",
        "created_at": "2021-03-31T15:42:20.815000+00:00",
        "attachments": []
    },
    {
        "author": "ankur2534",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Getting from 99% to guaranteed 100% though is hard",
        "created_at": "2021-03-31T15:42:32.272000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e That still doesn't give guarantee of inclusion because if the block is full, inclusion still depends on tip",
        "created_at": "2021-03-31T18:26:07.653000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "that's true, we can't never know this, but with the current spec, we don't even get that chance even when block isn't full",
        "created_at": "2021-03-31T18:26:34.739000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I guess if we wanted to also counter for the case where the next block might be full, we probably need a range indeed.",
        "created_at": "2021-03-31T18:27:46.159000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm not sure how you get to this conclusion? If the next block isn't full, and you're paying at least the current base fee, you'll be in there. If you want allow e.g. 5 full blocks before yours gets processed, set the base fee to 1.125^5 * current base fee.",
        "created_at": "2021-03-31T19:15:39.962000+00:00",
        "attachments": []
    }
]