[
    {
        "author": "butta",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@552133098075193354\u003e could you frame this from a miners point of view and why you as a miner would want this eip to go in? \n\n\u003chttps://hackmd.io/@timbeiko/why-1559\u003e",
        "created_at": "2021-01-22T01:15:37.421000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!97774605351010304\u003e I think that's hard for a few reasons: \n1. The main goals of the EIP aren't meant to benefit miners. When the EIP was written, fees were negligible so it was mostly neutral for miners. \n2. I feel the main ways that miners \"benefit\" from this are pretty indirect, and mostly under different \"personas\" than miners. If this increases the long term network value, and miners, who get paid in ETH, want to hold, that obviously benefits them, but not as \"miners\". Same argument with security. That's what the doc covers. \n3. There's a fundamental disagreement between miners, especially newer ones, and a large part of the community about the current excess fees. On one hand, miners think this is good and helps decentralize, and OTOH, others feel that it does not make sense for miners to capture all that, given that the security needs of the chain are not correlated with transaction fees. The more extreme version of that is the point that fee dominated blockchains are unstable b/c miners are then incentivized to do short-term re-orgs.",
        "created_at": "2021-01-22T01:33:36.626000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e I think that's hard for a few reasons\nWhat do you think is needed/missing to make it easier?",
        "created_at": "2021-01-22T01:43:00.045000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(we should probably move this to \u003c#798586271445680129\u003e, if the reason for discussing here is because that channel is overrun with off-topic/spam then we should address the off-topic/spam issue a bit more aggressively)",
        "created_at": "2021-01-22T01:44:47.943000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So, I need to run, but one comment before 🙂 \n\nI think the gist of it is that the PoV under which I approach the EIP and improving Ethereum generally is how we ensure its long term health. My challenge with a lot of the miners' feedback is there just seems to be a fundamental disagreement there, where the goal seems to be to optimize for short-term revenue before PoS. I don't know how we reconcile that. \n\nAlso, I'm not a miner (I've mined before, but as a hobby and it was never a significant investment). A miner may be able to better articulate how the long term success of Ethereum is valuable to them than I can.",
        "created_at": "2021-01-22T01:47:55.953000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@486501030046203915\u003e Do you have any data/simulations on the effect of 1559 on people who lowball gas prices?  Specifically, people who today set a very low gas price and just \"wait for it to mine\".  If 1559 decreases volatility of gas prices but maintains the same average gas price, then can we assume the people who will have to pay more are the people who are winning at the low-end of gas price volatility?",
        "created_at": "2021-01-22T01:48:27.602000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't but I could, since i am simulating FPAs in the latest. Take the same users and do a comparison. Low-balling under 1559 is also different if we \"enforce\" the transaction pool rules on dropping transactions that are below basefee",
        "created_at": "2021-01-22T01:51:21.582000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "but in general yes this is something i expect: less people underpaying, less people overpaying, overall everyone converging to the market price that I compute in the latest notebook",
        "created_at": "2021-01-22T01:52:10.340000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think everyone has convinced me to allow some amount of pending pool slack so we don't waste too much resources on re-broadcasting, and also so we always have enough transactions at least for the next block and possibly the next few blocks.  Beyond that, the node where the transaction is \"local\" (meaning submitted directly to the node, not over gossip) will hold on to the transaction and re-broadcast it once it crosses back into viable range.  So I think we can ignore eviction strategies for this discussion at least.",
        "created_at": "2021-01-22T01:53:39.452000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Someone in the discussions-to thread brought up the point that they are worried that people who mine transactions in the dips will end up paying more, and I was trying to figure out how to appropriately respond.  I think an ideal response would be as simple as, \"you are right, here are some models that show that, we'll keep it under consideration\".",
        "created_at": "2021-01-22T01:54:58.555000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "assuming all transactions are never dropped and always available to be included (as long as they are valid, \u003e basefee), then yes i expect low-ballers (by which I mean, people who submit below market price transactions) to never be included unless the market price does drop below their max fee, unlike now where you might be low-balling but you get randomly included just because there is a bit more space and you are on hand. but it'd be cool to verify it",
        "created_at": "2021-01-22T01:58:11.772000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hey guys. Do you have any plans on making some changes to the EIP-1559 to make it more appealing to miners?",
        "created_at": "2021-01-22T07:58:07.780000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What do you think about giving the basefee to miners until the Eth2 done?",
        "created_at": "2021-01-22T07:58:35.636000+00:00",
        "attachments": null
    },
    {
        "author": "elayne_malachite",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "No, this is one of the EIP-1559's contributor's stance on the issue. As a miner, I disagree, but this is where we are at right now. Participate on the Ethereum Magicians forum and express your interests.  https://hackmd.io/S6kW1MjvT8-SjmaoZTyaJw",
        "created_at": "2021-01-22T08:22:04.962000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e If the miner of the block received the base_fee, then there would be effectively no change with EIP-1559. Miners would still be able to include their own transactions at no cost to fill a block. Miners would be able to offer rebates to users for transaction fees via secondary channels, thus allowing them to effectively include transactions priced below the base_fee. See section 5.3 of http://timroughgarden.org/papers/eip1559.pdf for a much more technically deep answer.\nTotally agreed at this point. Big pools include transactions to their blocks without any costs.\n\nHowever, this can be fixed by burning ONLY the pool's base fee",
        "created_at": "2021-01-22T08:25:01.277000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it looks like this conversation is better suited to \u003c#798586271445680129\u003e but yes, this is the reason why basefee cannot be given to the miner who mines that block. see also some of the resources pinned in the other channel for more details",
        "created_at": "2021-01-22T08:28:30.235000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, yes; however, \u003c#798586271445680129\u003e channel is a bit flooded.",
        "created_at": "2021-01-22T08:29:06.825000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I want this to be seen by you.",
        "created_at": "2021-01-22T08:29:15.041000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Sorry, correction: this can be fixed by burning ONLY the transactions' base fee where sender is the block miner.",
        "created_at": "2021-01-22T08:30:19.146000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "we generally see everything and keep an eye on all legitimate posts, so far we've always addressed such questions. i'll reply to you in the other channel!",
        "created_at": "2021-01-22T08:31:26.142000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Okay. Moving to \u003c#798586271445680129\u003e .",
        "created_at": "2021-01-22T08:31:45.608000+00:00",
        "attachments": null
    },
    {
        "author": "gpuhoarder",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@486501030046203915\u003e is it really appropriate to enforce the exact basefee as an eviction limit in the transaction pool? As it is possible and desirable for the basefee to be decreased over the subsequent blocks, should it not also be possible to remain in the transaction pool if there is a chance of fitting under the future base fee of a block that could come before existing eviction timeouts occur?",
        "created_at": "2021-01-22T13:25:11.812000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "that's a great question, we've been looking at it more recently! in short: no it's problably not at all the right policy. I describe the design space I see here: https://github.com/barnabemonnot/abm1559/blob/master/notebooks/eviction.ipynb, evicting everything below basefee is the strictest policy (basically fixed band with the parameter = 0)\n\nsince then \u003c@415548822983278593\u003e published great reports on how clients and miners could manage their transaction pool. the gist is it's not that computationally intensive to keep track of which txs pay the most, so it likely allows for less strict pool policies. this is something we might try to simulate too (check also the latest call where ansgar describes the reports more fully)",
        "created_at": "2021-01-22T13:33:28.881000+00:00",
        "attachments": null
    },
    {
        "author": "afdudley",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e I'm reading this: https://hackmd.io/S6kW1MjvT8-SjmaoZTyaJw and it's not very persuasive.",
        "created_at": "2021-01-22T13:54:04.856000+00:00",
        "attachments": null
    },
    {
        "author": "afdudley",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I feel like the better argument is an extremely polite, \"We will help you make money some other way\"",
        "created_at": "2021-01-22T13:54:48.249000+00:00",
        "attachments": null
    },
    {
        "author": "afdudley",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think your argument against future miners is probably just wrong, and is worth proving one way or another, as an academic pursuit, but in terms of the task at hand, we should just get people mining zkrollups and call it a day.",
        "created_at": "2021-01-22T13:55:48.685000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!332923501079953409\u003e any links we can point people to to get them mining zkrollups?",
        "created_at": "2021-01-22T13:56:35.706000+00:00",
        "attachments": null
    },
    {
        "author": "afdudley",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I tend to have a difficult time talking to the zk people, and I suspect they've optimized for intel, not GPUs.",
        "created_at": "2021-01-22T13:57:11.957000+00:00",
        "attachments": null
    },
    {
        "author": "afdudley",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "sorry, there is a typo above. I meant to say zkrollups/mev",
        "created_at": "2021-01-22T14:00:05.144000+00:00",
        "attachments": null
    },
    {
        "author": "afdudley",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think there is a number of confounding issues at play here.",
        "created_at": "2021-01-22T14:00:22.057000+00:00",
        "attachments": null
    },
    {
        "author": "afdudley",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "this weird resistance to 1559 feels like a mob to me, and not really a clear argument for why miners actually make less money.",
        "created_at": "2021-01-22T14:01:02.338000+00:00",
        "attachments": null
    },
    {
        "author": "afdudley",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Generally, the EF's \"fuck miners\" position doesn't really work in this case. This is another reason why I was against the hardcut strategy...",
        "created_at": "2021-01-22T14:01:53.234000+00:00",
        "attachments": null
    },
    {
        "author": "afdudley",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "you have to give people time to switch to nicehash or whatever.",
        "created_at": "2021-01-22T14:02:16.650000+00:00",
        "attachments": null
    },
    {
        "author": "afdudley",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Micah's document really doesn't help.",
        "created_at": "2021-01-22T14:03:30.905000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Which argument do you think is wrong and why?",
        "created_at": "2021-01-22T14:07:20.624000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Also, we should move this discussion to \u003c#798586271445680129\u003e.",
        "created_at": "2021-01-22T14:07:25.513000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Giving (a portion of) base fee to future miners, spread out over say 1,000 blocks, may be a way to find consensus. Just that I haven't seen miners engage with this idea, which is described at Roughgarden 8.3. Without miners bringing it forth and discussing the implementation details and merits, I don't know what path there is.",
        "created_at": "2021-01-22T15:55:22.983000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is a better discussion to have in \u003c#798586271445680129\u003e.",
        "created_at": "2021-01-22T15:56:50.727000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Agree with Micah. My quick 2c: It doesn't address the fact that the chain's security needs don't change because of txn demand, and it is a large technical change to the current spec.",
        "created_at": "2021-01-22T15:59:25.921000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I actually received a suggestion on how to actually do it quite simply.  I no longer believe that it comes with a high complexity cost.",
        "created_at": "2021-01-22T16:00:14.052000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Interesting. Can you share it here?",
        "created_at": "2021-01-22T16:00:38.546000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I can share it in \u003c#798586271445680129\u003e.  😉",
        "created_at": "2021-01-22T16:01:07.570000+00:00",
        "attachments": null
    },
    {
        "author": "ankur2534",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "When is the ice age taking effect? If there's pushback from miners we could always tie 1559 to when we delay the next ice age. This is how both the past issuance reductions were done (which had similar reactions from miners but ended up going through without much fanfare)",
        "created_at": "2021-01-22T17:17:28.596000+00:00",
        "attachments": null
    },
    {
        "author": "ankur2534",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That's assuming the ice age is coming soon. I think I read July?",
        "created_at": "2021-01-22T17:17:43.741000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "July.",
        "created_at": "2021-01-22T17:19:19.092000+00:00",
        "attachments": null
    },
    {
        "author": "ankur2534",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Is the pushback against eip-1559 larger than the pushback when we dropped issuance from 5--\u003e3? That 40% drop is likely much larger than the impact from 1559 will be",
        "created_at": "2021-01-22T17:21:10.833000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "👍 Would you like to open a new EIP for that and/or propose it as a change to 1559?",
        "created_at": "2021-01-22T17:26:45.307000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "A more appropriate question for \u003c#798586271445680129\u003e.",
        "created_at": "2021-01-22T17:29:29.276000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "do we really want an ACL on 1559 txs?",
        "created_at": "2021-01-22T18:35:31.455000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "~~An ACL?~~ Oh, if it is in response to some of the stuff above \u003c#798586271445680129\u003e may be a more appropriate place to follow-up.",
        "created_at": "2021-01-22T18:38:27.299000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "why do they care about 2930 though?",
        "created_at": "2021-01-22T18:39:07.021000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You mean access list?",
        "created_at": "2021-01-22T18:39:18.838000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Why wouldn't we?",
        "created_at": "2021-01-22T18:39:25.026000+00:00",
        "attachments": null
    },
    {
        "author": "zerowei4320",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Everyone should love access lists. Especially as a miner",
        "created_at": "2021-01-22T18:39:29.553000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ah, are you talking about access lists?  If so then yeah, the question is \"why not?\"",
        "created_at": "2021-01-22T18:39:41.257000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "why =\u003e 1 extra byte per tx since they ACLs will likely not be utilized except to unbork a tx",
        "created_at": "2021-01-22T18:40:10.675000+00:00",
        "attachments": null
    },
    {
        "author": "zerowei4320",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Do you like parallel processing and reduction of ddos attack vectors?",
        "created_at": "2021-01-22T18:40:10.894000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "but i don't have a strong opinion",
        "created_at": "2021-01-22T18:40:15.046000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Having a transaction type for 1559 with access lists and 1559 without access lists is possible, but annoying.",
        "created_at": "2021-01-22T18:40:19.299000+00:00",
        "attachments": null
    },
    {
        "author": "zerowei4320",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If not shut down your machines.",
        "created_at": "2021-01-22T18:40:30.060000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think the argument is that access lists are for more than just unborking transacitons.",
        "created_at": "2021-01-22T18:40:51.223000+00:00",
        "attachments": null
    },
    {
        "author": "zerowei4320",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Access lists provides increased accessibility to an upper bound on compute time.",
        "created_at": "2021-01-22T18:40:53.424000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@273808422753796097\u003e can probably go into more detail on why we should port access lists forward to new transaction types.",
        "created_at": "2021-01-22T18:41:14.853000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "good enough for me",
        "created_at": "2021-01-22T18:41:25.272000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e Introduces the access list format and the logic for handling the format. This logic can later be repurposed for many other purposes, including block-wide witnesses, use in ReGenesis, moving toward static state access over time, and more.",
        "created_at": "2021-01-22T18:41:33.652000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(from 2930)",
        "created_at": "2021-01-22T18:41:37.210000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "not really, because i don't have to SLOAD only from the slots in the ACL",
        "created_at": "2021-01-22T18:42:10.451000+00:00",
        "attachments": null
    },
    {
        "author": "zerowei4320",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Agreed you’ll still potentially load one. But properly formed acls will result in a lower net compute time as the producer becomes better at forming them.",
        "created_at": "2021-01-22T18:42:49.180000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In theory, if everyone shipped transactions with fully populated access lists then you may have something like 10,000,000 gas worth of access lists and 2,000,000 gas worth of \"other stuff\".",
        "created_at": "2021-01-22T18:42:58.829000+00:00",
        "attachments": null
    },
    {
        "author": "zerowei4320",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Always the potential for outside acl SLOAD but the concept is they a user sensing an acl txn takes that exposure as a fee and one they is higher per byte of access",
        "created_at": "2021-01-22T18:43:20.560000+00:00",
        "attachments": null
    },
    {
        "author": "zerowei4320",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So we are incentivized to provide robust acls",
        "created_at": "2021-01-22T18:43:28.678000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And while you don't know what that 2M worth of \"other\" is, you do know exactly what that 10M of access lists are.",
        "created_at": "2021-01-22T18:43:40.585000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "again, ACLs are hard because the state may change and the execution flow that generated the original ACL can be totally different than what it was originally thought to be",
        "created_at": "2021-01-22T18:43:55.423000+00:00",
        "attachments": null
    },
    {
        "author": "zerowei4320",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It’s an increase is accessing a probabilistic upper bound. By a few orders of magnitude.",
        "created_at": "2021-01-22T18:44:10.462000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You could even cherry pick transactions (during times of increasing congestion) with overlapping access lists to reduce uncle risk (faster processing time, same gas fees).",
        "created_at": "2021-01-22T18:44:11.289000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "FWIW I'm not arguing that access lists are particularly useful in this regard, especially post 1559.  Just that there are some theoretic gains that could be had.",
        "created_at": "2021-01-22T18:44:44.268000+00:00",
        "attachments": null
    },
    {
        "author": "zerowei4320",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As well it will allow for new algorithms in state loading from mempool, hot loading becomes possible during txn flight vs during speculation/block formation.",
        "created_at": "2021-01-22T18:45:02.729000+00:00",
        "attachments": null
    },
    {
        "author": "zerowei4320",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Txns will also start to be batched based on acls as processing a batch of uniswap txns that all access the same coinstate(dai) becomes more efficient",
        "created_at": "2021-01-22T18:46:00.674000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Eh, the latter benefits mostly go away with 1559.",
        "created_at": "2021-01-22T18:46:48.027000+00:00",
        "attachments": null
    },
    {
        "author": "zerowei4320",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Imho they are amplified with 1559",
        "created_at": "2021-01-22T18:47:01.546000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In 1559, most of the time all transactions that *can* be included *will* be included.  There is no \"batching of transactions\" by miners.",
        "created_at": "2021-01-22T18:48:24.353000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And we don't have any other kind of batching available at layer 1 yet.",
        "created_at": "2021-01-22T18:48:38.136000+00:00",
        "attachments": null
    },
    {
        "author": "zerowei4320",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "With the ability to handle spike loads as well as “caching” it’s a bad term but let’s use it for the frame of the debate, predictable blocks will encourage more usage and with acls we will see miners gobble up similar state accessing txns because they are being laid a premium to already have it loaded by a trader per day.",
        "created_at": "2021-01-22T18:48:44.805000+00:00",
        "attachments": null
    },
    {
        "author": "zerowei4320",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My speculation is that we’ll start to see this development happening as it would be a net gain on efficiency on block formation. Loading new state for a higher priced txn vs including one for lower fees on state already loaded becomes a tangible effect.",
        "created_at": "2021-01-22T18:49:55.585000+00:00",
        "attachments": null
    },
    {
        "author": "zerowei4320",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The best earned block block is will no longer be the highest priced block vs compute time, but most well packaged for the state per cost I have to load. ACLs give miners another data point for block assembly.",
        "created_at": "2021-01-22T18:50:57.460000+00:00",
        "attachments": null
    },
    {
        "author": "zerowei4320",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Akin to how a Purolator van is packaged today.",
        "created_at": "2021-01-22T18:51:26.548000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "With 1559 the expectation is that having full blocks (meaning there wasn't enough space for an eligible transaction) is going to be rare.  This means there is very limited opportunity for miners to pick and choose which transactions go into a block unless they are willing to leave money on the table.",
        "created_at": "2021-01-22T18:52:05.934000+00:00",
        "attachments": null
    },
    {
        "author": "zerowei4320",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "With 2930 there is no reason not to leverage the increased efficiency around txn ordering and inclusion. \n\nParallel execution of bundles based on probable state needs as well.",
        "created_at": "2021-01-22T18:53:05.344000+00:00",
        "attachments": null
    },
    {
        "author": "zerowei4320",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "When MeV is curtailed with 1559 ordering of inclusion vs state lookups is where the rest of the juice is.",
        "created_at": "2021-01-22T18:53:37.119000+00:00",
        "attachments": null
    },
    {
        "author": "zerowei4320",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Imho",
        "created_at": "2021-01-22T18:53:45.727000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As a miner you would benefit very little from such a thing.",
        "created_at": "2021-01-22T18:54:57.394000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "To benefit, you would need to find a specific transaction **order** that resulted in more access list hits.  And even then, access lists still cost the same, it just allows you to know what *might* be accessed in a transaction before executing it.",
        "created_at": "2021-01-22T18:56:11.499000+00:00",
        "attachments": null
    }
]