[
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I considered this, and decided it ultimately might be a productive incentive if anything—the quadratic component is not technically necessary, the unused base fees could be refunded equally, but I think it’s very important that the network support small transactions and wanted to offer that up for brainstorming.\n\nI lack the deep technical understanding of Ethereum internals to know what actually implementing this would look like, but I’m grateful for the positive responses and would be interested in talking more about this. Are the concerns about Rollups alleviated if we say, “burnt base fees will be refunded equally, or pro rata (just not quadratic)?” \n\nI will spend some more time thinking about this, my initial assumption was that it was naive and didn’t make sense but hopefully someone would help me see why. That it’s not being rejected out of hand is very interesting to me.",
        "created_at": "2021-11-01T02:45:58.326000+00:00",
        "attachments": []
    },
    {
        "author": "sumsof",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't understand the purpose of this proposal. Why should Ethereum try and encourage more smaller transactions and fewer large ones?\n\"Transactions per second\" are useful only in as far as they enable meaningful activity, not something that should be maximized for its on sake. The only purpose of doing so would be to improve the stats in the misleading TPS comparisons between blockchains.\nWhy should it be decided at the protocol level that we need fewer e.g. Tornado Cash ZK proofs, and more standard ETH transfers, if users are willing to pay much more for the former?",
        "created_at": "2021-11-01T03:00:25.525000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The quadratic component is not the main concept, just something I personally considered talking about, as I clarified already.\n\nThis basically looks like a subsidy over a burn, so the subsidy component lends itself to quadratic funding-type approaches, and is usually raised in the context of public goods, which is basically the situation here (it’s too expensive for most people to transact).\n\nThe main concept is refunding the base fees (quadratically, linearly, equally)  rather than burning them, in order to remove the deadweight loss on transactions.",
        "created_at": "2021-11-01T03:06:32.502000+00:00",
        "attachments": []
    },
    {
        "author": "sumsof",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If you refund some fraction of the fees to the users, then the basefee would simply increase by the same amount in equilibrium.\nIt should be understood that the burnt basefees are *not* a deadweight loss, and do not represent destroyed value. Rather the value accrues to holders of ether, similar to e.g. a stock buyback",
        "created_at": "2021-11-01T03:09:55.602000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, I understood this to be trading deflationary pressure for more affordable transaction costs.\n\nWhy would the base fee rise in equilibrium, isn’t it just a function of gas? Maybe the average tip would rise such that the base fee basically becomes useless, if that’s what you mean.\n\nDo you think there’s any useful interpretation of this idea?",
        "created_at": "2021-11-01T03:12:32.676000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The base fee is automatically set in order to equalize supply and demand of blockspace.  If there is more demand for blockspace than there is supply, then the base fee will increase to reduce demand (the higher the base fee, the less demand there is for blockspace due to the high cost).  If supply is greater than demand, then the base fee will decrease in order to incentivize more demand for blockspace.",
        "created_at": "2021-11-01T03:15:06.274000+00:00",
        "attachments": []
    },
    {
        "author": "trent_vanepps",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "how are you measuring \"smaller\" transactions here? the value of the transaction payload in USD?\n\nthis would require an in protocol oracle if so",
        "created_at": "2021-11-01T03:35:46.774000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Gas fees (tip), or even gas used. Have mostly been thinking in terms of gas tips, will elaborate more, using tips as the example. “Gas used” would be very interesting (and incentivize efficient programs) but I’m trying to think purely in terms of gas fees at the moment.\n\nNo USD, no oracles.",
        "created_at": "2021-11-01T03:36:07.841000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "When you *send* a transaction, you’re paying the base fee which is estimated based on network congestion. Everyone will pay the same base fee for the current block, plus a tip.\n\nWhen the block is *mined*, we know how everybody bid, in terms of tips, and transactions could be refunded a share of the “congestion premium” in proportion to their miner tips. **In this way, transactions will not share equally in the base fee after the block is mined, though they have to pay the same amount up front.**\n\nConsider a one-transaction block: They will pay no base fee (only tip) after the tx is settled despite paying it when they sent it. For a 2-tx block, both bidding equal tips, they also pay no base fee after the block is mined, since the refund is split evenly between them. If they paid the base fee and bid tips of 0.01 ETH and 0.02 ETH, then the higher tipper will be refunded 2/3 of the total base fees and the other 1/3, since their tip was 2x more than the other. And so on.\n\nCurrently, to transact, you pay the premium plus a tip and the premium goes right into the black hole. It seems like there could be a way to use the information learned *after the auction settles* (at the time of block proposal) to refund base fees in a way that reduces deadweight loss on users.\n\nMy understanding is that this is a choice between subsidizing a public service or driving deflationary monetary policy. Someone wanting to interact with a Web3 service wants to do that at that moment—buy an ENS name or something—not hold Ether and sleep soundly dreaming of market capitalization. I think it’s politically infeasible to not burn some amount of the base fee, but trying to think outside of the box here regarding fee markets.",
        "created_at": "2021-11-01T03:44:07.780000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Like I said, this is not a complete idea at all, but I think there’s utility in it somewhere.\n\nGoing back to the quadratic refund concept, that is just a way to, when the block is mined, look at the distribution of tips, and subsidize the smaller ones. If the whole distribution moves up, it doesn’t change—but smaller transactions in a block would share less of a burden regarding congestion.\n\nIt might be that *gas used*, actual drag on the network, is a better metric to think about this in the context of. There, if your transaction is lightweight compared to others in the block, you get refunded a larger share of the base fee; computationally intensive (high-gas) txs would simply not be subsidized (but no penalty).",
        "created_at": "2021-11-01T03:51:18.131000+00:00",
        "attachments": []
    },
    {
        "author": "gwintery",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't think there is any reason the protocol would want to subsidize less computationally intensive transactions over more computationally intensive transactions?",
        "created_at": "2021-11-01T03:57:54.883000+00:00",
        "attachments": []
    },
    {
        "author": "gwintery",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "IMO all transactions are equal and they pay the going rate which is the base fee",
        "created_at": "2021-11-01T03:58:32.132000+00:00",
        "attachments": []
    },
    {
        "author": "sumsof",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!194196290442100736\u003e maybe you already understand this, but when people are talking about \"base fee\" in this context they typically mean base fee *per gas*. Transactions that use a lot of gas already pay proportionally more.",
        "created_at": "2021-11-01T04:04:09.244000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Because computationally expensive transactions cause network congestion and so they would have to pay high fees, as they already do, to get included.\n\nIt seems obvious why we would want to incentivize low gas usage. The issue is the base fee will still get paid, as a function of the total network congestion, **but a transactions that are contributing the least would have a large portion of those fees quadratically refunded.**",
        "created_at": "2021-11-01T04:11:38.189000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah definitely—so you bid 2x more base fee per gas, I’ve bid half as much, proportion is 2:1, etc.",
        "created_at": "2021-11-01T04:13:05.518000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The gas metering system already does this.  It is *why* some transactions cost less gas than others, because we are already discounting transactions that \"cost\" the network as a whole less than others.",
        "created_at": "2021-11-01T04:13:07.536000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes. But the smallest transaction right now would still cost $200 in ether and most of it would be the base fee that goes straight into the black hole.\n\nThis is the entire principle here. Every transaction is not contributing equally to what the base fee will be, yet everyone will pay the same base fee per gas, and it will all get burned. I am proposing it be refunded quadratically, subsidizing the least congestion-producing transactions.",
        "created_at": "2021-11-01T04:15:34.160000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e Every transaction is not contributing equally to the base fee\nWhy do you believe this?",
        "created_at": "2021-11-01T04:16:24.278000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You quoted before I edited the phrasing to “what the base fee will be,“ i.e. for the last or current block. If I go send a transaction that consumes near-zero gas, **my influence on the base fee for the current block is basically nothing**, yet I would have to put up as much as an arbitrarily computationally expensive transaction, only to see a chunk of it burnt.\n\nEvery transaction is not contributing equally to congestion, yet they all pay the same base fee as a function of it. There’s no away around that when the transaction is sent—but when the block is proposed, they could be refunded according to their *actual* “congestiveness” in proportion to each other, which is only known once a block is being proposed and all the transactions are known.",
        "created_at": "2021-11-01T04:20:21.667000+00:00",
        "attachments": []
    },
    {
        "author": "sumsof",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That's just wrong? If I have a tx that consumes 1M gas at a price of 100 gwei basefee then I pay 0.1 eth in basefee, but if someone has a smaller tx that uses only 65k gas, then they would pay only 0.0065 eth for the basefee",
        "created_at": "2021-11-01T04:27:00.535000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The base fee is charged per gas, so you are already charged proportionate to your gas used.",
        "created_at": "2021-11-01T04:27:07.689000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If you use 21,000 gas, then you are charged `base_fee * 21000`.  If you use 21,000,000 gas, then you are charged `base_fee * 21000000` (1000x more).",
        "created_at": "2021-11-01T04:27:33.856000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So I think the system already does exactly what you want.",
        "created_at": "2021-11-01T04:27:39.873000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So, I understand this, I’m saying we would refund (subsidize) the base fee *per gas*. Everyone is paying the same pro rata base fee.\n\nYou would [end up] pay[ing], e.g., `20000 * base_fee * base_fee_share`.",
        "created_at": "2021-11-01T04:29:15.665000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I must be misunderstanding something.  You indicated that you subsidize people based on their contribution to the congestion, but that is already what we do.  Everyone is charged based on their contribution to the congestion.",
        "created_at": "2021-11-01T04:31:29.718000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This would functionally just be a lowering of the base fee, which would result in the base fee failing to serve its purpose.",
        "created_at": "2021-11-01T04:31:49.937000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "How? If I’m the most gas-intensive tx in a block, my share of the base fee would approach 100%. If I’m the least, it would approach 0%.",
        "created_at": "2021-11-01T04:33:29.971000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I will pick out a block and do a write-up with a better example and break down exactly what this would look like in practice.\n\nI reject that “this is already how it works,” which is basically what I’m hearing, because no matter how small your tx is, you’re paying a premium for the average congestion despite disproportionately not contributing to it.\n\nThis subsidy also isn’t coming from thin air, it would be coming from the fees that are currently burned. Not a free lunch.",
        "created_at": "2021-11-01T04:34:27.341000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And the amount of ETH you burn will similarly approach 100% as you approach the block gas limit for your transaction, and the amount of ETH you burn will similarly approach 0% as you approach 0 gas used.",
        "created_at": "2021-11-01T04:54:57.570000+00:00",
        "attachments": []
    },
    {
        "author": "gwintery",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That's... Why we have gas metering system?\n\nOn the other hand would this not incentivize people to not do computationally intensive transactions, hence hindering DeFi and DApps adoption?",
        "created_at": "2021-11-01T05:20:39.137000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We have a *broken gas metering system, yes.",
        "created_at": "2021-11-01T05:21:16.802000+00:00",
        "attachments": []
    },
    {
        "author": "gwintery",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I have no idea why it is broken, still trying to understand your argument",
        "created_at": "2021-11-01T05:21:41.890000+00:00",
        "attachments": []
    },
    {
        "author": "gwintery",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My understanding of the gas metering system is to ensure that an equilibrium is found where people will pay what they are willing to pay to execute their transaction. It is not to free up congestion of the network.",
        "created_at": "2021-11-01T05:34:35.446000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My point is that, at this specific moment and many times over the last few years as we all know, even the smallest transactions need to be sent with fees that amount to the monthly income of people in dozens of countries (several hundred USD) in order to get included in a block during periods of high congestion. For a block that I am looking at, 80%+ of those fees got burned. Someone made the argument that's not a deadweight loss because it is deflationary and so if you're holding ether, it will appreciate in value, but that is positively insane to me because people just want to buy a $5 ENS name, they do not want to buy a $5 ENS name for $305 and see their ether appreciate.\n\nThe vast majority of people cannot afford to transact on the network right now, and I am trying to understand what can be done about it. It strikes me as a tragedy of the commons problem where the issue is not computational resources, but the result of people having to outbid each other for access to the network, and so I'm wondering if quadratic base fee refunds could be a way to ease the burden on \"smaller\" (do not know by what metric) txs.",
        "created_at": "2021-11-01T05:38:56.682000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And I'm sorry if I'm not being clear, I'm trying my best here, will try to do a longer-form write-up, and give a lazy example here.\n\nLet's look at block #13518467, containing 3 transactions. ~0.0475 ETH paid in gas, ~0.0396 ETH in base fees burnt, ~0.007 ETH went to miners as tips after the burn.\n\n**If the burnt fees had been quadratically refunded to the lowest-gas transactions,** the gas paid would've been only the ~0.007 ETH in total vs 0.0475 ETH after \"settling\" (being mined), with the different transactions being refunded a fraction of their base fee according to their relative gas consumption. A large portion of the lowest gas transaction's (0xdb595d...af5fff) total base fees of ~0.0071 ETH would have been refunded compared to the largest gas transaction's (0x161e72...383414) total base fees of 0.0179 ETH (which would have seen, under this framework, exponentially less susbidy).\n\nAnd again this \"refund\" is coming from the fees which are currently now burnt. In reality I don't think it's politically feasible to not burn *any* of the base fee, but burning 100% of it seems counterproductive in terms of keeping the network affordable for non-congesting transactions in times of high *average* congestion.\n\nhttps://etherscan.io/txs?block=13518467",
        "created_at": "2021-11-01T05:42:19.950000+00:00",
        "attachments": []
    },
    {
        "author": "gwintery",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I understand your frustration, I had to limit my usage of the network to layer2s as well.\n\nHowever, I do not think your proposed idea will solve the problem of lowering the base fee. It will make it worse for people interacting with smart contracts and tokens (Buying ENS, uniswap,etc). This will also make ethereum more prohobitive to access except for the 'whales'. Do note that even non whales would want to do computationally intensive transactions.\n\nThe general idea of being refunded would probably also push average base fee to be higher as people are more willing to execute their transaction.",
        "created_at": "2021-11-01T05:48:07.030000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We have no way of differentiating who is poor and who is wealthy, so we cannot subsidize poor people using the platform.",
        "created_at": "2021-11-01T05:48:23.149000+00:00",
        "attachments": []
    },
    {
        "author": "gwintery",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Congestion will only increase IMO, and there is no quick hack to lower it and make it affordable to everyone other than increasing the network throughput to handle the increased demand",
        "created_at": "2021-11-01T05:49:37.551000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e The vast majority of people cannot afford to transact on the network right now, and I am trying to understand what can be done about it.\nPeople are working very hard on solving this problem, but it isn't easy.  Layer 2 solutions, state expiry, light clients, verkle trees, statelessness, regenesis, and sharding are all things that will help contribute to making more space available on Ethereum.  None are really ready for prime time yet though, and many are still in the research phase.",
        "created_at": "2021-11-01T05:50:06.296000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Lol. Vitalik is on record pointing out that even $0.05 transaction fees are not sustainable. High fees are friction the prevent people from being able to use the network. It has nothing to do with discerning who is poor and who is wealthy.",
        "created_at": "2021-11-01T05:50:16.752000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Everyone agrees with you that we want Ethereum to scale.  It is a *really* hard problem though when you are unwilling to sacrifice censorship resistance.",
        "created_at": "2021-11-01T05:50:49.099000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I know, have been for years. I think it requires L1 change because L2 requires 2x L1 fees to bridge in and out, right? So it doesn't just disappear.",
        "created_at": "2021-11-01T05:50:56.036000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I understand and appreciate that. Just trying to think of ways to reduce waste in fee markets.",
        "created_at": "2021-11-01T05:51:19.069000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Bridging is definitely a concern with L2s, and why they aren't the only thing being explored at the moment.",
        "created_at": "2021-11-01T05:51:29.775000+00:00",
        "attachments": []
    },
    {
        "author": "sumsof",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Your proposal would make ENS registrations more expensive, since they use like hundreds of thousands of gas (more than the sushiswap tx that you thought should be increased)",
        "created_at": "2021-11-01T05:51:32.543000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "How does not subsidizing a transaction make it more expensive?",
        "created_at": "2021-11-01T05:51:59.023000+00:00",
        "attachments": []
    },
    {
        "author": "sumsof",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Because basefee will adjust in equilibrium",
        "created_at": "2021-11-01T05:52:14.416000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Why?",
        "created_at": "2021-11-01T05:52:24.328000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It's a function of previous block gas, no?",
        "created_at": "2021-11-01T05:52:35.383000+00:00",
        "attachments": []
    },
    {
        "author": "sumsof",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That's how it works. Read the 1559 spec",
        "created_at": "2021-11-01T05:52:36.006000+00:00",
        "attachments": []
    },
    {
        "author": "ctjlewis",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It's a function of previous block gas, no?",
        "created_at": "2021-11-01T05:52:42.835000+00:00",
        "attachments": []
    },
    {
        "author": "gwintery",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Not necessarily, for small holders, I think the critical turning point will be exchange integrations. If exchanges adopt withdrawals to L2, there will be no need for small holders to even bridge to L1",
        "created_at": "2021-11-01T05:52:48.121000+00:00",
        "attachments": []
    },
    {
        "author": "gwintery",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "they will essentially live in L2 forever",
        "created_at": "2021-11-01T05:53:05.447000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, the base fee is a function of the previous block's gas used relative to the gas limit.",
        "created_at": "2021-11-01T05:53:10.003000+00:00",
        "attachments": []
    },
    {
        "author": "gwintery",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "A very hypothetical scenario of the refund inducing higher demand for smaller transactions to be executed, increasing overall blockspace demand, raising the average base fee to find a new equilibrium which probably would be similar to the previous equilibrium - refunds.",
        "created_at": "2021-11-01T05:55:16.192000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Besides the technicalities of smaller vs bigger transactions or zk proofs vs usual mainnet transfers. I think there's a valid point raised here: burning base fee is a redistribution among holders. It may be worth looking for ways is redistribute it among users instead",
        "created_at": "2021-11-01T09:37:57.471000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think the point here is that if it's $2 cheaper for everyone to send transactions, then at equilibrium basefee will simply be $2 higher. You can adjust the rebate slope such that different users get different rebates and it might give you a slightly different result, but the point will still be that basefee will converge to the effective value of the 15 million-th unit of gas demanded, where the effective value is (user value + expected rebate - priority fee)\n\nthere are interesting links between 1559 and congestion however, some I looked at here https://barnabe.substack.com/p/congestion-control-and-eip1559 congestion is sort of quadratic in nature: when there is one extra user that joins, it adds 1 unit of \"stress\" to every other user in the system, so if you have n users, roughly congestion looks like n^2 (for linear congestion functions). but the pricing internalises this pressure, in a sense you can see the included users as paying roughly the \"damage\" incurred by the next non-included user (that value of the 15 million-th gas unit). It does currently internalise it in a proportional (not equal) way between small and large transactions, but the question to ask should be \"does internalising it in a more-than-proportional way encourage reduced gas footprint?\" there is already an incentive to have the smallest possible gas footprint, since the pricing is linear (per gas unit), so you would have to show why making that incentive quadratic, at the cost of more complex pricing (current oracles don't rely on the transaction size for instance), makes us better reach the outcome of gas efficiency",
        "created_at": "2021-11-01T09:42:14.553000+00:00",
        "attachments": []
    },
    {
        "author": "gwintery",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think this is a valid area to consider, especially since the possibility of ETH becoming more deflationary going forward.",
        "created_at": "2021-11-01T12:28:03.732000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Distributing to holders is trivial and can be done without any bias and with credible neutrality and without opportunity for gaming the system.  Distributing to pretty much any other group is either harder, biased, not neutral, or gamable.",
        "created_at": "2021-11-01T13:50:26.899000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I do agree that distributing to \"users\" would be optimal, but we do not have a mechanism for that that isn't overly complex.",
        "created_at": "2021-11-01T13:51:00.460000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "One big challenge for this is that any redistribution to \"users\" is gameable by miners/validators/block producers. It's pretty easy to imagine most such implementations ending up as \"redistribution to MEV bots\".",
        "created_at": "2021-11-01T13:59:41.917000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The two neat things about the base fee, IMO, are that (1) it's based on something the current block builder can't change (the previous block) and (2) every transaction needs to pay it / there is no way to get around it or get a kickback of some sorts because it is burnt, so it's ~impossible to game.",
        "created_at": "2021-11-01T14:01:30.569000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "that being said, I'm not against proposals which aim to (neutrally + trustlessly + w/o introducing on chain governance) redistribute it better, but it's a _much_ harder problem than it appears at the surface if we don't want to lose the properties I mentioned above 😅",
        "created_at": "2021-11-01T14:02:19.110000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I agree that it's probably an impossible problem to solve, and that you guys probably thought long about this before deciding to return to all holders. It is literally impossible to solve without losing your second property by definition (almost, in principle you can burn base_fee and then reduce proportionally all holders accounts 😆 ). But keeping one you could 1) keep a map address--\u003e rebate address that is by default the identity map, and then rebate the previous block's transactions to their rebate address. I suppose this is broken, but is neutral, trustless and without on chain governance.",
        "created_at": "2021-11-01T14:41:49.213000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah, the problem is you can't do all of them (at least that we have found).",
        "created_at": "2021-11-01T14:50:58.065000+00:00",
        "attachments": []
    }
]