[
    {
        "author": "_____josh_____",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I know most people on this service don't care about miners but I believe it's time to start considering the possibility of pools collectively disappearing. Would there be enough concentrated on the remaining spark/ethermine duopoly or even with a single miner to risk a 51% attack on the network?\n\nJust following the pool wallets on the recent blocks page, many of the smaller pools are sitting on amounts they would never ever dream off by running the service legitimately. Smaller wallets are sitting at 10-15m when they only make 100-200k a year.\n\nEven for the giants, ethermine/spark/hiveon have 12/15/25m each respectively. While these might not be retirement levels yet, if current trajectory continues, it might just be the case within a month.\n\nMost of this is a result of 1559, where the pools that used to mine their own blocks can no longer do so. With average gas sitting at 200 levels, most of the small miners just choose to hoard the balances. \n\nHopefully you guys see this growing problem of \"predictably\" high gas.\n\nhttps://etherscan.io/blocks?p=1",
        "created_at": "2021-09-03T18:55:04.534000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i don't follow the argument, also difficulty/hash rate seem at ATH, why do you think smaller pools are \"no longer mining their own blocks\"? (and whose blocks are they mining?) also what's the relationship between 1559 and the high gas price level?",
        "created_at": "2021-09-03T20:24:52.197000+00:00",
        "attachments": []
    },
    {
        "author": "chris2_2_2",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Pools@can’t payout on own blocks and thus reduce block rewards to cover gas. So now miners are directly paying their own gas. So they take less payouts.\n\nIt’s like public versus private Medicare, when you pay yourself directly instead of through taxes you go less often. \n\nAnd of course that creates more risk as now more eth is held by pool wallets at any one time",
        "created_at": "2021-09-03T22:22:58.651000+00:00",
        "attachments": []
    }
]