[
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "To the risk of being way off topic, but why is that metamask offers me to set `max_fee_per_gas` more than twice as much as the current `base_fee`? This is very confusing at least to me, I would have thought it to be essentially impossible to double the base fee so fast. I get it that the intuit is that the average user would want to be included in the next slot, but this should be irrelevant, if anything the tip should be higher. The only scenario where I can see this playing a role is when we have plenty of full slots in a row and the base fee continuously increasing, but then I think the default should be the other end of the spectrum: offer to have a very low max fee to protect the average user and let the user that actually wants to force his transaction in this market to increase it. Am I thinking this whole thing wrong?",
        "created_at": "2021-08-26T08:51:10.173000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I assume you know there's no risk of overpaying with the `max_fee_per_gas`, you get a refund up to the base fee (minus the priority fee).\nThen I'd say it's a UI issue where you have a trade-off between people getting very confused with \"A stuck transaction? What's that? Why are all my next transactions also stuck?\" and the off-chance that a user ends up sending a transaction just when there's an NFT release or something.",
        "created_at": "2021-08-26T08:56:12.613000+00:00",
        "attachments": []
    },
    {
        "author": "kamapcrazy",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I looked at some transactions and see that:\n `transaction_fee`  = `gasUsed * gasPrice`\n`gasPrice`  = `baseFee + priorityFee`\n\nso as I understand, in order to set the max `transaction_fee` that we willing to pay, we would use `gasLimit`\n\nnot understands is why is there the `max_gas_fee`",
        "created_at": "2021-08-26T09:02:41.814000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But the point is that a higher max fee should not help at all with regards to a stuck transaction! Only in the scenario that it is set less than the base fee is that you get actually stuck. So I don't see how having it more than twice the latests base fee helps at all in this regard. A more reasonable limit will help more users as far as I can see",
        "created_at": "2021-08-26T09:04:40.359000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Of course it helps. If you set the max fee to the current base fee, you're very likely to get a stuck transaction",
        "created_at": "2021-08-26T09:05:53.520000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If you set it to double (of 1.3, or whatever factor makes sense), there might be the odd series of full blocks, but those are _mostly_ temporary. Rarely if ever does it spike up with 5+ full blocks in a row and then just stay at that base fee level for a long period of time",
        "created_at": "2021-08-26T09:07:25.261000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm not saying that it has to be base fee, I'm saying that more than double is too much! And unnecessarily too much",
        "created_at": "2021-08-26T09:08:26.966000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Why is it too much though?",
        "created_at": "2021-08-26T09:09:00.736000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You rarely if ever end up paying double",
        "created_at": "2021-08-26T09:09:17.789000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Agreed but a user that wakes up, sees base fee at 25Gwei, wants to transfer ETH to his children and is proposed to a max fee of 60, it happens to be unlucky and hits several full blocks in a row and ends up paying that much. On the other hand the user that actually wanted to get his transaction no matter what, would have raised the tip and leave the max to whatever it is. I think the defaults should help prevent the leisure user that does not need to keep track of market, that is prevent the first situation from happening",
        "created_at": "2021-08-26T09:12:32.312000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm not sure how you got `gasLimit` in the mix. That is an upper limit on `gasUsed`. \n\n`max_fee_per_gas` provides an upper limit on `gasPrice` in your example.",
        "created_at": "2021-08-26T09:12:33.600000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Again, there's a trade-off. I'm not saying that 2 times is the right value, but picking a low value only to end up with a stuck transaction is imo worse",
        "created_at": "2021-08-26T09:13:20.863000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Things are still a bit stabilizing, and I hope that something like 1.3 would make a good default that works 99+% of the time. But I haven't looked at the data",
        "created_at": "2021-08-26T09:13:56.130000+00:00",
        "attachments": []
    },
    {
        "author": "kamapcrazy",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I meant that we would need to set the upper limit on one of those `gasLimit` or `max_fee_per_gas`\nis that right?",
        "created_at": "2021-08-26T09:14:03.107000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Sure, I see that the limit of proposing a max fee of less than base fee is too much, but I think that twice is the other extreme",
        "created_at": "2021-08-26T09:14:57.134000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "gasLimit is what it always has been. For a regular tx just set it equal to the gas you know you are going to use = 21000. \nIf you do some contract call that takes 200K gas, but you set a limit of 100K, all that will happen is that you pay 100K * gasPrice, and _still_ end up with a failed transaction.",
        "created_at": "2021-08-26T09:15:18.385000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm a bit hesitant to say it's an extreme without having looked at the data. I really don't know if it's common or not to have 5 full blocks in a row",
        "created_at": "2021-08-26T09:16:14.970000+00:00",
        "attachments": []
    },
    {
        "author": "kamapcrazy",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "that says we just need to set the higher `gasLimit` 🙂",
        "created_at": "2021-08-26T09:19:52.288000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "gasLimit is in units of `gas`, not in `gwei` or `gwei/gas` (or `wei` really)",
        "created_at": "2021-08-26T09:20:44.909000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "gasPrice has units `wei/gas`, and so do `max_fee_per_gas` and `priority_fee_per_gas`",
        "created_at": "2021-08-26T09:22:26.956000+00:00",
        "attachments": []
    },
    {
        "author": "kamapcrazy",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "nearly get it,\nwe set higher `gasLimit` when we don't know exactly how much gas would consume by the contract call\nso if a `swap` call cost about 100,000 gas, it doesn't matter how much `gasLimit` do we set, it always cost us 100,000?",
        "created_at": "2021-08-26T09:24:25.602000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As long as you set gasLimit to higher than 100K yes. It's there for the miner to make an educated guess about what txs they can include in the block (and prevent against DDoS attacks)",
        "created_at": "2021-08-26T09:25:09.645000+00:00",
        "attachments": []
    },
    {
        "author": "kamapcrazy",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it takes me to another question:\n- `base_gas_fee` = 70\n- `priority_gas_fee` = 2\n-`max_gas_fee` = 100\nhow the miner would end up with a `gas_price` which is somewhere between 72 - 100?",
        "created_at": "2021-08-26T09:27:20.548000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Six full blocks put you precisely at twice the base fee, and they do happen, but I think the wallet should protect the user from this scenario rather than making it more vulnerable to pay more when he probably didn't need his transaction included right away",
        "created_at": "2021-08-26T09:28:18.426000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But it seems this is the fundamental difference in our thinking",
        "created_at": "2021-08-26T09:28:39.807000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The miner will get at most `priority_fee_per_gas` * gas_used. And as long as your `max_fee_per_gas` is higher than the `base_fee_per_gas`, your transaction is eligible for inclusion. If there's room in the next block, you'll end up paying 70 + 2 (the 70 is burned). If the block ends up doubly full, the base_fee increases to ~79. Assuming the next block is _not_ doubly full, you get in there and pay 79 + 2 (79 of which is burned, and the 2 goes to the miner)",
        "created_at": "2021-08-26T09:30:57.647000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't think there's a difference in our thinking, there's definitely room for improvement on what factor makes sense. But it will always be a trade-off between the possibility of a stuck transaction and \"overpaying\" when sending a tx when there's a spike in demand (I say overpaying, because maybe the user was OK with waiting longer, maybe even a day).",
        "created_at": "2021-08-26T09:33:16.003000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But dealing with \"So you're OK with waiting a day, but what will you do if it's still stuck then?\" is not easy.",
        "created_at": "2021-08-26T09:33:59.181000+00:00",
        "attachments": []
    },
    {
        "author": "kamapcrazy",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "thank you so much for clearly explains\nI got it now ❤️",
        "created_at": "2021-08-26T09:34:30.115000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I've seen too many newbies get confused and doing weird things when transactions get stuck, so I'm a bit more on the side of \"let's prevent that from happening if they don't really know how this all works yet\"",
        "created_at": "2021-08-26T09:34:48.914000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I agree that paying 100 Gwei/gas vs 200 Gwei/gas is a big difference. But what if it was 1 Gwei/gas vs 2 Gwei/gas (still a factor of 2)",
        "created_at": "2021-08-26T09:35:31.958000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah that's why I came here asking cause I don't know if mm gives a constant factor or if it's dynamic depending on market conditions. I only tried today (ended up setting 1/3 of base fee manually) . And yes, twice as much in non-volatiles scenarios are not so hurtful (gas fees are also lower typicality",
        "created_at": "2021-08-26T09:40:53.396000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I have been recommending wallets do 2.06 (or whatever it is) the current base fee.  The reason for this is because one of the biggest UX problems for users is stuck transactions.  The idea is that 2x the fees in *most* cases won't change a user's decision making process, stuck transactions often end up with a lot of pain and suffering for users and sometimes lead to them getting scammed.",
        "created_at": "2021-08-26T10:39:59.262000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Barnebe has been doing some great work to figure out what percentage of time various base fee multipliers would be included within the next 6 blocks, and it may turn out that pragmatically we can probably get nearly the same success rate with a lower value.",
        "created_at": "2021-08-26T10:40:50.493000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But I think given no information up front 6 full blocks was a quite reasonable starting point.",
        "created_at": "2021-08-26T10:41:12.629000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So in principle a anything over 2.027 will work for 6 blocks. My problem with this recommendation is that it is actually effective in the sense that the transaction enters in 6 blocks and not in 5 with a lower multiplier, only when the market is indeed producing lots of full blocks. In this scenario, a strategy to be included would be to increase the tip rather than the max_fee.  Also in these cases typically `base_fee`  will be already high, and the hit that an unsuspecting user takes is considerable. I get from both you and \u003c@!397389662085185547\u003e that stuck transactions are a major UX pain, but most of my news feed on Ethereum mention gas fees as a major complain, I think the interest in saving an unsuspecting user may be gauged against that of stuck transactions. Meaning a user that wants to play with the market in that situation should already be aware of the parameters, whether the victim of paying twice when he shouldn't have mind waiting longer does not need to be aware of the current market conditions.",
        "created_at": "2021-08-26T10:53:25.744000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Priority fee bidding is far more complicated than base fee increasing.  If all wallets execute priority fee bidding, you very rapidly can end up in a pathological situation where priority fee is same as max fee.",
        "created_at": "2021-08-26T10:58:10.086000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We want the default (built-in) behavior to be healthy for everyone as a whole.",
        "created_at": "2021-08-26T10:58:27.649000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Even if it may be suboptimal for individuals within that system.",
        "created_at": "2021-08-26T10:58:39.203000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There is a real world coordination problem similar to this where if you remove roads traffic can sometimes improve for everyone.  The problem is that in some situations, everyone individually behaving selfishly in a particular environment can result in things getting worse for everyone.  I believe this is one of those situations, where if everyone bids aggressively with the priority fee, then the system breaks down for everyone.",
        "created_at": "2021-08-26T11:06:37.098000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So there is value in making it so the default behavior is the one that is good for everyone, and if some people exercise a slightly optimized strategy for some particular goal, the system overall continues to work.",
        "created_at": "2021-08-26T11:07:16.501000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The nice thing about type 2 transactions is that the default strategy of 2x base fee and 1 priority fee is that it is quite close to optimal for what we believe is one of the most common newbie use cases, and it is a pretty good solution for almost all use cases (not terrible at least).",
        "created_at": "2021-08-26T11:08:41.434000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So while I agree that it may not be perfectly optimal for anyone, it serves as a great default IMO.",
        "created_at": "2021-08-26T11:09:09.376000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That being said, the work from Barnebe may result in dropping that down substantially, maybe to 1.3 or something.",
        "created_at": "2021-08-26T11:09:31.249000+00:00",
        "attachments": []
    }
]