[
    {
        "author": "zsfelfoldi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!552133098075193354\u003e I mentioned some time ago that I want to write an example 1559 fee oracle algorithm using `eth_feeHistory`. Here it is, though honestly I don't know yet for sure how well it will perform with actual market data but we'll have to wait for the actual market to find it out 🙂 Maybe some fine tuning will be needed but in the meantime I just wanted to share it as a WIP version.\nhttps://github.com/zsfelfoldi/ethereum-docs/blob/master/eip1559/feeHistory_example.js\nPlease also note that the `eth_feeHistory` result field names were incorrect in the API implementation on our master branch, fixed by this (yet unmerged) PR: https://github.com/ethereum/go-ethereum/pull/23178\n(my javascript code already uses the correct field names so currently it will only work with the above branch)",
        "created_at": "2021-07-09T04:29:18.315000+00:00",
        "attachments": null
    },
    {
        "author": "juanblanco",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!202397237962211328\u003e That is awesome, many thanks, if you don't mind I am going to port it to Nethereum and add it as an fee calculation strategy.",
        "created_at": "2021-07-09T05:58:08.777000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "has any research been done on the approximate time needed for the post1559 fee market to stabilize?  (asking from the perspective of the miner and future validator)",
        "created_at": "2021-07-09T10:48:10.942000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i suspect it will be well within the first hour .. (but this also assumes all miners expand the gas limit to 30MM)",
        "created_at": "2021-07-09T10:48:57.955000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it really depends what you mean by stabilize, and depends on several variables, including \n\n- tx demand heading into the fork\n- whether all miners update and maintain the same block gas limit (like you mentioned)",
        "created_at": "2021-07-09T13:06:21.426000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e the baseFeePerGas will be set to 1 gwei. This means that, at first, transactions will be competing via a first-price auction on the tip, as the baseFeePerGas reaches the rate where there is ~15m gas /100% demand at that price.\n\u003e \n\u003e If you assume the market price is 250 gwei on the fork date, this means that baseFeePerGas needs to go through ~50 blocks to get there, or slightly less than 15 minutes.\n\nobviously we are no longer in a 250 gwei regime, so this should be lower. read more here on the Cheatsheet I put together with Tim: https://hackmd.io/4YVYKxxvRZGDto7aq7rVkg?view",
        "created_at": "2021-07-09T13:09:03.654000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is cool!",
        "created_at": "2021-07-09T13:38:13.185000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thank you.",
        "created_at": "2021-07-09T14:18:19.864000+00:00",
        "attachments": null
    },
    {
        "author": "terra854",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Just wondering, is it possible for the mining pool operators to decide on how many txs to include in a block? Cause if that is so, they can be able to manipulate BASEFEE in a way by purposely not filling up the block to the max when they mine the block",
        "created_at": "2021-07-09T17:17:54.201000+00:00",
        "attachments": null
    },
    {
        "author": "peter.davies",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This has been extensively analysed and the conclusion is that they can't achieve anything by doing this and it will just cost them money.",
        "created_at": "2021-07-09T17:20:23.093000+00:00",
        "attachments": null
    },
    {
        "author": "peter.davies",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If they have more than 51% of miners colluding they can start causing problems, but the entire security of Ethereum depends on 51% of miners not colluding anyway.",
        "created_at": "2021-07-09T17:22:15.909000+00:00",
        "attachments": null
    }
]