[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is mentioned in the 1559 backwards compatibility section already (added it a week or two ago).",
        "created_at": "2021-01-26T04:25:15.942000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e The datastructure that is passed into keccak256 to calculate the block hash is changing, and all applications that are validating blocks are valid or using the block hash to verify block contents will need to be adapted to support the new datastructe (one additional item). If you only take the block header bytes and hash them you should still correctly get a hash, but if you construct a block header from its constituent elements you will need to add in the new one at the end.",
        "created_at": "2021-01-26T04:25:24.105000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "All of the on-chain block verifiers I know about receive a byte array from off-chain and then pluck data out of it.  Since we are adding to the end, they should all continue to work.",
        "created_at": "2021-01-26T04:26:28.460000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is not a guarantee, but I would like to see one real-world counter example that existed prior to a couple weeks ago before holding up 1559 because of this.",
        "created_at": "2021-01-26T04:27:01.958000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@486501030046203915\u003e I think that miner opportunity cost per gas for inclusion may be sub linear.  The more transactions that occur in a given block, the more likely you'll start reading the same storage slots over and over again which means you'll likely have the data cached.  I suspect this effect is incredibly small, but I don't know of any effect that goes the other direction so incredibly small wins.  😄  cc \u003c@273808422753796097\u003e in case you know of something that would counteract that.",
        "created_at": "2021-01-26T04:28:37.715000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ha yes I am willing to believe that 🙂 did i misinterpret aijan’s meaning of marginal cost? I feel this is what they were referring to",
        "created_at": "2021-01-26T04:36:08.485000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't think so, I just thought I would mention it since you were implying that gas costs may be *slightly* supra linear.",
        "created_at": "2021-01-26T04:41:12.931000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I guess i was more for the sake of argument, but i would 100% believe a linear (or sublinear) approximation is just as good (and even if not, that the measurement error would be bigger than the tip imprecision)",
        "created_at": "2021-01-26T04:43:11.117000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I see that. It means that the blob of block header data will just become bigger and since `sha3` has the length as one of the parameters, most of such use cases should not be broken.",
        "created_at": "2021-01-26T17:10:34.815000+00:00",
        "attachments": []
    }
]