[
    {
        "author": "p_bitfly",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "just some input on what we see from a miners perspective after eip 1559 went live: most of the fee rewards miners receive during demand spikes (like nft drops) are from the initial demand upramp (time it takes for the base fee to ramp up). this causes high fee reward periods to become very short, usually only a few blocks long. given the short time span of the base fee upramp this favors large mining pools (and staking pools in the future) as they have a higher chance of hitting those high rewards blocks compared to small pools. this will further increase centralization as miners will chose larger pools because of their more predictable income (this is the case already, but it is now amplified by the shortness of the reward spikes). adjusting the base fee adjustment so that is increases with a slower rate will make distribution of fees during demand spike much more wider (at the cost of less fee being burned)",
        "created_at": "2021-09-17T10:32:02.707000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "thanks for sharing \u003c@!471975503859810316\u003e !\n\nRe: \"adjusting the base fee adjustment so that is increases with a slower rate will make distribution of fees during demand spike much more wider (at the cost of less fee being burned)\", I believe this is something that some researchers are looking into. We discussed it on ACD and there was no objection to change the upramp/downramp speed if we could show data for what a better one would be.",
        "created_at": "2021-09-17T12:41:42.609000+00:00",
        "attachments": null
    },
    {
        "author": "p_bitfly",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yes, if the base fee adjustment would be a bit less responsive it would ensure a broader distribution of tx fee rewards during spikes",
        "created_at": "2021-09-17T12:45:23.383000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The goal needs to be to improve the user experience, not enrich miners more or spread fees out more evenly to miners.",
        "created_at": "2021-09-17T12:46:16.944000+00:00",
        "attachments": null
    },
    {
        "author": "p_bitfly",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "but the goal should also be not to further reduce decentralization of miners/stakers by benefiting large entities",
        "created_at": "2021-09-17T12:46:43.599000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'd much rather look into the AMM curve type of base fee, instead of finicking around with these details to make miners or staking pools richer",
        "created_at": "2021-09-17T12:48:40.106000+00:00",
        "attachments": null
    },
    {
        "author": "p_bitfly",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "there are lots of ways how to adjust the base fee, but the current mechanism increases variance of mining/staking rewards (compared to pre-1559 times). increased variance will benefit large pools/stakers vs. small ones",
        "created_at": "2021-09-17T12:51:06.889000+00:00",
        "attachments": null
    },
    {
        "author": "p_bitfly",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "previously mining revenue was more or less on par among most of the miners (https://www.etherchain.org/miner). after eip 1559 we started to see sometimes huge outliers in daily revenue for some miners (caused by them hitting block during the base fee onramp)",
        "created_at": "2021-09-17T12:54:36.082000+00:00",
        "attachments": null
    },
    {
        "author": "p_bitfly",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "large pools tend to hit those onramps more often compared to small pools (as they are quite short)",
        "created_at": "2021-09-17T12:54:51.776000+00:00",
        "attachments": null
    },
    {
        "author": "p_bitfly",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "causing higher revenue variance for small miners",
        "created_at": "2021-09-17T12:55:19.152000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And slower rising base fee gives rise to fee-dominated chain type of attacks (longer and more profitable to reorg)",
        "created_at": "2021-09-17T12:55:38.881000+00:00",
        "attachments": null
    },
    {
        "author": "p_bitfly",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "and large will give rise to 51% attacks as pools get too big",
        "created_at": "2021-09-17T12:56:37.640000+00:00",
        "attachments": null
    },
    {
        "author": "p_bitfly",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "as miners tend to favor consistent income vs. high variance",
        "created_at": "2021-09-17T12:57:10.417000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So either way it's risky, and seems that we need something else. Adjusting the base fee rate of increase is not going to help",
        "created_at": "2021-09-17T12:58:17.914000+00:00",
        "attachments": null
    },
    {
        "author": "p_bitfly",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it is just an observation we had during the last month that you may or may not take as input in futher developing the fee market",
        "created_at": "2021-09-17T12:58:44.186000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Oh definitely! And very much still relevant for after the merge as well. I'd also prefer fewer centralizing forces, but I don't think adjusting the rate of increase is the way to accomplish that",
        "created_at": "2021-09-17T13:01:31.283000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But actually my reading of the same information does not support for slower response, that may spread the earnings within more miners/validators, but that's essentially irrelevant, it would make the user experience worse and increase the need for a tip war",
        "created_at": "2021-09-17T17:10:39.529000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ah apologies continued reading just one comment and already \u003c@397389662085185547\u003e made the same point",
        "created_at": "2021-09-17T17:12:09.164000+00:00",
        "attachments": null
    },
    {
        "author": "bculberson",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it would be nice if tips \u0026 mev accumulated over N blocks and were distributed based on blocks won over that N",
        "created_at": "2021-09-17T18:46:35.142000+00:00",
        "attachments": null
    }
]