[
    {
        "author": "andi9314",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I was thinking it would be simplest to have the miner pay the tax from his block reward, so that the block reward is decreasing in block size. That way, a miner will add tx to his block until the marginal revenue from the fee from the user is equal to the marginal increase in the tax he pays to the protocol. So the miner will create large blocks only when there is large demand for transactions in that block. Users will just pay miners as they do pre-1559. Could having the miners pay cause other problems with implementation?",
        "created_at": "2021-08-02T00:22:11.273000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The miner doesn't know how full a block will be until after they have constructed the block.  A transaction early in the block that consumes a lot of gas may have a base fee that is low (barely includable) but then only after they fill the block do they realize that the first transaction's base fee was too low.  They would then have to remove that transaction and rebuild the whole block.",
        "created_at": "2021-08-02T01:54:43.523000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "However, upon rebuilding the block they may find that now the block is less full, and they make less money because of it.  This would cause them to toss that block and revert to the previous one.",
        "created_at": "2021-08-02T01:55:26.782000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The issue here is that it becomes very complex to build a block when the requirements of inclusion for earlier transactions in the block change as the block fills.",
        "created_at": "2021-08-02T01:56:10.817000+00:00",
        "attachments": null
    },
    {
        "author": "andi9314",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Isn't this something that miners deal with already? Even without a protocol fee and a fixed block size limit, maximizing the revenue from a block requires an algorithm that is more sophisticated than just using gas price to order the transactions because of what you said. It's not obvious to me that allowing miners to pay for extra space makes the algorithm much more complex.",
        "created_at": "2021-08-02T02:03:04.599000+00:00",
        "attachments": null
    },
    {
        "author": "andi9314",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If say the protocol fee is zero until the block size is above the target, then a lazy miner could just use his old algorithm, never pay any protocol fee, and not do any worse (if we ignore competition)",
        "created_at": "2021-08-02T02:05:07.370000+00:00",
        "attachments": null
    },
    {
        "author": "andi9314",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Just to clarify, miners would be free to include any transaction. It would just be suboptimal to include a transaction with a fee that is lower than the marginal increase in his tax from including that transaction.",
        "created_at": "2021-08-02T02:07:21.799000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yes the packing problem today is \"solved\" with the gas price ordering and greedily add until full. not optimal but maybe close enough in practice, as the demand curve flattens around the block size limit anyways. I also noted that applying a fee based on the current block would lead to packing issues as well in the thread you commented in (https://ethresear.ch/t/make-eip-1559-more-like-an-amm-curve/9082/2?u=barnabe) but my intuition too is that there is an approximately optimal solution that is efficiently computable, it's probably a little more involved than the current packing problem",
        "created_at": "2021-08-02T02:50:21.957000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The current situation is very simple to get \"close\".  What you are proposing is really complex in all but the absolute simplest/ideal of cases.",
        "created_at": "2021-08-02T03:36:54.905000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Oh, you are suggesting there is no burned base fee?",
        "created_at": "2021-08-02T03:37:24.656000+00:00",
        "attachments": null
    },
    {
        "author": "gwintery",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hi all, With London coming very close, has there been more effort to communicate regarding the doubling of the gas limit on mainnet to the miners?",
        "created_at": "2021-08-02T10:29:21.142000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!140789012276183040\u003e yes: the blog post says it explicitly and we've emailed any miner for whom we've got contact info.",
        "created_at": "2021-08-02T13:32:17.331000+00:00",
        "attachments": null
    },
    {
        "author": "gwintery",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks for that info Tim! Lets hope all goes well!",
        "created_at": "2021-08-02T14:18:23.662000+00:00",
        "attachments": null
    },
    {
        "author": "andi9314",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah, the only change from the current situation would be that miners can create larger blocks, and their block reward is decreasing in block size. For example, the reward could be constant at 2 ETH until 12.5M gas, and then drop linearly until it goes to 0 at 25M gas.\nSo it would be an extension of the packing problem where the miner can pay (by reducing his reward) to use additional block space. It will require a new solution for sure, but I agree with \u003c@!486501030046203915\u003e  that it doesn't seem intractable.",
        "created_at": "2021-08-02T14:55:41.775000+00:00",
        "attachments": null
    },
    {
        "author": "zsfelfoldi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I updated my feeHistory repo with a description of the fee oracle algorithm:\nhttps://github.com/zsfelfoldi/feehistory",
        "created_at": "2021-08-02T15:33:01.507000+00:00",
        "attachments": null
    }
]