[
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is a nice chart!",
        "created_at": "2021-05-28T00:45:53.445000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It’s very hard to convey that the rate of change is more important than the fee level. The chart above from perema conveyed a bit of that but i wonder if there’d be like a focused graphical way to illustrate this point clearly",
        "created_at": "2021-05-28T00:47:59.773000+00:00",
        "attachments": null
    },
    {
        "author": "perama",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The diagram could have two shadows over the purple mempool side - curves which represent the maximum and minimum possible basefee possible. \n\nThat is, if the fee changed every block in one direction (say lower) the shadow line curves down and to the right. You can see that after ten blocks the curve is at basefee X.\n\nLooking at the mempool tx's relative to that lower-bound curve, you could see the likelihood of that event, based on whether the tx's are above or below that line.\n\nThe converse example might be:\n- The upper bound curve is projected out ten blocks\n- The mempool tx's are above that curve for all those ten blocks\n- one can ascertain that the projection is accurate. \n- zooming out to 20 blocks, you can see that the tx's are below the curve at 18 blocks worth of tx's. \n- one can ascertain that this might be an estimate of when the basefee might stop rising\n- fast forward to that time (18 blocks in the future) the basefee is now at a new higher level\n- the mempool transactions are above the minimum curve, above the current basefee, but below the maximum curve\n- one can ascertain that the current basefee is stable at the new level for now",
        "created_at": "2021-05-28T02:12:48.093000+00:00",
        "attachments": null
    },
    {
        "author": "perama",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Imagine a small program that simulates the mechanics of this, where:\n\n- a user can press buttons to control the mempool\n- the diagram changes with each button press \n- blocks pass every 2 seconds\n- pressing \"2\" adds 100 txs at 20 gwei\n- pressing \"9\" \"9\" adds 200txs at 90 gwei\n- pressing \"shift+9\" adds 100txs at 900 gwei\n- if you stop pressing buttons you can quickly see and \"feel\" how the rate changes\n- if you mash the number pad and make a mega mempool, you can see how that manifests and tops out\n\nI'll have a think and might mock up a script to do this if I have some time",
        "created_at": "2021-05-28T02:22:04.065000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think i see what you mean by the shadow curves, the message would be \"for basefee to follow that curve, transactions need to keep appearing in the mempool that have a price above the curve\" (that would be for the \"upper bound\" curve). it might be an interesting direction!",
        "created_at": "2021-05-28T03:09:49.605000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "this sounds very sophisticated! an animation might be interesting (again with these upper/lower bound curves) but is user input required? it doesn't sound trivial to make too",
        "created_at": "2021-05-28T03:12:23.447000+00:00",
        "attachments": null
    },
    {
        "author": "perama",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "One way to find out",
        "created_at": "2021-05-28T03:28:57.202000+00:00",
        "attachments": null
    },
    {
        "author": "perama",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'll see how I go",
        "created_at": "2021-05-28T03:29:05.013000+00:00",
        "attachments": null
    },
    {
        "author": "perama",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "https://twitter.com/gakonst/status/1397855983796359171?s=19",
        "created_at": "2021-05-28T04:34:05.658000+00:00",
        "attachments": null
    },
    {
        "author": "perama",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "These two curves, fanning out from the circle in my diagram",
        "created_at": "2021-05-28T04:35:25.050000+00:00",
        "attachments": null
    },
    {
        "author": "sabnock",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I was curious what you guys thoughts on that thread were. Pleased to see you found it.",
        "created_at": "2021-05-28T18:36:46.935000+00:00",
        "attachments": null
    }
]