[
    {
        "author": "agusx1211",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Those things don't depend directly on the core dev team, but yes rollups are being worked on in parallel by other teams. By the way this is not the channel for raising those concerns, try \u003c#595721451651465227\u003e",
        "created_at": "2021-03-16T07:51:33.531000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ignoring the politics around 1559 and forgive the ignorance, but do we have an \"expected result\" post-1559 implementation RE the breakdown of the aggregate end-user fee into the base fee and tip?  Basically, assume we fast fowrard the video, what are we expecting the results will be for the end users? I get that miners will have much of their revenue reduced.. and ETH itself will see burning.. all neat... that said, do we have a forecast (based on current demand) what the fees (in aggregate and broken down) should look like? (or another way to ask the same, how much are folks over-paying today because the price alignment mismatch). thx..",
        "created_at": "2021-03-16T11:19:46.725000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Long term, what I envision is that miners all mostly set the same or similar minimum inclusion fee (like they used to do before we were persistently congested.  Wallets will monitor this and automatically set an inclusion fee that will result in landing in most blocks.  Wallets will then tell users \"this transaction will cost between X and Y\" where X is the base fee of next block and Y is some upper bound determined to be reasonable by the wallet by looking at historic congestion duration and projecting out worst case scenario.  Some wallets will have an advanced mode where you can limit the upper bound, and it will be capped by whatever ETH you have in your account.",
        "created_at": "2021-03-16T11:24:53.713000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As far as projected total cost to users, I don't expect it to change much at all.",
        "created_at": "2021-03-16T11:25:17.630000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "if I understand the implementation correctly ( so full disclaimer! ), the fees will escalate up in the short-term until an equilibrium is found that leave the blocks \"mostly full\" but also removing \"most of\" the bidding wars to get in a block..  I do believe in the hours after the implementation, that period will see expensive blocks (e.g. price discovery) followed by blocks that should be slighly cheaper than prior to 1559 implementation the primary difference pre- and post- being miner economics and also User Experience of what the costs are to actually be in a block..  more importantly for rollup transactions, they will have predictability to ensure they are in the upcoming block.",
        "created_at": "2021-03-16T12:00:06.700000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "the above said, I am specifically curious how much the \"bidding wars\" to get in a block are all mania that will get squeezed as that is pure economic dead weight loss",
        "created_at": "2021-03-16T12:00:27.076000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "At launch nothing will likely change because no one will be using the new format yet.  🙂",
        "created_at": "2021-03-16T12:03:14.977000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Adoption of the new transaction type will take time.",
        "created_at": "2021-03-16T12:03:38.120000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "but wont the base rate increase block after block based on % of block util?",
        "created_at": "2021-03-16T12:03:54.048000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah, the base fee will increase, but nothing should meaningfully change until wallets update.",
        "created_at": "2021-03-16T12:04:12.635000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Other than blocks will be half full.",
        "created_at": "2021-03-16T12:04:22.216000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But there will still be a lot of transactions in the pending pool, and people still frustrated by stuck transactions, and people still engaging in complicated bidding practices.",
        "created_at": "2021-03-16T12:04:43.870000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "will you please elaborate a bit on the blocks being half full?",
        "created_at": "2021-03-16T12:09:56.181000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The base_fee will increase until blocks are less than half full, then it will decrease until blocks are more than half full, and repeat that cycle forever.",
        "created_at": "2021-03-16T12:11:27.744000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "On average, blocks will be half full.",
        "created_at": "2021-03-16T12:11:35.807000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i get the feedback loop ... that said, if blocks are full today (with 12.5MM gas).... if there are economic forces that push the block space down to 50% of the above, how will that not cause users fees to be higher than today (on average long after the initial roll-out)? (and I write this as a 1559 advocate and proponent)..",
        "created_at": "2021-03-16T12:20:25.234000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "12.5M becomes the *target* gas used after 1559.  This means blocks can be as big as 25M but will average 12.5M.",
        "created_at": "2021-03-16T12:22:53.368000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "got it.. thank you.",
        "created_at": "2021-03-16T12:23:44.342000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "https://github.com/ethereum/EIPs/pull/3395",
        "created_at": "2021-03-16T14:11:04.217000+00:00",
        "attachments": null
    }
]