[
    {
        "author": "trent_vanepps",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hey \u003c@!486501030046203915\u003e - in Tim Roughgarden's clubhouse room he mentioned a possible area of 1559 research, so I reached out to clarify what he meant by \"transitionary regimes.\" \n\n\u003e I think you're referring to the question of how often the base fee will be what I call \"excessively low\" in the report --- that is, so low that even a double-full (25M gas) block is not big enough to hold all the transactions willing to the base fee\n\u003e \n\u003e Excessively low base fees occur when there is a sudden demand spike and the base fee hasn't had time to catch up yet. I would think this happens occasionally but not super-often --- say, in at most 1% of the blocks.\n\u003e \n\u003e So the experiment would be to use on-chain transaction data along with a simulation of 1559's base fee update rule to see, experimentally, how common excessively low base fees seem to be.\n\nDoes any of your past modeling touch on this?",
        "created_at": "2021-02-17T17:24:43.168000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hmm, I would say that exactly modelling history on what would've happened under EIP-1559 is very difficult. With that I mean that, by just looking at transactions in the current mempool or chain history, you don't know what component of the gas price would have been \"base fee\" or \"miner tip\" [0]. And you also have to assume something for when a tx arrived. If you do it the other way around , you get what \u003c@!486501030046203915\u003e  did in [1] (\"Generating the demand\").\n\nNow if you were only interested in roughly how often this congestion occurred (not how it progresses, or how much users are paying and miners are paid), maybe you can make some reasonable assumptions on those unknowns and still get a decent enough answer. Something like \"just assume the miner tip is always something minimal like 3 gwei\".\n\nSee also\n[0] https://discordapp.com/channels/595666850260713488/798586271445680129/804524592340533268\n[1] https://github.com/barnabemonnot/abm1559/blob/master/notebooks/transition1559.ipynb",
        "created_at": "2021-02-17T18:46:25.963000+00:00",
        "attachments": []
    }
]