[
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "making basefee less flexible also means you'll revert back to the first-price auction on the tip more often. i also wrote up some thoughts on wallet UX based on 1559 dynamics here, would be happy to know your thoughts: https://barnabe.substack.com/p/better-bidding-with-eip1559",
        "created_at": "2021-04-01T03:44:24.819000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "on this I noted: \"We could go behavioural economics on this and instead of having a fixed multiplier, have the multiplier follow a decreasing function of the basefee. If basefee is 1 Gwei, perhaps I don’t mind paying up to 10 Gwei, so 10x. If basefee is 100 Gwei, I probably am not willing to pay 1,000 Gwei, but 200 Gwei might be fine, so 2x.\" but there are certainly more advanced rules which trade off simplicity for more user control",
        "created_at": "2021-04-01T03:45:31.860000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "looking at very basic stats (\"gas ratio\": declared gas limit / actual gas used for instance) there is also a fairly significant uncertainty over how much gas transactions end up using. the mode of this gas ratio is 1: for simple payments we know it's 21,000 gas, the estimation is very precise. still almost 2/3rds of my dataset have gas ratio \u003e 1, and over 1/3rd has gas ratio \u003e 2. i think some wallets estimate the fee by taking some estimate of the gas used as reference, and not the gas limit. but still, if the price uncertainty is low compared to the gas uncertainty perhaps it compensates (e.g., matters less if the price is 10-20% more than quoted if in the end my transaction is 15-30% smaller than expected?)",
        "created_at": "2021-04-01T04:11:46.232000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is *only* true if you assume that people are setting the fee cap to the current base fee.  You should *almost never* do this.  It is a very bad strategy.",
        "created_at": "2021-04-01T11:43:58.598000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The only time you would set you fee cap to the base fee is if the fee cap just so happens to be *exactly* the max you are willing to pay.",
        "created_at": "2021-04-01T11:44:24.056000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This should occur almost never (given the ~10^9 order of magnitude of the numbers in use, this will basically never be true), so isn't really a problem I think we need to concern ourselves with.",
        "created_at": "2021-04-01T11:45:14.182000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If users are setting their fee cap to the current base fee, that suggests the wallets are not presenting users with the proper prompts because it just doesn't make sense as a fee setting strategy.",
        "created_at": "2021-04-01T11:45:48.628000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "we don't really have a good solution yet for the transition period. what our notebook showed (https://barnabemonnot.com/abm1559/notebooks/transition1559.html) is that as long as \"legacy\" (as in, non-1559) wallets keep following traditional oracles (based on historical data), there is a risk oracles will start quoting a price close to basefee as more and more users send 1559-transactions, where they pay basefee + 1 Gwei, which means legacy users will constantly be bidding a max fee close to basefee. if the wallet doesn't upgrade to anything and only reports the oracle as a \"black box\" function call, oracles should start relying on basefee, for instance adding a multiplier as discussed above. although it was always the plan that legacy users would get the short end of the stick, i am worried the short end will look more like \"bad inclusion guarantees\" rather than \"overpayment\"",
        "created_at": "2021-04-01T12:18:40.581000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Did we ever update the spec's starting `BASE FEE`? Is it still 1 gwei? I really think we should do ~100 gwei to minimize the number of 200% full blocks we start with right after the fork 😅",
        "created_at": "2021-04-01T13:12:07.404000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It is 1.  It'll reach 100 from there in like 10 minutes or something.",
        "created_at": "2021-04-01T16:01:26.462000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah, I think it would be better to not have those 10 minutes if possible. I see it as a potential risk, with not much upside, but happy to be convinced otherwise",
        "created_at": "2021-04-01T16:01:59.347000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Guessing the gas price 1-2 months before the merge is basically impossible.",
        "created_at": "2021-04-01T16:02:22.513000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We can choose between empty blocks and full blocks, there isn't a real option for \"just right\" blocks at launch.",
        "created_at": "2021-04-01T16:02:51.947000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In pretty much all scenarios we'll almost certainly be off by minutes.",
        "created_at": "2021-04-01T16:03:09.083000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Agreed, but I think we can be 2 orders of magnitude closer to what they will likely be",
        "created_at": "2021-04-01T16:42:56.222000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "the odds of them being 1 are ~0. The odds of them being ~100 are \u003e\u003e\u003e0 🙂",
        "created_at": "2021-04-01T16:43:17.299000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The odds of being 10 or 1000 are also lower than the odds of 100, IMO",
        "created_at": "2021-04-01T16:43:30.170000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "so I don't see why we wouldn't try to get at least the order of magnitude right, to minimize the number of 2x full blocks we get right after the fork block",
        "created_at": "2021-04-01T16:43:51.196000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "One argument (which may or may not be worth much) in favor of keeping it rather low, is that then most of the rewards go to the miners for the first few minutes (with old-style transactions). This somewhat smooths the transition, and may provide _some_ incentive to (at least initially) mine the new chain.\nOtherwise I would indeed say something like 10 - 100 gwei is a much better estimate if you look at the past few years. That already shaves quite a few minutes 2x blocks off.",
        "created_at": "2021-04-01T16:51:15.890000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah that’s fair. I don’t think there is a huge set of miners who would mine for 5 more minutes but not continue post 1559, but I may be wrong !",
        "created_at": "2021-04-01T16:53:08.676000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't think so either, but that's at least something that would be affected. I'm all in favor of bumping it up, and iirc the 1 gwei was chosen rather randomly as well (as an improvement over 1 wei that is)",
        "created_at": "2021-04-01T16:54:57.605000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If clients break with 25m gas blocks, at least they will break early 😄",
        "created_at": "2021-04-01T16:58:38.697000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "well, one thing to note is that the transaction pool will be \"artificially full\" pre-fork too",
        "created_at": "2021-04-01T17:33:43.710000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "not sure how that plays in the calculus 🤔",
        "created_at": "2021-04-01T17:33:51.013000+00:00",
        "attachments": []
    }
]