[
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "there are still some outstanding questions that I find underspecified in their proposal, would be great to discuss it! also added a reply to the thread: https://ethereum-magicians.org/t/eip-3416-median-gas-premium/5755/8\n\nto me it seems like the most critical issue will be showing that the mechanism doesn't induce consistent overpayment first. since it changes the bidding system, there may also be second-order effects that we don't fully understand as opposed to the current design, for which we have a fairly detailed understanding of, via Roughgarden's report or other works.",
        "created_at": "2021-04-05T03:04:51.403000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hi guys, nice to meet you! This EIP-3416 was introduced because we felt and saw in backtesting simulations that 1559 was not doing enough to reduce Premium Volatility as volatility was generated mainly by a few Gas Price outliers. Also @mtefagh added an improvement to help with Base Fee volatility, according to his simulations senders can send Base Fee to zero more easily without this improvement on Base Fee (additive rule vs old multiplicative rule).",
        "created_at": "2021-04-05T07:50:23.578000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We sent a few response on the forum, thanks!",
        "created_at": "2021-04-05T08:33:09.465000+00:00",
        "attachments": []
    },
    {
        "author": "terra854",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So tldr, EIP 3416 will make it harder for miners to send BASEFEE back to zero through empty blocks?",
        "created_at": "2021-04-05T10:18:42.500000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The primary goal (IMO) of 1559 isn't gas price volatility dampening, it is the ability for participants to \"bid their willingness to pay\" rather than having to try to participate in a first price auction.",
        "created_at": "2021-04-05T10:19:50.888000+00:00",
        "attachments": []
    },
    {
        "author": "terra854",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So that means instead of \"I'll pay x gwei to send this transaction fast\", it will be \"I'm willing to pay up to x gwei to speed up this transaction\"?",
        "created_at": "2021-04-05T10:26:59.731000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It means the user just says \"I'm willing to pay up to X to get this transaction included.\" once the first time and then never says anything again.",
        "created_at": "2021-04-05T10:38:09.196000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "They no longer have to specify a speed, they *only* specify a max price.",
        "created_at": "2021-04-05T10:38:37.537000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Almost everything will be \"fast\".",
        "created_at": "2021-04-05T10:39:01.331000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I agree that 1559 will not solve outlier volatility from the point-of-view and metrics of gas estimators and final users. If we can add these dampening features is a plus on top of 1559 minimum base gas price.",
        "created_at": "2021-04-05T10:55:17.371000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What is the reason for desiring gas price volatility dampening?",
        "created_at": "2021-04-05T10:55:52.544000+00:00",
        "attachments": []
    }
]