[
    {
        "author": "zsfelfoldi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I definitely see a few details more clearly now but I still think there might be an issue. The floaty duck analogy is really cool, but the problem is that the length of the rope is instantly revealed. Then it is not a second price auction which is kind of a single-step simulation of a multi-step auction with players who have a simple \"bid until fixed price cap\" strategy. But it strictly requires bids to be hidden until submissions are closed. Your rubber ducks have the length of the rope printed on them, advertising \"this is how high I can be pushed\". Mempool is transparent and everyone can make a projection of future blocks. Then it's obvious that offering slightly higher priority fees than the lazily floating duckies will save them a lot on base fee by getting into an earlier block during a congestion. Ducks will always end up on the expensive top of the waves. Then if they wake up and start slightly overbidding their competitors with priority fees then it's practically a dollar auction up until the max fee. That's ehy I think you should not reveal your true \"max fee\" until the very end. Just use a single price in the tx, do not even support revealing your last price. In real time a multi-step auction is a healthy thing, let everyone watch the mempool and rise the price in multiple steps.",
        "created_at": "2021-04-25T17:54:22.846000+00:00",
        "attachments": []
    },
    {
        "author": "zsfelfoldi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Still, i don't think it's a tragedy to have the two limits as an option in consensus, i just think the floaty duck with visible rope will not work very well. Maybe it's still the best option for some use cases though while others can do active bidding with a single fee.",
        "created_at": "2021-04-25T18:10:21.670000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The expectation is that it will be quite rare that there is a 2x spike in congestion.",
        "created_at": "2021-04-25T18:39:07.823000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If that is true, most people will just set the priority fee to minimum and be fine.",
        "created_at": "2021-04-25T18:40:19.620000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If this expectation isn't met then there may be bidding escalation.",
        "created_at": "2021-04-25T18:40:34.378000+00:00",
        "attachments": []
    },
    {
        "author": "zsfelfoldi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I am not sure how big the waves will be but i guess for many cases it's probably fine to end up on the top of the local wave. I am really curious about how this thing will play out though, it's a really interesting experiment.",
        "created_at": "2021-04-25T18:42:54.522000+00:00",
        "attachments": []
    },
    {
        "author": "zsfelfoldi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Btw another thing: this system might be prone to oscillation. Alternating 0 and 200 percent blocks might be a more stable mode of operation than having close to 100 percent blocks. Waiting one more blocks and saving a full adjustment step of base fees might be preferable to many people. Also not a tragedy, probably easy to fix if it happens.",
        "created_at": "2021-04-25T19:24:14.052000+00:00",
        "attachments": []
    },
    {
        "author": "zsfelfoldi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Averaging the gas usage of the last two blocks when adjusting the next block's base fee would probably dampen any high frequency oscillation modes caused by the one block feedback delay of the base fee control mechanism.",
        "created_at": "2021-04-25T19:54:50.391000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Seeing the length of the rope as you call it is not even the most important, if you have mempool observability you can just check the priority fees of whoever is in the pool and bid slightly above. But this is not required unless blocks are overfull (as in, \u003e 200% target), which as Micah pointed out should be rare enough. And even when it happens it’s not clear that consistently bidding a higher priority fee is necessary, you could also have a higher rate of congestion temporarily and get in later at the minimum priority fee possible (which is the miner opportunity cost)",
        "created_at": "2021-04-25T23:24:28.276000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We wrote a paper looking more closely at when is the basefee oscillating, i have a tweet thread here: https://twitter.com/barnabemonnot/status/1364096212517855236",
        "created_at": "2021-04-25T23:25:05.730000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is a possible “solution” (assuming oscillations are to be avoided) though the issue with it is that it makes basefee less responsive to changes in demand, and thus more prone to yield conditions where there is a race to be included and bidders needing to set higher priority fees. Vitalik suggested recently a design based on AMMs which may be smoother. At this point it’s probably a good idea to have these solutions mapped out and handy but wait for 1559 to be deployed and check how it fares with real inputs",
        "created_at": "2021-04-25T23:28:04.087000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Also i don’t think 1559 is a second price auction from the user perspective, though a user could set their willingness to pay as their max fee, but i don’t expect that to happen much. The closest auction format for 1559 imo is a perpetual english-dutch auction, where the standing bid either rises or falls to match supply and demand (or more like a true gas market then)",
        "created_at": "2021-04-25T23:31:23.892000+00:00",
        "attachments": []
    }
]