[
    {
        "author": "perama",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "One change in intuition that I am thinking about:\n\nTL;DR normal users won't do any price planning. They choose \"yes\" and once included, they get a \"fair price\".\n\nCurrently a user sets a low fee with the hope that they will pay less (works if the block demand lowers, otherwise not included)\n\nPost-london: \nA user can set a high (!) fee (maxFeePerGas) and can still expect to pay less if block demand lowers in the next block or two.\n\nThe refund changes the strategy: You don't select a price,  you select \"inclusion\" and are given the current going fair price based on demand. \n\nSo the geth gas price API returning a price 2x the current basefee (+priorityfee) is:\n\n\"I choose inclusion, but I'll pay the current fair rate, which is likely to be about half that number (half the API quoted number)\"\n\nRather that the current situation\n\"I choose to pay this high number because I need inclusion\" \n\nSo I'm feeling that part user story is going to be teaching someone to think:\n\"I want to be included, it's probably going to cost 'basefee' or thereabouts, but we will find out after inclusion.\" (Doesn't look at maxFeePerGas which is set to 2xbaseFeePerGas)\n\nOr \n\n\"I am doing some time critical tx here: I need inclusion and I can put the absolute max I am willing to spend as maxFeePerGas. I'll strategically set the priorityFee super high if I really need next block, otherwise a moderate tip will be good enough to get me in Fast TM\"",
        "created_at": "2021-06-04T04:25:30.343000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is exactly what I keep trying to tell people.  The paradigm is changing and UIs need to change to match.  You no longer bid, you just accept or walk away.",
        "created_at": "2021-06-04T04:28:46.228000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And tools should no longer do much of anything complex to \"suggest\" an appropriate number, you are instead just asserting to the user how much they'll pay.",
        "created_at": "2021-06-04T04:29:20.627000+00:00",
        "attachments": []
    },
    {
        "author": "perama",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "How about this an analogy for post London transactions:\n\nYou go to a vending machine and put in ten dollars without worrying that you've put in too much money.\n\nYou'll get a refund no matter what!\n\nYou get your transaction included and you get your change, DONE",
        "created_at": "2021-06-04T04:29:42.832000+00:00",
        "attachments": []
    },
    {
        "author": "perama",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The vending machine has a sign up the top: \n\"All snacks: ~about 6 dollars~\"\n\nYou have ten dollars: great, you can snack\n\nYou have only five dollars: come back later (don't put your five dollars in the machine - it won't do anything)",
        "created_at": "2021-06-04T04:33:23.299000+00:00",
        "attachments": []
    },
    {
        "author": "perama",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "When to come back:\n- when you're reeeeeeally hungry and have found another dollar to spend\n- check the sign periodically as you see fit (manually by going and checking, or with an app alert)",
        "created_at": "2021-06-04T04:36:12.093000+00:00",
        "attachments": []
    },
    {
        "author": "perama",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So a wallet interface might only need:\n\n==================\nYour Tx: 55k gas\n\nExpected cost: 0.001 ETH\n\n(worst case: 0.002 ETH)\n\n|||[Click to accept]|||\n\n\n----click for fine control---\n==================",
        "created_at": "2021-06-04T04:49:06.818000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I wouldn't even show gas used.  I would just show `Transaction Fee: 0.001 to 0.002 ETH`",
        "created_at": "2021-06-04T04:55:57.990000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That would be it.  User can either accept or not (unless they opt-in to a much more advanced interface that the vast majority of users shouldn't use).",
        "created_at": "2021-06-04T04:56:24.773000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Your vending machine analogy is great.  You trust that the vending machine will charge you going rate, and you know that the price of a snack is between $5 and $10.  You have $10 so you put in your $10 and you'll get back whatever change you get back.  If you only had $4 you would walk away.",
        "created_at": "2021-06-04T04:57:10.469000+00:00",
        "attachments": []
    },
    {
        "author": "perama",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(maybe gidget-gadget gets a new vending-machine interface)",
        "created_at": "2021-06-04T05:04:47.100000+00:00",
        "attachments": []
    },
    {
        "author": "zsfelfoldi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hey everyone, I wrote a short proposal for the 1559 gas price API:\nhttps://gist.github.com/zsfelfoldi/9ca596996f5a556c58dae3aa4f4d0049\nSorry for linking it into multiple places but it's kind of last minute before today's API call 🙂",
        "created_at": "2021-06-04T08:41:05.229000+00:00",
        "attachments": []
    },
    {
        "author": "peter.davies",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think the correct interface is:\n\n===========\nTransaction Fee 0.001 ETH\n\nSlippage: 2x \u003c--- Dropdown box\n\nTransaction fees may increase between now and when your transaction is accepted by the ethereum network. The maximum your transaction will pay is 0.002 Eth.\n\n------Accept------\n\n------Click here for Advanced settings-------\n===========",
        "created_at": "2021-06-04T10:57:04.118000+00:00",
        "attachments": []
    },
    {
        "author": "perama",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Love it",
        "created_at": "2021-06-04T10:57:41.561000+00:00",
        "attachments": []
    },
    {
        "author": "perama",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Is the rough idea that if your ``maxFeePerGas`` is too low, (1.2x basefee) and the network happens to drop your transaction, the wallet will kick in an take action because it will be looking for inclusion and will have the tx packet ready to go still. So it may do something like:\n\n- Monitor basefee and show the user that their fee is too low. The user can either:\n- Select a \"choose a higher fee\" and resubmit\n- Do nothing. The wallet will monitor the basefee and if it drops, resubmit the transaction. After some time period (?30 mins) that is too burdensome for the wallet infrastructure to continue this protocol, stop trying to resubmit.",
        "created_at": "2021-06-04T11:15:12.236000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't believe so.  That drop down is just asking the user how much they want to multiply next block base fee by when choosing the maxFeePerGas.",
        "created_at": "2021-06-04T11:21:38.135000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If next block base fee is 100, and you choose 2x, then your maxFeePerGas is 200.",
        "created_at": "2021-06-04T11:22:06.324000+00:00",
        "attachments": []
    },
    {
        "author": "perama",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I mean: If they choose a low multiplier and they don't get mined, what then. I accept that it's \"too bad\" from the network perspective, but the wallet software can do some work that could have a big impact. \n\nIf you sent a transaction with a 1.5x, and then went away from the computer for 30 minutes, there is a chance that: The basefee had risen quickly, you missed out, but the basefee dropped back down after 15 mins. Your transaction could have been rebroadcast by your wallet at t=16mins, so that when you returned, it had been mined at 16.5 mins.",
        "created_at": "2021-06-04T11:29:04.494000+00:00",
        "attachments": []
    },
    {
        "author": "perama",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That is, I wonder what infrastructure burden it would be for wallets to \"cache low transactions for 30 mins\"",
        "created_at": "2021-06-04T11:30:27.311000+00:00",
        "attachments": []
    },
    {
        "author": "peter.davies",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Handling transactions that didn't get included because their fee is to low is hard. The first line of defence is that eip-1559 creates a very high chance that your transaction just gets included and removes the need to play silly guessing games about what fees actually are.  If you are prepared to pay 100x the quoted transaction fee you can stick that in the box and don't run the risk of overpaying. Further lines of defence involving rebroadcasting transactions are needed, but their use is the exception.",
        "created_at": "2021-06-04T11:32:36.032000+00:00",
        "attachments": []
    },
    {
        "author": "peter.davies",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think in practice almost all users care more about getting their transaction included now, rather than waiting overnight to possibly get a lower fee.",
        "created_at": "2021-06-04T11:36:25.541000+00:00",
        "attachments": []
    },
    {
        "author": "perama",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I agree that the majority of user types are catered for. There exists the \"thrifty\" type, like in my last example, who may be pleased by some simple \"30 min grace period\" that allows them to utilise 1.5x slippage which, at one point during that window was reasonable. \n\nAnother scenario is that you know prices will wander, and that saving 30% on contract deployment could be a lot of money. If prices are high and you say \"no\" to the price, a wallet might offer a \"sleeping sniper\" mode (0.5x basefee). For 24 hours the wallet holds your transaction and if it becomes viable, broadcasts it to the network.\n\nI think that is a great user story (perhaps available in the 'advanced settings' tab), but it comes down to whether that is burdensome for a popular wallet to implement. What are the resource requirements to hold a 24hr database of (user, tx) pairs?",
        "created_at": "2021-06-04T11:46:59.740000+00:00",
        "attachments": []
    },
    {
        "author": "perama",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Perhaps I am wandering too far from the main vision again. If you really really want a cheap transaction, you can wake up and check the price in the night time and make your transaction then.",
        "created_at": "2021-06-04T11:50:21.419000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Afaik if your transaction is sweeping which i imagine most are then the rebate sits in your old adress in the form of dust which you cant use for anything. And demand is potentially unlimited squared, so users will have to play around with priority fees in the end i guess.\n\nThe solution seems to be to treat the base layer more casually. Design smart contracts and tokenized assets in such a way that inclusion on the base layer can always wait. Users and developers need to be \"trained\" into accepting that inclusion in bottom layer can take days/weeks/months.  That the base layer can operate like a sleek centralized service still seems like a pipe dream. But lets see.",
        "created_at": "2021-06-04T13:02:26.561000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Most transactions are not sweeping transactions.  Ethereum uses an account model, not a UTXO model, so sweeps are relatively uncommon.",
        "created_at": "2021-06-04T13:50:32.569000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There has been talk in the past about a \"sweep\" transaction to deal with this.",
        "created_at": "2021-06-04T13:51:01.782000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Another option is to set the `maxFeePerGas = maxPremiumPerGas`.",
        "created_at": "2021-06-04T13:51:36.009000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Can someone send me a link to the call?",
        "created_at": "2021-06-04T13:57:52.894000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Slight tangent, but Trezor doesn't have the resources to add 1559 support. If anyone has the skills to do this and would like to get paid to do so, please ping me 🙂 https://github.com/trezor/trezor-firmware/issues/1604#issuecomment-854715930",
        "created_at": "2021-06-04T13:58:09.760000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Gas API call link: https://ethereumfoundation.zoom.us/j/94188612255?pwd=amlxc2VzeGFaWWFYb3RCSjk1MEJ6UT09",
        "created_at": "2021-06-04T13:58:38.779000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Very high-level overview of the 1559 API wishlist, please add more 😄 https://hackmd.io/@timbeiko/1559-api-wishlist\n\ncc: \u003c@!301186049323958275\u003e \u003c@!322222239850168331\u003e \u003c@!358385024573243393\u003e",
        "created_at": "2021-06-04T16:37:17.827000+00:00",
        "attachments": []
    },
    {
        "author": "zsfelfoldi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I have a slightly related thought: maybe it's not realistic to put this in the current fork but it would be awesome to add the first decile miner reward to the headers. That would make GPOs a LOT more light client friendly :)",
        "created_at": "2021-06-04T16:46:59.116000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Couldn't miners manipulate that 😅 ?",
        "created_at": "2021-06-04T16:47:24.064000+00:00",
        "attachments": []
    },
    {
        "author": "zsfelfoldi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Not if it's consensus, hopefully :)",
        "created_at": "2021-06-04T16:48:30.594000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It would be *super* useful if miners actively advertised what their min priority fee was for each block.",
        "created_at": "2021-06-04T17:31:27.375000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Too late now, but we *could* add it to the block header I think.",
        "created_at": "2021-06-04T17:31:49.569000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hmm, actually I think it would come with too many problems.",
        "created_at": "2021-06-04T17:32:04.129000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If we have no validation at all, then miners would set it to a big number to trick clients into running with a high priority fee.  If we disallow any transaction inclusion below the provided number, then they have to set it to 0 when they are accepting side channel payments.",
        "created_at": "2021-06-04T17:32:55.471000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Looks like you covered most of it.  I added some notes and details.",
        "created_at": "2021-06-04T17:43:39.182000+00:00",
        "attachments": []
    },
    {
        "author": "zsfelfoldi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah this is why i still think we do need the actual paid fees as \"reality data points\" too. I mean i do agree with you about the basefee change/block fullness being a super important indicator. But how could you validate the miner's own minimum setting? And if you can't then as you said it will be instantly gamed. You can only see the smallest included txs and still a few of those could be their own creations so i'd say some low percentile data point is the most informative.",
        "created_at": "2021-06-04T17:47:09.007000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah, I'm torn on percentile vs minimum.",
        "created_at": "2021-06-04T17:48:36.040000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "10th percentile (or around that) is *probably* the right choice.",
        "created_at": "2021-06-04T17:48:47.183000+00:00",
        "attachments": []
    },
    {
        "author": "zsfelfoldi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Probably there always will be some low tip txs around so miners could always fill up the blocks if they wanted to. Not doing so is an honest signal. You want to be paid more but in order to signal this you are willing to not earn the lower tips.",
        "created_at": "2021-06-04T17:52:15.061000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I guess the best thing we can do for making this data good is to make it easy for *some* people (semi-advanced users) to lowball the priority fee so we always have some transactions that are included by a small percentage of miners, so we always have some transactions sitting in the pending pool at low priority fees.",
        "created_at": "2021-06-04T17:53:42.130000+00:00",
        "attachments": []
    },
    {
        "author": "zsfelfoldi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think advanced users with a full node (tx pool, pending state) can do active bidding with tip=feecap txs. From a game theory perspective it's not optimal to reveal your final limit right away. 1559 txs are probably nice for easy manual use but they will always pay more whenever there's a mini-congestion because active bidders can just outbid them with the tip and get into the earlier block with much smaller basefee. That's worth way more than saving a little on the tip.\nStill, 1559 \"floating\" txs are probably a better option for normal users than excessive gas prices. But since there will be some bidding wars there will be a few feecap limited transactions too that can even unintentionally \"lowball\" with the effective miner reward because its feecap is only slightly over the current basefee.",
        "created_at": "2021-06-04T18:19:10.108000+00:00",
        "attachments": []
    },
    {
        "author": "zsfelfoldi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So those can be valuable data points too.",
        "created_at": "2021-06-04T18:21:17.709000+00:00",
        "attachments": []
    },
    {
        "author": "zsfelfoldi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Though maybe 10th percentile is too much then. We'll see.",
        "created_at": "2021-06-04T18:22:13.270000+00:00",
        "attachments": []
    }
]