[
    {
        "author": "junaid5784",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Is there any upper cap on baseFeePerGas , wts the maximum that protocol can reach?",
        "created_at": "2021-09-20T09:33:43.643000+00:00",
        "attachments": []
    },
    {
        "author": "junaid5784",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Normally this is how it functions: \"base fee per gas can move up or down each block according to a formula which is a function of gas used in parent block and gas target (block gas limit divided by elasticity multiplier) of parent block. The algorithm results in the base fee per gas increasing when blocks are above the gas target, and decreasing when blocks are below the gas target.\"\n\nso if blocks are above gas target will algo keep on increasing base fee per gas, or is there any upper cap?",
        "created_at": "2021-09-20T09:43:46.780000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "no upper cap, but it cannot increase forever, at some point it'd delete the whole supply. so economically, there is a bound, though we can't really tell where (technically, the bound is probably whatever the largest integer balance can be)",
        "created_at": "2021-09-20T10:44:52.678000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The simplest bound is whatever the largest single account balance is at any given moment in time.  Technically it can't actually reach that there is unlikely to be an account immediately below that value that has exactly 12.5% less.  One could probably do some crawling of account balances to figure out what the last 12.5% jump between account balances is before we start seeing gaps in nearest account balances that are less than that and then find an optimal sort that would allow 12.5% jumps, but this would be purely an academic exercise and have no meaningful value.",
        "created_at": "2021-09-20T11:27:52.122000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "To put it more bluntly, last time I checked it would take ~175 blocks to have burnt all the ETH supply",
        "created_at": "2021-09-20T16:33:11.200000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "https://docs.google.com/spreadsheets/d/1hLuXSZ9jsQaWqI502MtuEL7K93oZAaBYaSx61aqwUX8/edit?usp=sharing",
        "created_at": "2021-09-20T16:33:49.638000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Also, as per Etherscan (https://etherscan.io/accounts), the largest single account is Binance (after Eth2 deposit contract and WETH). Assume they have 10x that total balance, it means they'd have ~25m ETH, which would be burnt in 160ish blocks",
        "created_at": "2021-09-20T16:35:40.494000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Worth noting that due to the exponential nature, the last blocks of burn are incredibly expensive (e.g. you go from 0 to  ~25m in 150 blocks but ~25m to ~115m in 20).",
        "created_at": "2021-09-20T16:37:02.718000+00:00",
        "attachments": []
    }
]