[
    {
        "author": "zsfelfoldi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hi everyone! Recently I've been thinking a bit about the possible transaction pool strategies for eip1559. Maybe I'm missing something important here but I'm starting to have a feeling that allowing transactions to specify a max priority fee is just an unnecessary added complexity. My assumption here is that the main limiting factor is usually the base fee so miners will usually discard those transactions where the offered priority fee does not cover the marginal cost of execution, then sort the rest by total fee offered and try to assemble a block from those transactions where the total fee offered minus base fee of current block is still enough to cover execution costs (but still keep/propagate a limited amount of lower total fee txs because they might become viable in a future block with lower base fee). From the tx sender's perspective it's also mostly about the base fee. The sender will check the current base fee and offer slightly more or slightly less total fee, depending on the urgency. Does the sender really want to separately limit the priority fee? If the transaction can get into the next block then the sender has total control over the extra miner reward paid, otherwise the tx waits until the base fee is low enough for the remaining miner reward to be high enough.",
        "created_at": "2021-04-24T11:53:58.426000+00:00",
        "attachments": []
    },
    {
        "author": "zsfelfoldi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As a wallet designer I wouldn't burden users with these two fees. As a transaction pool implementer I see it as a potential problem. It is currently a very good property that transactions can be unambiguously ordered and the best ones propagated. Now with 1559 I guess we should primarily order by total fee offered, but then what do we do with those where the priority fee offered is just barely sufficient/slightly low? If each client has its own threshold then these transactions just won't propagate and it's hard to predict how much priority fee offered is enough for good propagation, therefore users will overestimate it anyway and the whole thing is useless. Maybe everyone will just always set priority fee limit equal to total fee limit. Still, if it's possible to set a lower limit for miner reward then we have to handle this case everywhere. It's going to be a bunch of corner cases that are not even tested in practice very well because they are usually not used. Or is there some smart tx pool priority scheme design somewhere that I'm not aware of?",
        "created_at": "2021-04-24T11:54:04.980000+00:00",
        "attachments": []
    },
    {
        "author": "zsfelfoldi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Shouldn't we just limit the total fee in the tx and give the miner whatever remains after burning the base fee? The tx ordering by priority fee could work just the same, it's just that the ordering is always obvious and does not depend on the current block base fee. While with two fee limits specified the ordering will change depending on which of the two parameters is currently actually limiting the miner reward.\nIf I'm missing something or this has already been discussed earlier then please point me to some written material 🙂 If I'm not then I think we should seriously consider the single limit option. It's definitely a step forward compared to the current situation without much of the complexity (tx pool design and propagation properties largely unaffected, it's just a change of consensus rules and maybe tx ordering). And we can still add the priority fee limit option later if it seems to make sense.",
        "created_at": "2021-04-24T11:54:13.244000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "hi \u003c@!202397237962211328\u003e ! on fees of 1559 i wrote this: https://barnabe.substack.com/p/understanding-fees-in-eip1559, on the UX/wallet design perspective this: https://barnabe.substack.com/p/better-bidding-with-eip1559\nthe tldr is that users can safely bid the miner opportunity cost most of the time, and the wallets can take advantage of this fact, so it's not a bad thing to have the two fees (even the maxfee can be somewhat made to a default with a good wallet UX)\n\ntransaction pool ordering was discussed quite a lot, the reference would be \u003c@!415548822983278593\u003e posts (https://hackmd.io/@adietrichs/1559-transaction-sorting and https://hackmd.io/@adietrichs/1559-transaction-sorting-part2) showing that the varying basefee doesn't add so much complexity to ordering, and so at this point it seems pools are fine as they are, though as you mention it would be possible to have a smarter pool design that evicts based on the declared fees and the current conditions. not sure where the implementation is and what was decided with respect to that\n\nthe issue with removing priority or limiting the total fee is that it is then incentivising users to deal off-chain with miners and offer them a priority fee, it's covered in tim roughgarden's paper on eip1559: http://timroughgarden.org/papers/eip1559.pdf",
        "created_at": "2021-04-24T12:06:11.395000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "note also that the sender never specifies the \"total fee\" they pay, which is a fundamental difference with the current paradigm. users send how much more than basefee they are willing to pay (that's the priority fee/inclusion fee) and the maximum they are willing to pay (max fee). this is what i call the \"duck float\" bidding strategy in one of the links above: your bid floats with basefee",
        "created_at": "2021-04-24T12:08:55.234000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e it's hard to predict how much priority fee offered is enough for good propagation\nI suspect most (maybe all) miners will just hard-code a min-fee and include anything above that.  This means that pretty quickly we will know what min fee is required by miners and that that can then determine what wallets set (no need for user input).",
        "created_at": "2021-04-24T12:17:03.975000+00:00",
        "attachments": []
    },
    {
        "author": "zsfelfoldi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks, will read your links tomorrow",
        "created_at": "2021-04-24T13:42:08.623000+00:00",
        "attachments": []
    }
]