[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@486501030046203915\u003e What are your thoughts on the current `1/8` change per block?  It *feels* like there is more volatility than desirable at the moment, and I wonder if slowing the rate of change would help smooth that out.",
        "created_at": "2021-11-13T07:36:45.509000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I should have shared here before but we recently released a paper on the 1559 update rule: https://arxiv.org/abs/2110.04753\n\ngenerally our conclusion is that 1/8 does a slower than desired ramp up during market events and indeed more volatility than desirable during market stability. we suggest an adaptive learning rate that navigates this trade-off better. atm we are trying to validate this update rule against other options with historical data (there is a bit of that already in the paper but we have a better methodology now)\n\nso my thoughts is rather than tweaking the parameter only, i'd rather see a more comprehensive update to the update rule. maybe that could be part of a package of upgrades that includes \u003c@!415548822983278593\u003e 's time-aware basefee rule too",
        "created_at": "2021-11-13T09:27:54.222000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "At this rate  2,800,000 ETH is being burned per year- but post merge it seems that only 420k ETH will be created per year. So it will take about 40 years to burn all the eth.",
        "created_at": "2021-11-13T14:10:06.193000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Is it possible to cap fee burning so it will only ever cancel out the amount of new that is created and it never goes negative?",
        "created_at": "2021-11-13T14:12:03.876000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Why bother, it'll find an equilibrium",
        "created_at": "2021-11-13T14:12:14.381000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i dont see how",
        "created_at": "2021-11-13T14:12:32.371000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Really?",
        "created_at": "2021-11-13T14:12:55.805000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yes 🙂",
        "created_at": "2021-11-13T14:13:03.192000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm not particularly in the mood to explain how the basic economics of commodities work, but maybe someone else can give it a go",
        "created_at": "2021-11-13T14:14:40.800000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Fees will decrease as supply decreases.  Imagine the extreme scenario where there is only 1 ETH left in circulation.  In this scenario, you can be quite certain that *no one* will be willing to pay a 0.1 ETH transaction fee.  My guess is people would only be willing to pay around 0.0000000001 ETH transaction fees or so.",
        "created_at": "2021-11-13T19:17:35.978000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "because of the fee burning i actually think BTC will play a big role in Ethereums ecosystem because its a stabler asset and doesent rely on any underlying securities etc. But i could be wrong",
        "created_at": "2021-11-13T19:24:22.166000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It's kind of hard to argue against you when you make vague and goal-post-moving-ish replies. It also feels a bit low effort for a server like this. \n\n\u003e because its a stabler asset\nRandom statement, in what sense? (Don't answer that, this is \u003c#692078615269212180\u003e after all)\n\n\u003e rely on any underlying securities\n100% not true, but so vague it's impossible to respond.\n\nEither way you might want to read up on other ways of handling fees, including the shortcomings of first-price auctions, transaction-fee dominated chains, and I guess also basic economics of supply and demand of commodities (induced demand, elastic, inelastic).",
        "created_at": "2021-11-13T19:32:55.424000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks for your suggestions but i have a good grasp on those concepts 🙂 And regarding the first price auctions i dont think you have fixed those shortcomings with EIP1559, i think the algorithm that picks the basefee will be an area of contention forever, it will never be better than free floating price or \"first price auction\" as u call it 🙂 Then there is the issue of fee burning, which if after the merge you end up having a few years of 3 million ETH burned, then that will become an area of conention too i believe, and in worst case scenario you may end up having to remove fee burning as a whole which at that point would have become a core part of ETH value proposition and it would be disaster. BUT who knows. (its why i believe BTC will be a stabler asset because its supply is set in stone. So the best that can happen to ETH is if the supply schedule is figured out asap and then just let it run without ever touching it again and let the market get adjusted to it. But i dont think thats gonna happen sadly)",
        "created_at": "2021-11-13T19:40:49.566000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is a very old argument.  This issue with Bitcoin is that it runs out of funds to pay for block security, relying on transaction fees to take up the strain.  This is a complete unknown in the years to come, so long-term security of the chain cannot be guaranteed.  By issuing new Ether the chain provides a much stronger guarantee of security ad infinitum, and with burning there is a balancing force to reduce total supply.\n\nIt's always possible that Ether total supply ends up decreasing rapidly, but there is no immediate harm in that and can be addressed over a much longer timescale (_i.e._ years) if desired.  A fixed schedule, however, is not the way to go as we end up with the same problem as Bitcoin.\n\n(And yes this isn't really the place to talk about this so I'll shut up.)",
        "created_at": "2021-11-13T19:45:43.776000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "No fees to pay for security but enough fees to burn reduce the total supply?",
        "created_at": "2021-11-13T19:54:36.386000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "time will tell",
        "created_at": "2021-11-13T19:54:59.107000+00:00",
        "attachments": []
    }
]