[
    {
        "author": "archeryarcheryarcheryarcheryarch",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it's accurate related to pre-1559, which did see major gas spikes related to the NFT explosion in popularity; however the fee market did pull down with similar volatility, specially during weekends and odd hours; problem for my argument is that I did not have the gasnow histograms saved, I'll try to pull them from wayback machine/ internet archives",
        "created_at": "2022-01-14T05:09:21.214000+00:00",
        "attachments": []
    },
    {
        "author": "killari.",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "you should pull those directly from chain so they can be repeated as well",
        "created_at": "2022-01-14T09:42:46.002000+00:00",
        "attachments": []
    },
    {
        "author": "ejwallach",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My impression is that the burn will continue in the same fashion after transition to PoS. At current rates, that could mean annual deflation of 1-4%, which seems reasonable. Is there some point at which Ethereum would become “too deflationary”?",
        "created_at": "2022-01-14T14:07:24.265000+00:00",
        "attachments": []
    },
    {
        "author": "killari.",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Wonder what would be such point? One point would be that 16 decimals would not be enough anymore",
        "created_at": "2022-01-14T15:00:07.531000+00:00",
        "attachments": []
    },
    {
        "author": "kommstar",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think if the price of Eth dropped and made it cheaper (relative to other assets) to transact on the network then the deflation would speed up since we would burn more basefee. Eventually the coinbase will run out of sellers at cheap Eth prices and the price would rise, impacting how much people are willing to spend on transaction fees, slowing down deflation.",
        "created_at": "2022-01-14T15:22:58.494000+00:00",
        "attachments": []
    },
    {
        "author": "archeryarcheryarcheryarcheryarch",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'll try pulling them from erigon and make a chart",
        "created_at": "2022-01-14T20:01:10.851000+00:00",
        "attachments": []
    }
]