[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It intersects at the average block size, which we can trivially calculate.  For a linear formula we have now,  it is the target gas limit that matters for long-term growth (since you can have half the blocks full and half empty (the extreme scenario) and still average out to the target.  Depending on what the new algorithm is that incorporates 3x, that may change.",
        "created_at": "2022-01-18T05:47:27.558000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "economic forces bring block sizes back to target, so if you set target to 18m that's what you will get on average, even with the greater slack. there is not really a \"splitting\" effect because basefee increases faster so more are priced out",
        "created_at": "2022-01-18T09:19:19.678000+00:00",
        "attachments": null
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think tim's point with \"splitting\" was whether or not the damage caused by blocksize was superlinear: how large a target increase must be for the increased load to be equivalent to higher burstiness. (not sure if this interpretation is correct)",
        "created_at": "2022-01-18T11:27:36.146000+00:00",
        "attachments": null
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In concrete terms, whether it is equally burdensome (with the current state of the network + current priorities) to have targets of 15M + limits of 45M, or targets of 18M + limits of 36M.",
        "created_at": "2022-01-18T11:30:19.526000+00:00",
        "attachments": null
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I believe that for small-medium blocksizes (sub-BCH), the relationship between blocksize and uncle rates is approximately linear (there is a minimum latency to propagate empty blocks). So higher targets + lower limits might produce fewer uncles than lower targets + higher limits.",
        "created_at": "2022-01-18T11:41:52.384000+00:00",
        "attachments": null
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "However it is plausible that the largest blocks (with the highest natural uncle rate) will have enough MEV to make reorgs worthwhile, which might lead to a non-linear uncle rate for blocks at the gas limit. This UX decline (from chain instability / lower finality) might outweigh the UX from better auctions.",
        "created_at": "2022-01-18T11:45:32.235000+00:00",
        "attachments": null
    }
]