[
    {
        "author": "alexo314",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "hi everyone! \n\none of the reasons we explored mev smoothing ~1.5yrs ago was because it would reduce risks of time-bandit attacks. We didn’t have a promising mechanism and also saw resistance from our community to implement a stepping stone to smoothing (bc it would make them consume more gas.) so left it from implementation and kept researching it.\n\nNow thinking of smoothing in the context of PoS since it’s a topic reignited as of late + is a missing puzzle piece to mitigate the effect of MEV extraction (beyond time bandit attacks it’s also to mitigate against _potential_ uneven distribution of rewards stemming from uneven distribution of MEV).  iirc we might see more frequent shallow reorgs but very difficult to do deep reorgs in PoS. If this is true (plz correct me if I’m wrong), then this might inform how “long” does the smoothing have to be to mitigate MEV-motivated short range reorgs?\n\n\u003c@520034910149410861\u003e \u003c@466048602326695938\u003e \u003c@602753420033785856\u003e",
        "created_at": "2022-07-18T08:58:37.306000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The problem I have with pretty much every MEV smoothing plan is that it is premised on the assumption that MEV can be reliably/algorithmically identified in a way that isn't gameable.  I don't believe this to be true, which is why I have opposed basically every MEV smoothing suggestion.",
        "created_at": "2022-07-18T09:07:49.603000+00:00",
        "attachments": []
    },
    {
        "author": "alexo314",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "you’re not the only one 😉 some people internally believe you can prove impossibility of “perfect” smoothing if you assume you will never be able to kill sidechannels",
        "created_at": "2022-07-18T09:08:50.721000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The only solution I know of that *might* mitigate the problem is if you have a commit-reveal scheme (or commit-VDF-reveal scheme), but that delays everyone's transaction by quite a bit, increases operational cost significantly.  In the VDF case, this introduces a huge amount of complexity and the time between commit and execution would likely need to be very long.  In the case of commit reveal, a user who didn't show back up to reveal at the right time would have to pay for the commit still but their transaction wouldn't show up.",
        "created_at": "2022-07-18T09:12:23.618000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Even with commit-reveal schemes, they can *still* be gamed to some extent because an MEV extractor can just commit a bunch of transactions and then only reveal the ones that are profitable (certainly harder to extract value this way, but still possible, and a shared VDF solves this).",
        "created_at": "2022-07-18T09:14:12.651000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "this also moves the available MEV to the post-state after things were revealed, e.g., a bunch of trades are committed then revealed, now there is a bunch of arbitrage available. you could send committed transactions trying to extract that arbitrage, not sure what the ordering rule would be in that case, but arb value/MEV can still be extracted either via ~PGA or stat arbitrage",
        "created_at": "2022-07-18T09:29:42.135000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah, good point.  Commit-reveal *only* protects against front-running MEV.  Back running wouldn't be impacted.",
        "created_at": "2022-07-18T09:37:24.551000+00:00",
        "attachments": []
    }
]