[
    {
        "author": "pmcgoohan",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It's an estimate of the delay between the final deadline for a builder submitting a block (having seen an arb between L1 and a market outside Ethereum) and receiving confirmation that it will definitely be included in the next slot (the point at which they can hedge the other side of the arb). I'm open to more accurate estimates. From what I can see the gap between these two events looks quite significant https://ethresear.ch/t/two-slot-proposer-builder-separation/10980",
        "created_at": "2022-08-20T16:12:38.960000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "right, but the question is, can anyone do better? it's basically a race to provide the best bid by the deadline, where the bid commits you to a block. if you find the arb at t = 3, the deadline is t = 4, and you know by t = 8 if you won or not, no one can exploit the delta between t = 4 and t = 8 to make a better block.\n\nbut i see the concern. there is a version of PBS where the builders don't commit to specific block contents but bid for the right to make a block. that way, the builder can take on the risk to make the block \"just-in-time\", before their own deadline (basically, before the committees of their slot votes) rather than before the proposer commitment deadline",
        "created_at": "2022-08-20T17:19:15.894000+00:00",
        "attachments": []
    },
    {
        "author": "pmcgoohan",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The proposer can submit their own block though right? (ie: bypassing the PBS best bid selection completely)",
        "created_at": "2022-08-20T17:28:48.456000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yes but even then they need to commit to the block hash before the deadline, so they don't have an advantage",
        "created_at": "2022-08-20T18:54:00.108000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think I heard that *some* clients right now will not compare a local block against an MEV-Boost provided block.  I also wonder if they will fallback if MEV-Boost provides no block.  🤔",
        "created_at": "2022-08-20T18:54:12.168000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "what i mean is in the two slot pbs, the proposer has the \"first slot\", the only latency gain they can win vs other builders is the network latency, i.e., the time it takes for a builder to send them a new bid",
        "created_at": "2022-08-20T18:55:39.023000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i think \u003c@416350333372071954\u003e is talking about in-protocol PBS here. there is no relay then, the builder commits to a bid and a binding payment in case they don't reveal the block",
        "created_at": "2022-08-20T18:56:25.041000+00:00",
        "attachments": []
    }
]