[
    {
        "author": "ripostex",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Have you guys seen this? https://twitter.com/MevRefund/status/1573416023998578703",
        "created_at": "2022-09-24T11:03:12.286000+00:00",
        "attachments": []
    },
    {
        "author": "ripostex",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Seems a little concerning that someone would only need to spend a few hundred Eth per day to throttle the network",
        "created_at": "2022-09-24T11:04:32.527000+00:00",
        "attachments": []
    },
    {
        "author": "endorphin0",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This worked because validators didn't have a better block at that moment, working as expected right?",
        "created_at": "2022-09-24T11:21:26.198000+00:00",
        "attachments": []
    },
    {
        "author": "endorphin0",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If it was sustained, eip1559 would make it too expensive at one point iiuc (I'm no expert)",
        "created_at": "2022-09-24T11:22:16.851000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "216 ETH / day is the *minimum* it would cost to maintain this sort of shutdown.  However, people could increase their fee premium to raise that cost very significantly if it was sustained.",
        "created_at": "2022-09-24T11:22:50.974000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Once you started the attack, the base fee would quickly drop, and people would would switch over to what is functionally a gas price auction.  At that point that 216 ETH / day quickly turns into 2160 ETH per day (assuming base fee would otherwise be ~10 nanoeth / gas), and likely ramps up more and more over time as people are willing to pay more and more to get included.",
        "created_at": "2022-09-24T11:24:17.507000+00:00",
        "attachments": []
    },
    {
        "author": "ripostex",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Would they though? Sure a small number of users will set manually, but most would just use whatever Metamask suggests. Since most of the txs will be the 0 tip attackers, presumably Metamask wouldn't know to raise fees ...",
        "created_at": "2022-09-24T12:12:17.374000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I have seen metamask raise the premium before.  I don't know what triggers it.",
        "created_at": "2022-09-24T12:13:30.649000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm assuming they do it if they see more than 30M gas in pending transactions with a high enough base fee for inclusion?",
        "created_at": "2022-09-24T12:14:06.730000+00:00",
        "attachments": []
    },
    {
        "author": "ripostex",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Would've thought some kind of running avg",
        "created_at": "2022-09-24T12:16:18.906000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Metamask also has a \"speed up transaction\" button which increases the tip, so as users became bored waiting for their transaction to hit the chain they would hit the button and push up the cost.",
        "created_at": "2022-09-24T12:16:32.124000+00:00",
        "attachments": []
    },
    {
        "author": "ripostex",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah, agree chain won't really be shut down. Only real motive I can think of would be a massive Eth short, and hope an attack for a few days makes the news. Pretty risky",
        "created_at": "2022-09-24T12:18:38.687000+00:00",
        "attachments": []
    },
    {
        "author": "randomishwalk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Seems like existing fee markets would address this? But yeah to Micah's point, most users default to Metamask \u0026 their settings and I'm not sure how gas price estimation works specifically for that wallet",
        "created_at": "2022-09-24T12:22:00.763000+00:00",
        "attachments": []
    },
    {
        "author": "randomishwalk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We probably have someone from the MetaMask engineering team in here who could answer this…",
        "created_at": "2022-09-24T13:33:49.641000+00:00",
        "attachments": []
    },
    {
        "author": "slodkokwasny.",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So someone could start submitting empty blocks for 0.05 ETH to MEV relays and keep throttling the network for $70 a block (basically bribing validators), and the only countermeasure is for the users to increase their priority fees. Seems dangerous but maybe it's not really... the cost for throttling is equal to the average priority fees in a block right now, and since we're in a bear market, it's quite low at 0.05 ETH. If activity were to pick up again, it would get a little bit more expensive.",
        "created_at": "2022-09-24T18:15:09.172000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The bribe has to be higher than the sum of all tips that would be made by the proposer if they included the waiting transactions in the block.  That value will increase over time three ways: i) the base fee will drop so type 0 transactions will have a higher tip, ii) users will increase their tips because they want their transactions to go through, and iii) there will be more transactions in the pending pool so more higher-value transactions from which block builders can include in the block.  I don't see it being a particularly viable strategy for anything other than short-term amusement.\n\n(It also requires all proposers to be listening for relayed blocks rather than building their own, which is by no means the case today.)",
        "created_at": "2022-09-24T18:34:10.476000+00:00",
        "attachments": []
    }
]