[
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Could we introduce a way to \"burn gas\" to allow the consumption of blockspace without burdening nodes?\n\nPotentially quite a silly idea^",
        "created_at": "2022-11-02T07:33:08.294000+00:00",
        "attachments": null
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The rationale is that if someone (without any validators) wants to exclude users from using the chain, they can just consume gas at market prices.\n\nIf they want to attack the chain, they might try to burden validators through spamming underpriced activity.\n\n\"gas flares\" would allow excluding users to be more efficient to attackers, however it wouldn't summon any negative externalities on state or full nodes.\n\nFor any other tx that sneak into the block, there wouldn't be e.g. any competing state accesses, so blocks would be quite quick to process. In effect it'd allow (in-protocol) subsidy for producing blocks lower than the current (validator chosen) gas limit.\n\nUnless gas burning cost less than BASEFEE, I don't think attackers would use it in reality. It'd also allow someone with plenty of validators to harm users without burdening themselves (the attacker would see reduced CapEx from hardware, however currently Ether requirements dominate costs).\n\nIf burnt gas cost less than BASEFEE it might be an effective path for tipfee manipulation. Large validator sets can still manipulate basefees through gas limit voting + lucky streaks.",
        "created_at": "2022-11-02T07:50:13.335000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This already exists in the form of calling an invalid opcode, which consumes all remaining transaction gas.",
        "created_at": "2022-11-02T08:16:36.117000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So you just set the gas limit for your transaction to be the gas remaining in the block and then you call into a contract that just hits an invalid opcode and does nothing else.",
        "created_at": "2022-11-02T08:16:57.815000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There is a small amount of overhead for the call, but it is around 25000 gas or something in terms of operational cost, yet you can burn up to 30M.",
        "created_at": "2022-11-02T08:17:38.060000+00:00",
        "attachments": null
    }
]