[
    {
        "author": "pipermerriam",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "Consideration needs to be taken for what happens during reorgs, what happens at the transition between epoch boundaries and what our expected use cases are for near head data",
        "created_at": "2025-02-17T00:00:11.672000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "We also have to account for re-orgs for state",
        "created_at": "2025-02-17T00:48:09.517000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "I don't think they need to be different content types to be treated differently",
        "created_at": "2025-02-17T05:59:22.446000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "To prove them you need access to the header, if you have access to the header you know if the bodies are receipts are proven to an ephemeral header, if they are proven to an ephemeral header you can store them in a separate table with extra meta data if needed, but I don't think there is value in creating ephemeral types for bodies and receipts, as it wouldn't make a difference with or without them, so we might as well not have a new type.",
        "created_at": "2025-02-17T06:02:04.936000+00:00",
        "attachments": []
    },
    {
        "author": "deme1744",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "\u003c@261161007982968833\u003e  Good point on raising this, I think we did not pay enough attention to this (or did we discuss this?).\nI think I agree with \u003c@240180844130598912\u003e, they can stay the same content type and when being offered they can be marked (in whichever way, different table, extra column, etc.) as has been proven with Ephemeral headers and thus potentially to be thrown away at later stage. \n\nReason I think it is best to keep them as the same content type is that they don't actually change of encoding / object structure (which is different for the headers as a proof gets added). They are also proven in similar way, that is, by checking the header roots. The one difference is that the actual header might be dropped\n\nInitially I thought that having separate types might make handling them less complex. However, I don't think this is the case as even with separate types you should ideally still track the head of the chain and verify if in incoming offer of bodies/receipts requires getting a `HeaderWithProof` or  a`EphemeralHeader`  to validate as else you might be doing useless requests for the headers in case of bugs/malicious actors.",
        "created_at": "2025-02-17T14:36:52.034000+00:00",
        "attachments": []
    },
    {
        "author": "deme1744",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "Another reason to keep them as the same content type, would be that it I think is is actually required that bridges offer/gossip these. Considering that we cannot just get this data from the beacon light client data.\nSo this is different from the Ephemeral headers where they are received through other means and not to be offered/gossiped.",
        "created_at": "2025-02-17T14:38:22.225000+00:00",
        "attachments": []
    },
    {
        "author": "milos88",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "My understanding is that bridges don't gossip ephemeral headers, and each peer is responsible for obtaining those (e.g. from beacon network). And bridges would gossip headers with proof once they are available.\nWhen should they gossip bodies / receipts?!\n\nIf I understand correctly, you are suggesting that bridges:\n- gossip bodies and receipts as soon as these blocks are created (verifired using \"ephemeral\" headers, and maybe deleted later)\n- gossip headers once they are no longer ephemeral\n\n\u003c@510413979080720385\u003e Is that correct? Does that mean that each node needs to have some out-of-protocol solution for deletion of those headers (I consider beacon network out-of-protocol in this context)?",
        "created_at": "2025-02-17T15:26:25.916000+00:00",
        "attachments": []
    },
    {
        "author": "milos88",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "Just to clarify, I'm not against this idea. Just wanted to make sure we are on the same page, as I think that specs don't explain this well enough.",
        "created_at": "2025-02-17T15:27:13.133000+00:00",
        "attachments": []
    },
    {
        "author": "deme1744",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "Yes, that is correct. Now the deletion of the ephemeral headers was already assumed/discussed (specified?). Any description about this regarding the bodies/receipts is however missing/underspecified.",
        "created_at": "2025-02-17T15:28:26.171000+00:00",
        "attachments": []
    },
    {
        "author": "deme1744",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "I'm not super bound to this plan by the way, it just seems most straight forward to me at this point.",
        "created_at": "2025-02-17T15:29:35.267000+00:00",
        "attachments": []
    },
    {
        "author": "nick.ghita",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "I've added what I believe to be valid `HeaderWithProof` content key / value test vectors in this pr, using the new changes to the type. If other teams could validate these vectors, that would be great!\nhttps://github.com/ethereum/portal-spec-tests/pull/39",
        "created_at": "2025-02-17T22:38:22.227000+00:00",
        "attachments": []
    }
]