[
    {
        "author": "donschoe",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e Finality rejection will take weeks though... \nI raised that on Witti because people dropped off the network quicker than it would eject stale validators. Even after the 5-6 weeks of running the network, not a single validator that never attested since genesis was ejected.\n\nSo, to emphasize my question again, is this desired behaviour that it takes so long? I believe a validator that is never online for 4 consecutive weeks should be booted right away disregarding whatever it's balance is. the current algorithm is _way too slow_ and it might cause issue if many people fail to fullfill their duties ...",
        "created_at": "2020-07-25T09:57:06.661000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminion",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Quick observations. Tracking validator last-seen would add yet more bloat to the state. There isn't currently a field for this; instead the validator's balance is used as a kind of proxy for this. Also note that validators don't necessarily need to be ejected to regain finalilty. Voting is weighted by validators' effective balances, so once the balances of non-voting validators have dropped a bit, finality could be restored. In some circumstances this could happen much more quickly than waiting to eject them. The inactivity leak could be speeded up by reducing `INACTIVITY_PENALTY_QUOTIENT`, but I would urge against.  On the real network (not testnet) I expect we'd only ever see lengthy periods of non-finality (hours or more) in catastrophic circumstances (massive Internet partition; client bug that is so fundamental as to be unfixable - even then people can swtch clients; AWS goes down for days 😬). There's just too much value at stake for people not to maintain their clients and networks (unlike on testnets). Rushing to eject clients in these circumstances may not be the wisest response - any resulting chain split would become permanent and effectively irreparable. The leak is intended to allow time to coordinate responses.",
        "created_at": "2020-07-25T10:20:09.963000+00:00",
        "attachments": null
    },
    {
        "author": "donschoe",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e On the real network (not testnet) I expect we'd only ever see lengthy periods of non-finality (hours or more) in catastrophic circumstances \nTo be fair, we don't know that yet.... we might need an incentivized testnet.",
        "created_at": "2020-07-25T10:47:16.226000+00:00",
        "attachments": null
    },
    {
        "author": "donschoe",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e Rushing to eject clients\nI'm not sure if weeks of inactivity can be called _rushing_. I believe the penalty should ramp up faster than it does right now. Do we have any numbers for Witti? Too bad the explorer is down already.",
        "created_at": "2020-07-25T10:49:15.744000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminion",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "At current params, it should take 3 weeks from last finality for a validator to leak half of its deposit. Note that the total leak increases quadratically with time since last finality, so it accelerates. The result is pretty close to the 4 weeks you suggested.",
        "created_at": "2020-07-25T10:57:34.968000+00:00",
        "attachments": null
    },
    {
        "author": "donschoe",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Ok, then we should double check these params because I didn't see any exists after 3 weeks",
        "created_at": "2020-07-25T12:28:27.440000+00:00",
        "attachments": null
    },
    {
        "author": "donschoe",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I didn't even see any balances ever dropping below 20",
        "created_at": "2020-07-25T12:28:40.238000+00:00",
        "attachments": null
    },
    {
        "author": "donschoe",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Not even close",
        "created_at": "2020-07-25T12:28:45.053000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminion",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Agreed, it would be good to check. Unfortunately, I no longer have easy access to a Witti node. The quadratic nature means that in week 1 ~2Eth penalty, week 2 ~4Eth that week, week 3 ~8Eth penalty that week.",
        "created_at": "2020-07-25T13:12:53.954000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminion",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Oh, that's exponential, so not growing so fast. But that's the idea.",
        "created_at": "2020-07-25T13:16:30.222000+00:00",
        "attachments": null
    },
    {
        "author": "donschoe",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I can see if I can run some numbers next week. I still have a couple Witti nodes",
        "created_at": "2020-07-25T13:28:20.494000+00:00",
        "attachments": null
    }
]