[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What do you mean by liquid staking?",
        "created_at": "2022-04-22T04:53:26.111000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Many staking services provide tokens that represent the staked ETH. Users can trade these and they sell for a very minimal discount today. There are many arguments around analyzing the risks this poses",
        "created_at": "2022-04-22T05:26:03.329000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ah.  I don't see a problem.  At the end of the day someone has 32 ETH on the line that they will lose if they do something bad.  How they acquired those 32 ETH doesn't matter so much.",
        "created_at": "2022-04-22T05:41:33.234000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The one way this can cause problems is if people can stake other people's ETH, like via RocketPool.  In this case, the decision maker isn't the person with ETH on the line.",
        "created_at": "2022-04-22T05:42:29.574000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "One could argue that centralized staking institutions also are staking other people's ETH, and while that is also bad I think it is *worse* when there is no reputation on the line (such as anonymous rocket pool validators).",
        "created_at": "2022-04-22T05:43:25.985000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think we (developers) should make it very clear to everyone that if you are caught censoring (or otherwise attacking the network) we *will* develop and push a hard fork that slashes you for it.  We should further wake it as clear as possible to end users that if the person they delegate decision making to with their ETH misbehaves for *any reason* (including government coercion), the user will lose all of their ETH.",
        "created_at": "2022-04-22T05:45:26.454000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Most of the dangers are not for the network but for the users of these tokens. I find it surprising that you will see a problem with the Eth 2.0 moniker, in that it may trick users into buying an inexistent token, and not a problem here which digs deeper into the false security guarantees of a tokenized staked eth",
        "created_at": "2022-04-22T06:47:31.512000+00:00",
        "attachments": []
    },
    {
        "author": "0x2e",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "To make things a bit clearer, with Rocket Pool 1) node operators have to own half of the created validator (16 ETH) 2) only the rETH stakers side becomes liquid, so 50%/16 ETH 3) if they get slashed, their ETH gets used first, meaning they have double the slashing penalty but get a slightly larger reward per ETH 4) they can at most double their effective voting power using it (2 validators with 32 ETH instead of one)",
        "created_at": "2022-04-22T07:18:30.038000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I definitely think we should do our best to communicate to users how terrible of an idea it is to give their money to someone else to stake.",
        "created_at": "2022-04-22T07:20:05.830000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Draining operator ETH first is definitely good, but the class of attacks I'm worried about here are of the kind where the validator doesn't expect to get any ETH back, they make their money directly from the attack or they are coerced into attacking or they are hacked.  In these cases, the attacker gets to execute at half price.",
        "created_at": "2022-04-22T07:21:16.049000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I *do* think it is a problem for users here, and I actively advocate for anything that breaks centralized/custodial pools (sadly, not much does).  I also tell everyone who will listen that they shouldn't stake with a centralized service.  Unfortunately, I can't think of anything else to do beyond that.  😢",
        "created_at": "2022-04-22T07:22:20.713000+00:00",
        "attachments": []
    },
    {
        "author": "0x2e",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm such a scenario it would make more sense to abuse something like lido, which allows node operators to create validators for 0 ETH (basically getting free voting power, though they have a screening process). Or getting access to validators from a large staking service through exploits/similar\nEdit: though one scenario i can think of where abusing rp makes sense is if you aquire a large sum of ether through scams/exploits and want to attack the beacon chain. In that case you do get 2x the voting power, assuming there is enough rETH demand to handle you",
        "created_at": "2022-04-22T07:26:35.926000+00:00",
        "attachments": []
    },
    {
        "author": "randomishwalk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Staking derivatives",
        "created_at": "2022-04-22T13:10:19.630000+00:00",
        "attachments": []
    }
]