[
    {
        "author": "dcposch",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "do crLists help here? in \u003c@137094067015122944\u003e 's scenario, a banned transaction makes it onto crList \u003e next block must include it \u003e validators that refuse to accept are inactivity leaked",
        "created_at": "2022-06-06T05:19:47.026000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I believe crLists are the current top proposal for dealing with transaction censorship by block builders.",
        "created_at": "2022-06-06T08:02:37.919000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Never been convinced by them.  The details I have seen to date suggest that the crList should be broadcast at the beginning of the slot, which means that block building cannot start until the crList has been built, broadcast, and received.  That could add up to a significant additional delay, and we're already proposing blocks too late in many cases to be comfortable.",
        "created_at": "2022-06-06T08:21:28.269000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I like the *general* idea of cr lists, and I think we can work around problems like you have proposed here.  For an extreme examples, the crList could be generated in parallel and separate to blocks, and agreed on for future block inclusion.",
        "created_at": "2022-06-06T08:30:54.885000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We don't need the crList to be incredibly responsive, we just need to ensure that items on the list are *eventually* included.",
        "created_at": "2022-06-06T08:31:11.523000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "e.g., propose a crList and those transactions need to be included (if still valid) within the next 5 blocks.  We don't need to get them included in next block.",
        "created_at": "2022-06-06T08:31:39.398000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Committing future blocks to have to include certain transactions becomes very ugly.  What if, for example, someone wants to cancel the transaction and sends a perfectly valid updated transaction with the same nonce?  Now the crList information needs to be re-evaluated, and one execution node may consider the updated tx to be valid where another considers the original tx to be valid (there are no protocol rules for replacement transactions so it's client-dependent).\n\nI agree that the general idea of crLists is an interesting one, and it would be nice to have something like it, but not sure that it will be practically possible to pull off without some significant compromises elsewhere.\n\nUltimately, I think that the issue is that PBS has created a non-protocol actor (the builder) and there is no simple way of punishing them, as they have no locked funds.  I do wonder if forcing any builder to also be a validator would allow for more robust systems.",
        "created_at": "2022-06-06T08:41:51.347000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e What if, for example, someone wants to cancel the transaction and sends a perfectly valid updated transaction with the same nonce?\nIf this transaction is included within 5 blocks then it means at the 5th block when the crList is evaluated the transaction in question will no longer be valid thus the crList wasn't violated.",
        "created_at": "2022-06-06T09:21:44.730000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My general point being though, I think the set of problems with crList are \"solvable\" problems.  I haven't seen/heard of any that my gut says are \"incredibly hard problems\".  They just need further iteration on the idea.",
        "created_at": "2022-06-06T09:22:10.892000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As I say, though, the question of it a replacement tx supersedes the tx it is attempting to replace is a down to the client rather than the protocol.  So one implementation may consider the tx in the crList valid and another not.",
        "created_at": "2022-06-06T09:23:43.413000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In my mind the crList is evaluated at the end of a particular block.  At that point in time each transaction is evaluated to determine if it could be included after the end of the block.  If it could be, then the block is invalid.  If it couldn't be, then the block is valid.",
        "created_at": "2022-06-06T09:24:33.541000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This would be a well defined process and it wouldn't care at all about replacement transactions.  Either you can include transaction X after the block or you can't.  Very cut and dry.",
        "created_at": "2022-06-06T09:25:00.176000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm more on the \"perhaps solvable\", but committing anything to be included in future blocks seems like it could easily fall in to the realm of \"attack vector\".  No proof of it, of course, but it seems like an area where we would need to tread incredibly carefully to not cause bigger problems.",
        "created_at": "2022-06-06T09:25:09.158000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Again, though, we're in to the question of who \"you\" is, and punishing a validator (one you) for not including transactions in a block provided blind by a builder (a different you).",
        "created_at": "2022-06-06T09:26:51.261000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My general position is:\n1. Builder centralization is going to happen no matter what we do.\n2. PBS forces builder centralization into the light, which is better than it happening in the dark.\n3. Builder centralization comes with unaccountable censorship risks (whether the centralization is in the light or in the dark).\n4. crLists provides a solution for builder censorship if we go with PBS.",
        "created_at": "2022-06-06T09:27:02.813000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I agree with the first three 😆",
        "created_at": "2022-06-06T09:27:23.791000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ah, I see what you are saying.  ~~We could require that builders provide a proof of inclusion with their block proposals?~~",
        "created_at": "2022-06-06T09:27:28.974000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Regardless of whether (4) actually works or not, I still think that given the first 3 points that PBS is good because the alternative is darknet builder centralization, which I believe to be strictly worse.",
        "created_at": "2022-06-06T09:28:22.062000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yep, definitely.",
        "created_at": "2022-06-06T09:28:35.815000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But we're also in a world directly post-merge where PBS doesn't exist in protocol, and realistically is at least a year away.  Guess that's one of the hits we have to take in return for achieving a minimal viable merge, but it still freaks me out somewhat.",
        "created_at": "2022-06-06T09:30:22.242000+00:00",
        "attachments": []
    }
]