[
    {
        "author": "62theories",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@218839977818062849\u003e I am new to formal verification too (I am nattawatx86_gitlab). but it seems like Certora is only available on their website, isn't it ?",
        "created_at": "2022-11-22T08:48:03.175000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003cxvwx:matrix.dapp.org.uk\u003e Regarding static analysis to detect issues due to reentrancy, I think the following papers may be interesting:\n\n- https://arxiv.org/pdf/1801.04032.pdf\n- https://link.springer.com/chapter/10.1007/978-3-031-10769-6_1\n\nThey both discuss the notion of effective callback freedom (i.e. that executions with callbacks cannot result in new states that are not reachable by callback free executions).\n\nI",
        "created_at": "2022-11-22T08:53:24.805000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003cxvwx:matrix.dapp.org.uk\u003e Certora is a great tool and very powerful. I think it's probably more capable than the currently available open source tooling. There is a nice overview of the currently available tooling and research here:\n\nhttps://github.com/leonardoalt/ethereum_formal_verification_overview\n\nI think the highlights would be:\n\n- SolcMC: CHC based verification of solidity programs (built into the solc compiler): https://docs.soliditylang.org/en/v0.8.17/smtchecker.html\n- KEVM: A symbolic execution engine for the EVM built on top of the K framework. This can be used to symbolically execute foundry tests: https://jellopaper.org/foundry/\n- hevm: A symbolic execution engine for the EVM implemented in haskell: https://fv.ethereum.org/2020/07/28/symbolic-hevm-release/\n\nOver the longer term, we (the EF) are working on [act](https://github.com/ethereum/act), which would be more similar to certora (i.e. a specification language with automated invariant checking), but it's still a way off from being ready for serious production usage.",
        "created_at": "2022-11-22T09:01:52.839000+00:00",
        "attachments": null
    }
]