[
    {
        "author": "ctrl_alt_lulz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "sharing this fb/meta blog post that you all might find interesting, I think there's some good takeaways that could help with how DAS could work in Ethereum. Potentially like using the idea of different classes of validators, eg one suited for \"coordination\"/CPU heavy activities \n\n\"Compute KZG proofs for 32 MB of data in ~1s. This requires a 32-64 core CPU. I think a machine that is capable can be built for \u003c5,000$, proof of concept to be implemented. According to conversations with Dag Arne Osvik, it’s likely possible to do this on a GPU much cheaper\"\nhttps://notes.ethereum.org/@dankrad/new_sharding\n\nhttps://github.com/ethereum/consensus-specs/blob/dev/specs/sharding/validator.md#sample-reconstruction\n\nhttps://blog.acolyer.org/2014/12/16/f4-facebooks-warm-blob-storage-system/\n\nI think especially if adding GPUs or new hardware, that a second validator class would be much less disruptive as well",
        "created_at": "2022-09-10T19:18:40.561000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think that post is about a PBS world, where the builders are indeed required to have more powerful hardware. That is decoupled from the validator entity though. A builder can still be a validator if they want, and run it on the same hardware. Just that not _every_ validator is expected to have powerful hardware to build blocks/store all history/state/etc.",
        "created_at": "2022-09-10T19:28:50.733000+00:00",
        "attachments": null
    },
    {
        "author": "ctrl_alt_lulz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "^ I think eventually there will reach a point where specialization will need to happen just due to the increased system complexity of increasing scalability since web3 is really trailing web2 (it's just a lot harder to scale in web3), I think the hard thing would possibly be how you manage the balance eg if we needed a specialized validator, how do you keep that from being run by centralized entities and making sure enough of them are online",
        "created_at": "2022-09-10T19:31:57.509000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Well, that is what PBS is all about isn't it? Embracing the centralizing effects of block building, and enshrining in into the protocol with safeguards against censorship and the like.",
        "created_at": "2022-09-10T19:33:05.763000+00:00",
        "attachments": null
    },
    {
        "author": "ctrl_alt_lulz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think it's all about acceptable tradeoffs that overall result in a better ecosystem for everyone. i think a good model of validator split could be something like 30% solo operators, maybe 30% pooled dex operators, and maybe 40% centralized operators, that way there's enough architecture diversity to make the network even more stable overall",
        "created_at": "2022-09-10T19:35:39.686000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I very much disagree that that is a good validator split, but that's more of a personal value than anything else. I would say that Ethereum is generally more of a \"we want more decentralization\" type of community. What are the technical merits to a large percentage of centralized validators?\n\nIf this ties in to your earlier discussion about computing requirements for validators, then I still have the following suggestions (assuming you haven't done so already):\n1) Gather data on the usage as it scales with # of validator per node\n2) Do clients differ on their resource usage?\n3) Talk to client teams to see if there is anything that can be done to lower requirements/increase efficiency for high numbers of validators (i.e. reduce duplicate work).",
        "created_at": "2022-09-10T19:43:12.117000+00:00",
        "attachments": null
    },
    {
        "author": "ctrl_alt_lulz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "^ i do have a rfp submission to build the tooling to do so and to help simulate network scenarios that test das. im not hard set on any certain percentage being centralized or not, but I also think some centralization includes/can be from these sorts of situations: eg i want to invest in ethereum in my 401k, and a financial institution buys ethereum and then chooses to stake it and returns the yields to people's retirement funds or for pensions",
        "created_at": "2022-09-10T19:46:27.015000+00:00",
        "attachments": null
    },
    {
        "author": "ctrl_alt_lulz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "also I've got an idea on how to help power more solo stakers, can send you some details on dm if that's cool? would be curious on your thoughts",
        "created_at": "2022-09-10T19:50:55.357000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'm just some lurker though, definitely not very knowledgeable on DAS or resource use of clients. For long form arguments/discussions you can generally post to ethresear.ch or ethereum-magicians. And then you can link to them here if you want to get feedback on it or start a more interactive discussion.",
        "created_at": "2022-09-10T19:54:44.724000+00:00",
        "attachments": null
    },
    {
        "author": "ctrl_alt_lulz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "definitely! yep the forum is the best place for longer formal discussions i agree. i usually use discord for idea brainstorming or sharing info to start chats that could lead to a formal write up",
        "created_at": "2022-09-10T19:57:05.331000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Sure, if that's the intention then you can definitely hit me up in DMs. No promises I'll have useful feedback though 😉",
        "created_at": "2022-09-10T20:08:49.336000+00:00",
        "attachments": null
    },
    {
        "author": "ctrl_alt_lulz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "haha, no worries about that the only requirement is being enthusiastic about ethereum 😛",
        "created_at": "2022-09-10T20:11:05.643000+00:00",
        "attachments": null
    }
]