[
    {
        "author": "__kasey__",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "From Danny's DAS building blocks[1] `We generally assume that we will require “honest” nodes to support some amount of sample querying on an altruistic basis. This is not a far departure from the existing assumption that honest nodes will serve historic blocks and/or state sync queries. Just instead of an honest node being expected to serve all block-data historic queries, it is expected to serve a subset of blob-data queries on a fixed range (e.g. 1 month).` At KademliaCon there were comments like requiring the network to persist samples for \"1-3 months\" or \"the weak subjectivity period\", so I'm wondering, after the initial attestation following a block where validators need to commit to samples[2] in their assigned columns, where are sample queries used in the protocol? Also has there been any spec on how those attestations will work? I mainly looked for it in the EIP-4844[3] consensus spec\n[1] https://notes.ethereum.org/@djrtwo/das-building-blocks\n[2] via https://notes.ethereum.org/@dankrad/new_sharding `Each validator is assigned to 32 random columns, which they also have to custody in their next attestation (meaning that the attestation will custody a total of 32⋅32⋅512 samples). `\n[3] https://github.com/ethereum/consensus-specs/blob/dev/specs/eip4844/validator.md",
        "created_at": "2022-09-07T16:44:03.191000+00:00",
        "attachments": null
    },
    {
        "author": "__kasey__",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "(I should clarify that EIP-4844 is an interim step - p2p will just distribute sidecar blobs for the time being, so it isn't expected that future attestation behavior would be defined there. i'm hoping for a little help understanding what ethresearch threads / hackmds or other resources are useful/relevant at this stage to understand how samples will be used)",
        "created_at": "2022-09-07T16:48:06.726000+00:00",
        "attachments": null
    },
    {
        "author": "__kasey__",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I'll attempt to self-answer after an incidental side conversation with \u003c@755590043632140352\u003e - I think the answer is:\n1) full danksharding[1] in the future will likely include some kind of proof of custody in-protocol\n2) L2s may choose to query L1 for samples in order to recover data (due to problems with their own persistence, or forks?) through whatever mechanism (eg DHT ) we settle on\n\n[1] https://notes.ethereum.org/@vbuterin/proto_danksharding_faq#What-parts-of-full-danksharding-does-proto-danksharding-implement-and-what-remains-to-be-implemented",
        "created_at": "2022-09-07T20:08:50.764000+00:00",
        "attachments": null
    }
]