[
    {
        "author": "lightclient",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e For this multipath approach to makes sense, we need to replicate data on the way or have open streams via the multipath.\nwhy do you say the data needs to be replicated? i believe the multiple paths are to derisk the possibility of an adversary controlling nodes along the path, allowing them to make it seem the sample does not exist. only the terminal node should need to store the sample",
        "created_at": "2023-05-08T13:38:37.721000+00:00",
        "attachments": null
    },
    {
        "author": "emhane",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "“The sample doesn’t exist” this means in implementation: “the sample isn’t returned before a timeout”. What would you do when a request fails? Try a new peer. If all your peers in a certain bucket are malicious, you have a problem a lower level and DAS samples appearing not to exist is a high level consequence of it. And to your second point about there only being one node to store any given sample: will popular samples exist?",
        "created_at": "2023-05-08T17:19:24.192000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "requests for samples should be uniformly random, so every sample should be equally popular",
        "created_at": "2023-05-08T17:21:31.913000+00:00",
        "attachments": null
    },
    {
        "author": "emhane",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "But true your kbuckets could be polluted enough on the way so the timeout would accumulate to be very long. But it isn’t much different to the risk of that occurring now in discv5 on a regular find node query. I think that if no sample is popular there is little risk the attackers will target a specific hash (ie distance) to make a particular sample invisible and rather aim to fill as many of a nodes kbuckets as possible at all distances making most k disjoint paths start off bad if the attacker succeeds.",
        "created_at": "2023-05-08T17:30:58.320000+00:00",
        "attachments": null
    },
    {
        "author": "emhane",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The gain in speed by not using d independent buckets will be bigger than the gain of trying to fix this unlucky edge case that an attacker has calculated exactly which sample some peer will look up in time enough to fill that peers kbuckets at the closest distance that samples hash can be relative to the node id of that victim peer",
        "created_at": "2023-05-08T17:36:34.174000+00:00",
        "attachments": null
    },
    {
        "author": "echo_alice",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think \u003c@543900561460822016\u003e meant to say terminal *nodes*.  Multiple peers store each sample.  In normal Kademlia the number of peers storing one sample would be the \"K\" closest nodes to the key.  S-Kademlia talks about implementing a sibling broadcast list, where the number of peers that store each sample is independent of the redundancy of overlay connectivity (length of k bucket).\n\nWhat did you mean by \"we need to replicate data on the way\"?  Are you saying we need to replicate some peer connectivity data for each intermediary node along the path to our key/value?",
        "created_at": "2023-05-08T18:16:42.248000+00:00",
        "attachments": null
    },
    {
        "author": "emhane",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "for the k-disjoint paths to add value in discv5, content needs to be replicated on the way. if the goal is not to replicate data on the way, then the purpose of k-disjoint paths is defeated based on the points explained above.",
        "created_at": "2023-05-08T18:21:54.602000+00:00",
        "attachments": null
    },
    {
        "author": "emhane",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "the terminals can be the same node for the k-disjoint paths problem, but if the terminals are in fact mapping to different nodes, then finding the sample will be easier. what number of peers at most relative to the size of the network will look up a sample? is there any estimates on this?",
        "created_at": "2023-05-08T18:26:49.406000+00:00",
        "attachments": null
    },
    {
        "author": "emhane",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "the size of the space that should store this sample is bound by the number of peers that will look up the sample simultaneously and by the amount of requests a node can serve so all peers get their samples back in a reasonable time.",
        "created_at": "2023-05-08T18:30:57.415000+00:00",
        "attachments": null
    }
]