[
    {
        "author": "jimmygchen",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Great summary \u003c@520034910149410861\u003e 🙏 \n\nI'm a bit more convinced now on the benefits of validator custody than before - I didn't really think reducing full node bandwidth is critical, however having large validators run supernodes is really appealing because it could significantly improve the network resiliency - although these nodes would have to up their hardware spec and bandwidth quite significantly to avoid delays in importing blocks and voting.\n\nOne thing that's unclear to me is the trailing fork choice section vs the last section on requiring peer sampling for justification. My read on this is that the former suggests we require sampling on older slots for attestation, while the latter suggests that we don't use it for attestation and only consider sampling results during justification. I'm guessing you're considering various options here, and I'd like to figure out what would be a sensible implementation for the initial implementation on mainnet. \n\nIn terms of subnet count (64 vs 128), what are your thoughts on this - would finding and maintaining peers across all subnets be more difficult with more subnets? (might be worth some experiment too)\n\nIt sounds like the next devnet would mostly be network parameters changes + peer sampling for justification (and maybe increase blob count). It may be worth starting devnet-1 with sufficient number of supernodes. devnet-0 died as most nodes forked, and I suspect this may be caused by nodes not able to retrieve their custody columns from peers (just a guess without any evidence though, unfortunately we didn't check the logs in time and they're gone) so they ended up having different views of the chain.",
        "created_at": "2024-05-28T13:27:27.448000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I have written another doc that’s more focused on the role of peer sampling in the fork-choice specifically 🙂 \nhttps://hackmd.io/@fradamt/peerdas-fc2\nTLDR: I suggest to use peer sampling to gate importing of new justifications, which both solves the issue of security of transaction confirmation for full nodes (you won’t consider something finalized if peer sampling fails, as you won’t even import any block that justifies it) and the issue of having attesters  locked on an unavailable chain in case of a supermajority attack. Also suggest to use peer sampling to filter out blocks from current epoch - 2 for a reason related to this supermajority attack case. Basically yes, we do have a trailing fork-choice instead of not having peer sampling in the fork-choice at all, but the trailing period is very long (a few minutes) and hopefully we can make it robust in that timescale \n\nEverything is condensed in this PR: https://github.com/ethereum/consensus-specs/pull/3779.",
        "created_at": "2024-05-28T13:40:55.591000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "In terms of subnet count, I would say (and Dankrad and the codex team have expressed agreement on this point at the interop) to just try out 128 and see if any issues arise?",
        "created_at": "2024-05-28T13:44:13.303000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hi \u003c@520034910149410861\u003e , is the latest thinking on fork choice changes reflected in https://hackmd.io/@fradamt/peerdas-fc2? I've been studying PeerDas fork choice and plan to create a comparison document with ePBS fork choice. I reviewed https://notes.ethereum.org/P1iDee8lTwyAtHpZwd8LMw?view, but it seems the second version supersedes the (block, slot) and backoff scheme components, which are much easier to reason about. The backoff scheme in fc1 won't be compatible with ePBS, I was a little relieved to see that go away so I dont have to write about it. cc \u003c@755590043632140352\u003e",
        "created_at": "2024-05-28T19:47:29.041000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yeah that's the latest document. I have convinced myself that for now there might not be a good enough reason to use variants of the (block, slot) fork-choice",
        "created_at": "2024-05-28T19:49:10.018000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Why do you think the backoff component is not compatible with ePBS?",
        "created_at": "2024-05-28T20:13:34.292000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Why do you think the backoff component",
        "created_at": "2024-05-28T21:56:39.051000+00:00",
        "attachments": []
    }
]