[
    {
        "author": "fradamt",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@476250636548308992\u003e wrt to the question of lowering the custody requirement requiring a fork/coordination point, one possible way around it could be to keep the custody requirement (as in, the advertised and enforced number) low, and make the extra \"subnet sampling\" be separate, not advertised and not enforced. E.g., a full node might advertise that they custody 4 subnets, but then also participate in 4 more subnets (or generally `SAMPLES_PER_SLOT` - `CUSTODY_REQUIREMENT` subnets), either still chosen in the same way (by node id, as if the advertised custody was `SAMPLES_PER_SLOT`) or chosen through local randomness",
        "created_at": "2024-08-07T09:51:22.113000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "this way, once we want to introduce peer sampling and drop the extra subnet sampling, we can just do it on an individual basis (you stop participating in the extra subnets and only stick to the 4 you custody, and the rest you do with sampling)",
        "created_at": "2024-08-07T09:54:57.135000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "ah that is a good idea",
        "created_at": "2024-08-07T10:35:00.923000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "makes the extra custody requirement invisible from the view of the protocol. So if a client chooses they can independently drop it and use sampling if they want to",
        "created_at": "2024-08-07T10:35:41.126000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I like this idea, allows clients to go at their own pace without any coordination necessary",
        "created_at": "2024-08-07T10:36:13.764000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Then it becomes almost a local decision of doing subnet sampling vs peer sampling basically",
        "created_at": "2024-08-07T10:36:20.359000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Like, in principle you could even have a single client switching to peer sampling by itself I think",
        "created_at": "2024-08-07T10:37:00.662000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "exactly, could be an optional feature (ex: use peer sampling to reduce b/w requirement for a node that wants to).",
        "created_at": "2024-08-07T10:38:20.655000+00:00",
        "attachments": []
    },
    {
        "author": "asn_d6",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hm. How come this works? I thought without peer sampling, we had to increase the custody requirement from 4 to 8 for security.\n\nFeels like the suggested 4+4 approach treats the second group of 4 subnets differently. For example, I guess nodes won't be asked for historical samples on their second group, and they won't be held accountable for the second group in case of a disaster scenario. How come that's OK? And then why can't we do 2+6, or whatever?\n\nThanks!",
        "created_at": "2024-08-07T11:12:36.526000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There's a few things:\n- The custody requirement for full nodes was set to 4 (out of 128) mostly to provide a stable backbone for the subnets (this answers why we still want to do 4 + x instead of 2 + x or whatever). This includes helping other nodes to sync by serving historical data\n- That said, if a node stably joins a subnet, it is going to be helpful regardless of whether or not they advertise this as part of their custody. Their behavior won't be different. The difference is that other nodes won't enforce anything regarding that subnet, so that the node is at some point free to drop out of it\n- Validator custody is a separate issue. Validators would still be asked to custody a higher minimum amount of subnets",
        "created_at": "2024-08-07T11:33:34.283000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Here's a first version of a spec corresponding to this first simplified version: https://github.com/ethereum/consensus-specs/pull/3870\nAny feedback is appreciated 🙂",
        "created_at": "2024-08-07T13:12:12.480000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "This would replace this unmerged PR: https://github.com/ethereum/consensus-specs/pull/3779. There's no validator custody in this new PR though, I think it makes sense to have that be a separate one",
        "created_at": "2024-08-07T13:13:23.184000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Posted in the wrong channel, here comes again\n\nI have a little problem with peer DAS that it's not specification related but rather implementation. In many parts of Prysm code we assume that the commitments come in the beacon block. Within ePBS this is not true. Working on top of Electra requires us to change the DA code to take the commitments instead of the blocks on most helpers. Peer DAS is a complication cause clients keep a separate branch for it. So ePBS is explicitly in conflict with peer DAS at the time of merging. Could it be possible to clean the spec to make minimal assumptions that the commitments are in blocks and have the helpers take them directly rather than accessing them from blocks?",
        "created_at": "2024-08-07T14:27:16.845000+00:00",
        "attachments": []
    },
    {
        "author": "jtraglia",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e would something like this work for you? Only `get_data_column_sidecars` needs to change, right? Diff: https://github.com/ethereum/consensus-specs/compare/dev...jtraglia:consensus-specs:update-get-data-column-sidecars-params",
        "created_at": "2024-08-07T16:46:54.857000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "(this is the separate one for a basic form of validator custody, similar to the previous PR https://github.com/ethereum/consensus-specs/pull/3871)",
        "created_at": "2024-08-07T21:00:03.085000+00:00",
        "attachments": []
    }
]