[
    {
        "author": "cskiraly",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "An important modification we do in our simulators on default GossipSub publish behaviour is that we send out 1 copy every segment first, to one randomly selected peer on the relevant topic (column topic in the 1D case; column or row topic in the 2D case). This means that if your block producer is low bandwidth, it would send out a single copy of the block only, segment-by-segment, and by the time it would start to send out second copies, the P2P distribution would make such that the whole network has the whole data. So it can see this (if it interprets the feedback it gets), and it can avoid wasting bandwidth.\nYou can find this and similar techniques described in this sub-section of our FullDAS writeup: https://ethresear.ch/t/fulldas-towards-massive-scalability-with-32mb-blocks-and-beyond/19529#the-dispersal-protocol-18",
        "created_at": "2024-07-28T01:20:13.002000+00:00",
        "attachments": null
    },
    {
        "author": "popef",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e The diff of 1D and 2D in code is small. In fact all our simulators do 2D, and  we use them in 1D mode by setting one of the dimensions to size 1, or something larger with N=K \n\nThe  diff is not small and I think it's significant. He was talking about transtioning from 1D to 2D, not 2D to 1D. Even transitioning from 2D to 1D is not trivial. For example, the sample size in 2D is constant (cell size), while the sample size in 1D is variable (depending on the blob count). There are many other issues like in 2D, we do partial reconstruction, while in 1D, we reconstruct the whole matrix. In term of the network simulation, it's easy to turn the 2D setting into the 1D setting, but in term of the protocol, we have many things to do.\n\nLet's get back to the transition from 1D to 2D. In term of validator custody and custody groups, I have it's not hard we just have make them cover rows as well not just columns. But for reconstruction, the reconstruction may not be restricted to super nodes anymore in 2D, because you can just reconstruct rows and columns instead of the whole matrix.",
        "created_at": "2024-07-28T04:40:29.011000+00:00",
        "attachments": null
    }
]