[
    {
        "author": "jimmygchen",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e - Is there a way to simulate poor connection on these devnets/local testnets?\nI'm not sure if Kurtosis supports this out of the box, maybe \u003c@412614104222531604\u003e knows? But given that we're using Docker, we could configure the `qdisc` to simulate network latency using `tc`. (https://medium.com/@kazushi/simulate-high-latency-network-using-docker-containerand-tc-commands-a3e503ea4307) \n\n\u003e From this (although not conclusive), it seems that the network bandwidth between a super node and a full node is about 10x for a small network\nYep would be interesting to see a larger network though. Also this was tested under \"perfect\" network condition, which means there's little extra block lookup / range sync activity. I suspect there would be more rpc requests to supernodes on a bigger and more realistic network, which could make this gap even bigger.",
        "created_at": "2024-07-12T00:47:44.646000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e Do you know roughly what the reduction is here? ie 2x or 4x\n\nRoughly I think a Deneb full node would consume half the bandwidth for blobs compared to PeerDAS supernode, so *based on this setup*, a deneb full node is estimated to consumex roughly 4-5x more bandwidth than a peerdas full node (with no validators attached)",
        "created_at": "2024-07-12T00:50:28.466000+00:00",
        "attachments": null
    },
    {
        "author": "samcm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Kurtosis itself can't do it, but it's possible to hook Kurtosis up to a Kubernetes cluster and simulate chaos there. There's a tool called `attacknet` which is the missing piece 😄\n\nhttps://ethpandaops.io/posts/attacknet-introduction",
        "created_at": "2024-07-12T00:50:59.291000+00:00",
        "attachments": null
    }
]