[
    {
        "author": "nishant0",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Even in the optimistic case its still added latency to column propagation",
        "created_at": "2024-09-06T06:08:05.887000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There's always going to have latency waiting for block headers. Even if the propose node has the proofs ready to go, if it's bandwidth limited, then it's unlikely it would be able to broadcast the blobs timely",
        "created_at": "2024-09-06T06:11:39.673000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You would only need to wait for block header if the proposer can't publish the proofs at 0s . If it has the proofs ready to go, it can be propagated in parallel with the block",
        "created_at": "2024-09-06T06:24:27.541000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "but if the proposer if bandwidth limited, it may take longer for them to propagate the blobs than for a supernode to compute and publish right?",
        "created_at": "2024-09-06T06:26:45.904000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "If nodes can participate on mainnet right now, they should be able to broadcast columns at the current blob count. I don't think bandwidth constraint will be a bottleneck unless we start raising the blobcount. The issue is the compute power of most nodes in the network at the current count of 6. It will always be added latency to compute these column proofs",
        "created_at": "2024-09-06T06:32:06.363000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "oh ok, I've been assuming 16 / 32 blobs on these discussions, I think we'd want to raise blob count when we ship peerdas?",
        "created_at": "2024-09-06T06:38:22.308000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Its likely that the blobcount will change. I don't know if we will be going as high as 16/32 , but even with 3/6 this is an issue. With bandwidth being *manageable* . For self-building to continue being viable, we should not rely on having the proof computation happen in the critical path",
        "created_at": "2024-09-06T07:03:21.197000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003cfradamt\u003e Have there been further benchmarks of how long proof computation takes on a node while it's busy doing other stuff in its proposal slot?",
        "created_at": "2024-09-06T07:07:38.323000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I don't have exact benchmarks but it does appear to be roughly 600ms on my node for about 6 blobs in kurtosis.",
        "created_at": "2024-09-06T07:13:49.298000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I expect mainnet would be a different case, we could possibly measure this on mainnet/testnet nodes by computing columns when proposing the block. Holesky would be a good candidate",
        "created_at": "2024-09-06T07:14:18.399000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@520034910149410861\u003e The chart here doesn't show enough granuarity (will fix the buckets), but it shows that computation time falls between 250ms - 500ms on a 16core cpu for both 8 blobs, and 16 blobs. This node runs 64 validators and also perform distributed blob building on a small devnet. Will be interesting to see it on holesky though.",
        "created_at": "2024-09-06T10:18:51.545000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "image.png",
                "content": "f20ae4e381e7b71559ccfb4230f526fb9cef381e057f710f74a0c0c948d6b226"
            }
        ]
    }
]