[
    {
        "author": "cskiraly",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The diff of 1D and 2D in code is small. In fact all our simulators do 2D, and  we use them in 1D mode by setting one of the dimensions to size 1, or something larger with N=K",
        "created_at": "2024-07-27T06:30:03.922000+00:00",
        "attachments": null
    },
    {
        "author": "cskiraly",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "One might think peer count is an issue, but you can start by 64x64 instead of 128 columns, and you are better off in finding peers for a given cell, since either column match or row match is good for you",
        "created_at": "2024-07-27T06:31:56.765000+00:00",
        "attachments": null
    },
    {
        "author": "cskiraly",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So the probability of not having a peer for a given segment is actually less in the 2D case",
        "created_at": "2024-07-27T06:32:59.449000+00:00",
        "attachments": null
    },
    {
        "author": "cskiraly",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@194432762315407360\u003e , on GossipSub, in the ideal case, each message traverses each mesh link exactly once. From the node's perspective, you either receive on a mesh link, or you send on it. So when you say `S*D`, I suppose you mean the sum of inbound and outbound traffic. Otherwise it would be `S*D/2`, on average.\nThen, there are extras:\n- the IHAVE/IWANT traffic. On this I have some stats. I have added the metrics a few years ago, and I see not all are enabled on nodes running currently, but you can get some here https://metrics.status.im/d/BIfreAX7k/gossipsub-test-experimental?orgId=1\u0026refresh=15m\u0026var-instance=linux-02.ih-eu-mda1.nimbus.mainnet\u0026var-container=beacon-node-mainnet-stable-01\u0026from=now-24h\u0026to=now\nWe receive IWANTs for 10 messages (not 10 IWANT messages, but requests to send 10 messages) on average per second. Compare this to the 1000 unique messages forwarded per second. So your `R` is quite low, at least in normal operation, where IWANT based recovery is not needed. \n- some links are traversed not once, but twice by a message, in both directions, due to information delay. We receive a first copy, forward it to a peer, but the same peer is also sending it to us before the message arrives to it. On the specific node this amounts to 30%, but this can vary a lot based on the resources of the node, and thus how \"good\" is the position of the node in the mesh. Some techiques (IDONTWANT, cancel in app queue) aim to reduce this.",
        "created_at": "2024-07-27T18:42:51.474000+00:00",
        "attachments": null
    },
    {
        "author": "cskiraly",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Oh, I just see Yiannis has quite different numbers for R. I have done the patches a long time ago, but the dashboard is fresh .... so I wonder where is the difference coming from.",
        "created_at": "2024-07-27T18:49:46.081000+00:00",
        "attachments": null
    }
]