[
    {
        "author": "bridge-bot",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003cfradamt\u003e Wrote this document with Luca and Roberto to discuss some of the fork-choice related challenges of DAS: https://notes.ethereum.org/@fradamt/das-fork-choice\nIn particular, the first attack (a stronger ex-ante reorg) shows the need for a sufficiently high custody if we use the trailing fork-choice, while the second attack relies on being able to trick proposers into thinking that unavailable blocks are available, and is quite annoying because it doesn't require controlling a lot of stake. \nWe discuss using the (block, slot) fork-choice to improve things and talk about a concrete spec modification, including a backoff scheme, but ultimately this still does not completely eliminates the problems, just makes the attacks more difficult",
        "created_at": "2024-05-07T15:41:51.324000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Ahh crap I wrote in the wrong channel",
        "created_at": "2024-05-07T15:52:30.660000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@520034910149410861\u003e just browsed this https://notes.ethereum.org/@fradamt/das-fork-choice, if you do go with (block, slot) or simiilar, could you please review the implementation for epbs that already has a (block, slot, payload_present) voting system? we are implementing that one, have that python version out and will soon open a PR to prysm to implemennt the Go version",
        "created_at": "2024-05-07T15:53:17.821000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I will review your proposal there to see if it's imcompatible with what I have, I would want to agree on incompatibilities early on so as to not be in a 7547+3074 situation again",
        "created_at": "2024-05-07T15:54:27.971000+00:00",
        "attachments": null
    }
]