[
    {
        "author": "parithosh",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Isnt note 2 true if the malicious node advertises that it’s syncing forever? Or do you request data from syncing peers?",
        "created_at": "2025-06-11T08:50:07.705000+00:00",
        "attachments": null
    },
    {
        "author": "cskiraly",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Regarding note 1, we've discussed it with \u003c@833706406699073536\u003e and others after the breakout yesterday. To put things in perspective:\n- the bitmaps would allow us to do least frequent chunk based scheduling, which is well known to be more efficient than a strictly ordered backfill.\n- as an analogy, you can think of the video streaming solutions built on bittorent tech. You have the option to use \"normal chunk scheduling\", \"in-order download\", and even prioritize \"first and last chunks\". Each has its reasons and performance characteristics. \n- the main question is what value do we associate with various parts of the history within the 18 days. We've already said that the head (filling forward) is more valuable than backfilling. But is there a difference in going back? Is recent backfill history more valuable than the part 18 days ago, which will soon just fall out of the window? I don't think we have a clear answer to this at the moment.",
        "created_at": "2025-06-11T15:58:56.588000+00:00",
        "attachments": null
    },
    {
        "author": "cskiraly",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I hope I've summarized things correctly 🙂",
        "created_at": "2025-06-11T16:04:02.095000+00:00",
        "attachments": null
    },
    {
        "author": "__kasey__",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "My suggestion was to add something like the following:\n```\nclass Status(Container):\n    ...\n    columns_available: List[AvailableColumns, N]\n```\nWhere `AvailableColumns` looks like:\n```\nclass AvailableColumns(Container):\n    minimum_slot: Slot\n    columns: Bitvector[128]\n```\nThis would be useful for ordinary cgc increases, where the beacon node has some set of columns only recently, and others perhaps going back to the beginning of the retention period.",
        "created_at": "2025-06-11T16:11:32.231000+00:00",
        "attachments": null
    },
    {
        "author": "__kasey__",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Note that I would love to replace all of our rpc requests that use column indices with bitvectors as they would also make by-root and by-range requests far more compact. I also think it would be nice to allow by-range requests to specify a list of something like `AvailableColumns` values to give us more flexibility to deal with situations where we are missing part of a batch for some columns (eg we got a partial batch from a peer when range syncing, or we are backfilling across the epoch where custody requirements changed).",
        "created_at": "2025-06-11T16:11:39.882000+00:00",
        "attachments": null
    }
]