[
    {
        "author": "fradamt",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Coming back to this, imo in the short term there isn't much of a reason to go to 2D. For a few reasons:\n- We can first get a lot of efficiency gains by just minimizing the networking overhead (duplication factor in particular), which is currently very high. This could for example look moving to to pull-based gossip or to peer sampling. The ROI here is much higher than big architectural changes.\n- Looking at the last table in the post above, 2D is about ~3x more efficient than 1D with 32 field elements per cell (1/2 the current). However that's only considering the samples themselves, and not the data distribution. I think a minimal distribution would be 1 row and 1 column per node, versus 1 row in 1D (we want to add this for distributed reconstruction). The table in the picture takes into account custody as well, and as you can see 1D is only ~50% worse with 32 field elements per cell. Imo in the short term it neither makes sense to try to get this extra efficiency by moving to 2D, nor by cutting the cell size down much more than 2x for 1D (at the cost of more computational overhead from proof computation and verification). I think we should most likely move to 32 field elements per cell, but beyond that (even after having reduced the networking overhead) I think it's worth focusing efforts elsewhere instead (e.g. the mempool and its integration with the rest of the system). \n\nEventually 2D is better if we want to increase the blob count a lot more, because 1D efficiency just scales with blob count while 2D only does for the custody part (though we could first increase the size of blobs as well). However imo there just isn't a lot of urgency to go there quite yet.",
        "created_at": "2025-08-04T10:37:40.709000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "image.png",
                "content": "e6b79d00710ac488c330df7dcc2895938dc470fddfecbe554309ee084ad55cee"
            }
        ]
    }
]