[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's not ELs, this specific problem is  just golang and in particular just geth. Geth doesn't like the library Prysm uses, we understand, we have to maintain our own fork and have started a different library ourselves. But Peter also wrote his own and that seems to be abandoned. In other circumstances I would advice champions to just write the library for geth, but the problem is in this case that everyone has their own taste on these kinds of libraries. You can literally write a very fast and compliant ssz library in less an 3 days (\u003chttps://github.com/OffchainLabs/sszpp\u003e) but for a client with ten developers you'll probably need ten different libraries, one for each one of them",
        "created_at": "2025-11-08T00:45:00.985000+00:00",
        "attachments": null
    },
    {
        "author": "samyxandy",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah \nthanks for that info \nthe problem has been geth and its unwillingness to get ssz into the el which is bcoz they dont have a ssz lib they like (with peters being abandoned )\nand repeating what you said \n\"with ten developers you'll probably need ten different libraries\" will also be a problem with csharp and nethermind  \nthey had \nhttps://github.com/NethermindEth/cortex-ssz\nbut its abandoned too\nwe would need an effort from the el teams to get ssz libs they like and will be willing to use moving forward",
        "created_at": "2025-11-08T13:08:50.715000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Cross-layer",
        "parent": "",
        "content": "Justin from Besu also spoke against SSZ in the last call, so it's not as simple as one or two devs on the geth team.",
        "created_at": "2025-11-08T18:37:37.895000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Cross-layer",
        "parent": "",
        "content": "SSZ touches almost everything, so there really needs to be a high level of reward.",
        "created_at": "2025-11-08T18:40:38.788000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I did not say that the geth team is the only opposed. Neither am I advocating for this in this fork, I understand that scoping is complicated and the fork is already a bit large. I only contested the EL\"s\" with respect to the sentence on production libraries: there's one client that lacks one (I'm pretty sure Erigon will do the same thing they did with Caplin).",
        "created_at": "2025-11-08T20:22:43.776000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Cross-layer",
        "parent": "",
        "content": "I wanted to make it clear that the library isn't the only stopper, and if that truly was the case pushing it through over that objection would be viable.  But the number of places SSZ touches is very high, and I am of the opinion it's too high risk in a release where there is talk of substantial to total gas schedule alterations in the EVM.",
        "created_at": "2025-11-08T20:35:06.953000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Cross-layer",
        "parent": "",
        "content": "If a SSZ transition happens I think the most likely place it would succeed is paired with zkEVM block production and validation.  Stand alone this would be a maybe given the effort/reward but paired with any other substantial work other than the zkevm changes I would be surprised if it got scheduled.",
        "created_at": "2025-11-08T20:39:10.680000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Cross-layer",
        "parent": "",
        "content": "Does SSZ encoding make zk easier or harder?  That's a critical open question.",
        "created_at": "2025-11-08T20:42:48.438000+00:00",
        "attachments": null
    }
]