[
    {
        "author": "barnabasbusa",
        "category": "Cross-layer",
        "parent": "",
        "content": "Wouldn’t you still need to run a node to get the lightclient functionality in your wallet? Or how would pureth magically solve unavailable RPCs?",
        "created_at": "2025-10-21T05:06:21.395000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "pureth allows verification of the RPC responses (the helios style lightclient would live inside the wallet and verify). meaning you are no longer bound to a small number of trusted servers, but can use any public RPC that's out there. same goes for the things that currently need indexers. For example, raw eth_getLogs currently is quite unreliable / incomplete / slow to use, so even for basic use cases such as wallet history a trusted indexer is needed today. dropping the need to use trusted servers for basic use cases means backups are available",
        "created_at": "2025-10-21T07:33:20.212000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "Cross-layer",
        "parent": "",
        "content": "how can you not use any public rpc right now?",
        "created_at": "2025-10-21T07:34:00.282000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "Cross-layer",
        "parent": "",
        "content": "You can go to settings and change rpc endpoint manually",
        "created_at": "2025-10-21T07:34:12.664000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "Cross-layer",
        "parent": "",
        "content": "Wouldn't helios style lightclient also need to connect to those same public RPCs to be able to verify the proofs? \n\nSo if lets assume all the public RPCs are hosted on AWS, you are still kinda fucked.",
        "created_at": "2025-10-21T07:35:14.982000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "run your own node for mainnet!",
        "created_at": "2025-10-21T13:41:02.924000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "gradually less feasible for some people as EIP-7870's requirements become more real. Not speaking for \u003c@881905303011086387\u003e here but this is why I view pureth as a scaling (meta) EIP precisely for that reason",
        "created_at": "2025-10-21T13:46:30.102000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "you need a trusted one, today's wallets don't verify anything that the RPC tells them",
        "created_at": "2025-10-21T13:57:21.971000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "No, with Helios you can connect to _any_ public RPC, not just trusted ones. That's the point of it!\nAnd if AWS down, anyone can simply spin one up on Google Cloud, and then just point to that one (it cannot trick you into fake data)\n\nHowever, Helios today is artificially limited by API inefficiencies (e.g., require download of multiple receipts to obtain gas_used etc), and incomplete data (e.g., logs are not feasible to verify, and are also incomplete regarding ETH transfers and staking rewards)",
        "created_at": "2025-10-21T13:57:52.426000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "and your own indexer? because even with the own node, it's not feasible to obtain a history of all ETH transfers pertaining to your wallet. you have to trace every single transaction for side effects using debug API to find out if someone sent you ETH with a SELFDESTRUCT/SENDALL in some tx (that's what the exchanges have to do to detect user deposits from certain smart contract wallets)",
        "created_at": "2025-10-21T13:58:58.912000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I was replying to your post with metamask. I do not need an indexer for my wallet",
        "created_at": "2025-10-21T14:07:46.918000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "if my bank would ask me to buy, run and maintain my own piece of hardware, and then still show me a balance that isn't _exactly_ the sum of all historical transfers in/out, it would freak me out quite a bit... but I guess, that prioritization differs for the various types of users",
        "created_at": "2025-10-21T14:21:36.122000+00:00",
        "attachments": null
    }
]