[
    {
        "author": "pk910",
        "category": "Cross-layer",
        "parent": "",
        "content": "I've been implementing the progressive types into my dynamic-ssz library. \nThe core progressive merkelize code is just about 150 additional lines, so not utterly complex, but it's the part that needs to be properly tested before use.\n\n\nBigger part of the change is to hook it up, how to mark structs and lists as \"progressive\",  how to mark inactive fields,  etc. \nThat's not complex,  but might break on a logical level as we're overloading base types with multiple variants. (Like a container or list can now be progressive or \"normal\").\nThat's not really something that needs to be audited, but can be hard for ssz libs to implement \"nice\" solutions.\n\nI think we're a bit stuck in a loop.  SSZ libs won't implement it as long as it's not needed, but it's too complex to implement, audit, test \u0026 hook it up into the client with all the related beacon type changes in the timeframe of one fork - especially if it's already packed with complex changes like epbs..\nNot sure how to break that loop. it might help to commit to it that it will come in fork n+2 (`h*`), so ssz libs have enough time to get ready till `h*` implementation phase?",
        "created_at": "2025-12-12T12:43:42.733000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "Cross-layer",
        "parent": "",
        "content": "We just CFI-ed the EIP, which means SSZ libs have a clear signal to start implement these changes ASAP. \n\nIf the ssz libs won't implement the changes even after a CFI, then they won't certainly touch it for n+2 forks. I don't think there is much more we can do to signal to ssz libs to implement the change NOW. \n\nSo I'd call on every ssz lib to get the changes in and start testing right now. If it seems unreasonable within the timeframe, then we can always push it to the next fork, but I wouldn't start with the mentality to lets not even try for glamsterdam, because then we for sure won't have it.",
        "created_at": "2025-12-12T12:54:10.527000+00:00",
        "attachments": null
    },
    {
        "author": "pk910",
        "category": "Cross-layer",
        "parent": "",
        "content": "I've not intended to exclude it from `g*`  😄\nI'd like to have it in `g*`,  but I do see the problem with missing support in SSZ libs to start with..\nSo yea, if we can make SSZ libs start moving NOW, that would be awesome",
        "created_at": "2025-12-12T12:55:58.143000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "regarding testing, 7688 has only changes to merkleization, not to serialization, so the network / DB formats stay unchanged.\nprog-lists don't have a max capacity with the new hash tree shape; they just grow to whatever size is actually needed, so capacity checks are now explicit rules. added spec tests for each. spec PR is here: https://github.com/ethereum/consensus-specs/pull/4630\n\nthere's 1 open feedback about whether to keep the progressive shape left-heavy (current) or change it to right-heavy.\n- left-heavy is a bit simpler for multi-proofs, DFS iteration hits deeper tree firsts allows for so a simple algo that remembers a single intermediate hash and keeps mixing in hashes from the right across all data types\n- right-heavy is a bit simpler for incremental tree construction, as the left side of the tree can be fully frozen / summarized, so same strategy can be reused across both the \"stem\" of fully finished trees, and also the latest tree still under construction.\n\nso far, got 1 voice for both left/right, plus 2 that are neutral. if there's more support for right-heavy, will do that change after the holidays as top prio. this doesn't interfere with \"implement these changes asap\" (annotations etc don't change), but changing hashes to right-heavy would need to be done in a coordinated fashion. as new impls are made, post thoughts about left vs right. that's the only Q still open.\n\n\u003c@755590043632140352\u003e \u003c@1035747431461167125\u003e I'll look into light client spec bump for gloas once #4630 is in (so I don't have to do it twice).",
        "created_at": "2025-12-12T14:54:39.369000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think you may want to wait a bit on gloas, \u003c@592004585506340885\u003e is working on a rather big PR to change the status of builders to be non-validators. This will be a big change on the spec so probably better if you wait on a decision on that.",
        "created_at": "2025-12-12T14:56:54.287000+00:00",
        "attachments": null
    }
]