[
  {
    "author": "kevaundray",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "yep exactly -- I think both will also be for mandatory proofs too, but it is possible to add them beforehand (would defer to <@402080271563751435> )",
    "created_at": "2026-01-30T16:54:53.201000+00:00",
    "attachments": []
  },
  {
    "author": "taulepton_",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "I think both proposals are reasonable. However, they both implicitly suggest that the component responsible for building payloads also supports proof generation. That may well be the optimal design in the future, but currently, they are separate components. \n\nIn the first iteration, I propose that we keep things as simple as possible with the two components decoupled. The execution node acts as the payload builder with no changes to the pre-existing engineAPI, and zkboost acts as the proof verifier and generator, implementing only engine_newExecutionProof and engine_requestProofs. \n\nI think it's constructive to continue with these conversations as we build up a list of potential optimisations/modifications for future iterations.",
    "created_at": "2026-01-30T17:56:52.259000+00:00",
    "attachments": []
  },
  {
    "author": "taulepton_",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "The note on parallel payload/proof dissemination is particularly interesting and important, as payload generation and proof generation times are inherently different. My instinct tells me that payloads and proofs should be disseminated as soon as they are ready (instead of waiting for the complete set). Whether this is adhered to in practice is an open question and I would like to dive into the gloas spec in more detail. If a builder has generated a payload but has low confidence that they will be able to compute and disseminate proofs in time for inclusion, then they may instead decide to withhold the payload (to prevent leaking order flow).",
    "created_at": "2026-01-30T18:04:45.898000+00:00",
    "attachments": []
  },
  {
    "author": "kevaundray",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "> If a builder has generated a payload but has low confidence that they will be able to compute and disseminate proofs in time for inclusion, then they may instead decide to withhold the payload (to prevent leaking order flow)\nThis is in a world of mandatory proofs and BiB right?",
    "created_at": "2026-01-30T18:17:54.320000+00:00",
    "attachments": []
  },
  {
    "author": "taulepton_",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "Yes, this would be for mandatory proofs where the inclusion of the payload depends on network-wide availability of the proofs.",
    "created_at": "2026-01-30T18:20:37.253000+00:00",
    "attachments": []
  }
]