[
  {
    "author": "m.kalinin",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "as of today payload reveal deadline is 3 seconds before the start of the next slot, payload verification deadline is the start of the next slot -- so the proposer of the next slot can build a block atop of that payload; and 4 seconds into the next slot attesters to attest to the payload reveal in the previous slot. should this timeline keep payload should rather be released first, then proofs",
    "created_at": "2026-01-31T04:24:41.769000+00:00",
    "attachments": []
  },
  {
    "author": "m.kalinin",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "could you please explain what mandatory proofs mean?",
    "created_at": "2026-01-31T04:25:16.355000+00:00",
    "attachments": []
  },
  {
    "author": "m.kalinin",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "do you also want to keep the decision making logic about payload validity on the zkboost side for now? Or implement it on the CL side from the beginning?",
    "created_at": "2026-01-31T04:30:56.516000+00:00",
    "attachments": []
  },
  {
    "author": "taulepton_",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "<@425572898787426305> mandatory proofs is a hardfork in which we mandate that every consensus node must verify proofs before attesting to blocks. optional proofs is what we are currently working on, this is an opt in feature for validators where they can chose to use execution proofs to verify blocks. mandatory proos is the natural progression after we have landed optional profos and build confidence.",
    "created_at": "2026-01-31T07:35:12.426000+00:00",
    "attachments": []
  },
  {
    "author": "taulepton_",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "I am keeping it in the CL from the beginning. This does not mean it has to remain this way forever, but based on conversations with yourself, kev and others, there seems to be a general consensus that keeping payload validity in the CL is preferred to keep zkboost stateless and simple.",
    "created_at": "2026-01-31T07:38:20.389000+00:00",
    "attachments": []
  }
]