[
    {
        "author": "thegostep",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hey everyone!\n\nWe are making good progress on MEV-Boost implementation and have open sourced the first version which has the basic functionality required to run on the kintsugi testnet: https://github.com/flashbots/mev-boost\n\nWe are now working on integrating this into merge mock on top of the lighthouse client: https://github.com/sigp/lighthouse/pull/2795\n\n\u003c@!361447803194441738\u003e  has prepared a document which outlines the consensus client changes and is looking for feedback from research and client teams as early as possible: https://hackmd.io/@paulhauner/H1XifIQ_t\n\n\u003c@!552133098075193354\u003e has scheduled a workshop on Dec 9th at 2pm UTC for client devs to come together and discuss MEV-Boost: https://github.com/ethereum/pm/issues/423",
        "created_at": "2021-11-23T12:16:04.820000+00:00",
        "attachments": null
    },
    {
        "author": "thegostep",
        "category": "Cross-layer",
        "parent": "",
        "content": "Touching on this question from \u003c@!573787335796326400\u003e\n\nThe problem with returning the beacon block with body back to the validator (as discussed by \u003c@!363800010518822915\u003e and \u003c@!144468805697929216\u003e on ethresearch) is that it will deanonymize the validator ip address to the relay. \n\nThis is one of the two main design decision remaining for mev-boost: are we OK with leaking ip address of the validators to the relay? If yes, we can avoid messing around with custom libp2p channels, provide forkChoiceUpdated calls to the relay, and receive beacon blocks back from the relay. This reduces implementation complexity significantly but would require validators to setup reverse proxies if they want to protect against potential targeted dos attacks.\n\nThe way MEV-Geth works today is with this reverse proxy setup and miners have been happy with this approach. Similarly, I've investigated how other networks address this issue of deanonymization and for other POS chains it is quite common for validator IPs to be publicly known. Speaking to validators on these chains, they have not had any issues with targeted dos.\n\nThe current plan is to provide a \"default\" implementation which uses libp2p for sending messages to the relay, but to allow validators to enable direct communication if they are confident with their ability to maintain a secure reverse proxy (which I expect will be the vast majority of the network). From my perspective, it's up to the eth researchers + implementers to decide if it's worthwhile to build this libp2p stuff or if the reverse proxy approach is sufficient.",
        "created_at": "2021-11-23T15:11:14.783000+00:00",
        "attachments": [
            {
                "type": "image/jpeg",
                "origin_name": "IMG_AB44A2FFE8D7-1.jpeg",
                "content": "d55d978e555e1ca33de82bc3b23da5e4bbcb1af1193dcd51b79636f3c45f84e7"
            }
        ]
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "Given this time slot isn’t great for Australia, would folks prefer 20:00 UTC? That might be better for them and slightly worse for Europe.\n\n1️⃣ 14:00 UTC \n2️⃣ 20:00 UTC",
        "created_at": "2021-11-23T21:51:17.359000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Oh I voted originally 1, but then I realized that the author of one of the documents is in that timezone",
        "created_at": "2021-11-23T23:40:36.147000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Cross-layer",
        "parent": "",
        "content": "We are choosing between midnight and 7am for people in Sydney so with developers it can be a little hard to know which they'd prefer.  Personally I'm a morning person and midnight meetings really knock me about.",
        "created_at": "2021-11-23T23:44:29.744000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Cross-layer",
        "parent": "",
        "content": "actually in Sydney it's 1am and 7am sorry.",
        "created_at": "2021-11-23T23:44:42.029000+00:00",
        "attachments": null
    }
]