[
    {
        "author": "paulhauner",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks for timezone considerations, much appreciated \u003c@!552133098075193354\u003e",
        "created_at": "2021-11-25T05:47:30.735000+00:00",
        "attachments": []
    },
    {
        "author": "paulhauner",
        "category": "Cross-layer",
        "parent": "",
        "content": "Regarding this, it's going to be a real push to get all the gossip topics working before the merge. I'm primarily concerned about failures on the MEV topics causing network segmentation that might affect block/attestation propagation.",
        "created_at": "2021-11-25T05:49:15.899000+00:00",
        "attachments": []
    },
    {
        "author": "paulhauner",
        "category": "Cross-layer",
        "parent": "",
        "content": "Providing validator privacy via new gossip topics isn't fully solved either. It's quite simple when we want to send a message from the validator -\u003e flashbots because gossip nodes can use a validator signature to verify gossip messages.\n\nHowever, it's difficult when we do flashbots -\u003e validators comms (e.g., providing an `ExecutionPayload`) since we don't have a good method to stop people spamming that channel. An obvious solution is to keep a \"registry\" of keys for Flashbots/block-builders and require their signature on gossip messages, but that comes with a bunch of issues as well (e.g., how to come to consensus on that registry).\n\nThe document I wrote solves flashbots -\u003e validators comms by just having the validators spam flashbots with requests, so they can't tell who *really* wanted it. This is quite wasteful and doesn't scale so gracefully.",
        "created_at": "2021-11-25T05:59:41.551000+00:00",
        "attachments": []
    },
    {
        "author": "paulhauner",
        "category": "Cross-layer",
        "parent": "",
        "content": "One option regarding flashbots/block-proposer publishes to gossip is to require each of them to have a validator and then sign it with *that* keypair. However, it means they need to have that validator client running somewhere (and signing consensus messages) and then probably another instance to sign messages going on gossip. That's getting into complex and risky territory IMO.",
        "created_at": "2021-11-25T06:02:08.221000+00:00",
        "attachments": []
    },
    {
        "author": "thegostep",
        "category": "Cross-layer",
        "parent": "",
        "content": "cc \u003c@!153709109122826240\u003e",
        "created_at": "2021-11-25T10:26:45.576000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I never really understood what are the cons to the idea of block builders being validators. On the pros you can have every beacon block have a `PoposerInder` and a `BuilderInder`, only randao decides the first and this one decides by whatever method (for example taking bids) who gets to be the second. The builder is subject to slashing if the proposer provides proof that it didn't pay. On the cons you have MEV enshrined in the protocol, but this seems unavoidable to some degree at least",
        "created_at": "2021-11-25T10:28:11.353000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "We don't know which searchers will find the most valuable opportunity for any given block, so it is unlikely that the chosen block builder would also happen to have found the best solution for that block.",
        "created_at": "2021-11-25T10:56:50.959000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "We specifically want to find the best \"solution\" to each block, or else people will do exactly that outside the protocol.",
        "created_at": "2021-11-25T10:57:40.334000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think the point is that builders can still supply their proposed block (or hash of it, or whatever) with a bid attached, and the proposer can take whichever one it wants and enshrine it in to the block as a \"this is the builder that gave me the block\".",
        "created_at": "2021-11-25T11:01:14.315000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I didn' t understand this comment",
        "created_at": "2021-11-25T11:01:15.229000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "I tend to agree that searchers and relays have a free ride in terms of there being no in-protocol mechanism to punish badly behaving ones, and requiring them to be validators and adding slashing conditions to their actions would address many concerns.  Although I haven't considered what those slashing conditions would be.",
        "created_at": "2021-11-25T11:03:32.029000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "I also haven't seen anyone provide a rationale that, given the proposer/builder separation is likely to make it in to the protocol, if it makes sense to carry out this band-aid approach in the meantime.",
        "created_at": "2021-11-25T11:04:31.462000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think there is a big difference between, \"searchers should be bonded and slashable\" and \"searchers should be validators\".",
        "created_at": "2021-11-25T11:04:44.837000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sure, but the latter is a simple way to achieve the former with minimal changes to the protocol.",
        "created_at": "2021-11-25T11:05:18.495000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "And also with a bunch of extra benefits as making the builders being more committed to the whole ecosystem",
        "created_at": "2021-11-25T11:05:42.609000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I strongly oppose conflating things like that.  I think we would be far better off having isolated systems rather than trying to have one mechanism serve two masters.",
        "created_at": "2021-11-25T11:05:52.914000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "But besides general design arguments, is there a concrete dissadvantage?",
        "created_at": "2021-11-25T11:06:26.891000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Like what about searchers who don't have 32 ETH and a 1 ETH bond would be plenty?  Searchers also shouldn't have to setup/configure validation just to be searchers (which for some people is easier).",
        "created_at": "2021-11-25T11:07:11.367000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Incentive alignment.  We want the bonds to be appropriately sized for the job in question, not sized as the `max(all jobs)`.",
        "created_at": "2021-11-25T11:07:50.243000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "We also want people to only have to configure and manage the piece that matters to them, not have to configure and manage a bunch of pieces they don't care about.",
        "created_at": "2021-11-25T11:08:16.588000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "searchers already configure and setup a big chunk of the validator: the whole execution engine and even a custom one, setting up a validator I claim is a minor thing and the benefits outweighs the discomfort of having to to so",
        "created_at": "2021-11-25T11:09:39.797000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "(Just noticed that I said \"searchers\" above when I meant \"builders\".  I don't have a problem with searchers being unbonded, as they can't do anything bad to the network (flooding attacks aside), but builders are a major protocol actor and should be treated as such.)",
        "created_at": "2021-11-25T11:13:02.887000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah I'm also referring to them intercheangably, but I mean builder, the one that actually submits a block with its own signature identifying it",
        "created_at": "2021-11-25T11:14:26.214000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "so that the proposer signs on top of that and submits",
        "created_at": "2021-11-25T11:14:44.400000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "We generally use \"execution payload\" rather than \"block\" in this context, in an attempt to disambiguate.  But yeah, I think we're saying the same thing.",
        "created_at": "2021-11-25T11:15:18.851000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "Moved to 20:00 UTC - GitHub issue and Google Calendar both updated 👍",
        "created_at": "2021-11-25T16:55:51.096000+00:00",
        "attachments": []
    },
    {
        "author": "ranisis",
        "category": "Cross-layer",
        "parent": "",
        "content": "thanks for the review, I’d be happy to help get a PR merged",
        "created_at": "2021-11-25T17:16:39.567000+00:00",
        "attachments": []
    }
]