[
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@607055410104500244\u003e are you seeing rejections for the builder messages or consensus messages? the relay should support the kiln fork version if it is verifying any consensus messages although i don't know if it is and haven't tried it yet myself",
        "created_at": "2022-05-28T00:28:21.848000+00:00",
        "attachments": []
    },
    {
        "author": "ruteri",
        "category": "Cross-layer",
        "parent": "",
        "content": "The only consensus message is the signed blinded block (post to blinded blocks), and while the relay uses kiln fork version the signature check is disabled for now since only the current proposer is allowed to get the block per spec, and it’s not the best for testing. As soon as we have something going I’ll enable the verification to make sure we have the correct signatures.",
        "created_at": "2022-05-28T06:42:17.223000+00:00",
        "attachments": []
    },
    {
        "author": "realbigsean",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is using compute domain from the consensus spec, which uses genesis fork version when the fork version isn’t passed in.  In the page where compute domain is defined in the consensus spec is looks like it’s hard-coded to 0x00000000 but there’s this note:\n\n`Note: The default mainnet configuration values are included here for illustrative purposes. Defaults for this more dynamic type of configuration are available with the presets in the configs directory. Testnets and other types of chain instances may use a different configuration.`",
        "created_at": "2022-05-28T13:23:47.106000+00:00",
        "attachments": []
    },
    {
        "author": "realbigsean",
        "category": "Cross-layer",
        "parent": "",
        "content": "So as the builder spec is written now we should be using the kiln config for builder messages too which is right imo.",
        "created_at": "2022-05-28T13:27:17.363000+00:00",
        "attachments": []
    },
    {
        "author": "realbigsean",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks! I will probably raise an issue",
        "created_at": "2022-05-28T13:28:37.389000+00:00",
        "attachments": []
    },
    {
        "author": "realbigsean",
        "category": "Cross-layer",
        "parent": "",
        "content": "Validator registrations",
        "created_at": "2022-05-28T13:28:55.693000+00:00",
        "attachments": []
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "BuilderBid is fork versioned, but it's exchanged via API. I think it could be a bit confusing if the domain should be  `compute_domain(BEACON_PROPOSER, fork_version, genesis_validators_root)` or `compute_domain(DOMAIN_APPLICATION_BUILDER)`. In current mergemock implementation the latter seems to be used, which makes sense to me. IMO could be good to have a table reporting domain per object.",
        "created_at": "2022-05-28T15:57:25.141000+00:00",
        "attachments": []
    }
]