[
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "Does anyone care about picking gas limit vs. gas target? After EIP-1559, gas limit became a second order effect of the chosen target multiplied by the elasticity parameter. Feels more natural choose a gas target in that case. But in reality, many people are only aware of the gas limit?",
        "created_at": "2022-04-30T09:16:39.900000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@543900561460822016\u003e I would try and mimic what clients pick (IIRC, the gas limit), so that there aren't two types of parameters passed around by different actors",
        "created_at": "2022-04-30T16:57:45.134000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "you don't want to accidentally send a value that's 2x higher/lower than what you meant because the other thing you're interacting with interprets it as target instead of limit or vice versa.",
        "created_at": "2022-04-30T16:58:33.952000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "let's assume we are in a world with multiple relays who are all well-connected (in a networking sense) to a diverse set of block builders\n\nwhen i query my known relays in `mev-boost` i get back many headers in this world and can pick the most valuable one\n\ni can signal my selection (i only get one) by building the rest of the block around it and releasing my signature to the relay that sent me the header\n\ni have a question about the data flow here -- should i try to submit the signed block to _every_ relay i know about, or just the *single* relay that should have the rest of the payload waiting for me?",
        "created_at": "2022-04-30T22:25:27.760000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "if i am one of these other relays i will get a blinded block and still need to go fetch the rest of it from somewhere, but there is somewhat better availability here, esp if i can go to my peered relays and fetch a full block if i can provide a valid signature",
        "created_at": "2022-04-30T22:26:00.804000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "otherwise, it would be on the validator to interact w/ this one relay and then the validator and the relay are responsible for full block dissemination on the usual channels",
        "created_at": "2022-04-30T22:28:01.959000+00:00",
        "attachments": null
    }
]