[
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "this is the relay's public key, which should be used to identify and authenticate any messages received from the relay",
        "created_at": "2022-08-22T14:35:44.020000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "flashbots just kind of adopted this scheme and the default seems to be spreading, we could also just have a table somewhere of pubkeys to URL endpoints",
        "created_at": "2022-08-22T14:36:21.964000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Not the prettiest thing to have the public key in the hostname, it may be better to put it in DNS as a separate TXT record.",
        "created_at": "2022-08-22T15:05:57.982000+00:00",
        "attachments": null
    },
    {
        "author": "yokem55",
        "category": "Cross-layer",
        "parent": "",
        "content": "It might be useful to have it in DNS like that. But it should still be able to be set via the hostname or some other manual configuration string.",
        "created_at": "2022-08-22T17:17:46.523000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Not sure what you mean by \"set\" here.  I'm talking about having a relay `relay.example.com` with a TXT record containing the hex string for the public key (with some prefix to differentiate it) rather than having it in the hostname.  It shouldn't be possible for external entities to set this information manually, as it is fully owned by the relay.",
        "created_at": "2022-08-22T17:21:02.874000+00:00",
        "attachments": null
    },
    {
        "author": "yokem55",
        "category": "Cross-layer",
        "parent": "",
        "content": "DNS on it's own is not a secure protocol. And a couple of recent defi front-end hacks have originated from hijacking the dns. It's not unreasonable to want an out of band way to authenticate the relay server that the dns is resolving to then just trusting that the dns you are getting from whoever is correct.",
        "created_at": "2022-08-22T17:25:27.838000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "That's not the question under discussion, which was why there was a public key in a DNS A record.\n\nDNSSEC is pretty secure, or fetch the address out-of-band and put it in your hosts file if you prefer.",
        "created_at": "2022-08-22T17:35:55.814000+00:00",
        "attachments": null
    },
    {
        "author": "yokem55",
        "category": "Cross-layer",
        "parent": "",
        "content": "Looking at this a little more closely, that public key is not part of the hostname - the url schema from what I can see is `https://[public_key]@hostname.relay.com` . The `@` there indicates it isn't part of the A or cname record to be resolved. But having that public key from an out of band source should make mitm attacks between mev-boost and the relay much more difficult. (As long as mev-boost uses that pubkey to check for signed messages from the relay).",
        "created_at": "2022-08-22T18:08:07.885000+00:00",
        "attachments": null
    }
]