[
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hi, for the Kiln relay, we are seeing a 10s response time to register 100 keys. We recently added batching from 1000 -\u003e 100.  Is anyone else seeing this and what's the timeline for fixing it? It's blocking us from rolling it out to Ropsten and Sepolia and beginning more testing",
        "created_at": "2022-07-08T14:31:11.682000+00:00",
        "attachments": null
    },
    {
        "author": "prestonvanloon",
        "category": "Cross-layer",
        "parent": "",
        "content": "Some data for you guys. 100 keys seems to take at least 10s on average. If our total request time exceeds 12s then it times out as a failure. This is causing noise in our alerting and monitoring which is a blocker to roll to ropsten, sepolia, and (in the future) prater",
        "created_at": "2022-07-08T15:08:23.958000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "Screenshot_from_2022-07-08_10-06-48.png",
                "content": "8cc2186e2391e84dfb29a2264ed76e0c31f7415cf812b104519f9c005f315d23"
            }
        ]
    },
    {
        "author": "prestonvanloon",
        "category": "Cross-layer",
        "parent": "",
        "content": "cc: \u003c@\u0026911292790653194300\u003e  🙏",
        "created_at": "2022-07-08T15:10:32.466000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes, we're aware and rolling out the next iteration of the relay early next week that handles the registrations much more performant",
        "created_at": "2022-07-08T15:23:07.325000+00:00",
        "attachments": null
    },
    {
        "author": "prestonvanloon",
        "category": "Cross-layer",
        "parent": "",
        "content": "OK, kindly let us know when that is ready. We are blocked on further testing until that time",
        "created_at": "2022-07-08T15:26:10.175000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "ETA Monday before noon UTC",
        "created_at": "2022-07-08T15:26:19.314000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Will ping here once deployed",
        "created_at": "2022-07-08T15:26:28.157000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Btw, a thing we noticed is that one of the validator clients creates a new registration every epoch (with new timestamp), rather than reusing the previous one if nothing changed. I'd recommend to reuse, to ease the load on the relays. Not sure which one, just seeing it in the logs with batches of 1k registrations per call.",
        "created_at": "2022-07-08T15:27:20.420000+00:00",
        "attachments": null
    },
    {
        "author": "prestonvanloon",
        "category": "Cross-layer",
        "parent": "",
        "content": "Great observation. We identified this issue as well and \u003c@884836500037066862\u003e is working on it",
        "created_at": "2022-07-08T15:28:16.951000+00:00",
        "attachments": null
    },
    {
        "author": "jameshe5018",
        "category": "Cross-layer",
        "parent": "",
        "content": "ah I see my misunderstanding i thought it wanted a new time stamp even if nothing has changed. I'll go ahead and continue fixing this",
        "created_at": "2022-07-08T15:29:42.377000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hello, apologies if this is not the right channel, but since I know nothing about the eth_namespace/API I figured better ask here. Currently teams are rushing to implement MEV boost as an option. As a user, I would rather see if my local EE pays me more than the builder. Specially close to the merge where there's a monopoly. So my question is, suppose that I request a block from my EE to propose, 1) I assume the EE will have ready (or very fast get it) the state after the execution of this block? 2) Can I quickly inquire the balance (or balance change) for the fee_recipient address if this block is about to be included?.\nI'd like to gauge the difficulty or benefit of implementing this in Prysm to have the beacon decide at runtime whether it should use MEV-Boost or not. Is this hopeless/stupid? \n\nThis could even be a feature provided by flashbots to give transparency/advertisement: we could all track what would be our earnings by mocking a proposal on every slot, and then compare with the actual on-chain changes on the fee_recipient, and then shame the builder for not paying enough or praise the system.",
        "created_at": "2022-07-08T16:04:34.925000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "there is definitely intent to add some sort of payment proof to the builder bids",
        "created_at": "2022-07-08T16:29:18.891000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "and imo the local payload will always be \u003c= to the remote one so i don't personally think having a payment indication for the local payload is as high priority as other things but you are not the first person to bring this up",
        "created_at": "2022-07-08T16:30:01.485000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "i would assume the answers to (1) and (2) are both yes",
        "created_at": "2022-07-08T16:30:22.115000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "but we would need to ask individual client devs for further clarity",
        "created_at": "2022-07-08T16:30:35.879000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "if you prototype out this solution please let us know how it goes! it would inform adding payment proofs certainly",
        "created_at": "2022-07-08T16:31:34.705000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "i think it is valuable enough data to not be \"hopeless\" or \"stupid\" 🙂",
        "created_at": "2022-07-08T16:32:38.534000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "having a single party do this and make it a reputation input could be tricky as everyone will have a slightly diff view of the mempool",
        "created_at": "2022-07-08T16:33:38.477000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "On your last point - tracking whether a builder actually paid what he claimed in the bid - that's just the idea of the relay monitor \u003chttps://github.com/flashbots/mev-boost/issues/142\u003e",
        "created_at": "2022-07-08T16:50:47.541000+00:00",
        "attachments": null
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@199561711278227457\u003e let's talk about this next shadow fork. How can we help?",
        "created_at": "2022-07-08T17:00:29.648000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hey! Till now I've been handing \u003c@554799849288105986\u003e some validator keys and he's been testing mev boost on shadow forks. I'll let him chime in on whats needed for the next one😄",
        "created_at": "2022-07-08T17:27:21.359000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Oh no, I don't want to track nor confirm that the builder actually paid the bid he claimed, if they didn't this would become public quickly. I want to compare it to what I would have gotten by proposing a locally built block. This should be trivial as far as I can tell, and I think it's  in the interest of flashbots to have this if as \u003c@539495253418180618\u003e says this is expected to be always higher than the local payload. I'm hoping some EE dev can point me to how to get this information from the freshly constructed payload cause if it's not hard to get I'll add this option to prysm to decide between the locally built block and the MEV-boost bid.",
        "created_at": "2022-07-08T17:44:34.442000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "You'd need to take into account arbitrary mempool transactions to and from the feeRecipient (which change it's balance but skew comparison to mev-boost blocks)",
        "created_at": "2022-07-08T17:59:30.080000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'd expect whatever mempool the builder has to be way better than my local mempool, therefore if my local node is getting a higher paying payload it would be pretty bad shaming for the builder system",
        "created_at": "2022-07-08T18:00:43.740000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Just saying that such transactions might or might not be part of a mev-boost block, and you'd need to check that to have comparable proposer earnings for a set of block.",
        "created_at": "2022-07-08T18:02:20.501000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "but the comparison would be: the bid as the relay monitor reports, vs my own mock block, locally produced, with my own fee_recipient, I can make sure that I don't have any transactions against my fee recipient. So I am comparing what I would have gotten personally if I was a proposer in this slot, vs whatever the actual proposer got from the bid",
        "created_at": "2022-07-08T18:03:44.043000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I can have a beacon node that prepares a block for each slot does everything as it was to propose, but it just doesn't broadcast the block, we use this often to debug",
        "created_at": "2022-07-08T18:04:34.013000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sure 👍 just wanted to point out the need to remove those transactions to+from feeRecipient for the comparison",
        "created_at": "2022-07-08T18:05:29.251000+00:00",
        "attachments": null
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e I think this could be more general for evaluating builders. Like, I imagine a builder leaderboard with the profits from each of the blocks they build. And for comparison, we can have mempool builders running geth, nethermind and erigon.",
        "created_at": "2022-07-08T19:36:45.006000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "that would be very good indeed, I do not know nor even suspect how the market will go at the time of the merge, and I do not know about other clients, but the current implementation of prysm does not allow to choose between the local node and MEV-boost. And assuming that at the merge there will be a single builder hooked to flashbots, why would this builder pay much? They way I see this we are given our users the option to either run with this unique system or run with your local node, but this decision is being made at launchtime instead of on a per-block basis. And I understand that once a market is established the local node should always lose, but I don't see it so obviously at the merge.",
        "created_at": "2022-07-08T19:41:43.794000+00:00",
        "attachments": null
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e at the merge nothing changes for mev extraction. The only difference is that now the profits go to the validator and not to the miner. In proof of work the flashbots blocks are much more profitable, and the same is expected on proof of stake. That's not to say that the feature you are looking for is not necessary, of course. You are making a lot of sense. Just it doesn't sound as critical to me. To get started, let validator choose between local or remote build is good enough. And then we get fancier features on top of it as time allows.",
        "created_at": "2022-07-08T19:46:44.596000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Is the claim that whatever set of current builders now, with the same competition, will be already available and hooked to MEV boost at the time of the merge?",
        "created_at": "2022-07-08T19:49:29.922000+00:00",
        "attachments": null
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "Well, currently there is only one builder on proof of work, flashbot's. That one is already hooked to mev-boost relay and we are testing it in proof of stake networks. The claim is that in addition to that one, there will be other independent builders trying to build even more profitable blocks.",
        "created_at": "2022-07-08T19:51:50.580000+00:00",
        "attachments": null
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "My expectation is that builders will specialize in different types of mev extraction, making the result even more profitable for validators.",
        "created_at": "2022-07-08T19:52:46.712000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I understand that \"*eventually** there will be a market. But if there's only one builder, it's hard from my perspective to give my users this option without checking the fee they'll get locally at runtime",
        "created_at": "2022-07-08T19:54:12.641000+00:00",
        "attachments": null
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "I understand. And I would like to see that implemented in prysm and all clients 🙂",
        "created_at": "2022-07-08T19:55:00.395000+00:00",
        "attachments": null
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "From our side, I'm just thinking on the data transparency that will enable that leaderboard and that trust that the relay gets you more profit. And how much. And many more fun things that people can do once we have this data available",
        "created_at": "2022-07-08T19:56:07.142000+00:00",
        "attachments": null
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "💡it would be super nice if geth, erigon and nethermind ran a builder on their own infrastructure and connect it to the flashbots relay. That will give them incentives to optimize their block building combining mempool and searcher's bundles, right?",
        "created_at": "2022-07-08T19:57:28.652000+00:00",
        "attachments": null
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "This sounds obvious. 🤔 I wonder if I'm missing something equally obvious.",
        "created_at": "2022-07-08T19:58:07.649000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Alright so I can't find in the API where the validator gets to see the bid before sending the blind block to the relay, can you guys point me to it?",
        "created_at": "2022-07-08T20:01:15.298000+00:00",
        "attachments": null
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also, maybe important to clarify that there is a market now. The flashbots auction is between searchers and block producers, and it's very efficient I think. Nothing in there is specific to proof of work, so nothing will change, I expect. Soon, as in as soon as a somebody sets up a good builder, there will be an extra market adding independent builders. Eventually, there will be an extra market once more relays appear.",
        "created_at": "2022-07-08T20:04:16.905000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Wait what I'm reading from your API is that what I want is impossible. Can you confirm that the validator is supposed to send the blind block to the relay without seeing even the numbers for the best bid?",
        "created_at": "2022-07-08T20:13:09.023000+00:00",
        "attachments": null
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "Like this? https://github.com/flashbots/mev-boost/blob/main/server/service.go#L321\nIt's where mev-boost picks the most profitable relay. I guess what you want to do is similar.",
        "created_at": "2022-07-08T20:16:16.034000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Right so that will be outside of Prysm, we will need to change the MEV-boost binary to achieve this",
        "created_at": "2022-07-08T20:17:43.578000+00:00",
        "attachments": null
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "That value is returned to prysm, isn't it?",
        "created_at": "2022-07-08T20:18:23.809000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Probably register the local engine as a relayer",
        "created_at": "2022-07-08T20:18:28.193000+00:00",
        "attachments": null
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "What is missing is for prysm to run execution client, and compare the two values, but then this is not straight-forward, as Chris mentioned. Or, a local engine as relayer, but I don't know if they are planning to implement this api. It would be nice if they do.",
        "created_at": "2022-07-08T20:20:55.699000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks this gives me a place to start. I'll look into this this weekend. It'll be a welcome change from forkchoice",
        "created_at": "2022-07-08T20:22:20.173000+00:00",
        "attachments": null
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e if you want you can file this as an issue in mev-boost. I think there is nothing for us to change, but if there is it doesn't sound like a lot of work. And we can use this issue to talk to the execution clients to see if they are interested and what are their ideas or blockers.",
        "created_at": "2022-07-08T20:22:34.559000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "That will be even better :)",
        "created_at": "2022-07-08T20:23:02.457000+00:00",
        "attachments": null
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also, more than a weekend to have these discussions with everybody 😄 I'll disconnect now, I'll be back to play more Monday.",
        "created_at": "2022-07-08T20:24:40.848000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "i think you are referring to this: https://ethereum.github.io/builder-specs/#/Builder/getHeader",
        "created_at": "2022-07-08T22:00:53.694000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "we discussed on one ACD i believe the option of adding the value to the Engine API so that you could have your beacon node do the work you are looking to do",
        "created_at": "2022-07-08T22:03:08.039000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "for security reasons mev-boost is separate to the execution pathway so the APIs have diverged some but its not clear we want that in the long run",
        "created_at": "2022-07-08T22:03:36.724000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "i kind of see the point of having a specialized builder layer be exactly so we don't put this burden on the client devs\n\ni would also imagine there are legal and regulatory reasons to avoid client teams running their own builders beyond very straightforward algorithms (like it works today) -- there is some support for the cultural norm that client teams are neutral third-party providers of software and having them run builders does impute some non-neutral view which provides surface for capture",
        "created_at": "2022-07-08T22:07:45.787000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "i also think having an additional hurdle to clear in terms of *needing* to run builders to be competitive harms client diversity over time, which we want to avoid",
        "created_at": "2022-07-08T22:08:38.007000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Indeed that's what I was looking",
        "created_at": "2022-07-08T22:10:36.910000+00:00",
        "attachments": null
    },
    {
        "author": "ethdreamer",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hey \u003c@268793214906007562\u003e ,\nIs there any way flashbots could set up a mainnet relay for use on the next mainnet shadow fork? The only thing we have to test now is a mock relay (built by \u003c@607055410104500244\u003e) that just hits the execution engine and blinds the block - but it would be nice to have some actual MEV and do a real test",
        "created_at": "2022-07-08T22:58:33.142000+00:00",
        "attachments": null
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "We have to fix first the registration limits that we are hitting, because that's affecting all the testing. Then decide if we do first the infrastructure for goerli or for the shadowforks. So, yes is a good answer :) but when is this needed?",
        "created_at": "2022-07-08T23:22:13.471000+00:00",
        "attachments": null
    },
    {
        "author": "ethdreamer",
        "category": "Cross-layer",
        "parent": "",
        "content": "Whenever u guys can get it ready. Before the merge for sure 😃",
        "created_at": "2022-07-08T23:23:32.073000+00:00",
        "attachments": null
    }
]