[
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "My understanding is that in the p2p communication channel there will be a gossip network to submit blinded block with all relays subscribed to this topic. Therefore all relays will see blinded blocks that is submitted, but only one will be able to propagate full block into beacon block topic. Not sure that my understanding is correct though",
        "created_at": "2022-05-01T07:32:32.859000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "no that sounds right to me, just wondering before we deploy any kind of gossip channel if it is worth spreading the blinded block",
        "created_at": "2022-05-01T13:09:32.546000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Not sure I see the point of propagating the blinded block.  What are the benefits of doing this?",
        "created_at": "2022-05-01T13:10:54.863000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "we can improve the privacy situation for validators by replacing each of the builder APIs, currently spec'd as direct communication with relays, with gossip channels",
        "created_at": "2022-05-01T15:21:00.059000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "even under the direct comms paradigm, there is an argument to propagate the blinded block to as many relays as possible as they can also reach out to the originating relay and help gossip the full block",
        "created_at": "2022-05-01T15:22:36.192000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't see why they need the blinded block to propagate the full block.",
        "created_at": "2022-05-01T15:24:03.898000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "We also already have an existing p2p network to propagate full blocks.",
        "created_at": "2022-05-01T15:24:31.585000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "the optimization would be the situation where a relay gets the signed blinded block and can identify which relay has the full block, before the validator has time to gossip it over the usual channels \n\ni admit this may be splitting hairs",
        "created_at": "2022-05-01T18:08:46.954000+00:00",
        "attachments": null
    }
]