[
    {
        "author": "ciaranmcveigh",
        "category": "Cross-layer",
        "parent": "",
        "content": "hey quick question i was hoping you guys might know the answer\n\nWithin the ValidatorRegistrationV1 spec there's a timestamp field \n\nthe teku client is currently set up to re-register with relays on the first slot of each epoch, they effectively use time.now for the timestamp\n\ni was wondering what this timestamp field is used for, i'm guessing its for the relay to prune validators that haven't registered for a period of time? If so what is the recommended/standard \"time elapsed\" before a relay should remove a validator from its registered set\n\nhappy to read through some docs if you can link me to any that relate to this \n\nthanks for any help",
        "created_at": "2022-07-06T13:48:39.799000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "a relay never removes a validator registration. the timestamp is used for replay protection -- that a relay would not overwrite a registration with an older one. the timestamp only needs to change when the attributes change.",
        "created_at": "2022-07-06T14:03:19.438000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "our sepolia relay is now activated: https://builder-relay-sepolia.flashbots.net/\n```\n ./mev-boost -sepolia -relays https://0x845bd072b7cd566f02faeb0a4033ce9399e42839ced64e8b2adcfc859ed1e8e1a5a293336a49feac6d9a5edb779be53a@builder-relay-sepolia.flashbots.net\n```",
        "created_at": "2022-07-06T15:03:59.834000+00:00",
        "attachments": null
    },
    {
        "author": "ciaranmcveigh",
        "category": "Cross-layer",
        "parent": "",
        "content": "thanks for the response , was speaking to the teku guys and they mentioned they \"explicitly asked to allow relays to accept timestamps \u003e= of their current registration timestamps\" so they can reuse 1 signature over and over to reduce the overhead of creating a new signature every epoch on the teku node\n\nI asked the question what does a relay do if it receives a signature with the same timestamp but a different  fee_recipient given the relays accept timestamps \u003e= of their current registration \n\nthey weren't sure and mentioned \"it might not be guaranteed to use the latest, if it even accepts it\" \n\ndo you know if the relay setup to accept \u003e= given its the same payload as previous registration but must be \u003e if it's a different payload?\n\nthanks",
        "created_at": "2022-07-06T17:00:24.187000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Timestamp must be greater than the previous one for changes to take effect, else the registrations could continuously overwrite each other.",
        "created_at": "2022-07-06T17:04:13.699000+00:00",
        "attachments": null
    }
]