[
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "(1) might make sense from the configuration standpoint as it would allow stakers to set all parameters in one place and if EL client is changed there will be no need to spend time on moving configuration from the old one. But it adds the complexity to the protocol. I would prefer we have `PayloadAttributesV2` and `forkchoiceUpdatedV2` for any upcoming changes as `V1` versions are considered finalized for the Merge and are subject to change in case of design issues\n\nIs `fcU` method used by builder's software?",
        "created_at": "2022-06-07T14:02:33.607000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah a v2 makes sense if we go that route",
        "created_at": "2022-06-07T15:16:23.145000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't think fcU will be used by a production-level builder, since block production can (and should) already start in the slot before (at newPayload or what it's called). the proposer might already ask for the block when fcU would be triggering block prod.",
        "created_at": "2022-06-07T15:17:23.875000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "I see, `fcU` could also be used for inner purposes of a builder, like if builder uses an advanced CL client that tracks tips of all block tree branches in the network and sends `fcUs` to it's block building software (modified EL client) to build payloads on top of every fork in advance. I thought about this kind of usage",
        "created_at": "2022-06-07T15:24:18.911000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "I also think that CL shouldn't reject a payload if gas limit isn't moved towards favourable direction, it's rather a job of a relay to enforce the gas limit change. My point is that we should have it enforced somewhere as original idea of submitting a gas limit was to preclude it from falling under builders control",
        "created_at": "2022-06-07T15:26:26.860000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Will builders be producing blocks in parallel without knowing what head will be?",
        "created_at": "2022-06-07T16:24:55.933000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think so, or building on what they expect the head to be. Cc \u003c@861612909854588938\u003e",
        "created_at": "2022-06-07T16:41:53.779000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I kind of understand in the happy case to be building on top of the latest received block. But I wander if they'll be playing the game of preparing also at the same time on the previously received block in case the incoming is late, and also stealing the MEV of the current block and so. Seems like even in the happy unforked case there are at least two different heads they should be preparing for.",
        "created_at": "2022-06-07T16:43:25.733000+00:00",
        "attachments": null
    },
    {
        "author": "ruteri",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is something we worry about, and I don't have any concrete answers. The validators choose both the slot and the parent hash, so it's up to the validators.\nI could imagine validators colluding with builders to some extent, but most likely outside mev-boost. There were some threads about attacks on oracles too, but the conclusion was that mev-boost is orthogonal to the problem.",
        "created_at": "2022-06-07T16:51:46.501000+00:00",
        "attachments": null
    },
    {
        "author": "realbigsean",
        "category": "Cross-layer",
        "parent": "",
        "content": "An execution engine would reject invalid gas limit changes though, right? If the relay sends us a bad gas limit we're able to see gas limit before signing a blinded block. So validating it before signing reduces the risk of missing a proposal",
        "created_at": "2022-06-07T17:57:21.705000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "any chance the fix for base fee encoding applied to mergemock? sort of wanted to see a sucessful run on it",
        "created_at": "2022-06-07T20:24:44.002000+00:00",
        "attachments": null
    },
    {
        "author": "ruteri",
        "category": "Cross-layer",
        "parent": "",
        "content": "I’ll submit a PR tomorrow if \u003c@543900561460822016\u003e doesn’t beat me to it",
        "created_at": "2022-06-07T21:14:20.419000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "it would, although we are already trusting relays atm for payload availability, profit reporting etc so i'm not as worried about getting an *invalid* gas limit",
        "created_at": "2022-06-07T21:57:17.658000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "i am _very_ worried about having builders control the gas limit so that their blocks are still valid, just not in line w/ what proposers prefer",
        "created_at": "2022-06-07T21:57:53.271000+00:00",
        "attachments": null
    }
]