[
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think that necessity of reaching out the originating relay diminishes potential outcome of widely spreading blinded block as it doesn't rid network of a single point of failure (DA or communication failure) as originating relay appears to be and doesn't reduce communication complexity either",
        "created_at": "2022-05-02T08:35:29.120000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "sorry i don't follow, are you saying we should or should not send the `SignedBlindedBlock` to all relays vs the originating one?",
        "created_at": "2022-05-02T14:52:35.493000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think that sending it to all relays doesn't buy us anything. In particular, it doesn't increase DA guarantees and doesn't speed up message dissemination",
        "created_at": "2022-05-02T16:48:44.167000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "gotcha, i could see either way but do think we are fine only sending to the originating relay (as the incentives should be strong enough for the originator to get their payload out) -- `mev-boost` currently sends the blinded block to all relays (https://github.com/flashbots/mev-boost/blob/main/server/service.go#L246-L251 ) which  prompted this question in the first place, curious if \u003c@388610194608750595\u003e or anyone has any thoughts here to add?",
        "created_at": "2022-05-02T17:41:37.603000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "and this is slightly off-topic but i just had the thought to increase payload availability guarantees by having the originator gossip a time-lock encrypted version of the transaction vector to whoever wants to listen; then if the originator goes offline for some reason everyone else can recover the transactions eventually (obviously a lot of parameters to tune and i think all the serious cryptographic constructions use ~immature VDFs but still, cool application of the technique imo)",
        "created_at": "2022-05-02T17:46:43.249000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "This behavior was just unspecified until now. One difference is that if a builder uses multiple relays, then any of these relays could serve the payload for a given `SignedBlindedBlock`, which adds some redundancy and increased the data availability 🤔",
        "created_at": "2022-05-02T18:26:32.093000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah so then you would want to track which relays sent you which offers and return the \"acceptance\" (via the `SignedBlindBeaconBlock`) to all of them that could make the offer",
        "created_at": "2022-05-02T18:28:38.525000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "but it seems like we don't want to spam relays with the blinded data if they won't be able to do anything w/ it to move the network forward",
        "created_at": "2022-05-02T18:29:06.954000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah, only sending to the relays that also sent the header makes sense. i guess i wouldn't be too concerned about this as a spam vector since it will be just one call per slot, and the relays will need a serious spam-protection and caching layer anyways to handle all kinds of request floods trying to take it down.",
        "created_at": "2022-05-02T18:31:53.450000+00:00",
        "attachments": null
    }
]