[
    {
        "author": "prestonvanloon",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hi all, just catching up on this. I am a bit hesitant to call this an urgent release as that claim must be used sparingly. We will certainly make a note of this, but I can imagine that users will be really frustrated to miss MEV boost enabled proposals, albeit they should still propose a local block. I would advocate that relayer implementation (or whatever is about to reject requests) to maintain this improper behavior until the next hard fork. In my opinion, that is the best way to ensure users are not frustrated by a change that breaks current behavior as they are forced to update anyway.",
        "created_at": "2022-12-05T00:14:20.966000+00:00",
        "attachments": null
    },
    {
        "author": "prestonvanloon",
        "category": "Cross-layer",
        "parent": "",
        "content": "Does that sound like a fair compromise? \u003c@144468805697929216\u003e \u003c@388610194608750595\u003e \u003c@301186049323958275\u003e \u003c@755590043632140352\u003e \u003c@363800010518822915\u003e",
        "created_at": "2022-12-05T00:15:42.065000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sounds good to me 👍",
        "created_at": "2022-12-05T00:16:27.803000+00:00",
        "attachments": null
    },
    {
        "author": "prestonvanloon",
        "category": "Cross-layer",
        "parent": "",
        "content": "In addition to the callout in release notes, we can mark the next release as a minor release to indicate a changed behavior in API message payloads for the builder API. \n\nIt was planned for a patch release next week, but easy to do as a minor release",
        "created_at": "2022-12-05T00:20:07.218000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sounds good, generally! 👍 \n\nAnd there's not a huge rush for the mev-boost rollout, but it's important to plan ahead of time to protect Prysm users, which is the reason for the \"urgent\" post here and the issue in the repo. For context, the types upgrade is in preparation for the upcoming Capella and EIP4844 changes, where the Attestant types already have all the necessary parts in place and well-tested.\n\nTo clarify - there's two components that could reject the payloads after the types upgrade: \n- **mev-boost**: if a user upgrades to the next mev-boost version but not the next Prysm version, they would encounter this error and could _not_ fall back to local block production anymore (making them miss their slot, because the BN is already at the step to send the signed blinded beacon block)\n- **relay**: we'll also get the types upgrade, but until the next hard-fork can probably have a backwards-compatible payload decoding fallback\n\nSpecial thanks \u003c@144468805697929216\u003e for explaining the issue and options in more detail on a Sunday 🙂",
        "created_at": "2022-12-05T11:54:38.210000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I still think this is not something that has to be done on a prysm release note (which we surely need to make) but rather on a MEV-boost one which is announcing breaking changes. For this I claim that MEV boost requires two releases minimum",
        "created_at": "2022-12-05T17:51:52.693000+00:00",
        "attachments": null
    }
]