[
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "The issue is that prysm was sending blinded blocks and omitting the JSON for empty arrays.  So if, for example, if a blinded block had no deposits in it then prysm would skip this element rather than send it as `\"deposits\": []`.  None of the other beacon nodes do this (at least the ones I have tested), and prysm doesn't do this either if requesting non-blinded blocks.\n\nThe flashbots folks want to start using the `attestantio/go-eth2-client` types because that's one less thing for them to maintain, and because the types have been around a while and so are considered a bit more battle-tested.  But these types reject the current prysm blinded blocks as invalid because they are missing these empty elements.\n\nThe `attestantio/go-eth2-client` types could be altered to assume that missing elements mean empty arrays/objects, but that's not something that I'm comfortable with doing as a) it's a fair change to the codebase resulting in a step down in strictness that is maintained everywhere else and b) it could result in partially-built blocks that are currently rejected being accepted.\n\nIt's hard to classify Prysm's current behavior as bugged, but equally it is nonsensical in a lot of situations (taking a simple example: the JSON representation of a `SignedVoluntaryExit` can omit the message and/or the signature if they are blank, but what would that mean in terms of what the structure represented?).  So it isn't a simple case of \"prysm broken\" but it is non-standard and could be well argued that rejecting these blocks with missing keys is the correct thing to be doing.\n\nIf it were down to me I'd likely go down the following route:\n  - release prysm with a note stating that it's a critical update for validators using MEV-boost\n  - give it a month (especially considering this is over the holiday period for many)\n  - release a new version of MEV-boost with the updated modules\n\nPossibly replacing \"a month\" with \"another minor release\", depending on prysm's schedule.",
        "created_at": "2022-12-04T18:46:11.252000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "cc \u003c@399309815517544451\u003e",
        "created_at": "2022-12-04T21:41:27.350000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@144468805697929216\u003e that sounds good to me, we'll mark that in the release notes\nthen we'll wait for some periods for the new version of mev-boost with the updated modules (assming this is a long time) and a few annoucements in between",
        "created_at": "2022-12-04T22:05:47.913000+00:00",
        "attachments": []
    }
]