[
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hey, in teku we had to introduce a lot of json rerialization duplication mostly due to the fact that we need to send camelCase fields and Hex format `QUANTITY` (beacon rest api are snake_case and decimal `QUANTITY`). So I just throw it out there: what about sending ssz objects in `base64(ssz)` format? we might need an additional param for versioning.. Relays need to deal with SSZ in any case right (for signature validation)?",
        "created_at": "2022-05-03T08:33:02.167000+00:00",
        "attachments": []
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hmm I understand the annoyance of that duplication. Imo using only SSZ payloads would make the API pretty obscure, intuitively I'm not a big fan and would rather stick with our json-rpc conventions. In the first version of the new spec, the `getPayload` request body used SSZ, and at the mev-day workshop it was discussed and decided to just go with json 🤷 (I can't recall the specific arguments). Would love to hear other opinions.",
        "created_at": "2022-05-03T09:27:28.121000+00:00",
        "attachments": []
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "My proposal apart (which is bad as well), I just want to highlight that it is not ideal to have different formats for the same objects. For what I can recall\\IMHO, we use JSON-RPC because this is EL friendly and initially we where on a proxied design, very close to engine API. But now it seems we are on a completely new path, closer to the consensus world (SSZ and entire beacon blocks floating around), and we could adopt REST api with SSZ binary data, like current beacon apis.",
        "created_at": "2022-05-03T10:06:37.928000+00:00",
        "attachments": []
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e Would love to hear other opinions.\nme too 🙂",
        "created_at": "2022-05-03T10:11:18.932000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Part of the problem is \"just go with json\" isn't itself simple.  The CL and EL have different conventions for values, for starters.\n\nPersonally I would prefer to see the CL conventions adopted for the JSON side, as they are clearer to the casual reader.  I would also like to see the SSZ-style containers adopted, but already suggested that and it didn't get very far.",
        "created_at": "2022-05-03T10:16:02.955000+00:00",
        "attachments": []
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "I understand that changing the json format (case and `QUANTITY` format) will create an inconsistency with the current `engine_` namespace. In teku we already have a dedicated serialization\\deserialization system for execution apis, but now things are getting worse. Adopting the CL format everywhere would save a lot of duplications. We might adopt a dynamic camelCase\\snake_case in our framework, but if we need to change the `QUANTITY` format too we have to introduce even more complexity in the API framework, so we'd likely end up remain with the duplication.",
        "created_at": "2022-05-03T10:38:52.806000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "the style follows directly from the `engine` api spec, is it not possible to reuse what was done for that?",
        "created_at": "2022-05-03T10:43:01.464000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "the reason it was requested to go with json was to improve the readability of the api calls",
        "created_at": "2022-05-03T10:45:58.234000+00:00",
        "attachments": []
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "I already did it, to give you an extent: https://github.com/ConsenSys/teku/pull/5406",
        "created_at": "2022-05-03T10:46:18.274000+00:00",
        "attachments": []
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "if case and QUANTITY were the same, that pr would have been 1/10th lines 🙂",
        "created_at": "2022-05-03T10:48:28.064000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think there are only 2 choices here\n1) keep as-is and follow the same conventions as the `engine` spec\n2) completely switch over to the CL rest api format",
        "created_at": "2022-05-03T10:52:55.292000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "If this is causing a lot of additional code bloat for all CLs, maybe we can switch. But no one mentioned this as a concern during the workshop we had. It also pushes a bit of work over to the EL side (not likely upstream EL, but the builder modified ones like `mev-geth`) to implement and support a CL style rest api",
        "created_at": "2022-05-03T10:55:35.751000+00:00",
        "attachments": []
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "I actually haven't realised the extent of it before start working. IMHO, the CL consistency argument is valid independently by our code bloat.  It also opens the door to adopt binary SSZ transmission",
        "created_at": "2022-05-03T11:12:59.457000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "Are people are interested in binary transmission for these methods? As mentioned, I originally had a `SignedBlindedBeaconBlock` encoded in SSZ hex and it was decided that readability was more important. Additionally, no appeared to have an issue with cost of serialization/deserialization when asked",
        "created_at": "2022-05-03T11:15:10.067000+00:00",
        "attachments": []
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "we could have in-protocol readability by remaining on `application\\json` content, but then transparently move to `application\\octet-stream` (SSZ) when things stabilise. It's a good point for the REST approach",
        "created_at": "2022-05-03T11:28:34.679000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@361447803194441738\u003e \u003c@654267572107083777\u003e \u003c@363800010518822915\u003e -- would be great to get your perspectives on this. If we were to switch from EL style JSON-RPC to CL style rest for the builder API we should do it now. \u003c@504202741933932544\u003e has raised some points about the additional complexity he's encountered dealing with the multiple different JSON encoding/decoding schemes for certain types and the benefit of being able to transparently move to `application/octet-stream` in the future. \n\nWe should also consider the fact that we are behind where we'd like to be in the testing these builder interfaces and this will almost certainly set us a few more weeks back. If you think it's important, I don't have a problem rewriting the spec to follow the beacon-apis style",
        "created_at": "2022-05-03T12:25:32.532000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "cc \u003c@399309815517544451\u003e that has strong opinions on some of these matters",
        "created_at": "2022-05-03T13:01:16.763000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "how do we feel about a middle ground?\n\nencoding `QUANTITY`s as the beacon apis' `Uint` types and using `snake_case` for field names\n\nwith the JSON-RPC envelope\n\nthat is likely the smallest diff from where we are now but then we sort of have 3 formats (not great) and any upstream builders will need to be able to handle this hybrid approach (not a big deal to put more work on builders imo)",
        "created_at": "2022-05-03T13:10:35.715000+00:00",
        "attachments": []
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'd like to hear from \u003c@688748669268132001\u003e too",
        "created_at": "2022-05-03T13:11:46.179000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "aesthetically i do prefer to have a single SSZ definition which we have an implicit mapping to JSON defined via the beacon APIs\n\nso clients can just write the SSZ thing and then get the rest for free (assuming they already support the beacon HTTP APIs)\n\naiui this API historically followed the engine API which importantly lacks any consensus data (beyond some primitive types) passed in\n\nnow that the builder API has changed to include consensus layer types it certainly makes sense to re-evaluate this decision\n\nand then also like \u003c@543900561460822016\u003e is saying if we change something it will push everything else back so which is worse, the implementation load or waiting another N weeks to start testing?",
        "created_at": "2022-05-03T13:14:37.221000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think I am pro of switching to CL style for builder API. It'll likely save us some duplicated work like \u003c@504202741933932544\u003e has mentioned above. My question is how long is the delay? (i.e N?)",
        "created_at": "2022-05-03T13:51:58.748000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think lower bound on N is 2",
        "created_at": "2022-05-03T14:17:37.899000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "types are fully defined in yaml in beacon-apis",
        "created_at": "2022-05-03T14:24:41.585000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "e.g. https://github.com/ethereum/beacon-APIs/blob/master/types/attestation.yaml",
        "created_at": "2022-05-03T14:26:15.371000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "sorry, I misinterpreted your statement.  The mapping is explicit in this repo, as in they don't just say \"use this SSZ type as YAML\", they write it fully out",
        "created_at": "2022-05-03T14:30:50.995000+00:00",
        "attachments": []
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thinking about what will cause most of the delay... I guess the spec can be updated quickly if the fields are all agreed on, I'd say a few days. Then work can start on mev-boost, mergemock, the CL clients, and the example builder. From my perspective, the updates to mev-boost and mergemock should be doable within a week, and we can start right away. The remaining work on the critical path would be on the CL clients. \n\nIs there broad agreement that a CL style builder API would be strongly preferable? Any arguments for sticking with EL-style json-rpc? \nIf CL style builder API would be the widely preferred direction, I think there's a strong argument for going for it now.",
        "created_at": "2022-05-03T14:47:12.269000+00:00",
        "attachments": []
    },
    {
        "author": "realbigsean",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm pro switching to CL style. Paul's off till next week so probably won't have his input until then.",
        "created_at": "2022-05-03T14:58:26.004000+00:00",
        "attachments": []
    },
    {
        "author": "realbigsean",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think JSON-RPC made more sense before we switched to the side-car design for MEV-boost, now I don't really see a reason for it",
        "created_at": "2022-05-03T15:01:01.776000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "right, \"implicit\" is misleading there, but that's what i mean; the types are already defined so we don't need to re-implement for the builder API",
        "created_at": "2022-05-03T15:06:14.476000+00:00",
        "attachments": []
    },
    {
        "author": "paulhauner",
        "category": "Cross-layer",
        "parent": "",
        "content": "Switching to the CL style is my preference too. It would mean less code on our end; the REST-style encoding is native for us and the RPC-style requires manual shimming. That being said, RPC-style is still very much doable for us.",
        "created_at": "2022-05-03T22:37:31.262000+00:00",
        "attachments": []
    },
    {
        "author": "dapplion",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't have a strong opinion, these encodings are easy to do for Lodestar since we already have the infra for all",
        "created_at": "2022-05-03T22:52:17.643000+00:00",
        "attachments": []
    }
]