[
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "There are a couple of reasons I'd tend to agree:\n\n- if rate of profit from MEV isn't high enough, then loss of profit from missing a block entirely in such a situation risks overwhelming the profit while using MEV; a less nuanced/quantitively reconcilable reason though, is\n\n- that many stakers, certainly institutional but also home (e.g., people participating in various home staking pools) are judged partly on how often they manage to propose and attest. The disincentives in that scenario around avoiding not proposing are high, so it might be better for people in that situation to accept less profit but look better on easily-measured metrics than use MEV which risks invalid blocks.",
        "created_at": "2022-07-22T07:52:31.740000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "What exacerbates this is that pre-L1 PBS, there's no real other on-chain accountability for builders, so the (builders') issues largely show up in penalties for proposers, so it's important to apply social consensus to balance things out. Once on-chain mechanisms PBS mechanisms are functioning, it should be reasonable to just let whatever cryptoeconomic mechanisms work, but right now there's a (crypto)economic market failure.",
        "created_at": "2022-07-22T07:55:50.807000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "And unlike attestations, most people have so few proposals in a 400k-validator network that one can't wait some reversion to a mean to take effect in terms of average proposal success rate. That might be the only proposal they get that month.",
        "created_at": "2022-07-22T07:58:43.029000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "From our point of view, the relay has simulate builder submissions, and outright reject blocks that have any sort of issue (rather than filter out bad transactions)",
        "created_at": "2022-07-22T08:29:09.713000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "Which is a very bounded amount of computation -- at most one (valid) proposal every 12 seconds.",
        "created_at": "2022-07-22T08:32:10.835000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "https://boost.flashbots.net/ links to https://hackmd.io/@flashbots/mev-in-eth2 which has charts (e.g., https://hackmd.io/@flashbots/mev-in-eth2#ideal-case) which only go up to 300k validators, less than either Prater or mainnet has today (350k/410k respectively).",
        "created_at": "2022-07-22T10:31:27.635000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "our team is working on an updated version. fyi tho if you spin up the workbook you can toggle the number of validators",
        "created_at": "2022-07-22T10:49:33.711000+00:00",
        "attachments": null
    }
]