[
    {
        "author": "nishant0",
        "category": "Cross-layer",
        "parent": "",
        "content": "Does anyone know why the current set of builder apis don't allow proposers to force their own set of transactions into the received payload from the builder ?",
        "created_at": "2022-09-29T09:52:44.877000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "I would imagine that this is because \"in theory\" relays are not block builders so have no control over the blocks they present to proposers.",
        "created_at": "2022-09-29T10:02:35.183000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Cross-layer",
        "parent": "",
        "content": "Couldn't the relays then present this constraint to block builders ?",
        "created_at": "2022-09-29T10:06:22.869000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Cross-layer",
        "parent": "",
        "content": "It would prevent them pre-building a generic block and then just inserting the transfer to the requested fee recipient at the end which is a common optimisation.  Obviously still need to know prevRandao etc but you can get that from a local beacon node without the latency for waiting for the proposer's node to tell the relay to pass it to you etc.",
        "created_at": "2022-09-29T10:07:17.303000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Cross-layer",
        "parent": "",
        "content": "But potentially a balance could be found to leave some room at the end of the block or cache it partially full etc.",
        "created_at": "2022-09-29T10:07:53.574000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "\"Must include tx hash x\" rather than \"must include tx ...\"?  Yes, some sort of filter for the relayer to act upon would be possible.\n\nA lot of the issues may come down to timing, though.  Blocks start to be built pretty much as soon as the previous block has been seen on the net, so in terms of slot times blocks are usually built from t-12s (give or take) up to t, where t is the start of the slot.  So this would have to be some sort of pre-proposal information to be useful.",
        "created_at": "2022-09-29T10:09:32.221000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Cross-layer",
        "parent": "",
        "content": "It could be an interesting censorship resistance strategy to be able to accept only blocks where tx hash is either included or inapplicable (ie the account nonce is already incremented). Even the simple form of only accepting if the tx is specifically included would work and be a much cheaper thing to check.  If no block matches fall back to building with the local EL.",
        "created_at": "2022-09-29T10:13:42.193000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah, that was my thinking. More like a must include txs with root, AB, BC, etc . The proposer can easily verify if this was included in the payload",
        "created_at": "2022-09-29T10:14:55.318000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah exactly, this would be simple to check on the proposer's end",
        "created_at": "2022-09-29T10:16:08.112000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Cross-layer",
        "parent": "",
        "content": "So in most cases it would be just a way of filtering out builders that censored a transaction rather than forcing them to include the tx. Minimises latency and uses the local EL as the non-censoring source if necessary. You'd only want to use it with a transaction that was paying above market rates so it should be included by block builders if they aren't censoring.",
        "created_at": "2022-09-29T10:17:58.284000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "So you'd expect a proof back for each tx so you could confirm it's in the root?",
        "created_at": "2022-09-29T10:18:29.698000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Cross-layer",
        "parent": "",
        "content": "It would be pretty simple for clients to implement, the relayer just needs to provide the payload root, merkle branch for the transaction field and the list of tx roots which compose of the tx list",
        "created_at": "2022-09-29T10:18:47.669000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Cross-layer",
        "parent": "",
        "content": "You just need the proof for the tx field root in the payload",
        "created_at": "2022-09-29T10:19:01.852000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Cross-layer",
        "parent": "",
        "content": "Proof is probably ideal, but given the relayer is already trusted to pay you, it could also be left to trust and you stop using them if they don't apply the filter.  Risk there is that it probably won't be used often so could be broken without being noticed for a fair while.",
        "created_at": "2022-09-29T10:19:58.491000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'd rather decrease the trust levels of relays than increase them 🙂",
        "created_at": "2022-09-29T10:20:23.462000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is more about having defaults in clients so that being a censoring relay is an unprofitable strategy. You would always fall back to block building locally if the relay cant provide the payload with the txs you want",
        "created_at": "2022-09-29T10:21:31.890000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "(There's the whole question of how a beacon node picks the txs it wants to see in a block, that seems like a large topic by itself, but it's tangential to the current discussion.)",
        "created_at": "2022-09-29T10:23:24.150000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "In terms of timing: the request would have to be made to the relays as soon as the beacon node saw the previous block (otherwise it could ask for a tx that is already in the chain).  That should give builders enough time to fetch the information from the relays, although I don't think that there is anything at current with that type of time constraint on it.",
        "created_at": "2022-09-29T10:25:26.162000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Cross-layer",
        "parent": "",
        "content": "This should be possible to implement, although would be an increase in implementation complexity. The question on how a beacon node picks the txs it wants would probably default to the top N highest value txs it sees in its local mempool after the last block is processed.",
        "created_at": "2022-09-29T10:29:19.626000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Okay, so not focusing on specific censoring so much as generic censoring.  Could still result in lower-value blocks being generated, but if N is a client parameter I can see that working.\n\nShould be possible to prototype easily enough, which would give an idea of if the timings work out.  Just need to find a friendly relayer to work with.",
        "created_at": "2022-09-29T10:31:53.730000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah, the idea was to stop generic censorship of transactions. While there is already a lot of implied trust in the relationship with a relayer, we don't need to hand it all the possible censoring capabilities",
        "created_at": "2022-09-29T10:35:54.715000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "Part of the priority or not on these kinds of changes depends on the expected timeframe from protodanksharding and L1 PBS. My preference is to keep the builder API as viewed as something that will be deprecated in a fairly foreseen way in a medium-time-frame. It has fundamental flaws that can't be fixed except by integrating PBS into L1.",
        "created_at": "2022-09-29T11:10:39.613000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "Some of this relates to censorship potential, but some of it is, for example, around that there's this gap where the CL sends a signed, blinded, beacon block to the relay and just has to trust the relay to return the full signed block (and potentially broadcast it itself, optionally). There's no recovery possible by that point on the CL.",
        "created_at": "2022-09-29T11:13:04.311000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't see PBS turning up in the next ~2 years, though, with everything else that has been backlogged by the merge, so something like this that is optional, outside of the protocol spec, and has a chance of improving censorship resistance seems like relatively low-hanging fruit.",
        "created_at": "2022-09-29T11:17:01.416000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sure, this isn't a specific objection to this proposal, and I agree, I'd bet on 2+ years too.",
        "created_at": "2022-09-29T11:17:40.795000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "One upside of exploring these ideas within the builder API is exactly that, viewed from a longer-term perspective, it hopefully will be somewhat ephemeral, so it can scout out the use cases worth supporting ahead of time with less longer-term protocol cost.",
        "created_at": "2022-09-29T11:24:44.429000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Just stating the obvious here but I think this is a good idea, although I'm not sure about the impact of it. From the proposer side it will already have sent the block so it would only know after the fact that the relay was censoring. So this only serves to identify relays/builders that are censoring which presumably will be well known anyway. If proposers decide to use censoring relays there's not much we can do",
        "created_at": "2022-09-29T11:26:55.024000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Although it wouldn't bring a strong guarantee, it would be a line in the sand to say to relays \"include these transactions or I will consider you untrustworthy\".  As to how much that itself is worth, yeah hard to say.  If proposers chase money regardless they're going to ignore the \"bad\" behavior of untrustworthy relayers anyway (until it hurts their bottom line).",
        "created_at": "2022-09-29T11:31:46.035000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah if a validator chooses to censor, there isnt much we can do as they have full control over tx ordering ultimately. This is to limit the power relays have here. PBS doesnt have any concrete timeline till when it will be fully implemented, i see this as a very simple way to enforce stronger censorship resistance guarantees via client defaults. Most validator dont necessarily want to censor, but rather access higher tx fee income for any block proposals.",
        "created_at": "2022-09-29T11:34:49.593000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Isn't what is described above basically CR lists?",
        "created_at": "2022-09-29T16:45:07.331000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah, except that perhaps Nishant was a bit more rigid about the block being full or not",
        "created_at": "2022-09-29T16:50:07.423000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "They aren't in-protocol entities, which gives a bit more freedom at the expense of no ability to force a proposer to make them.  At this early point I think I prefer this mechanism, but would have to see how it prototypes out (still somewhat worried about timings).",
        "created_at": "2022-09-29T16:54:37.991000+00:00",
        "attachments": []
    }
]