[
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "It hadn't really occurred to me until today, and I had forgotten until recently, but the open source code authored by Flashbots currently has censorship built into it (in the form of a blacklist that is pre-populated with a number of addresses including all Tornado addresses).  While we certainly cannot stop any given relay operator from censoring transactions, I feel like the open source relayer that the Core Devs are unofficially \"blessing\" should not have censorship baked into it.  Similarly, if we are going to give open support to an organization building stuff that is close to the core of the protocol, I feel like we should be limiting that support to ethos aligned projects, which means censorship resistant stuff.\n\nWhile the FB relay itself is closed source, I believe that at the moment it censors, and the instructions for setting up MEV-Boost currently point people at the FB relays.  This functionally means that if we (core devs) support/encourage people running MEV-Boost and they get pointed at https://boost.flashbots.net/ they will almost certainly end up implementing censorship.",
        "created_at": "2022-08-12T16:21:40.645000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "We have discussed on a number of occasions the censorship risks associated with stuff like PBS and there is active discussion around implementing stuff like CR lists to protect against it, but at the moment we are on track to go into The Merge with censorship built-in to software that we expect most users to be running.  This makes me pretty uncomfortable and I would like to see discussion on how we can prevent having censorship on Ethereum within a month of The Merge.",
        "created_at": "2022-08-12T16:23:35.688000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "If this is corroborated I'll do the best of my efforts to convince prysm of not shipping any MEV boost code. I highly doubt I'll succeed, but if the only available relayer at the time of release is censoring, then we shouldn't release support for it",
        "created_at": "2022-08-12T16:41:42.846000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "We know that their RPC server censors, and we know that the previous version of their relay (open source) censors.  We can't know for certain (until mainnet launch, or maybe on mainnet shadowforks) whether their closed source relay censors.",
        "created_at": "2022-08-12T16:42:40.145000+00:00",
        "attachments": []
    },
    {
        "author": "tokey1475",
        "category": "Cross-layer",
        "parent": "",
        "content": "Agree 100% once the censorship option is in place and in use, the harder it will be to get large entities (Lido/exchanges etc) to switch to a non censoring version",
        "created_at": "2022-08-12T16:42:48.395000+00:00",
        "attachments": []
    },
    {
        "author": "tokey1475",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@388610194608750595\u003e \u003c@208710861882130432\u003e \u003c@268793214906007562\u003e can you shine some light on this?",
        "created_at": "2022-08-12T16:44:30.622000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think list for censoring is fine, you have to censor attackers or spammers etc. Bending to the whims of a judge in a particular country is unacceptable. It's all subjective where this line ends. Flashbots' designers may have it one place, I myself may have it in a different place. If it were up to me I wouldn't support MEV boost within prysm if these lines do not agree. But others within prysmaticlabs may have this line in yet a third place and this is fine, all we can do some times is just argue the best we can an accept the decisions taken collectively or by the people entitled to decide",
        "created_at": "2022-08-12T16:51:13.435000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "IMO the builder api != mev-boost, nor does mev-boost == flashbots",
        "created_at": "2022-08-12T16:56:00.622000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "the community should just push for uncensored alternative relays and builders",
        "created_at": "2022-08-12T16:57:12.250000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "and we should push for better defaults",
        "created_at": "2022-08-12T16:57:24.118000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think this is disingenuous if there's only one known relayer at the time of release",
        "created_at": "2022-08-12T17:10:11.705000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Releasing with only one known censoring option would be akin to washing our hands and blame the user for censoring",
        "created_at": "2022-08-12T17:11:14.810000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "Not releasing doesn't incentive more relayers to appear. Once clients ship with builder api support, it is simply a matter of relays integrating with that API (or hopefully taking unopinionated open-source software off the shelf). Derisks the effort substantially.",
        "created_at": "2022-08-12T17:26:29.047000+00:00",
        "attachments": []
    },
    {
        "author": "tokey1475",
        "category": "Cross-layer",
        "parent": "",
        "content": "This has been discussed on ethresear.ch and I'm not sure I have anything of value to add.  But I struggle to see a path where the incumbent dominant block builder is dethroned.  They will have total dominance over both validator and searcher adoption, both of which are self-reinforcing in terms of economic incentives",
        "created_at": "2022-08-12T17:35:13.480000+00:00",
        "attachments": []
    },
    {
        "author": "tokey1475",
        "category": "Cross-layer",
        "parent": "",
        "content": "Now add in the (perceived) legal risks to large centralized entities of switching away from an OFAC compliant relayer/builder",
        "created_at": "2022-08-12T17:35:58.299000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "People will extract MEV from blocks. The point of the builder api and mev-boost was to make sure the API in which that occurred was an open standard so that everyone, including at home stakers, could participate. There are many difficulties with the increasing centralization of block builders, but not integrating the open standard into clients only hurts small stakers IMO.",
        "created_at": "2022-08-12T18:26:32.603000+00:00",
        "attachments": []
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is interesting: https://github.com/flashbots/mev-boost/issues/215\nBut hard, right?",
        "created_at": "2022-08-12T18:48:36.607000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think builder censoring is not something that I can prevent or even try to act against, whatever happens between the relayer and the builder is a black box and I can live with that fact until PBS is enshrined in the protocol.  But  the relayer filtering transactions is something that I can't accept. I mean is fine if there's a market like Matt is implying, and then users get to choose their favourite relayer, once there's an API in place and a Market I can't prevent an evil player from coming in and I can only hope that some altruistic validator will run with a local EE or with a good relayer. But until that happens, if the only available relayer is saying that it will not accept transactions from addresses for the sole reason of being banned in a country, then I think we as a community should not accept this and not use it, and we as client teams should not accept this and not facilitate its usage.",
        "created_at": "2022-08-12T20:40:34.146000+00:00",
        "attachments": []
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "I hear you. And these are the challenges we are dealing with now that we are exploring permissionless relayers and builders. The thing is that any relay within reach of the united states legislation will have to comply with OFAC. And running a trusted relay might be something that only an organization vulnerable to united states sanctions could be able to do. (?). This is not new, this is one of the big motivations for my work, and it's embedded in the plan we have been executing. It is ultimately solved with PBS in the protocol, and I'm very optimistic we'll get there. We have an official statement coming on Monday to make all of this more clear.\nBut note that through all the work we have done, at flashbots, ef, you and the other consensus clients, now this is reduced to deciding if we have a default relay on mev-boost or not.",
        "created_at": "2022-08-12T23:42:53.883000+00:00",
        "attachments": []
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "https://github.com/flashbots/mev-boost/issues/246",
        "created_at": "2022-08-12T23:43:01.671000+00:00",
        "attachments": []
    },
    {
        "author": "cristofue",
        "category": "Cross-layer",
        "parent": "",
        "content": "That is amazing, right? riiiight? 😄 So much better than where we were a year ago with the Flashbots relay in proof of work.\nThere are so many hard questions and so many challenges. We are moving in the right direction, this collaboration has been amazing. I suggest we all breathe, go and try to be happy on the weekend, and come back on monday for more discussion.",
        "created_at": "2022-08-12T23:43:51.166000+00:00",
        "attachments": []
    }
]