[
    {
        "author": "ajsutton",
        "category": "Cross-layer",
        "parent": "",
        "content": "You can’t publish another block or you’d be slashed because you’ve already provided the signed header. You don’t need to know the block body to create the proposer slashing.",
        "created_at": "2022-08-14T01:23:24.454000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "first and second block here are in different slots so not slashable",
        "created_at": "2022-08-14T01:38:40.775000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Cross-layer",
        "parent": "",
        "content": "No but if you sign the header for a block with the MeV transactions and give it to the relay, then sign a block without those transactions in the same slot that would be slashable. So you’d have to not publish a block at all for the first slot.",
        "created_at": "2022-08-14T01:41:07.676000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "ah good point!",
        "created_at": "2022-08-14T01:44:51.300000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "so then we forgo the consensus level rewards in one slot to collect the mev in the second slot",
        "created_at": "2022-08-14T01:45:25.544000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "and moreover also get the builders reward, so if the builder payment is greater than the consensus level rewards this is rational",
        "created_at": "2022-08-14T01:48:03.828000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Cross-layer",
        "parent": "",
        "content": "You’d also have half the capacity for transactions with the second half of that unknown when you make the decision. But it would still be rational in cases where there’s a juicy mev transaction in the first block. Anything worth more than the average execution block is likely worth it.",
        "created_at": "2022-08-14T01:51:09.154000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "You are still assuming the proposers are sophisticated enough to do this, and do it in some way that is completely visible across proposers who are in on it but invisible to the rest of the community (to avoid social slashing). And many MEV opportunitiee require some sort of pre-deployed capital so this also presupposes that the proposer had a bunch of capital at their disposal waiting for the off-chance that they are going to be in a position to take advantage of some mega-MEV opportunity.\n\nHad anyone run the numbers to show the likelihood of these situations occurring? And given that we have had a year plus of miners receiving such transactions in the clear, any evidence of enough sophistication to carry out the attacks?\n\nWe seem to be sacrificing real decentralisation for a theoretical loss of funds for dinner MEV searchers, and I've always struggled to understand why we would ever want to do that. None of the arguments, such as this one about some super-cabal of validators attacking poor MEV searchers and stealing their funds, seems even close to  the dangers that having just a handful of relays brings.",
        "created_at": "2022-08-14T05:43:31.743000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Searchers *are* very sophisticated.  Some of the attacks they have run against each other are both sophisticated and openly malicious.  For example, searchers were known to monitor the activities of other searchers and craft transactions that exploited bugs in the other searcher's strategies that resulted in robbing the victim searcher.  They also executed attacks against bugs and design flaws in the relays themselves.",
        "created_at": "2022-08-14T08:07:10.929000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "While validators are likely not as sophisticated on average, in the past we have seen large mining pools (validator pools in the future) engaging in the above behavior.  So just removing searchers doesn't remove the problem, it just makes it so the big pools make more money than the individual validators.",
        "created_at": "2022-08-14T08:08:10.642000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I do agree that censorship resistant should be our top priority, but I worry that if simply remove builders then we open ourselves up to a different type of censorship (giant pools).",
        "created_at": "2022-08-14T08:09:41.868000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "However, with proof of stake it is much clearer as to when these opportunities arise and as such it is also far easier to analyze operations to see if there are any nefarious activities. And, again, the actors have their deposit at stake so have a significant incentive to behave.",
        "created_at": "2022-08-14T09:10:38.785000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "To make sure I understand, you are arguing that large pools are not a problem (because we can see them misbehaving and punish after the fact)?",
        "created_at": "2022-08-14T09:12:19.486000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "I wouldn't say \"not a problem\" so much as \"a more tractable problem than what we have at current\".\n\nAnd yes regarding the reasoning.",
        "created_at": "2022-08-14T09:36:30.378000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Given recent events, it has become much less clear to me whether dark searcher pools that don't get total adoption is better or worse than light searcher pools that get more adoption.",
        "created_at": "2022-08-14T09:37:44.791000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Previously, my thinking was that light pools were preferable because at least we could ensure they were acting in line with the ethos of Ethereum.  However, with censorship being built into these systems we now have light pools that are actively acting against the ethos of Ethereum.",
        "created_at": "2022-08-14T09:38:47.599000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "So dark pools that have less adoption and are against Ethereum ethos seems strictly better than light pools that have more adoption and are *also* against the Ethereum ethos.",
        "created_at": "2022-08-14T09:39:13.592000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "A somewhat aside, but it had always seemed incongruous to me that transactions in general are fair game for MEV, but once a searcher has found some MEV the transactions become sacrosanct and protected from further predation, to the detriment of the network as a whole.",
        "created_at": "2022-08-14T09:43:45.837000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't think this is a desirable property so much as an expected property given incentives.",
        "created_at": "2022-08-14T09:44:13.374000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "It should be possible for the searcher to create bundles that provide enough value to proposers that the proposer's incentive to steal the MEV is less than the repeat custom if the proposer died not steal from the searcher.",
        "created_at": "2022-08-14T09:47:22.003000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "The censorship is a major concern. And the lack of visibility into that censorship by proposers makes them complicit, hence the earlier suggestion.",
        "created_at": "2022-08-14T09:48:38.941000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "For a sufficiently large proposer who does its own searching, not getting fed anything from other searchers may not be a problem for them.  Maybe this isn't so bad though?",
        "created_at": "2022-08-14T09:49:23.620000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "I do wonder if proposers, especially large proposers, should take a vow of non-searching. Unenforceable, of course, but the roles are very different and a proposer of any size should still make more money from taking aggregate transactions from other searchers via builders.",
        "created_at": "2022-08-14T09:53:10.225000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "It is a strong competitive advantage to do searching.",
        "created_at": "2022-08-14T09:53:33.384000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Convincing organizations who are vying for customers to sacrifice profit/customers in exchange for doing the right thing is incredibly hard.",
        "created_at": "2022-08-14T09:53:57.829000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Depends what your do with the bundles. If they build blocks from them, they are competing against the aggregate value of all other searchers (dependant on architecture).\n\nReally should write some of this up in a longer form so we can dig in to the assumptions around this. I suspect they are the cause of some of our differences of opinion in this area (and would be great to firm these up even if we have multiple divergent guess, as we can compare against reality when it arrives).",
        "created_at": "2022-08-14T09:57:20.913000+00:00",
        "attachments": []
    }
]