[
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "re builder specs - 1 second for getHeader seems fine, but after sending the signed blinded beacon block there's no options anymore, so that call should probably have a higher timeout, like 4 seconds for instance 🤔",
        "created_at": "2022-09-03T12:32:31.275000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "i am not sure we need the spec to dictate anything so that clients are free to implement however they want\n\nimo relays should be ready to return the execution payload as quickly as possible",
        "created_at": "2022-09-03T15:35:38.364000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "-\u003e verify signed block\n-\u003e return execution payload \n\nother things a relay may want to do should be pushed off the critical path",
        "created_at": "2022-09-03T15:37:30.590000+00:00",
        "attachments": []
    },
    {
        "author": "eyalbloxroute",
        "category": "Cross-layer",
        "parent": "",
        "content": "Do you think that relay should also broadcast the signed block to protect stealing the MEV ?",
        "created_at": "2022-09-03T16:02:03.979000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "once the block has been signed by the proposer, the only available options are to reveal the full block or not so to first order we don't worry about mev stealing at this stage of the exchange",
        "created_at": "2022-09-03T16:22:24.945000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "the relay can (and should imo) separately be well-peered to the gossip net and once they can assemble the full `SignedBeaconBlock` they should also send a copy to their peers on the gossip net",
        "created_at": "2022-09-03T16:22:53.597000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "but that can happen whenever and should not block the relay returning the execution payload to the proposer",
        "created_at": "2022-09-03T16:23:42.555000+00:00",
        "attachments": []
    },
    {
        "author": "eyalbloxroute",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks for the reply. I agree 100%.  We looked over the average response times we're seeing on our end and see that the blinded_blocks (get payload) endpoint is averaging 100ms for some validators from the time we've received the request to the time we have responded.  With other validators, including some of our test scripts, we see times between 5ms to 15ms and it looks like the biggest factor into the speed of those endpoints is request payload.\n\nThe eth spec for the builder api says to send the blinded block payload in the request which includes all of the attestations and additional data not needed by the relay to know which block is being requested.  The only necessary data on that request is the execution_payload_header which includes the block_hash used to know which block to return.\n\nOriginally we thought to check if we are able to limit that request to remove any attestations or slashings, and  see a nice performance increase on that endpoint. However, if we expect the relay to broadcast the block, the request should be full. We will continue to improve on our end next week with a goal to avg all requests for get_payload in 15 ms",
        "created_at": "2022-09-03T16:47:09.897000+00:00",
        "attachments": []
    }
]