[
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Relayers aren't required by sanctions laws to block transactions of individuals.  What FB is doing goes beyond what OFAC requires.  However, that isn't the point, if FB is unwilling to build censorship resistant software, the Ethereum community should be unwilling to support FB.",
        "created_at": "2022-08-13T05:11:13.393000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think the Ethereum community needs to reconsider if they want to trust the relay totally, or a half-way house may be better.  A possible solution would be for the current https://ethereum.github.io/builder-specs/#/Builder/submitBlindedBlock endpoint to be tweaked so that it only requires a signed beacon block header.  This would leave the ultimate decision as to if to publish a block or not to be down to the proposer, which could decide based upon the transactions list that it obtains as the return from this call.  So if, for example, the proposer believes that the block does not contain transactions that it would expect to see it can reject the block (although unfortunately not propose another block instead, due to already making the signed header public).",
        "created_at": "2022-08-13T07:20:49.667000+00:00",
        "attachments": []
    },
    {
        "author": "jlokier",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e  So if, for example, the proposer believes that the block does not contain transactions that it would expect to see\n\nI've been thinking about how we may be able to use ZK in future to prove that a builder has selected a reasonably fair selection of the transactions known to exist on the network, without necessarily revealing all of the builder's algorithm or knowledge.  This would prevent gross distortions such as transactions that most nodes can see but are consistently being omitted because they don't have an MEV backhander code or something.",
        "created_at": "2022-08-13T18:40:44.272000+00:00",
        "attachments": []
    },
    {
        "author": "jlokier",
        "category": "Cross-layer",
        "parent": "",
        "content": "The purpose of this idea is to improve fairness of inclusion on the network for all participants proposing their own transactions which other nodes can see shared in the pool.  The effect would be to reduce distortion due to MEV and \"who you know\".",
        "created_at": "2022-08-13T18:44:28.227000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Seems like an overly-technical solution compared to giving some power back to the validators.",
        "created_at": "2022-08-13T20:39:33.131000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "this is already essentially a header though?",
        "created_at": "2022-08-13T20:45:28.470000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "the validator doesn’t have the full body",
        "created_at": "2022-08-13T20:45:48.747000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "The point is for the relay not to have the final say as to if a block is transmitted or not, but for it to be up to the proposer.",
        "created_at": "2022-08-13T20:52:02.103000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "if i have two proposers in a row it seems like you can steal the builder's mev from the first block in the second",
        "created_at": "2022-08-13T21:22:51.236000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "(or generally any collusion scheme, not necessarily just two sequential proposers)",
        "created_at": "2022-08-13T21:22:56.657000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "attack: i ultimately do not release the first block, put all the juicy mev into the second block but do _not_ bother paying the builder (and/or its functional equivalent)",
        "created_at": "2022-08-13T21:25:05.711000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "i am quite interested in using zk proofs to allow for more trustless validation although i think we are some years away from the tech being performant enough at the scale we want to say interesting things",
        "created_at": "2022-08-13T21:25:57.173000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Always hearing about this attack, but it requires a relatively large player to be able to carry out, and even then they will have the ability to do so relatively infrequently.  How many players could conceivably pull this off given the current validator distribution (I don't see collusion happening due to the risk of one of the partners being a whistleblower)?  Two?  Three?  And we know who they are.\n\nThese entities will also need to have a system that will allow them to quickly take a block apart to see what MEV opportunities are in it, calculate their relative value, be able to craft additional transactions to extract the MEV themselves, and balance that against whatever additional MEV they may obtain in the second block if they do accept the first block.  Plus, they will lose the entire block reward from the first block (both consensus and execution) so the actuality of it being worthwhile seems incredibly low to me.  And of course the relay will be able to publish the block header to show that the proposer received transactions for the first block but didn't broadcast them, which would put the onus on the proposer to explain why they did not broadcast the block (and the proposer, being a validator, has a stake that could be socially slashed if the explanation does not hold up to scrutiny).",
        "created_at": "2022-08-13T21:46:32.615000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "i think we could make a bribery market so that any validator could potentially facilitate this so i don't think we can rely on the proposer shuffling to defend against such an attack",
        "created_at": "2022-08-13T22:27:45.472000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e they will lose the entire block reward from the first block (both consensus and execution) so the actuality of it being worthwhile seems incredibly low to me.\nso rather than withhold the first block, just publish *some* block to get most of the consensus rewards, etc while still \"forking out\" the builder payment in the second block",
        "created_at": "2022-08-13T22:29:13.632000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah i think \"social slashing\" is a very powerful tactic that should be used with utmost care but it is possible we can try to detect mev stealing like you are suggesting",
        "created_at": "2022-08-13T22:30:22.400000+00:00",
        "attachments": []
    }
]