[
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Fyi - Lido and other staking pools requested a way to query recently proposed headers from mev-boost (see also https://github.com/flashbots/mev-boost/issues/120)",
        "created_at": "2022-05-23T11:55:23.082000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Having to query lots of relays to obtain that information, and having the relays persist information like that, seems a bit painful.  Could there not be something simpler, like a requirement to use `ExtraData` to identify the builder, instead?",
        "created_at": "2022-05-23T12:21:51.084000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "kind of kludgy. Not sure what `ExtraData` should be for, but if people want something in any reliable/consistent way, it's very much a stopgap",
        "created_at": "2022-05-23T12:24:40.978000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "A better alternative would be for the relays to push out a signed attestation that it created the block, but then we need a network to transport it and somewhere to store it.  None of which is very pretty.",
        "created_at": "2022-05-23T12:29:12.216000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sure, and the CL specs are tightly enough constructed that there aren't a lot of random places to wedge this information that are much better, so it becomes a question of whether one wants MEV to live sort of in the shadows, as, well, kind of a conceptual sidecar, or introduce it more formally as part Ethereum.\n\nMy inclination is to do the former, actually, pending danksharding/PBS becoming more standardized. Yes, people need something now, so MEV can't wait for Eth L1 PBS, but it's a solid enough roadmap item it might be worth skulking around a bit longer.",
        "created_at": "2022-05-23T12:32:33.217000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "Just released `v0.1` of the builder spec! The main two changes to be aware of is the clarified signing logic (thanks \u003c@539495253418180618\u003e) and allowing batches validator registrations to be posted (thanks \u003c@388610194608750595\u003e):\nhttps://github.com/ethereum/builder-specs/releases/tag/v0.1.0",
        "created_at": "2022-05-23T22:17:56.161000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "I also put together a simple doc to track all of the different versions. Everyone should have access to editing it, so if you are working on this for a CL team it would be great to list your tracking commit / PR so that as things come together we can have people run these on testnets. It would also be great if builder / relay maintainers could list their relevant code sources and docs so people can spin those up on testnets. \n\nPlease note that I did cut a v0.0.0 of mergemock, but it targets the v0.0.0 release of the builder api. I will work on integrating the v0.1.0 changes now. I'll post an update here when they are complete, but in the mean time here is the interop doc: \nhttps://notes.ethereum.org/@lightclient/BJ2FLuL89",
        "created_at": "2022-05-23T22:31:17.723000+00:00",
        "attachments": []
    }
]