[
    {
        "author": "ruteri",
        "category": "Cross-layer",
        "parent": "",
        "content": "Base fee seems off, maybe the fix we had for the kiln builder should also be applied in mergemock \u003c@543900561460822016\u003e",
        "created_at": "2022-06-05T07:07:37.912000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "how to access the kiln builder?",
        "created_at": "2022-06-05T08:05:49.835000+00:00",
        "attachments": null
    },
    {
        "author": "ruteri",
        "category": "Cross-layer",
        "parent": "",
        "content": "Point your mev-boost or CL to https://builder-relay-kiln.flashbots.net/",
        "created_at": "2022-06-05T09:15:17.478000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "just realized we will want to extend the execution engine API `PayloadAttributesV1` message with some kind of `gas_limit` field and have this be a dynamic input to the build process if we want to respect this preference of the proposer\n\na few immediate points for feedback:\n1) should we change the execution-specs engine API to support this builder use case? it could be an optional field for backwards compatibility, and does put some cost on all engine API callers/callees only for the use of a subset of those callers/callees -- however it does mean builders can use \"off the shelf\" software in certain environments where it would otherwise save some effort/time; otherwise we are saying builders will always have custom software right out of the gate\n\n2) do execution engines allow the gas limit to even be dynamic? iirc in geth, you just set it once for the entire process -- if we don't want to block the spec on implementing this logic then i'd suggest we move the `gas_limit` to a `suggested_gas_limit` with the understanding that a builder will try but not guarantee the preferred gas limit",
        "created_at": "2022-06-05T23:04:38.998000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "it would also be a convenience to have `extraData` parameterized in the same way but this one only changes the block hash which is straightforward to recompute so not as urgent",
        "created_at": "2022-06-05T23:13:04.404000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "re: the gas limit, i see `geth` has a \"private miner API\" where you can set the gas limit; not sure about other execution clients but assuming we are ok with potential race conditions then a builder could use this to respect the proposer's request",
        "created_at": "2022-06-05T23:30:41.914000+00:00",
        "attachments": null
    }
]