[
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "do you mean the bid or the payload? the bid includes a value, the payload is only the execution-payload: https://ethereum.github.io/builder-specs/#/Builder\nmev-boost is just pass-through, the requests are always initiated from the BN",
        "created_at": "2022-10-03T06:53:53.839000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Either.  What I'm getting at is whether the BN has enough information to evaluate whether they are being screwed by the relay or not.",
        "created_at": "2022-10-03T07:03:12.426000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "- the BN does not know if the builder is lying about the value of the block to the proposer (could be fixed with proofs)\n- the BN does not know if the value of the block provided by the relay is better than that which could be built locally (could be fixed with updated API to the execution client, or by running a local relay that just build locally)\n- the BN does not know if the relay will provide the full execution payload to the proposer once the header has been signed",
        "created_at": "2022-10-03T07:09:39.588000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I want to know *after* the fact if the relay lied, which requires the relay to at least make a *claim* to the BN about profitability so the BN can compare it against what was *actually* presented to the network.",
        "created_at": "2022-10-03T07:11:12.028000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I certainly feel like at the moment we are trusting the relay *way* too much, and totally needlessly.",
        "created_at": "2022-10-03T07:11:28.502000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "To the point where we don't even have simple tools that will alert users when a relay lies to them after the fact so they can stop using that relay.",
        "created_at": "2022-10-03T07:11:56.273000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah sure. I mean that's the general idea behind the relay monitor, to have that kind of tool which would also alert other proposers in case of relay misbehaviour. Ideally the BN could and would check whether the execution payload contains the claimed value.",
        "created_at": "2022-10-03T07:13:20.062000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes it is possible to compare stated value to actual rewards, the info is all out there someone need to put the tool together to provide said info.\n\nA simple version could be an API along the lines of \"here is the bid I was given by a relay, was I paid what I was told I would be paid\"?",
        "created_at": "2022-10-03T07:16:01.809000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "K, so it sounds like the relay does send a concrete \"bid\" down to the CL client.  Is there a reason the CL client doesn't just validate it themselves?",
        "created_at": "2022-10-03T07:18:35.342000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Or is this just a matter of \"we haven't bothered writing any software that protects users from relays yet\"?",
        "created_at": "2022-10-03T07:19:09.562000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "The bid currently contains no transactions or proofs.",
        "created_at": "2022-10-03T07:19:53.138000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Probably the latter, although it would require the BN to talk to the EL for the balance info, and it isn't quite as simple as \"did my balance increase by x?\" because of the potential of other balance-affecting transactions in the block.",
        "created_at": "2022-10-03T07:20:25.299000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "(see also https://collective.flashbots.net/t/block-scoring-for-mev-boost-relays/202 for additional discussion about block scoring)",
        "created_at": "2022-10-03T07:21:07.101000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I am personally fine with ignoring that edge case, as in most cases the in-block transaction of the fee recipient are likely to be in both blocks so will compare just fine.",
        "created_at": "2022-10-03T07:21:28.900000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think that issue is separate from what I'm thinking about.  I'm trying to solve the problem of:\n1. Relay says block A is worth X.\n2. CL client/Validator signs block A.\n3. Relay sends block A to network, but it is only worth Y (where Y \u003c X).\n4. ???\n5. CL client stops using relay and loudly alerts the user of malfeasance.",
        "created_at": "2022-10-03T07:23:35.096000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "At the moment, relays could be paying validators *nothing* and no one would even know unless they were actively staring down logs or capturing packets when their turn to propose came up.",
        "created_at": "2022-10-03T07:24:32.964000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes, that should be done. ~~It would need new JSON-RPC API on the EL client, to score the execution payload, so the proposer can compare the value to the claim.~~ Sidenote: it's unclear how they would alert other proposers, but there is work underway on the relay monitor which sets out to do exactly that",
        "created_at": "2022-10-03T07:25:37.173000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "My recommendation would be to\n1. Stop using the relay immediately for all future blocks.\n2. Write to local DB that the relay is blacklisted, along with a reason, until the user manually removes the blacklist (restarting won't bring the relay back).",
        "created_at": "2022-10-03T07:26:44.243000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "This essentially defaults to the safe behavior until the user acknowledges they have \"received the notice\".",
        "created_at": "2022-10-03T07:27:31.236000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@388610194608750595\u003e is there any sort of registration required for builders to send blocks to relays?  And do relays independently confirm the blocks sent by builders in terms of their value, or do they trust the builder's supplied information?",
        "created_at": "2022-10-03T08:45:05.349000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Anyone can submit blocks permissionlessly to the Flashbots relay (https://docs.flashbots.net/flashbots-mev-boost/block%20builders), and all block submissions are simulated and validated on arrival, without distinction between internal and external builder.",
        "created_at": "2022-10-03T08:48:34.187000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think no other relay allows external block builder submissions currently, and I don't know how they validate their submissions. (iirc bloXroute stated that they switched on validation for all internal submissions now, after a recent problem with their relay serving unverified invalid payloads)",
        "created_at": "2022-10-03T08:50:46.981000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "So have you found any instances of builder supplying blocks with bids that don't match the actual payment made?",
        "created_at": "2022-10-03T08:59:22.608000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "We've had over 4M block submissions and validations so far, and have seen all sorts of validation errors. These don't necessarily imply nefariousness. Since anyone can submit blocks there's also a bunch of newcomers trying to spin up the open builder source code and tinkering with the code.",
        "created_at": "2022-10-03T09:31:48.404000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Given that, it seems fair to assume that if a relay does deliver a bid that has an incorrect value it is doing so on purpose.\n\n(Rationale behind the questions was trying to work out if a bid with an incorrect value was delivered if it would be the relay or the builder at fault.)",
        "created_at": "2022-10-03T09:37:54.818000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "There is `eth_getBalance` method that can be used: `assert claimed_bid_value == eth_getBalance(fee_recipient, X) - eth_getBalance(fee_recipient, X-1)` where `X` is a number of the block",
        "created_at": "2022-10-03T10:03:13.724000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Oh right! I was confusing things, that should indeed be sufficient to validate the claimed block value. Semi-related, here's a nice little tool to check delivered vs claimed value using `getBalance`: https://github.com/dvush/check-relay-value",
        "created_at": "2022-10-03T10:11:46.071000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "The problem with consistent block scoring is there isn't a final standard yet. Currently the Flashbots relay scores based purely on the payment transaction (which is the same as balance diff unless there's transfers to/from proposer feeRecipient). There were a bunch of discussions happening recently in https://collective.flashbots.net/t/block-scoring-for-mev-boost-relays/202, but no actual decisions have been made.",
        "created_at": "2022-10-03T10:33:27.188000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "From the thread, it doesn't sound like anyone is advocating for anything other than proposer balance change.",
        "created_at": "2022-10-03T10:41:56.112000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think the lack of discussion is just because everyone agrees?",
        "created_at": "2022-10-03T10:42:05.892000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "(I haven't read the whole thread in a while though, so maybe I have forgotten some strong naysayer)",
        "created_at": "2022-10-03T10:42:33.191000+00:00",
        "attachments": null
    },
    {
        "author": "pieterastra",
        "category": "Cross-layer",
        "parent": "",
        "content": "the downside is that any other transactions in the block that change the fee recipient’s eth balance, or any transactions from the fee recipient itself would affect the block score.\nThat would need to be mitigated, which negates some of the assumed simplicity",
        "created_at": "2022-10-03T10:56:26.171000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I disagree that we need to mitigate that.  In the vast majority of blocks, the proposer isn't likely to be transacting.  In the cases where they are, they probably will be included in all competing blocks so it equals out.  I don't think we should care about the incredibly tiny fraction of times where competing blocks don't all have the same proposer transactions to work with.",
        "created_at": "2022-10-03T11:03:42.970000+00:00",
        "attachments": null
    },
    {
        "author": "pieterastra",
        "category": "Cross-layer",
        "parent": "",
        "content": "doesn't this open up an attack vector to purposefully manipulate the fee recipient's balance to inflate the block score?\nI agree it's unlikely to happen accidentally, although if people (wrongfully) assume the block score always corresponds to value if could result in edge case bugs as well",
        "created_at": "2022-10-03T11:07:35.245000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "You mean someone paying more to get priority?  This is exactly how it all works already.",
        "created_at": "2022-10-03T11:10:02.356000+00:00",
        "attachments": null
    },
    {
        "author": "ruteri",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e the incredibly tiny fraction of times where competing blocks don't all have the same proposer transactions to work with\nIn my opinion we should pick a design that does not have corner cases like this. Proposer payment via a tx is not perfect (gas) but it does not have any cases when it just breaks down like this.\nAnother one is that this would force us to allow _negative_ payment amounts. If there's a transaction originating from the proposer's fee recipient, it can and will be bigger than whatever tip they receive from the builder.\n\n\u003e You mean someone paying more to get priority?  This is exactly how it all works already.\nNo, this is not about priority - the builder does not actually pay the proposer in this case, it's just a transaction that someone sent to the mempool.",
        "created_at": "2022-10-03T11:25:02.863000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Complexity goes way up with all other solutions.  Balance change is super easy to implement and prove.  While it does have a hypothetical edge case, I suspect it will never be hit in production on accident, I don't think it can be exploited, and if it is hit nothing bad happens.",
        "created_at": "2022-10-03T11:31:18.202000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "At worst, builders can just make sure they scour the mempool for transactions to the proposer and make sure they are included.",
        "created_at": "2022-10-03T11:34:19.552000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "As a reference point, there are 2 blocks in the past 1,000 containing transactions with the fee recipient as the to address (note that this does not include transfers as part of a smart contract).  No idea if 0.2% of blocks should be considered a corner case or not.",
        "created_at": "2022-10-03T11:48:34.646000+00:00",
        "attachments": null
    },
    {
        "author": "ruteri",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e At worst, builders can just make sure they scour the mempool for transactions to the proposer and make sure they are included.\nWhat if the transaction does not go through the mempool but via a private pool instead (Flashbots, Bloxroute, Manifold)?\nThat would result in the block builder having that ordeflow _pretty much always_ winning the block auction.\nI don't think it's an edge case, I think it's a valid transaction and we cannot have a design flaw like that. 2 blocks already like that in two weeks is also pointing out it's not uncommon, and the smart contract case should be even more common and even more problematic.",
        "created_at": "2022-10-03T12:10:03.669000+00:00",
        "attachments": null
    },
    {
        "author": "__bt__",
        "category": "Cross-layer",
        "parent": "",
        "content": "Most builders set the feeRec to themselves, so tx values to or from the proposer won't artificially affect the block bid. Txs to/from the *builder* will artificially affect the value, but builders are already incentivized to consider this. Txs *to* the builder inflates the value and if not considered, the builder's ether will be sent to the proposer. Txs *from* the builder deflates the value and if not considered, will lower the block bid and cause them(or their searchers) to lose the block.",
        "created_at": "2022-10-03T17:09:33.979000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "What is the scenario where someone is sending money to a proposer via private transaction?",
        "created_at": "2022-10-03T19:31:13.610000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "People do swaps and such via private transactions, but generally not transfers/sends.",
        "created_at": "2022-10-03T19:32:14.372000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I guess if the proposer has an open limit order and someone fills it or something?  What are the chances this happens at the exact block the proposer is proposing though?  Large custodial stakers will almost certainly will use isolated accounts for proposer payments, so won't happen for them.",
        "created_at": "2022-10-03T19:33:40.342000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Would need someone who sets the proposer fee recipient to a hot wallet *and* happens to propose a block while they are transacting *and* is doing private transactions.",
        "created_at": "2022-10-03T19:34:22.126000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Just feels very contrived, and easy for proposer to avoid, and causes no real harm to anyone except maybe the proposer the got a marginally worse block built.",
        "created_at": "2022-10-03T19:34:56.084000+00:00",
        "attachments": null
    }
]