[
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "IMO this is all up to the builders. There is a strong economic incentive for them to understand the likelihood of a block getting orphaned, so I expect that they will - I just want to make sure the interface is simple and flexible to allow them to operate this way",
        "created_at": "2022-04-04T13:02:49.567000+00:00",
        "attachments": []
    },
    {
        "author": "realbigsean",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes I think this is importing a library from lighthouse on a commit where I had messed up this serialization, but I just updated `mock-relay` to use the latest commit, so it should work now, let me know otherwise",
        "created_at": "2022-04-04T13:50:27.662000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hey, I took a stab at updating the spec : https://github.com/flashbots/mev-boost/pull/82",
        "created_at": "2022-04-04T15:14:56.087000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "I am wondering why the initial step of getting a blinded execution payload (it's called slightly different things in different spec variations) finds it useful to return anything beyond some basically useful, but more-or-less opaque nonce. In particular, the parent/previous-head block determines most of the fields, and the only real variable then is the transaction set.",
        "created_at": "2022-04-04T15:19:50.823000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't want to conclude too much from what some non-production mocks use, but the idea that all the existing ones I've seen so far have of using the transactions root as this opaque nonce seems basically unambiguous?",
        "created_at": "2022-04-04T15:21:03.994000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think a fair number of the fields in `BlindExecutionPayloadV1` are actually derived from executing /producing the block, e.g. `stateRoot`, `receiptsRoot`, `logsBloom`, `gasLimit`, `gasUsed`, `extraData`, `blockHash`, and of course, `transactionsHash`. So the unnecessary fields are `parentHash`, `feeRecipient`, `prevRandao`, `blockNumber`, and `baseFeePerGas`. My weak arguments for keeping them are i) I think it simplifies reasoning about it, because the object is almost exactly equivalent to the spec object `ExecutionPayload` and ii) it simplifies a potential dispute that may arise from using a different `randao` / `parent` than was requested (although in the worst case, we'll still need to fully execute the block to say the provided state root was invalid)",
        "created_at": "2022-04-04T15:42:31.538000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "More broadly, though, regardless of the specific contents and which are functions of execution and which are straightforwardly filled in by knowing the parent block, so far I'm not seeing scenarios where they're used in that intermediate role by the CL -- the CL depends on the builder to select from the relays, in this design.",
        "created_at": "2022-04-04T15:55:37.969000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "There's another overall design question: to satisfy their role, it seems like the relay s will need to sit on both EL \u0026 CL gossip networks (because of how the proposeBlindedSignedBeaconBlock or analogous RPCs are chosen). There's an argument, at least, that this increases the investment/skill floor for a working relay and thus decreases the decentralization.",
        "created_at": "2022-04-04T16:03:34.618000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "The CL will need to calculate the root of the `BeaconBlock` to sign, no? I suppose we could provide only the `ExecutionPayload` root",
        "created_at": "2022-04-04T16:03:53.337000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "At some point, there's discussion of the CL L1 itself getting PBS, and that would/will make this kind of MEV fit in more naturally.",
        "created_at": "2022-04-04T16:04:31.222000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sure, I'd argue that'd even be a more consistent design. If one wants PBS, take PBS seriously",
        "created_at": "2022-04-04T16:05:10.508000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "My naive intuition is that until we have L1 PBS, there is a much worse griefing vector against validators and so we should give them as many tools as we can to validate that the block they are about to propose will actually pay them. These checks will probably only help in the case of a software bug, because the relay/builder can still simply withhold the payload after the validator signs. I'm not sure if it is worth the additional complexity",
        "created_at": "2022-04-04T16:10:40.043000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think the absolute minimum interface would be:\n```\nbuilder_setFeeRecipient -- create validator:feeRecipient mapping (still need to write this into my PR)\nbuilder_getBlindExecutionPayloadRoot -- get the payload root to sign\nbuilder_proposeBlindBeaconBlock -- send the signed block to the relay, expecting them to release the full signed block to the p2p network\n```",
        "created_at": "2022-04-04T16:13:12.924000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "sure, agree that's a minimum to accomplish the design goals stated",
        "created_at": "2022-04-04T16:13:39.968000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "I thought about about going with `builder_proposeBlindBeacon` instead of `builder_getExecutionPayload` but I was concerned that it could create a less natural flow for CL clients to sign a header and then wait to update their local fork choice until they hear about their signed block over p2p - maybe this is unfounded though",
        "created_at": "2022-04-04T16:14:42.949000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "it'd definitely change the flow, but then returning just the blinded execution payload was never enough to begin with",
        "created_at": "2022-04-04T16:16:52.496000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "not sure I follow, the full execution payload is returned once the validator sends the signed beacon block header",
        "created_at": "2022-04-04T16:17:37.862000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "oh, re-read your spec, I see what you mean",
        "created_at": "2022-04-04T16:19:08.235000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "it seems like your changes also put the CL more in control than milestone 1? One hallmark of the `builder_proposeBlindBeacon`-based design is that the CL can't change the execution payload, but it seems like the flow your spec implies means that since it's returning a full ExecutionPayload to the CL, the CL can modify it however. I'm, personally, fine I think with this? Biased, I guess, but also wasn't around to see what the threat model was which dictated the whole blinding idea, but it does seem to be a change.",
        "created_at": "2022-04-04T16:25:16.735000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "There's a non-PBS version of MEV where it basically asks a bunch of relays (via a builder-proxy or not) to supply the best set of transactions, and uses those semi-arbitrarily to build a block. No blinding involved. I had assumed this had been looked at and rejected.",
        "created_at": "2022-04-04T16:26:24.914000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "The threat model I'm personally using treats all these components as part of the same node, more or less exactly as trusted as each other.",
        "created_at": "2022-04-04T16:27:17.271000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think the CL _should_ maintain all the same values as provided by the builder, but if the builder is smart enough to know the changed value didn't affect the outcome of the block and can still map it the header it shipped to the CL then i think that is okay - but it shouldn't be expected the builder is able to do that",
        "created_at": "2022-04-04T16:28:29.841000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm very much relying on the expertise of CL devs here to develop this spec -- my current position is that I weakly prefer being less blind about what the validator is signing because it can help reduce loss in the case of software failures. I prefer we rely on the builder to release the full, signed beacon block rather than ship it back to the CL, but my intuition says this complicates the block production flow too much for a relatively small gain (empty response vs. full execution payload) - and they'll probably release the full blocks anyways to try and protect themselves from a validator withholding",
        "created_at": "2022-04-04T16:29:18.819000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "but I'm happy to accommodate whichever approach people think is best",
        "created_at": "2022-04-04T16:29:51.674000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "Well, partly, I'm curious to hear/read (it must be covered somewhere in what Flashbots has already published) what the first-principles/incentive-compatibility/crypto-economics argument for this blinding, because that's a key point in either direction in terms of overall spec/protocol goals.\n\nIf it's required to achieve useful goals, well, alright. But if it's not, it's not just a complication, but a slow, critical-path, bottlenecked complication because BLS signing and verification are almost the slowest things a CL can do.",
        "created_at": "2022-04-04T16:35:04.544000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "The other planning-level, maybe kind of strategy question which occurs is, how likely do people think danksharding or some other L1 PBS is to happen in the next couple hardforks: if very likely, then any design now is likely to become in some sense redundant/a bit obsolete when that happens; otherwise, there's more of a need to design for a longer future.",
        "created_at": "2022-04-04T16:39:50.564000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "Blinding is important because without it, solo stakers would have a huge incentive to steal MEV. This would lead to flashbots only dealing with large pools, creating a centralizing force on validators",
        "created_at": "2022-04-04T16:40:33.081000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "That seems to be a downstream issue of Flashbots being currently centralized to begin with, but, alright, sure.",
        "created_at": "2022-04-04T16:41:27.034000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "No, this is just an issue with having PBS outside the protocol. If you’re a solo staker earning ~3 eth a year and you see an unblinded bundle that will pay the builder 30 eth of MEV, the rational choice would be for you to swap your address for theirs and earn 10 years worth of rewards in a single block. It’s not a big deal if you are blacklisted from the PBS protocol now because you just made so much money",
        "created_at": "2022-04-04T16:45:51.398000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "They're not just randomly floating around one of the gossip/broadcast networks to be seen by unrelated onlooking stakers though? At least not with any of the mev-boost-related designs so far. If the issue is more intrinsic, that any kind of MEV creates a spiky reward landscape where sometimes this 30ETH bundle exists, then it's not a stable equilibrium to just figure that only a few proprietary relays will see it.",
        "created_at": "2022-04-04T16:49:19.048000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don’t think I understand your response? All of the mev-boost designs have hinged on the need to blind the input to the state transition function so that solo stakers can participate. There are definitely periods of time where there are spikes in MEV (e.g. mass liquidations is a simple example)",
        "created_at": "2022-04-04T16:51:41.088000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "My point is that if the proposer was able to see and modify the block before proposing, they can always steal the MEV for themselves. Mining pools can do this today, but they don’t because it would harm their reputation and they would be kicked out of the network and no longer receive any MEV profits. The reputation of a solo staker is minimal and the expected return of their few blocks they produce a year are far often outweighed by larger MEV bundles",
        "created_at": "2022-04-04T16:53:18.733000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "Alright, within the context of the limitations around it, it makes enough sense.",
        "created_at": "2022-04-04T16:54:39.038000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "The flashbots team is probably able to provide a more eloquent problem statement and I",
        "created_at": "2022-04-04T16:55:10.487000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "i.e. the crucial bit of context is that the MEV relays aren't, by design, supposed to be operating on behalf of any specific stakers or staking pools. Which seems to add constraints elsewhere, but that's what I meant by the downstream effects of Flashbots centralization (and it's not just any possible MEV-in-non-PBS-L1: if the same operator operates the relays, builders, CLs, and ELs, well, there's nothing to \"steal\")",
        "created_at": "2022-04-04T16:56:49.120000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "so this blinding is a contrivance to deal with an incentive mismatch, fine",
        "created_at": "2022-04-04T16:57:11.415000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "with that misalignment in mind, everything you wrote is 100% reasonable",
        "created_at": "2022-04-04T16:58:16.334000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "is there a way to better align this actors?",
        "created_at": "2022-04-04T16:59:06.535000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "not at lower overall protocol/etc cost, probably",
        "created_at": "2022-04-04T16:59:32.339000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "blinding isn't cheap, but it's not that expensive, either, and it localizes the issue",
        "created_at": "2022-04-04T16:59:46.040000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "and that also elucidates the first part of this discussion/my first question, about why not just return some signing root, rather than the whole execution payload. Well, doing the latter allows the CL not to trust Flashbots as much, which is good",
        "created_at": "2022-04-04T17:03:43.297000+00:00",
        "attachments": []
    },
    {
        "author": "realbigsean",
        "category": "Cross-layer",
        "parent": "",
        "content": "The full execution payload is only returned after the block header is signed though right? So the CL can't change the payload and propose, or it'll risk being slashed",
        "created_at": "2022-04-04T17:32:33.927000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "maybe, I wasn't sure if\n```diff\n- method: `relay_proposeBlindedBlockV1`\n+ method: `builder_getExecutionPayloadV1`\n```\nchanged the semantics too -- it seemed like \u003c@!543900561460822016\u003e intended it to",
        "created_at": "2022-04-04T17:34:23.179000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "because of this",
        "created_at": "2022-04-04T17:34:32.023000+00:00",
        "attachments": []
    },
    {
        "author": "realbigsean",
        "category": "Cross-layer",
        "parent": "",
        "content": "Right, I guess I sort of missed that because `builder_getExecutionPayloadV1` only accepts a beacon block header, the relay *can't* actually propose because some of the beacon block body fields won't be available (randao reveal requires  a proposer's signature)\n\nBut you only need a signed beacon block header to slash someone, so relays would still have that power (some consensus extractable value?)",
        "created_at": "2022-04-04T17:40:32.962000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sorry, I just changed it to beacon block header earlier today thinking that would simplify the spec, but that is a good point that it will cause builders to not be able to release the block to the network",
        "created_at": "2022-04-04T17:52:10.939000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "seems like enough of a reason to send the builder the entire beacon block, minus the txs",
        "created_at": "2022-04-04T17:52:50.147000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "As far as changing CL fork choice flow, in theory it reduces special cases -- but CLs differ in how much they exploit that. Some sort of optimistically do an fcU ASAP to the EL, and just change it later on. This would hurt that strategy.",
        "created_at": "2022-04-04T17:58:27.523000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "(in terms of being ready for a block proposal next slot)",
        "created_at": "2022-04-04T17:59:02.790000+00:00",
        "attachments": []
    },
    {
        "author": "realbigsean",
        "category": "Cross-layer",
        "parent": "",
        "content": "+1 for that route, it's what initially pushed us towards the `BlindedBeaconBlock` type even though it's annoying to spec out. It's also what is required for BN \u003c\u003e VC communication for similar reasons (randao reveal)",
        "created_at": "2022-04-04T18:01:54.438000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "right, makes sense",
        "created_at": "2022-04-04T18:03:09.227000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sure, I'll say one reason I've been questioning these is that a quirk of Nimbus's serialization and how the libraries are organized means that invoking serde on pre-existing Eth2 types doesn't suffice, it has to be repeated (and the BN/VC communication has its own codepaths). But it does seem increasingly justified to communicate these as much as feasible.",
        "created_at": "2022-04-04T18:04:30.159000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "What if a builder would gossip a block *and* return it back to proposer on  `builder_proposeBlindBeaconBlock` method call?",
        "created_at": "2022-04-04T18:30:37.568000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "I would also expect that `builder_getBlindExecutionPayloadV1` responds immediately, likewise `engine_getPayload`. Do relays use p2p to send their blinded payloads to proposers on demand?",
        "created_at": "2022-04-04T18:32:31.812000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "Right, this makes the most sense to me",
        "created_at": "2022-04-04T18:38:04.028000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "What if relays gossip blinded headers in some advance to the next slot, mev-boost collects them and responds immediately to `builder_getBlindExecutionPayloadV1` call?",
        "created_at": "2022-04-04T18:38:05.010000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "That is the next step IMO, once gossip is introduced",
        "created_at": "2022-04-04T18:38:45.900000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "but for now I've just been spec'ing out direct communication to the relays while trying to keep the goal of gossip in sight",
        "created_at": "2022-04-04T18:39:13.079000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "(allowing gossip as a next step also helps motivate blinding)",
        "created_at": "2022-04-04T18:39:47.231000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "(because then it's useful regardless of flashbots centralization)",
        "created_at": "2022-04-04T18:40:01.026000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "I see",
        "created_at": "2022-04-04T18:40:23.060000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "just wanted to emphasise that `builder_getBlindExecutionPayloadV1` call should probably be responded immediately as it is an analog to `engine_getPayloadV1` and it should be easier to introduce mev-boost client in CL keeping the flow similar to Engine API. This is my PoV, of course, CL client devs may have different opinion on that.",
        "created_at": "2022-04-04T18:44:14.849000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "The following flow seems reasonable to me:\n```\nCL calls builder_setFeeRecipient in advance\n...\nCL calls engine_forkchoiceUpdatedV1 to local EL and initiates payload build process\n\nBuilders start to build blocks on all forks they observe\nBuilders (relays) gossip execution payload headers + feeRecipientBalance over p2p\nlocal mev-boost collects proposed headers\n\nCL calls builder_getBlindExecutionPayloadV1\nUse returned payload header or fallback to local EL if the above call fails or responds with invalid payload header\n\nBlinded beacon block is signed and either builder_proposeBlindBeaconBlockV1 or regular gossip is used to publish a block\nBlock proposal routine responds with a block obtained either from response to builder_proposeBlindBeaconBlockV1 or locally\n```\nNot sure if the above works for builders and relays, though.",
        "created_at": "2022-04-04T18:54:42.406000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "From a purely CL perspective, this gossip approach reduces the redundant serializations.",
        "created_at": "2022-04-04T19:04:51.725000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "I am curious if this is fine with builders to gossip headers in advance and balancing between not too early to extract more value and not to late to publish headers in time before a slot boundary.",
        "created_at": "2022-04-04T19:13:36.033000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "what sort of serializations?",
        "created_at": "2022-04-04T19:14:16.902000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "For the Web3 API. The objects being specified are all basically SSZ objects.",
        "created_at": "2022-04-04T19:15:27.304000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "There's an efficiency argument here too -- the JSON encodings of some of these objects will just be large and not that fast to encode/decode once they reach multiple megabytes, and SSZ is designed better to handle that.",
        "created_at": "2022-04-04T19:16:47.157000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "(10MB SSZ gossip limit, which, yes, it's a function of gas limits, which should be lower in practice, expands to quite a bit more than that in JSON form)",
        "created_at": "2022-04-04T19:18:33.350000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "If the actual transactions aren't part of the API -- it only ever deal with blinded blocks/execution payloads, that part's at least fine.",
        "created_at": "2022-04-04T19:20:14.520000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "I see, thanks for clarification",
        "created_at": "2022-04-04T19:20:57.626000+00:00",
        "attachments": []
    }
]