[
    {
        "author": ".charlescharles",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah, I’m arguing that the relay needs to publish the block quickly",
        "created_at": "2022-09-06T02:10:26.382000+00:00",
        "attachments": []
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "I do agree, the relay should also publish the block. Will look into adding this functionality into the Flashbots relay.",
        "created_at": "2022-09-06T09:05:43.991000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "in which case the builder API should probably clarify that it's something like \"MAY\" or perhaps \"SHOULD\" because of the security implications, but not \"MUST\", to guide client implementations' priorities.",
        "created_at": "2022-09-06T09:12:23.385000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "Otherwise, if the relays almost-always publish themselves, and there's not a clear delineation in the specs, it can be unclear just from that if CLs need to do this too.",
        "created_at": "2022-09-06T09:13:09.416000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "If a CL wants a block to be included on-chain then it really must publish the block.  Relying on a third party to publish your block for you seems like an incredibly bad idea.",
        "created_at": "2022-09-06T09:14:38.902000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sure. If something almost-always works though, that's what the specs are there to clarify, what's actually correct and what's coincidence and a function of some specific implementation. This isn't/wasn't a risk when relay networks don't/didn't publish themselves.",
        "created_at": "2022-09-06T09:15:34.445000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "Practically, the builder API does not have good local tests or a good way to set up local testnets, etc. It's perilously close to implementation-as-spec right now.",
        "created_at": "2022-09-06T09:19:05.762000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "So that has to be separated even more clearly.",
        "created_at": "2022-09-06T09:19:13.316000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Once a relay receives the signed beacon block header it _should_ broadcast the block, but there is no guarantee that it will.  Either way, though, there is no reason for the consensus node to not broadcast the block itself, and it is the only way for the node to be sure that the block has been broadcast.\n\nNot sure that fits in the API specs, possibly it should sit in the consenus specs as far as the CL is concerned.",
        "created_at": "2022-09-06T09:19:38.835000+00:00",
        "attachments": []
    },
    {
        "author": "pieterastra",
        "category": "Cross-layer",
        "parent": "",
        "content": "But isn't the relay on the critical path anyway?\na) validator signs blinded block header \u003e BN sends signed header to relay \u003e relay publishes block\nb) validator signs blinded block header \u003e BN sends signed header to relay \u003e relay returns full block \u003e BN publishes block\n\nSo b) only helps in case the relay *doesn't* publish the block, but *does* return the full block to the BN",
        "created_at": "2022-09-06T09:19:52.808000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes, the point being that the consensus node is unaware of if the relay has published the block or not, but is capable of doing so itself and as such should publish as soon as it has received the execution payload.",
        "created_at": "2022-09-06T09:21:27.906000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm not disagreeing with the first paragraph of this at all. The second paragraph I am disagreeing with. If all the implementations of a basically opaque API are either opaquely hosted by someone else with profit motives to be at least somewhat secretive or have non-builder-API limitations (https://github.com/flashbots/boost-geth-builder#limitations means that's quite unlike using the builder API proper because of the fcU requirement) and behave in the same way regarding block publishing because it's in their interests too, that muddies interpreting a spec.",
        "created_at": "2022-09-06T09:21:58.597000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "The builder API is a contract on both CLs (or similar clients) and builder API \"servers\" (relays, builders, etc)",
        "created_at": "2022-09-06T09:22:39.051000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "There's no test suite of which I'm aware, there's no good way to run a _realistic_ version locally, etc. The spec must be unambiguous.",
        "created_at": "2022-09-06T09:23:37.291000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Although it would be nice to be a contract, there is no way to enforce \"relay publishes block on p2p network\".  It is certainly in the best interests of the relay to publish it, but that doesn't mean that it will.  Separately, and regardless of if the relay publishes the block or not, it is in the best interests of the proposer to publish it.  So I'm not sure that having any condition on the relay, in the specs or not, will help.",
        "created_at": "2022-09-06T09:25:02.729000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "\"Although it would be nice to be a contract, there is no way to enforce \"relay publishes block on p2p network\". \" I think I've tried to be clear? I agree with this",
        "created_at": "2022-09-06T09:26:31.744000+00:00",
        "attachments": []
    },
    {
        "author": "pieterastra",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sure. My point is that the validator is relying on the third party relay to behave properly after signing a blinded block anyway, and it not publishing a block but still returning it to the CL seems like quite the edge case.\nBut however unlikely, it's still something in control of the CL so I agree it should just publish anyway 🙂",
        "created_at": "2022-09-06T09:26:39.709000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e in which case the builder API should probably clarify that it's something like \"MAY\" or perhaps \"SHOULD\" because of the security implications, but not \"MUST\", to guide client implementations' priorities.",
        "created_at": "2022-09-06T09:27:02.201000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "The problem is, once FB/maybe-bloxroute-who-knows start publishing blocks, and they're the only actual implementations around (see above yadda yadda yadda about \"realistic\", etc) that muddies the distinction between spec and implementation",
        "created_at": "2022-09-06T09:28:14.901000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "so that's fine, they don't have to. But if they almost-always do, the spec must say that they don't actually have to, this is something that's kind of optional that they're doing but don't rely on it",
        "created_at": "2022-09-06T09:28:40.591000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Well, except for the minor point that this isn't implemented in the flashbots relay, as per metacrhis' comment above so \"however unlikely\" is currently \"absolutely guaranteed\".\n\nAlso,  maintaining a p2p interface isn't the simplest thing in the universe to get right, especially when peer scoring comes in to play.",
        "created_at": "2022-09-06T09:29:48.884000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah I think we're agreeing.  I just think that in a trust minimized system such as Ethereum it should be the default to assume that the relay is not doing what it should and so verify the work that it produces and publish yourself rather than rely on it doing so, and as such shouldn't need to be explicit in whatever specs are available.  But if there are specs in which this can be put I'm fine with that too 🙂",
        "created_at": "2022-09-06T09:31:49.283000+00:00",
        "attachments": []
    },
    {
        "author": "pieterastra",
        "category": "Cross-layer",
        "parent": "",
        "content": "So then it's not working as described in this architecture: https://hackmd.io/@manifold/S1jRmGIPF 🤷\n\u003e Validators receive execution payload headers 8 from relays (execution payloads stripped of the transaction content). The relay must attach an indication of the payload value to each header. The validator selects the most valuable header, signs the payload, and returns it to the relay and escrow to be propagated to the network.",
        "created_at": "2022-09-06T09:33:07.008000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah \"The validator selects the most valuable header, signs the payload, and returns it to the relay and escrow to be propagated to the network.\" and the \"Block proposal with MEV-Boost\" diagram both show not-the-CL being responsible for block proposal. This is kind of why the spec needs to have clarity",
        "created_at": "2022-09-06T09:34:53.328000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Although I hear you, I think this is a somewhat weird way to look at things.  If you, as a consensus node, have all of the data to broadcast a block then why would you ever _not_ broadcast that block?  Relying on a third party to do so, even if they promise to do so in their spec, seems very counter-intuitive.",
        "created_at": "2022-09-06T09:43:03.677000+00:00",
        "attachments": []
    },
    {
        "author": "pieterastra",
        "category": "Cross-layer",
        "parent": "",
        "content": "whether or not the consensus node has all the data necessary *is also part of that spec*\nlooking at that article it doesn't even mention anything about returning the block to the consensus node, while that now seems to be the default per the implementation",
        "created_at": "2022-09-06T09:46:59.570000+00:00",
        "attachments": []
    },
    {
        "author": "pieterastra",
        "category": "Cross-layer",
        "parent": "",
        "content": "speaking as a home staker, there's a lot of confusion about how relays work (and which will be available), going live in a week one hour after the merge",
        "created_at": "2022-09-06T09:47:52.498000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "\"intuitive\" and \"counter-intuitive\" isn't how this works though",
        "created_at": "2022-09-06T09:48:03.561000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "relying on a bunch of people's intuitions to line up doesn't make for great interop",
        "created_at": "2022-09-06T09:48:26.652000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Not sure if the existing docs count as a spec, but the builder API specification is clear that the execution payload is returned to the consensus node: https://ethereum.github.io/builder-specs/#/Builder/submitBlindedBlock",
        "created_at": "2022-09-06T09:49:20.008000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "The general point is that in a trust-minimized system if there is something that you can do, then you should do it yourself.  If there needs to be a note in the spec for that then fair enough.",
        "created_at": "2022-09-06T09:50:20.757000+00:00",
        "attachments": []
    },
    {
        "author": "pieterastra",
        "category": "Cross-layer",
        "parent": "",
        "content": "apart from the builder API spec, I think it'd help if the information for the general public were up to date and accurate.\neven boost.flashbots.net states \"Once the validator signs the header, the relay publishes the block payload.\" under \"I am a solo validator, will I be able to run mev-boost?\"",
        "created_at": "2022-09-06T10:02:20.562000+00:00",
        "attachments": []
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Clarified the sentence in the FAQ, it was meant as \"publish the block payload to the proposer\". The manifold doc you linked above may be outdated btw. \n\nThe builder-specs is the canonical truth, and the sequence diagram in https://github.com/flashbots/mev-boost/#api is also accurate. The idea behind the builder specs API is that the proposer receives the payload after sending the signed blinded beacon block. And of course CL clients should publish the block once they have it ready, whether or not the relay does so too. It'd be a really bad idea not to, and there's no reason for not doing it either.",
        "created_at": "2022-09-06T11:36:35.522000+00:00",
        "attachments": []
    },
    {
        "author": "eyalbloxroute",
        "category": "Cross-layer",
        "parent": "",
        "content": "Just published the results of the test we ran over the weekend of the expected MEV from external relay:\n\n```https://twitter.com/eyalmarkov/status/1567241404169994240```",
        "created_at": "2022-09-06T20:37:35.184000+00:00",
        "attachments": []
    }
]