[
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "The builder REST API spec is taking shape (🔥), and I wanted to get some attention on the question whether we want proposers to sign `getHeader` calls (now would be kind of the best time to add that to the spec). See also https://github.com/flashbots/mev-boost/issues/112 and https://github.com/flashbots/mev-boost/issues/102 for more background.",
        "created_at": "2022-05-08T18:39:57.586000+00:00",
        "attachments": []
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "but if the proposer cooperates with multiple relays it can still collect/distribute bids and pit relays/networks against each other",
        "created_at": "2022-05-08T18:45:30.397000+00:00",
        "attachments": []
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "(within the short time period it still has)",
        "created_at": "2022-05-08T18:46:10.017000+00:00",
        "attachments": []
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "i think only way for this not happening is blinded bids, with a zk way to compare and pick biggest bid",
        "created_at": "2022-05-08T18:58:32.977000+00:00",
        "attachments": []
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "If the relays would only send the header to the single upcoming proposer, then builders wouldn't be aware of each others bids, and it would actually be a sealed auction. Whereas in the current API proposal, anyone could query any relay about the current best bid.",
        "created_at": "2022-05-08T20:05:13.202000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Signing things takes time.  I'm not a fan of adding additional complexity in to the process unless there is a real requirement.  Having read through the linked issues, I'm not sure I see the requirement.\n\nThe idea that this would result in some sort of builder auction can be solved pretty easily: builders need to bid a fair amount to begin with.  Having a single-shot bid for a given block by a builder would avoid a lot of additional back-and-forth that would be likely to happen otherwise.\n\nThe comment in 102 by \u003c@543900561460822016\u003e regarding the ability to detect relays witholding blocks doesn't seem to need item i) because its presence is a requirement for item ii) to be seen.",
        "created_at": "2022-05-08T20:58:52.402000+00:00",
        "attachments": []
    }
]