[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@543900561460822016\u003e \n\u003e what do you mean by this? I can see many reasons for using a trusted intermediary (ePBS or not)\n\u003e networking (unless validity proof)\n\u003e block cancellation\n\u003e guaranteed payment loan\n\u003e censorship checking (??)\nI'll get to your questions about importance eventually, but I want to kick up the discussion with these statements above. They are a common misconception, they appeared in Justin's post on Mev Burn and they are thoroughly repeated by EF researchers so I assume these topics were discussed and agreed upon, but they are all based on off-protocol builders or some poor p2p based design for builders. I want to make a strong case against these statements at least when we use in-protocol builders. \n\nI think the easiest way of thinking about in-protocol builders is not as builders, but rather as trustless relays. Today if Potuz wants to build a block I have to deal with one of the 4 relays that take care of all 90% of our blocks. The reason being that I have zero reputation, I effectively cannot enter the protocol as a builder unless I somehow buy reputation and convince proposers to send me their blocks. I cannot be a relay, I can only play by the few trusted players rules. \n\nOn ePBS where proposers cannot build locally, but rather are forced to use an in-protocol registered builder (or call it relay if you want) then I no longer have this problem. I can become a builder(=relay) and I do not need any reputation for it. Proposers do not need to trust me at all, they know that I will honor my payload or anyway they'll get their payment. Relays can still provide services, relays can still advertise bids and sign blocks for other builders, but they do so now in a trustless manner: we have by definition removed the trusted actor: proposers do not need to trust the relay to pay, they now know that it will pay. Builders do not need to trust the relay, they choose to do to, otherwise they can open their own endpoints and become relays themselves.",
        "created_at": "2023-10-18T17:11:25.946000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Since builders=trustless relays, there is absolutely nothing that a relay can do that a builder can't and that's essentially by definition",
        "created_at": "2023-10-18T17:11:50.069000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "My complaint is that 1) it moves the risk from proposers to builders (assuming relays are still in the mix) and 2) it's trying to bring small independent builders into the fold. It's not like I don't think these things are important, but considering the other protocol priorities and the difficulty of doing ePBS I don't think it is worthwhile.\n\nIn an iterated game, relays are going to lose their position if they rug proposers. Some proposers may be rugged on the way, but it is against their financial interest to do so. Yes if all major relays are censoring, maybe we have a problem. But this is why I think focusing on ILs is much more critical.\n\nAs for making it permissionless for new builders to enter the market, I don't think this is as important of a design goal. Building is an inherently centralizing activity. The good ones earn more, can invest more in r\u0026d, and then earn more. I think any serious outfit trying to build blocks is going to be able to create a relationship with a relayer to submit their blocks. It's good for business.",
        "created_at": "2023-10-18T18:17:45.250000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e  2) it's trying to bring small independent builders into the fold.\nLol, my PR requires them to stake 1024ETH 😄",
        "created_at": "2023-10-18T18:40:55.014000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The objective is not that, the objective is only one: remove a trust assumption.",
        "created_at": "2023-10-18T18:41:21.294000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "I agree ePBS should remove trust assumptions but I want it removed for both proposers and builders",
        "created_at": "2023-10-18T19:35:07.079000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's removed for both",
        "created_at": "2023-10-18T19:39:46.625000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Why you think it's not?",
        "created_at": "2023-10-18T19:39:55.623000+00:00",
        "attachments": []
    }
]