[
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "a validator could always just submit their own block as a bid under ePBS",
        "created_at": "2023-05-22T16:24:39.866000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "assuming there isn't some constraint like builders must come from a given set of pubkeys separate from validators, and the \"self-build\" fallback is valuable enough to retain imo",
        "created_at": "2023-05-22T16:25:30.564000+00:00",
        "attachments": []
    },
    {
        "author": "terere.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "i was just thinking that if block building gets ultra specialized and it becomes centralized in let´s say 3 institutions in USA and in 2 institutions in UE. \nThen every stateless validator will relay in that these builders always be online. Then we are exposed that USA and UE forbid ethereum and mandate those builders to shutdown. \nIn that scenario where builders shutdown or go offline unexpectedly the chain will halt.\nthen i don´t know if validator clients always will propose a 0 eth bid and a self-build vanilla fallback block in order to keep the chain moving forward, or in that case people will need to spin builders software  reactively ?\nand i also i wonder if that will be posible with low resource validators after dank sharding where proposers will need to build 64 MB blocks in that scenario.",
        "created_at": "2023-05-22T17:42:35.230000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "low-resource builders (including \"reactive\" validators) could just not include any transactions w/ data attached",
        "created_at": "2023-05-22T20:46:47.494000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "so while there would quality of service impacts to ethereum's data plane, the chain itself would still be available",
        "created_at": "2023-05-22T20:47:05.166000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "and yes, i think in that version of the world, we would expect ppl standing by to spin up builders if something like that happened",
        "created_at": "2023-05-22T20:47:25.664000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "note that searching etc could be and remain specialized and relatively unspecialized block building could be easy to deploy, esp as a temporary stop gap",
        "created_at": "2023-05-22T20:48:08.860000+00:00",
        "attachments": []
    },
    {
        "author": "terere.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "agree , hopefully clients will include the feature of automatically detect no builders bidding and start building vanilla blocks with no data at least. thanks for clarifications",
        "created_at": "2023-05-22T22:09:06.318000+00:00",
        "attachments": []
    }
]