[
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Block builders certainly want to get a `payload_attributes` event no matter what, in order to start building.\n\nWhat's that flag you mentioned?",
        "created_at": "2023-04-01T11:14:11.492000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e btw, second question -- when is the payload_attributes event sent the first time (ealiest one)?",
        "created_at": "2023-04-01T11:23:51.805000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hmmm this is not really clear to me what they need.  There are several situations in which we send attributes. In the happy case we send them as soon as we import a block. If this block is late we will send one at 4 seconds (to propose on top of the previous block!) And when the block arrives finally, say at 8 seconds, it's not clear if the builders will want again attributes for this or not. We don't send attributes to the local engine in this case because we plan to reorg this late block. However if attestations show this late block was seen by the network (at 10 and 12 seconds we check this) then we will send attributes again. I think the best thing would be to get on a call, together with \u003c@602753420033785856\u003e . Unfortunately I'm already driving to the middle of nowhere where there won't be any internet, until Monday",
        "created_at": "2023-04-01T11:33:10.287000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Checking internally, latest we can hop on a call on Monday",
        "created_at": "2023-04-01T11:41:30.441000+00:00",
        "attachments": null
    }
]