[
    {
        "author": "sanjayy1702",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hi \u003c@539495253418180618\u003e \u003c@466006586477772831\u003e need your input on below question, TIA\n\nIs there any way for a block proposer to change the fee recipient after looking at the bids received or having prior visibility to what the value of bids at the start of the epoch when the block proposer duty is assigned?\nFrom a MEV theft standpoint, just trying to answer if node operators can change fee recipient with expectation of average MEV or if they have the ability to view the value of MEV for the upcoming block and decide if they want to redirect rewards to themselves",
        "created_at": "2023-02-14T05:44:19.478000+00:00",
        "attachments": []
    },
    {
        "author": "jimmygchen",
        "category": "Cross-layer",
        "parent": "",
        "content": "I haven't really look into this bit - \u003c@539495253418180618\u003e or someone else can answer this better. My guess is that it's possible to the to change fee recipient any time, but it will take some time for the preference to be spread to the network, so the change may or may not be in effect in time, and the bid value is something that's constantly changing every slot.\n\nThe fees for a unsigned block received from the Relay is visible to node operators, but the transactions details are not - because these are not revealed to the proposer until the block has been signed and returned to the relay, so MEV txs can't be \"stolen\" by node operators.",
        "created_at": "2023-02-14T06:08:54.697000+00:00",
        "attachments": []
    },
    {
        "author": "sanjayy1702",
        "category": "Cross-layer",
        "parent": "",
        "content": "when you say fee is visible but not transaction details, what more details are there in the transaction and if node operator is able to see the fee whats stopping them from changing fee recipient address and steal mev",
        "created_at": "2023-02-14T06:14:23.030000+00:00",
        "attachments": []
    },
    {
        "author": "jimmygchen",
        "category": "Cross-layer",
        "parent": "",
        "content": "~~The fee i was referring to is the priority fee offered  by searchers to have their transactions included in the block, and is different to the MEV profit from transactions (e.g. sandwiches etc).~~",
        "created_at": "2023-02-14T06:17:42.649000+00:00",
        "attachments": []
    },
    {
        "author": "jimmygchen",
        "category": "Cross-layer",
        "parent": "",
        "content": "pls note I'm not an expert in mev, so i could be completely wrong.",
        "created_at": "2023-02-14T06:18:58.724000+00:00",
        "attachments": []
    },
    {
        "author": "sanjayy1702",
        "category": "Cross-layer",
        "parent": "",
        "content": "thanks for your input \u003c@466006586477772831\u003e , can you suggest who would be the right person apart from \u003c@539495253418180618\u003e",
        "created_at": "2023-02-14T06:20:35.306000+00:00",
        "attachments": []
    },
    {
        "author": "jimmygchen",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah looks like I was indeed wrong there 😅 the bid value is the MEV reward.",
        "created_at": "2023-02-14T12:53:48.804000+00:00",
        "attachments": []
    },
    {
        "author": "jimmygchen",
        "category": "Cross-layer",
        "parent": "",
        "content": "not sure what the node operator's role is here, does it own the validator keys? if so, yes they can change the fee recipient",
        "created_at": "2023-02-14T12:57:51.485000+00:00",
        "attachments": []
    },
    {
        "author": "jimmygchen",
        "category": "Cross-layer",
        "parent": "",
        "content": "i think a lot of people here would be able to answer, perhaps try the flashbots guys 🙂",
        "created_at": "2023-02-14T12:58:43.654000+00:00",
        "attachments": []
    },
    {
        "author": "sanjayy1702",
        "category": "Cross-layer",
        "parent": "",
        "content": "hey \u003c@388610194608750595\u003e, can you please share your thoughts on this",
        "created_at": "2023-02-14T13:01:09.053000+00:00",
        "attachments": []
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "There is no guarantee about how fast a new feeRecipient is applied. Builders receive it on their next validator information request, but they do get it for the current and next epoch, thus at the very latest a changed feeRecipient is used 2 epochs from when it's submitted.",
        "created_at": "2023-02-14T15:00:28.813000+00:00",
        "attachments": []
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Talking about this API call in particular, which builders use to get all the information about proposers for upcoming slots: https://boost-relay.flashbots.net/relay/v1/builder/validators",
        "created_at": "2023-02-14T15:01:43.990000+00:00",
        "attachments": []
    },
    {
        "author": "tanvip9584",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hi \u003c@388610194608750595\u003e Just to add. Is it safe to say that a node operator (running nodes for an LSD) who changes the fee recipient with an intention to steal MEV, does so with no way of knowing the value of MEV in advance?",
        "created_at": "2023-02-14T15:16:16.519000+00:00",
        "attachments": []
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think there's no way to do it this way, but maybe you could outline your way of thinking? Once a proposer receives a bid, the feeRecipient for this payload is already locked in at the relay and can't be changed anymore, as it's part of the block.",
        "created_at": "2023-02-14T15:17:38.640000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "What some CLs support is comparing the bid with a local EL bid (supported with some clumsiness in Bellatrix; will be supported pervasively with Capella engine APIs). Then they can, ad-hoc, make the fee recipient (and anything else) whatever they want",
        "created_at": "2023-02-14T15:29:45.132000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "As far as the trust model of the builder API, it is kind of a broken thing from a technical perspective. The enforcement mechanism is social: if a relay operator tries to steal, some people are running nodes which monitor potential discrepancies, and they might tweet about it or similar.",
        "created_at": "2023-02-14T15:31:15.737000+00:00",
        "attachments": []
    },
    {
        "author": "tanvip9584",
        "category": "Cross-layer",
        "parent": "",
        "content": "This was my understanding as well. Since the fee recipient is a prerequisite for the reveal of the blinded block and corresponding MEV value, it would not be possible to swap out the fee recipient if the operator realises the MEV is worth stealing",
        "created_at": "2023-02-14T15:40:27.674000+00:00",
        "attachments": []
    },
    {
        "author": "tanvip9584",
        "category": "Cross-layer",
        "parent": "",
        "content": "So this would be true in case of locally produced blocks then?",
        "created_at": "2023-02-14T15:41:19.169000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "I do not really understand this thing about fee recipient swapping -- what does it benefit the relay operator to rely on such stunts? They can just take whatever cut they want",
        "created_at": "2023-02-14T15:42:15.231000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "when the relay node creates the block itself, it uses its own fee recipient, of course",
        "created_at": "2023-02-14T15:43:18.824000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "that is not some scam, it is how this works",
        "created_at": "2023-02-14T15:43:25.813000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "well, for locally produced blocks, it's just the usual engine API stuff -- specify whatever fee recipient (and anything else) one wants just for that block",
        "created_at": "2023-02-14T15:45:21.947000+00:00",
        "attachments": []
    },
    {
        "author": "tanvip9584",
        "category": "Cross-layer",
        "parent": "",
        "content": "To clarify, we're trying to understand cases where the fee recipient is changed by the node operator who runs the validator. This is in the context on a LSD, where say an operator puts up a bond and receives the balance amount from a pool of the LSD's user funds, to make up the 32 ETH to spin up a validator. In this case, since EL rewards are transferred to the fee recipient and this is 100% in control of the operator, we're trying to understand if the operator who intends to pocket the entire EL reward without sharing with the pool, can do so on a selective basis ie, when MEV \u003e what the operator may stand loose",
        "created_at": "2023-02-14T15:49:43.377000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "and yeah, from \u003c@388610194608750595\u003e :\n\u003e Once a proposer receives a bid, the feeRecipient for this payload is already locked in at the relay and can't be changed anymore, as it's part of the block.",
        "created_at": "2023-02-14T15:55:07.335000+00:00",
        "attachments": []
    },
    {
        "author": "tanvip9584",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes, this is clear. Confirms my understanding as well.",
        "created_at": "2023-02-14T15:56:07.300000+00:00",
        "attachments": []
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Just to clarify -- it's just highly unlikely that a block builder updates the validator details frequently enough for a change to be propagated quickly enough, for this to be an attack vector. The Flashbots builder by default queries those infos twice per epoch and only after that uses a new feeRecipient.",
        "created_at": "2023-02-14T15:56:55.378000+00:00",
        "attachments": []
    },
    {
        "author": "tanvip9584",
        "category": "Cross-layer",
        "parent": "",
        "content": "1) Can you elaborate on the source that the flashbots builder uses to query the fee recipient address? As I understand this can be set on validator client or the beacon node where the validator client takes precedence  \n2) Not sure I fully understood this: flashbots builder queries those infos twice per epoch and only after that uses a new feeRecipient. \n3) Is it within the same epoch and is this a known frequency eg, x and y slots before the block proposer slot?",
        "created_at": "2023-02-14T16:06:20.661000+00:00",
        "attachments": []
    },
    {
        "author": "metachris_",
        "category": "Cross-layer",
        "parent": "",
        "content": "1: the builders get validator information for slots in current and next epoch from here: https://boost-relay.flashbots.net/relay/v1/builder/validators\n2: yes\n3: depends on the builder code, by default the flashbots builder updates this twice per epoch",
        "created_at": "2023-02-14T16:24:56.313000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@994843128961966110\u003e usually the way pools approach this is mandating the operators use a smart contract fee recipient that pools all rewards and then split them up at a later time to all involved parties",
        "created_at": "2023-02-14T16:39:22.719000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "it is clear for a given block if an operator conforms to this pattern and if they violate it then there should be some penalty mechanism in the pool construction",
        "created_at": "2023-02-14T16:39:56.293000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is, e.g., what Rocketpool does, I believe?",
        "created_at": "2023-02-14T16:40:11.511000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "and lido and ...",
        "created_at": "2023-02-14T16:40:18.632000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "then you can just not worry about operators trying to sluice off funds",
        "created_at": "2023-02-14T16:40:30.100000+00:00",
        "attachments": []
    },
    {
        "author": "tanvip9584",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes, this is correct. This is what we're planning as well. Wanted to be fully convinced of the choices available to the node operator to determine the penalties. It would change the way we approach this, if there was a way for a node operator to choose to selectively steal MEV when the value of MEV is high.  In which case, the penalty mechanism would provide limited recourse.",
        "created_at": "2023-02-14T16:45:04.489000+00:00",
        "attachments": []
    },
    {
        "author": "tanvip9584",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks a ton for the inputs! \u003c@388610194608750595\u003e \u003c@654267572107083777\u003e \u003c@539495253418180618\u003e",
        "created_at": "2023-02-14T18:35:27.680000+00:00",
        "attachments": []
    }
]