[
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "1. It can provide a forward-looking assessment of block values based on expected network activity, planned events, or anticipated market movements. \n2. It could serve as a good dataset to analyze and predict congestion periods, or study cycles in transaction fees over longer time horizons. \n3. This mechanism could also enhance market efficiency by integrating more information into price discovery (opens up derivatives and speculation markets when proposers can commit to specific block sequences).\n\nBut, OTOH, 1. it may lead to reduced flexibility in responding to real-time changes in the network, 2. Strategic Manipulation 3. Centralization.",
        "created_at": "2024-07-02T14:57:04.587000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Here are some random and perhaps broken thoughts on data availability (on point 3):\n1. Currently, we only have 4 seconds for data availability, but realistically it's 1 second due to timing games.\n2. With ePBS, we have 6 seconds for data availability. I assume the builder can gossip the blob at 3 seconds into the slot, with the cutoff at PTC 9 seconds. 6 seconds versus 1 second is already a significant improvement.\n3. Why can't we push data availability until execution validation, which is the n+1 attestation cutoff? This would be 12 seconds versus 6 seconds versus 1 second.",
        "created_at": "2024-07-02T16:44:21.925000+00:00",
        "attachments": null
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "1. Can the existing gossip protocol handle increased data loads with the `n+1`?\n2. Ensuring time and state synchronization across the network becomes more complex with an extended window.\n3. Smaller nodes may need higher storage and bandwidth requirements.\n4. Designing penalties for non-compliance, especially delayed or incomplete data propagation will be very challenging. \n5. Difficult to measure the cost-benefit analysis in its entirety. \n6. We may see the emergence of new strategies like strategic delays or collusion and manipulation due to increase time window.",
        "created_at": "2024-07-02T17:26:36.551000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't understand some of the questions. I'm not advocating for increasing the blob target/max with ePBS. That's a different discussion and should be bundled with DAS. I'm just curious what would break if we move the availability deadline from the 9s mark of slot n to the 3s mark of slot n+1, if that's not already the case.",
        "created_at": "2024-07-02T18:11:02.087000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "DA is already pushed to N+1 at attestation time, it's part of Payload validation. However, just like execution, the proposer only has 6s anyway",
        "created_at": "2024-07-02T22:49:38.556000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "For sure. Then the blob should have 12 seconds to propagate in the most generous case. I thought I heard 6 seconds during EPF, which prompted my question. We are on the same page.",
        "created_at": "2024-07-02T22:56:19.153000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "There are two attacks on forkchoice that I'd like discussed that I haven't seen anyone raising: \n- on block auctions, a Payload that is timely but takes a very long time to execute, may reorg the next proposer. A variant is if the Payload is not timely but still present and valid can still reorg the next proposer with less chances.  But still with not much beta\n- on slot auctions: the builder naturally tries to submit the Payload as late as possible, making the above even worse. \n- on both: the builder can start building two blocks up to the last second and release late and bid higher on the next block because of the extra info. I've been told by searchers that this last one is not an issue cause just a second is good enough to build any block, but I'd like confirmation",
        "created_at": "2024-07-02T23:12:01.551000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "How is slot auction worse than block auction here? In a block auction, the motivated builder could also submit as late as possible at the 8.999s mark to try to get PTC to vote on time, which is no different than in a slot auction. Do you mean that in a slot auction, because there's an actual timing game incentive to submit as late as possible, that's why it's worse?",
        "created_at": "2024-07-02T23:44:53.251000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "in slot auction the builder actually makes more money on the current block by delaying, in block auctions the builder only is trying to capitalize on early building, but cannot extract more MEV on the current block",
        "created_at": "2024-07-02T23:51:18.252000+00:00",
        "attachments": null
    }
]