[
    {
        "author": "nishant0",
        "category": "Cross-layer",
        "parent": "",
        "content": "Without the transactions how would the CL verify the execution block hash ?",
        "created_at": "2024-02-09T04:49:38.089000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah, realized this doesn't work, although the move to SSZ could help with the integrity check but ultimately would need a snark or something of correctness to keep the invariants of PBS",
        "created_at": "2024-02-09T14:38:31.420000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm thinking on the balance attack to PTC-based ePBS designs. Can anyone from P2P crowd confirm that it's relatively easy to split the view of the timeliness of a block? can a sophisticated actor split it at will? that is, decide which % of the committee will get it timely and which % wont?",
        "created_at": "2024-02-09T18:04:43.348000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "how are these even done? are there like statistical resutls on how long it takes to traverse and they are easy to pinpoint? cc \u003c@498009160982724610\u003e \u003c@476250636548308992\u003e \u003c@584911944364982302\u003e",
        "created_at": "2024-02-09T18:05:23.008000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "That is, if PB is lowered (because ePBS affords for lowering PB) does it make this attack harder or not? (the proposer needs to split the view along the lines of PB, 1-PB)",
        "created_at": "2024-02-09T18:07:02.704000+00:00",
        "attachments": []
    },
    {
        "author": "agemanning",
        "category": "Cross-layer",
        "parent": "",
        "content": "If you are relay its easy, but your asking if transmitted across gossip? \nI think its much harder across gossip, because you can't control the mesh links of honest peers. So if you send it to one honest peer, it could forward it to any other honest peer and the timeliness of the block shouldn't really be that partitoned at a network level. Is that the question you're asking?",
        "created_at": "2024-02-09T20:39:20.302000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Cross-layer",
        "parent": "",
        "content": "It requires a few things for an actor to be able to do that, namely be able to identify the proposer's network identity and eclipse them so that anything sent to the block mesh is only sent to them. So its possible to do that but that is possible now too. Unless I am missing something its not unique to epbs. Like adrian said its harder to do in gossip because as long as you have one honest peer in the mesh it would be reliably broadcasted to the network",
        "created_at": "2024-02-09T22:56:00.171000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is exactly the kind of partitions I'm asking. I'd like if a couple of P2P experts could come to the ePBS breakout room to explain the feasibility of such an attack. This is the main unsolved problem and I'd really like to gauge what are the actual numbers, should we try to avoid it, mitigate it, is it impossible, etc..",
        "created_at": "2024-02-09T23:00:42.947000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "There is something unique to ePBS: a player with that control today cannot grief a builder into revealing a non canonical payload. On ePBS (with a PTC flavor) a player like that could cause  pain to builders so I'm trying to gauge opinions from experts in this topic",
        "created_at": "2024-02-09T23:03:11.521000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "And also it's important to understand the cases when this grief is not intentional but just market induced: proposers are incentivized to submit later to get better bids, but as \u003c@531934490826768418\u003e pointed out, this I do think can be mitigated by penalizing proposers of missed slots",
        "created_at": "2024-02-09T23:05:07.408000+00:00",
        "attachments": []
    }
]