[
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "How might the transparency and accountability enforced by ePBS affect the strategies and behaviors of validators and builders? Are there going to be new strategies emerging as a result?",
        "created_at": "2024-06-06T10:26:33.732000+00:00",
        "attachments": null
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "Besides the risk of change, what realistic scenarios might still encourage or allow for off-protocol actions? May be expanding on these scenarios/actions could open up some discussion by the external actors. \n\nIs there any practical (empirical simulations) way to compare the performance and efficiency between ePBS and MEV boost? How does one setup such an experiment environment?",
        "created_at": "2024-06-06T10:33:04.149000+00:00",
        "attachments": null
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "ePBS will definitely bring a shift in the distribution of bidding power. \n\nUsing data from the current MEV-Boost system, is it possible to model scenarios to predict how ePBS might alter builder concentration and entry barriers? Or the other side of the coin: managing intricacies of in-protocol scheme leading to centralization of builders.",
        "created_at": "2024-06-06T11:01:45.156000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "we open sourced the framework we used in one of our papers to model the MEV-boost auction, so this could be a good starting point imo: https://github.com/M1kuW1ll/MMASim",
        "created_at": "2024-06-06T11:32:58.406000+00:00",
        "attachments": null
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thank you. I will study this and ask you questions.\n\nAfter hearing \u003c@755590043632140352\u003e express some interest in blind bidding in ePBS specs, I have been thinking and tinkering around with sealed bid first price and second price auctions in the current PBS scheme. Still very early stages, but I have been documenting some of these experiments and thoughts here on my Github blog. \n\nhttps://thogiti.github.io/2024/05/28/Sealed-Bids-in-Ethereum-PBS-Impact-on-Proposer-Builder-Dynamics.html\nhttps://thogiti.github.io/2024/05/29/Messopotamia-Sealed-Bid-Auctions-Ethereum-PBS.html\nhttps://thogiti.github.io/2024/06/03/Cross-Chain-MEV-Auction-Modeling.html",
        "created_at": "2024-06-06T13:57:47.122000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't think blind vs unblind makes any difference here. The auction will naturally be sealed in the sense that builders can't trust any bid they see, and at the same time proposers can always just unblind whatever bid they receive",
        "created_at": "2024-06-06T13:59:16.730000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "so blinding them on protocol is useless",
        "created_at": "2024-06-06T13:59:28.840000+00:00",
        "attachments": null
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "The sealed bid here have a different meaning. Unlike the current open bid auction where other bidders can see the bids, in a sealed bid, other bidders don't have visibility to your bid as a builder. Proposer here is the seller (auctioneer from in-protocol scheme POV).",
        "created_at": "2024-06-06T14:02:02.591000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "that's what I meant as well",
        "created_at": "2024-06-06T14:05:57.664000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "How would second price auctions work here? Note that the proposer selects the bid, not the protocol. The protocol has no visibility of the bids other than the one the proposer selects.",
        "created_at": "2024-06-06T14:19:27.251000+00:00",
        "attachments": null
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "Both theoretically and empirically, open and sealed bids have different effects on the total number of bids, revenues and their distributions.",
        "created_at": "2024-06-06T14:22:59.499000+00:00",
        "attachments": null
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "I haven't given much thought on how exactly it can happen, but assuming proposer has a way to track and select the highest bid as the winner. Then highest bidder wins but pays the second highest price as payment rule.",
        "created_at": "2024-06-06T14:24:31.719000+00:00",
        "attachments": null
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "But I am not exactly sure how they will play out in our in or out protocol PBS scheme. But they will lead to different distributions of payments and different levels of participation.",
        "created_at": "2024-06-06T14:28:23.084000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "What I am saying is that regardless of wether we force the bid to be sealed, the proposer can unseal it if they want to run an unsealed bid auction. And if we don't want to seal it on protocol, anyway from the point of view of the builder the bid is sealed cause they cannot trust **any** bid they see",
        "created_at": "2024-06-06T14:44:35.645000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is not implementable in protocol, however, open bid auctions naturally tend to this anyway",
        "created_at": "2024-06-06T14:45:18.427000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "we discussed this a bit with RIG, and I think the literature seems to indicate that open bid auctions are usually better at eliciting higher bids (more efficient auction) than sealed bid auctions\n\nBut the literature doesn't usually consider sophisticated/strategic participants, which is definitely the case in our setting (builders)",
        "created_at": "2024-06-06T14:47:53.567000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm catching up on this but it would be really nice to see two diagrams side by side (epbs and mev boost) with the number of interactions/hops between builders/(relays)/proposers and timing to illustrate this point! I'm just trying to get a better idea of the exact steps at which you get these extra seconds",
        "created_at": "2024-06-06T14:52:34.465000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Take a look at my slides, the first few of them focus on this issue, that's the killer feature of ePBS",
        "created_at": "2024-06-06T15:06:49.762000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "https://docs.google.com/presentation/d/1RHV_W5p_2LRytWAHP5o_lVq84n68Asw-EPIT-LdO1Xc/edit#slide=id.p",
        "created_at": "2024-06-06T15:07:05.814000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Slide 7 is the key difference",
        "created_at": "2024-06-06T15:07:43.857000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hi \u003c@725415098331430932\u003e \u003c@755590043632140352\u003e , I wanted to write down some equations to illustrate the point potuz made but ended up going all in and created a longer document. I hope this document is helpful and can be used as a reference in the future if anyone asks why running MEV-Boost with ePBS is not a viable strategy. The equations should suffice as a basic proof of why ePBS timelines are shorter than MEV-Boost. Feedback is welcome: https://hackmd.io/@ttsao/comp_epbs_timelines",
        "created_at": "2024-06-06T19:33:47.869000+00:00",
        "attachments": null
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "When you say Proposer can unseal it, do you mean proposer can unseal the bids for everyone to see or just herself? If it is the first one, it is a situation similar to bid leakage in the sealed bid auctions. If it is the later, the that is perfectly fine within the definition of sealed bid auction because proposer is the seller of the block rights.",
        "created_at": "2024-06-06T21:08:46.679000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's the former",
        "created_at": "2024-06-06T21:12:19.468000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The point is that there's nothing to gain by forcing the bid to be sealed",
        "created_at": "2024-06-06T21:12:39.357000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Either way",
        "created_at": "2024-06-06T21:12:43.808000+00:00",
        "attachments": null
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thank you for your patience. I am a beginner and that’s why all these questions. Trying to understand your work.",
        "created_at": "2024-06-06T21:16:07.699000+00:00",
        "attachments": null
    }
]