[
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "the incentives are the same as today, as in, they are not mitigated with epbs (but also not made worse). \nfor (2), it just means that the withdrawal credential alone is not sufficient, as it is also not sufficient today.\nwith mev, the mev payment itself is handled out of protocol and the native fee recipient is set to something else.\nnot sure what's best.\n\none solution could be that the fee recipient of external bids has to be always set to the proposer's withdrawal credential, or zero address if still on 0x00 credential.\nand then, the builder would simply subtract the priority fees from its own payment (as the prio fees go to the withdrawal credential instead of the builder now)\nand the actual mev payment could be done using a 0 ETH transfer that pays everything using a giant priority fee.\nso, the total payment is always solely the sum of priority fees, whether doing local block building or accepting a bid.\nand one could use eip-7799 and prove to the CL that the prio fees actually matched the bid amount.\nthat would fix the bid amount being solely advisory, would improve transparency by having the fee recipient always be the fee recipient, and would encourage transitioning away from 0x00 credentials as they could not be used profitably with external bids (local building still works)",
        "created_at": "2024-11-18T14:48:14.950000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Well, the point is that without the withdrawal credential ePBS makes it definitely worse than today. Adding a new prefix makes it as today and pools are already happy with this. I am hoping that there's something in the middle, by which pools for example could simply whitelist the builders they trust (as they do today with relays) and then do not accept any blocks from their operators with a bid from other builders. Still this is not good enough though and is strictly worse than today",
        "created_at": "2024-11-18T19:00:53.045000+00:00",
        "attachments": null
    }
]