[
    {
        "author": "tomi0x",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's probably a naive question, but will there be seperate consensus spec tests for eip-7732?",
        "created_at": "2024-10-20T18:39:52.728000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "There will be new spec tests after we have devnets and we begin seriously pushing it for F star upgrade. We haven't written any new spec tests for 7732. The majority of the effort previously (potuz) was focused on getting existing spec tests to pass in order to satisfy CI/CD.",
        "created_at": "2024-10-20T19:47:47.504000+00:00",
        "attachments": null
    },
    {
        "author": "tomi0x",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks, I was thinking spec tests before devnet",
        "created_at": "2024-10-20T19:55:46.377000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Maybe I should have clarified better, by devnets I meant client milestones. Peerdas for example: https://notes.ethereum.org/@ethpandaops/peerdas-devnet-0. It's less official than a devnet, more like a client-independent or interop devnet",
        "created_at": "2024-10-20T19:59:38.073000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "not really, this is a daunting task to work on for a feature that hasn't been agreed to be CFId, I at least am not volunteering to do that work. Also while it seems that most of the spec is somewhat frozen, some areas are not, if we go with \u003c@520034910149410861\u003e's approach to forkchoice, we would have dramatic changes in the forkchoice rule and the payment system (processing of the bid/header). So writing forkchoice test vectors may be a lot of work for nothing",
        "created_at": "2024-10-20T23:34:22.713000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "As a reference, the PR to just make the current tests pass is here (it's a little outdated since the requests were moved away from the payload) https://github.com/ethereum/consensus-specs/pull/3854",
        "created_at": "2024-10-20T23:43:57.880000+00:00",
        "attachments": null
    }
]