[
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "What do you mean with the \"critical time\" here? It looks like slot auctions solve the problem of builders not revealing regardless of the time between reveal and PTC right?",
        "created_at": "2024-07-30T10:23:21.361000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Slot auctions make that time worse because the incentives to delay the reveal are higher",
        "created_at": "2024-07-30T10:24:30.654000+00:00",
        "attachments": null
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Intuitively, slot auctions move the brunt of the timing games from the bidding deadline to the reveal deadline. Is one worse than the other?",
        "created_at": "2024-07-30T10:29:09.413000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't see why the claim that there won't be a bidding timing game. And yes, the reveal one is worse anyway",
        "created_at": "2024-07-30T10:31:42.472000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Because consensus validation is much faster than Payload validation",
        "created_at": "2024-07-30T10:31:59.923000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "But PTC doesn't vote on validation, and they are guaranteed not to be reorged",
        "created_at": "2024-07-30T10:32:44.689000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think with slot auction, you can just assume to lose 3s of execution validation time unless you move the PTC deadline earlier, which is possible",
        "created_at": "2024-07-30T16:23:12.836000+00:00",
        "attachments": null
    },
    {
        "author": "maxr2415",
        "category": "Cross-layer",
        "parent": "",
        "content": "well you can just slash them if they don't reveal",
        "created_at": "2024-07-30T17:58:47.330000+00:00",
        "attachments": null
    },
    {
        "author": "maxr2415",
        "category": "Cross-layer",
        "parent": "",
        "content": "the problem is you need to have enough at stake",
        "created_at": "2024-07-30T17:58:54.777000+00:00",
        "attachments": null
    },
    {
        "author": "maxr2415",
        "category": "Cross-layer",
        "parent": "",
        "content": "many cases not revealing is worth orders of magnitude more than the reasonable slashing limit",
        "created_at": "2024-07-30T17:59:09.042000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "is not about not revealing, they need to have the right to not reveal on weak blocks, that's a given. Slashing is not used for non-safety issues on chain and specially for things that aren't provable on chain like not revealing something. The problem is that they will always reveal as late as possible, this bad incentive is inherent to slot auctions. We can decide that it's not that bad of a problem (as we do today with the attestation deadline) but it's not obvious to me",
        "created_at": "2024-07-30T18:19:33.532000+00:00",
        "attachments": null
    },
    {
        "author": "kboom_ro",
        "category": "Cross-layer",
        "parent": "",
        "content": "Couldn't builder reveal time be a metric in an eventual CL client configurable scoring system?",
        "created_at": "2024-07-30T18:25:06.147000+00:00",
        "attachments": null
    },
    {
        "author": "kboom_ro",
        "category": "Cross-layer",
        "parent": "",
        "content": "Client settings are already used as Schelling points today",
        "created_at": "2024-07-30T18:26:36.188000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "definitely",
        "created_at": "2024-07-30T18:26:43.143000+00:00",
        "attachments": null
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't claim there won't be a bidding timing game but I think it'll be a lot less than the bidding + reveal timing game",
        "created_at": "2024-07-30T21:16:01.170000+00:00",
        "attachments": null
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think the types of timing games we see today are different from the ones you are describing here. Currently, we see proposers playing timing games, and we do not want this because it means proposers must be sophisticated, so the research thread around attester proposer separation (execution tickets, etc) has gained momentum. Timing games related to bidding are proposers playing timing games to gain a higher bid. Timing games related to revealing are builders playing timing games. I think the ecosystem is more at ease with builders playing timing games, as these are sophisticated entities and are expected to be able to handle this additional duty fairly well. So slot auctions may be better with respect to timing games that lead to centralization of the validator set",
        "created_at": "2024-07-30T21:20:47.024000+00:00",
        "attachments": null
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Missed execution payloads are a different problem. Builder timing games could lead to more missed execution payloads, but enforcing a block auction could also lead to this as \u003c@135497428882292736\u003e points out and as written in the earlier block vs slot auctions post",
        "created_at": "2024-07-30T21:21:58.824000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Which is why a quantification of these problems would be good to have, there are many reasons why revealing late may be bad, not only missed payloads but split head views, advantage in producing the next Payload, some bad interactions with IL proposers if using focil etc.",
        "created_at": "2024-07-30T21:40:35.660000+00:00",
        "attachments": null
    }
]