[
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "If interested there are some experiments in our paper with \u003c@841217748942979072\u003e https://arxiv.org/pdf/2110.10086.pdf\n\nIt shows that it’s possible essentially. It’s also hard to reason about “it only happens rarely” because the losses can be unbounded (see low carb crusader attack resulting from unbundling)",
        "created_at": "2024-02-12T11:08:48.402000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "But this is completely different: 1) the issue here is whether you can actually split the vote of mainnet attesters on a percentage you control and 2) you cannot unbundle the builder in ePBS: even if your attack succeeds you can't execute the transactions in the same slot as the low carb crusader.",
        "created_at": "2024-02-12T11:12:34.889000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "1) seems to be what the paper does (section 4.4), you try to split attesters' views according to some fraction. For 2) I don't know if it's always relevant, if the txs are \"slot-protected\" (only valid in the current slot) then yes it's not an issue, but afaiu most txs aren't",
        "created_at": "2024-02-12T11:28:30.518000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Perhaps I'm missing something in that paper but I see only simulations based on propagation time, not an actual meassurement of voting as a function of propagation time or similar. I don't want to claim that this attack is hard, honestly asking p2p experts if it's even possible. As for the unbundling, I was told that searcher's txs are indeed timestamp gated regularly. But yeah, this attack, if possible needs to be solved. Just pointing out that it's very very different than the equivocation attack which can't happen in ePBS",
        "created_at": "2024-02-12T11:35:28.348000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "If you have actual error bars on voting vs propagation time we can get enough statistical information to see if you can actually control the split or at least how often you can bet for it",
        "created_at": "2024-02-12T11:36:42.855000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "For sure, not claiming that the conditions for the attack would be the same (equivocation isn't enough), just pointing out that unbundling can have unbounded losses. I don't think it would be too hard to extend from propagation time to attester weight, if you can estimate a rough distribution of stake over the network topology (possible with subnets maybe?)",
        "created_at": "2024-02-12T11:37:24.505000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "No one has a clue about how is the network topology, and this is one of the reasons why measuring the impact of episub is impossible until it's been deployed (or so they tell me). But most importantly, averages don't really matter here. If you submit your block at say 3.8ms and you get 40/60 split every single time, then you can definitely attack the network, but if across all your submissions at 3.8ms you get a normal curve ranging from 0/100 to 100/0 splits, with peak at 40/60, then you can only bet on your attack stochastically",
        "created_at": "2024-02-12T11:40:33.165000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "and that is quite a different outcome",
        "created_at": "2024-02-12T11:40:42.727000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "The standard deviation was pretty small so I think you can target rather precisely, mostly because the distribution of nodes is quite peaky, you have many clustering in the same datacentre, so if you can \"turn on\" enough of these centres while not turning on the others, you can have a pretty permissive range in which to release, that activates the right amount",
        "created_at": "2024-02-12T11:46:02.382000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ah I'd be very interested in an accurate measurement of this. Ways I've been thinking on dealing with this would be to have a non-fixed proposer boost: as long as the attacker can't control the split it needs to generate one can probably at least heavily mitigate the attack",
        "created_at": "2024-02-12T11:48:34.039000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Others could be allowing the builder to submit a proof with his payload that his block should be canonical or that he was allowed not to submit, but I can't think of anything that would work as proof here.",
        "created_at": "2024-02-12T11:50:15.977000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I wrote up some beacon chain changes here: https://ethresear.ch/t/minimal-epbs-beacon-chain-changes/18653",
        "created_at": "2024-02-12T14:49:27.409000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "What are problems of making PB a dynamic value? Something that can't be known until the builder reveals (or not). This way the balancing attacker can't really know in advance how to even decide the split. This is not equivalent to giving the builder/or the PTC forkchoice weight since it only affects how much advantage the n+1 proposer gets",
        "created_at": "2024-02-12T23:38:48.948000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This also allows the builder to know *before* it reveals what the PB is and he can gauge with the seen attestation if there is a weak block or not",
        "created_at": "2024-02-12T23:46:15.464000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "this should reduce considerably to just the eventual sutation caused not by an attack",
        "created_at": "2024-02-12T23:46:37.928000+00:00",
        "attachments": []
    }
]