[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is the candidate CL PR for ePBS. \u003c@363800010518822915\u003e is working on the Python executable part. Core logic should be fine.  Should be still quite rough and buggy, but it's quicly converging to what it will be open as an EIP. https://github.com/potuz/consensus-specs/pull/9",
        "created_at": "2024-06-25T12:16:08.436000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think we need to open this EIP without any engine changes. Let me argue here and someone can voice if there's something wrong. The vanilla client will request a payload at the beginning of the slot with `engine_newPayloadV4` (payload doesn't change from Petra) and the CL can build the bid and self include in the block.  If anything we need to work out the Builder API, but I think that's better to leave outside the scope of the EIP since it's actually off-protocol.",
        "created_at": "2024-06-25T13:01:59.044000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think it's `engine_getPayloadV4`. `engine_newPayloadV4` is used for `process_execution_payload`",
        "created_at": "2024-06-25T14:44:05.350000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Other than that, I agree with your take",
        "created_at": "2024-06-25T14:44:20.021000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Before I forget. Today I heard a new argument that I wasn't aware from \u003c@269786774660710400\u003e: I'm not going to get this like he put it so take this as just my interpretation: builders co-locate to relays. The fact that there's few relays actually makes it cheaper to do so. In a world in which the request comes from anywhere, then the builder that co-locates to more proposers wins. This does smell like a centralizing factor, albeit quite constructed",
        "created_at": "2024-06-25T21:18:20.941000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's ultimately a tradeoff. Even if builders co-locate to relays, they still have to send the payload to the relayers, which adds an extra hop. From a cost perspective, it might be more economical for relayers rather than builders to open their RPC ports due to economies of scale, though it's not free. Both builders and validators pay relayers for this service. In EPBS, trusted builders could also team up and share a single RPC port.",
        "created_at": "2024-06-25T22:15:37.679000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The point is that if there's only 3 relays and they run in two places then you need to rent AWS in those places. If OTOH proposers from everywhere will be calling the builders directly, then whomever locates closer to them wins",
        "created_at": "2024-06-25T22:18:22.161000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "why closer wins? is there timing game? A `getHeader` call that travels 200ms beat out 100ms because more time to build.  I think the core argument here is relayer allows more equal footing timing game which all proposers and builders can play down to the last ms",
        "created_at": "2024-06-25T22:23:41.067000+00:00",
        "attachments": []
    }
]