[
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "the 0x02 credential doesn't fully fix (2). one can also steal mev by inserting a separate transaction within the payload and only pay the minimum to the fee recipient.\nthe staking pools mitigate by requiring a minimum bond, in rocketpool case the plan is that operator needs to deposit 4 ETH of their own to protect against mevsteal twice before unlocking ability to open 1.5 eth validators. the bonded eth gets used first in case of mevsteal or slashings",
        "created_at": "2024-11-16T02:17:50.727000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "more context for (1), the problem scenario stems from withdrawals getting deducted in the CL before a valid payload is created. \nthe extreme case is imagining payload building failures for 30 minutes, but CL finalizes the chain. then, widespread resyncing using checkpoint sync. now, how to build a payload without access to the withdrawals that were already deducted in the CL long ago.\nmoving the withdrawal debit to the payload reveal timing is tricky, because the payload is being built during the previous slot and then selected by the proposer. during the previous slot the builder doesn't know what operations the proposer will end up including, so the withdrawals cannot easily be moved _after_ operations (right now they happen before operations are processed). that's the 'caching the withdrawals in the state' that potuz is referring to",
        "created_at": "2024-11-16T02:21:51.894000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "For 2) pools will whitelist builders and not allow operators to be builders",
        "created_at": "2024-11-16T02:35:57.906000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "In fact I'm hoping to avoid the extra new credentials.  Perhaps \u003c@77492786336636928\u003e can chime in here?",
        "created_at": "2024-11-16T02:36:53.494000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e  one can also steal mev by inserting a separate transaction within the payload and only pay the minimum to the fee recipient.\n\nSorry I dont understand this. Payment are done in consensus. Staking pool operators and buildrs cant collude using execution layer for payment. I think as long as Staking pool doesn't allow operators to be builders aka dont enable 0x02 withdrawal then this is safe...",
        "created_at": "2024-11-16T13:19:16.028000+00:00",
        "attachments": null
    }
]