[
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Has anyone checked whether it is a big problem for builders that they need a balance on the CL now? Is this a big enough point for builders to still prefer using a relay? Will relays still operate?",
        "created_at": "2024-10-01T15:27:22.969000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I talked to the big builders and they laughed at the idea that it would be a problem",
        "created_at": "2024-10-01T15:50:45.701000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "They're all invested in ETH anyway",
        "created_at": "2024-10-01T15:50:56.403000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@199561711278227457\u003e would you or anyone in your team be up to write the block explorer for an ePBS devnet? I understand if you're clogged I can beg for help from the community",
        "created_at": "2024-10-01T15:52:42.960000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Cross-layer",
        "parent": "",
        "content": "strictly in the domain of \u003c@808969530608451584\u003e or \u003c@131476523050860545\u003e from our team 😄\n\ni'd let them check how big of a lift it would be. we have a fork for verkle, so no reason epbs cant get one",
        "created_at": "2024-10-01T16:04:07.558000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I suspect this should be a bigger project, but I'd be very happy to be wrong",
        "created_at": "2024-10-01T16:05:23.259000+00:00",
        "attachments": null
    },
    {
        "author": "pk910",
        "category": "Cross-layer",
        "parent": "",
        "content": "yea, I just read through the eip, it sounds like a dora thing and I'm happy to work on it 🙂\nbut definitely not a small thing as splitting out the ExecutionPayload from the block body touches a lot of things 😄\nDo you have any special ePBS views in mind?\nI think most of it can be covered by just a 4th block state (\"Empty\"), and the additional logic for handling deferred ExecutionPayloadEnvelopes. Guess there will be another event on the RPC event stream similar to `block` for the payloads and separate endpoints to fetch the payloads from?",
        "created_at": "2024-10-01T16:43:50.875000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Oh yeah we need to add an RPC event stream, I'll add this to the next breakout notes, I suppose this will go in the beacon APIs, my allergies prevent me from looking at that repo. I am not really sure what's the best approach to actually display the data, but for us on a devnet what would be fantastic is if the CL block shows just as today with the info in it (like we will be able to see who's the commited builder from the block) and then fill a link in that block to the execution block once it's revealed",
        "created_at": "2024-10-01T23:16:13.321000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "same changes in the forkchoice explorer as well, nodes should be filled with different colors for blocks that build on empty or on full",
        "created_at": "2024-10-01T23:16:58.876000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'd be eternally grateful for any work on making it possible to run a single client devnet on kurtosis and check if it's actually working, happy to hop on calls for designs",
        "created_at": "2024-10-01T23:17:59.537000+00:00",
        "attachments": null
    }
]