[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thoughts on the safety of the following? The spec asks to continuously process attestations in forkchoice but as far as I know all clients batch them. In principle if your current head is for the current slot (for example right after syncing the block and you computed head) then later during the slot it may cease to be head because of lots of attestations to older blocks. However we don't find this out until we process those attestations later. \n\nNow I'm thinking in implementing the following for forkchoice processing when syncing the Payload:\n\nIf we aren't proposing the next slot:\n- do not check attestations nor PTC when syncing the Payload \n- do not update head at all\n\nIf we are proposing the next slot do the inverse but as follows\n- compute head as always regardless of Payload. \n- if the Payload is not from that head then do not update head.\n- if the Payload is for that head then, and only then check for PTC (AC in Francesco's lingo) to see if I need to enforce it. \n\nFor prysm this simplifies things a bit. It does make RPC a bit wrong in that the EL will have the wrong blockhead at the tip for a couple of seconds until we call to get head during the rl next slot. But other than this, anyone sees big disadvantages?",
        "created_at": "2024-11-04T11:38:53.443000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@520034910149410861\u003e another observation for your design (this doesn't apply for 7732). If there's a collusion proposer-builder, the block may come very late and the Payload timely get a majority of the PTC vote. I don't want to have the PTC counting attestations so I think we need to make anyway the honest reorg property mandatory, so even if you have 100% of the PTC vote, if the block is weak it will be reorged",
        "created_at": "2024-11-04T11:47:49.464000+00:00",
        "attachments": null
    }
]