[
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "fixed some eip-7732 typos here: https://github.com/ethereum/consensus-specs/pull/3902",
        "created_at": "2024-08-27T20:33:34.856000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@881905303011086387\u003e has been reviewing eip7732 in this pr: https://github.com/ethereum/consensus-specs/pull/3828\nthere are some open questions as to how PTC's minimal config is may be an issue for minimal testing \u003c@755590043632140352\u003e",
        "created_at": "2024-08-27T20:36:23.126000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I had seen a previous review will take a look this week again",
        "created_at": "2024-08-27T20:42:10.187000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@363800010518822915\u003e \u003c@755590043632140352\u003e have implemented light client tests for EIP-7732 branch. `make gen_light_client` works without errors.\n- https://github.com/potuz/consensus-specs/pull/18\n\nThe minimal extra LC requirement is a `latest_execution_payload_root` in the `BeaconState` that commits to the latest accepted `ExecutionPayload` via SSZ HTR, so that the same data can be provided as today: http://unstable.mainnet.beacon-api.nimbus.team/eth/v1/beacon/light_client/optimistic_update\n`latest_block_hash` is still needed for engine API but may be moved off-chain if CL implementations can look it up from the locally stored `ExecutionPayload`.\n\nThere are some rough edges unearthed by the PR that are worth highlighting:\n- The ePBS test framework does not expose payloads anywhere and also does not have any way of testing the happy case, as evident by above typo PR that proofs that no payload was ever successfully applied in any test. I have made a `create_full_block` helper in `light_client.py` that works around this limitation for the LC test scope, but the test framework requires proper updating eventually (out of scope of my PR).\n- There is a naming confusion about `ExecutionPayloadHeader` meaning SSZ summary in some cases but an ePBS bid in others. This is spread through the entire test codebase, for example payloads are built on top of the latest bid (even if un-confirmed), and also notably in `initialize_beacon_state_from_eth1` where a bid is put into the genesis state (but assumed to have been revealed already). This is out of scope of my PR and needs fixing.\n- EL block hashes are incorrect everywhere, and EL block numbers don't properly increment. Again, out of scope of my PR.\n- The PTC is disqualified from regular attestations and won't count for finality, requiring large validator sets to finalize in tests (slow to test).",
        "created_at": "2024-08-27T22:42:19.442000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@881905303011086387\u003e it goes without words that I'm very thankful for this! I'm in a tough week but will look at this slowly. Indeed the testing framework is non existent. I spent weeks getting the current tests to pass. I think in order to convince \u003c@415109946682769408\u003e of merging that we will need some more signal that this is going to be shipped eventually. I'm in the same boat: I don't want to spend time writing new tests if they may never see mainnet",
        "created_at": "2024-08-27T23:12:24.702000+00:00",
        "attachments": null
    }
]