[
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "another disadvantage of ePBS would be the extra 12s latency for verifying light clients (wallets, bridges etc). in its current form, the latest valid execution payload info in the state is updated on payload, so is not part of the beacon header that is signed by sync committee.\n\nthat one may be fixable though, through multiple means of which I'm not sure what's the best way:\n- have sync committee only sign when payload is valid not just available. in that case the reward would be flipped, as in, if state is not on a valid payload for its slot then being inactive provides the reward while being active nets a penalty\n- signing the latest payload instead of the latest beaconblockheader. that way the state is up to date (and beaconblockheader can be extracted from payload \u003e beacon_state_root \u003e latest_block_header)\n- ... other ideas, the list is not exhaustive\n\nin any case, best case it's neutral worst case it's a disadvantage",
        "created_at": "2024-11-19T14:16:24+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah I consider this in the same bucket as tx inclusion delay: any CL information is 6 seconds (not 12) displaced",
        "created_at": "2024-11-19T14:26:54.070000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "with protocol adjustments to the sync committees it can be lowered to 6, yes. if the sync committee is kept as is (signing the beacon header) then it's 12s more than today, because the beacon header only commits to a state root that contains the payload a slot after.",
        "created_at": "2024-11-19T15:45:43.499000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "btw. another aspect to consider is that the concept of invalid payloads will go away with the beam chain. there can still be unavailable payloads. I'm not sure if that is a different case in epbs, but at the very least should be explicitly considered so that the design can be retained through the beam chain without large adjustments.",
        "created_at": "2024-11-19T15:47:27.387000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Why would invalid payloads go away?",
        "created_at": "2024-11-19T15:56:39.690000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "zk ensures it is always valid",
        "created_at": "2024-11-19T15:56:55.930000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Oh you mean in the beam chain... Yeah, well, I wish I could be Justin and be able to bypass ACD altogether. For the time being I'll specify the EIP to be applicable for the next fork",
        "created_at": "2024-11-19T15:59:06.893000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah, beam chain. just a thing to be aware of, as some parts may become obsolete. the general split of the EL data away from the CL is still relevant though, regardless of epbs vs execution tickets vs whatever beam chain wants to use",
        "created_at": "2024-11-19T16:00:00.481000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "to his defense, the zk stuff is part of the vitalik roadmap (verge) as well.",
        "created_at": "2024-11-19T16:01:40.272000+00:00",
        "attachments": null
    }
]