[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Something that \u003c@1010280066028142662\u003e realized: in my original design with heavily staked builders inclusion lists were a must. But in this design they aren't really mandatory. The option for non censoring builders to advertise themselves directly is already a slightly better option than the status quo. We could in principle work out first ePBS without forced inclusion lists",
        "created_at": "2024-04-11T10:42:58.794000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Added a comment about this do the document and have only 36 extra characters left in the hackmd, so won't be making additions, will wait a few more days before posting on eth magigians. I suggest we do a PoC with empty inclusion lists before and no EL validation/storage of balances etc.. so that most of that complexity is gone. I'll finish up the remaining python spec and API markdown files today/tomorrow, crucially missing is forkchoice's block slot and payload boosts implementations. I have one for prysm or Caplin-like forkchoices where we keep a tree instead of the protoarray. Will try to adapt it to the python version",
        "created_at": "2024-04-11T12:25:40.947000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Does it matter for EL if we call fcu with payload attribute first then call new payload after?",
        "created_at": "2024-04-11T13:19:06.086000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "we can just test that today",
        "created_at": "2024-04-11T13:19:20.719000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I didn't understand \u003c@363800010518822915\u003e",
        "created_at": "2024-04-11T13:21:24.483000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ah sorry just read your message",
        "created_at": "2024-04-11T13:42:20.259000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think that's wrong, I don't think there's any need to call to FCU after the CL block syncing",
        "created_at": "2024-04-11T13:42:38.504000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "FCU should be called after the execution payload syncing",
        "created_at": "2024-04-11T13:42:53.902000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Makes sense. FCU isn't about consensus head. It's about execution head with respect to consensus. It's only right to call that after execution payload syncing, or at the 8s mark with a `lateExecutionPayload` routine",
        "created_at": "2024-04-11T13:45:12.719000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I wonder if there's a critique here that could say EL have less time to prepare for a block. I think that's weak though. Mempool content doesn’t change. The only thing that changes is EL has less time to order the transactions. But this doesn’t matter for solo validators, they don't heavily order transactions. And builders are always building blocks anyway, it doesn’t change for them either.",
        "created_at": "2024-04-11T13:49:30.960000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I  think there's a mixup here:  FCU should not be changed from today, you would call it normally when the EL block is synced after 6 seconds into the slot. You do not need to normally call when the payload does not appear. \n\n**if** you want to be a builder for next block (for example if you are also the proposer of the next block and therefore you know you can win the auction) then you would call FCU with payload attributes on the event that no block or no payload has appeared. \n\nI think it's true that there's less time to produce a block on ePBS: you start packing as soon as you see the payload (second 6) and you finish packing when the CL block requests the bid, so there are 6 dead seconds in the slot regarding this",
        "created_at": "2024-04-11T13:56:03.486000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah. I was purely talking from the perspective you want to proposer a block for the next slot `n+1` and we are at `n`. I think we are on the same page",
        "created_at": "2024-04-11T13:58:40.495000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e I think it's true that there's less time to produce a block on ePBS: you start packing as soon as you see the payload (second 6) and you finish packing when the CL block requests the bid, so there are 6 dead seconds in the slot regarding this\nThis is why it prompted me thinking maybe we can to signal EL that I am a proposer for the next slot at the 3s mark. But knowing that payload will not be certain until the 6s mark. This probably is an overkill to current design and will require another engine API end point",
        "created_at": "2024-04-11T13:59:57.624000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "you can't signal the EL to start working on a payload if it doesn't have the head block, so no, it's impossible to start building a block before 6s on ePBS",
        "created_at": "2024-04-11T14:26:55.375000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "yea you are right here",
        "created_at": "2024-04-11T15:41:27.606000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "It sounds to me like this would affect both solo validators and builders. Builders building on all possible heads isn't useful if the head block is not known",
        "created_at": "2024-04-11T15:42:58.020000+00:00",
        "attachments": []
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "A comment: seems to me that PCT plays an important role. Is the 512 size of that committee coming from some sort of reasoning?",
        "created_at": "2024-04-11T15:58:43.488000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "You take the total validator size, assume % of it is malicious, and you sample them for a committee size, see how long it would take to influence \u003e50% of the PTC committee size. You want a size where an extra aggregation step is not required so we can keep everything under 12s.",
        "created_at": "2024-04-11T16:01:10.475000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Let me pull out the number for 512 committee... one sec",
        "created_at": "2024-04-11T16:01:25.184000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "For 512 size, a 35% attacker will need 20k years",
        "created_at": "2024-04-11T16:02:15.815000+00:00",
        "attachments": []
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "Seems like small enough to not push to much data on a global topic",
        "created_at": "2024-04-11T16:02:17.262000+00:00",
        "attachments": []
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "I see",
        "created_at": "2024-04-11T16:02:53.032000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "We need these messages to be aggregated fast, an attack on the PTC is a succesful attack on the builder, so we do want to have assurances that these messages can't be eclipsed, but ultimately we want them to be lightweight enough to travel jit to the next proposer. The number 512 seemed borderline, it's secure enough in the statistical sense, but also small enough that we can quickly switch it (instead of something more permanent like the sync committee) and have it in a global topic.",
        "created_at": "2024-04-11T16:27:17.494000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think 1024 was already large enough for this if I remember the napkin math Nishant did",
        "created_at": "2024-04-11T16:27:47.163000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "We are not doing another aggregation round, though. The proposer will be the only one to aggregate for the next block. I think 3 seconds should be enough. 1 second to gossip over p2p and still have 2 seconds left.",
        "created_at": "2024-04-11T17:20:02.975000+00:00",
        "attachments": []
    }
]