[
    {
        "author": "l_guy",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hi, \u003c@755590043632140352\u003e...I've spent considerable time diving into the theoretical aspects of PBS and ePBS, wrote the PBS and MEV sections of the EPFsg wiki. Currently, collaborating with \u003c@322809371140816896\u003e as well to restructure and add the consensus spec to ePBS section.\n\nGetting to the point, sorry if it's not the right place to ask but, I'd like to contribute to ongoing R\u0026D for ePBS, Could you maybe or anyone guide/point me to where might be a good starting point for contributing?\ntldr; on my background I've fair understanding of geth and currently in the process of deep-diving into the prisma client, have good amount of experience writing code in go and js/ts",
        "created_at": "2024-04-14T19:07:05.701000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Great, thanks! yeah indeed there's several aspects in which you can help. If you're interested in the specification side, some people have complains that I don't even consider valid  about bipasseability, others about whether ePBS should happen or not, I don't want to get there.  The biggest actual problem with the current design is about reorg resistance against colluding parties. Currently a proposer is safe against 1-slot ex-anti reorgs up to against an attacker controlling 40% of the stake.  In the current specification this goes down to 20% assuming the attacker controls also the network splits as he wants. Some immediate action points:\n- Check that in fact the 20% assertion is correct  in the analized cases.\n- Study the spec to see if there are better attack scenarios that reduce the 20% threshold. \n- Write down the complete situation for multiple slot reorgs, wether the attacker can keep the payloads, what are the thresholds etc. \n- Check if there are better solutions with stronger forkchoice guarantees\n\nOther action points are as follows. I will open the full python spec PR for review this week, currently it's fairly advanced but forkchoice is missing a big chunk and the APIs have some copy-paste text that needs to be removed. Once that's up (or now as long as it's on the fully ready files):\n- Review the python spec PR. \n- Check that indeed the spec conforms to what it's written in the design doc\n- Check that everything in the design doc is actually covered in the python spec.\n- Check if there are more edge cases to consider.",
        "created_at": "2024-04-14T23:48:33.307000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "We probably can use more help on the p2p spec",
        "created_at": "2024-04-14T23:53:56.101000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e have you added the rpc end points? One to request payload. Another one to request IL. Even we are aiming to have empty IL for PoC. It's still valuable to spec it as close to complete as possible",
        "created_at": "2024-04-14T23:55:19.421000+00:00",
        "attachments": null
    }
]