[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Fwiw, I think the clients should actually implement the full builder path \u003c@388751025789468672\u003e because this allows **any** validator to set a lower bound on the cost to censoring.",
        "created_at": "2024-04-24T09:58:04.174000+00:00",
        "attachments": []
    },
    {
        "author": "ryanleeschneider",
        "category": "Cross-layer",
        "parent": "",
        "content": "Overall lgtm!  One question/thought RE: \n\n\u003e this is the first signed bid seen with a valid signature from the given builder for this slot\n\nIs this to prevent excess p2p traffic?  Will this encourage MEV-related timing games?  \n\nI could also see builders staking multiple times to get around this: one builder index produces payloads \"quickly\" so they have a bid out, then a second builder account is used to send a more profitable block near the time limit.  If this strategy is successful it could lead to the \"real\" cost for staking being a multiple of the \"base\" staking cost, especially if it turns out that having three or four such accounts releasing blocks at different times within the slot proves to be the best strategy.\n\nIf this does turn out to be an issue though I think this can be pretty easily tweaked to say this is the `Nth or less` signed bid from a given builder instead of first (clients just need to keep a map from builder index -\u003e count instead of a set of seen builder indices per slot), where `N` is small.",
        "created_at": "2024-04-24T14:18:04.412000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e Is this to prevent excess p2p traffic?  \nYes, builders can spam the network as **any** validator can send messages\n\u003e  Will this encourage MEV-related timing games?\nI doubt it, no serious builder will be sending bids over the P2P network since those are bound to lose. Client teams, community members, or even default software may send those bids for liveness/security/censoring reasons, but the top builders will open their HTTP points for validators to request them",
        "created_at": "2024-04-24T14:29:07.169000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e .... is used to send a more profitable block near the time limit. \nThis is useless cause bids over P2P **can always be beaten** by bids requested over HTTP: the builders will have seen them themselves, and the very last thing the proposer does is request bids directly before chosing them",
        "created_at": "2024-04-24T14:30:42.470000+00:00",
        "attachments": []
    },
    {
        "author": "ryanleeschneider",
        "category": "Cross-layer",
        "parent": "",
        "content": "Makes sense, thanks for answering my questions (terence too of course!).",
        "created_at": "2024-04-24T15:13:46.914000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@268793214906007562\u003e Thank you for the thorough reading of the PR, I applied all non-naming changes. I agree that the names I chose are non-descriptive, but I feel that people are always passionate about naming and go to great lengths to bikeshed and arguments about naming that I rather do that at a much later stage. I'm hopeful that this gets merged into mainnet, and by the time we are arguing only about names, I am no longer involved in this project.",
        "created_at": "2024-04-24T16:35:30.357000+00:00",
        "attachments": []
    }
]