[
    {
        "author": "ryanleeschneider",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ah I think I misunderstood the above drawing step around t=9 \"Builder: Bids production and publication\" as saying that builders would start announcing their bids over p2p but after re-reading https://hackmd.io/@ttsao/bypassing-relayer the proposer requests the bid directly from the builder.",
        "created_at": "2024-04-23T15:20:37.231000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'll clarify it in my document. There are three common methods for proposers to build their beacon blocks:\n- Solo validator: The proposer retrieves the payload from a local EL client, builds the beacon block and the execution payload, signs them, and broadcasts them all together.\n- Get bid over P2P: The proposer receives the bid via P2P gossip.\n- Get bid via RPC endpoints: The proposer subscribes to a list of RPC endpoints, similar to today's MEV-boost.\n\nWe cannot fully rely on RPCs to maximize liveness and provide fallback, so we have a bid gossip network. It's also possible for a bid to occasionally have higher value in P2P.",
        "created_at": "2024-04-23T19:00:37.517000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks for clarifying!  A follow up question RE: p2p gossiped bids: have we decided on how the bids will be enforced?  Will the builders need to stake to gossip a bid, and slashed if they gossip a bid w/o producing the block, or will there be some other mechanism in place to prevent bad actors from gossiping bogus bids?",
        "created_at": "2024-04-23T23:06:28.676000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes, in the current design, the builder must maintain a balance in the consensus state as it is staked. A bid is considered valid only if the builder has enough balance to cover the bid amount. These bid objects are small and, according to the gossip rule (which is still under refinement), we can specify that a validator will only re-gossip a builder's bid if it exceeds the previous amount. Alternatively, we might allow only one builder bid per slot. This is yet to be determined. Take a look at the conditions here: https://github.com/potuz/consensus-specs/blob/ae354164462643c3c0c9a8a3e8eb6a1285d09c38/specs/_features/epbs/p2p-interface.md#execution_payload_header Let me know if you think we are missing anything",
        "created_at": "2024-04-23T23:17:05.886000+00:00",
        "attachments": null
    }
]