[
    {
        "author": "nishant0",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't understand this, wouldn't the same attack apply to proposers today vs builders in epbs ? If controlling how the block vs payload is gossiped a sophisticated actor could possibly do it in both situations",
        "created_at": "2024-02-10T03:47:41.742000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "But today the block is gossiped by the relay, not tl the proposer, so if the relay believes the block will be weak they don't even take a call to get the payload",
        "created_at": "2024-02-10T08:58:38.191000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Cross-layer",
        "parent": "",
        "content": "weak in what sense ?",
        "created_at": "2024-02-10T09:02:58.202000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "In the sense that the proposer asks for a payload at 3.9 seconds into the slot",
        "created_at": "2024-02-10T09:09:04.078000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "To summarize. Today this dilemma is faced by the relayer. The relayer will always favor the builder. If it's too close to the deadline. Relayer will be conservative and just let proposer to miss the block. There's no unconditional payment. Proposer is powerless here.\n\nBut unconditional payment is nice. It shifts some power back to the proposer, but builder will face this delimma on what to do if the block is close to the deadline",
        "created_at": "2024-02-10T15:42:15.052000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "The builder is, in general, in a better position than all but the largest proposers/staking pools in this regard. There are fewer of them, and their ability to win bids isn't tied intrinsically to owning tens of millions or hundreds of millions of USD worth of staked ETH. It's more reasonable to ask builders and relays to gamble here than proposers.",
        "created_at": "2024-02-10T15:53:10.818000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "They can play the expected value game every slot, whereas even for proposers with, say, 1000 validators (large for \"individual\" stakers) only even get a chance to play 0.1% of the time.",
        "created_at": "2024-02-10T15:54:46.810000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The attack depends heavily in the possibility of splitting the view along the lines of PB: if this is indeed possible by a possibly sophisticated player then this is more than just a gamble for the builder: pools get consecutive blocks quite regularly and they can l grieve the builder into revealing information or losing the bid value. If on the other hand splitting the view consistently along a prescribed percentage is not easy then the problem only reduces to the rare unintended case and even rarer case where the head for the builder differs from the head of the proposer of n+1",
        "created_at": "2024-02-10T22:08:09.915000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "So we need to understand if it's indeed possible to split the view, I've been told multiple times by researchers that this is easy to do and that's why this is a killer for PTC. But I want to hear this from the people that work specifically in this area",
        "created_at": "2024-02-10T22:09:34.418000+00:00",
        "attachments": null
    }
]