[
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Breakout notes from today: https://hackmd.io/@ttsao/epbs-breakout-7\n\nThe biggest highlight is that the slot auction gained more support from Lodestar, Nimbus, and Teku and indicated that it might be better to move to the slot auction sooner or later \u003c@755590043632140352\u003e",
        "created_at": "2024-08-30T15:18:19.247000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Lovely, looks like it was an interesting meeting, was \u003c@520034910149410861\u003e there?",
        "created_at": "2024-08-30T16:03:41.726000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "weird, getting a 404 now",
        "created_at": "2024-08-30T16:59:07.450000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "sorry I changed the url from 7-\u003e8: https://hackmd.io/@ttsao/epbs-breakout-8",
        "created_at": "2024-08-30T17:00:15.280000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@654267572107083777\u003e \n\u003e Dustin mentioned it would be nice to have a milestone page, similar to how we track previous hard forks, for local devnet with solo proposers (M0), local devnet using p2p bids (M1), multi-client devnet (M2), etc.\nHere are my thoughts on this to test incrementally:\n\n- Separation of block processing and signed execution payload envelope processing. Still **only** local building. \n- Forkchoice (block, slot, payload) voting. \n- Gathering bids from builders (that is, external reveal and builder API is ready). \n- Bid p2p stack\n\nWe can have multiclient devnets with all these points.",
        "created_at": "2024-08-30T17:05:14.213000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "seems reasonable, yeah",
        "created_at": "2024-08-30T17:18:15.854000+00:00",
        "attachments": []
    },
    {
        "author": "stefanbratanov",
        "category": "Cross-layer",
        "parent": "",
        "content": "Seems reasonable, milestone page would be useful for sure, in my mind the Bid p2p stack is higher priority than gathering bids from builders (since it's part of the specs), so can test the Builder API integration last",
        "created_at": "2024-08-30T17:20:54.245000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also, it sort of puts the (for Nimbus at least, but maybe broadly true, I don't know) riskiest parts in terms of integration up front, which is useful (block/execution payload envelope processing and fork choice), and then those can settle while the networking parts (delicate in their own way, but largely can exist independently of/alongside existing networking without mutual interference) go in",
        "created_at": "2024-08-30T17:23:04.803000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "but bid gathering/bid p2p stack won't break existing Nimbus code/UX, basically guaranteed. Getting the first two bullet-point items wrong might",
        "created_at": "2024-08-30T17:23:43.982000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah that's my understanding as well. The first two points are the important ones. \u003c@641548687813902336\u003e I think ePBS can be shipped even without a working p2p stack since it will be mostly irrelevant anyway on any form of ePBS. Local building already tests the most important aspects of core functioning. And \u003e 90% of blocks will be produced by requesting bids from the builder. Since the builder API will have to be built by us anyway as part of the beacon, I think the builder itself is higher prio than the p2p stack. At anyrate, the p2p components of this we already implemented in Prysm so I'm happy to bump that up 🤣",
        "created_at": "2024-08-30T17:29:35.131000+00:00",
        "attachments": []
    }
]