[
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hi \u003c@755590043632140352\u003e I am currently in the Ethereum Protocol Fellowship study group. I am fascinated with these concepts of ePBS, preconfs, ET, etc. \n\nCan I please help you with porting the hackmd doc to the magician site? \n\nIf yes, can you please let me know briefly what kind of issues you are facing. My guess is mostly related \"formatting\".",
        "created_at": "2024-04-13T10:38:26.524000+00:00",
        "attachments": []
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "BTW, I am currently writing a detailed summary on the ePBS and the recent ePBS specs for the EPF wiki.",
        "created_at": "2024-04-13T10:42:27.643000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hi, I don't think the issue is worth your time. The problem is with markdown support in eth magigians, hackmd has custom tags like :::info, :::warning that I've used a bit. Then there's graphviz support that I couldn't manage to do so I had to port graphs directly as jpegs and that sucks. Looking forward for the EPF wiki summary!",
        "created_at": "2024-04-13T10:51:27.459000+00:00",
        "attachments": []
    },
    {
        "author": "kboom_ro",
        "category": "Cross-layer",
        "parent": "",
        "content": "hey \u003c@755590043632140352\u003e, I have some questions regarding design. I also posted them on Ethereum magicians: \n-was the urge to “fix the bug” the reason you’re proposing block auction ePBS? Because there are debates on the fact that we’re just going to move MEVboost market structure (that is considered the bug, right?), in-protocol.\n-is your envisioned pipeline something like ePBS-\u003eslot auctions-\u003eET?\nThnx",
        "created_at": "2024-04-13T11:48:55.053000+00:00",
        "attachments": []
    },
    {
        "author": "kboom_ro",
        "category": "Cross-layer",
        "parent": "",
        "content": "and yes, \u003c@322809371140816896\u003e, has written a comprehensive page on ePBS over at EPF💯. I'm covering ET, hence my questions🙏",
        "created_at": "2024-04-13T11:50:18.151000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "replied in the topic",
        "created_at": "2024-04-13T13:01:16.696000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Just saw the wiki, excellent work, linking here in case people aren't looking at it. https://epf.wiki/#/wiki/research/PBS/ePBS?id=enshrined-proposer-builder-separation-epbs",
        "created_at": "2024-04-13T13:10:16.643000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "One correction though in the PTC section:\n\u003e Builders do not receive a proposer boost or explicit fork-choice weight.\nIn the current design in my PR builders receive a proposer boost, they do not create forkchoice weight among different forks, but they do boost or \"deboost\" the current block where they are revealing/withholding",
        "created_at": "2024-04-13T13:11:57.259000+00:00",
        "attachments": []
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thank you very much. Especially when it is coming from someone like you. \n\nI carefully studied many articles from you, Mike, Barnabe, Justin, etc. Your work and thought process are real inspiration. \n\nI just finished reading the ePBS specs hackmd document. I will be adding a detailed summary on the specs to the ePBS wiki.",
        "created_at": "2024-04-13T13:25:01.950000+00:00",
        "attachments": []
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "I will correct it and push a commit.",
        "created_at": "2024-04-13T13:25:51.655000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I may split up the design doc in a few chapters, I need to add checkpoint handling to the forkchoice chapter and that's gonna take it out of the 10K char limit",
        "created_at": "2024-04-13T13:26:55.190000+00:00",
        "attachments": []
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "Will do. I have some rough idea on the h1 and h2 headings based your spec structure. But when I started reading the code in the repo then I got a bit overwhelmed in trying understand all of it.\n\nFirst, I will start with the specs document and try to cover all major subtopics then see how to explain the code in the wiki.",
        "created_at": "2024-04-13T13:37:18.962000+00:00",
        "attachments": []
    }
]