[
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "I struggle to see how it would make much of a difference unless the range of values is wide, in which case it's not safe (too low =\u003e next proposer can get reorged, too high =\u003e next proposer can reorg). Also the goal of proposer boost, which is to let the proposer impose their view when it's not too different from others, even when other views are themselves somewhat diverging. Conditioning the proposer boost value on the view itself seems somewhat at odds with that goal",
        "created_at": "2024-02-13T09:39:32.265000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't think we need a very high variation, just enough to make the split inviable (which again we need to measure in real mainnet to see if it's actually viable), this would be akin to adding a random error to Barnabé's and Caspar's experiment.",
        "created_at": "2024-02-13T10:03:45.777000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "If you remember the original simulation for PB we had a large margin to choose with widely different assumptions of the stake of the attacker, and just a variation of +/- 2% gives a 10% divergence in the target of the split, making it much harder to achieve without really compromising security",
        "created_at": "2024-02-13T10:09:41.125000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "By the way the description about the splitting attacks are a bit misleading with regards to weights. It's not tight as 51% - 49% splits. With current PB values, as long as the block is seen timely by over 30% of the committe, then it can be made canonical by the next proposer (and thus charge the builder if it hasn't revealed). And as long as the block has less than 70% then it can be reorged by the next proposer. The issue is that block-slot voting requires a reparametrization of PB since it allows for post-anti reorgs much easier. \u003c@841217748942979072\u003e do you have by any chance your simulations for PB if we use block-slot voting? That is, a committe member that votes for the CL block in slot N not being present is adding weight to the parent block (say N-1) that is *not* supporting the current block.",
        "created_at": "2024-02-13T11:50:43.405000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The spread between these values is PB itself, and I claim that it can be much lowered because there possibility of ex-anti reorgs cannot really happen that easily on ePBS: To do a single slot ex-anti reorg your block needs to \n1) have \u003e (1 + PB)/2 of the committee weight, which is over 50% even if PB is zero. \n2) the builder and the PTC need to be colluding. \n\nPerhaps I'm mistaken here, but it seems to me that PB can be set to zero  or close on ePBS, reducing the balancing attack to a very narrow margin.",
        "created_at": "2024-02-13T11:56:49.448000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Wrote an ethresearch post about potential ways to strengthen PBS without necessarily fully enshrining something: https://ethresear.ch/t/paths-to-hardening-pbs/18666",
        "created_at": "2024-02-13T13:30:50.943000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@555483069038198827\u003e \u003c@841217748942979072\u003e how hard do you think it would be to do a study of reorgs along the lines of what was done for PB to set it to 40% but now with two boosts (probably the second one being zero) for ePBS? I want to explore the idea of having two boosts",
        "created_at": "2024-02-13T14:58:31.026000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks \u003c@539495253418180618\u003e for hosting this, I promise I'll be less passionate next time.  \nAs for Danny's question if builder's safety is binary or not: I think if the definition of builder safety is: \"an honest builder that submits his block on time and is seen by honest validators, then his block is canonical\" then it most probably is binary. There's another one that is harder to deal with in the context of block-slot: \"an honest builder whose head does not show the block on time, decides not to reveal, then he will not be charged\"... This one I think is impossible to be binary: you will get that guarantee only up to a threshold of stake on the attacker and there's no way around this (I think).",
        "created_at": "2024-02-13T15:08:23.003000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "hey passion is good",
        "created_at": "2024-02-13T15:20:00.524000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "if anything, its a complex problem area and there are many competing trade-offs to navigate",
        "created_at": "2024-02-13T15:20:14.029000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I took some meeting notes. Pasted them here: https://gist.github.com/terencechain/1f883342b99a910e979805bb034043f9",
        "created_at": "2024-02-13T15:35:18.157000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'll start working on an abstract design tradeoffs docs to see which high level definitions we agree and which ones we don't to see if we manage to get some contrains in the system",
        "created_at": "2024-02-13T16:08:37.326000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e i had three points of concern around epbs open questions\n\n1) infrastructural\n2) protocol -- fork choice etc\n3) economic\n\nwe discussed (2) quite extensively, and i'd love to hear your thinking around the other points",
        "created_at": "2024-02-13T18:10:45.135000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "re: 1) my concern is that we will see no builder adoption of a (n expensive) protocol feature as the auction over p2p will not be able to compete latency-wise with the status quo; the suggestion that came up on the call was that builders could still offer e.g. HTTP endpoints to do the same thing relays do today\n\nso in this world, as someone who wants to use the PBS facility, i'd need to provide a list of builder endpoints to connect to (just like relays today). this is fine but i fail to see how this isn't just speedrunning the vertical integration of builders and relays, rather than getting rid of relays entirely\n\nif we wanted to remove the relay in this way, we could just include an unconditional payment in the mev-boost bid today and call our job complete (note: the payment can be escrowed conditional on some block hash actually landing on-chain, so there is no issue of proposer griefing)",
        "created_at": "2024-02-13T18:12:49.060000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "it also feels a bit off to me if we demand validators have to curate their own list of builders they wish to connect to -- i think a big benefit of the \"relay of last resort\" world is that validators don't have to make a choice as they simply observe the right gossip channel and get access to the MEV market with minimal effort -- although i'll concede this may primarily be a UX thing and isn't a deal breaker for some kind of ePBS generally",
        "created_at": "2024-02-13T18:17:01.390000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "re: 3) the main concern here has to do with how we implement the unconditional payments: i think requiring any amount of capital staked raises barriers to entry for new builders and is a centralization vector to the extent that bigger builders feel the opportunity cost of the locked capital less than smaller builders. this issue is complicated by the volatility of MEV where a \"perfect\" (although naive) design would require say 1000 ETH staked as any given builder would need to be collateralized up to the possible size of any bid they could make. the amount of stake can be a knob we can tune, and to be honest, i think an good 80/20 solution would just be to require a 1-8 ETH bond (per bid) so that most MEV bids can be collateralized while keeping the barrier to entry lower -- curious to hear your thinking here\n\nand another side note: i saw somewhere (i think terence's recent ethresearch post) that staked builders would just be validators, although i don't see why we would need to do this when we could just make a special protocol facility to hold builder bonds on the CL and not require any additional duties from them -- again for reasons of barriers to entry and overall cost to be a builder. this line of thinking even opens us to something we could start doing today with mev-boost where collateralization is handled purely at the EL, ahead of any sort of ePBS in the protocol itself (and in fact things are already moving this way with optimistic relaying, where i intend to raise this point to more formally put the optimistic infra on-chain during the next mev-boost community call)",
        "created_at": "2024-02-13T18:24:16.489000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e so in this world, as someone who wants to use the PBS facility, i'd need to provide a list of builder endpoints to connect to (just like relays today). this is fine but i fail to see how this isn't just speedrunning the vertical integration of builders and relays, rather than getting rid of relays entirely\nI think the objective is not \"removing relays\", the objective is to remove trust assumptions. There's nothing wrong with vertically integrated relays, the problem is that the in-protocol player (the proposer) needs to trust the relay, and the off-protocol player (the builder) either vertically integrates and is the relay itself, or trusts the relay.  The proposal allows for builders to directly become trustless relays without doing any investment nor buying the credit to get this \"trust\". They can simply open an http point and proposers can request headers because they don't need to trust them. This encourages direct competition between builders. If this centralizes them this is not a problem, liveness is never at risk here because there's always builders that are running vanilla software and will submit bids on the p2p layer.  I envision the same sort of middleware like mev boost will act as a way to collect builder addresses and request headers. I think this is a net positive as it lower the barrier of entry for builders. \n\nI am warming up to the idea of not requiring builders to be highly staked. My original thought was that we could coordinate a heavy slashing in case of a builder's attack to the network. If builders can't really influence forkchoice and can't censor due to strong ILs, then liveness is already taken care of by the p2p layer and automatic banning so probably we would be fine allowing them to be staked as normal validators (or even avoid the ejection balance as suggested during the call).  Ahh I see you are making a point for this in 3).",
        "created_at": "2024-02-13T18:51:29.134000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e if we wanted to remove the relay in this way, we could just include an unconditional payment in the mev-boost bid today and call our job complete.  \n\nI think if you find a way of enforcing payment on Mev Boost this solves the proposer's trust in part. There are still some things that would not be solved: builders would need to trust relays or be relays themselves, only difference is that now becoming a relays is costly and not open and trustles. There are other issues like the better pipelining and slot utilizaton (which allows for better scaling as well) if we are validating CL and EL blocks at different stages in the slot. ePBS also makes the work of the builder/relay less critical in the sense that they have time to actually validate the block and attestations over gossip before deciding to broadcast. This brings back to your statement of including an unconditional payment in the bid. I find that enforcing this in the case that the block does not make in on-chain because of the relay (as the other day) cannot be made trustless with a system like Mev Boost unless you're already doing some form of ePBS.",
        "created_at": "2024-02-13T18:51:44.547000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e it also feels a bit off to me if we demand validators have to curate their own list of builders they wish to connect to\n\nValidators already do this, they take a list of relays and they curate this themselves. Clients come with no mev-boost as default. In ePBS the default will be to not call anything, and only rely in the p2p chain, but it's fine if entities like ethstaker, Lido or even flashbots curates lists of builders that are added to a middleware as MevBoost to request headers directly. This has many advantages. First it's completely trustless, they are connecting directly with in-protocol players. Second we can maintain such middleware instead of having flashbots or yourself doing this now. One of the biggest advantages I see is that we can ban those builders automatically for whatever reason we decide. And last but not least, it's minimal change from the current UX: we don't even need to change the API, all clients already implement these messages, the only difference is that we will not request the payload anymore. This part is easy to implement.",
        "created_at": "2024-02-13T18:51:56.009000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e  i think an good 80/20 solution would just be to require a 1-8 ETH bond (per bid) so that most MEV bids can be collateralized while keeping the barrier to entry lower -- curious to hear your thinking here\nYeah as stated above, I am warming up to this indeed, it would bring us to a discussion of whether \"bypassing and not adoption\" is a design decision or not. For a long time I felt strongly that allowing relays to bypass the system was something terribly wrong. But I think I have been missguided by the belief that relays have an innerent advantage when this is wrong. Builders opening their own endpoints may be just as competitive as relays. In other words. Currently proposers don't have any option, either they build locally or they *have to trust* the relay. On ePBS, specially if builders are allowed to stake less than the current Max EB. Then proposers have the option of not having to trust the builder, but also they have an option of trusting it and continue to use the trusted relay (because they themselves sign the block). I need to think more over this, but I am warming up to the idea that this is not something fundamentally wrong and that we will always be in the situation where proposers may want to for whatever reason trust external players. As long as those external players cannot monopolize the protocol and kick out other builders that are trustless I don't see fundamental problems with this. Edit: also note that whatever trusted off-chain mechanism is implemented, will not be with default software as it is today with MEV-Boost, I think this is no minor issue, I don't see Lido requiring the prysmatic team to hack Prysm to use a fork",
        "created_at": "2024-02-13T18:57:42.943000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e  i don't see why we would need to do this when we could just make a special protocol facility to hold builder bonds on the CL and not require any additional duties from them -- again for reasons of barriers to entry and overall cost to be a builder. \nThe issue here is that having bonded money not earning anything is a cost in itself. The easiest way of rewarding that ETH and both implement and specify was to allow builders to be validators",
        "created_at": "2024-02-13T19:00:11.076000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also having them being validators makes the implementation of handling payment really trivial, it's just a transfer in `process_beacon_block_header` immediately.",
        "created_at": "2024-02-13T19:01:26.139000+00:00",
        "attachments": []
    }
]