[
    {
        "author": "pawandhananjay",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks a lot for the detailed hackmd potuz! I did a first read through over the weekend and like it conceptually. My first impression is that implementing this would require a **lot** of refactoring in Lighthouse. However, I also feel that it also has potential to simplify a lot of our existing code, but i can't say for sure until i spend more time with it. \nI'll continue trying to get my head around the spec and also hope to spend some time hacking some code later this week to check if it actually simplifies stuff for us",
        "created_at": "2024-04-16T00:18:18.085000+00:00",
        "attachments": []
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e I made an observation while reading the specs and code on the handling of missing payloads with IL. Let me see if I can explain here. \n\n\n**Problem:**\nThe handling of missing payloads in the epbs specs using IL could potentially be exploited as an attack vector under certain conditions. The main vulnerability stems from the persistence of the inclusion list from slot `N-1` when slot `N` fails to reveal its payload. This setup, while designed to ensure continuity and accountability in transaction processing, can create opportunities for both denial of service (DoS) attacks and strategic manipulation by malicious actors.\n\n**Attack Vector Analysis**\n\n**1. Denial of Service (DoS) through Payload Withholding:**\n\n**Scenario**: A malicious builder or a colluding set of proposers and builders could intentionally withhold payloads in successive slots. This withholding would force future builders to continuously address outdated inclusion lists from slot `N-1`.\n**Impact**: Such withholding could disrupt the normal flow of transactions and delay the processing of more recent transactions, leading to network inefficiencies and potential backlogs.\n\n**2. Strategic Manipulation of Transaction Ordering:**\n\n**Scenario**: By controlling which transactions appear in the inclusion list of a slot whose payload is subsequently withheld, a malicious proposer could influence which transactions remain unconfirmed and must be included in future slots.\n**Impact**: This could be used to prioritize certain transactions over others based on side agreements or other corrupt incentives, undermining the fairness and impartiality expected in transaction ordering defeating the purpose of ePBS.",
        "created_at": "2024-04-16T02:59:03.620000+00:00",
        "attachments": []
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "**3. Repeated Withholding to Control Network State:**\n\n**Scenario**: If an attacker has the capability to influence or control multiple consecutive slots (either as the proposer or builder), they could sustain a state of withheld payloads, thereby dictating which inclusion list must be followed repeatedly.\n**Impact**: This repeated withholding could be used to freeze the network state to an attacker’s advantage, potentially allowing for other forms of exploits or benefiting from market manipulations tied to the delayed processing of transactions.\n\n**4. Resource Exhaustion:**\n\n**Scenario**: The requirement to satisfy outdated IL could force honest builders to maintain and manage a growing set of pending transactions that may conflict with newer transactions or the evolving state of the blockchain.\n**Impact**: This could lead to computational overhead and increased resource consumption, straining  nodes and possibly leading to slower processing times or increased operational costs.",
        "created_at": "2024-04-16T03:01:20.919000+00:00",
        "attachments": []
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "Submitted a PR to add the missing field `payload_withheld` in the class `ExecutionPayloadEnvelope`.\n\nhttps://github.com/potuz/consensus-specs/pull/4",
        "created_at": "2024-04-16T05:11:36.646000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Apologies but I didn't understand any of this attack",
        "created_at": "2024-04-16T10:00:14.830000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hmm this is pretty weird I'm certain that field is there in my PR, will look in a bit",
        "created_at": "2024-04-16T10:02:45.961000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ah you' re basing your PR in the wrong branch, the current design is in my PR #2 \u003c@322809371140816896\u003e",
        "created_at": "2024-04-16T10:47:31.912000+00:00",
        "attachments": []
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ok, Apologies. I was checking out epbs branch. \n\nThis is the correct branch right? https://github.com/potuz/consensus-specs/blob/epbs_stripped_out/specs/_features/epbs/beacon-chain.md",
        "created_at": "2024-04-16T11:08:46.770000+00:00",
        "attachments": []
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "When I get back to computer in few hours, I will reword it in a different way and see if my argument makes any sense.",
        "created_at": "2024-04-16T11:11:21.612000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes",
        "created_at": "2024-04-16T11:31:07.192000+00:00",
        "attachments": []
    },
    {
        "author": "0xai",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ok, thank you.",
        "created_at": "2024-04-16T12:19:38.900000+00:00",
        "attachments": []
    }
]