[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Probably better to move discussions here \u003c@363800010518822915\u003e even though they may be obscure for the time being. I just realized that the structure of the blobsidecars also needs to be modified now that we moved to having inclusion proofs in blocks, since now the Merkle root is against the execution payload envelope and not the beacon block",
        "created_at": "2024-04-03T10:47:57.314000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This also changes the P2P spec in ePBS",
        "created_at": "2024-04-03T10:48:27.106000+00:00",
        "attachments": []
    },
    {
        "author": "mariusvanderwijden",
        "category": "Cross-layer",
        "parent": "",
        "content": "Are there any changes needed for ePBS in the execution layer? And if so, do you have a writeup for them?",
        "created_at": "2024-04-03T10:49:39.184000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "there are a *lot*",
        "created_at": "2024-04-03T10:49:49.687000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'll try to finish up a short version of the spec for this EOW, rushing through it right now non-stop",
        "created_at": "2024-04-03T10:50:16.089000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "in the hopes of getting someone from reth (or you :P) to look into writing the EL specs",
        "created_at": "2024-04-03T10:50:40.914000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Most of the changes are those that already are there in ILs though, so they shouldn't be a surprise at all",
        "created_at": "2024-04-03T10:51:10.937000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Arghh, the blob equivocation issue is a bit more complicated once we moved to Merkle proofs 😦 this wasn't an issue in the first design a year ago.... Problem is that the sidecar now has a full signed block header, this is enough then to slash the validator if it publishes a block with different blob contents. On ePBS the kzg commitments no longer need to be in the block, they can be in the payload, but there's no builder's equivocation. I'll have to deal with this indirectly by using the fact that the execution header needs to be included in the block somehow, something I had removed in the last iteration",
        "created_at": "2024-04-03T11:14:35.067000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@363800010518822915\u003e why did you deprecate `BeaconBlocksByRange` and by Root and added a new `NetworkBlock` instead? I just added a single entry and moved to `BeaconBlocksByRange` and by Root v3 with the new `epbs.SignedBeaconBlock`. Was this wrong?",
        "created_at": "2024-04-03T12:29:38.641000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't remember why I implemented `NetworkBlock`, but it's very likely I'm wrong here, so please ignore it.",
        "created_at": "2024-04-03T17:35:38.300000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Talking out loud. The reason for inclusion proof in blob sidecar is to disallow duplicated blob sidecars of the same index unless the consensus block can be slashed.\nIn ePBS, there's no slashing for the execution payload. How can we guarantee the same property as today, or do we need to guarantee it?\nIf the blob sidecar includes the inclusion proof from the consensus block, wouldn't it still serve the same purpose? Ah but kzg commitment is on the payload envelope now. So I think what you said is right, the execution header needs to be in the consensus block, and the blob sidecar includes the inclusion proof of payload envelope which includes the consensus block header",
        "created_at": "2024-04-03T17:35:47.385000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "So the blob sidecar now includes a merkle proof of full inclusion into the beacon block, even though the full list of commitments are not included in the block, only their roots, anyway that's enough to verify against them",
        "created_at": "2024-04-03T17:38:28.021000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I left in the P2P spec open the generalized index cause I don't want to keep recomputing this every time I update something",
        "created_at": "2024-04-03T17:38:55.768000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I see. I guess it doesn't matter where kzg commitments are referenced. The slashing proof does not need to encompass kzg commitments",
        "created_at": "2024-04-03T17:41:43.348000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Found another silly bug, it's minor, but the current design any PTC member can send two equivocating attestations and thus would guarantee that he's rewarded if both are included.",
        "created_at": "2024-04-03T18:08:35.682000+00:00",
        "attachments": []
    }
]