[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@504202741933932544\u003e or anyone here, are you guys working on ePBS? I am having trouble rebasing my Prysm epbs branch cause the team is pushing Electra changes to develop. I will keep for now my changes on top of Deneb (say for example the beacon state will not have 7002-style withdrawal requests) but I wonder if we are all in the same boat it may make sense to base on top of Electra.",
        "created_at": "2024-04-25T11:26:10.413000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hey, unfortunately we have no bandwidth to start working on it. I would like to at some point before interop but even in that case I doubt I can get something working by the event. So continue working on your branch, and I'll ping you when/if I'll start playing with it, just to branch from a potentially compatible commit.",
        "created_at": "2024-04-25T12:48:47.542000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sounds good, I also don't think we'll have something fully working at the interop, but I am hoping to have at least most of the structure and perhaps run a single client devnet in Kenya",
        "created_at": "2024-04-25T12:56:35.997000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Having looked at the code before interop would be good so that we can have an actual implementation conversation instead of a hand-wavy one",
        "created_at": "2024-04-25T12:57:21.621000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@486501030046203915\u003e I'd like your input on the following. On ePBS we can easily make the auction blind, what is the literature around this? what would be better for Ethereum?  I believe timing games are not avoided as better bundles do appear later, but at least blind auctions typically prevent a bid war in the last second so you get to have better valuation earlier in the slot.",
        "created_at": "2024-04-25T15:54:41.809000+00:00",
        "attachments": null
    }
]