[
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes this is something that might be thought of as a \"free option\", it's not free since you still have to pay your bid, but the cost may not be commensurate with the value of the option you have, e.g., you might have an opportunity cost of $1 million if the trade lands and incur a $100 cost if you miss your block, so the two amounts are uncorrelated. \u003c@981249983196041218\u003e might have more thoughts.\n\nThe withheld message thing is a separate issue I would say, but if they can reliably pull it off then it reduces their cost ofc. That's true in any scenario though",
        "created_at": "2024-07-15T08:17:24.009000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hi! What is the motivation behind this question? I'd just like to say that it is not clear that your expected value of the CEX-DEX arbitrage based on which you bid at time 6 is larger than at time 0 in a slot auction. I would assume in practice, your bid will be higher at a later time because of the ascending nature of the auction",
        "created_at": "2024-07-15T09:26:46.722000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes, this is something I had discussed in an old post of mine on the block vs. slot auctions: https://mirror.xyz/0x03c29504CEcCa30B93FF5774183a1358D41fbeB1/CPYI91s98cp9zKFkanKs_qotYzw09kWvouaAa9GXBrQ. In slot auctions you shouldn't have this problem because you do not commit to specific block content at the time that you make your bid. Therefore, you should never submit a trade that is significantly underwater when you reveal your block. You could, of course, still be overpaying, but it is always better to at least reveal then.\n\nIn a block auction, this could be the case, although I think it is fairly unlikely. The probability that not revealing the block is profitable depends on how competitive the market is and the possible price movements during the time between committing to a block and revealing it. I think the latter is very small, so not revealing the block isn't too profitable. We also do not see it happening today.",
        "created_at": "2024-07-15T09:39:54.817000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also it isn't completely clear that this is necessarily \"bad censorship\". Many time-sensitive transactions will be swaps that may be related to the reason why the builder went heavily underwater. If the time-sensitive transactions trade after an arbitrage transaction that arbed in the wrong direction, the users execution is also very bad. For transactions that were not related to the reason why the builder withheld their block contents, it is obviously not great but these may also largely be less time-sensitive",
        "created_at": "2024-07-15T09:41:44.679000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Not saying that this is something we should encourage of course but basically: if the trade was so bad that the builder did not want to go ahead with it. I, as a user who will have worse execution than the builder, do not want the trade to go through if my trade is related to the builder's trade",
        "created_at": "2024-07-15T09:43:41.244000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e We also do not see it happening today.\nI think this is more due to the builder giving away their agency to the relay, who is not making the decision to not reveal based on block value",
        "created_at": "2024-07-15T09:45:01.202000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Good point! Maybe Titan could do it with their relay?",
        "created_at": "2024-07-15T09:45:33.537000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Generally yes integrated builder-relays could do that, and more so in ePBS where you have direct builder connection",
        "created_at": "2024-07-15T09:46:52.503000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's definitely a provocative argument 🙂 though yes I think one should assume that there are also many transactions in the block which have nothing to do with swaps and would like to land. I'm thinking about blobs, which by now guarantee that there is always some inelastic-ish base load that really just wants to get included",
        "created_at": "2024-07-15T09:47:59.348000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "(one could make an argument about the social welfare of rollups landing their blobs vs users being happy that their trade didn't go through...)",
        "created_at": "2024-07-15T09:48:36.921000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "I guess this point of the builder withholding their block contents is actually saying that a builder may prefer a slot auction over a block auction in some cases, which is then the more general point \u003c@486501030046203915\u003e has made that it is important to get the specific allocation mechanism of PBS right.",
        "created_at": "2024-07-15T09:50:48.577000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Would you say \"rational builder withholding\" is a fatal flaw to block auction ePBS though? It seems more like a theoretical edge case that might be observed infrequently. I would be more concerned if it could be gamed somehow and become a systemic issue",
        "created_at": "2024-07-15T09:54:58.222000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes totally agree. I don't think it would be done often because the difference in time between committing to your bid and revealing your bid is very small",
        "created_at": "2024-07-15T09:57:11.633000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Just to be clear, it's about 6 seconds iirc, if the beacon proposer releases their block at `t = 0` (no timing games) and the builder reveals the payload at `t = 6`. Does that qualify as \"very small\"?",
        "created_at": "2024-07-15T09:59:13.633000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ah sorry I thought it was a lot smaller. 6 seconds sounds quite significant. At what time does the builder know that it has won the auction? I think this is the relevant time delta because as a builder I will start hedging my position as soon as I reasonably know this is the case, even if there is no actual consensus on this.",
        "created_at": "2024-07-15T10:32:40.160000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "t=2 at most I think, or when the beacon proposer releases the block",
        "created_at": "2024-07-15T10:38:49.685000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "They would know when they observe the block proposed by the beacon proposer, so at `t_0` the beacon proposer starts the broadcast, then the builder would know at `t_0 + delta` for some small `delta` probably. `t_0` could be 0 in the honest case, or larger than 0 if timing games",
        "created_at": "2024-07-15T10:40:01.022000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Let me work it out a bit 🙂",
        "created_at": "2024-07-15T10:41:10.067000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The builder cannot reliable game this. If the builder also holds a considerable stake then they could do it but that also requires the builder weakening their own chances of inclusion even when they will be profitable, so I think this \"attack\" by sending an honest withheld message can't really happen",
        "created_at": "2024-07-15T11:10:57.724000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Oh sorry I meant the attack where it’s rational to not reveal, not the attack where they try to impose the view that their withholding was legitimate. I still consider the two to be separate. And by gaming the non-reveal I mean leveraging the free option to make that rational non-reveal more frequent than it would naturally occur",
        "created_at": "2024-07-15T11:37:40.404000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ah definitely, I can't even imagine a way to game that, also I'd expect (without data) this to be a non issue",
        "created_at": "2024-07-15T11:40:19.081000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Here is some very rough analysis of the problem. https://efdn.notion.site/Will-Block-Auctions-lead-to-withheld-blocks-cdd171c68a9d45af95e7fb5c3aa2499c?pvs=4\n\n I think it shouldn't be a very big deal but it may be another way in which we favour HFT shops as price prediction can be more profitable now. The additional 6 seconds maybe moves us from a pure CEX-DEX arb to a stat arb because predicting prices can be more profitable.",
        "created_at": "2024-07-15T11:48:58.512000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I didn't understand the numbers here, why (0,18) intervals?",
        "created_at": "2024-07-15T11:56:33.759000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "I assume that there is a block n from time [0,12]. The on-chain prices reflect the prices that were incorporated into the block payload at time t = 0. Then at time t = 12, the next block payload is committed to. This payload is then either revealed or withheld at time t = 18. So your payoff for revealing the block depends on the price difference over the interval [0,18]",
        "created_at": "2024-07-15T11:58:48.158000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah but the builder can't start building on a head he doesn't know isn't it? the prices should probably be (6,18) in that sense.",
        "created_at": "2024-07-15T11:59:55.925000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "The interval depends on what the previous builder did. If the previous builder was as we assume them to be now, then they use do arbitrage against the latest available off-chain prices which would be at time t = 0. The next builder doesn't need to know the head until just before t = 12 but it's payoff then still depends on [0,18] right?",
        "created_at": "2024-07-15T12:01:50.520000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Btw, the same argument also holds for (6,18)",
        "created_at": "2024-07-15T12:03:07.868000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah I'm not arguing against the thesis in the doc, I simply do not understand the intervals. I would have expected (6,18) and (6,12) to be the relevant ones",
        "created_at": "2024-07-15T12:05:44.421000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "in as much as currently it's a slot worth of building that the builders have",
        "created_at": "2024-07-15T12:06:44.258000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes this doc assumes that the previous builder built its block based on the price at time t = 0 and revealed its block. Then the on-chain price should reflect the off-chain price at time t = 0. Now we wait 12 seconds and we again assume that the builder builds its block based on the price at time t = 12. Since the builder could still decide not to reveal its block contents, the payoff depends on the off-chain price at time t = 18. So the time interval that is relevant for building your block is [0,12] but the time interval relevant for the payoff is [0,18]\n\nIf you were to assume that the previous builder built its block based on its expected value of the off-chain price at time t = 6, then maybe you get the intervals of [6,12] relevant for building and [6,18] relevant for payoff",
        "created_at": "2024-07-15T12:10:26.439000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Good morning. Catching up now. My takeaway is that it doesn't look like an issue, although there are two high-level solutions:\n\n1. Add more penalties or slashing to builders missing blocks\n2. Implement a slot auction\n\nOption 1 is obviously a no-go for many reasons. Option 2 is not a bad idea as we have discussed, but the current spec will continue to focus on block auctions until we run into a hard blocker or someone has done enough analysis to ensure that slot auctions are safe. Meanwhile, we'll continue looking at this problem as Julian shared in the document. Thanks for that!",
        "created_at": "2024-07-15T13:44:02.854000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Why is option 1 \"obviously a no-go\"? I am weakly against in ePBS but I'd be more in favour in e.g., APS. In any case I don't see the obvious reason not to",
        "created_at": "2024-07-15T14:25:42.982000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sorry...  first sentence after waking up needs some correction. \"Obviously no-go\" is too strong and the context should be specific to only block auction. My point was that the current spec and EIP aim for a minimal implementation to iterate on, and adding slashing for the builder missing block introduces a whole new vector of design and open questions...",
        "created_at": "2024-07-15T14:30:25.523000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "While not impossible, it would be a terrible departure from current specification and I would be against such a proposal. Slashings are considered for safety mechanisms and it is always for bad behaviour comprobable on-chain. You have to produce two signed messages that are contradictory. This proposal would be to slash for a lack of a message, which by definition we cannot prove on-chain. The only slashing that could be implemented in the current spec would be for conflicting blocks with a withheld message and a full payload. For slot auctions we could slash equivocating payloads, but we could never slash lack of messages.",
        "created_at": "2024-07-15T15:19:53.121000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "I want to echo this general view about \"slashing\". It gets abused as a term, but I 100% agree with \u003c@755590043632140352\u003e that it requires unambiguous, explicitly against-protocol actions which cannot be explained as confusion (i.e. on noncanonical chain) but bugs or malice",
        "created_at": "2024-07-15T16:39:01.371000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "inactivity penalties are not slashing, et cetera",
        "created_at": "2024-07-15T16:39:12.068000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "penalties, maybe, but \"slashing\", no",
        "created_at": "2024-07-15T16:40:31.718000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah, penalties may even be conceivable, but in this particular case it's also tricky. They can't be low enough so that they are an actual deterrent, but in that case, penalizing a not-so-low amount for a wall-clock event is a slippery slope.",
        "created_at": "2024-07-15T16:42:38.973000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "there's a reason the timing-related things in gossip are all ignore, not reject, even",
        "created_at": "2024-07-15T16:43:13.317000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Not that anyone is looking carefully yet, but in case anyone is implementing this: forkchoice filtering was wrong, a stupid Python list comprehension mistake. Hopefully that's fixed now in the last commit. The `state_root` entry in `process_slot` was fixed in the processing of the execution payload. I'm still not passing forkchoice tests, but combing through which ones are valid and which ones are not is complicated, will take some more time and surely more bugs will be uncovered.",
        "created_at": "2024-07-15T18:16:26.741000+00:00",
        "attachments": []
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Agree on the semantics of not using slashing, would immensely prefer if we only used that word only for the FFG slashing conditions actually, not even for the block equivocation faults. But want to point out that today we do penalise people for missing messages, you get minus the reward if your attestation isn't on-chain or isn't correct. You can prove absence of a message not on the basis of it was never sent but on the basis that it didn't make it on-chain, though that could be ofc because you are censored.",
        "created_at": "2024-07-15T21:23:30.581000+00:00",
        "attachments": []
    }
]