[
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hey \u003c@755590043632140352\u003e \u003c@363800010518822915\u003e we're planning on making the beta.1 spec release beginning of next week. Is there anything for eip7732 that you would like to be included? Maybe some additional tests? And what about the [small fixes to gloas spec](https://github.com/ethereum/consensus-specs/pull/4631) PR?",
        "created_at": "2025-10-09T13:16:59.075000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think it's safe to say that this is kinda paralized until at least a weak from today given that ACD wants to decide on having or not trustless payments. Without them the whole spec needs to be changed rather a bit and I would say that it doesn't make sense to be working on tests and a bunch of things that can be all removed in a week. \n\nAs for that PR from NC, it contains three things. The changes to the sidecar are valid, we forgot to update those when we removed the proofs. The logic change to the withdrawal process is a bug and should not be included. I'll let you decide over the other change",
        "created_at": "2025-10-09T13:28:22.527000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Process withdrawal tests is a good example, I can work on them today, it's one of the remaining block operation test but what's the latest decision with respect to payment",
        "created_at": "2025-10-09T13:30:39.918000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e today given that ACD wants to decide on having or not trustless payments\nAh I was hoping we'd reach consensus on this tomorrow during the breakout call.\n\n\u003e The logic change to the withdrawal process is a bug and should not be included\nAh okay. We should probably improve this function either way. I also found it confusing.",
        "created_at": "2025-10-09T13:34:48.281000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "Great. Thanks. Please ping us when it's ready to review.",
        "created_at": "2025-10-09T13:35:18.430000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "TBH is not clear to me what's the right path forward for trusted payments: the original design allowed for trusted payments just exactly as today. But Lido insisted in that it would be better for them to have payments via withdrawals than transfers on the CL side. Had I known that  anyway they wouldn't  use trustless payments no matter what, then it would have been much simpler to just keep the original design that has the exact same features for those that want to use trusted payments and doesn't need to share the pipeline with withdrawals that is already ugly enough. We would still have to churn transfers and keep essentially the same system as today so it's not considerably simpler, but I believe the churn for validator transfers can be made independent of the churn for validator withdrawals/exits/deposits as it should not affect the total active balance.",
        "created_at": "2025-10-09T13:40:11.194000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "It is also less flexible than the withdrawal path since it allows the operator to receive in any address instead of only the withdrawal credentials address.",
        "created_at": "2025-10-09T13:41:03.070000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "We decided to delay the beta.1 release until there's meaningful spec/test changes.",
        "created_at": "2025-10-09T22:05:21.010000+00:00",
        "attachments": null
    }
]