[
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't understand how it makes sense to focus on shipping something that there's no agreement about",
        "created_at": "2025-02-14T08:48:03.413000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "The devnets might finalize and be stable, how does that matter if we haven't agreed to ship it?",
        "created_at": "2025-02-14T08:48:47.609000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "You're of course free to work on whatever you want, but that's very different than treating it like something that's scheduled for inclusion in the G fork, which it seems to me like what we're currently doing.",
        "created_at": "2025-02-14T08:52:02.144000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "There's no agreement in lots of things that we work to spec them, and find out if they work or not. I've already spent many ours on the RLNC project, Guillaume spent a lot on verkle and it may be scrapped, EOF was implemented mostly years ago. This is one of the things where I'm convinced enough that it's complete and implementable right now and it's urgent for Ethereum that I rather spend my time on it. Forkchoice changes here are not a consequence of the auction but of the separation of the Payload from the block. I'm unaware of a future of Ethereum without this separation. As far as I know FOCIL also has forkchoice changes, and in general is a much more complicated feature in that it involves coordination among twice as many teams, I don't see any effort to stop them from coding it",
        "created_at": "2025-02-14T09:45:05.981000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "FOCIL is something that's universally agreed to be part of the roadmap, this is just not. And no, separating the payload from the block does not need 3 or 4 new boosts, that's something that's entirely a consequence of the in-protocol auction.",
        "created_at": "2025-02-14T09:52:58.658000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Spending hours on RLNC seems entirely different than having a breakout call, multiple clients working on it, devops resources going to it. How is this not treating it like it's included in the next fork?",
        "created_at": "2025-02-14T09:56:28.187000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Anyway, I would again suggest that we take a step back and separate out the features that there's agreement on from the ones on which there isn't. We can then separately discuss inclusion of the latter as well. Seems to me much more likely to lead to a good outcome (which might even be the EIP as it is now, but with the in-protocol auction implemented in a separate fork if we can actually agree that it should be implemented and how exactly).",
        "created_at": "2025-02-14T10:10:19.190000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "there are no boosts, we moved to your design that does not need any changes to forkchoice besides just freezing the view",
        "created_at": "2025-02-14T10:30:49.166000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "And It seems we both live in a bubble, I recall many client devs for example from Nethermind calling for ePBS before FOCIL, tides change because of influence or even the perceived idea that it may be simpler than this. Yes, I'm openly biased towards inclusion of this feature, but so is everyone including yourself and that's not a bug of the system that's a feature, we need EIP champions and we need coredevs experimenting with features early on instead of just only getting involved after the research teams have already agreed on a roadmap and cemented the idea that it was fixed. I am grateful to the Teku guys that are working on this so that we can have bugs cleaned on interop, in fact I'd hope that this incites other clients to try as well.",
        "created_at": "2025-02-14T10:33:53.897000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Breakout call #16 in \u003ct:1739541600:R\u003e. This actually may become technical for the first time in a while, a bunch of insight were gathered from the interop with Teku, Adding the ones I start to remember to the agenda in \u003chttps://github.com/ethereum/pm/issues/1292\u003e. \nZoom link: \u003chttps://ethereumfoundation.zoom.us/j/87569210985?pwd=3Cv1hDh7If4cq9IMXvNln1CtqQ72MR.1\u003e\n\u003c@654267572107083777\u003e if the EPF that were working on this are still at it, it may be good for them to come.",
        "created_at": "2025-02-14T10:58:14.348000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think it’s quite healthy to hear different opinions on whether an upgrade should be included or not. I also agree devs should be able to experiment and focus on whatever they think is the most important. \n\nBut those considerations are a bit out of what really matters here, which is the realisation that ePBS does include different, separable components (e.g., the beacon block/payload separation, the auction) and while there is a relatively broad agreement on block/payload separation, the auction doesn’t have to necessarily be tied to it/shipped at the same time? I’ve heard you say many many times that the auction is not that important or not the central/crucial part of the EIP, so maybe the most productive discussion moving forward would be to see if we can make progress on block/payload separation and find the very best way to do it (future proof, efficiency gains, compatibility w/ other upgrades, etc…)? I think it’s important to realise efforts are actually going in the exact same direction: separating the beacon block from the payload would be a great unlock if we can do it right and I can imagine that would actually happen quite fast if both \u003c@520034910149410861\u003e and \u003c@755590043632140352\u003e get behind it tbh (+ any other folks interested in joining the effort obviously). \n\nI also think there is no intention to discard or bring down the great work that’s been put into by the current version of ePBS until now (including Teku as you mentioned).  I also agree the roadmap, as much as we want to idealise it, is not fixed and very much dynamic and changing constantly, not only from a technical/idea perspective but also from what’s top-of-mind these days I also feel like it’s annoying sometimes but can’t really do much about it.",
        "created_at": "2025-02-14T11:08:49.291000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "Oh and very anecdotal note but I also don’t really think opposing FOCIL and ePBS all the time is very productive, they address different issues and shouldn’t really be competing in any way unless we find unsolvable incompatibilities (which is not the case afaik).",
        "created_at": "2025-02-14T11:08:50.934000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I repeat, separating the payload from the block as in this EIP is essentially all of the EIP, the doing it without the PBS part amounts to actually complicating it by adding a single line \"enforce builder=proposer\". There may be other ways of separating the block from the payload that I am unaware about, my point is that this has gone past the research stage, and if someone has a better way of separating the payload from the block and can be implementable in simpler terms than this EIP, I'm happy to listen/watch it being implemented. I simply don't know a way. Doing it the way of this EIP, and removing the ability for the payload signature to differ from the proposer signature is just not right and not justifiable.",
        "created_at": "2025-02-14T11:14:02.910000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Since people bring the \"forkchoice complication\" as an argument quite often: the complication relies from the fact that you have to deal with blocks that may not have a payload. You have to deal with this situation no matter if the proposer is self building or not, so if we use the separation of this EIP, forkchoice will have to face this fact no matter what. Removing the auction part is an extra requirement, not less requirements.",
        "created_at": "2025-02-14T11:22:25.741000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "All the safetly mechanisms to not allow the next proposer to reorg the payload have to be in place, etc... The auction is off-protocol from this EIP.",
        "created_at": "2025-02-14T11:23:02.129000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "ok, they kind of are",
        "created_at": "2025-02-14T11:42:03.638000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "progress is happening",
        "created_at": "2025-02-14T11:42:26.975000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "relayed to the main person working on it, anyway",
        "created_at": "2025-02-14T11:49:13.341000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "we did (collectively) set up a joint branch for this to be worked on in a sustainable way at least",
        "created_at": "2025-02-14T11:55:04.187000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "As for the relation with FOCIL, yes definitely they aren't incompatible, they have some tension that is clear: if FOCIL is added, ePBS becomes much more complicated as it involves the engine and some timelines are  tighter, if ePBS is added, FOCIL becomes more complicated as then some validity conditions have to be signaled by the PTC, but definitely they address different problems and they should both be included! But still, I see an effort coming mainly from researchers (and no client dev) into removing the auction without being informed that this would actually be an increase on the EIP rather than a decrease. There is zero arguments to not allow different signatures on the payload and the block. You could even argue about removing the P2P distributions of bids, and I would even agree about that!.\n\nBut it is disheartening to see subtle statements coming mostly form EF. Vitalik mentions FOCIL and APS in every single post, not once ePBS, even though it's the only EIP that gets us there. \u003c@486501030046203915\u003e posts threads like this \u003chttps://x.com/barnabemonnot/status/1890374940785889556\u003e where the breakout for FOCIL is mentioned. There's a clear lobbying from EF research, and I feel that's absolutely fine for us to lobby as well, and moreover, if the argument is complexity, nothing better to lobby against that argument than having full implementations",
        "created_at": "2025-02-14T12:25:22.056000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Where can I see this? In the consensus specs I still see boosts",
        "created_at": "2025-02-14T12:39:43.741000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "I have a lot more conversation to catch up with here, just wanted to quickly address the thread. I'm not mentioning ePBS breakout only because it's less clearly \"owned\" or \"collab'd\" with by ef research folks, it's not meant to be a signaling thing, beyond the fact that FOCIL is more actively worked on by people here than ePBS itself",
        "created_at": "2025-02-14T12:40:00.480000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "There’s multiple fork-choice things going on, and a lot of them are not just a consequence of the payload/block separation. Whether boosts or the view merge stuff, all of that is because of the auction, not because of the payload. There’s a reason why we spent so much time trying to come up with ways to satisfy builder safety",
        "created_at": "2025-02-14T12:41:38.533000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "we agreed that it was too much work to change the CL specs if there wasn't any agreement from clients to ship it yet, so we focused on having first a rough implementation. Once we have that ironed out and can start iterating more effectively (see the debug thread with Teku) I'll open the PR to move to your forkchoice changes and remove a bunch of other mechanisms (like the payload withheld and such). We are implementing without changes to forkchoice now except admitting blocks without their payloads",
        "created_at": "2025-02-14T12:41:46.873000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "you still need builder safety even if the block is self-proposed, otherwise the next proposer can reorg the payload, there's no way to differentiate between the payload not being broadcast and the payload being reorged",
        "created_at": "2025-02-14T12:42:49.052000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "the mechanism is the same as soon as you separate the block from the payload with this EIP",
        "created_at": "2025-02-14T12:43:02.751000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "call in a couple of minutes",
        "created_at": "2025-02-14T13:57:40.666000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "I do want to comment on this a bit, I understand that its a chicken/egg issue from your perspective, but one of the scaffolding issues has been that it's been challenging to build up the machinery and test it in any way that's not a devnet, based on what exists so far. and yeah, I know that's intentional, but want to note that as you CFI'd this for Fusaka, part of my preference for these things is the ability to gradually validate, offline/separately, as much of the implementation as possible, before going to a devnet and finding dumb stuff pointlessly break",
        "created_at": "2025-02-14T13:59:10.681000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "the spec has minimal changes, and I spent weeks getting the PR with the spectests passing which is a huge undertaking and was never merged... not doing that work again unless there' s a commitment",
        "created_at": "2025-02-14T14:00:13.804000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "no way in hell",
        "created_at": "2025-02-14T14:00:16.305000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "at any rate, there are essentially no changes to the spec except the forkchoice one alluded that can be completely abstracted out as we decided several calls ago... we lately also added a slot to the envelope and removed the \" payload_withheld\". field",
        "created_at": "2025-02-14T14:01:10.316000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "those I could open a PR against the spec",
        "created_at": "2025-02-14T14:01:19.134000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Cross-layer",
        "parent": "",
        "content": "**EIP-7732 breakout room #16**\nhttps://youtube.com/live/MkGsy3UeJv0",
        "created_at": "2025-02-14T14:23:29.191000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Meeting notes: https://hackmd.io/@ttsao/epbs-breakout-17",
        "created_at": "2025-02-14T14:45:05.809000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't know where \"treating it like it's included\" is coming from in this case (possible from some other place). But breakout call, clients and devops time investments should definitely not be treated as a signal for inclusion. It is totally fine (and even great) if any team (including devops) can decide to invest their time into working on some feature accepting a risk that this feature may never be shipped. A breakout call seems to be an indicator of the fact that the interest in any feature (not only ePBS) has spread across several parties and it makes sense to start coordinating their efforts. If it were not this way, i.e. it was prohibited for teams to work on anything that is not in the roadmap and have breakout calls, it would be hard to move new complex features towards shipping them.\n\nOn the ePBS side of things, I am a proponent of minimalistic CL/EL separation and decomposition of ePBS into this minimal functionality + the auction on top of it. It makes a lot of sense to me, because the separation itself unlocks more benefits than just ability to introduce payload auction.",
        "created_at": "2025-02-14T16:01:45.608000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Please people, stop saying that the auction can be separated, the EIP has no \"auction\" context... if you want to remove the P2P transfer of bids, that's fine. There's no simplifying anything by forcing the proposer and the builder to be the same entity. Let's please stop this thing early of \"separate 7732 without an auction\" cause that does not exist, I do not want this to continue spreading, if there is such a thing as 7732 without an auction spec it out",
        "created_at": "2025-02-14T16:54:31.451000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "I am sorry for my ignorance here as i am not much into ePBS. If that EIP proposes a minimalistic approach to CL/EL execution separation then it is just great",
        "created_at": "2025-02-14T17:11:02.162000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "My confusion is coming from a fact that proposer/builder separation semantically different to consensus/execution separation. Also, bid isn't a security deposit",
        "created_at": "2025-02-14T17:19:28.395000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "That was the entire content of my devcon talk, which I really recommend watching, I believe you can't achieve that separation without resorting to complicating the EL or other means that are unknown to me.",
        "created_at": "2025-02-14T17:19:52.352000+00:00",
        "attachments": null
    }
]