[
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "Please people, stop saying that the",
        "created_at": "2025-02-17T08:14:47.271000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think my take on this is \n- Anonymity is irrelevant\n- Provable don't know. \n- Rewards and penalties is a good to have, but I believe that they are not worth the complexity, even though it's not much complexity to add them. Even for the proposer to include them it's not worth to add rewards, because for the proposer is already aligned, his block is more likely to make it if it includes the attestatiosn.",
        "created_at": "2025-02-17T09:39:36.100000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "One last thought on client implementations—I'm sure every client has implemented some beacon committee cache. Is it important to reuse this cache? If the spec states that this committee is sampled differently from the beacon committee cache (no reuse), then the client will have to implement a new cache to track PTC. The feedback I get on this may also be relevant for the IL committee. Currently, it's standalone, so clients will have to add a new cache...",
        "created_at": "2025-02-17T15:38:04.373000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "how bad in terms of security would it be if we use first one or two committees as PTC? Like, if one committee has less than 256 validators we can use two committees, otherwise use just one",
        "created_at": "2025-02-17T15:44:26.291000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "The security has to do with the size of the PTC, I dont think it matters too much  how validators are sampled. For 512, a 35% attacker will need 20k years\n\nIf we talk about reward, it may play a small decision factor on how PTC is sampled\n1. Give PTC reward on top of beacon committee\n2. Replace PTC reward for beacon committee if selected\n3. Ignore reward at all",
        "created_at": "2025-02-17T15:51:37.082000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is kinda irrelevant, sampling one or all committees doesn't change anything and it's not the complication",
        "created_at": "2025-02-17T15:51:59.356000+00:00",
        "attachments": null
    }
]