[
    {
        "author": "anderselowsson",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah so Figures 6-8 deal with the effects of faster execution (in red) and Figures 10-12 deal with bigger payloads (in cyan; albeit the effect may there be a bit overstated given the rather high default setting for `L_D`). It is correct that the modeling of BALs can be done by increasing `P_{bg}` and `E_s`. The effect would be that the optimal position for `PTC_P` would shift to be later in the slot. Specifically, at the location indicated by the attached equation.\n\nThe discussion section has a paragraph on the effect of BALs.",
        "created_at": "2025-08-01T09:26:38.806000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "PTC_P.png",
                "content": "5764cc0b17ed8854b78559b6f5d32aee7a67b0bb70917b049b439f7ed001a5c7"
            }
        ]
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@520034910149410861\u003e \u003c@1184650696512000070\u003e you guys raised this issue so I'll rehash it here cause I got reminded of this by Vitalik's last post. Is it really correct to use balances for the PTC quorum instead of just number of attestations? for such a smaller committee, with very little consolidation, a single consolidated vote can be much larger than the remainder of the committee. Otoh, controlling the random distribution of indices in the PTC is not something that is attackable. I feel that counting only attestations for thresholds here is both simpler and even safer.",
        "created_at": "2025-08-01T19:02:10+00:00",
        "attachments": null
    },
    {
        "author": "sophia_24798",
        "category": "Cross-layer",
        "parent": "",
        "content": "I found this analysis of MaxEB wrt the existing committees that do weight signatures based on stake: https://notes.ethereum.org/nHqON5l7SACkL_nPwz8Vqw?both#Security-of-committees",
        "created_at": "2025-08-01T19:12:53.874000+00:00",
        "attachments": null
    },
    {
        "author": "sophia_24798",
        "category": "Cross-layer",
        "parent": "",
        "content": "Tbh I find it already quite sketchy, but my intuition is it doesn’t work at all without stake weighting",
        "created_at": "2025-08-01T19:14:28+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah but that's for attestation where we do keep longer term of the weight for LMD purposes, I do not think that applies in this situation",
        "created_at": "2025-08-01T19:15:02.184000+00:00",
        "attachments": null
    },
    {
        "author": "sophia_24798",
        "category": "Cross-layer",
        "parent": "",
        "content": "I see what you’re saying about the PTC size, although I don’t think I have the data to figure that out",
        "created_at": "2025-08-01T19:16:16.582000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I would even understand using weight to determine the participating indices (like we do for proposals) but not in counting for thresholds",
        "created_at": "2025-08-01T19:16:35.750000+00:00",
        "attachments": null
    },
    {
        "author": "sophia_24798",
        "category": "Cross-layer",
        "parent": "",
        "content": "Oh, that might actually be better?",
        "created_at": "2025-08-01T19:17:19.949000+00:00",
        "attachments": null
    },
    {
        "author": "sophia_24798",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think it may also matter that the PTC isn’t slashable",
        "created_at": "2025-08-01T19:18:11.450000+00:00",
        "attachments": null
    },
    {
        "author": "sophia_24798",
        "category": "Cross-layer",
        "parent": "",
        "content": "(Not suggesting it should be)",
        "created_at": "2025-08-01T19:18:21.401000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is rather simple to do, and may even make \u003c@363800010518822915\u003e's life easier for testing (there's an issue that the current PTC selection requires 16K validators and will fail with a very small validator set like the ones we use with testing). But I feel that using balances on a bimodal situation where most validators are 32ETH and some are 2048 is a bad idea. just 4 consolidated validators is already half the committee if the remaining ones are 32ETH.",
        "created_at": "2025-08-01T19:21:43.002000+00:00",
        "attachments": null
    },
    {
        "author": "sophia_24798",
        "category": "Cross-layer",
        "parent": "",
        "content": "My intuition is it’s better to weight the selection than the votes, but I assumed (I guess wrongly) it would be more complex to implement",
        "created_at": "2025-08-01T19:23:47.279000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Nah, that's the same simple loop that we have now for proposers. I'll open a quick PR for that and also try to schedule a breakout room for 2 Fridays from now to gather and discuss all these little design decisions that we can take. At least we can keep the pm issue as a ledger to record these ideas so they aren't lost. In this particular case all clients do keep the shuffling cached so just weighting by balance there is a rather trivial thing to do.",
        "created_at": "2025-08-01T19:27:11.548000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "My intuition is that the PTC wants to be a minimal sampling of the view of the chain at a particular time. The more scattered it is, the better. In this framing i think each vote counts and all should be considered equal. It seems to me that weighing by stake is counterproductive",
        "created_at": "2025-08-01T20:07:18.332000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "weighted base approach is going to be slower than one key one vote approach because you have to loop until you find a hash that satisfy random_byte and that's for 512 keys, but I dont think it's going to be a blocker, we already do this for sync committee, the only difference is for sync committee we would allow possible duplicated, but I take from the above convo, we dont want possible duplicates which is easy to disallow it",
        "created_at": "2025-08-01T20:42:23.098000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "Expanding further, ideally the PTC should maximize the nodeIds (unique beacon nodes) rather than maximizing the stake",
        "created_at": "2025-08-01T21:50:24.472000+00:00",
        "attachments": null
    },
    {
        "author": "sophia_24798",
        "category": "Cross-layer",
        "parent": "",
        "content": "With a lot of consolidation that makes it very cheap to attack. ePBS was designed before MaxEB was live. The security claims in the EIP are not true without one of these adjustments",
        "created_at": "2025-08-01T22:03:07.549000+00:00",
        "attachments": null
    }
]