[
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "how do we square \"7732 allows long-tail builders to enter the market as the system is relatively more permissionless than working with relays today\" and \"builders must have at least 32 ETH staked to participate\"?",
        "created_at": "2025-09-03T15:44:22.259000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "you could imagine some kind of buildernet-esque system with a capital provider to the barrier to entry even further, although it does seem to point to reconsidering this design decision somewhat",
        "created_at": "2025-09-03T15:45:11.701000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is if you want to pretend to be self-building. However one could also just set the bid to 1 gwei, do an off-protocol payment and otherwise do everything as in protocol?",
        "created_at": "2025-09-03T16:33:53.496000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Imo:\n1. relays can still exist and essentially be a small-builder aggregator (if nothing else), fronting capital for them\n2. otherwise, anyone running a validator can be a builder, which is quite a large pool of potential participants\n\nThough it's not great that the relay option is made worse by adding this capital requirement",
        "created_at": "2025-09-03T16:37:42.506000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "You mean the builder actually signs the bid, but the \"real\" payment is done off-protocol? if yes, then yes, this is absolutely doable and clients that want to implement such a system are free to do that (it requires some ad-hoc way of choosing bids).",
        "created_at": "2025-09-03T16:39:23.824000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah, these are options but it still doesn't get to the world where it becomes much simpler for builders to join the market\n\nperhaps we can rely on the existing capital set of validators today, although that seems to start eroding the PBS abstraction in the first place",
        "created_at": "2025-09-03T16:40:58.644000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think today the highest barriers to entry for being a builder comes from getting access to order flow not capital requirements. Ofc it's always better if capital requirements are lower but I don't think it would make an actual difference in the current situation, even if you had 1 ETH requirements you'd still have incredibly high barriers to entry because you need to do BD to get valuable flow and be competitive in the auction",
        "created_at": "2025-09-03T16:48:32.300000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah the bet would be long-tail builders that may only have a block every few months but may be able to materialize some rare opportunity, and i do think a market that looks like this is healthier than one that only has a small number of builders",
        "created_at": "2025-09-03T16:52:34.314000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "There is a gauge that one can put on the needed capital, perhaps 1Gwei is too little and 100ETH is too much, whatever the right number is, it is something that has a parameter that may be changed/adjusted/discussed. Being permissionless however, is something binary, and a permissioned system, in which the gatekeepers are off-protocol and trusted, is a much worse market than one that drops out some long tail builders without capital that can't find a pooling system. There are no guarantees that those same builders will ever be whitelisted anyway.",
        "created_at": "2025-09-03T17:09:59.110000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e Regarding generalized consolidation request, if in the future there is another EIP that needs validators to switch to a new withdrawal credentials, we can accomplish this by using ConsolidationRequest container and just defining another `X_CONSOLIDATION_CALL_NUMBER` right?",
        "created_at": "2025-09-03T18:50:08.427000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "Wait looks like it is more generalized than this. Theoretically this can be any execution requests, not limited to credential change usecase",
        "created_at": "2025-09-03T18:51:43.949000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Execution devs didn't like reusing the consolidations contract so I think that's a no go",
        "created_at": "2025-09-03T20:47:36.894000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "curious what people think about this: https://github.com/ethereum/consensus-specs/issues/4561",
        "created_at": "2025-09-03T22:12:08.004000+00:00",
        "attachments": null
    }
]