[
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Just to summarize. Builders might have economic incentives to delay/cancel propagating their payload:\n* maintain post-state monopoloy\n  - L1 preconfs\n  - transaction confirmation delay\n* payload withholding\n  - cancel losing payload by not publishing (this is very simple because one can publish the full payload +49% of the blobs (a little earlier) and then quickly publish the remaining 2% before the PTC deadline if builder doesn't want to cancel the payload)",
        "created_at": "2025-06-28T08:28:24.718000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "In the withholding \"attack,\" the builder still pays the unconditional payment. So, this strategy might make sense in highly volatile markets, when it's worth risking that payment even if the transactions don't make it on-chain.",
        "created_at": "2025-06-28T08:31:45.749000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Delayed Execution and ePBS: \nFor delayed exec, one could probably put the attestation deadline back to 3.5s. The PTC at 5s is quite aggressive. Maybe 4.5s would be the more robust setting.\nSo, 3.5s vs 4.5s propagation time, same time for execution, 3s (delayed exec) vs 4 seconds (epbs) for aggregation (counting as of the attestation deadline).",
        "created_at": "2025-06-28T08:56:43.034000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "timeaxis_18.png",
                "content": "20e84234c6ac8348c024965be29edb6b02e44072e47de61b615eb5a6ea89c7db"
            },
            {
                "type": "image/png",
                "origin_name": "timeaxis_17.png",
                "content": "4059f0def9b3c9fdc384e35f1e72ca700d32fd02fc73873e046c169e58dfbada"
            }
        ]
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Wait why do you want the attestation deadline so late?",
        "created_at": "2025-06-28T09:39:52.925000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'd push it to 3 seconds for sure, even earlier if we allow validators to choose head earlier",
        "created_at": "2025-06-28T09:41:15.043000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "In the ePBS example, I put it at 2s. For delayed exec, you would not only need the beacon block, but also the payload being propagated from the beginning, thus 1s more.",
        "created_at": "2025-06-28T09:47:45.082000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Oh I see I misread the message above then",
        "created_at": "2025-06-28T09:48:15.128000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "In all the systems we knew, on or off protocol, delayed execution or ePBS or MeV boost. The builder always has an option of not revealing the Payload from the time of bid selection until the broadcast deadline. There are differences in who enforces the reveal and whether the proposer gets paid or in this last attack devised by Anders on even if the txs are visible while it happens. This has nothing to do with delayed execution or ePBS, it's got to do with that difference between bid selection and broadcast deadline. On whatever system if we make that broadcast deadline very short you minimize this, while we want to make the broadcast deadline as large as possible to scale. This is the fundamental trade-off here",
        "created_at": "2025-06-28T10:18:09.890000+00:00",
        "attachments": null
    },
    {
        "author": "anderselowsson",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e \u003c@792404665068158998\u003e Can you guys explain the 51% number? Under time constraints around the deadline, are you saying that reaching 51% of columns published right before the deadline would be sufficient to sway the PTC? This does not square with my understanding of how DA will be determined by the PTC, which is a more complex and probabilistic process. Reconstruction seems out of scope under the analyzed time constraints?",
        "created_at": "2025-06-28T10:22:41.742000+00:00",
        "attachments": null
    },
    {
        "author": "anderselowsson",
        "category": "Cross-layer",
        "parent": "",
        "content": "Absolutely, I agree. But we should be aware that leaving more time for column propagation (which ePBS does very nicely) also leaves more time for reverting the block. We should leave an optimal time for DA, which depends on the blob throughput we aim for. But we should not leave more, because it induces MEV (of a more subtle kind in the form of reversion capabilities).",
        "created_at": "2025-06-28T10:28:14.203000+00:00",
        "attachments": null
    },
    {
        "author": "anderselowsson",
        "category": "Cross-layer",
        "parent": "",
        "content": "We can however note that a 6 second block will squeeze timelines and make these considerations less consequential, simply because there will not be much wiggle room.",
        "created_at": "2025-06-28T10:30:39.169000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "What matters is the time between a payload being locked-in (through a committment) and the latest time when the payload need to be available. Under delayed exec, because the block and the payload are not separated, you'd see them at the same time (essentially, commitment time = availability time). \nUnder ePBS, the commitment can happen seconds earlier than the payload reveal, thus commitment time \u003c= availablility time. \nMaximizing the time delta between commitment and availability might come with incentives.",
        "created_at": "2025-06-28T10:31:27.556000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The thing is that commitment time is not reveal time on any system. The relay gets the signed block and can take that option of delaying the Payload if there's any value on having that option. That delay is minimized today because either that option is not valuable or there's a bigger value in committing to a Payload later. But the option is always there and moreover, the total time of time to commit to a Payload + delay until reveal is constant: it is the time since the choice of head (beginning of the slot) until broadcast deadline (essentially attestation deadline) this is an invariant in any system, be it MEV boost, delayed execution or ePBS. On all of them you can tweak the timings so that they are on either side of the trade-off",
        "created_at": "2025-06-28T11:49:29.342000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Today, commitment + reveal basically happen at the same time. The commitment happens when the proposer signs the blinded block and returns via getPayload. The delay in the current system you're referring is just proposer timing games, however, these happen before the commitment and what matters is the time between commitment and reveal. Since  today block and payload travel together, there is no delay between them. As soon as the proposer commits, relays start propagating the block. \nWith ePBS, the proposer commits with the beacon block, having no influence when/if the payload is revealed.",
        "created_at": "2025-06-28T11:59:09.816000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think we're talking past each other",
        "created_at": "2025-06-28T12:01:21.998000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "i describe it here as \"max. post-state monopoly\", as in, \"what is the maximum time the builder can push for having a post-state monopoly\" (knowledge what the post-state will be before everyone else). At the time when the proposer commits to the builders bid, the builder can delay the payload reveal. This can be seen as a feature but this block payload split also introduces a separation in commitment and payload with allowing some time to pass between them.\nThis is not the case today - the blue line doesn't exist because at the time when the commitment happens the relay starts propagating the block right after. So, realistically, the relay has a few ms of post-state monopoly but it cannot wait to release the block for multiple seconds (the would risk not getting attested to).",
        "created_at": "2025-06-28T12:24:57.910000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "timeaxis_20.png",
                "content": "75ef093db3456c1f8fa3fd99c83040c4721f1f8a1c41a7c3f065dd7960952c97"
            }
        ]
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "If we set the att deadline at 2s and the ptc deadline at 4s, it's effectively the same as the current system today right? vertically integrated relayers and builders can already delay revealing the block until just before the 4s mark",
        "created_at": "2025-06-28T14:40:57.646000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "I also think validators could implement opinionated heuristics and soft blacklist builders if this becomes a trend. I don't think we have that many builders to begin with, assuming today's market, and we're already thinking about stopping taking bids from a builder until it recovers if we see an invalid execution payload. If we continue seeing late reveals for execution or blobs, or some kind of blob timing games, there can be heuristics in client code to ignore builders' bids temporarily",
        "created_at": "2025-06-28T14:47:23.324000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "right, but if they delay until 4s into the slot this is 33% of the slot. With ePBS, this delay can be extended to the PTC deadline, which might be close to 75%-83% (this is time in slot where one builder has exclusive access to the state).",
        "created_at": "2025-06-28T14:55:02.185000+00:00",
        "attachments": null
    },
    {
        "author": "anderselowsson",
        "category": "Cross-layer",
        "parent": "",
        "content": "Can have the deadline for the payload around 4s and the deadline for DA slightly later, using the dual-deadline approach.",
        "created_at": "2025-06-28T16:36:05.249000+00:00",
        "attachments": null
    },
    {
        "author": "anderselowsson",
        "category": "Cross-layer",
        "parent": "",
        "content": "If there is an expected profit from the strategy to begin with, then validators would be leaving money on the table",
        "created_at": "2025-06-28T16:39:47.116000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "right, while this reduces the post-state monopoly time to max of ~60% of slot, it would cost valuable time needed for scaling. It's nice for blobs but limiting for payloads.",
        "created_at": "2025-06-28T16:40:07.728000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The whole scaling roadmap is about using as much of the slot as it's safe. As I said above this trade-off will exist on whatever system, the question is where do we want to be on this trade-off and this is regardless the system we use. We can get the same timings on ePBS than on any other system. I believe we want to keep the broadcast as large as possible and scale blobs as much as we can take safely on nodes And otherwise shorten the slot as much as it takes so that broadcast of blobs cover the whole slot anyway. I acknowledge this attack, which I claim yet again is not a cause of ePBS but on insisting on having most of the slot for the actual bottleneck for scaling which is bandwidth. \n\nSo if this problem does appear. 1) any validator would be able to see it (unlike today the Payload comes signed) \n2) anyone will be able to even see the txs and replay those that aren't timeline gated\n3) nodes can quickly react to this, even preemptively and without even being the ones that proposed the block. \n\nHaving said so, and being the devil's advocate, rational proposers won't care if this game is being played since they get paid anyway. The ultimate trade-off is whether we want to have dead=useless for broadcast, time in the slot or not and I believe we don't.",
        "created_at": "2025-06-28T17:18:52.667000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "If we want we can surely set the PTC earlier, but I still think we don't",
        "created_at": "2025-06-28T17:19:22.941000+00:00",
        "attachments": null
    }
]