[
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Builders are usually protected against next-slot unbundling whereas there's no protection against same slot apart from slashing which is toothless when the profits from unbundling are \u003e1000x thr amount.",
        "created_at": "2025-07-21T05:27:51.885000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm not talking about next slot unbundling I'm talking about same slot unbundling, there is an equivocation, but the next proposer enforces that the latter equivocating block is canonical thus avoiding any race",
        "created_at": "2025-07-21T09:14:22.692000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ah, right, makes sense yeah, agree.",
        "created_at": "2025-07-21T09:39:20.679000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "The next proposer can't do that if all the attesting weight is on the OG block and not the equivocating one no? (or even if 40% of the attesting weight is on the OG block)",
        "created_at": "2025-07-21T10:40:54.733000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Correct, this is about a builder that doesn't want to count attestations, so I repeat: without counting attestations at all and releasing at the attestation deadline, the builder is guaranteed the same unbundling safety as today, that is, it can only be unbundled by an equivocation and two colluding proposers.",
        "created_at": "2025-07-21T11:05:05.941000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Right but here you said \"it can always\"",
        "created_at": "2025-07-21T11:06:59.050000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "or \"trivially\"",
        "created_at": "2025-07-21T11:07:07.715000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "It is trivial, the proposer controls the timing of the broadcast, the builder can refuse to give a bid but cannot control the weight of the current block",
        "created_at": "2025-07-21T11:12:51.714000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "So the only protection of the builder for this attack is to trust the relay will not provide a bid when it's dangerous to broadcast the block",
        "created_at": "2025-07-21T11:13:39.410000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "And we do have regularly late blocks, a few clients don't reorg late blocks yet and we see them regularly being canonical",
        "created_at": "2025-07-21T11:14:30.145000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "The way to deal with equivocations is to have attesters lock on the first beacon block that they see, and only make a PTC vote for that one. That way, a *late* equivocation can never get many PTC votes, whereas an early equivocation lets the builder know they can abort the reveal without paying. By itself this only works without the next proposer colluding (currently the fork choice always allows the proposer to choose \"full\"), but even that could be resolved by enforcing a minimum PTC threshold  for \"full\" to win (e.g. 25%). This is more or less the argument here, with small differences in how PTC votes are used:\nhttps://hackmd.io/UX7Vhsv8RTy8I49Uxez3Ng\n\n\nIn the specific case where the builder observes a beacon block quite early, this is not even necessary though. If the builder doesn't observe an equivocation after some time, enough to make sure that the block has diffused, it knows that honest nodes will attest to the first block even if an equivocation shows up late. Then even proposer boost + some adversarial votes will not be able to reorg it",
        "created_at": "2025-07-21T13:32:21.401000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah this is the trade-off of liveness vs builder safety of requiring a minimum threshold. Adding such PTC thresholds moves closer to a builder reveal boost which is one of the mechanisms, the other one was block slot voting which would enforce that the next proposer reorgs the late CL block. All in all in the trade-off space I like it better with the current forkchoice (as in your PR) and not enforce any minimum PTC threshold",
        "created_at": "2025-07-21T15:51:24.189000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think we could resolve the (equivocation +  next proposer collusion) case without a minimum PTC threshold, by making the fork-choice behave differently when there's an equivocation from the previous slot (e.g. the minimum threshold could apply only then, or something else)",
        "created_at": "2025-07-21T16:27:03.867000+00:00",
        "attachments": null
    }
]