[
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "I opened a PR about the PTC selection: https://github.com/ethereum/consensus-specs/pull/4488",
        "created_at": "2025-08-05T13:59:24.712000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Probably better here than in the PR: can we restrict to the current slot committees instead of the full validator set? I suspect there's an optimization to be made if we know ptc members are attesting the same slot. Also the concatenation itself creates a very large slice and I'm weary of these in general",
        "created_at": "2025-08-05T15:39:40.368000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Crap Github is down, was going to leave my review, the PR looks good to me as is, only thing that bugs me is the full validator indices concatenation.",
        "created_at": "2025-08-05T15:41:34.849000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "and I think you need to add a couple of notes on the modified functions.",
        "created_at": "2025-08-05T15:41:59.612000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "I can change it. My concern with doing that is mainly that under certain conditions there would be a lot of wrap-around and thus duplicate indices. E.g. with current parameters, committee size is ~530 and so it should mostly be enough to scan through 64 committees (since probability is 1/64 and the size is 512 \u003c 530), i.e., a slot's committees. However if the validator set was much smaller, or some parameters were changed, this might not work so nicely. E.g. if committee size was ~256 like at 0.5M validators, we would expect to scan through the slot's committees twice",
        "created_at": "2025-08-05T16:10:57.198000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's not clear that this is a problem (e.g. in the case above, we would still have a small set of duplicate indices since selection probability is only 1/64), but I am also not sure it's not",
        "created_at": "2025-08-05T16:11:47.582000+00:00",
        "attachments": null
    }
]