[
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Here's the fork-choice PR 🙂 \nhttps://github.com/ethereum/consensus-specs/pull/4450",
        "created_at": "2025-07-18T10:29:46.538000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Right, need to think if not listening to the attestations is what a builder would want to do, given that they now have a choice to have more safety than they do today, but there is still another part: \"the proposer needing to release their beacon payload first\". With ePBS deployed, I could not delay my beacon block + exec payload publication to after the attestation deadline (leaving aside the question of whether that's ethical behaviour or not), I would need in all cases to publish my beacon block before the attestation deadline. If there is indeed no need to count attestations, then yes the latency between the beacon block publication and the payload release could be as small as:\n- Builder convincing themselves that the proposer didn't equivocate\n- Builder publishing the payload\n\nvs with relays:\n- Relay receiving signed bid from the proposer\n- Relay publishing the payload\n\nNot completely clear still to me which is the smallest, but agree that if you assume people won't count attestations (and it sounds valid to me), then there is much less latency overall",
        "created_at": "2025-07-18T13:07:08.480000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The relay doesn't need a signed bid needs the full block. And that latency is essentially the same as post ePBS in which the builder needs to receive the full block as well. Difference being that the builder anyway needs to wait until the attestation deadline which makes it imperative to have that as early as possible. As for equivocations, the builder doesn't even need that, as long as it's Payload is released after the attestation deadline it cannot be unbundled except of a collusion between two consecutive proposers plus an equivocation, which is exactly as today, builders cannot protect themselves from that kind of unbundling",
        "created_at": "2025-07-18T13:23:55.214000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think there's a latency differneces though, I'd love to measure this. In both cases the object is the same\n1. Received over rpc by pass through mev-boost middleware\n2. Received over gossip p2p, but there's a chance builder is not the first hop\nIf we really want to \"micro optimize\" this, we could keep the submit blidn block RPC end point, we have to add `getHeader` anyway, so it allows proposer submit blind block to builder via RPC while in parallel publishing it over p2p. But I think this is a little useless, because builders will also want to monitor the p2p network anyway",
        "created_at": "2025-07-18T14:59:56.690000+00:00",
        "attachments": null
    }
]