[
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "I noted down some thoughts on ePBS and would love feedback:\nhttps://hackmd.io/@Nerolation/SyX-AuIVel\n\nMy view is the following:\nePBS comes with 3 nice features: (1) max pipelining, (2) block-payload separation, and (3) unconditional payment. (2) and (3) come with unecessary complexity and don't contribute to ePBS scaling the L1 - only the PTC does.\nThe PTC gives us this form of pipelining which I call *max. pipelining*. Delayed execution also gives us some great pipelining but it's never as good as the PTC because we'd have to use the full attester set under delayed execution whereas ePBS introduces the PTC for that purpose.\nInstead of going to max. pipeline in one step, we could first roll out some subset version of ePBS (remove PTC, no block separation \u0026 no unconditional payment) + do delayed execution. This gives us ~80% of the scaling we'd get through full ePBS with a fraction of its complexity.",
        "created_at": "2025-06-25T06:09:05.028000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Fraction being 97%?",
        "created_at": "2025-06-25T10:45:18.071000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Most importantly I think you miss what is the complexity and the need for the block and payload separation. Even if you broadcast then at the same time. The fact that they are separated objects and you need to deal with them independently as in ePBS, makes the full of 2) already there",
        "created_at": "2025-06-25T10:47:21.284000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "There's zero gain with this proposal other than inexplicably insisting in gutting the trust removal properties of ePBS",
        "created_at": "2025-06-25T10:48:00.427000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "As a general note, the \"Trustless MEV-Boost Payments\" is one of the things that make ePBS's complexity more worth it for me. it's one of the things that makes ePBS different than the other proposals, and I have zero faith it gets readded by a process so focused on L1/L2 scaling that it goes through this effort to strip it out to begin with",
        "created_at": "2025-06-25T10:48:37.491000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's an obvious nonpriority of the ecosystem in general",
        "created_at": "2025-06-25T10:49:27.920000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "More than a non priority the scary thing is that it has become a taboo to even mention it",
        "created_at": "2025-06-25T10:54:18.269000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also, https://hackmd.io/@Nerolation/SyX-AuIVel#Trustless-Payments-Comes-at-a-Cost this whole section seems to be mostly about the travails of builders?",
        "created_at": "2025-06-25T10:55:02.271000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "There's by now an evident effort in explicitly removing this part of ePBS under the umbrella of complexity when they haven't even looked at the implementation to check that there's zero complexity added by it",
        "created_at": "2025-06-25T10:55:13.310000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "To be kind of blunt, to borrow Micah's line, they're service providers, and it's a quasi-duopoly, I don't care",
        "created_at": "2025-06-25T10:55:34.433000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "they're out of protocol now, they're not stakeholders in that sense",
        "created_at": "2025-06-25T10:56:04.044000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah, I mean, I have my concerns (about e.g., the complexity of sending the payload/block separately, whatever the arguments for it, it absolutely does add a lot of edge cases to engineer), but if there are then two places to sign, it's free-ish to exploit that",
        "created_at": "2025-06-25T10:57:34.814000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I do care about builders, I think they are indeed stake holders and an integral part of Ethereum. I just think this document rehashes the same discussion with the exact same arguments used in Berlin that I think were debunked and globally agreed as far as I can tell so it feels tiresome to have to write down yet again against this same list of arguments",
        "created_at": "2025-06-25T10:59:19.645000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah, it was weird seeing the no-PTC stuff come back after hours discussing it",
        "created_at": "2025-06-25T10:59:40.182000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "without a block payload separation, you'd never run into a situation where the block is available and valid, but the the payload/blobs are unavailable. This has direct impact on what we do in fork-choice.",
        "created_at": "2025-06-25T11:01:48.961000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ok, I guess, why claim to scaffold this off ePBS though?",
        "created_at": "2025-06-25T11:02:59.722000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Doing some version of delayed execution with optimistic attesting gives us 80% of the scaling without needing a PTC, unconditional payments or block/payload separation, while still being fully future-compatible such that all three things can still be done",
        "created_at": "2025-06-25T11:03:25.111000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "ePBS gives us all 3: pipelining, unconditional payment and block/payload separation. While 2 and 3 are nice features, we wanted to get pipelining. At this point, we should ask if it's worth going from delayed exec to a PTC design because of the additional pipelining we get, or isn't it worth the complexity (without payload block separation it's less complex though). The second question would be \"now that we get pipelining, is it worth to add two additional features, block/payload separation and unconditional payment\".",
        "created_at": "2025-06-25T11:06:50.564000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "If the 80% pipelining of delayed exec is not enough, I'm fine with moving towards designs requiring a PTC, but this is not fully clear to me yet.",
        "created_at": "2025-06-25T11:08:21.446000+00:00",
        "attachments": null
    },
    {
        "author": "benjeyyy",
        "category": "Cross-layer",
        "parent": "",
        "content": "*While 2 and 3 are nice features, we wanted to get pipelining.*\nwhile I don't know which parties are included in the \"we\" there and I can not comment on the technical aspects: does it make sense in the context of headliner proposals to strip away nice parts of it so that a minimal viable alternative with a bit less complexity is reached? To my understanding, headliner proposals are held to a higher level of complexity than regular EIPs, with a detailed justification provided to explain why this is appropriate.\nis there increased complexity if 2 and 3 are added at a later point because of the adapted initial design? how big is the chance given recent history that these things even make it into hard forks at a later date?",
        "created_at": "2025-06-25T11:35:24.743000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "I was referring to everyone taking part of discussions around scaling and slot pipelining, particularily people advocating for a specific slot pipelining version. The main goal of both ePBS and delayed execution has been pipelining, with ePBS going further providing additional (nice) features (no matter if looked at them separately).\nRe the increased complexity with later adding them: I'm not a client dev but I assume the overhead is more on the governance/hard-fork schedule side than technical. So yeah, we'd potentially have to discuss the features independently which may slot us down but technically it may be fine.",
        "created_at": "2025-06-25T11:55:38.015000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "Re: MAX_ATTESTATIONS = 16\nThe size of attestation data blows up really fast with the validator set growth at the `MAX=16`. It will be ~60Kb of uncompressed attestation data per block if we switch to `MAX=16` at the current validator set size vs today's ~30Kb. Hopefully, there will be no substantial validator set growth in the future (or it even shrinks down in size 🤞). Overall, increase of the size of the block doesn't look crazy to me. But I would also like to understand how important it is, where I can read more about the attester duty change proposed by the most recent design?",
        "created_at": "2025-06-25T14:22:55.367000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "SkdjviEn6.png",
                "content": "d84c9779d59fe6a0211834a68c73f0e4619cbce9306a624072b16afe6609544a"
            }
        ]
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "I left two comments. My general sentiment is that the PTC really isn’t as complicated as people make it out to be, it’s probably just a few days of implementation work. If the concern is on the spec side, I’d love to understand what specifically is blocking.\n\nAnother question: in the section *“A Simpler Structure with no PTCs: Unbundling ePBS”*, what happens if both the `n-1` block and its payload are valid and available, but the `n` proposer builds on `n-1` *without* the payload? In that case, it feels like the `n` attesters still need to protect the `n-1` builder, which brings you back to some kind of signaling anyway\n\nSide note: on the pre-conf concern, we talked to Taiko earlier this week and they didn’t seem too worried, but of course that’s just one perspective.",
        "created_at": "2025-06-25T14:28:09.993000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think the attestation number is not going to change, the issue we're calling you is because we want to use the index, in attestationdata, as a boolean to mean either a Payload is being voted or not",
        "created_at": "2025-06-25T17:37:07.961000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "if the next proposer builds on top of the fork where the payload was unavailable the payload must have been invalid but available. Only then, the block would have received attestations. If the payload is never available, attesters of n-1 would have not attested and instead voted for the parent block. This would reorg block n (for not making the payload available until the attestation deadline, just like today).\nThe signaling is only needed because we allow 3 different states to happen: \n(1) beacon block available / payload available / payload valid\n(2) beacon block available / payload available / payload invalid\n(3) beacon block available / payload unavailable / -\n\nFor the design in the post, you'd only have 1 and 2. ePBS allows all three scenarios when it comes to attestations. The signaling is needed to agree on payload available vs payload unavailable. Assuming the payload is available, everyone can just check invalidity - no voting signal needed.",
        "created_at": "2025-06-25T18:32:41.006000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "I see, because current slot attesters can vote for payload availability. I missed that, thanks",
        "created_at": "2025-06-25T19:47:50.512000+00:00",
        "attachments": null
    }
]