[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "right, concise, to the point, liked it",
        "created_at": "2025-10-04T00:10:10.237000+00:00",
        "attachments": null
    },
    {
        "author": "donnoh",
        "category": "Cross-layer",
        "parent": "",
        "content": "thanks a lot!! this is super helpful",
        "created_at": "2025-10-04T04:26:21.882000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Took a stab at builder payment config: https://hackmd.io/@tchain/payment-config\nFeedback welcome\ncc \u003c@780792191244566529\u003e",
        "created_at": "2025-10-04T15:24:14.252000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "One of the issues of having this off protocol payments fields in the API (which I definitely don't oppose) is that it sets what seems to be a reduction of the latency for a  possible collusion without the extra latency of MEV boost signing: builders refuse to send bids directly to proposers but to a relay, the relay modifies the unsigned off-protocol part of the bid to refund the builder. So it enables for example second price auctions without having to go back and forth to resign. \n\nOf course this is attenuated by adding it to the signed part which in turn means the field becomes part of consensus. This is a feverish half thought concept but it seems to be mostly right",
        "created_at": "2025-10-04T23:03:37.144000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Another problem of enabling these types of relays is that unless there is a 1-1 mapping HTTP-Endpoint -\u003e BLS key(s) authorized from this endpoint, then one of the coolest properties of ePBS which is everyone can see the builder that signed, is lost cause builders can then rotate keys every block.  This type of circuit breaker is one of the major selling points for client devs dealing with angry users. I wouldn't like to lose it.",
        "created_at": "2025-10-04T23:20:37.539000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "One loose way of trying to attenuate this is to have builders/relays to advertise: in this endpoint this and that keys will be allowed to sign. Node operators will pass that info on the config file: this list of indices has this endpoint. And then blacklisting algorithms can be applied as if all these builders were just one. This more or less works, because vanilla clients should reject bids signed by indices they didn't expect on an endpoint",
        "created_at": "2025-10-04T23:23:50.743000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "a failing builder will have to advertise new indices after fixing their bug and then after enough validators have updated their nodes with the new configs they'll be able to land blocks.",
        "created_at": "2025-10-04T23:24:26.343000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@592004585506340885\u003e those are like a gazillion topics for the next breakout 🙂",
        "created_at": "2025-10-04T23:32:51.370000+00:00",
        "attachments": null
    }
]