[
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don’t see how. In the slot timeline I laid out above, it makes no difference if the attestation deadline is at 2 or 4s. A relay or a builder with a bid can still serve it with some arbitrary delay between when it was received or committed by the builder and when it is pulled by the proposer.",
        "created_at": "2025-07-16T07:57:01.805000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The absolute maximum in one is 2 seconds and in the other is 4",
        "created_at": "2025-07-16T09:38:57.434000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ok you're saying in the worst-case of a relay/builder that doesn't play timing games and that commits the winning block at `t = 0s`, then the maximum between payload committed and proposer signature received is 2s instead of 4s. I can see it happen in one of two cases:\n- If the proposer is not playing timing games, they make the `getHeader` call at `t = 0s` and by `t = 0.9s`, they select the highest bid they have received and return the signed bid to the corresponding relay. Then the relay for some reason may withhold the payload until the last possible moment to release it (I don't think this is their behaviour broadly today), meaning the payload is published by `t = 4s` in the worst-case. This seems equivalent to ePBS with the payload reveal at `t = 4s`.\n- If the proposer is playing timing games but they are calling a relay that is not playing games, say the proposer calls `getHeader` at `t = 2s` and by `t = 2.9s` they receive all bids from the queried relays, then they may be receiving a bid from a non-timing-games-playing relay that committed their payload at `t = 0s`. If the proposer chooses that bid (because it's the highest), then yes there is an interval of time between winning block committed and winning bid issued that could be longer than `2s`.\n\nSo I agree that the worst-case is essentially the same, and with 2s deadline you have a stronger upper bound on the \"time between winning block committed and winning bid issued\" in ePBS than in today's world for the second case (but then you have the same payload reveal deadline anyways). The concern is that the critical path in ePBS now includes, *even if mev-boost is used to bypass it*, the proposer needing to release their beacon payload first and the builder waiting for seeing the payload be well-attested enough to release the execution payload. This may not be the case if mev-boost under ePBS also places with the relay the responsibility of broadcasting the beacon payload, then the relay may be more confident",
        "created_at": "2025-07-16T10:20:38.834000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think you continue to add time to count attestations when you should not. The builder does not need to count them. The builder gets the exact same unbundling safety as today without counting a single attestation and just releasing the Payload right after the attestation deadline, even if it's seen the block earlier",
        "created_at": "2025-07-16T15:15:36.156000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The \"counting attestations\" part is not in the protocol, it should not be added nor accounted for when we set the timelines for PTC",
        "created_at": "2025-07-16T15:16:46.813000+00:00",
        "attachments": null
    },
    {
        "author": "nixo.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "quick question for \u003c@755590043632140352\u003e \u003c@363800010518822915\u003e \nwhat is the name of 7732? the EIP is the old name, but new references use the new version (execution payload-block separation), including the lodestar position post. can we get some agreement so people know what to call it? \\:)",
        "created_at": "2025-07-16T19:49:38.432000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's enshrined proposer builder separation. I think that new name is just a catchy play on words that at least I've been using since the talk in devcon to call for attention to scaling properties rather than the separation of duties itself",
        "created_at": "2025-07-16T19:53:04.110000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "We can add more...\n- Execution payloads, builder separation\n- Everyone prefers builder separation",
        "created_at": "2025-07-16T19:57:24.261000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "I thought this may be an interesting source of bug later on, the beacon node is synced but the validator client calls get attestation after payload is processed (still same slot), validator client could be late or disconnected etc. In this case, beacon node must return pending status even if it knows the payload status otherwise validators attestation will not count. I think the specs are fine as it is, but worth calling it out",
        "created_at": "2025-07-16T20:02:50.043000+00:00",
        "attachments": null
    }
]