[
    {
        "author": "kudeta",
        "category": "Cross-layer",
        "parent": "",
        "content": "Not sure you entirely answered my question.",
        "created_at": "2025-06-03T10:05:05.803000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Oh you asked if we were going to rename the EIP?",
        "created_at": "2025-06-03T10:08:37.845000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "No",
        "created_at": "2025-06-03T10:08:39.331000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "We won't",
        "created_at": "2025-06-03T10:08:41.574000+00:00",
        "attachments": null
    },
    {
        "author": "kudeta",
        "category": "Cross-layer",
        "parent": "",
        "content": "I appreciate that the implementation has evolved considerably since you first started working on this endevour. It's clear, now and as you say - that the emphasis of the EIP is indeed the EL/CL separation.  \n\nIn that spirit it would make sense to me to rename the EIP to something that reflects it, while avoiding confusion in the community around well accepted terminology.",
        "created_at": "2025-06-03T10:17:32.789000+00:00",
        "attachments": null
    },
    {
        "author": "kudeta",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm certainly not qualified to talk about fork-choice concerns, but assuming those are resolved positively, i can see that might* start to look like an attractive proposition. On the other hand, the smaller ePBS (proper) stuff, seems far less attractive (i can expand on that). \n\nSo, just for the sake of good governance and clarity i would suggest it might be time to also consider splitting the proposals into two separate EIPs?",
        "created_at": "2025-06-03T10:18:52.098000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I've given an extensive account as to why separating the Payload from the block leads to 7732 as it is today minimally. Attempts to force the proposer to being equal to the builder lead to hacks with pretty bad tradeoffs in complexity like 7886. There is no viable way of separating 7732 by stripping it out from the part that some entity has to sign the Payload",
        "created_at": "2025-06-03T11:48:14.498000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "But the way, there's no auction in protocol in 7732, \nThe only difference ePBS causes to today's behavior is that the relay (eg flashbots) would have to sign the Payload instead of the proposer. And if the proposer wants to continue doing what it does today, it still can",
        "created_at": "2025-06-03T11:59:14.652000+00:00",
        "attachments": null
    }
]