[
    {
        "author": "stefanbratanov",
        "category": "Cross-layer",
        "parent": "",
        "content": "Maybe also can include \u003c@881905303011086387\u003e change for devnet-0 but doesn't matter really unless we have big structural changes, these are few lines of code, so can easily communicate the version when we have few clients ready, on another note, I will be off for few weeks until the end of the year, hopefully someone from the team frees up to do some of the Gloas work, so don't have high expectations for Teku",
        "created_at": "2025-11-24T01:14:48.176000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "same here, will be off next few weeks. \n\nthe light client stuff in gloas/epbs I’ll spec out once a decision on 7688 has been made (avoids merge conflict / double work)",
        "created_at": "2025-11-24T01:17:44.410000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "btw, someone mentioned a pr to me where the idea was to not require builder to be staked.\n\nif we do that and put a blspubkey in there, care must be taken to verify that sig individually. as that key doesnt necessarily have proof of posession, aggregating it with other keys (to accelerate sig verification) may be nonsecure.\n\nalternatively, one could require “any active nonslashed validator index”, those have proof of posession (ie can be aggregated safely) and provide accountability if a payload isnt revealed",
        "created_at": "2025-11-24T01:20:44.708000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "By Etan's change you mean the withdrawals in the state? I take it then the Teku supports this?",
        "created_at": "2025-11-24T09:43:42.543000+00:00",
        "attachments": null
    },
    {
        "author": "stefanbratanov",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah, I meant that one. Have it in a pending PR but will merge when there are specs tests for it.",
        "created_at": "2025-11-24T14:26:47.190000+00:00",
        "attachments": null
    }
]