[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@642887713246150666\u003e can you cancel this one as well?, we still have nothing to talk about except perhaps Ander's ideas and probably the intreraction of FOCIL that I messed up the times, but since the CL spec is not updated and no other clients are working on interop it doesn't make sense to have the breakout. When the CL spec gets updated I'll schedule another call",
        "created_at": "2025-05-08T11:53:46.707000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Cross-layer",
        "parent": "",
        "content": "I’ve removed this Friday’s meeting from the calendar. The next one is scheduled for 23rd May.",
        "created_at": "2025-05-08T12:12:08.579000+00:00",
        "attachments": null
    },
    {
        "author": "poojaranjan",
        "category": "Cross-layer",
        "parent": "",
        "content": "I’d also like to share an update about the new bot that automatically adds meetings to the calendar as soon as an issue is created on the ethereum/pm repo with valid instructions.\n\nSo, if there’s no concrete date or plan for upcoming meetings, we can consider removing all recurring future events. Once the group decides on a meeting and an agenda is opened, it will automatically appear on the calendar—and I’ll handle the livestream.",
        "created_at": "2025-05-08T12:12:51.246000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ahh that sounds very good. Anyway we'll need a meeting soon so probably keeping the 23rd is good, cause I want to propose this for Glamsterdam and it will be good to have the update to the CL spec, even though if it's minimal changes to what we currently have, it will be simplified",
        "created_at": "2025-05-08T12:14:10.021000+00:00",
        "attachments": null
    },
    {
        "author": "stefanbratanov",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e I guess when working on updating the CL spec, you wouldn't rebase on top of fulu right?",
        "created_at": "2025-05-08T17:12:08.814000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Definitely not, that adds a whole new set of constraints on the PTC that we would have to consider",
        "created_at": "2025-05-08T18:04:34.357000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Eventually we will be forced but I think working on Fulu will make our lives miserable and I don't expect anyone to implement it other than us",
        "created_at": "2025-05-08T18:05:19.219000+00:00",
        "attachments": null
    }
]