[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "As soon as the interop with Teku stabilizes I'll focus on pushing the CL spec repo to have it up to date with the current thinking. So far these are the only changes that we have:\n- We no longer have payload boosts nor withoolding boosts. Rather still use proposer boost to force the reorg as per the last spec from Francesco stripped out of Peer-DAS and ILs. I have not really validated that forkchoice yet so extensively as I did the boosts one, this is one of the reasons to delay this change. \n- Accordingly to the above, we removed the boolean \"payload withheld\" from the payload envelope\n- We added the slot to the payload envelope. \n\nExtra:\n- The current interop with Teku also does something more that is off-spec and is not meant to be like the interop: we ignore PTC attestations (since we are not testing forkchoice yet) but also we do reward PTC members when they attest, that is, we do not remove them from the beacon committee. \n\nBefore going further with these changes I'd like to discuss/propose something about PTC attestations. Currently the PTC is drawn from the beacon committee, this imposes a minimum validators of 16384 to be active and this hinders testing. Moreover, with the current spec, if we did remove PTC members from the beacon committee, there won't be any attestations in the beacon chain. \n\nThere are a few options here\n1. Draw the PTC in a different manner than today from the beacon committee, this requires getting a different random draw every slot and come up with the right accounting for rewards. \n2. Draw the PTC in a different manner, but not reward them, just think of the PTC as altruistic behavior from validators. \n3. Draw the PTC as today, but do not remove them from the beacon committee. \n\n2 and 3 essentially make the PTC altruistic, because in 3 you could simply attest and that's it. This is not incentive aligned, however I still believe that the simplicity outweighs any risks.",
        "created_at": "2025-02-16T19:36:13.793000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The code becomes waaaay simpler both in implementations and in specifications. We simply count attestations just as before, the VC does not need to change with regards to attestations (you still attest every epoch). nothing really changes from the validator perspective, and processing PTC attestations becomes much simpler.",
        "created_at": "2025-02-16T19:38:08.736000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This still keeps the 16K keys minimum to work (given that the PTC is still 512) but at least we will still see attestations in this setting.",
        "created_at": "2025-02-16T19:38:35.753000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'll wait until the next call to have a discussion on this, but I'd love it if there's some feedback on this idea",
        "created_at": "2025-02-16T19:39:06.233000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think at a high level, we should decide what properties we want in this PTC. Examples:  \n- Anonymity: Does it matter if validators are known by every party in advance?  \n- Provable: Does validator inclusion have to be provable with the beacon chain state, or can it be provable off-chain (e.g., sample-based like the sync committee)?  \n- Rewards/penalties: Do we want to apply rewards or penalties?  \n\nBased on these properties, we can then go with the simplest design spec -\u003e code",
        "created_at": "2025-02-16T20:53:31.485000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "I also left a long feedback to: https://github.com/ethereum/consensus-specs/pull/4120\nWe should clarify a few more things there, similar to how blocks by range is clarified",
        "created_at": "2025-02-16T20:55:10.089000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is a devnet that finalized an ePBS epoch with Teku and Prysm... it then forked, but it already counts 😄",
        "created_at": "2025-02-16T21:11:57.870000+00:00",
        "attachments": [
            {
                "type": "image/jpeg",
                "origin_name": "final1.jpg",
                "content": "89ac7aac7a4e99ee206fb1eae3b037e3079207cf181305f0d2fda77540ee91c0"
            }
        ]
    }
]