[
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "https://github.com/ethereum/consensus-specs/pull/4525 is finally ready. I’m never volunteering for a “renaming” PR again. We changed `payload_header` to `bid`, but that broke a bunch of tests, particularly around withdrawals, so most of the time went into fixing those. All tests are now passing. I think many of them were skipped before, so this work had to be done sooner or later. If we’re serious about this name change, we should review it soon and have it ready for devnet0",
        "created_at": "2025-09-02T03:10:38.471000+00:00",
        "attachments": null
    },
    {
        "author": "blockkshane",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hi, is anyone currently working on standardizing the Beacon API for epbs? If not, I’m happy to open a PR to add the missing pieces\n\nFrom what I see, we’ll need to update the following:\n- VC’s call to get an unsigned block   [/eth/v3/validator/blocks/{slot}](https://ethereum.github.io/beacon-APIs/?urls.primaryName=v3.1.0#/Validator/produceBlockV3) \u2028\n- VC’s post to publish a signed block  [/eth/v2/beacon/blocks](https://ethereum.github.io/beacon-APIs/#/Beacon/publishBlockV2)\nBoth of these will require removing the deprecated `body` fields + `blobs` and adding `SignedExecutionPayloadBid` and `PayloadAttestations` in the response at minimum \n\nWe'll need to add endpoints for the VC to get the `ExecutionPayloadEnvelope` and post the `SignedExecutionPayloadEnvelope` as well. I noticed there’s a draft PR related to this effort here: https://github.com/ethereum/beacon-APIs/pull/495\n. Not sure if this is still WIP or if I should incorporate those changes into a broader standardization PR",
        "created_at": "2025-09-02T20:24:58.311000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Nice! The Teku guys will have more insight since they implemented the beacon API for their nodes. We also implemented the same endpoints but we don't use the beacon API for our VC.  With Terence's request to not validate the signature on self builds it is interesting that the VC only needs to request the block and it will already come with a valid bid. We anyway need endpoints to request a blind bid to sign and an endpoint to post and submit. But it's not clear if these need to be under the `validator` directory or a new `builder` one.",
        "created_at": "2025-09-02T20:35:58.075000+00:00",
        "attachments": null
    },
    {
        "author": "blockkshane",
        "category": "Cross-layer",
        "parent": "",
        "content": "cool cool, will reach out to teku folks and go from there\n\nhaven't fully grokked this part: `We anyway need endpoints to request a blind bid to sign and an endpoint to post and submit.`\n\nNot sure why we'd need a beacon api endpoint to request a blind bid to sign.  I was thinking the in-protocol builder would run some mev-optimized logic to create a bid, sign that. then would need a beacon api endpoint to POST the signed bid to the BN to then gossip over the network",
        "created_at": "2025-09-02T21:43:09.788000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Once builders are in protocol we should support the builder logic. Vanilla clients running a builder should be able to submit bids",
        "created_at": "2025-09-02T21:47:33.165000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "That is part of the EIP: to make these paths actually covered by us, open source. Builders will want to use those same endpoints with a better sequencing algorithm than vanilla EL",
        "created_at": "2025-09-02T21:49:01.246000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "But on consensus it should be just a standard beacon endpoint they hit",
        "created_at": "2025-09-02T21:49:22.626000+00:00",
        "attachments": null
    },
    {
        "author": "blockkshane",
        "category": "Cross-layer",
        "parent": "",
        "content": "hmm, would one flow be:\n1. builder hits the beacon endpoint to request a bid, which was created in the BN using more advanced sequencing than self building\n2. builder signs it and post it back to the BN for gossip",
        "created_at": "2025-09-02T22:25:42.602000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes, that's about right. I'm interested for the time being on vanilla clients and the 1) case they'd get the standard bid produced by their local engine",
        "created_at": "2025-09-02T22:53:37.759000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Builders need to modify their local engine only to produce better payloads when they call getPayload, which presumably they already do",
        "created_at": "2025-09-02T22:54:14.578000+00:00",
        "attachments": null
    }
]