[
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Fwiw, I think making trustless payments the default is net negative. It is useful as a fallback and possibly as a way to accept bids from untrusted builders without needing to use a relay, but what exactly is the upside from having large builders (that play a repeated game) do trustless payments, with all the risks that are involved, especially when it comes to large payments (which they may well not do or even be able to do, because they might not want to lock up that much capital)?",
        "created_at": "2025-10-01T07:35:32.378000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Not being compensated for a missed slot from a large builder is just a nonproblem",
        "created_at": "2025-10-01T07:37:21.553000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "I really think we'd be better served by allowing 0 value bids from locally whitelisted builders, with the real value being communicated separately (add a `off_protocol_value` to the bid exchange). If anything looks off (circuit breaker or whatever), fallback to ignoring `off_protocol_value` and only consider `value` in the actual bid, as you always do for non-whitelisted builders and p2p bids.",
        "created_at": "2025-10-01T07:40:07.300000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Can someone explain why we would try to eliminate this possibility, at least as a default? I don't think I have heard anything remotely convincing on this point. I'd also not be surprised if staking pools just ended up doing something like this anyway, which would both disadvantage solo stakers and make building less safe because someone else would need to fork clients.",
        "created_at": "2025-10-01T07:41:24.353000+00:00",
        "attachments": null
    },
    {
        "author": "stefanbratanov",
        "category": "Cross-layer",
        "parent": "",
        "content": "Essentially, you are suggesting supporting mev-boost (by locally whitelisted builders you mean the configured relays right?) while still keeping all the other benefits from ePBS. I am not strictly against it as a start to have the `off_protocol` bid option. But it's still a solution that we need to deprecate as soon as Glamsterdam forks and disable it in next fork or come up with a better solution after observing what happens.",
        "created_at": "2025-10-01T08:38:53.480000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "No, this is different than supporting MEV Boost, if I understand what Francesco is saying is to keep ePBS as-is and allow the NO to whitelist builders, whose bids will be chosen with different heuristics than being the \"top bid\", for example it could be \"always accept from this builder\". I do not oppose this, and in fact I believe clients *should* offer this option.",
        "created_at": "2025-10-01T15:57:09.754000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "As  long a we have in-protocol builders that sign the payloads and we can have reasonable per-builder censor/gaming heuristics to blacklist automatically, I see no harm in having this as an option and allowing some operators to choose it by default",
        "created_at": "2025-10-01T15:58:45.915000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "what I do oppose strongly is implementing blind signing and broadcasting of payloads that the local node has not built.",
        "created_at": "2025-10-01T15:59:14.091000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes that's what I mean, and I would keep the heuristic the top bid, just not necessarily defining bid value as `execution_payload_bid.value` for all bids: \n- for whitelisted builders and when not under fallback conditions etc... use `execution_payload_bid.value + off_protocol_value`\n- otherwise, use `execution_payload_bid.value`",
        "created_at": "2025-10-01T16:11:42.740000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "I would even consider adding `off_protocol_value` to  the `ExecutionPayloadBid` itself, to make the whole thing maximally simple and transparent",
        "created_at": "2025-10-01T16:12:40.454000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "i think `off_protocol_value` is a good idea, but one issue is that today the cl client doesn’t know how to read txs. if this off-protocol value fails to satisfy on the execution side, the CL client can’t detect it. this is the same problem we have with mev-boost today. i definitely don’t think we want to touch the execution api for this, but maybe there are eth rpc calls the CL client could use if we know the tx index or if it’s always the last tx",
        "created_at": "2025-10-01T16:42:04.035000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think `off_protocol value` is a bit of a stretch though. This is enshrining a trust relation. I think that can be solved literally off protocol without forking clients. As long as clients don't enshrine an auction (like top bid), which is something ePBS was never meant to do, any off protocol agreement can be carried out and just put normal bids. As an example of such a scheme: Titan and ultrasound bid in Wei in their in protocol bid, but pay in Gwei off protocol. Then the client will only take bids from whitelisted builders with top bid.",
        "created_at": "2025-10-01T22:31:35.905000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Operators that don't want to play this way will be obvious since they will take any bid from the P2P for example that is higher",
        "created_at": "2025-10-01T22:32:24.006000+00:00",
        "attachments": null
    }
]