[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@592004585506340885\u003e An off-comment on the PR to make builders non-validators. I know I suggested to use the execution address instead of the full withdrawal credentials, but one nice feature of validators is that we get a *versioned* type without the need to modify it on each fork. We are already arguably on the third type for this. I feel like this will bite us back if we were to ever need to modify the builder type to have a different feature for them (like with did with 0x01 or 0x02 validators). Incidentally, I will eventually propose, or someone else will, a form of APS, which should probably be called ABS (attester-builder separation) in this context in which simply builders are chosen randomly from the set of builders. If we ever move to such a scheme (or any scheme I can think of in which builders are protocol chosen instead of proposer-chosen) then it is natural to expect a large stake proportion to move to this set (naively it would be the proportion of EL rewards with respect to the total reward). This leads me to believe that having some \"versioned\" type for builders could be useful in the future and this also brings me to the second part of the comment: if it ever happens that we do end up with a large set of builders by stake, it may make sense to move the balances also outside of this slice.",
        "created_at": "2025-12-29T12:01:40.857000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "Could we just add a “version” field to the Builder structure?",
        "created_at": "2025-12-29T14:34:11.550000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "we could",
        "created_at": "2025-12-29T14:34:35.308000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "I will look into this when I get a chance (it will be tomorrow at the earliest).",
        "created_at": "2025-12-29T14:37:15.186000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm going through the PR right now cause Terence told me it's a blocker for us until we release",
        "created_at": "2025-12-29T14:58:55.333000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes, it is blocking things. Thanks.",
        "created_at": "2025-12-29T15:13:13.855000+00:00",
        "attachments": null
    },
    {
        "author": "blockkshane",
        "category": "Cross-layer",
        "parent": "",
        "content": "Working on `produce_block_v4` beacon API. The payment config proposal (https://hackmd.io/@tchain/payment-config) introduces per builder `bid_boost` multipliers, and  I'm assuming this is the latest spec on the topic of how boosts will be signaled from VC to BN\n\nToday `builder_boost_factor` is the only boost mechanism as far as I'm aware. With ePBS, is `builder_boost_factor` being replaced by per builder `bid_boost`?\n\nIf not, does it become a global multiplier applied on top of per builder boosts? Would it also apply when comparing p2p builder bids against local  `GetPayloadResponse.block_value`?",
        "created_at": "2025-12-29T22:53:11.791000+00:00",
        "attachments": null
    }
]