[
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Under the current ePBS, am I right to infer from the specs that builder payments to proposers will take a minimum of 256 epochs to be processed?\nAny why requiring that much stake from builders if they cannot use it for bidding but only everything they have in addition to 32 ETH? Wouldn't it be simpler to have them stake, idk, 1 ETH and instead don't participate as regular validators (thus won't get slashed) - and eventually we wouldn't have to deal with balance decreases between bid and payout ?\nPlease correct me if I'm just reading the specs wrong (using master branch).",
        "created_at": "2025-07-24T08:02:28.454000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's a trade-off based on the current reality: the current builders need to deposit thousands of ETH just to function as today. Having that money sitting there without earning rewards will hurt current existing builders. Enabling non validating BLS keys with a bidding balance is slightly easier on some things (like weak subjectivity considerations) and slightly worse on others like dealing with these new keys that either need to be in a separate slice (like the very first design of ePBS) or have special handling among validators. We could in principle implement both, however I think solutions with pooled staking like buildernet are better for low capitalized builders that anyway are naturally also producing less blocks",
        "created_at": "2025-07-24T10:38:10.221000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah I can see that argument. What about the min time it takes for the mev payment to arrive, is this affected by the withdrawal queue and take a min of 256 epochs?",
        "created_at": "2025-07-24T10:52:55.210000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's a normal withdrawal, what's the problem with that?",
        "created_at": "2025-07-24T10:59:43.417000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Today, the mevboost payment arrives instantly and under ePBS, it takes \u003e24h?",
        "created_at": "2025-07-24T11:26:42.478000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "so what? for a pool that takes several blocks per day it's no problem. For a single staker that is expected to propose a block every few months it's no difference. What is the issue with a delayed payment?",
        "created_at": "2025-07-24T11:41:35.918000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Not saying it's a big deal but money today \u003e money tomorrow. \nValidators will have an incentive to forgo the mechanism and instead go for the (trust-required) EL payment offered through relays.",
        "created_at": "2025-07-24T11:46:11.034000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also, there is infrastructure that tracks proposals by tracking incoming transactions to their fee recipients. This would break.",
        "created_at": "2025-07-24T11:47:17.101000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "cmon",
        "created_at": "2025-07-24T11:56:16.701000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "^ applies for the first comment, the second one is valid and it's Lido's complain",
        "created_at": "2025-07-24T11:56:44.245000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "we did the best we could by modifying the mechanism to keep the same recipient address",
        "created_at": "2025-07-24T11:57:15.850000+00:00",
        "attachments": null
    },
    {
        "author": "mxs_",
        "category": "Cross-layer",
        "parent": "",
        "content": "For some actors today: the fee-recipient is a smart-contract doing a fee-split, the fee incurred by the split is payed by the builder inserting the paiement transaction. With a paiement done via the consensus, this is not possible anymore. Unsure who uses what, but some pools will be affected by this.",
        "created_at": "2025-07-24T12:26:36.760000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "this is a good point. Withdrawals cannot trigger any code.",
        "created_at": "2025-07-24T12:27:48.566000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "I believe builder balances should remain entirely separate from validator balances. They shouldn’t influence the calculation of total active balance or play any role in selecting attesters, proposers or sync‑committee members. Also, builders shouldn't be able to commit slashable offenses such as proposer or attester slashings. By isolating builders' balances, we can simplify our security assumptions around payments and make them instant without compromising safety and probably reduce the required stake.",
        "created_at": "2025-07-24T12:30:42.878000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e when you have time, could you review the following PRs from terence?\n* [eip7732: add becoming builder section](https://github.com/ethereum/consensus-specs/pull/4456)\n* [eip7732: add process execution payload header tests](https://github.com/ethereum/consensus-specs/pull/4457)\n* [eip7732: add process execution payload envelope tests](https://github.com/ethereum/consensus-specs/pull/4458)\nWe can merge them after you approve them 👍",
        "created_at": "2025-07-24T13:20:06.456000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sure I'll do this today. Although some of these will break when we add the data field. Hopefully not many",
        "created_at": "2025-07-24T13:22:19.535000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@363800010518822915\u003e had a first pass before ACD today, I left a comment on the very first test that I just don't understand how the hell it passes and it makes me skeptical.",
        "created_at": "2025-07-24T13:48:28.652000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks... Looking into it after ACD",
        "created_at": "2025-07-24T13:55:18.072000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes, we are aware, it is still a better option than the original one of doing a transfer of balance on the CL apparently because it allows to keep the minimum changes to the workflow (you still need to register a fee recipient to the pool contract and such).  It is a little unfortunate that pools actually have these logic because of being early, for pools getting everything on the CL would have been better from the start since they can start compounding without having to go through the redeposit and withdrawal queues",
        "created_at": "2025-07-24T13:58:42.867000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "but still we went with withdrawals after discussing extensively with Lido",
        "created_at": "2025-07-24T13:59:07.509000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "If the quorum relies on _timely_ head votes being included in blocks, a builder can avoid payment by bribing the next proposer to not include attestations in its block, causing them to be included with delay \u003e 1, thus preventing TIMELY_HEAD_FLAG being set. This way, the builder will not have to pay the bid since it won't reach the quorum anymore. \nAm I missing something here? \n\nFor the quorum calculation, one could ignore missed slots and count head votes as timely if the are included in the next slot after missing slots.",
        "created_at": "2025-07-24T14:05:51.189000+00:00",
        "attachments": null
    },
    {
        "author": "mxs_",
        "category": "Cross-layer",
        "parent": "",
        "content": "If I get it right, one possible path for non-Lido pools relying on exec splits would be to: have their builder, plugged to PBS if there is still a side path, get headers/blocks that include the split TX, submit PBS bid on ePBS to itself \u0026 have validators only accept from their builder, right?",
        "created_at": "2025-07-24T14:26:24.102000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Going off-protocol could be an option but I wouldn't be sure which clients would support such self-signing. If OTOH pools have dealngs with builders that send them off-protocol bids and in-protocol value zero, that would work to bypass the withdrawal procedure.",
        "created_at": "2025-07-24T15:23:33.251000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "Would it be possible to restrict the bids that a proposer can accept based on the proposer's balance? For example, say that a validator with 32 ETH can accept bids with a value up to 32 ETH and a validator with 2048 ETH can accept bids up to 2048 ETH. If the proposer acts maliciously, the proposer would be slashed \u0026 the builder would be compensated.",
        "created_at": "2025-07-24T16:30:11.740000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hmm maybe this isn't even necessary.",
        "created_at": "2025-07-24T16:35:13.589000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't see the point of this",
        "created_at": "2025-07-24T16:35:53.596000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "Okay yes. There are better ways of handling my concern.",
        "created_at": "2025-07-24T16:58:49.650000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Feedback addressed and replied to your concern. No rush",
        "created_at": "2025-07-24T18:52:13.513000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Not logged in on this cell Terence so can't check and write in that PR, but if we're self building, even in 0x03 we should be checking that the value is 0",
        "created_at": "2025-07-24T23:16:11.621000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "But the test uses a non zero value, that's why there's a miss check in my implementation or in the test",
        "created_at": "2025-07-24T23:16:59.649000+00:00",
        "attachments": null
    }
]