[
    {
        "author": "l03443",
        "category": "Cross-layer",
        "parent": "",
        "content": "hey just catching up with the breakout here, just a few notes from our perspective (titan):\n- whether the `get_header` is signed or not seems orthogonal to the open / sealed auction. Having it signed would reduce some spam on the relay, at the same time most relays offer a websocket for fast streaming of bids\n- open and close auctions can't really co-exist and and the change from open to close will be forced due to the fact that some builders will be able observe the open auction but submit only in the private/direct one to the proposer. This reasoning is better explained here: https://titanbuilder.substack.com/i/167800100/auction-dynamics\n- the change in auction dynamics is worth more scrutiny and is not clear to us that the closed one will result in better prices for the proposers. Contrary to a second price sealed auction, in a first price one bidders face uncertainty over the current best bid and need to strategize about this uncertainty, thus may lower the bid to incorporate this added risk. In the call it was mentioned that sealed may be better for transparency and detecting collusion, but having all bids publicly accessible may also help with monitoring/transparency. A node operator also mentioned they may evaluate sharing the current best bid to incentivize builders to outbid each other and drive up the auction \n- that being said the closed auction does have some benefits such as less latency races. Though unclear if these will result in higher payments to proposers",
        "created_at": "2025-09-01T14:38:36.816000+00:00",
        "attachments": null
    },
    {
        "author": "l03443",
        "category": "Cross-layer",
        "parent": "",
        "content": "curious also if you could share more info here, if i understand correctly this would make the current way of getting bids via the relay unfeasible? we did share concern around this and the new capital requirements it will impose on builders + centralization vectors https://titanbuilder.substack.com/i/167800100/staked-builders\nduring the discussions it was mentioned that proposers would still be able to fetch a header via the existing mev boost from unstaked builders, but now it seems not all client will support that?",
        "created_at": "2025-09-01T14:49:36.553000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This coincides with my understanding of these topics",
        "created_at": "2025-09-01T15:55:04.582000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "We will not support MEV boost. If some relay wants to pool and stakes like buildernet and then stake itself that will be a way of getting bids from unstaked builders. Nothing prevents other clients or any validator to support off protocol options, Prysm will not as far as I know now",
        "created_at": "2025-09-01T15:57:08.588000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't think I ever mentioned that we would support blind signing, as it has always been my clear statement that we will not",
        "created_at": "2025-09-01T16:00:09.947000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The protocol however does not preclude this from happening.",
        "created_at": "2025-09-01T16:00:38.462000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@363800010518822915\u003e is this ready for me to look again? https://github.com/ethereum/consensus-specs/pull/4468",
        "created_at": "2025-09-01T16:14:16.742000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Although I kinda feel I should make mine pass tests before that lol",
        "created_at": "2025-09-01T16:15:21.533000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "no, not ready, this only PR I have that's ready today is: https://github.com/ethereum/consensus-specs/pull/4552 (please take a look at that one)",
        "created_at": "2025-09-01T16:25:38.427000+00:00",
        "attachments": null
    },
    {
        "author": "mxs_",
        "category": "Cross-layer",
        "parent": "",
        "content": "If alternate paths are more profitable due to the limits on the building side on bid discovery/paiement via consensus, it's likely that side paths will exist: there will be stakers using vanilla setups, and advanced players able to go off-protocol / going honest-but-rational. Vanilla clients not supporting it/complexity of doing it will likely increase this gap. Are there benefits to the bid discovery/consensus paiement that would drive incentives in the other direction to avoid this situation?",
        "created_at": "2025-09-01T16:42:49.445000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I completely agree, however, I cannot envision a future in which alternate paths are more profitable than simply advertising and endpoint and being contacted by validators. And yes, there are direct incentives in using the vanilla default consensus: it avoids two roundtrips and a bunch of signing as explained in how the off-protocol approach would work. Latency translates directly to money in these bidding process (otherwise we wouldn't see timing games today). So I fail to see how going off protocol will be more profitable to validators. \n\nAs I said, we are fine with proposers deciding to go off-protocol, we simply won't support it in Prysm. If this becomes a general thing we may need to reevaluate, while the example of how latency and direct connections clearly point towards an advantage on staying in-protocol, I'm yet to see a single example of off-protocol advantage besides the obvious one of a lone builder that can´t stake but from time to time gets a jackpot block that could possibly outbid the main builders.",
        "created_at": "2025-09-01T16:55:27.590000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "thanks, trying to fix tests on my PRs, it's taking me time cause I need to familiarize myself more with your test functions... if I manage to fix them I'll look at yours",
        "created_at": "2025-09-01T16:57:52.183000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "thanks, let me know if you need help with the tests, im at your service",
        "created_at": "2025-09-01T17:08:53.276000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "tests are incredibly slow, even on a very powerful machine",
        "created_at": "2025-09-01T17:09:15.819000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "we should probably bench them and find the ones that are delaying so much",
        "created_at": "2025-09-01T17:09:32.011000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "each local run to check if I'm passing them takes me at least 10 minutes just for gloas",
        "created_at": "2025-09-01T17:10:07.365000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "i never run the whole suite, i just run the specific folder, example:\n` python -m pytest tests/core/pyspec/eth2spec/test/gloas/block_processing/test_process_execution_payload_header.py -v`",
        "created_at": "2025-09-01T17:10:40.797000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "so im not sure if it's a gloas specific issue or general issue",
        "created_at": "2025-09-01T17:11:03.175000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I believe this one should be green hopefully https://github.com/ethereum/consensus-specs/pull/4509",
        "created_at": "2025-09-01T17:11:26.117000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "ah shit my master branch is not updated, it may fail upstream",
        "created_at": "2025-09-01T17:14:06.453000+00:00",
        "attachments": null
    },
    {
        "author": "mxs_",
        "category": "Cross-layer",
        "parent": "",
        "content": "One reason: block misses are now a penalty for builders while before it was an opportunity miss for validators. Statistically you miss blocks at scale regardless of how well you operate (re-orgs, network hiccups at the wrong moment, etc), let's say it's 0.1% probability. Let's say your builder makes 0.01 ETH / block on average. How likely are you as a builder to send a 100 ETH bid on a block, on which you will probably make 0.01 ETH, knowing there is 0.1% chance of losing 100 ETH?",
        "created_at": "2025-09-01T17:18:35.792000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "So therefore \"rational\" validators are supposed to take that same bid on the off-protocol  knowing they won't get it if they miss the block?",
        "created_at": "2025-09-01T17:20:15.682000+00:00",
        "attachments": null
    },
    {
        "author": "mxs_",
        "category": "Cross-layer",
        "parent": "",
        "content": "They wouldn't see them in the on-protocol side since it's too risky, on the off-protocol side it's definitely worth it, median block value today is 0.02 ETH, which means one big block like this is orders of magnitude more interesting, even missing 100 of them and getting 1 is more profitable than not seeing them",
        "created_at": "2025-09-01T17:22:59.002000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I see, so the argument is \"builders simply won't bid high on-protocol because of the risk of not producing the block\"",
        "created_at": "2025-09-01T17:25:38.474000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "and otherwise off-protocol they will because even if they don't pay, it's profitable for the validator to take the bids.",
        "created_at": "2025-09-01T17:26:10.357000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "crap fixed them on my branch and now they fail your latest tests... running locally once more, will push in 10 minutes and will find out in an hour if they pass tests 😦",
        "created_at": "2025-09-01T18:05:06.458000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ok, this is finally green https://github.com/ethereum/consensus-specs/pull/4509",
        "created_at": "2025-09-01T19:10:37.498000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I believe this should be green too https://github.com/ethereum/consensus-specs/pull/4513 \nI do not know if it's good to add a regression test right now cause \u003c@363800010518822915\u003e is already covering a lot in his withdrawal PR, I feel I would have to include a lot of that PR to add the regression, I think it's easier to merge this and then force Terence to handle this case 😛",
        "created_at": "2025-09-01T19:36:04.577000+00:00",
        "attachments": null
    }
]