[
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "If you have `offchain_value`, what is the point of the boost?",
        "created_at": "2025-10-05T06:09:51.935000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is a configuration, exactly as we have today",
        "created_at": "2025-10-05T07:23:26.314000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "When I first read this I thought Terence was talking about the builder API and asked the same thing. But it's just a VC configuration. Today we boost external builder or local block. On 7732 we can boost on a builder based level",
        "created_at": "2025-10-05T07:26:12.113000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "It satisfies the use case where a proposer only wants to accept bids from trusted builders and not from trustless builders, I dont agree with this use case but apparently its important to others",
        "created_at": "2025-10-05T13:36:40.559000+00:00",
        "attachments": null
    },
    {
        "author": "l03443",
        "category": "Cross-layer",
        "parent": "",
        "content": "By new indices you mean the builders would need to create new deposits? One concern would be that fixing a bug is likely very quick, say 1h, but updating configs for operators can take time",
        "created_at": "2025-10-05T14:32:38.885000+00:00",
        "attachments": null
    },
    {
        "author": "l03443",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also would this essentially be an altruistic behaviour from the validator pov? Eg i would reject payments from builder X even if they are higher than others, because builder X caused some missed slots recently",
        "created_at": "2025-10-05T14:34:44.073000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The latter, if a builder wants to rotate to a new key for signing, that wasn't listed in the endpoint (that actually may be a good idea precisely to avoid being blacklisted longer than necessary if they already fixed the bug) they need to advertise it and it will take time for operators to update their configs",
        "created_at": "2025-10-05T14:46:51.952000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Re: altruism. Well this is about actually blacklistable behavior, one thing is being profit maximizing, another is to bypass blacklisting behavior that is there for security of the chain",
        "created_at": "2025-10-05T14:48:39.802000+00:00",
        "attachments": null
    }
]