[
    {
        "author": ".paulharris",
        "category": "Cross-layer",
        "parent": "",
        "content": "i do wonder if it'd actually be better keeping builders out of the validators list and then the churn wont increase the indices, but its a big change... it'd make it easier to reason about whats doing validator duties so that'd kinda be nice, but there's a lot of things to consider if we do that... just a thought i had while reading some of this because we're talking about avoiding it but it might actually be simpler... anyway i'll review the prs, you guys have probably thought about and excluded that as reasonable already...",
        "created_at": "2025-12-14T00:12:19.818000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "That’s what we’re doing 😄",
        "created_at": "2025-12-14T00:15:23.941000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Cross-layer",
        "parent": "",
        "content": "oh 🙂 ok then yay 🙂 i was behind it seems heh",
        "created_at": "2025-12-14T00:17:21.512000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "wow you actually managed to write two PRs with passing tests?!?! I don't know if that's a good thing or a bad thing 😅 . Option 2 seems better to me, reviewing that one",
        "created_at": "2025-12-14T00:56:11.789000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ha yeah. The 2nd one was a lot easier. I just copied everything, made a few spec changes, and reverted a bunch of tests.",
        "created_at": "2025-12-14T01:00:27.309000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "impressive to get tests passing, thanks, barring some implementation blowup in complexity I doubt there' s any reaction against these changes.",
        "created_at": "2025-12-14T01:01:43.021000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Teku will be the most affected I think to probably want to make sure they are on board cc \u003c@504202741933932544\u003e \u003c@641548687813902336\u003e",
        "created_at": "2025-12-14T01:02:42.135000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Terence did a lot of work that hasn't merged and will go to trash too",
        "created_at": "2025-12-14T01:03:01.368000+00:00",
        "attachments": null
    },
    {
        "author": "stefanbratanov",
        "category": "Cross-layer",
        "parent": "",
        "content": "I have been a bit out of the loop since I am travelling, but option 2 on first looks decent, is there a TLDR comment somewhere on the change?",
        "created_at": "2025-12-14T01:16:31.514000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "TLDR: Builders have expressed that they prefer faster deposits \u0026 lower staking requirements. One solution to this is to make builders a new type of staking actor which do not perform validator duties.\n\nIn the PR we've made, builders will be tracked in a new `builders` list in the state. Some key changes: There is no activation queue for builders. Top-up deposits are instant, as soon as they hit the CL. The minimum builder balance is 1 ETH. Builders will not be able to perform partial withdrawals; only do full exits. Builders cannot be slashed nor penalized, which leads to a few nice simplifications for payments. Builder payments are faster since they don't need to go through the exit queue \u0026 min validator withdrawal delay.",
        "created_at": "2025-12-14T03:04:08.249000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "But now there's an implementation debate with a few options. Since builders are no longer validators \u0026 will be tracked in a separate list with a new set of indices, the withdrawals code will need to be changes. Options:\n\n(1) Replace the `validator_index` field in `Withdrawal` \u0026 `PendingPartialWithdrawal` with a `pubkey` field that is generic enough to work for both; then rename `validator_pubkey` in `WithdrawalRequest` to `pubkey`. This would be pretty annoying for clients \u0026 result in a decent amount of boiler plate code.\n\n(2) Keep the withdrawal structures the same and add a special bitwise flag to builder indices to differentiate them. This approach is a little hacky \u0026 confusing, but it would probably be simpler.\n\n(3) Add new withdrawal structures specifically for builders. This would require new fields in the state to track them and processing functions. In my opinion, this approach is not a great idea.",
        "created_at": "2025-12-14T03:09:22.124000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "are you also adding new tests for coverage in the same pr or just fixing the existing tests to pass (and we'll do the new tests later)",
        "created_at": "2025-12-14T04:21:41.227000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "Just fixing existing tests \u0026 add new tests later.",
        "created_at": "2025-12-14T04:22:36.460000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "assuming this merges not too far in to the future, are we down to roll this out for devnet0? that would be my preference",
        "created_at": "2025-12-14T04:25:07.120000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I just realized that Friday I' ll be traveling and it's not clear if I'll be on my way to the airport or be able to make the call. So wanted to leave my preferences on the many topics supposed to be discussed there:\n\n- I support moving builders to non-validating entitites. I prefer option 2 and not use pubkeys anywhere in these helpers. I am not that certain about the 1ETH minimum for a couple of reasons, the main one is that it weakens per-builder blacklisting. I am counting on client defaults to blacklist builders that don' t deliver payloads, builders that censor etc. If a builder can spin up 32 keys instead of 1 and rotate them on their endpoint, these mechanisms become less powerful. I do not feel so strongly about this because anyway we could implement this blacklisting per endpoint instead of per builder address, but still my preference would be to revisit this minimum stake.\n- On the builder API discussions. The design should be pretty straightforward: two methods: `get_bid`  and `post_block`. The second is obvious, the first one should send parent root, parent hash, slot, proposer index , gas limit, fee recipient and whether the proposer will consider EL payments or not. There is a discussion going on about if the proposer should include or not other preferences like the min bid values and such. I would not like to have these values in unless there is some clear input from proposers that they prefer to send them (eg Lido, RP, Ethstaker, Stakers union etc expressing an opinion here). \n- On the standards for bid selection. I think that's overall good if we can standardize flags for usage after ePBS. I believe we should at least have the following flags being standard: consider_trusted_bid  (bool, could be absorved in min_bid), min_bid (gwei, minimum bid that would be cosnidered for a trusted payment), min_diff (gwei, minimum bid above the trustless payment  that would be considered for a trusted payment), blacklist_censors (bool) ....",
        "created_at": "2025-12-14T11:53:28.620000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The latest flag could be tweaked by the number of censoring payloads  that the builder sent and is dependent on EL adoption of the system. \n- On the issue of gossiping fee recipient and similar. I don' t mind it, but I think it's overkill. These lists can be kept off-protocol, proposers can' t be tricked cause they verify their fee recipient against the p2p bid. Anyway, I do not oppose the creation of the new topic since in principle is very low volume having only 32 messages per epoch.\n- On the issue of who implements the builder API. I think CL clients need to implement the client side of it, but we should not be mandated to implement the server side of it. I think it's fine to rely on middleware to be the server side of the builder API and anyway most probably this will exist. People from the PBS foundation are alerady working on versions of this and also in standardizing listing of builder' s endpoints. \n- I forgot one thing on the builder API of course: I support signing messages salted by the builder so that builders can protect from other builders trying to get their bids. This should be salted by builder and slot.",
        "created_at": "2025-12-14T11:59:58.307000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Finally if the issue of non-staked builder API comes up, I strongly disagree and we will categorically not implement any form of blind signing.",
        "created_at": "2025-12-14T12:01:07.828000+00:00",
        "attachments": null
    }
]