[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "So I have been torn about the changes for the CL spec. Let me summarize here the differences. \n\nFirst difference: \n\n- \u003c@520034910149410861\u003e' s approach relies on a payment queue and reimbursing the builder in case of a weak block. \n- The current approach relies on reorging the full block in case it is weak. \n\nFrancesco's approach is strictly better as the second relies on moving to (block, slot) voting, making an attestation voting for the parent block count actively against the incoming weak vote. This is a simple change in forkchoice implementation but not simple conceptually and it has some liveness consequences when all blocks that arrive take a long time to process for example. The tradeoff is that to implement a reimbursement system then we need to track votes for blocks in-state and implement a queue to process at epoch transition. I believe this queue is eventually needed anyway with the current approach because of safety reasons, otherwise builders could transfer large effective balances.\n\nSecond difference: \n\n- Francesco' s approach requires attestations to change to signal if they are building on top of full or empty when attesting to a previous slot's block. \n- The current approach does not change the attestation but relies on the PTC for signal for the latest payload in a chain. \n\nThis one I believe it to be a blocker in Francesco's approach, changing the attestation type turned out to be the most invasive change in Pectra and at least Prysm could not go again with such a change ever. Removing the boosts but having attesters enforce the presence of the payload in case of a payload and the PTC agreeing on it is equivalent to setting a payload boost to be 100%. \n\nAfter going through this I believe the best compromise while at the same time makes forkchoice the simplest is to do as follows:\n\n- Implement the queue and reimbursements\n- Remove the builder withhold boost and message and rely on reimbursements\n- Keep the builder reveal boost",
        "created_at": "2025-03-17T12:06:38.823000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "- Do not change the attestation type\n- Eventually if the builder reveal boost is disliked, we can set it to \\infty which is equivalent to attesters enforcing the PTC threshold",
        "created_at": "2025-03-17T12:07:27.334000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The above means that the changes to forkchoice are essentially zero: just remove the witholding boost and make sure that (block, slot) is not implemented. The queue is the biggest change but it should be trivial to implement",
        "created_at": "2025-03-17T12:08:21.579000+00:00",
        "attachments": null
    }
]