[
    {
        "author": "ctra1n",
        "category": "Cross-layer",
        "parent": "",
        "content": "Everyone agrees on pipelining, but there is significant doubts from everyone except you and maybe terence about the implications (complexity, market structure, will it be used, etc) of builder payments.\n﻿\n\u003e people are still trying to enshrine relays and remove builders altogether\nYou are correct, not changing payment structure would keep MEV-Boost in the block-building pipeline. But this is separate to the core pipelining improvement that everyone agrees on. Builder payments as an additional feature (separate EIP) need to be debated separately as it is widely agreed this is not strictly necessary for pipelining (it is an add on with some benefits for some potential users, but not all), adds complexity, and has implications that have not been properly understood by core devs (who are delegating decision making to you and terence it seems).\n﻿\nWhy are we risking another collapse in governance ? Take the pipelining benefits when they have ~100% agreement (free option can be addressed later). I can only speak for myself, but failure to listen to a majority of opinion holders on this will hurt the trust and effectiveness of the EIP process going forward.\n﻿\n\u003e people are still trying to enshrine relays and remove builders altogether\nCircling back on statements like this. Although this might have knee-jerk appeal to core devs on the fence, the implication that block-building pipeline experts outside of core devs are trying to erode core values, or anything like that, is incorrect. The goal here is separate 7732 into its two components of pipelining and payments, include the pipelining which everyone agrees on, and debate the payments when people have time to properly understand, analyse and consider them.",
        "created_at": "2025-10-16T09:46:50.855000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "All I keep reading in statements like these is that no one agreed on EIP-7732, instead they agreed on this other inexistent EIP, with no design, but that it is much simpler than EIP-7732 and achieves the same pipelining. We should not break the EIP-process and try to please agree on shipping this other inexistent EIP, that removes a lot of the complexity of 7732.  There is an implicit assumption that EIP-7732 is modular and there are two independent components that are clearly marked \"pipelining\" + \"trusteless payments\", and that removing the latter is as trivial as just removing that module in the EIP, which is a strict removal of complexity and therefore it will be faster to ship. Moreover, the only argument I hear is this \"we haven't agreed on EIP-7732 at all\" instead of even trying to make a case for the removal of this module of \"trustless payments\" that is so bad that we do not want it even if \"trusted payments\" are already allowed and may be the default. Anyway, I find it insulting to the process to hint that  \"I am risking the collapse in governance\" when the option is to have ACD drop an SFI'd EIP for another one without an existing design. Such choice in the name of simplicity and speed of delivery is even more laughable, since clearly we'll be delayed until that design even appears.",
        "created_at": "2025-10-16T11:04:59.497000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "I am not arguing for this, but just for the record, the alternative design can just be \"don't do anything to guarantee/process the payment and instead assume it keeps happening off-band\", i.e. remove `BuilderPendingPayment` and `BuilderPendingWithdrawal` and any related processing, do not merge the remaining fork-choice changes that are exclusively about giving guarantees to the builder in case of equivocations. I also do not understand at all the argument that staked builders can't just easily be removed. The bid can be left unsigned since it's not travelling through p2p and since the signature doesn't give you any payment guarantee at that point. I don't think removing this stuff from the existing spec would be particularly hard. However at this point I think it's unlikely that it is going to make things faster, maybe the opposite.",
        "created_at": "2025-10-16T11:37:45.946000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Personally the main reason I would have preferred to do just the pipelining stuff (which is definitely doable on its own) is that trustless payments seem like a nice fallback but coming with some annoying extra complexity  (staked builders, more withdrawal machinery, more small fork-choice tweaks) and with quite unclear future-compatibility consequences, because it's not a fallback that it's easy to support. For example, it likely means that future consensus designs need to either compromise on adversarial resilience (we don't care in the current protocol because it is what it is anyway) or on latency. It also means we have less freedom to re-organize block production/the slot, because the design space is going to be restricted to what can support this feature.",
        "created_at": "2025-10-16T11:39:36.041000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Is this a conscious choice we're making, fully aware of the tradeoffs? No, definitely not. Are we going to be willing to reassess this in the future based on a more mature understanding of the tradeoffs? No, probably not. Once the feature exists, it's extremely unlikely that it is going to be acceptable to go in a different direction that is not able to support it. Even if we were to rebuild the consensus protocol from the ground up, it is going to be subject to the constraints created by needing to support this feature",
        "created_at": "2025-10-16T11:40:00.975000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also just as a retrospective, the reason an alternative design does not exist other than in words (as in an alternative EIP, specs) is  imo in large part due to the fact that at every step this has been a very charged, contentious topic, and everyone that has been involved in it is tired of it",
        "created_at": "2025-10-16T11:43:26.768000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "That said, it is a nice feature (seen as a fallback, which is what is actually useful imo) which can hopefully make the network a bit more resilient to certain specific failure modes and perhaps even help us move away from the lowest-common-denominator local block building. It's entirely possible that doing a bit of extra work and stomaching a bit of extra complexity is well worth it. I would feel much better about it if it wasn't a forever commitment though, but that's just not how things go",
        "created_at": "2025-10-16T11:54:28.041000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "yes, there are a few alternative designs: \n- With relays, mev boost, proposer signs everything and has two roundtrips to sign both payload envelope and CL block\n- With protocol builders signing the payload, remove the pending payments and withrawals logic from the protocol, but keep the staked builders to have their BLS keys. \n- Several variations of the above design, with minimally staked builders that are not validating, with regular validators, etc. \n\nAll these designs are valid, they achieve pipelining and have different tradeoffs from the current design, which is fully written.",
        "created_at": "2025-10-16T12:03:22.818000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "fwiw I think it's less a failure of governance than a failure of having this alternative pipelining-only design written, spec'd and championed. I really appreciate the efforts of \u003c@911437720994324570\u003e in that direction, I think more should have been done earlier to really get us to a point where we can evaluate just how much implementation complexity could have been removed and to have a fair discussion on which features of 7732 were consensus and which were not.\n\nI also think it's fair to say that we can imagine pretty well what such a design would look like, and imo it's been overstated just how much of an unknown it really is (Lin did spec some of it, though different from what I think would have been preferred, i.e., with the proposer committing to the exec payload in the beacon block, but that's minor).\n\nBarring the presence of this alternative it does seem preferable to me for 7732 to proceed as is, but I agree with Francesco that we'll likely regret the protocol complexity that is being introduced.",
        "created_at": "2025-10-16T12:22:04.150000+00:00",
        "attachments": null
    },
    {
        "author": "l03443",
        "category": "Cross-layer",
        "parent": "",
        "content": "When talking about staked builders imo it's always worth clarifying the expectation of where block payments will come from in practice, via some off chain protocol or from the staked balance. From my understanding, in the former case the main drawback would be some potential complexity, while in the latter blocks like we saw last week would likely be unfeasible, regardless of whether they go through a builder or a \"staked relay\"",
        "created_at": "2025-10-16T12:32:43.352000+00:00",
        "attachments": null
    },
    {
        "author": "l03443",
        "category": "Cross-layer",
        "parent": "",
        "content": "eg: https://beaconcha.in/slot/12775605",
        "created_at": "2025-10-16T12:32:53.792000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This will depend on the proposer, if the proposer chooses to take payments off protocol, then the payment will continue coming in whatever mechanism is used today, the builder may include a tx in the payload with target the requested fee recipient, or set coinbase to it. \n\nIf the proposer only takes trustless payments then the payment would have to come from the staked balance. The builder is free to send two bids to the proposer with different values for the proposer to choose as well.",
        "created_at": "2025-10-16T12:54:24.097000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e i.e., with the proposer committing to the exec payload in the beacon block, b\nSo I guess you'd go the route of \n\n- Proposer requests bids from the relay/builder. \n- Bids contain a hash of the payload. Proposer signs block with the commitment. And broadcasts CL block. \n- Proposer requests blinded payload envelope from the builder/relay. \n- Proposer signs blinded payload envelope and returns it to the builder/relay. \n- Builder/Relay assembles full payload and broadcast.",
        "created_at": "2025-10-16T13:05:52.291000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Option 1 here",
        "created_at": "2025-10-16T13:06:28.298000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e The bid can be left unsigned since it's not travelling through p2p and since the signature doesn't give you any payment guarantee at that point. \nYes, but you can't really do that with the approach of \"just removing the builder payments and withdrawals\" since the proposer can just inlcude bogus bids from builders and this may end up with blacklistings or whatever.  It doesn't make any sense to remove the signature from bids but keep them on the payload envelope (to avoid the extra blind rountrip). If you were to also remove the signature from the payload envelope and rely on blind signing then yes, it doesn't make sense to sign the bids as well.  I fully agree that having the full mechanism as today with staked builders but without any payment mechanism is viable though, as in option 2 in the list above.",
        "created_at": "2025-10-16T13:35:22.971000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Is it even necessary to have signed the exec payload there in fact?",
        "created_at": "2025-10-16T13:47:34.047000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "We also wouldn't need a signature on the payload envelope if it was just verifiable against the beacon block (the main barrier to which is the extra `state_root`, which we don't really need). If later we wanted to do slot auctions, yes, we would need a signature, but the bid could simply come with a builder pubkey, there's no reason it needs to exist in the beacon chain already unless you care about the stake (actually same thing without slot auctions, if we didn't want the beacon block to commit to the full payload we could still have a builder pubkey in the bid, just doesn't need to be associated to stake/long-lived on the beacon chain)",
        "created_at": "2025-10-16T13:47:40.962000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "yes, it's broadcasted independently it needs to be signed by someone, either the builder who's pubkey we keep somewhere or the proposer itself as in the blind-signing approach",
        "created_at": "2025-10-16T13:48:42.293000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "no the payload is not verifiable against the beacon block unless you also include all the extra info from the payload that you are committing to",
        "created_at": "2025-10-16T13:49:13.106000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "otherwise the payload itself is malleable",
        "created_at": "2025-10-16T13:49:20.539000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "the hash is not enough",
        "created_at": "2025-10-16T13:49:29.138000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Which we can do, as discussed in the past (and I would even still slightly prefer to do regardless of this whole discussion). But even if we don't want to do that, don't see why there has to be staking involved",
        "created_at": "2025-10-16T13:49:54.098000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "not so trivial, same with the latest execution payload header that we tried... yeah we would probably go in circles, but as protocol simplicity goes, the most we decouple the commitments from the EL in the beacon block, the better separatations of concerns we get",
        "created_at": "2025-10-16T13:51:11.264000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "staking is not necessary, again we can go with blind signing and MEV boost. If we want to avoid the double roundtrip then we need to know the BLS key of the builder to verify the signature against, and that, being part of consensus, needs to be stored somewhere",
        "created_at": "2025-10-16T13:52:24.322000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ultimately I think the double roundtrip is not an issue, the payload is committed by the beacon block, meaning if the proposer gets their block from an external builder, they can even sign twice in a row, once over the beacon payload and once over the blind payload that the relay then captures for propagation. Doubt this would introduce any latency. And maybe there is even some cryptographic magic trick that could be used to have the proposer sign only once and the relay manages to recover the right data to propagate a signed exec payload from it?",
        "created_at": "2025-10-16T13:59:13.815000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "It can just come with the bid, it doesn't need to pre-exist in the beacon chain. I make a bid with my pubkey, everyone gets the beacon block including that pubkey, everyone validates the upcoming payload against my signature",
        "created_at": "2025-10-16T14:00:12.693000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah I think that works",
        "created_at": "2025-10-16T14:00:37.239000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Same as if you were committing to a builder, except in this case the builder is also bound by a particular block hash",
        "created_at": "2025-10-16T14:00:43.697000+00:00",
        "attachments": null
    },
    {
        "author": "sophia_24798",
        "category": "Cross-layer",
        "parent": "",
        "content": "Wrt my comment about the free option problem, how would you commit to the slot N payload in slot N+1 with trustless payments?",
        "created_at": "2025-10-16T14:54:37.621000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e\u003c@1035747431461167125\u003e  bc we were not allowed to discuss 7688 today, is it fine for you if I wait with the LC specs for gloas until that decision happened? \ndoing the specs assuming no-7688 just to then re-do them later seems wasteful",
        "created_at": "2025-10-16T14:54:58.827000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think it's fine \u003c@881905303011086387\u003e since anyway we're far from a devnet that won't even include the builder API spec.",
        "created_at": "2025-10-16T14:57:25.478000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "OK, thanks for the prompt reply.",
        "created_at": "2025-10-16T14:58:32.157000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "One thing to keep in mind, is that 7688 involves a bit of SSZ library work. There are thorough tests in consensus-spec-tests, and it can be tested in isolation already today. Given that it touches libraries, it needs a bit of time to implement, even though it's overall not a huge scope. I'm not sure how to coordinate that if ACDC blocks discussions about it (https://github.com/ethereum/pm/issues/1754).",
        "created_at": "2025-10-16T15:06:40.185000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "cc \u003c@833706406699073536\u003e",
        "created_at": "2025-10-16T15:07:07.541000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "PR reviews",
        "created_at": "2025-10-16T16:16:43.200000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I know I opposed having the off protocol value as part of consensus and it's fine to have it in the builder API, but is it worth to design how it can be consumed by the EL? I don't know if today anyone is actually checking if the relay is actually paying what it promises. Even if it's off protocol, we have a chance of making this check transparent now, by anyone not only the proposer",
        "created_at": "2025-10-16T17:02:23.427000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "That's why I wanted to have it in the bid 😄 More transparent",
        "created_at": "2025-10-16T18:29:55.756000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Tbf I should learn not to argue with you too quickly. I still don't like that in consensus but I acknowledge that it's useful. Not sure what people think",
        "created_at": "2025-10-16T19:34:54.295000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "even if the bid includes an off-protocol value, you’d still need to call the EL to verify that the payment value is correct, since the off-protocol value could be anything. i think the existing eth rpc calls should already work for this, as long as we know that it’s the last tx in the block, you can just check the eth balance or make an eth call to confirm the eth transfer matches the off-protocol amount. if not, then just note that you got a bad bid from the builder, and dont take it from that builder or rpc end point again",
        "created_at": "2025-10-16T20:27:36.646000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The standard check would be check the Delta in the fee recipient",
        "created_at": "2025-10-16T20:57:38.457000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "And this can be communicated in `notify_NewPayload` and the return could come back with the Delta",
        "created_at": "2025-10-16T20:58:26.398000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "So that every node can in fact check it",
        "created_at": "2025-10-16T20:58:44.458000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "But this would require the extra field in the bid",
        "created_at": "2025-10-16T20:59:04.452000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "eh, i was hoping we dont have to touch engine api and EL for this.. here's what i had in mind, obv filled with holes\n1. `eth_getBalance(fee_recipient)` soemtime before and after payload is processed, this is not that nice because `fee_recipient` balance can be increased by other reasons like withdrawals.. day to day operation \n2. if we can say payment is always last tx of the block, we could easily get `eth_getTransactionByIndex(pos)` and once you have the tx, you can just verify the `to` is `fee_recipient` and `value` is `off_protocol_bid`",
        "created_at": "2025-10-16T21:05:52.232000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "That would be for extra tooling monitoring this. I mean it to be the CL monitoring this by default on all blocks. The engine API sounds like the appropriate place, just send an address with the Payload and get back how much that address received in this block",
        "created_at": "2025-10-16T21:11:09.762000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "oh i was only thinking \"im a proposer, i want to make sure i got paid the right off chain value and log and error if i dont so i can complain\", but you are thinking \"every node verify every off chain value\". ~~That's right, I agree new payload is best~~ that's the tradeoff",
        "created_at": "2025-10-16T21:13:45.735000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "what's the risk of bundling bid and blind payload together? meaning `getBid` also returns an optional field blindPayload, so proposer can just everything in one trip\n\nhere's the problem im currently tackling, and it's a bit annoying, as a validator client software, how would i know if i should make another `getBlindPayload` call. there's no easy to distinguish if i am self building or i am using mev-boost. Validator only has signing capability here\n\nif we add `off_protocol_value` in `bid`, that may work because i can tell bid's validator index is mine and off protocol value is greater than 0",
        "created_at": "2025-10-16T21:37:34.381000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I hate this idea cause the validator that only wants to take trustless payments will have more latency in the bid",
        "created_at": "2025-10-16T22:21:02.955000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm more thinking I'm a validator and I want to blacklist builders that fail to pay",
        "created_at": "2025-10-16T22:21:41.850000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "why more latency? it's just an optional field, if it's not used, then just `nil`, it shouldn't impact other use cases",
        "created_at": "2025-10-16T23:12:51.030000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The bid will take longer to be received",
        "created_at": "2025-10-16T23:13:26.901000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "It doesn't make sense to do this at the bid level",
        "created_at": "2025-10-16T23:13:43.086000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also why do you want to even support blind objects?",
        "created_at": "2025-10-16T23:14:00.282000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "ya that's fine, i just wasnt sure we wanted to do this for off protocol payment, it makes sense to me, this also doesnt have to be ready / independent timeline becuase get exchange capability",
        "created_at": "2025-10-16T23:14:14.484000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Off protocol payments doesn't mean blind signing",
        "created_at": "2025-10-16T23:14:38.474000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "We won't even support that",
        "created_at": "2025-10-16T23:14:43.855000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "i dont want to support it / nor i care, im just point out your design calls for support, and it's really ugly unless we bundle the two together",
        "created_at": "2025-10-16T23:14:53.841000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Who will then need this payload?",
        "created_at": "2025-10-16T23:15:04.170000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "https://discord.com/channels/595666850260713488/874767108809031740/1428368349372485664 \nthis one, not payload, im talking about blind payload",
        "created_at": "2025-10-16T23:15:33.688000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Blind signing is out of the table",
        "created_at": "2025-10-16T23:15:52.657000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "ok we dont have to do it? why did you mention it then?",
        "created_at": "2025-10-16T23:16:25.460000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Because it's one of the possible designs for not having trustless payments.   Francesco's sending of the pubkeys in the bid is a better one",
        "created_at": "2025-10-16T23:17:12.929000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "ya thats all better, its really hard to do blind signing for a client, already started designing it, if we dont have to do it then it's all for the best, one less complexiity to reason about",
        "created_at": "2025-10-16T23:23:13.488000+00:00",
        "attachments": null
    }
]