[
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Given how many resources have been invested and are being invested on epbs, I think there's some urgency to having a broader discussion on where it fits in the roadmap. Imo, the EIP as it is right now is trying to do too much and should not be shipped (and I am far from the only one who thinks this). No one really understands how the fork-choice works as is, and epbs triples down on making it more complex and less theoretically sound. It is also quite clear to me that a lot of the interest in epbs comes from pipelining, which is indeed very nice and more comprehensive that what other solutions have offered (e.g. delayed availability is at this point a feature that's unique to epbs). On the other hand, creating an in-protocol mechanism for the payload exchange is very much not something that is universally perceived as urgent. Yes, some people say that we need yesterday, but other people say we need it never. With all of that in mind, would there be any appetite to separate out the payload exchange and the pipelining in two different EIPs? The latter would inherit these parts of 7732:\n- beacon block/payload separation\n- a small extra committee that votes on availability of the payload and blobs, taking advantage of not needing aggregation to have a few more seconds for payload and blob propagation\n\nEssentially it would remove all the fork-choice machinery needed to arbitrate the payload exchange. I am aware that a lot of the complexity is in the beacon/payload separation itself. but still, why would we also want to add a lot of conceptual complexity in a very sensitive area of the protocol, when it is not needed for the main objective of the EIP (as most people see it)? Particularly so when the future of the fork-choice is very much still to be decided. One of the goals of SSF is precisely to get to a theoretically sound protocol, and any change away from that direction now is only going to make it harder (possibly even impossible without scrapping these changes)",
        "created_at": "2025-02-13T09:14:11.384000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "One could even say that beacon/payload separation does not require moving the payload availability decision to an extra committee later in the slot, and so it could also be discussed as a standalone feature. E.g. you could imagine doing beacon/payload decoupling but both of them still have the same deadline (4s or whatever) and are attested to together (attestations get a payload availability bit), just to make the chain more resilient to mev-boost failures. Or, if for the time being we really mostly care about getting a bit more time for payload and blob propagation, but not so much about decoupling,  we could also just shrink the aggregation time like \u003c@449019668296892420\u003e has suggested a few times, to make the block portion of the slot relatively bigger (e.g. 6-2-4 or 4-2-2 or 6-3-3, idk)",
        "created_at": "2025-02-13T09:40:42.445000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "All in all, I think there's just way too much that epbs tries to accomplish, and we would be better served by isolating what it is that we actually care about, what is the most effective way to do that and whether it is forward compatible with the other things we want to do",
        "created_at": "2025-02-13T09:43:17.594000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@504202741933932544\u003e any reason to have the payload request by root instead of by hash?",
        "created_at": "2025-02-13T10:44:09.992000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "not dismissing your points \u003c@520034910149410861\u003e just that I have made it very clear and argued extensively over the past 2 years that I strongly dissagree with them and so I am now focused on shipping it more than trying to weaken the EIP. As I mentioned many times, separating the payload from the block is 90% of the EIP. The forkchoice changes with the counting attestations for the builders (your last idea) are minimal if any.",
        "created_at": "2025-02-13T10:46:29.316000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "They’re far from minimal conceptually, and in terms of implications for the future",
        "created_at": "2025-02-13T10:49:36.240000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I disagree with the latter as well",
        "created_at": "2025-02-13T10:50:54.677000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "not the former",
        "created_at": "2025-02-13T10:50:59.484000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "hhmm.. at first pass, I think this decision impacts client DB design and should be coherent with beacon API so we keep that consistent and not force multi index or unnecessary block lookups",
        "created_at": "2025-02-13T11:17:39.739000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah this is precisely why I am asking lol, we implemented the DB by saving the blinded envelopes by hash instead of blockroots, I see some benefits in saving by blockroot but the problem is that when one has the blockroot is easier to get the hash than the other way around",
        "created_at": "2025-02-13T11:18:50.750000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "if generally everithing is blockroot based, make sense to maintain that and not introduce a new root",
        "created_at": "2025-02-13T11:19:13.582000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'll implement this endpoint as is now, but it's something to keep in mind",
        "created_at": "2025-02-13T11:19:18.706000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Internally we keep the DB indexed by hash, it's always easy to get Root -\u003e Hash cause the beacon block points to a hash, but from a hash, without the envelope itself, it's hard to get the root",
        "created_at": "2025-02-13T11:20:06.802000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "ye we should start this conversation in teku too 🙂",
        "created_at": "2025-02-13T11:20:55.787000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "we currently store them by blockRoot",
        "created_at": "2025-02-13T11:33:56.523000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "i think it makes sense if beacon API are on blockRoot too",
        "created_at": "2025-02-13T11:34:16.791000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I did the whole move to store them by block root and then I realize that I overloaded all the state getters to pass indistinctively the hash and the root",
        "created_at": "2025-02-13T11:34:38.127000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Let me start a thread to not pollue again this channel with technical statements",
        "created_at": "2025-02-13T11:35:03.358000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Breakout call in 24 hours. I'm adding items to the agenda, this will pick up pace quickly now, these last few days have been a 24 hours sprint. I think I can get Teku-Prysm finalizing tonight but I'm blocked by a stupid HTTP endpoint. Will implement RPC as soon as I manage later on and that will leave us only with forkchoice implementation bugs",
        "created_at": "2025-02-13T14:22:26.706000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Cross-layer",
        "parent": "",
        "content": "Could you guys add an agenda item to talk about a ePBS devnet? If it helps move the needle with testing, we're glad to launch one",
        "created_at": "2025-02-13T14:58:53.991000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't think we need one until we can finalize enough, other clients don't seem to be close to be ready for a devnet, so with Kurtosis we are fine for a while",
        "created_at": "2025-02-13T15:06:09.391000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I want to test good and bad scenarios before bugging you guys for a stable devnet",
        "created_at": "2025-02-13T15:06:28.327000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "we should be able to finalize with a bunch of missing payloads, reorgs etc...",
        "created_at": "2025-02-13T15:06:47.117000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "And neither Prysm nor Teku has long range syncing yet",
        "created_at": "2025-02-13T15:06:57.451000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Cross-layer",
        "parent": "",
        "content": "oo this is helpful, we can clean up a way to get you reorg tests locally. we need to have this for peerdas too anyway.",
        "created_at": "2025-02-13T15:07:25.318000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "thanks sounds good, things will pick up pace here soon, we've been sprinting these last couple of days",
        "created_at": "2025-02-13T15:08:09.544000+00:00",
        "attachments": null
    }
]