[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@917367578966523934\u003e here",
        "created_at": "2025-06-27T00:56:40.177000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is the idea you guys arrived independently",
        "created_at": "2025-06-27T00:57:25.638000+00:00",
        "attachments": null
    },
    {
        "author": "anderselowsson",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks \u003c@755590043632140352\u003e . It's a very nice idea Mark, and I think it improves ePBS quite a bit. Here is a short write-up with my take on it: https://notes.ethereum.org/@anderselowsson/Dual-deadlinePTCvote \n\nAttaching a figure as well.",
        "created_at": "2025-06-27T01:19:54.223000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "Dual-deadline_PTC.png",
                "content": "d06b8df7cf81f8f6922b04cdd4e1b5f1901793504b020243036d9dfa98490301"
            }
        ]
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "One open question is whether we should shift the attestation aggregation interval up to 4s as well. Otherwise, builders would need to monitor individual beacon attestation subnets and ensure the block has enough weight (\u003e40%?) before revealing the payload?",
        "created_at": "2025-06-27T03:38:43.499000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "The question this brings up is why wouldn't we then just put the attestation deadline to where we'd put the payload observation deadline. Attesters would not attest to beacon blocks where they haven't seen the payload - this simplifies fork-choice. The PTC would then turn into a Blob Availablity Committee. To avoid timing games, we can still put a Payload Header Observation Deadline at second 1.5.",
        "created_at": "2025-06-27T05:19:19.551000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "This monitoring thing is exclusively relevant to sophisticated builders, because someone unsophisticated can always just reveal as soon as they have the beacon block (they don’t have private orderflow, they don’t have anything to unbundle). So if unconditional payment is going to be a part of the design, we should not complicate things further to try to make withholding safety apply without needing to observe all subnets (which is anyway something you can do very easily with a normal connection)",
        "created_at": "2025-06-27T07:09:18.895000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think even sophisticated builders don't need to worry about unbundling, that's impossible unless there's an equivocation. So they need to monitor for equivocations more than attestations. I don't see any reason to increase the attestation time, that ends up eaten by timing games and there's no benefit as opposed if we did it in the current slot structure. If anything I think the attestation deadline should be really at the minimum in ePBS, perhaps 2 seconds is possible",
        "created_at": "2025-06-27T09:23:44.475000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Regarding withholding safety, as I mentioned in the ACD thread: the honest builder guide should say only to just reveal as soon as you see a signed block with your bid in. Nothing about counting attestations and the such. And wet should anyway squeeze the first PTC deadline as much as possible. The mechanism to avoid paying in the case of weak blocks is still in place but it should not be used in normal scenarios (and most probably never). The only question I have is whether we should move the honest reorg feature to 40% from 20%",
        "created_at": "2025-06-27T09:27:09.598000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e The only question I have is whether we should move the honest reorg feature to 40% from 20%\nThat would not be safe",
        "created_at": "2025-06-27T10:08:05.527000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "You mean because of the higher chance of generating a permanent split scenario?",
        "created_at": "2025-06-27T10:39:21.757000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also it's prone to the proposer of N forcing an ex ante on the proposer of N+1 by releasing attestations at the edge",
        "created_at": "2025-06-27T10:41:10.869000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "I meant the latter",
        "created_at": "2025-06-27T11:29:13.408000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah if we had merge view of sorts, but still it's prone to that",
        "created_at": "2025-06-27T13:55:44.704000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think builders need to listen to subnets anyway. You can safely rely on just listening to aggregates. Next proposer can be listening on a lot of subnets and aggregate by itself (at least partially). So it can see much more votes than the ones shown by aggregates only.",
        "created_at": "2025-06-27T14:49:59.058000+00:00",
        "attachments": null
    },
    {
        "author": "anderselowsson",
        "category": "Cross-layer",
        "parent": "",
        "content": "Here is a feature of ePBS to consider: the builder has a free option to revert the payload for almost 10s by withholding blob data. A builder can execute large trades in the block and then study market movements on CEXes. If the market moves against the trades, they can decide to revert the trade by simply not making the blob data available. With the single-deadline PTC vote, they could as an option even have withheld the payload, but this is not feasible in the dual-deadline PTC vote. The dual-deadline PTC vote does however not resolve things, because payload timeliness and DA are on the same branch in the fork-choice.\n\nOne aspect of this that would be interesting to understand further: can you wait later to decide wether you want to make data available when you as a builder have included fewer blobs? Or can you just release partial data earlier until you take the decision?",
        "created_at": "2025-06-27T17:00:24.655000+00:00",
        "attachments": null
    },
    {
        "author": "anderselowsson",
        "category": "Cross-layer",
        "parent": "",
        "content": "A benefit of the dual-deadline PTC is however that the builder must reveal the trades already at the first deadline. Presumably the markets can then account for the fact that they may be executed.",
        "created_at": "2025-06-27T17:07:21.214000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Oh it's an interesting attack cause it's risky right? This only works with private blobs but the tx sender could release the blobs themselves when they see the CL block with the commitments",
        "created_at": "2025-06-27T18:06:07.720000+00:00",
        "attachments": null
    },
    {
        "author": "anderselowsson",
        "category": "Cross-layer",
        "parent": "",
        "content": "I am not sure how clients deal with partial column data on the CL, if that's a relevant framing. My main concern would be if it becomes easier to take a late decision if you have less cells in each column to deal with. Then, if blobs are not that profitable anyway, you might see some builders avoiding them just to leave room for this option. So main things to look out for is if this 10s option induces onchain MEV, less blobs and more withheld blobs. But it may also be of no concern.",
        "created_at": "2025-06-27T18:56:18.847000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Well you could always just insert your own private blob for this purpose",
        "created_at": "2025-06-27T19:29:05.932000+00:00",
        "attachments": null
    },
    {
        "author": "anderselowsson",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah",
        "created_at": "2025-06-27T19:38:44.267000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "crap I'm getting stupidier by the minute, need to leave the monitor",
        "created_at": "2025-06-27T20:30:48.288000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "If I were playing this option game, I’d withhold the smallest num of columns so I could make the decision as soon as the reveal threshold is hit. Withholding more than necessary risks my block getting reorged out even if I want it included, which means I’d need to move the reveal threshold earlier for diffusion",
        "created_at": "2025-06-27T21:16:26.642000+00:00",
        "attachments": null
    },
    {
        "author": "anderselowsson",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes and getting the initial columns out early helps nodes have bandwidth available for your final push. I think there are then two additional considerations: The threshold for how many columns that must be released for the majority of PTC voters to see the data in custodied columns as available (it could vary a bit if not enough supernodes, so you may need some margin here, making everything more tricky). The fact that if I included fewer blobs, I can propagate my columns faster after I have made my decision, and thus gain some marginal additional time.",
        "created_at": "2025-06-27T22:01:24.654000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "In the context of the above where a private blob is needed. Withholding this blob withholds all columns",
        "created_at": "2025-06-27T22:59:59.119000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "But yeah if the builder has column control it makes sense to withhold half+1",
        "created_at": "2025-06-27T23:04:01.155000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Oh I'm confused, this is epbs on top of fusaka right? Then gossip or withhold is strictly limit to column not blob right? Basically there's no more blob in the CL p2p",
        "created_at": "2025-06-27T23:22:30.243000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah but if all blobs are public the mempool can make the data available from it",
        "created_at": "2025-06-27T23:23:40.653000+00:00",
        "attachments": null
    }
]