[
    {
        "author": "__kasey__",
        "category": "Cross-layer",
        "parent": "",
        "content": "My suggestion is to replace this with a versioned hash, which would also be 32 bytes, but is far more useful.",
        "created_at": "2026-01-10T02:39:21.696000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@\u0026595685821026271242\u003e",
        "created_at": "2026-01-10T02:40:00.241000+00:00",
        "attachments": null
    },
    {
        "author": "__kasey__",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ah crap, but it’s n versioned hashes",
        "created_at": "2026-01-10T02:40:03.523000+00:00",
        "attachments": null
    },
    {
        "author": "__kasey__",
        "category": "Cross-layer",
        "parent": "",
        "content": "So… nm",
        "created_at": "2026-01-10T02:40:15.481000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Wasn't it you arguing earlier that we should have them to prevent regs being replayed to other builders to make them do work (build a block) for nothing?\nFelt like it was you that convinced me the lack of dedub in the message is worth it 😁",
        "created_at": "2026-01-10T05:00:49.191000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "I am trying to understand how much real benefit there is in letting nodes call `getBlobs` on the winning bid versus waiting for the execution payload itself. has anyone tried to quantify the latency or bandwidth savings in this model?\n\nMy concern is that including full commitments in bids can eventually become an attack surface. At the end, 48B times 128 blobs is a ~6 KB per bid.  Even if most winning bids come over RPC via pulling, P2P is still relevant and already somewhat fragile. We have defenses like one bid per builder and price increment rules before forwarding, but those seem easy to game. With something like 100 ETH, an attacker could spin up 100 unique builder indices and start bidding at 1 gwei... etc",
        "created_at": "2026-01-10T05:20:39.368000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is on the bid request and that's a request from builders yes",
        "created_at": "2026-01-10T09:27:35.845000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Registrations don't really need it, at least I don't see what's the real problem with fake replays",
        "created_at": "2026-01-10T09:29:12.247000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Although if the signing is not so much of a problem, adding it to the registration is also worth it for the following situation: a proposer has different builder preferences for different builders. And replays could make one builder not know what are the real preferences for them, making them prepare a payload that will be rejected",
        "created_at": "2026-01-10T09:35:59.206000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "As a builder, I would forward the registration I got from the proposer to other builders. Builders have no way to tell if the registration is really supposed for them, so, they would build a block and engage in the competition. The proposer would never pull directly from those, waisted work, and they would still stend bids over the p2p, consuming resources(?).",
        "created_at": "2026-01-10T11:22:50.285000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "the wasted work I believe it's irrelevant: builders anyway build multiple blocks per slot, they will need to build for this slot even if the current proposer doesn't call them, because during N+1 they need to build on top of N, so this part doesn't worry me at all. The other attack of replaying registrations may be worse cause if the proposer sent a registration with a max trusted payment of say 1ETH to builder 1 and 2ETH to builder 2. Builder 2 can try to force builder 1 to build a block with a trusted payment of 1.5ETH that the proposer will reject.",
        "created_at": "2026-01-10T11:28:07.839000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't think the wasted work is irrelevant. Today, builders check if the validator is connect to a relay they are connected to and only then engage in block building. \nEngaging in building (which is great workload thus costly) is different from just processing one block as part of the stf to then continue with N+1.\nAnd yeah, the per-builder registration adds flexibility, even though it might not be (initially) needed.",
        "created_at": "2026-01-10T11:49:08.684000+00:00",
        "attachments": null
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "I made a PR to incorporate this here: https://github.com/ethereum/consensus-specs/pull/4826",
        "created_at": "2026-01-10T14:20:56.986000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "the main probelm with adding builder indices to the registration and to the bid request is to handle cases where the builders indices change dynamically. For e.g in cases mentioned here: https://discord.com/channels/595666850260713488/692078615269212180/1458840067899527259\nBuilders can expose an endpoint where they can return a list of indices they are running or will submit bids from but now clients will have to integrate with this endpoint and maintain a builder -\u003e builder indices cache etc. \nwe also need to think about how frequently clients will call this endpoint, once an epoch? the epoch where one where they need to send the registration etc. i feel like it adds this complexity which i want to know if it is really worth it",
        "created_at": "2026-01-10T16:40:14.514000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "to avoid replays,  could we also enforce proposers to sign the request to post validator registrations such that other builders can't call the registration endpoint like how we are doing now for the getBid endpoint? \nIn the current version, we are making the proposer sign over the builder URL maybe we could do the same for the validator registration endpoint? so that only the proposer is able to call the endpoint?",
        "created_at": "2026-01-10T16:45:04.383000+00:00",
        "attachments": null
    }
]