[
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Is there a devnet0 spec? We are only doing local construction right?",
        "created_at": "2026-01-22T00:56:44.092000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "yes",
        "created_at": "2026-01-22T01:06:33.676000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Well, at the same time another functionality is carried by the same client: being a builder.",
        "created_at": "2026-01-22T01:09:08.640000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "but yeah, I guess it can be explicitly mentioned in the spec",
        "created_at": "2026-01-22T01:09:40.198000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "I hope we can just use v1.7.0-alpha-1 for devnet 0. I think variable PTC deadline is tricky for Lodestar to implement. Somehow VC needs to know the arrival time and the size of the execution payload. Either VC needs to determine payload timeliness, or this info need to be passed through beacon api",
        "created_at": "2026-01-22T01:11:26.801000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "If it's only local construction, I want to avoid implementing gossip for bids. But I worry if the ones that implement gossip for bids will downscore us. Something to keep an eye out",
        "created_at": "2026-01-22T01:23:05.770000+00:00",
        "attachments": null
    },
    {
        "author": "0xunclebill",
        "category": "Cross-layer",
        "parent": "",
        "content": "lighthouse would love to avoid gossip for bids in devnet 0 if possible",
        "created_at": "2026-01-22T01:35:39.282000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "I made a website to help builders onboard at the fork: https://discord.com/channels/595666850260713488/1463756243767132304",
        "created_at": "2026-01-22T04:52:11.830000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "To clarify my undestanding, If I am a block builder and I need to pick the parent execution payload on top of which I need to build my block for a given slot S. The PTC attestations which dictate the timeliness of the payload from slot S-1 will only be included by the proposer in slot S. So at the start of slot S, if a block builders wants to know which is the execution payload on top of which I build my block, I would have to know the PTC attestations too right? to know whether the execution payload was not timely seen or not?",
        "created_at": "2026-01-22T06:26:52.096000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "if it is not timely seen, then we need to pick the parent payload of the untimely payload i think?",
        "created_at": "2026-01-22T06:28:27.833000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "potuz did explain this to me but i think i m still a bit confused. I would assume clients would expose some sort of beacon api to fetch the latest canonical execution payload block hash?",
        "created_at": "2026-01-22T06:29:19.405000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "as i think the canoical beacon block and the canonical execution payload block hash might be different",
        "created_at": "2026-01-22T06:29:47.865000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "Cross-layer",
        "parent": "",
        "content": "Remove the blob sidecars section in Gloa...",
        "created_at": "2026-01-22T12:52:05.557000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "For ePBS devnet0, do we expect to send gossip PTC attestations or we decided to ignore this for now and build on full?",
        "created_at": "2026-01-22T15:58:16.170000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Cross-layer",
        "parent": "",
        "content": "you cannot use \"compressed payload size\" for any limit since the compression is not deterministically defined - it's best effot and different compressors will yield different payload sizes, even _larger_ than the uncompressed data",
        "created_at": "2026-01-22T16:19:43.640000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Cross-layer",
        "parent": "",
        "content": "when establishing a limit, you need to account for protocol overhead as well - it's possible to compute this from a \"payload size\", ie you can know ahead of time the _smallest_ header that is sufficuent for a payload of the \"maximum size\" - however, the way libp2p is specified, dependign on the implementation, they might add _more_ stuff to the header and thus go over the limit - if we compute the limit to the prescision of exactly accounting for header sizes, implementations need to be audited.\n\nsimilarly, there are security reasons to tie the limit to the max gas - the smaller the limit, the less damage a message can cause before it's caught",
        "created_at": "2026-01-22T16:22:05.759000+00:00",
        "attachments": null
    }
]