[
  {
    "author": "potuz",
    "category": "Cross-layer",
    "parent": "",
    "content": "Ok <@520034910149410861> I think I know what change would make you happy. I think if I change the `if is_payload_timely` check to both timely and available by the PTC then it would work. In this way the PTC will still not force the proposer to reorg and if the data came late it will allow the proposer to reorg",
    "created_at": "2026-02-06T00:44:48.121000+00:00",
    "attachments": []
  },
  {
    "author": "potuz",
    "category": "Cross-layer",
    "parent": "",
    "content": "Will that work for you? Just move the assertion from outside to inside the last return clause",
    "created_at": "2026-02-06T00:45:24.477000+00:00",
    "attachments": []
  },
  {
    "author": "potuz",
    "category": "Cross-layer",
    "parent": "",
    "content": "Like in [this commit](https://github.com/ethereum/consensus-specs/pull/4884/changes/d055ccef9ac9c8ea9fbd2e879e03a309909a1dcb).  This moves the responsibility to the proposer to reorg instead of the PTC so is more lax. However, with this change I think honest proposer behavior should be to choose to build on empty if the PTC has voted against data being available but timely and the proposer has it's share of the data but it's not a super node. \n\nI don't think the situation with the payload is symmetric. I believe the proposer should build on full if the ptc has voted that the payload wasn't timely but was available and the proposer saw the payload timely. But anyway this is for a different discussion, I believe this change is more in line with what you wanted",
    "created_at": "2026-02-06T00:54:28.057000+00:00",
    "attachments": []
  },
  {
    "author": "terencechain",
    "category": "Cross-layer",
    "parent": "",
    "content": "ya that makes sense to me, and is what i had originally thought we were doing",
    "created_at": "2026-02-06T01:09:40.057000+00:00",
    "attachments": []
  },
  {
    "author": "ralexstokes",
    "category": "Cross-layer",
    "parent": "",
    "content": "<@755590043632140352> <@592004585506340885> sorry if you already saw this but curious about this question\n\nhttps://github.com/ethereum/consensus-specs/pull/4897/changes#r2771800400\n\nthe logic on the PR right now is fine, and i've looked at some of the tests but wondering if we can simplify further\n\nonce we align on that question i'm happy to continue verifying the tests\n\ncomingling builder WCs into the validators \"object\" space makes this a bit subtle to do correctly",
    "created_at": "2026-02-06T01:13:48.777000+00:00",
    "attachments": []
  },
  {
    "author": "potuz",
    "category": "Cross-layer",
    "parent": "",
    "content": "Probably better to continue here. The problem of not verifying is that anyone can front run a builder and screw that deposit",
    "created_at": "2026-02-06T01:16:34.709000+00:00",
    "attachments": []
  },
  {
    "author": "potuz",
    "category": "Cross-layer",
    "parent": "",
    "content": "We could \"return\" the money in the EL but that also opens for attacks and even subtler bugs",
    "created_at": "2026-02-06T01:17:16.989000+00:00",
    "attachments": []
  },
  {
    "author": "potuz",
    "category": "Cross-layer",
    "parent": "",
    "content": "The other option is to change the logic of pending deposits and add builder deposits there as well, which is something we explored before but it also has a number of drawbacks",
    "created_at": "2026-02-06T01:18:13.767000+00:00",
    "attachments": []
  }
]