[
    {
        "author": "jameshe5018",
        "category": "Cross-layer",
        "parent": "",
        "content": "Not sure if this is better for here, ACDT, or the \u003c#710831784991916072\u003e  channel\nBut with ePBS on the validator propose path, we now have to call 2 endpoints the get block and get payload envelope endpoints, because we have to call these together I believe that would make the beacon apis stateful because calling get block on one bn and calling get payload on another bn wouldn't work. we had a case in Fusaka where we wanted to not have to pass the blobs to the validator client only to pass it back to the beacon node.  \nDo we try to do something to resolve this and make the beacon apis stateless again or do we warn users somehow for this?",
        "created_at": "2026-01-23T16:20:01.569000+00:00",
        "attachments": null
    },
    {
        "author": "nflaig",
        "category": "Cross-layer",
        "parent": "",
        "content": "I brought up the same here https://github.com/ethereum/beacon-APIs/pull/552#discussion_r2642624992, I think we should bring it up on ACDT and especially get feedback from Vouch/Vero on this. (maybe repost the same on api channel as well)",
        "created_at": "2026-01-23T16:23:35.807000+00:00",
        "attachments": null
    },
    {
        "author": "jameshe5018",
        "category": "Cross-layer",
        "parent": "",
        "content": "cool",
        "created_at": "2026-01-23T16:24:10.598000+00:00",
        "attachments": null
    },
    {
        "author": "nflaig",
        "category": "Cross-layer",
        "parent": "",
        "content": "also would be good to get more eyes on https://github.com/ethereum/beacon-APIs/pull/552, feel like it's in a pretty good state and merging it would allow to run api spec tests for us and iterate on spec on master branch",
        "created_at": "2026-01-23T16:48:43.507000+00:00",
        "attachments": null
    },
    {
        "author": "jameshe5018",
        "category": "Cross-layer",
        "parent": "",
        "content": "are people planning on talking about devnet 0 scope at acdt next monday or too early?",
        "created_at": "2026-01-23T17:11:34.120000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "I've made a specs issue for the upcoming release. It defines freeze/release dates \u0026 the PRs we want to get merged by then.\nhttps://github.com/ethereum/consensus-specs/issues/4858",
        "created_at": "2026-01-23T19:36:10.639000+00:00",
        "attachments": null
    }
]