[
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "So the attack is someone splitting the network so attesters do not see PTC votes, and including PTC votes in the block allows honest proposers to synchronize honest attestor's view",
        "created_at": "2026-01-14T00:51:04.183000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "There's no guarantee that attesters got the PTC vote. If the proposer got a consensus to reorg or to build on top of the Payload, by including the votes in the block they make sure that attesters have to follow their view regardless of what the attesters local view was",
        "created_at": "2026-01-14T02:10:33.067000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@\u00261417820113981145228\u003e please review the following PR. It would be good to decide on this soon.\nhttps://github.com/ethereum/consensus-specs/pull/4817",
        "created_at": "2026-01-14T04:56:25.860000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "Cross-layer",
        "parent": "",
        "content": "Onboard builders at the fork by potuz · ...",
        "created_at": "2026-01-14T05:38:54.797000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "The proposer can always build on top the full payload of the prev slot, even if the PTC voted for \"not available\", right?\nSo, having the PTC votes on chain is only needed for proposers that want to enforce the PTC's \"not-available\" vote?",
        "created_at": "2026-01-14T06:27:57.306000+00:00",
        "attachments": null
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "What happens if the proposer doesn't include PTC votes?",
        "created_at": "2026-01-14T07:43:07.390000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes. Proposer has the ability to extend \"full\" even majority PTC votes \"empty\". Attesters will go with full \n\nSo if I'm not wrong, the main use case is for proposer to force empty",
        "created_at": "2026-01-14T07:58:20.115000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "PTC votes weigh in tie breaking, too",
        "created_at": "2026-01-14T08:25:38.161000+00:00",
        "attachments": null
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Oke that makes sense. Is there a reason it was chosen that empty blocks are forced by the proposer including payload attestations instead of attesters listening to PTC votes and the votes remaining off-chain?",
        "created_at": "2026-01-14T09:03:45.530000+00:00",
        "attachments": null
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Why is it not guaranteed that attesters get the PTC votes? Is it then guaranteed that the proposer gets the PTC votes?",
        "created_at": "2026-01-14T09:04:34.348000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Attesters that don't have the Payload won't attest to the proposers block. So if there's a PTC quorum on missing, it's rational to build on missing. If there's no quorum then it makes sense to build on present by default",
        "created_at": "2026-01-14T09:42:21.127000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Nothing. It risks his view being different than that of attesters",
        "created_at": "2026-01-14T09:42:50.440000+00:00",
        "attachments": null
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm asking about the PTC votes because I was thinking they won't need to go on-chain necessarily. I think the crux is whether attesters see PTC votes which makes sense to me since the proposer needs to see them as well. I understand the PTC votes are small but still it would be good not to have items on-chain if not necessary 🙂",
        "created_at": "2026-01-14T11:28:25.964000+00:00",
        "attachments": null
    },
    {
        "author": "l03443",
        "category": "Cross-layer",
        "parent": "",
        "content": "Out of curiosity has there been any discussion on the bid scoring? would it be standardized across clients? Was wondering if clients will support a mix of trusted and trustless payments in the same bid",
        "created_at": "2026-01-14T15:16:29.030000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "It would be good to have standard flags but I think it should be highly operator configurable. The spec supports a mix so clients should support it. Notice that it's only additive so if you include x for trustless and y for trusted, the proposer will get x+y. I think such system is useful when the proposer specifies a maximum trusted bid that he's willing to accept",
        "created_at": "2026-01-14T19:09:10.622000+00:00",
        "attachments": null
    },
    {
        "author": "bharath.vedartham",
        "category": "Cross-layer",
        "parent": "",
        "content": "we can define a block scoring mechanism in the builder-specs like this: https://github.com/ethereum/builder-specs/blob/main/specs/deneb/builder.md#block-scoring-1 \nthe block scoring should only be applicable for builder-api bids i believe since the p2p bids will all be trustless payments",
        "created_at": "2026-01-14T19:13:49.175000+00:00",
        "attachments": null
    }
]