[
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "If the shuffle is different in two competing branches, PB doesn't help because there isn't a single proposer. It helps only as long as you have two competing branches but a single proposer that can choose between them",
        "created_at": "2026-01-07T11:17:38.666000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah I agree, I don't think rolling out this change in an uncoordinated way would make anything worse than it currently is. On the other hand it doesn't really matter to roll it out soon, so I am fine with either option",
        "created_at": "2026-01-07T11:18:49.002000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think we're kinda blocked now because it appeared on spectests. Unless people complain here I'll implement this today and it'll be in Prysm's next release the other option is to skip forkchoice tests",
        "created_at": "2026-01-07T12:22:42.454000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Does it change the outcome of any test though? Are there actually tests about applying proposer boost from a non-canonical proposer?",
        "created_at": "2026-01-07T12:24:46.457000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes, I haven't looked at the list yet but I remember the pulled tips tests were putting attestations on very long reorgs, those tests are candidates to have switched head earlier because of PB. \n\nPerhaps rather than applying this fix now to pass the tests we need to study them to replace the previous intended test with the new behavior, but still test the recovery from long reorgs",
        "created_at": "2026-01-07T12:42:03.904000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Look here \u003c@520034910149410861\u003e https://discord.com/channels/595666850260713488/1458104535695495282/1458230492724990163",
        "created_at": "2026-01-07T12:42:53.997000+00:00",
        "attachments": null
    }
]