[
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "some notes from the eth2 call today : https://hackmd.io/@benjaminion/SkfYVnJ68#Validator-key-hygiene",
        "created_at": "2020-06-11T15:39:16.926000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Plan is to continue discussion here and on EIPs and to schedule a call for nextweek",
        "created_at": "2020-06-11T15:39:55.448000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "make sure to share any recommendations that come out of client audits",
        "created_at": "2020-06-11T15:40:20.479000+00:00",
        "attachments": null
    },
    {
        "author": "ethzed",
        "category": "Consensus Layer",
        "parent": "",
        "content": "One relevant thing that came up in our external review is to consider using `aragon2id` for the key derivation function (EIP-2535). This EIP currently specifies two KDFs, `PBKDF2` and `scrypt`. \n\n- `PBKDF2` computations require very little RAM, making it potentially vulnerable to bruteforce attacks with GPUs.\n- `scrypt` is a better alternative, but as mentioned by Carl I think, it takes large amounts of memory (and the data-dependent memory accesses might make it vulnerable to side-channel attacks).\n\n`Argon2` won the 2015 password hashing competition. I know \u003c@!361447803194441738\u003e had planned to commenting on the relevant EIP with this finding, but thought I'd mention it here too 🙂",
        "created_at": "2020-06-11T23:04:22.766000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus Layer",
        "parent": "",
        "content": "FYI we have a short blurb on key management here:\n\nhttps://lighthouse-book.sigmaprime.io/key-managment.html",
        "created_at": "2020-06-11T23:08:20.667000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Something that I've noticed during converstations is ambiguity around the term \"wallet\":\n\nI tend to use wallet to refer to an EIP-2386 \"walletstore\", which is just a single JSON file that contains (a) an encrypted seed and (b) a nonce (`nextaccount`) that allow for churning out validators incrementally as per EIP-2334 (Deterministic Account Hierarchy)\n\nI've noticed \"wallet\" also being used to refer to an ethdo concept of a \"wallet\", which (I think) is a directory which contains an EIP-2386 walletstore and zero or more EIP-2335 keystores (and an index).",
        "created_at": "2020-06-11T23:22:48.724000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think this naming system could be improved. We have a \"keystore\" which holds \"keys\" but the \"walletstore\" doesn't hold \"wallets\", its the other way around.",
        "created_at": "2020-06-11T23:31:05.993000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Regardless, I think a VC that wants to sign consensus messages needs not be concerned with either concept of a \"wallet\". It just has `n` keystores loaded from some arbitrary directory structure.",
        "created_at": "2020-06-11T23:32:46.481000+00:00",
        "attachments": null
    }
]