[
    {
        "author": "zkdid",
        "category": "Consensus Layer",
        "parent": "",
        "content": "how much of a security risk do you think there is with generating keys on computers, I am asking because I am in the middle of a discussion about keys in the wthdrawal-method group and I am questioning in my head how safe the node withdrawal keys are when generated and typed back in to the CLI, I know they say turn off the net when you generate the key, but is there not a log, is the CLI encrypted, how would one know if there was a key logger on your PC or Mac, and as I say, what logs are stored after the generation? the issue here is when the key is generated you are asked to type it back into the CLI if my memory serves me correctly twice, does that leave room for a security issue?",
        "created_at": "2021-09-29T21:27:14.244000+00:00",
        "attachments": []
    },
    {
        "author": "caseygardiner",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I would 100% go with an airgapped machine for ultimate protection.",
        "created_at": "2021-09-29T21:50:00.510000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Well the launchpad suggests switching off the internet, air gappped would have to be like a throwaway machine? If the machine is not airgapped, is that a security issue for Ethereum POS?",
        "created_at": "2021-09-29T21:51:49.593000+00:00",
        "attachments": []
    },
    {
        "author": "caseygardiner",
        "category": "Consensus Layer",
        "parent": "",
        "content": "On a uncompromised machine, using a safe connection, key creation isn't going to be much of a security risk. The potential risk comes from deviations with the perfect solution being an airgapped \"throwaway\".",
        "created_at": "2021-09-29T22:12:51.531000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus Layer",
        "parent": "",
        "content": "haha i saw the edit, but it was a good edit 🙂",
        "created_at": "2021-09-29T22:14:00.912000+00:00",
        "attachments": []
    },
    {
        "author": "zkdid",
        "category": "Consensus Layer",
        "parent": "",
        "content": "thanks for your input, jokes asside, grateful to you, have a good evening",
        "created_at": "2021-09-29T22:14:40.935000+00:00",
        "attachments": []
    }
]