[
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "On the networking call, we figured there might be other items in the future that we want to exchange on a regular interval. A general ping with a light payload seems reasonable. Do we want it to just be a general sequence number about the full payload (decouple from ENR) or have enr seq number as one piece of the (potentially bigger) ping payload",
        "created_at": "2020-03-20T01:14:01.894000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I would actually prefer 2, that we request for a peer's ENR if the remote peer dials us. This allows us to keep track of all the peers that are connected to us in our dht, otherwise there will always be a gap between , peers from discovery and those that we are connected to through tcp. Although one caveat is we would have two rounds of serialization \nenr -\u003e rlp -\u003e ssz -\u003e \n\nBut i would assume that we wouldnt be doing this too often, so shouldn't be too much of an issue",
        "created_at": "2020-03-20T02:23:03.065000+00:00",
        "attachments": []
    },
    {
        "author": "agemanning",
        "category": "Consensus Layer",
        "parent": "",
        "content": "@nishant as long as we get the Enr somehow, we can add connected peers to the local node routing table. However, I don't think we can assume all connected peers are in the DHT. We could have 17 peers which all exist in the same bucket and a bucket can only contain 16 peers, so 1 peer wouldn't be in our routing table in this instance. \n\nTo be clear. Your preference is for another RPC method? What are your thoughts about a ping like method with one that can then get Enrs and other info?",
        "created_at": "2020-03-20T02:58:49.202000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeap that is correct, it would be another RPC like ping method to retrieve ENRs etc. For dynamic subnets, there are some issues on how to appropriately account for subnets registered by  peers from inbound connections. Having this would help mitigate that at least",
        "created_at": "2020-03-20T03:30:16.064000+00:00",
        "attachments": []
    },
    {
        "author": "agemanning",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Awesome, I'll see what others think then draft something up",
        "created_at": "2020-03-20T03:56:50.432000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "What should a beacon node do if it receives an attestation for a subnet to which it isn't subscribed (this would be direct from a local validator, rather than over the network)?",
        "created_at": "2020-03-20T07:44:53.277000+00:00",
        "attachments": []
    },
    {
        "author": "agemanning",
        "category": "Consensus Layer",
        "parent": "",
        "content": "It should still publish it. Gossipsub has a collection of peers called a \"fanout\". So even if we are not subscribed to a topic we can still publish, which works provided some of our connected peers are on the subnet. The node should log a warning in this case I imagine",
        "created_at": "2020-03-20T07:50:14.221000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Thanks.  Is fanout multi-hop?  Say I'm only connected to a single peer, and neither of us are connected to a given attestation subnet (but my peer in turn has peers that are), could I still broadcast the message and expect it to reach the subscribers?",
        "created_at": "2020-03-20T08:00:00.277000+00:00",
        "attachments": []
    },
    {
        "author": "agemanning",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Nope. That peer won't be in your fanout, so you won't send it to that peer",
        "created_at": "2020-03-20T08:09:43.007000+00:00",
        "attachments": []
    }
]