[
    {
        "author": "agemanning",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Hey all. \nI've been thinking about the upgrade to path to discv5.1. For us, Lighthouse nodes will re-inject past known ENR's. However our discovery queries will not return any of the results that are non-contactable (i.e don't support 5.1). \n\nSo, I think we might fragment the network if all Lighthouse nodes update to 5.1 and will only really be connected to other nodes via the bootnodes. \n\nWas wondering for a rough eta for everyone to have discv5.1 so we can potentially line an update time. \n\nAnother hack solution was to try and dial all known enr's on boot, in which case we should hopefully get a few nodes on v5.0 also.",
        "created_at": "2020-09-22T01:44:53.056000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Not sure what would be an easy upgrade path for this, we would need to force all the nodes to update at the same time. Afaik even with regular releases most users take a while to update their nodes(3 - 4 weeks) from what I have seen.",
        "created_at": "2020-09-22T03:24:19.264000+00:00",
        "attachments": []
    },
    {
        "author": "agemanning",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I dont think it would be that bad. If we dialed nodes we already know about we will connect between different versions and gossipsub should hopefully handle this. But it would be nice if we had releases, say all in the same week which did the upgrade",
        "created_at": "2020-09-22T03:34:48.118000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeap it would need to be a co-ordinated release of switching bootnodes to v5.1 at the same time as the upgrade in all the clients",
        "created_at": "2020-09-22T03:45:57.728000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Alternatively we could just have different bootnodes supporting v5 and v5.1 separately, to reduce the amount of fragmentation",
        "created_at": "2020-09-22T03:46:52.077000+00:00",
        "attachments": []
    }
]