[
    {
        "author": "agemanning",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Hey all. We've been holding off merging gossip scoring, because we're affraid lighthouse will segregate itself on the network unless we all agree on specific gossip params. Curious about where everyone is at with:\n- The latest message id: https://github.com/ethereum/eth2.0-specs/pull/2089\n- Invalids: I.e from, seq_no, sig fields must be Nil.  (Strict verification)\n\nIf we mismatch on these our scoring will mismatch and we will segregate the gossip layer.",
        "created_at": "2020-10-15T00:40:49.297000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The latter has been the default for a while, however we havent updated our message id yet",
        "created_at": "2020-10-15T01:22:08.249000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "We have like 4 different versions of the message id right now in medalla",
        "created_at": "2020-10-15T01:22:30.277000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "We can maybe coincide the message id change along with the v5.1 update across clients",
        "created_at": "2020-10-15T01:23:42.167000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Hey just wanted  to gauge what other clients are doing for this. We ran into an issue on how to handle pubsub messages before chainstart\n\nGiven genesis delay can be up to a week, there is the possibility of receiving pre chainstart pubsub messages. The straightforward thing would be to either ignore/reject those messages. However some messages like (exits? ) can be valid . So was wondering what the behaviour is across clients, as with peer scoring different behaviours by clients could lead to a partitioned gossip network before chainstart.",
        "created_at": "2020-10-15T15:17:33.714000+00:00",
        "attachments": []
    }
]