[
    {
        "author": "agemanning",
        "category": "Consensus Layer",
        "parent": "",
        "content": "There are some substantial changes happening soon in libp2p and we should probably coordinate/update specifications to suit. Specifically, upgrading multistream select to protocol-select (https://github.com/libp2p/specs/pull/349). This is like the multistream-select-2 we were talking about way back. Also, it looks like the encryption protocols is going to be split out and added into multiaddrs (https://github.com/libp2p/specs/pull/353). \n\nI guess this is for everyone to be aware of upcomming changes and provide feedback. Also we should coordinate and probably follow the suggested rollout phases amongst clients.",
        "created_at": "2021-08-24T04:48:40.809000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Until the specs are finalized and implemented into the respective libp2p implementations it would be hard to finalize this. But if we were to provide an upgrade path for this:\n-\u003e Support both multistream select + protocol-select for a while so that it remains backward compatible.\n-\u003e At a decided HF, make protocol-select as the only stream negotiation protocol across all clients. Unless we have reasons to keep using multistream select. \n-\u003e These changes would also apply to the new multiaddress types",
        "created_at": "2021-08-24T08:52:29.305000+00:00",
        "attachments": []
    },
    {
        "author": "agemanning",
        "category": "Consensus Layer",
        "parent": "",
        "content": "There is an outline for a potential upgrade process from multistream-select: (https://github.com/libp2p/specs/blob/3a0c2f382cdb75d573e37333263359317487788c/protocol-select/README.md#transitioning-from-multistream-select). \nWe can have a transitional period supporting both, i think its just a matter of co-ordination with all client teams to get a good portion of the network over to the new protocol before removing backwards compatibility. Not sure if we need a HF to do this.",
        "created_at": "2021-08-24T11:33:22.473000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "we cant really remove support for the multistream select, until we are sure that all clients running in the network support the new protocol. Some node operators only update unless absolutely necessary(HF). Also it gives all clients a specific point till which they know they can safely drop off support for the older protocol.",
        "created_at": "2021-08-24T11:38:19.664000+00:00",
        "attachments": []
    }
]