[
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I have a silly question sorry if it doesn't belong here. On the topic of trying to enforce peers allowing inbound connections. How about a handshake that goes: HELLO here is my address, you can dial me -- and then the second peer dials directly. Wouldn't this require manually changing clients in addition to closing ports to bypass?",
        "created_at": "2021-08-31T23:35:56.566000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I suspect there's a potential risk of DOS attacks in there but it could potentially be mitigated by attempting the return connection on the ip the original connection came from and things like that.\nHowever, I don't think you really need to have a protocol like that.  If we added a new RPC to retrieve a peers enr (or multiaddr) or maybe just added it to the metadata response, clients could choose to then validate that, possibly as part of prioritising which peers to keep when they reach their limit. If the majority of nodes with open ports implemented that check it would make it extremely hard for peers with closed ports to hold onto enough peers and they'd essentially be forced to open their ports.",
        "created_at": "2021-08-31T23:41:23.690000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The key advantage we have here is that it's the nodes that already have open ports which are both required by nodes that have closed ports and are in the position to check and enforce their peers having open ports.",
        "created_at": "2021-08-31T23:42:03.204000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Personally I'd like to see more nodes have open ports but I'm still a bit wary of making it a hard requirement.  It's very useful to be able to quickly spin up a node without having to mess around with firewall rules etc and we want users to be able to run nodes even if they're moving between different networks a bunch.",
        "created_at": "2021-08-31T23:43:30.287000+00:00",
        "attachments": []
    }
]