[
    {
        "author": "sauliusgrigaitis",
        "category": "Consensus Layer",
        "parent": "",
        "content": "You can read about Gossipsub 1.1 scoring here https://github.com/libp2p/specs/blob/master/pubsub/gossipsub/gossipsub-v1.1.md . Application specific spec \nis here https://github.com/ethereum/eth2.0-specs/blob/dev/specs/phase0/p2p-interface.md . These documents together should give a good picture. REJECT eventually should lead to a ban, so the spammer will need to figure out how to reestablish its score. IGNORE is a bit more tricky as often it's about the cases where it's not clear whether node is misbehaving or it's just a network condition, so spamming is more viable via IGNORE messages. We will see if the setup is good enough after The Merge as then it will be much high motivation to attack the network.",
        "created_at": "2021-08-12T10:36:49.764000+00:00",
        "attachments": []
    },
    {
        "author": "bd_0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Hi, thanks for your response. I've read the documents in depth and i agree REJECT is not big concern. However from the gossipsub-v1.1 spec, as I understand it there are no default weights set for the P4 score and in my understanding if those are not set then that score is not taken into consideration. The p2p-interface spec (both phase0 and altair) doesn't include any specific weight parameters for the peer-scoring function, so it is very unclear from that standpoint. From my current reading and understanding, there is a spam attack vector by flooding the network with messages which result in IGNORE. Those messages won't be propagated further nor delivered in the layers above, but I think it is important consideration because they require processing power from the peer.",
        "created_at": "2021-08-12T14:05:27.935000+00:00",
        "attachments": []
    },
    {
        "author": "bd_0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "and as I see the native spam protection measures (i.e. the peer scoring function weights and params) from gossipsub-v1.1 are not leveraged (at least it doesn't look like it is, I need to check actual client implementation as the p2p spec is a bit ambiguous in the part) so the REJECT messages are not banned either",
        "created_at": "2021-08-12T14:07:58.316000+00:00",
        "attachments": []
    },
    {
        "author": "bd_0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "also the peer scores are local (per node) and probably this is sufficient for eth2 as sybil attacks would be hard to do (assuming the validator requirements), but probably the local scoring is not enough spam prevention measure in cases of coordinated spam attack, even if the gossipsub-v1.1 params are leveraged",
        "created_at": "2021-08-12T14:12:04.049000+00:00",
        "attachments": []
    }
]