[
    {
        "author": "agemanning",
        "category": "Consensus Layer",
        "parent": "",
        "content": "This is a bit clearer. \nSo a lot of network security, like DoS attacks falls into the domain of client implementors hands, not the consensus-level specification. Clients often implement various caches for network traffic as an example and need to make sure the way they are handling incoming traffic is not vulnerable to various attacks. The network specifications aren't really there to handle all the various network attack vectors. \nThat being said tho, as you've seen we do specify which messages should be rejected and which should not be propagated. \nLets take your example where one or many validators try sending many unique future blocks. \nThe specs say we ignore the message. So if its flood-publishing, its sending it to all its peers not just mesh peers. Because we ignore it, all the peers that receive it, shouldn't repropagate it and it shouldn't flood the network. I.e the message should only get sent to the malicious peers immediate connections. In lighthouse, its handled here: https://github.com/sigp/lighthouse/blob/unstable/beacon_node/network/src/beacon_processor/worker/gossip_methods.rs#L342\n\nAs you can see, we have implemented our own peer scoring system and peers that send us a future block get penalized. If they do this enough they will get kicked and banned. Thus if the node is a validator, Lighthouse nodes will ignore its attestations and real blocks if it offends enough of the lighthouse nodes. Our scoring system is not in the specifications, this is up to each client team to handle. I can't speak for other clients, but assume they are doing a similar thing",
        "created_at": "2021-08-20T00:37:11.626000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "another important point with regards to the network level of things is that you don't need to be a validator to participate in the protocol! anybody can send data to another node, but all honest nodes on the network will ensure that only valid data from validators will be _propagated_ - what this means effectively is that although a well-funded effort to knock a single node off the network is fairly easy to pull off, the network as a whole remains resilient because it would be expensive to knock out many nodes this way",
        "created_at": "2021-08-20T09:13:45.010000+00:00",
        "attachments": []
    }
]