[
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The main issue with running via TOR would be latency concerns for a validator. The extra hops might make it difficult to propagate attestations in time. But currently ENRs don't have support for onion services. I know that there have been a few attempts at building Tor tranasports for go-libp2p, but I am not sure how many are actually used in practice. Ex: https://github.com/berty/go-libp2p-tor-transport",
        "created_at": "2022-08-18T01:16:57.403000+00:00",
        "attachments": []
    },
    {
        "author": "paulmillr",
        "category": "Consensus Layer",
        "parent": "",
        "content": "How do you feel about a beacon chain relay functionality?",
        "created_at": "2022-08-18T01:20:19.912000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "How would the relay function in your mind ? Currently we have support for relays in prysm via libp2p: \nhttps://github.com/libp2p/go-libp2p-circuit . But I assume if you want privacy you would also need to appropriately mask discovery, as these are 2 separate layers",
        "created_at": "2022-08-18T01:26:02.980000+00:00",
        "attachments": []
    },
    {
        "author": "paulmillr",
        "category": "Consensus Layer",
        "parent": "",
        "content": "No idea…",
        "created_at": "2022-08-18T01:36:59.103000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Thinking about this a bit more, you would need to be able to relay all udp + tcp traffic. The latter could be achieved via libp2p's relay. I am not sure if other clients support the circuit relay. Since all consensus gossip is via tcp it would help with keeping identities of validator's private. But  a udp relay doesn't have any current support but wouldn't be too hard to build",
        "created_at": "2022-08-18T01:40:24.358000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The bigger thing would be who runs the relays here, as the relay operator basically has the option to intercept all traffic and can correlate validator identities",
        "created_at": "2022-08-18T01:47:16.489000+00:00",
        "attachments": []
    },
    {
        "author": "asn_d6",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah latency concerns are real. I suspect that if each node has long-living connections to other nodes for the purposes of sending attestations/blocks, the Tor latency wouldn't be that bad. Some tor circuits are bad, but others are really good. So as long as at least some good circuits are used, then things should be alright (famous last words).",
        "created_at": "2022-08-18T10:35:28.899000+00:00",
        "attachments": []
    },
    {
        "author": "asn_d6",
        "category": "Consensus Layer",
        "parent": "",
        "content": "There is also the question of what's the actual goal here. Are you trying to protect the identity of all P2P nodes for ever? If yes, everything will have to go over tor. Including gossips, etc. I don't think that will work in terms of latency (think aggregation, etc.).",
        "created_at": "2022-08-18T10:36:21.520000+00:00",
        "attachments": []
    },
    {
        "author": "asn_d6",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Building a robust anonymity network inside eth's p2p layer is gonna be a pretty huge task (you will basically have to do implement tor all over again).  Alternatively you might care about less robust anonymity like in polkadot's sassafras (https://ethresear.ch/t/whisk-a-practical-shuffle-based-ssle-protocol-for-ethereum/11763#sassafras-25) in which case this might work, but there will still be significant additional networking complexity.",
        "created_at": "2022-08-18T10:39:49.964000+00:00",
        "attachments": []
    },
    {
        "author": "asn_d6",
        "category": "Consensus Layer",
        "parent": "",
        "content": "And of course, an anonymity network inside eth p2p layer is not gonna hide the identity of nodes. It's just gonna hide the originator of actions.",
        "created_at": "2022-08-18T10:41:04.914000+00:00",
        "attachments": []
    },
    {
        "author": "asn_d6",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think there are many potential goals for network privacy in the context of eth: \"Hide identity of all p2p nodes\", \"Hide identity of  proposers\", \"Hide identity of all validators\", \"Hide identity of at-risk validators\". Each of these goals can have different solutions, and some are easier to achieve than others.",
        "created_at": "2022-08-18T10:42:00.436000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think we should be aiming for more privacy at the networking layer, currently there is no mitigation for correlation attacks on validators. This probably is of a greater urgency after the events of the past few weeks. Hiding the identity of all p2p nodes participating in ethereum might be too much work, but we should be trying to achieve much stronger privacy guarantees for validators as there is none currently.",
        "created_at": "2022-08-18T11:15:45.763000+00:00",
        "attachments": []
    },
    {
        "author": "asn_d6",
        "category": "Consensus Layer",
        "parent": "",
        "content": "there is also this fwiw https://ethresear.ch/t/ethereum-consensus-layer-validator-anonymity-using-dandelion-and-rln-conclusion/12698",
        "created_at": "2022-08-18T11:30:04.498000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Its an interesting approach, but it appears the latency considerations make it infeasible. From the post, the 1 -2 extra hops has marginal benefits for privacy. To be effective it would need  more hops and that would have a noticeable negative effect on validator income and general network stability",
        "created_at": "2022-08-18T11:43:40.924000+00:00",
        "attachments": []
    }
]