[
    {
        "author": "paulmillr",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Does anybody care about TOR issue besides me? https://twitter.com/paulmillr/status/1559663942124945408",
        "created_at": "2022-08-16T23:14:58.347000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "it's possible that people care, just focusing on a different solution... is there a reason a solution would have to specifically use TOR? Generally statements like 'does anyone care about xxx except me', i see it as clickbait more than anything else...",
        "created_at": "2022-08-16T23:18:19.964000+00:00",
        "attachments": null
    },
    {
        "author": "paulmillr",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003c@680234424037670912\u003e Of course, if a solution would be able to resolve issues without TOR, it would be great solution. I’ve mentioned TOR because it’s what other networks utilize. For the title: I monitor the news, EIPs, repositories, ethresearch, etc — lots of talk on data availability sampling, sharding, rollups, pbs, etc. No discussions on a censorship-resistant/anonymous routing. This issue is a huge deal.",
        "created_at": "2022-08-16T23:21:34.452000+00:00",
        "attachments": null
    },
    {
        "author": "paulmillr",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Wanna know who owns the validators? Just listen to consensus gossip for some time and identify server owners (servers were most likely KYC-ed). Wanna know who sent some tx from some node? Just listen to execution gossip. That can be dangerous. It is actively utilized by blockchain analysis companies.",
        "created_at": "2022-08-16T23:24:19.340000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "my 2c...\nIn context of framing, I don't see much changing until post merge, but relays etc are on the list for things, which would improve, if not completely solve anonymity...  Censorship is obviously always a huge topic, and particularly present at the moment, so we're not ignoring it, but also fair to say that there's a lot going on right now, it may not be the most present issue to solve...\nI think its healthy to ensure we don't lose track of things like this, but equally important that we have priorities etc, as ultimately we don't have unlimited resources...",
        "created_at": "2022-08-16T23:32:56.313000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "keeping in mind that releases for mainnet merge are iminent, within a couple of days",
        "created_at": "2022-08-16T23:34:10.266000+00:00",
        "attachments": null
    },
    {
        "author": "paulmillr",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Merge is #1 today — no issues here. I’m talking about “the next couple upgrades” timeline, not imminent. This is a thing that could take 3-9 months across all client teams, at least.\n\nPeople developing software for validators for Raspberry PI — awesome. Where would you host it? At your home? What if you live in a country which actively surveils validators? I know countries that monitor and confiscate mining equipment.",
        "created_at": "2022-08-16T23:36:54.111000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "its a good time to have the conversation, but I honestly can't predict where it falls in priorities currently in terms of a full scale TOR type concept - keeping in mind that similar solutions for some p2p led to everyone that runs a client being a target, it's a topic I don't think i'd go far into without legal advice to be honest...\nAll i can say is we're anti-censorship as a stance, and it's something I'd expect that we continue to see steps towards in some way...",
        "created_at": "2022-08-16T23:44:36.032000+00:00",
        "attachments": null
    },
    {
        "author": "paulmillr",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Everyone who runs ETH node/validator would also be a target — with, or without new routing. It’s just a matter of time and location.",
        "created_at": "2022-08-16T23:47:50.571000+00:00",
        "attachments": null
    }
]