[
    {
        "author": "pk910",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Heya,\nHas anyone tried setting up any EL+CL combo in a multi gateway network?\nMy internet connection at home is very unstable. I'm actually using 2 uplinks (Cable + DSL), so at least one of both is workíng all the time..\nI'm using a OpenWRT router with some custom scripts that does the automatic failover in caser one of the connections goes down.\n\nNow I'm thinking about running my validators from home, but I don't really want it to stick with one of the uplinks.\nIt would be great to use both gateways concurrently, so it doesn't loose full connection in case one of the primary uplink goes down.\nI can do that for outgoing connections via a firewall rule that 'guides' each connection to one of the uplinks.\nBut I don't know if that's possible for incoming connections somehow?\nI'd need to tell the clients that I'd like to advertise 2 external IP's to connect to..\nAny Ideas? 🤔",
        "created_at": "2022-09-18T00:54:04.029000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Consensus Layer",
        "parent": "",
        "content": "So if i get this right:\n- You already have a script that does failover\n- You want your EL/CL to advertise their IP based on which uplink is active? \n\nShouldn't this happen automatically once you port forward on your router?",
        "created_at": "2022-09-18T07:15:59.020000+00:00",
        "attachments": null
    },
    {
        "author": "pk910",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Not exactly.\nI have a failover script, but that script only switches from one link to the other (and backwards), it does not use both links concurrently. \nSo if the active link dies, all connected peers to my CL/EL are dead too. \nIt will then reconnect them via the second link after failover, but there is still a gap that could cause a missed attestation/proposal/etc.\n\nI'd like the EL/CL to advertise both external IPs, so I get incoming connections on both links. So in case one of the links dies there are still enough peers connected via the second link.\nI think I'll try it with routing outgoing connections only and use only one of the links for incoming connections for now.\nLet's see how this works...",
        "created_at": "2022-09-18T21:09:25.868000+00:00",
        "attachments": null
    }
]