[
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "In the proposal using simply the first 8 bytes is insecure as finding a collision is pretty trivial. The total hashrate of the bitcoin network is 600 exahashes / second. So you can technically find 32 collisions for any given root in a second. Also you would have 2 epochs to find and generate a bogus root which is plenty of time for many collisions. Increasing it to 16 bytes would mitigate it for now",
        "created_at": "2024-04-04T05:44:56.859000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "the message is what we propagate not the message id to our mesh peers",
        "created_at": "2024-04-04T05:45:31.993000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Message id is only relevant when we emit random gossip to all our peers every heartbeat",
        "created_at": "2024-04-04T05:46:32.027000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think gossiping attestation data separately is tricky and introduces wierd race conditions. Its already been discussed above, but how we would queue it would be pretty different from our pending queues. Also this would definitely interfere with aggregation, we do not have big window to produce aggregates so you could see more inefficient aggregates being produced. \n\nDecoupling attestation data from an attestation would necessitate us signing it otherwise anyone in the network can produce such a message and put bogus data in",
        "created_at": "2024-04-04T05:55:38.491000+00:00",
        "attachments": []
    },
    {
        "author": "funnygiulio",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Ah okay, but to be clear, this does not change underlying gurantees as that can happen in any topic regardless",
        "created_at": "2024-04-04T06:53:44.719000+00:00",
        "attachments": []
    },
    {
        "author": "funnygiulio",
        "category": "Consensus Layer",
        "parent": "",
        "content": "It does add complexity, yes, but 4 secs is a probably relatively big window for the network. Why do you think it will potentially make aggregates less efficient if underlying bandwidth is reduced? It should be the opposite, the fact they are on separate topics, means that some attestations will be delayed slightly but definetely not seeing that exceeding 4 secs overall",
        "created_at": "2024-04-04T06:57:49.176000+00:00",
        "attachments": []
    },
    {
        "author": "funnygiulio",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Most of them wont be delayed, quite the opposite. It is just the complexity of needing to keep a queue in memory to be a road blocker. Also note, that as I said before, i would agree if you were talking about new nodes, but i think they wont matter much",
        "created_at": "2024-04-04T06:59:43.696000+00:00",
        "attachments": []
    },
    {
        "author": "funnygiulio",
        "category": "Consensus Layer",
        "parent": "",
        "content": "If the delay is one second then fine, It is a stupid idea but 100-300 msec? That is not very significant especially as you have a 2x optimization down the line",
        "created_at": "2024-04-04T07:15:22.464000+00:00",
        "attachments": []
    },
    {
        "author": "funnygiulio",
        "category": "Consensus Layer",
        "parent": "",
        "content": "ignore the initial proposal, just the second one",
        "created_at": "2024-04-04T07:51:38.970000+00:00",
        "attachments": []
    }
]