[
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003c@498009160982724610\u003e For lighthouse have you guys seen any improvements with `IDONTWANT` since devcon ? We are not seeing any improvement, so trying to get more data today to validate some suspicions",
        "created_at": "2024-12-13T04:28:06.364000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "From observing outgoing IDONTWANT messages and incoming duplicates it unfortunately appears that by the time we broadcast these control messages the blobs are already inflight from all our other mesh peers",
        "created_at": "2024-12-13T10:10:08.077000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Would explain why there has been 0 improvement in bandwidth usage",
        "created_at": "2024-12-13T10:10:34.759000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Wasnt there some datapoints to indicate that nodes in the edges did see a benefit? (e.g Australia) or did I hallucinate that/confuse it with some other change?",
        "created_at": "2024-12-13T11:23:43.863000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah, theoretically if you have one link which is much faster than the rest then it would be beneficial. But it does look like we are trying to optimize for a race. My nodes had peers which broadcasted all their messages at around the same time",
        "created_at": "2024-12-13T12:13:49.209000+00:00",
        "attachments": null
    },
    {
        "author": "agemanning",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Last I looked, it was too difficult to tell, becuase only 50% of our peers had updated to support it. We dont have a metric to tell us which of these ones are in our mesh or not. Its highly dependent on which peers in your mesh support it. \nI'll have another look through next week and report back. \nWe might implement the ability to cancel sends (at least queued ones) as see if that actually ever happens. Like we have queued messages to send, then get an IDONTWANT. Not sure how prevalent that is, but might be worth checking.",
        "created_at": "2024-12-13T20:53:00.296000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "We dont have a metric either we just started logging each time we broadcasted IDONTWANTs and each time we received a duplicate. \n\nIf the duplicate was received from a peer who supported v1.2 then we would log it. \n\nCanceled sends seem like something that might help and worth trying. Should at least allow us to drop queued messages",
        "created_at": "2024-12-13T22:54:25.480000+00:00",
        "attachments": null
    }
]