[
    {
        "author": "ryg9705",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I have implemented a minimal libp2p library in Elixir and have an Elixir client that is passing all the spec tests up to Fulu. When I initialize my discv5 discovery with the mainnet bootnode ENRs and start to maintain a peerstore. I connect to 150 peers but from the Status messages almost everyone is on fork_digest ad532ceb but given the Fulu Fork Version and Genesis Validator Root of mainnet shouldn't the majority of peers advertise 82fae541? Hence, I'm dropping them and not syncing. Anyone has an idea what I might be missing.",
        "created_at": "2025-12-25T16:20:04.057000+00:00",
        "attachments": null
    },
    {
        "author": "leobago",
        "category": "Consensus Layer",
        "parent": "",
        "content": "`ad532ceb` =\u003e Electra fork digest\n`82fae541` =\u003e Fulu fork digest (Before BPOs)\n`cb0d1acc` =\u003e Fulu BPO1 fork digest\nAfter Fulu, you need to apply a XOR mask with the hash of the BPO parameters in order to get the fork digest. You can find more details here: https://ethereum.github.io/consensus-specs/specs/fulu/beacon-chain/#modified-compute_fork_digest",
        "created_at": "2025-12-25T19:42:00.170000+00:00",
        "attachments": null
    },
    {
        "author": "ryg9705",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003c@478543974156730369\u003e Thanks. Is this covered in a test vector that I must have missed? I have a wrapper around the Python generator and for all forks and presets I generate everything, but under minimal/fulu/networking there are only vectors for get_custody_groups, compute_columns_for_custody_groups. Under the general preset for fulu it generated some kzg test vectors.",
        "created_at": "2025-12-25T20:09:17.045000+00:00",
        "attachments": null
    },
    {
        "author": "leobago",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Sorry, not really sure about the coverage of the test vectors. \nI think someone from the PandaOps team should be help you.",
        "created_at": "2025-12-25T20:20:37.366000+00:00",
        "attachments": null
    }
]