[
  {
    "author": "barnabasbusa",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "can you let me know which driver version you have?",
    "created_at": "2026-02-09T12:05:35.025000+00:00",
    "attachments": []
  },
  {
    "author": "han0110",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "```\n| NVIDIA-SMI 580.105.08             Driver Version: 580.105.08     CUDA Version: 13.0     |\n```",
    "created_at": "2026-02-09T12:59:32.551000+00:00",
    "attachments": []
  },
  {
    "author": "han0110",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "A note on faster proving by decreasing security bits (in order to make testing proving infra more easily):\n\nWe can configure/rebuild the prover/circuit to have faster prover by\n- Reduce FRI blowup factor - This makes proving in generally faster, but most zkVMs they already have base proofs configured to have smallest blowup factor\n- Reduce FRI number of queries - This only makes base proofs size smaller (which makes aggregation proofs faster)\n\nWith the modification, the aggregation proofs could probably become much faster (tried with OpenVM which is easiest to configure and it's much faster), but proving base proofs still takes a big portion of the whole proving time (tested on SP1, OpenVM, ZisK and all of their base proofs take >50%)\n\nIt seems for now using mock proof or mock guest program are the only way for testing proving infra without GPU (if with 1 GPU we'd need to use tiny/empty block).",
    "created_at": "2026-02-09T13:01:15.011000+00:00",
    "attachments": []
  },
  {
    "author": "han0110",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "I tried to upgrade to the same driver version as yours `590.48.01`, I found that I can run the image I pushed last week, but still can't run  `ethpandaops/ere-server-zisk:master`, it stuck at `... >>> REGISTERING_WITNESS` then timeout, I think this might be a non GPU issue.",
    "created_at": "2026-02-09T16:06:12.898000+00:00",
    "attachments": []
  },
  {
    "author": "barnabasbusa",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "ok i’ll experiment with the docker compose tomorrow and try to figure out what the bugs are thanks for double checking",
    "created_at": "2026-02-09T16:19:36.111000+00:00",
    "attachments": []
  }
]