[
    {
        "author": "aguzmant",
        "category": "general",
        "parent": "",
        "content": "\u003c@313007864488787968\u003e here it's https://github.com/ethereum/kohaku",
        "created_at": "2025-10-02T03:31:12.396000+00:00",
        "attachments": null
    },
    {
        "author": "aguzmant",
        "category": "general",
        "parent": "",
        "content": "I don't know if we replied  before but at the moment I believe we're looking first at end users. If I were to share our current distribution it's roughly 80% app layer, 10% L1 core protocol 10% L2 so it'll take a bit until we can take a look at this deeply 🙂\n\nI believe there are some ideas for it (i'm not deeply aware) but also involves more stakeholders like client and core protocol dev teams",
        "created_at": "2025-10-02T03:34:31.899000+00:00",
        "attachments": null
    },
    {
        "author": "laurip",
        "category": "general",
        "parent": "",
        "content": "hi all.\nreading the new PSE roadmap. pretty cool stuff!\nIt's interesting to see \"private reads\" in the list. Most projects/entities ignore this aspect completely and are \"ok\" with their wallet leaking everything.\nUnfortunately, it also seems this is quite far from being actually implemented.",
        "created_at": "2025-10-02T04:56:18.244000+00:00",
        "attachments": null
    },
    {
        "author": "drewf.eth",
        "category": "general",
        "parent": "",
        "content": "Sorry, I missed this response before. Clearly broadcasting txns is more valuable for more users, but is there a reason why attestation/IL broadcast is out of reach? There's the latency constraint and requirement of a CL client RPC exposed, but as far as privacy challenges go, these seem rather small.\nAs you build private broadcast for transactions, measuring e2e latency in the 1s range for p95 would make attestation broadcast a no-brainer IMO.",
        "created_at": "2025-10-02T11:46:14.800000+00:00",
        "attachments": null
    }
]