[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I got to the very same conclusion as you except the point on hardware: it seems I can validate on Cartesi on a raspberry pi 2b, and I can't on ETH mainnet with the same hardware",
        "created_at": "2021-08-11T00:55:21.838000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Not everyone needs to be on the same L2.",
        "created_at": "2021-08-11T03:05:04.892000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "You can have an L2 just for Uniswap, for example, and only people who care about Uniswap would need to sync the Uniswap L2.  People who don't care about Uniswap could ignore it.",
        "created_at": "2021-08-11T03:05:45.535000+00:00",
        "attachments": []
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "Rollups can periodically dump their state on L1. Then zkrollups won't require you to trust the sequencer at all. \n\nBut yes there's definitely tradeoffs. I'd still trust \"honest 1 of N\" for fraud proof with atleast 5x the gas limit I'd trust \"honest n of N\" to hard fork ethereum. And even 5x scaling is huge.",
        "created_at": "2021-08-11T04:10:38.594000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Does L2 require archival nodes?",
        "created_at": "2021-08-11T08:07:32.299000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "No.",
        "created_at": "2021-08-11T08:08:54.483000+00:00",
        "attachments": []
    },
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "If L2 overtakes L1 that's 40GB of state to dump 😅",
        "created_at": "2021-08-11T09:53:07.475000+00:00",
        "attachments": []
    },
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "In a sense yes, you need to see all to  tx to rebuild the state if you don't use another form of state sync (which you can verify with the state root posted on L1). Getting the whole history is the gurantee you can get the state even if nobody will send it to you. But you can use L1 archive nodes for this purpose",
        "created_at": "2021-08-11T09:55:15.845000+00:00",
        "attachments": []
    },
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "Of course! But that's not where the big names in the field are at.",
        "created_at": "2021-08-11T09:57:22.680000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Archive node != history.",
        "created_at": "2021-08-11T10:06:24.856000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "A full node (often/usually) has full history, which is all you need.",
        "created_at": "2021-08-11T10:06:35.730000+00:00",
        "attachments": []
    },
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "What does the archive node have that the full node doesn't? Or is the archive node just a full node that distributes its history?",
        "created_at": "2021-08-11T10:21:16.153000+00:00",
        "attachments": []
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "It'll be less with proper state management that can be implemented on L2. 1 million users' each with 20 integer balances is like 80 MB",
        "created_at": "2021-08-11T10:28:35.358000+00:00",
        "attachments": []
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "Idk if feasible",
        "created_at": "2021-08-11T10:29:03.256000+00:00",
        "attachments": []
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "Just idea",
        "created_at": "2021-08-11T10:29:08.206000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Archive node holds the state values of all contracts at all history. I don't think full nodes have this",
        "created_at": "2021-08-11T10:29:17.553000+00:00",
        "attachments": []
    },
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "There's a lot more to stats than just balances though. Also most L2 want to run the EVM meaning state compression techniques that work for them work for L1 too (like storing the balance on 8 bytes instead of 32 as you suggest)",
        "created_at": "2021-08-11T10:52:38.759000+00:00",
        "attachments": []
    },
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "I would expect that to be a very negligible quantity",
        "created_at": "2021-08-11T10:53:02.100000+00:00",
        "attachments": []
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "Yup EVM can implement BLS and state expiry and stuff, L2 might get to it first though",
        "created_at": "2021-08-11T11:33:02.667000+00:00",
        "attachments": []
    },
    {
        "author": "liberosist",
        "category": "general",
        "parent": "",
        "content": "Also, given rollups always have a failsafe state on L1, they can be a lot more aggressive with state size management tech like state expiry, potentially with shorter expiry periods. It'd be a great place to battle-test state expiry before being implemented on L1. With a sequence of state diffs, you can pretty much reconstruct what you need directly from L1, and with zkRollups these techniques can be further refined. Also, with validity proofs, the burden of users verifying on commodity hardware is eliminated - instead of multiple potential disputers, you just need to have a coordination mechanism for sequencers/provers. Hermez, for example, is using sequencer auctions. It's acceptable for the sequencer/prover to run a high-spec machine in the limited time that it has bid for. (There could be better coordination mechanisms with proof-of-stake, of course.) L1 will reject invalid state transitions, and users can verify valid commitments directly from L1. You'll see techniques that'll enable them to directly operate over L1. (See: https://ethresear.ch/t/future-proof-shard-and-history-access-precompiles/9781). Finally, there'll always be a withdrawal mechanism from L1 - hopefully we see light withdrawals with zkRs. Each rollup can go much further than any L1 can securely, and there can be multiple rollups over L1. \n\nWhat's the other option? You get Solana, which in less than a year it's already impossible to sync a full node from genesis, so you have to rely on snapshots from Solana Labs - a centralized entity. Rollups may run in the same problem as Solana, sure, but you can construct a snapshot from Ethereum - a decentralized network. Not to mention I expect rollups, as mentioned above, to implement better state size management techniques, rather relying on sheer brute force like Solana does.",
        "created_at": "2021-08-11T14:53:22.032000+00:00",
        "attachments": []
    }
]