[
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "hey \u003c@!848181786763984926\u003e interesting writeup, thank you for your reply on ethresearch. How does the system work when you send conflicting or dependent transactions. Eg, I sent to alice 1 eth and then they send it forward, but I am not confirming the send, are those both then in pending pool, or will the operator only keep the ones that are currently possible to be included only?",
        "created_at": "2021-10-20T07:08:28.712000+00:00",
        "attachments": []
    },
    {
        "author": "albusdompeldorius",
        "category": "general",
        "parent": "",
        "content": "If you send 1 ETH to Alice, and you haven't confirmed it yet, it is still pending and Alice's balance is unchanged. Only after you confirm your transfer Alice's balance is increased by 1 ETH, which she may then send forward.",
        "created_at": "2021-10-20T07:12:58.023000+00:00",
        "attachments": []
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "but I guess operator keeps them in \"pending\" I guess thats exactly the same as mempool?",
        "created_at": "2021-10-20T07:14:43.708000+00:00",
        "attachments": []
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "I guess you are asking the signature only later to make sure the user has the data for the txt? Senders of txt's are required to store the txt's if they need to exit later on?",
        "created_at": "2021-10-20T07:21:57.853000+00:00",
        "attachments": []
    },
    {
        "author": "albusdompeldorius",
        "category": "general",
        "parent": "",
        "content": "A pending transaction in this system is actually part of the rollup state, not just something the operator stores in a off-chain mempool.",
        "created_at": "2021-10-20T07:27:37.083000+00:00",
        "attachments": []
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "ah, hmm, can you dos the rollup by posting a lot txt's that you are never going to confirm?",
        "created_at": "2021-10-20T07:28:33.093000+00:00",
        "attachments": []
    },
    {
        "author": "albusdompeldorius",
        "category": "general",
        "parent": "",
        "content": "The reason we require confirmations is to make sure the sender is able to exit when the rollup is frozen (because you need to show all sent transfers), and so that the sender can give a witness of the transfer to the recipient so they can withdraw it (also in the case where the rollup is frozen).",
        "created_at": "2021-10-20T07:29:40.707000+00:00",
        "attachments": []
    },
    {
        "author": "albusdompeldorius",
        "category": "general",
        "parent": "",
        "content": "In a real world implementation, you would probably add a fee that goes to the operator for adding a pending transfer.",
        "created_at": "2021-10-20T07:30:57.797000+00:00",
        "attachments": []
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "yeah, I guess thats fair",
        "created_at": "2021-10-20T07:32:02.135000+00:00",
        "attachments": []
    }
]