[
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "I don't think it's gonna decrease much. L2s split liquidity or are limited to a few tokens, so L1 is still demanded for spreaded use. And long term investors / token holders may not be interested on L2 because they don't make many tx anyway.\n\nI'm currently seeing L2s as instances for running niche services like Synthetix and for cryptogames which demand a lot of tx. Services like LP, staking, loan/borrow might remain on L1.",
        "created_at": "2021-09-30T03:24:42.849000+00:00",
        "attachments": []
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "Yesterday I was looking on Curve.fi in example, they're on Polygon - which is an independent chain, with wider usage than L2 - and their daily volume/total capital on ETH is much higher than on Polygon, so it's better to invest on them on ETH.",
        "created_at": "2021-09-30T03:27:00.633000+00:00",
        "attachments": []
    },
    {
        "author": "nintendox1856",
        "category": "general",
        "parent": "",
        "content": "yeah, i absolutely agree with u - it's more interesting for game dev. But have to admit that regular transfer fees is still high so i believe Ethereum needs its own universal solution such as Polygon",
        "created_at": "2021-09-30T16:03:03.427000+00:00",
        "attachments": []
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "ETH 2.0 should have shards. But they require many more nodes than a single chain and huge amounts of ETH staken. And IDK if we're gonna need or even be able to freely move ERC721, ERC20 and Enjin around shards and if sc will need to be deployed individually on each chain.",
        "created_at": "2021-09-30T16:16:08.181000+00:00",
        "attachments": []
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "blockchains like Matic and Solana seem to be badly decentralized, so it's not wise to have them as L1",
        "created_at": "2021-09-30T16:16:42.714000+00:00",
        "attachments": []
    }
]