[
    {
        "author": "__climber__",
        "category": "general",
        "parent": "",
        "content": "Not sure these distinctions are always totally clear. Sidechains in particular sit somewhere between L1s and L2s. They are separate chains but connected in some meaningful way like check pointing (posting data to). I would think a bridge isn't enough. L1s are their own chain and not posting data to another L1. EVM compatible means they can run Ethereum smart contracts. And L2s depend on the L1.",
        "created_at": "2021-12-14T02:50:26+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "Thanks for the thoughtful response. My impression was that L2 is a very clear definitional and technical distinction. Sidechain vs EVM compatible alt L1 seems less clear cut? \n\nMaybe it doesn’t really matter and it’s actually more about how “aligned” that alt chain is with the core L1 settlement layer (ie MATIC vs centralized high-throughput, EVM compatible chains)",
        "created_at": "2021-12-14T04:14:55.208000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "Ah so is the distinction the frequency with which another network posts data / messages the L1 chain? Was just thinking through the low gas fee implications vs decentralization \u0026 security trade-offs that may come with those lower gas fees. I simplistically view these centralized EVM compatible chains effectively as “load balancers” for ethereum at the moment or separate / wider lanes that ultimate feed back to the same highway (ie ethereum L1). Maybe it’s a bad analogy. Just trying to abstract away from the underlying technical detail to understand it better",
        "created_at": "2021-12-14T04:20:44.695000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "Eric Wall had a good YouTube talk on this, if I can manage to dig it up…",
        "created_at": "2021-12-14T04:21:27.851000+00:00",
        "attachments": null
    },
    {
        "author": "__climber__",
        "category": "general",
        "parent": "",
        "content": "Yeah, you may be able to clearly define what an L2 is, but I think sidechains can sometimes share some of those same properties. In the case of matic I remember hearing their validators run on ethereum and the chain wouldn't function if ethereum went away. Although they may be able to transition pretty easily into an L1 if that happened",
        "created_at": "2021-12-14T05:01:19.236000+00:00",
        "attachments": null
    },
    {
        "author": "digitaloil",
        "category": "general",
        "parent": "",
        "content": "Hi guys, good day",
        "created_at": "2021-12-14T13:39:04.769000+00:00",
        "attachments": null
    },
    {
        "author": "digitaloil",
        "category": "general",
        "parent": "",
        "content": "Wondering how composability will work in L2 regarding shards and also rollup chains.",
        "created_at": "2021-12-14T13:39:27.888000+00:00",
        "attachments": null
    },
    {
        "author": "digitaloil",
        "category": "general",
        "parent": "",
        "content": "Is there a way to make truely composable transactions? What if dApps live on different shards or different rollups?",
        "created_at": "2021-12-14T13:39:48.521000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "Is sharding a given though at this point?",
        "created_at": "2021-12-14T14:53:12.748000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "This is a good Q. I am curious about how it differs specifically based on the type of rollup (and variations of it)—ie optimistic vs zk (and within zk, SNARKs vs STARKs)?",
        "created_at": "2021-12-14T14:57:09.102000+00:00",
        "attachments": null
    },
    {
        "author": "thetaoist",
        "category": "general",
        "parent": "",
        "content": "Love it. Dibs on StarK Sqaud",
        "created_at": "2021-12-14T14:59:11.665000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "Then rolling it allll the way back up — how does this all affect me as a casual user of dApps built on blockchain and as a potential dApp builder? I’ve read all the vitalik posts on this and work from other client teams and it seems like the roadmap / timeline on making these rollup solutions 1) functional and then 2) practically usable for someone who is not an expert on the nuances at the protocol level?\n\nI suspect the answer is “we will see what happens” but I’m not a coredev clearly nor am I deep into StarkWare’s moon math so pls someone dumb it all down for me if you can 💀",
        "created_at": "2021-12-14T15:02:31.651000+00:00",
        "attachments": null
    },
    {
        "author": "digitaloil",
        "category": "general",
        "parent": "",
        "content": "There could be advanced bridging between rollups and chains to enable true composability. But I haven't read anything about a plan to be able to allow composability, which is something needed for the ecosystem to compete against more bloated/centralized chains like AVAX, SOLANA",
        "created_at": "2021-12-14T15:58:52.357000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "imo the ecosystem just isn't mature enough",
        "created_at": "2021-12-14T16:45:55.376000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "specs for cross-rollup interactions will emerge over time",
        "created_at": "2021-12-14T16:46:14.855000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "I suspect they will / already are running into the same scalability issues without a very credible path to true scalability (centralizing to scale is not very credible. I would personally rather use AWS + Snowflake if I wanted the most performant database in the world)",
        "created_at": "2021-12-14T17:18:18.289000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "The folks over at Cosmos may have something interesting cooking. More at the L1 level though. Isn’t Hop protocol working on ethereum-centric L2 bridging?",
        "created_at": "2021-12-14T17:19:17.596000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "I don't know a lot about that but I meant efficient bridges between rollups through L1",
        "created_at": "2021-12-14T17:20:14.317000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "Ah yes no yeah totally understood. It’s an interesting problem. ie how something built on StarkWare for example might be able to interact with something built on arbitrum / how gas efficient would it be / txn finality speed",
        "created_at": "2021-12-14T17:21:45.754000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "Fwiw I don’t think starkware is technically 100% committed to only building on top of ethereum. That is an assumption I think \u0026 it is way too early to figure that out",
        "created_at": "2021-12-14T17:22:32.689000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "Or said differently, I don’t have high conviction that zk technology will ONLY emerge on ethereum. But it is very clear based on the latest from those guys that ethereum is the de facto settlement network, for now",
        "created_at": "2021-12-14T17:24:12.740000+00:00",
        "attachments": null
    },
    {
        "author": "digitaloil",
        "category": "general",
        "parent": "",
        "content": "good performance but no EVM on AWS",
        "created_at": "2021-12-14T19:30:16.484000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "I mean you can run an evm interpreter on aws",
        "created_at": "2021-12-14T22:19:11.941000+00:00",
        "attachments": null
    }
]