[
    {
        "author": "symme7ry",
        "category": "general",
        "parent": "",
        "content": "If the challenge period for rollups is about a week, why not add an extension block / data shard to ETH 1.x right now which only contains calldata for rollups and which full nodes can prune after one week? Is this a good idea in theory but just too much work for a short term hack, or is there something bad about the idea?",
        "created_at": "2021-11-23T18:25:04.846000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "then it would be hard to know what to do if someone publishes an invalid block that's valid in every way except the calldata is incorrect, that then gets pruned and all you have is the hash when you try to resync the chain from before it was published",
        "created_at": "2021-11-23T18:41:00.533000+00:00",
        "attachments": null
    },
    {
        "author": "symme7ry",
        "category": "general",
        "parent": "",
        "content": "ahhh I see, so new people joining the network is the main issue there. But weak subjectivity requires you to trust someone anyway when you join, going back a few months in time. So maybe if the data shard expired after 3 months it would be no worse than weak subjectivity in eth2?",
        "created_at": "2021-11-23T18:57:10.587000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "I don't think weak subjectivity helps with that",
        "created_at": "2021-11-23T20:04:08.686000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "like you'd have to tweak it anyways to the point you might as well just have the regular history expiry horizon anyways",
        "created_at": "2021-11-23T20:04:54.088000+00:00",
        "attachments": null
    },
    {
        "author": "symme7ry",
        "category": "general",
        "parent": "",
        "content": "not sure what you mean. why would you have to 'tweak it'? and what kind of tweaks do you mean?",
        "created_at": "2021-11-23T23:06:47.532000+00:00",
        "attachments": null
    }
]