[
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "yes but the vast majority of economic activity *we already know* can fit fairly nicely into L2s",
        "created_at": "2021-10-09T00:25:40.216000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "so u think the future is most services residing on \"semi-centralized\" environments and decentralized blockchain being used very unfrequently?",
        "created_at": "2021-10-09T00:27:05.640000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "Why would they need to be at all centralized?",
        "created_at": "2021-10-09T01:18:19.005000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "current L2s have some form of centralization around developers but that's largely for simplicity of given their relative immaturity",
        "created_at": "2021-10-09T01:19:09.345000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "BTC and ETH weren't centralized on their infancy",
        "created_at": "2021-10-09T02:39:18.435000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "so?  what does that have to do with anything?",
        "created_at": "2021-10-09T02:47:23.849000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "It has to do that they don't need to be centralized, but currently they are. If they claim to remain centralized, then we know what to expect from them. If they claim to gonna become decentralized in the future, then it's a big warning, because they should have started so from the begining. We must question what issue makes them not be able to be decentralized and what's their commitment to it.",
        "created_at": "2021-10-09T12:33:29.371000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "I see rollups and other L2 solutions better than traditional centralized off-chain services. But I still don't like the idea of being on a decentralized network and having to move my funds or having my \"NFTs\" on a \"semi-off-chain\" centralized environment. It looks like decentralization is reaching its limit and failing and we're needing to move back to centralized services. If all services would go to (a variety of kinds of semi-) centralized environments, then decentralization would become more as a sort of marketing pretty word. As if we'd have an open source kernel but everything else on the OS is proprietary software and we're unable to use the OS without them.",
        "created_at": "2021-10-09T12:39:58.057000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Unfortunately, building actually censorship resistant software is hard, and building censorable/permissioned software is easy.  When people are racing to be the first to launch, the easiest way to do that is just drop the hard parts.",
        "created_at": "2021-10-09T13:08:50.758000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "That being said, actually censorship resistant/permissionless is possible.",
        "created_at": "2021-10-09T13:09:08.747000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "yes",
        "created_at": "2021-10-09T13:09:35.421000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "That's why it's an advantage for the L2 system to be EVM compatible, this way the same dapps can be deployed on the L2 instance and on L1.",
        "created_at": "2021-10-09T13:10:22.663000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "I don't think this is really a solid argument, there isn't any reason L2s *must* have centralization pressure and there's active work on improving this matter, it's really just a technical restriction for the short term to be able to service the big pressure to seek lower fees",
        "created_at": "2021-10-09T14:03:25.279000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "and actually state channels perform *better* at scale and so have natural decentralization properties, though don't generalize well which is a downside",
        "created_at": "2021-10-09T14:04:18.431000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "It's not exactly an argument, it's the impression I see, I might be wrong. It's not that L2 must be centralized, it's that I see most of them being centralized.\n\nBut I don't like at all the argument that centralization is temporary and there's work to improve it. That's what I said about BTC and ETH, they didn't start centralized and were improved later. So, if a system is centralized and claims to be being improved to be more decentralized, then there's some serious issue around.\n\nOf course we're having pressure for both better tps and lower network fee. That's what I said, we may be facing the limits of decentralized blockchain networks and going on the path back to centralized environments. L2 systems being in practice centralized and some of them claiming it's gonna be improved later is another sign of that, that we're unable to properly scale decentralized networks and will rely back on centralized environments.",
        "created_at": "2021-10-09T14:33:00.832000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "Ok now I think I follow what you're saying",
        "created_at": "2021-10-09T14:36:34.367000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "yeah that's an understandable impression",
        "created_at": "2021-10-09T14:36:42.472000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "The latter point I think says more about people being cheap",
        "created_at": "2021-10-09T14:37:13.761000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "Then I said that if we end up on the situation that L1 is a decentralized blockchain network and is rarely used with many L2 instances most of them centralized and their data never being commited to L1, then we're in the worst possible scenario of decentralized networks having failed, became useless and becoming just a marketing.\n\nAs Matic is an independent network but claims to be a ETH sidechain.",
        "created_at": "2021-10-09T14:41:45.914000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "Is the consensus set on Matic controlled in contracts on eth?",
        "created_at": "2021-10-09T15:13:34.226000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "Or is it really just its own ledger with a peg?",
        "created_at": "2021-10-09T15:13:59.377000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "AFAIK it's independent, uses normal bridge to transfer FT and can't transfer NFT",
        "created_at": "2021-10-09T15:14:40.771000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "Wow that really is kind of misleading marketing from them",
        "created_at": "2021-10-09T15:17:52.275000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "That's what I mean. Some companies are owning systems that are independent networks or centralized environments with bridges to ETH as they could bridge to any other blockchain network. And claim they're ETH sidechains or rollups. L1 becomes just a marketing, because being linked to ETH adds credibility.",
        "created_at": "2021-10-09T15:21:50.385000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "IMX has been claiming for months that eventually they're gonna suport transfering NFT to ETH. No ETA or roadmap. They claim to be L2 but commit no data to ETH, NFTs can't be transfered, other ERC20 aren't supported, they just store ETH on a sc and replicate it on their system. AWS and M$ Azure are more distributed than these systems.",
        "created_at": "2021-10-09T15:28:31.638000+00:00",
        "attachments": null
    },
    {
        "author": "__climber__",
        "category": "general",
        "parent": "",
        "content": "Matic says they checkpoint to ETH. Also, isn't this the distinction between sidechains and L2s? Where L2s are secured more by L1?",
        "created_at": "2021-10-09T16:53:47.899000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "sorry I didn't understand",
        "created_at": "2021-10-09T18:25:52.254000+00:00",
        "attachments": null
    },
    {
        "author": "__climber__",
        "category": "general",
        "parent": "",
        "content": "I mean Matic isn't totally independent since it checkpoints to ETH (posts merkle roots). Although ETH isn't verifying the checkpoints so I don't know whether there is actual security benefit. Maybe someone else knows",
        "created_at": "2021-10-09T20:14:38.496000+00:00",
        "attachments": null
    }
]