[
    {
        "author": "fradamt",
        "category": "general",
        "parent": "",
        "content": "Is there any write-up on how a rollup might go about using shard data blobs? I’d be interested in things like how to deal with the fact that the publication and execution of (say) a validity proof is decoupled from the publication of the data blob, or how would a rollup go about using multiple shards. Haven’t been able to find anything very specific on this topic",
        "created_at": "2021-10-07T07:37:36.682000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Does anyone have reading on optimal topologies for state channel networks?",
        "created_at": "2021-10-07T21:19:08.565000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I'm thinking about it on my own, very hard to reason about dues to the different aspects",
        "created_at": "2021-10-07T21:19:35.079000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "direction of flow, should large nodes have many channels or few, fat channels, what's the optimal way to avoid central points of failure, routing considerations etc",
        "created_at": "2021-10-07T21:20:27.326000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Shards commit merkle roots to the coordination chain right? Wouldn't they use simple merkle proofs compressed with a snark?",
        "created_at": "2021-10-07T21:22:00.770000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "i am by no means an expert or even very knowledgeable on this, it's just what I always assumed any multi shard thing would do. pull data from shards using merkle roots",
        "created_at": "2021-10-07T21:29:46.293000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "general",
        "parent": "",
        "content": "They use polynomial commitments instead of merkle roots, but otherwise I agree that the validity proof can verify that the commitment matches the state diff it produces (or whatever the data is in relation to the computation). I was more wondering if there's annoying edge cases caused by the fact that the data and proof are not published together. It seems to me that at worst you'd get a proof which doesn't find the data, because it has ended up on a different branch or because the shard is slow, which is a bit annoying and wastes a bit of gas but not a huge deal.  This should also be pretty rare because a prover wouldn't start doing the proof until it has the whole batch (right?), and by the time it has the proof the shard data blob should be crosslinked and with a few confirmations. I am curious if that's really all there is to it?",
        "created_at": "2021-10-07T21:59:10.579000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "That's above my level lol 😅 I assumed baseically that the rollup operators would lag behind a lot ut that it wouldn't matter since once the data is in the shard you can pretty much know what will happen, eventually",
        "created_at": "2021-10-07T22:06:27.181000+00:00",
        "attachments": []
    }
]