[
    {
        "author": "albusdompeldorius",
        "category": "general",
        "parent": "",
        "content": "Exactly! It sacrifices some generality, but doesn't sacrifice any of the security of zk-rollups, so it is still secure even if no-one is watching the chain, unlike plasma or optimistic rollups!",
        "created_at": "2021-10-19T05:06:27.359000+00:00",
        "attachments": null
    },
    {
        "author": "albusdompeldorius",
        "category": "general",
        "parent": "",
        "content": "Now, if we can generalize it to work in a hybrid kind of way with contracts, it would be even more interesting. That's what I'm mostly thinking about right now.",
        "created_at": "2021-10-19T05:10:17.938000+00:00",
        "attachments": null
    },
    {
        "author": "albusdompeldorius",
        "category": "general",
        "parent": "",
        "content": "My current line of thinking is that changes to some common state (eg. Uniswap token pool balances) would need to be in calldata, but that would be quite small and amortised over all users who change it in a block.",
        "created_at": "2021-10-19T05:17:47.237000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think there is significant value in a zkRollup that can \"only\" do ERC20 and ETH transfers (throwing in ERC-721 transfers as well would be nice).",
        "created_at": "2021-10-19T09:09:43.370000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "There is a dire need for an Ethereum payment network for people selling real-world goods and services for crypto that doesn't require huge transaction fees.",
        "created_at": "2021-10-19T09:10:25.646000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "For example, if you could get a handful of exchanges onto such a zkRollup along with maybe a payment processor or two then all of those people can move off of L1 for their transfers.",
        "created_at": "2021-10-19T09:10:58.263000+00:00",
        "attachments": null
    },
    {
        "author": "albusdompeldorius",
        "category": "general",
        "parent": "",
        "content": "Yeah. Adding support for ERC-20 and ERC-721 should be possible, you would mainly have to replace the map Address -\u003e Value with a map Address -\u003e (Token -\u003e Value), and make the necessary adjustments that follows from this change.",
        "created_at": "2021-10-19T09:15:51.652000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "Why do you think loopring has not been more successful so far?",
        "created_at": "2021-10-19T12:12:22.743000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "They've been a very effective transfers-only rollup with really low fees (because they actually bother to do compression) for a long time now",
        "created_at": "2021-10-19T12:12:52.680000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "I would lob in a problem that is parallel to the one that \u003c@301186049323958275\u003e called out (or orthogonal?) — who is effectively solving the fiat/crypto on and off ramps today in a way that is regulatory compliant, cheap, fast and with a great UI/UX? It’s certainly not Coinbase or the other cex’s out there. People are trying like Square, Wyre, and Moonpay but no one has cracked the most critical problem with crypto to-date\n\nThis to me is the only product decision that is stopping crypto from reaching 1B users and beyond—it’s just far too difficult for the average regular person to use. \n\n\u003c@273808422753796097\u003e have you given any thought to this issue? I’m certain you have haha so would love to hear what you (and other folks here) think!",
        "created_at": "2021-10-19T12:16:34.052000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "That's more a regulatory problem than a technical one, no?",
        "created_at": "2021-10-19T12:17:51.741000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "I’m not sure, I guess that’s the question. At what point does the technical community need to meet the real world half-way and engage with regulators \u0026 normal users who are not crypto nerds like all of us here 😂\n\nIf indeed the goal is to decentralize the internet and empower more people, regardless of border, race, political affiliation, economic access etc, to be a meaningful participant in the value creating opportunities that Web 3 will certainly bring — then we must all see that technology and engineering here need to be reinforced by PR, marketing, lobbying the right political decision makers and meeting users where they are, rather than dragging them into the rabbit hole with us\n\nThe easier question to me is more of a product design question. The question I am asking myself is “who is building the global bridge between the old physical world and the new, shinier, decentralized digital world?” \n\nUnless we all think our entire lives will be spent on the internet, this is one of the highest order problems to solve and transcends any individual L1 community\n\nAgain just my two cents but I welcome discussion around these points! Appreciate when others challenge my viewpoints 😇",
        "created_at": "2021-10-19T12:23:32.225000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "What worries me is the emergence of a new kind of tribalism. ETH vs BTC or ETH vs SOL seems much more minor than “crypto vs the world”",
        "created_at": "2021-10-19T12:24:56.649000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "When the promise of blockchain is actually to more finely tune incentive structures and governance in a (near) zero-trust manner. After COVID and all the failings of private and public entities that we all here witnessed over the past 2 years (also how the f has COVID been around for two years…), the crypto community (ie all of us here) has a great opportunity to show everyone that we can be a force for good + change lives with technology. But the engineering needs to be married with the right product design and powerful messaging\n\n\u003cend rant\u003e",
        "created_at": "2021-10-19T12:27:08.632000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "I don’t want crypto to become like Facebook. The zuck claims “we have no moral authority or power to police the platform effectively. We’re just here to connect the world”\n\nWell okay great, you’ve got several billion monthly active users, and have created a staggering amount of wealth for both yourself and shareholders. \n\nBut with great power, comes great responsibility (😋) — size and success is married with a social contract to aid society because what you accomplished has been built on the shoulders of others who came before you. And crypto would not be possible without the system that produced the early telecom and internet pioneers in the 20th century",
        "created_at": "2021-10-19T12:30:52.953000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "ETH for example, would have been an AMAZING way for governments globally to distribute stimulus spending instantaneously into the wallets of billions of citizens who were dying and struggling. It would be a trivial problem. And btw generate a nice bump of gas fees for the miners (soon to be validators)",
        "created_at": "2021-10-19T12:32:48.889000+00:00",
        "attachments": null
    },
    {
        "author": "albusdompeldorius",
        "category": "general",
        "parent": "",
        "content": "This is a strictly technical server. If you want to write essays or discuss non-technical stuff I'd recommend other places, like e.g. reddit or twitter. 👉",
        "created_at": "2021-10-19T12:37:09.678000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It is permissioned.  There is currently only one permissionless L2 solution (Fuel) which appears to just be a prototype, not a full product.",
        "created_at": "2021-10-19T12:38:55.360000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "Oh sorry 🙏 noted. I’ll take to Substack",
        "created_at": "2021-10-19T12:39:29.495000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think also, beyond being a permissioned solution, the target audience should be getting exchanges and payment providers onboarded.  This may mean doing free integration work for them, excellent developer docs, and great integration SDKs that can be used securely by large businesses (which means not bringing in 700 transitive project dependencies maintained by 3000 different people).",
        "created_at": "2021-10-19T12:41:24.300000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Ideally, a user who buys some ETH on Coinbase, uses it to buy some stuff via Bitpay, and then withdraws via Binance would never hit L1 (or at least, would hit L1 with the minimum data possible, which is 6-bytese with the solution proposed by \u003c@848181786763984926\u003e above).",
        "created_at": "2021-10-19T12:42:12.827000+00:00",
        "attachments": null
    },
    {
        "author": "albusdompeldorius",
        "category": "general",
        "parent": "",
        "content": "Actually, my solution would be very efficient for the use case where many users withdraws from a CEX. Since there is one sender (the CEX) and many recipients, all transfers would be batched together, so there would only be 6 bytes of calldata for each batch of transfers.",
        "created_at": "2021-10-19T12:52:15.243000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Even better.  😄",
        "created_at": "2021-10-19T13:05:39.843000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003c@848181786763984926\u003e Do you plan on building out an L2 solution using the scheme you described?  Or is it just a research project/idea at the moment?",
        "created_at": "2021-10-19T13:16:14.028000+00:00",
        "attachments": null
    },
    {
        "author": "albusdompeldorius",
        "category": "general",
        "parent": "",
        "content": "I want to implement a minimal working prototype at least. I'm currently learning how to write zk-circuits with circom.",
        "created_at": "2021-10-19T13:20:45.899000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "are you in contact with Barry whitehat outside of ethresearch? i'm sure he'd love to connect",
        "created_at": "2021-10-19T19:31:00.500000+00:00",
        "attachments": null
    },
    {
        "author": "albusdompeldorius",
        "category": "general",
        "parent": "",
        "content": "I talked to him a bit on telegram, but that was based of an older draft. Hopefully the current proposal is clearer though.",
        "created_at": "2021-10-19T19:41:40.442000+00:00",
        "attachments": null
    }
]