[
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "I don't think they do though.\nIt's not a huge problem, as long as you assume that you're going to have a few validators that are not going to disappear at the same time. Since the state root is posted on L1 they can prove the state they have.",
        "created_at": "2021-09-03T14:38:45.637000+00:00",
        "attachments": []
    },
    {
        "author": "albusdompeldorius",
        "category": "general",
        "parent": "",
        "content": "How do you guarantee that the rollup operator makes the state available to the validators though?",
        "created_at": "2021-09-03T15:00:27.958000+00:00",
        "attachments": []
    },
    {
        "author": "albusdompeldorius",
        "category": "general",
        "parent": "",
        "content": "I believe what you are describing are called *validiums*.",
        "created_at": "2021-09-03T15:02:40.556000+00:00",
        "attachments": []
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "I mean data availability sampling is a thing",
        "created_at": "2021-09-03T15:07:33.447000+00:00",
        "attachments": []
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "presumably accepting a batch can require a threshold of the ~~rollup~~validium validators",
        "created_at": "2021-09-03T15:08:25.354000+00:00",
        "attachments": []
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "and if the security assumption is that at least one is honest that's *pretty good*",
        "created_at": "2021-09-03T15:08:56.103000+00:00",
        "attachments": []
    },
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "Ah I see what you mean! That's certainly one issue. One solution would be to layer a PoS + data availability sampling that slashes when not satisfied.\n\nDoes anybody knows how this work **in practice** for zksync or starkware? (i.e. how they guarantee (or don't) data availability)",
        "created_at": "2021-09-03T15:15:11.680000+00:00",
        "attachments": []
    },
    {
        "author": "albusdompeldorius",
        "category": "general",
        "parent": "",
        "content": "Yeah, I think that's how validiums do it. According to https://l2beat.com/, zksync is a zk-rollup, so on-chain data availability. StarkEx (used by e.g. DeversiFi) is a validium, so has off-chain data availability. There is also StarkNet under development by StarkWare, which is a zk-rollup.",
        "created_at": "2021-09-03T15:21:10.515000+00:00",
        "attachments": []
    },
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "I'm 99% sure they don't do it. But I'd like someone who actually knows for sure to confirm.\n\nI've read many times that one of the advantages of zk-rollup is that they are less costly because they need to post less data to the chain. If they need to post transaction data to the chain, then they actually need to post more data than optimistic rollups.\n\nI also remember Optimism people saying that the costs of txs in Optimism directly reflects the cost of posting the transaction to calldata. I doubt the zk people are so nice as to bankroll the L1 costs of their chains on behalf of users.",
        "created_at": "2021-09-03T15:52:55.379000+00:00",
        "attachments": []
    },
    {
        "author": "liberosist",
        "category": "general",
        "parent": "",
        "content": "zkRs do indeed need to post transaction calldata - however this can be more compressed than ORs as zkRs can skip data only relevant for verification. On the flipside, zkRs have a higher fixed batch cost, but amortized over a number of transactions zkRs do end up cheaper.\n\nStarkEx has both validium and rollup options, dYdX operates as a rollup with full data availability on-chain while the other 3 instances are validiums.",
        "created_at": "2021-09-03T17:11:45.189000+00:00",
        "attachments": []
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "zksync posts a lot less data to chain than optimism, which is reflected in the fees",
        "created_at": "2021-09-03T17:28:50.038000+00:00",
        "attachments": []
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "they both do post all necessary data to chain though",
        "created_at": "2021-09-03T17:29:13.160000+00:00",
        "attachments": []
    }
]