[
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Please correct me if i am wrong but exchanges will not be able to easily adopt deposits and withdrawals to rollups due to liquidity issues? they may support ETH, USDT, Maybe BTC? But each token will put a strain on them in terms of manpower etc. because they will have to manage liquidity for each token for each rollup?",
        "created_at": "2021-11-18T14:46:37.826000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "That being said where there is a will there is a way 🙂",
        "created_at": "2021-11-18T14:49:13.880000+00:00",
        "attachments": []
    },
    {
        "author": ".someoneanonymous",
        "category": "general",
        "parent": "",
        "content": "I would suggest that putting enough ETH on an L2 will create a market for liquidity for other tokens. People don’t just want their ETH sitting on an L2 and not earning any yield. This will incentivize bigger liquidity providers to bridge over tokens and the will more than make up for the L1 bridge fee.",
        "created_at": "2021-11-18T15:40:10.666000+00:00",
        "attachments": []
    },
    {
        "author": ".someoneanonymous",
        "category": "general",
        "parent": "",
        "content": "I’m not sure exchanges need to support liquidity themselves.",
        "created_at": "2021-11-18T15:42:22.837000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "If they want to support withrawals directly to a rollup the tokens in question must already be in their wallet on this rollup i think.",
        "created_at": "2021-11-18T15:44:52.137000+00:00",
        "attachments": []
    },
    {
        "author": ".someoneanonymous",
        "category": "general",
        "parent": "",
        "content": "My guess is that exchanges allowing users to move ETH to an L2 will be enough. If I want a token on the L2 and  can get ETH there, I can buy that token. If I have the token on an exchange and want it on the L2, I can sell the token for ETH, bridge ETH, and buy that token. The exchange could actually do that for me in the background since they’ll have the token in their custody on their exchange and will have ETH on the L2. If there isn’t enough liquidity for that token on an L2 exchange, this won’t work, but it should be good enough for the most popular tokens (which are what exchanges are likely to support).",
        "created_at": "2021-11-18T15:47:32.299000+00:00",
        "attachments": []
    },
    {
        "author": ".someoneanonymous",
        "category": "general",
        "parent": "",
        "content": "If I were an exchange, I’d only build up L2 liquidity myself for a token that was constantly being moved on/off and use the open market to handle that in the meantime.",
        "created_at": "2021-11-18T15:48:56.272000+00:00",
        "attachments": []
    }
]