[
    {
        "author": "bearjew6187",
        "category": "general",
        "parent": "",
        "content": "thanks for answering!\n\nI'm still vague on some basic issues. In the original suggestion, where does EVM execution happen? I understand that the shard is just a blob, but somewhere EVM txs are sent and executed, so I'm trying to understand exactly where is this \"somewhere\" (just regular eth1 txs operating on the state, orthogonal to the beacon chain?) and what shard data would I have accessible there. In particular, rollups would at least need access to historical blob commitments in the execution environment.\n\nI still need to go deeper into the new suggestion (only read the tweet so far) but it seems to focus more on the security/simplicity tradeoff rather than the relationship between execution and data shards. Perhaps I'm missing the fact that blobs can actually be a part of the tx, and the protocol specifies that if its included in a beacon block, the blob must be included in the relevant shard (this would allow synchronicity)",
        "created_at": "2021-12-30T06:36:02.726000+00:00",
        "attachments": []
    },
    {
        "author": "bearjew6187",
        "category": "general",
        "parent": "",
        "content": "Ok he's actually talking about exactly this, blob is calldata of the tx that goes to the shards in the same beacon block the tx was included in.\n\n\"Rollups do not need to implement awkward shard scanning logic. Data addressed to them can immediately be labeled using L1 transactions\" - so it seems that the situation was close to my imagination, in the original suggestion, a rollup would need to find the shard block in which his data was included, and attach, say, this block number to the rollup's state update transaction (in order to have access to the blob commitment, similarly to how today we can get the hashes of previous blocks)",
        "created_at": "2021-12-30T07:03:09.307000+00:00",
        "attachments": []
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "I don't completely understand how rollup contracts have access to shard data blobs",
        "created_at": "2021-12-30T08:56:16.150000+00:00",
        "attachments": []
    },
    {
        "author": "feedthefed",
        "category": "general",
        "parent": "",
        "content": "I don't have a direct confirmation for this, but I assume that we have an opcode for\nget_blob_commitment(shard, i)\nwhich returns the blob header of the i'th last block in the given shard\n\nIn the new suggestion it is just plain old calldata, i.e. a tx is (execution_info, blob) and you have an access to the blob_header in the execution as they're coupled, but I guess you would still use the above sometimes.",
        "created_at": "2021-12-30T09:03:51.474000+00:00",
        "attachments": []
    }
]