[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I'm concerned about this even on L1 that we have 2 independent network stacks with a strong synchronicity assumption. Seems like calling for spam attacks.",
        "created_at": "2021-11-12T00:54:16.192000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I think there needs to be a regenesis soon and with maybe ½ the current blocksize so an Ethereum lightning network gets a chance to grow because rollups just wont cut it for every day transactions it seems. Maybe every day transactions is not the goal for ETH, but it seems to be a big use case so it would be great to have it 🙂",
        "created_at": "2021-11-12T22:24:44.687000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I think this needs to be seriously considered. In the short term there might be some pain for every day users because fees will go up, but it could actually accelerate rollup adoption which is the goal anyway. Meanwhile people can actually run and sync ETH nodes on raspi PIs etc. and begin building a lightning network that uses eth. The sooner the better 🆘",
        "created_at": "2021-11-12T22:30:53.354000+00:00",
        "attachments": []
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "\u003e because rollups just wont cut it for every day transactions it seems.\nthis is really just a wallet and infra problem, not a problem with rollups themselves",
        "created_at": "2021-11-12T22:41:28.994000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "afaik in order to get a cheap fee on the rollup 1) fee on base layer must not be spiking and 2) there have to be many people doing a transaction on the rollup at the same time as you. This seems a bit unreliable 🙂 And even if too many people are doing a transaction at the same time as you on the rollup the fee will actually start going up as well. So it will not be able to compete with a lightning network when it comes to every day transactions but who knows",
        "created_at": "2021-11-12T22:43:09.745000+00:00",
        "attachments": []
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "my ideal world involves a payment channel network bridging across multiple rollups",
        "created_at": "2021-11-12T22:48:35.276000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "im currently looking into zkPorter which seems to adress the issue i raised but its not an inter-rollup thing afaik",
        "created_at": "2021-11-12T22:49:44.730000+00:00",
        "attachments": []
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "it's a validium",
        "created_at": "2021-11-12T22:51:59.846000+00:00",
        "attachments": []
    }
]