[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Sadly, for a lot of projects there aren't incentives.  😢 I have participated in discussions around them, but they are relatively hard and all of the solutions I have seen proposed have some kind of tradeoff.",
        "created_at": "2022-03-24T05:45:05.491000+00:00",
        "attachments": null
    },
    {
        "author": "awmacp",
        "category": "general",
        "parent": "",
        "content": "That is indeed my understanding. Can you say anything more about proposed solutions you saw?",
        "created_at": "2022-03-24T05:59:26.613000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Most of the solutions I have seen sacrifice censorship resistance by having a permissioned sequencer.  This sequencer usually receives money in the form of fees, but they have censorship powers and if they go offline the system stops working.",
        "created_at": "2022-03-24T06:00:27.282000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Ideally, sequencers are not permissioned and you have some mechanism that allows for rotating through them.  One can imagine a setup where anyone can place a bond to be a sequencer and they get fees for doing their job.  This creates a troll vector where someone can produce L2 blocks but leave them empty, but they get their bond back at the end.  Because of this you really want sequencers to rotate pretty quickly so a troll can only censor for a very short period of time (like in Proof of Work or Proof of Stake).",
        "created_at": "2022-03-24T06:02:37.204000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This still leaves the problem of how to get transactions to the right sequencer though.  You can do a gossip network, but those are hard to design/build well.  You could have people send their transactions to the \"next few sequencers (which register their endpoint when they bond).  I think this is probably the best option I have seen.",
        "created_at": "2022-03-24T06:03:30.060000+00:00",
        "attachments": null
    },
    {
        "author": "awmacp",
        "category": "general",
        "parent": "",
        "content": "If I understood correctly, these sequencers are responsible for ordering messages in the rollup inbox. Does this address the matter of incentivising fraud proofs? If so I'm not seeing it.",
        "created_at": "2022-03-24T06:51:05.315000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Ah, no.  The fraud proof incentive problem is separate, and also poorly solved IMO.",
        "created_at": "2022-03-24T06:53:19.110000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The one nice thing about fraud proofs is that anyone can run a verifier and you only need one honest verifier.",
        "created_at": "2022-03-24T06:53:39.327000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "You still should have an incentive scheme, but you can always fallback on \"you should run your own verifier\".",
        "created_at": "2022-03-24T06:53:58.507000+00:00",
        "attachments": null
    },
    {
        "author": "awmacp",
        "category": "general",
        "parent": "",
        "content": "I agree. One verifier seems like a reasonably modest assumption, even if the incentive analysis doesn't quite work out",
        "created_at": "2022-03-24T06:55:04.456000+00:00",
        "attachments": null
    },
    {
        "author": "awmacp",
        "category": "general",
        "parent": "",
        "content": "thanks for the info!",
        "created_at": "2022-03-24T06:56:46.405000+00:00",
        "attachments": null
    }
]