[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003c@203220829473996800\u003e Do any L2s have a solution to long term data availability yet?  4844 is only useful for censorship resistant rollups if they solve the long term data availability problem themselves, but I haven't seen anyone do that.  If no one solves that, then we end up with L2s that use calldata, or we have L2s that aren't censorship resistant I think?",
        "created_at": "2022-11-24T15:11:42.629000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "general",
        "parent": "",
        "content": "Long-term data-availability is just a matter of state-storage and any form of sync by honest actors. L2s can sync that just like L1 nodes can, it's not the weakest link in L2 chain security, unlike availability of recent data",
        "created_at": "2022-11-24T15:19:29.431000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I agree it is *possible* to solve.  I just haven't seen any L2 working toward actually solving it.",
        "created_at": "2022-11-24T15:20:15.760000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If they don't, then 4844 won't be useful for achieving decentralized L2s, only centralized L2s.  I'm not sure we should be prioritizing support for centralized L2s.",
        "created_at": "2022-11-24T15:20:40.264000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "general",
        "parent": "",
        "content": "Besides, most fast L2s already sync offchain, because the L1 availability is slow. That's bad for recent data, but perfectly fine for data that hasn't changed in 2 weeks and has been widely accepted by the L2.",
        "created_at": "2022-11-24T15:20:51.880000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Do any of them have their own gossip network they sync from?  Or just a centralized server?",
        "created_at": "2022-11-24T15:21:13.989000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "general",
        "parent": "",
        "content": "Optimism bedrock (next upgrade) is introducing p2p, the same gossip stack as beacon-nodes. And in the execution layer part of Bedrock we are about to introduce snap-sync ability via p2p 🙂",
        "created_at": "2022-11-24T15:22:18.763000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "general",
        "parent": "",
        "content": "So you'd snap-sync towards 2-week old data, and then verify it against the output-commitments that already secure the L2 funds on L1, and then sync the last part with blob-data, to not rely on any actor making the latest state available on p2p.",
        "created_at": "2022-11-24T15:23:26.294000+00:00",
        "attachments": []
    }
]