[
    {
        "author": "dcposch",
        "category": "general",
        "parent": "",
        "content": "So the latest Elon tweet is him asking McDonalds to accept doge. (A ridiculous request for many reasons, starting with the fact that doge has the same fundamental scaling limits as other L1s.  People would quickly end up paying $5 transaction fees on a $5 happy meal.)\n\nThis sent me down a thought experiment, though...\n\n**What would it take to move an  entire existing cryptocurrency onto L2?**\n\nNot via a sequence of steps each user has to take--wrapping, going thru a bridge etc. I mean via a hard fork: \"just upgrade your Doge wallet. starting at block X everything's going to be on a rollup\".\n\nSketching out what this would take:\n\n- Governance process on the source chain to build consensus. Similar challenges to The Merge, in the sense that miners would stand to lose their rewards.\n\n- A smart contract on the rollup. The contract tracks the source chain like a light client, verifying proof-fo-work. I made a prototype of this for Bitcoin: https://bitcoinmirror.org/\n...Doge would be a more difficult, since it uses scrypt PoW which is more expensive to verify than sha256. Should still be doable on L2.\n\nThe point of this contract is to have a trustworthy view, *within the rollup* of the state of Doge as of the fork block.\n\n-  Another rollup contract that implements ERC20 and serves as the new canonical Doge post-fork.  This contract would also verify ECDSA signatures to allow spending from an existing Doge keypair.\n\nYou'd need cooperation from the rollup to accept transaction fees in the new token, rather than in Eth. You'd likely have something similar to Optimism's predeployed gas price oracle to report gas prices denominated in the new token.\n\nThe coin could either remove issuance, or keep the same  schedule + redirect post-fork issuance into a community DAO treasury.\n\nCurious if anything like this has ever been spec'd in more detail.",
        "created_at": "2022-01-26T06:10:46.928000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "The reasons why people don't migrate to L2s vary: some people wait for a truly secure rollup, some wait for more liquidity, some wait for more dapp integrations. Which is hard, because if everyone is waiting for other people to make the first move, nothing will change. Even though a hard fork like this would solve this problem, it could be also achieved in a more simple way by introducing incentive mechanism like calldata cost reduction in EIP-4488. A hard fork would also eliminate the migration costs, but personally I don't think they are a problem anymore. Even if you are a small user, you can just deposit to Binance \u0026 withdraw to Arbitrum.",
        "created_at": "2022-01-26T07:39:40.689000+00:00",
        "attachments": null
    },
    {
        "author": "dcposch",
        "category": "general",
        "parent": "",
        "content": "^ for clarity i'm talking about the possibility of *other, non-Ethereum-based cryptocurrencies* like DOGE using ethereum L2.\n\napplications and tokens currently on eth L1 moving to L2 is an easier problem that's been explored pretty extensively.",
        "created_at": "2022-01-26T07:50:19.023000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "ah, i see. Interesting thought, but I guess it would be hard to reach social consensus on that. I don't think you could convince every doge guy to switch, so their network would probably split into the original one and the L2 one. And things like that always scare people off.",
        "created_at": "2022-01-26T16:36:26.882000+00:00",
        "attachments": null
    }
]