[
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "Just read this piece here from \u003c@!238630472522006528\u003e and had a couple questions for the group here:\n\n1) On the topic of DA withholding attacks for scaling solutions that employ offchain DA, have there actually been examples of this happening? Or is this more of a theoretical, “this could happen in the future maybe” type of situation? \n\n2) Which self-dubbed “rollups” today have robust L1 exit mechanisms? Vs others that claim to be secure rollups but actually still don’t have great exit mechanisms in case of the execution layer failing or becoming corrupted?\n\nhttps://polynya.medium.com/updated-thoughts-on-modular-blockchains-ce1b159fa1b3",
        "created_at": "2022-03-25T17:19:59.598000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "To question 2: this probably doesn't answer it in full but if you go to https://l2beat.com/ and click a rollup name they have some nice \"Risk Summary\" sections there.",
        "created_at": "2022-03-25T17:26:18.066000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "Yup! Thank you 🙏 . Yeah I’ve read through those and seems like there’s quite a few trust assumptions made even for the more trafficked rollups. Was hoping for a 2nd take here\n\nDon’t know the L2beat research team so am asking around to make sure I don’t miss anything / in case their info is outdated!",
        "created_at": "2022-03-25T17:36:04.660000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "Tbh am much more focused on DA unavailability. Given that seems to be the key to understanding rollup economics and the realized/actual security trade-offs made amongst those and between true rollups vs off chain DA (which is obviously cheaper \u0026 an easier problem to solve)",
        "created_at": "2022-03-25T17:37:53.513000+00:00",
        "attachments": null
    }
]