[
    {
        "author": "kevvles",
        "category": "general",
        "parent": "",
        "content": "Thank you much!",
        "created_at": "2022-12-18T00:46:45.842000+00:00",
        "attachments": []
    },
    {
        "author": "plasmapower",
        "category": "general",
        "parent": "",
        "content": "You don't have to use a zk-EVM for this actually, optimistic rollups work as well. In fact, the original Arbitrum usenix paper described it as a private platform! https://www.usenix.org/system/files/conference/usenixsecurity18/sec18-kalodner.pdf",
        "created_at": "2022-12-18T05:11:24.629000+00:00",
        "attachments": []
    },
    {
        "author": "kevvles",
        "category": "general",
        "parent": "",
        "content": "Tyty for the info! Will definitely dig into this at some point 🙂\n\nMostly I was asking because I'm a writer that's building a Layman's guide to crypto with simple to understand language and explanations. To do that, I need to build accurate models in my head - and spot check those models for accuracy when I'm unsure, as with the above question. It's especially crucial because I don't have a computer science background - I don't want to mistakenly pass on models that are flawed representations of the underlying concepts.\n\nI was specifically inquiring about ZK-EVMs because that's the development that is currently at the forefront of my model as the 'most advanced' - which isn't a statement as to its usefulness when comparing it to optimistic rollups, but simply a statement of where they lie in my head among the L2 ecosystem. I was trying to plot out future use-cases - such as 5 years into the future, where companies and organizations might situationally deploy their own private L2 networks atop Ethereum. \n\nI imagine that the underlying architecture (optimistic rollups, ZK-EVMs, ZK-Stark, etc) of those L2 networks will depend on the needs and interests of the underlying organization. For example, if medical records were to be held in such a private network, I could see the operators opting for one that maximizes security above all else - while another company that deploys a blockchain for inventory purposes seems unlikely to need that security",
        "created_at": "2022-12-18T05:29:56.290000+00:00",
        "attachments": []
    }
]