[
    {
        "author": "yblue19",
        "category": "general",
        "parent": "",
        "content": "n00b question on L2: I'm told that people can always circumvent L2 to withdraw fund directly from L1. Therefore, L2 can be more centralized because people have alternative in case there is censorship. Is this true? By \"fund\", does it mean ETH only or any other ERC20/751 tokens? I have a hard time imagine how that would work if L1 is just a pure data shard, in which case all it understands is a bunch of 010101 and I don't know how fund transfer would work.. Thanks!",
        "created_at": "2022-01-06T15:25:38.014000+00:00",
        "attachments": []
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "without talking about specific protocols it's impossible to give concrete answers",
        "created_at": "2022-01-06T16:16:31.899000+00:00",
        "attachments": []
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "there's a wide variety of L2 designs",
        "created_at": "2022-01-06T16:16:40.030000+00:00",
        "attachments": []
    },
    {
        "author": "yblue19",
        "category": "general",
        "parent": "",
        "content": "let's say Arbitrum + zkSync?",
        "created_at": "2022-01-06T16:17:10.937000+00:00",
        "attachments": []
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "so there's always going to be some amount of execution happening on L1 to manage the rollups and major infrastructure like makerdao and other ERC20 assets",
        "created_at": "2022-01-06T17:17:30.452000+00:00",
        "attachments": []
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "centralization of L2 sequencers right now is a practical concern to make it easier to build, but that's not a fundamental constraint that can't be overcome",
        "created_at": "2022-01-06T17:18:35.831000+00:00",
        "attachments": []
    },
    {
        "author": "yblue19",
        "category": "general",
        "parent": "",
        "content": "ok maybe I didn't understand the roadmap well. I thought the idea was to do sharding without the power of execution (data only) and for the purpose of only used by rollups...",
        "created_at": "2022-01-06T17:49:20.686000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "There can still be a contract of sorts no? Such that you can force a withdrawal. And said contact would then reference and check against some data on the shards to validate your request (or validate some proof you provide against it? This quickly turns into moon math to me)",
        "created_at": "2022-01-06T18:49:52.886000+00:00",
        "attachments": []
    }
]