[
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "That’s fair. I’m just suggesting perhaps that the bottleneck isn’t really the sequencer, which I view as more of a redundancy and network resiliency issue. Maybe there’s a happy medium where you get benefits of resiliency \u0026 uptime with distributing the sequencer set more than they are today (early days obviously) but maintaining the large design space to innovate on execution \u0026 performance (some of the StarkNet rendering stuff from guiltygyoza is kind of remarkable). \n\nRather it’s having a working proof system + lots of people verifying what the rollups post to L1, and continuing to push on that via trust-minimized light clients \n\nI guess it’s all a matter of finding the optimal trade-offs points to maximize against 🤷‍♂️",
        "created_at": "2022-03-27T01:04:01.195000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Too many people trade off censorship resistance IMO (see all L2s available today).  I think we need at least *some* L2s, particularly zkRollups, to be censorship resistant.  If all we have is censorship resistant L1 and a bunch of censorable L2s I feel like we haven't achieved scaling of Ethereum.",
        "created_at": "2022-03-27T09:06:15.052000+00:00",
        "attachments": []
    },
    {
        "author": "codeknight",
        "category": "general",
        "parent": "",
        "content": "While I agree, I doubt we will see much progress until the L2s are more complete and have much lower fees. If token swaps are under a penny, then focus will hopefully shift more towards censorship.",
        "created_at": "2022-03-27T23:56:39.351000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This won't happen if the designs rely on censorability to achieve high throughput.",
        "created_at": "2022-03-27T23:59:28.248000+00:00",
        "attachments": []
    }
]