[
    {
        "author": "monkins",
        "category": "general",
        "parent": "",
        "content": "I'm not sure if this is relevant but you may of not heard of it, verus.io can be used as a L2 to Ethereum that has a decentralized bridge anyone can run that software if they are  miner or a staker, and earn fees.  The stateroot of each blockchain is notarized into the other blockchain ETH-\u003e Verus every 10 blocks, and every time there is a rollup ready on verus two Notarizations are sent to Verus -\u003e ETH.   Then once the stateroots have been sent to the other chain, and the signatures of these notarizations are checked, it can be used for a roll-up TX to be sent over in either direction.",
        "created_at": "2023-10-28T18:04:05.776000+00:00",
        "attachments": null
    },
    {
        "author": "monkins",
        "category": "general",
        "parent": "",
        "content": "Along with the roll up is the proof up to the state root.  PATRICIA trie for ETH, and Merkle mountain Range for Verus.",
        "created_at": "2023-10-28T18:04:48.680000+00:00",
        "attachments": null
    },
    {
        "author": "monkins",
        "category": "general",
        "parent": "",
        "content": "This allows you to prove any transaction on either chain.",
        "created_at": "2023-10-28T18:08:11.446000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "How does in protect against two nodes colluding and lying?",
        "created_at": "2023-10-28T18:21:56.195000+00:00",
        "attachments": null
    },
    {
        "author": "monkins",
        "category": "general",
        "parent": "",
        "content": "The foundation of the security is from all the miners and stakers (anyone on the network running a miner or has staking turned on in their node with any amount of $Verus ~15,000 nodes). There are 15 witnesses that the Ethereum bridge contract recognises that it needs the signatures of the signed state roots.\n1) A block delta passes on the Verus chain and all the notaries sign and submit a TX containing a confirmed witnessed state root of Ethereum. (they get an eth proof from a bridgekeeping software that anyone can run that gets the stateroot).\n2) The 15 transactions are then verified by the whole verus network as every miner and staker can validate these transactions.\n3) After another block delta (~10 blocks) pass another newer stateroot of Ethereum is signed by all the notaries, then those tx's are put on verus, and then the previous notarization can be sent to the contract (As its confirmed by this new one), and the contract will only accept it if it has the correct amount of signatures and it has in it the txhash of the previous notarization.\n4) the contract now has a potential notarization but it also needs another notarization containing the stateroot of verus in to confirm that, so the first one sits there as unconfirmed in a forks array.\n5) finally when one more chained notarization comes into the contract on ethereum it confirms the first one mentioned in `1)`.\n6) meanwhile while this notarization process is happening, and the whole network is making sure no one is making up false stateroots etc. normal Defi crosschain transactions are happening and exports to Ethereum from verus.\n7) miners and stakers when they are running their nodes are periodically in a non deterministic way to combat MEV, rolling up the ETH Exports into an array of cross chain transfers, thats called a Cross Chain Export CCE TX.  This CCE is a roll up transaction that a miner puts in to verus and they earn a reward for doing it.  Once the contract confirms that it has a new enough stateroot anyone running bridge keeper will get the chance to put the rolled up tranactions into Ethereum.\n8) the transaction CCE goes into Ethereum along with the MMR proof up to the state root of Verus so first. First the serialized transfers that is in the CCE, that was on the verus chain is proven all the way up to the state root.  If is agrees that the proof passes then the transfers are deserialized and processed and all the payments go out.\n\nSo it only takes  1 witness running a node decided to lie then their notarization of the stateroot would not be valid and they will be autorevoked by all the other notaries, if a majority of the notaries colluded then you would still have the whole network of people running bridge keeper and you would have a fork.",
        "created_at": "2023-10-28T19:07:05.258000+00:00",
        "attachments": null
    },
    {
        "author": "monkins",
        "category": "general",
        "parent": "",
        "content": "The key that makes this the most secure bridge there is in crypto is that the witnesses have no control over the spends.  Also any transaction cross chain is provable on either chain, and delay checked by all the network before it is confirmed and can be sent.",
        "created_at": "2023-10-28T19:09:00.097000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Verus",
        "created_at": "2023-10-28T19:27:45.282000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003ctoghrulmaharram\u003e This is a sidechain, not an L2. The bridge asserts the correctness of the attestation, not the state transition. (re @ethrnd_rollcall_bot: \u003cmonkins\u003e I'm not sure if this is relevant but you may of not heard of it, verus.io is a L2 to Ethereum that has a decentralized bridge anyone can run that software if they are  miner or a staker, and earn fees.  The stateroot of each blockchain is notarized into the other blockchain ETH-\u003e Verus every 10 blocks, and every time there is a rollup ready on verus two Notarizations are sent to Verus -\u003e ETH.   Then once the stateroots have been sent to the other chain, and the signatures of these notarizations are checked, it can be used for a roll-up TX to be sent over in either direction.)",
        "created_at": "2023-10-28T19:31:17.253000+00:00",
        "attachments": null
    }
]