[
    {
        "author": "0x1984",
        "category": "general",
        "parent": "",
        "content": "their sequencers are the biggest concern - can crash at high load, be hacked and be shut down.",
        "created_at": "2023-04-21T01:29:44.330000+00:00",
        "attachments": []
    },
    {
        "author": "taempark",
        "category": "general",
        "parent": "",
        "content": "Gotcha. Will sequencers be concerned once they are decentralized?",
        "created_at": "2023-04-21T01:31:54.033000+00:00",
        "attachments": []
    },
    {
        "author": "0x1984",
        "category": "general",
        "parent": "",
        "content": "Yes, but I do not know how it can be decentralized - it will need to reach consensus again if decentralized, then it's other ETH chain.",
        "created_at": "2023-04-21T01:39:35.528000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "There's quite a wide range of possibilities for decentralising sequencers and they don't make it split from the L1 (ETH in this case). The L1 consensus still controls the \"safe\" part of the chain that has batches submitted to the L1, the sequencer system just needs to reach agreement on the unsafe part that builds on top of that until it is submitted back to L1.  There's a bunch of details depending on the specifics of the system used obviously.",
        "created_at": "2023-04-21T01:53:14.047000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Also worth noting that having the L2 sequencer go down doesn't necessarily mean the chain doesn't progress and users can't perform transactions - they just have to submit them via the L1 which is more expensive, slower and generally more difficult. So definitely not ideal, but that ability is a big part of what makes an L2 an L2.",
        "created_at": "2023-04-21T01:54:19.380000+00:00",
        "attachments": []
    }
]