[
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I just today decided to come, and would indeed like to meet with anyone interested.  Other than the EVM Summit (which should be of interest to many of us) my schedule is pretty open.",
        "created_at": "2023-11-09T19:48:36.047000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "I just now found this channel, and don't have time to skim the whole discussion, so just a few things that might be redundant:",
        "created_at": "2023-11-09T19:55:28.015000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "1) As an Editor and Magician I'd very much like to see this effort organized as a Working Group in association with the Editors and the Magicians.  As Sam mentioned, we intend to give working groups a lot of freedom in organizing their own process, acting primarily to provide you with the support you need.",
        "created_at": "2023-11-09T19:55:30.660000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "2) One EIP that might be worth doing early on is to assign ranges of opcode numbers for L2 standards and for unrestricted use by implementers.  The first range of opcodes prevents conflicts with L1, (conflicts between L2 teams are what we are trying to avoid) and the second range prevents conflicts between teams. (Teams can use and reuse these opcodes however they like.)",
        "created_at": "2023-11-09T19:59:54.142000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "general",
        "parent": "",
        "content": "3) The same goes for precompile addresses.  I'd suggest that for precompiles it would make sense to put actual EVM implementations at the assigned address -- L1 needs precompiles mostly for performance reasons, and these are not an issue for all L2s.",
        "created_at": "2023-11-09T20:01:33.658000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "I would discourage rollups from using any other opcodes than are in mainnet EIPs, mostly because of tooling integrations.  I expect that any needed features could be more compatibly done via precompiles or system contract accesses.",
        "created_at": "2023-11-09T21:46:05.293000+00:00",
        "attachments": null
    }
]