[
    {
        "author": "decentmuse",
        "category": "general",
        "parent": "",
        "content": "It seems to me the future is astonishingly bright (in relation to Ethereum L2 and scaling and Ethereum in general) and I'm wondering if anyone can fact check me here on the following thesis:\n\n*Assuming in the future that L2 ecosystems experience growth and there's enough demand to do \"stuff\"*\n\nSeems like the future of L1 usage will be primarily L2s posting blobs of compressed txns, individual users will gradually migrate to L2s and transact there.  \n\nNext once there is enough demand/activity to completely saturate L2 blobs and have maximum compression then it seem to me that the gas market can be happily sustained at extremely high levels.  Especially if there are multiple L2s (perhaps more than we might imagine) and with max compression/saturating being reached, then L2s can afford to give users cheap transactions while still being able to afford high L1 gas fees.\n\nTherefore, it seems like in this environment, where L1 blocks are filled with many L2s posting max compressed blobs, that we can have a sustained gas price of well over 1-2k gwei (maybe even much more like 10k gwei, trying to figure out how to calculate or estimate this figure actually would love if anyone can help point me in this direction).  \n\nIn this scenario users are happy as they are using L2 or L3 and paying cheap fees, L2s are max saturated and compressed and they can profitably include cheap transactions while simultaneously being able to afford high L1 gas prices of 1-2k gwei+.  \n\nWith this assumption we now have L1 chugging along at super high gas prices, everyone is happy because they are on L2/L3 and meanwhile Ethereum is max burning ETH, nice... but what else?\n\n**::In Conclusion:: **\nAs long as L2s are able to profitably include user txn and pay high gas fees, then we have a scenario where we see** L2s as this massive structural demand vector where they are these price insensitive, ETH consuming machines that gobble up ETH everyday to keep running their business.**",
        "created_at": "2023-08-06T18:08:47.527000+00:00",
        "attachments": null
    },
    {
        "author": "decentmuse",
        "category": "general",
        "parent": "",
        "content": "**Question 1**:  Is this a reasonable assumption in terms of L1 gas fees at 1-2k+ and L2 ability to max compress and happily afford to pay this?  I know it's still up in the air what kind of average compression we will see and its hard to estimate as a block would almost never just contain one batch.  \n\n**Question 2:**  Once the only L1 users are L2s, what happens to things like MEV?  Seems like MEV will entirely migrate to L2 and be captured at that level via sequencers correct?   \n\n**Question 3**: What will happen to Tips?  Seems like once the only users of L1 are L2, then gas market will be much more smoothed out and spikes will gradually reduce or be entirely elimiated.  Would it be correct to assume that Tips would decline or be unnecessary in this scenario?  (or perhaps there could be so many L2s that we still see demand spikes as they fight to get a tx included)  \n\n**Question 4**:  If L1 is happily chugging along at 1-2k gwei (or more) and there is less to zero MEV or TIPS, then will the pure increase in L1 gas not have any additional affect on staking APY as the benefits to high activity increasing staking APY seems to come from the increase of MEV and TIPs?",
        "created_at": "2023-08-06T18:13:42.607000+00:00",
        "attachments": null
    },
    {
        "author": "decentmuse",
        "category": "general",
        "parent": "",
        "content": "The only person I know to tag here is \u003c@269786774660710400\u003e but would be curious to know who might be able to help with this kind of feedback.",
        "created_at": "2023-08-06T18:22:03.654000+00:00",
        "attachments": null
    }
]