[
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cRenoRen79\u003e Waking up this morning with this interrogation : how to incentive L2s to respect ERC/EIPs, to improve their level ? How can we talk about mass adoption if normies are taken responsible for their L2 choices, requiring understanding of very complex concepts such as escape hatch, multisigs, optimistic vs zk roll ups ?\n\nL2s got EIP4844 for free, related benefits shall be partially spend in security improvments. Right now L2s have more interest in distributing this value via airdrop/rewards (spring/summers/merits programms) to drag users and increase their TVL.\n\nOne possible lever would be blob costs set according to the level reached, level of compatibility with proposals.",
        "created_at": "2024-08-15T09:56:26.883000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cvb271828\u003e My hope is that if we make a habit of L2s and wallets upgrading and improving on various key ERCs/EIPs, then compatibility with that ecosystem becomes its own reward",
        "created_at": "2024-08-15T09:57:56.635000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003celiastzr\u003e \u003e Right now L2s have more interest in distributing this value via airdrop/rewards (spring/summers/merits programms) to drag users and increase their TVL.\n\n\nNot sure, it’s worth it to analyze how much of blobs “rebate” L2s translated into fee reduction for users (most fees L2s dropped 10x after blobs)",
        "created_at": "2024-08-15T09:58:13.378000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdf0x9\u003e We've implemented CCIP-Read (3668) to enable ENS subnames on Linea. All open source in case folks want to check it out. Happy to answer any q's and help this get adopted further (re @vb271828: \u003e are you assuming that a specific L2 core contract exposes an endpoint on L1 to verify inclusion in its tree?\n\nRight. That is EIP-3668, it's something that I am trying to push to become a standard among L2s)",
        "created_at": "2024-08-15T16:03:07.906000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003celiastzr\u003e is the entry point located in the core contract of linea? (re @df0x9: We've implemented CCIP-Read (3668) to enable ENS subnames on Linea. All open source in case folks want to check it out. Happy to answer any q's and help this get adopted further)",
        "created_at": "2024-08-15T17:08:17.910000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdf0x9\u003e no direct tie (re @eliastzr: is the entry point located in the core contract of linea?)",
        "created_at": "2024-08-15T17:45:01.365000+00:00",
        "attachments": []
    }
]