[
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cIndistinguishible\u003e Has anyone already started thinking about standardizing the APIs for TEE attestations for L2 blocks? I understand that everyone does it slightly differently, but for the integration with various block explorers it would make sense to have at least some consistency across different APIs",
        "created_at": "2024-09-10T12:14:02.848000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cRenoRen79\u003e Hi, interesting topic !\n\nBy the way TEE attestations always use the same public key. We did not have a lot of success with our \"precomputations-powered'  verification for passkeys, because the required tx to amortize them is around 20. While uncertain for wallet, it is quickly amortized for TEE.\n\nOnce there, the cost of any curve verification with precomputation is 3 times lower than without (Daimo/FCL/SCL without prec). \n\nWhile EIP7212 not deployed on mainet, or for any other curve, do not hesitate to reach us for a large gas fee reduction (from 340/220 using Daimo/FCL).\n\n(We authored https://eprint.iacr.org/2023/939, https://github.com/rdubois-crypto/FreshCryptoLib, and https://github.com/get-smooth/crypto-lib, deployed by SoulWallet, Coinbase Smartwallet, etc). (re @Indistinguishible: Has anyone already started thinking about standardizing the APIs for TEE attestations for L2 blocks? I understand that everyone does it slightly differently, but for the integration with various block explorers it would make sense to have at least some consistency across different APIs)",
        "created_at": "2024-09-10T12:33:58.618000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cadietrichs\u003e RollCall #7 in ~18 hours:\n\nWe'll have some topics related to the planned future L1 Pectra hard fork, and then a section on L2 transaction standards.\n\n- Agenda: https://github.com/ethereum/pm/issues/1134\n- September 11, 14:00 UTC\n- Zoom link posted here just before the call",
        "created_at": "2024-09-10T19:58:15.776000+00:00",
        "attachments": null
    }
]