[
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003ctyneslol\u003e Maybe a better way to frame it is there is the OP Stack and then there is OP Mainnet. I'm very into the idea of the OP Stack including not L1 adopted EIPs given it doesn't result in a ton of technical debt. Reth ExEx is great for this. Adding not L1 adopted EIPs to OP Mainnet likely won't happen anytime soon given there are higher priorities like Stage 1 + 2. We are adopting RIP 7272 but the scope was small and it was already implemented (re @gakonst: How does OP Stack in general think of not-L1 adopted EIPs, for example EOF?)",
        "created_at": "2024-06-04T00:33:22.690000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cgakonst\u003e in practice would upstream OP Stack merge code that won't make it to OP Mainnet from a third party? Always using eof as the example of an EIP where people are saying \"L2 should innovate\" and I'm saying \"It won't unless L1 given their priorities\" (re @tyneslol: Maybe a better way to frame it is there is the OP Stack and then there is OP Mainnet. I'm very into the idea of the OP Stack including not L1 adopted EIPs given it doesn't result in a ton of technical debt. Reth ExEx is great for this. Adding not L1 adopted EIPs to OP Mainnet likely won't happen anytime soon given there are higher priorities like Stage 1 + 2. We are adopting RIP 7272 but the scope was small and it was already implemented)",
        "created_at": "2024-06-04T03:31:05.838000+00:00",
        "attachments": []
    },
    {
        "author": "daniellehrner",
        "category": "general",
        "parent": "",
        "content": "IMO one of the main problem with RIPs is that most (all?) tooling providers will only add support for EIPs that are on mainnet. Taking EOF as example, the Solidity team stated that it will only merge their EOF branch into main if it's added to mainnet.\n\nNot sure how support for 7272 will be added, if it's  done via a forked version of Solidity or simply by using assembly code. If a Solidity fork is used the EOF branch could be added as well. But that's a DX nightmare, because one would need different Solidity versions for mainnet and L2s.",
        "created_at": "2024-06-04T09:17:00.747000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cvb271828\u003e ok I see, so the problem is basically that the RIP process has still not come close to achieving its goal of legitimizing EVM-on-L2s to easily diverge from EVM on L1",
        "created_at": "2024-06-04T09:17:44.862000+00:00",
        "attachments": []
    },
    {
        "author": "daniellehrner",
        "category": "general",
        "parent": "",
        "content": "The wallet providers said the same for 3047 / 7702. If it's not on mainnet they will not allocate resources to work on it. Not sure how to overcome that. Right now it looks we have to wait until most activity is on L2s and mainnet becomes less important for user interactions, but this could take years...",
        "created_at": "2024-06-04T09:20:18.484000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003celiastzr\u003e i think it’s a hard task, since the strength of the ethereum ecosystem lies partially in its compatibility across environments and absence of fragmentation \nwe must be sure every RIP that increases fragmentation is “worth it” (re @vb271828: ok I see, so the problem is basically that the RIP process has still not come close to achieving its goal of legitimizing EVM-on-L2s to easily diverge from EVM on L1)",
        "created_at": "2024-06-04T09:20:21.893000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cvb271828\u003e Gas increases and precompiles feel like the easiest possible thing to allow to diverge",
        "created_at": "2024-06-04T09:21:00.410000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003celiastzr\u003e yes i agree (re @vb271828: Gas increases and precompiles feel like the easiest possible thing to allow to diverge)",
        "created_at": "2024-06-04T09:21:04.999000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cvb271828\u003e There are *way* more harmful instances of fragmentation that are already live, eg. some L2s having versions of account abstraction that are incompatible with 4337",
        "created_at": "2024-06-04T09:21:42.587000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003celiastzr\u003e erc, precompile, gas repricing, early adoption of eips",
        "created_at": "2024-06-04T09:21:54.059000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003celiastzr\u003e harder ones but interesting: new tx types because they require wallets to follow",
        "created_at": "2024-06-04T09:22:32.587000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cvb271828\u003e right",
        "created_at": "2024-06-04T09:23:10.135000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cvb271828\u003e https://eips.ethereum.org/EIPS/eip-7706 maybe",
        "created_at": "2024-06-04T09:23:22.897000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cvb271828\u003e Because right now L2s have big problems dealing with calldata pricing, and while this EIP originally had a different purpose, it's ideal for simplifying that whole situation",
        "created_at": "2024-06-04T09:23:47.501000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cvb271828\u003e like, if L1 adopts 7706, rollups would have to adopt a different version of 7706 anyway, because it doesn't make sense for them to have internal calldata pricing, they should just read and reuse the calldata pricing of L1",
        "created_at": "2024-06-04T09:24:31.509000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cvb271828\u003e So, 7212 was meant to be a testcase RIP, to get the wheels in motion on legitimizing L2s and ethereum having different standards",
        "created_at": "2024-06-04T09:25:18.098000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003celiastzr\u003e depends if they use state diffs no? (re @vb271828: like, if L1 adopts 7706, rollups would have to adopt a different version of 7706 anyway, because it doesn't make sense for them to have internal calldata pricing, they should just read and reuse the calldata pricing of L1)",
        "created_at": "2024-06-04T09:25:22.406000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cvb271828\u003e ah fair! though in that case you ultimately want a dimension for state read/write gas that tracks L1 😝 (re @eliastzr: depends if they use state diffs no?)",
        "created_at": "2024-06-04T09:25:55.962000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cvb271828\u003e So maybe it's worth exploring what has been failing there so far, and how we can fix that? (re @vb271828: So, 7212 was meant to be a testcase RIP, to get the wheels in motion on legitimizing L2s and ethereum having different standards)",
        "created_at": "2024-06-04T09:26:24.488000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cvb271828\u003e also, perhaps if we add hash precompile repricing, that creates more incentive for L2s to care?",
        "created_at": "2024-06-04T09:26:45.814000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cadietrichs\u003e my take: For now, RIPs are fundamentally blocked by missing L2 client support (as in, most L2s use geth, and geth has made it very clear that it will continue to exclusively target and support L1). We are exploring ways to unblock this, and will present them soon.\n\nIn the meantime, the only RIPs that can realistically be shipped are ones that have minimal implementation overhead, like 7212. But those are not enough to establish RIPs as a category to pay attention to, or some sort of \"common core\" L2 EVM (as in, L1 EVM extended by some common core set of RIPs) as worth targeting separately for tooling.\n\nI am not overly worried that tooling support would remain an issue once we start to enable more RIP shipping velocity. L2s by now have a substantial enough share of the overall Ethereum userbase to warrant such support.",
        "created_at": "2024-06-04T09:33:23.019000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cmratsim\u003e for legitimacy, you also need to track RIP impl state, for example for 7212 you need to hunt for announcements in social media / generic cryptonews and DAO votes. (re @adietrichs: my take: For now, RIPs are fundamentally blocked by missing L2 client support (as in, most L2s use geth, and geth has made it very clear that it will continue to exclusively target and support L1). We are exploring ways to unblock this, and will present them soon.\n\nIn the meantime, the only RIPs that can realistically be shipped are ones that have minimal implementation overhead, like 7212. But those are not enough to establish RIPs as a category to pay attention to, or some sort of \"common core\" L2 EVM (as in, L1 EVM extended by some common core set of RIPs) as worth targeting separately for tooling.\n\nI am not overly worried that tooling support would remain an issue once we start to enable more RIP shipping velocity. L2s by now have a substantial enough share of the overall Ethereum userbase to warrant such support.)",
        "created_at": "2024-06-04T09:35:25.167000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003celiastzr\u003e maybe ecosystem support for https://www.rollup.codes/\nand impeccable maintenance (re @mratsim: for legitimacy, you also need to track RIP impl state, for example for 7212 you need to hunt for announcements in social media / generic cryptonews and DAO votes.)",
        "created_at": "2024-06-04T09:48:16.402000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003celiastzr\u003e Another hardship we’ve experienced is the lack of easy integration with the global test suite:\n\n- simple example, adding RIP-7212 broke some EF executions test (which had EOAs or SCs at 0x100), we had to make a few changes on the ef tests repo \n- another example, gas pricing has ramifications in many tests (since gas opcodes are used in some tests as addition or compute inputs) \n\nsince ef tests runs in CI, adding a RIP that adds precompile or gas difference requires a modification in official test vectors;\nluckily this is becoming increasingly very easy thanks to EF effort (with python rewrite of test framework) (re @adietrichs: my take: For now, RIPs are fundamentally blocked by missing L2 client support (as in, most L2s use geth, and geth has made it very clear that it will continue to exclusively target and support L1). We are exploring ways to unblock this, and will present them soon.\n\nIn the meantime, the only RIPs that can realistically be shipped are ones that have minimal implementation overhead, like 7212. But those are not enough to establish RIPs as a category to pay attention to, or some sort of \"common core\" L2 EVM (as in, L1 EVM extended by some common core set of RIPs) as worth targeting separately for tooling.\n\nI am not overly worried that tooling support would remain an issue once we start to enable more RIP shipping velocity. L2s by now have a substantial enough share of the overall Ethereum userbase to warrant such support.)",
        "created_at": "2024-06-04T11:15:01.561000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cthegaram33\u003e I'm curious how Reth ExEx makes this easier. is it just that it provides a convenient framework for modifying/extending OP Stack? (re @tyneslol: Maybe a better way to frame it is there is the OP Stack and then there is OP Mainnet. I'm very into the idea of the OP Stack including not L1 adopted EIPs given it doesn't result in a ton of technical debt. Reth ExEx is great for this. Adding not L1 adopted EIPs to OP Mainnet likely won't happen anytime soon given there are higher priorities like Stage 1 + 2. We are adopting RIP 7272 but the scope was small and it was already implemented)",
        "created_at": "2024-06-04T12:02:20.537000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003ctyneslol\u003e Reth ExEx gives an API for building a full node where you can decorate it with new functionality. You import reth as a library and then can hook directly into things like the rpc to add new endpoints or the evm to add new precompiles/opcodes. The idea is to remove the need to maintain a fork of a client and instead maintain an ExEx (re @thegaram33: I'm curious how Reth ExEx makes this easier. is it just that it provides a convenient framework for modifying/extending OP Stack?)",
        "created_at": "2024-06-04T15:56:49.678000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003ctyneslol\u003e This is useful because it allows devs to experiment with new features without adding tech debt to the main codebase",
        "created_at": "2024-06-04T15:58:05.738000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cGregthegreek\u003e this is not as hard as most make it out to seem tbh (re @eliastzr: harder ones but interesting: new tx types because they require wallets to follow)",
        "created_at": "2024-06-04T18:19:46.412000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cGregthegreek\u003e wallet space is highly competitive and most teams are willing to prioritize getting an edge on everyon else.",
        "created_at": "2024-06-04T18:20:10.380000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cGregthegreek\u003e would be really nice to have non k based signatures expand the tx type space. Pretty low hanigng fruit for getting some wider compatibility of alternative signers and help push the AA roadmap along",
        "created_at": "2024-06-04T18:22:51.659000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003celiastzr\u003e fair, but you’ll need to change SDKs, frontend libraries, wallets, and a lot of test data?\n\nwhereas you can play around with it with 4337 (re @Gregthegreek: this is not as hard as most make it out to seem tbh)",
        "created_at": "2024-06-04T19:21:49.145000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003ctyneslol\u003e This is a tradeoff that takes on tech debt for growth (re @Gregthegreek: would be really nice to have non k based signatures expand the tx type space. Pretty low hanigng fruit for getting some wider compatibility of alternative signers and help push the AA roadmap along)",
        "created_at": "2024-06-04T19:33:34.610000+00:00",
        "attachments": []
    }
]