[
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cthegaram33\u003e probably the same issue: https://x.com/potuz_eth/status/1803885465445240901 (re @thegaram33: we've also noticed something weird about blob propagation. observed this after the spike, so blocks were not congested anymore, but we had a backlog of batches to commit to L1:\n\nwhen we sent multiple blob-carrying transactions to a geth node (the default limit is 16 txs / account), it seems that many of these were not propagated to the network. we've observed multiple times that either Etherscan didn't even pick up these transactions, or they were pending for a long time, even though fees were above market. blobs were only included after we replaced the transactions a few minutes later.\n\nI wonder if nodes implement certain heuristic to rate limit blobs from the same node or sender account? or maybe the p2p layer was congested? has anyone experienced this before?)",
        "created_at": "2024-06-21T12:55:14.679000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003chenrli\u003e hello everyone! Henri from Starknet foundation here 🙂",
        "created_at": "2024-06-21T14:21:23.431000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cEdFelten\u003e It looks like the market for blobspace was not being cleared efficiently at times yesterday. One of the takeaways is that the standard mempool is not a very efficient way for blob posters and builders to match up supply and demand for blobs.  During times of low demand this doesn't really matter, but when demand goes up, a better mechanism would help.",
        "created_at": "2024-06-21T16:13:17.768000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cgakonst\u003e + Matt who may have thoughts on txpool / blobs (re @EdFelten: It looks like the market for blobspace was not being cleared efficiently at times yesterday. One of the takeaways is that the standard mempool is not a very efficient way for blob posters and builders to match up supply and demand for blobs.  During times of low demand this doesn't really matter, but when demand goes up, a better mechanism would help.)",
        "created_at": "2024-06-21T16:19:24.524000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003crjected\u003e Question for rollup teams: does anyone have timestamps for when they submitted their blob txs, with hash + nonce?",
        "created_at": "2024-06-21T16:28:41.885000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003crjected\u003e Would be appreciative of that data, I'd like to see if there are connections with mempool policy and highlight potential improvements",
        "created_at": "2024-06-21T16:29:53.531000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cbertcmiller\u003e If you do have those timestamps, Flashbots runs an open source dataset of timestamped mempool data pulling from several high performance mempool sources: https://mempool-dumpster.flashbots.net/index.html\n\nWe can hopefully use this to understand how long it is taking blobs to propagate through the p2p layer and more precisely identify where the problems are with clearing demand for blobs.",
        "created_at": "2024-06-21T16:33:51.784000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cbertcmiller\u003e There are some mempool policy rules that might explain some of how the market cleared last night and we'd see that in the data hopefully",
        "created_at": "2024-06-21T16:35:25.067000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cEdFelten\u003e Here are two examples of issues that make clearing more difficult:\n\n1. A rollup needs to submit a transaction with a fixed number of blobs, but the best number to submit depends on what others are doing. For example it's most efficient to submit a 6-blob tx if others aren't posting. But if someone else posts a 1-blob tx with high tip, then our best strategy is to post a 5-blob tx, and so on.  The upshot is that there might not be txs in the mempool that add up to 6 blobs even if there is demand for 6 or more.\n\n2. Builders use tips to prioritize blob txs, but the tip is paid per L1 gas independent of the number of blobs. Different rollups consume different L1 gas amounts in their blob txs, so the tip-per-gas gets multiplied by different gas amounts. But builders seem not to account for these differences (which is understandable given the challenges in doing so). The result is that builders aren't maximizing their tips from blob txs, and rollups don't necessarily get placement by offering the highest actual tip payment. In fact this creates a disincentive for rollups to use blob space more efficiently. if doing so would require using a bit more L1 gas.",
        "created_at": "2024-06-21T16:50:12.887000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cbertcmiller\u003e \u003e Different rollups consume different L1 gas amounts in their blob txs, so the tip-per-gas gets multiplied by different gas amounts. But builders seem not to account for these differences.\n\nWhat do you mean? Each builder simulates transactions and sees how much the transaction pays, that accounts for any variations in gas price/gas usage because we can see the difference in the balance of the builder before and after the tx is simulated to figure out the total payment.",
        "created_at": "2024-06-21T17:29:27.636000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cEdFelten\u003e Based on the blocks being built yesterday, we believe that at least some builders were not maximizing their total tips over blob-carrying transactions.",
        "created_at": "2024-06-21T17:31:29.762000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cbertcmiller\u003e Do you have any timestamps you can share of when you were sending these transactions? Because the job of a builder is to maximize tips and a lot of work goes into that. So I'd be a bit surprised if the answer was \"builders aren't properly valuing blob transactions\" instead of \"builders aren't always seeing the best blob transactions\" or something else.",
        "created_at": "2024-06-21T17:33:20.622000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cadietrichs\u003e we were wondering about this when designing 4844, and decided that a separate blob fee dimension was not necessary. to the extent that some builders use per-gas tip for blob tx ordering, that seems like a temporary inefficiency in their logic only, right?\n\nwondering just if there is anything on the protocol level we could do (keeping the super long lead times for protocol changes in mind ofc) to improve the efficiency of the market here",
        "created_at": "2024-06-21T17:34:11.952000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cadietrichs\u003e for context, Dankrad and I a while ago had an EIP draft for always charging the tx tip (for any tx, not just 4844) based on gas limit, not actual gas used. would effectively turn the tip into a static field, but in a backward compatible way.\n\ndraft here: (re @adietrichs: we were wondering about this when designing 4844, and decided that a separate blob fee dimension was not necessary. to the extent that some builders use per-gas tip for blob tx ordering, that seems like a temporary inefficiency in their logic only, right?\n\nwondering just if there is anything on the protocol level we could do (keeping the super long lead times for protocol changes in mind ofc) to improve the efficiency of the market here)",
        "created_at": "2024-06-21T17:36:46.392000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cadietrichs\u003e https://notes.ethereum.org/@ansgar/execution-independent-priority-fee",
        "created_at": "2024-06-21T17:36:47.980000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cadietrichs\u003e would there be any value in exploring whether this could be a last minute addition to Pectra? my feeling is that by the time that hf goes live, builder logic will likely already be sophisticated enough to deal with execution-dependent tip levels anyway",
        "created_at": "2024-06-21T17:37:43.060000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cbertcmiller\u003e again, I'm pretty skeptical the problem is in how builders are valuing tips - the baseline for block builders for a long time has been to value txs based off the overall prio fee (e.g. the fee after simulating its execution top of block) they pay rather than just their gas price",
        "created_at": "2024-06-21T17:42:03.140000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cbertcmiller\u003e open to being wrong here but don’t want to collapse the space of where the problem could be to that just yet",
        "created_at": "2024-06-21T17:44:28.057000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cEdFelten\u003e Regardless, it's a problem that rollups have to guess how many blobs to offer in their next blob tx, and the results don't always allow full utilization.",
        "created_at": "2024-06-21T18:16:21.093000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cadietrichs\u003e this seems like a reasonable concern, but also made relevant mostly by two (short term) factors, right?\n\n- a large portion of builders rn seem to be categorically unwilling to include blobs. that's why a close-to-max utilization of blobs in the remaining blocks becomes important to retain full throughput\n- the low absolute throughput numbers (3/6) rn are in conflict with L2s' desire to batch multiple blobs for efficiency. this tension will ease as L1 blob throughput increases over time (re @EdFelten: Regardless, it's a problem that rollups have to guess how many blobs to offer in their next blob tx, and the results don't always allow full utilization.)",
        "created_at": "2024-06-21T18:22:34.845000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cadietrichs\u003e on the general point of builders not including blob txs sometimes, @nero_eth had a good analysis of the increased reorg risk posed by blobs last week:",
        "created_at": "2024-06-21T18:24:35.715000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cadietrichs\u003e https://ethresear.ch/t/blobs-reorgs-and-the-role-of-mev-boost/19783",
        "created_at": "2024-06-21T18:24:38.121000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cadietrichs\u003e I would like to understand the situation here better. in particular, it looks like only flashbots builder is categorically not including blob txs, but that some other builders are including them at a lower rate than would be expected. does that hint at them having special logic to account for the increased reorg risk? it would be great if we could make this more legible so that we can help the market clear efficiently. (re @adietrichs: https://ethresear.ch/t/blobs-reorgs-and-the-role-of-mev-boost/19783)",
        "created_at": "2024-06-21T18:27:01.467000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cEdFelten\u003e To see the problem, suppose rollup A has 6 blobs it wants to post, so it submits a 6-blob tx. But then rollup B submits a 1-blob tx with high tip.  Now only rollup B's tx will be included due to the higher tip--even though rollup A probably would have wanted to post 5 blobs.  So only 1 blob is included, and the blob price goes down despite the high demand.",
        "created_at": "2024-06-21T18:38:40.106000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cEdFelten\u003e The cause of this is not that builders are irrational somehow. It's because the mempool requires each submitter to submit a single tx with a single number of blobs, at the next nonce, so submitters have to guess how many blobs to attach--they can't say they want to post 6, but would take 5 if 6 isn't available, etc.",
        "created_at": "2024-06-21T18:49:23.892000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdrortirosh\u003e Why would you ever want to submit anything but a single blob per block? \n(Eg with calldata, did you ever submit more than one tx in a block?) (re @EdFelten: The cause of this is not that builders are irrational somehow. It's because the mempool requires each submitter to submit a single tx with a single number of blobs, at the next nonce, so submitters have to guess how many blobs to attach--they can't say they want to post 6, but would take 5 if 6 isn't available, etc.)",
        "created_at": "2024-06-21T21:33:49.039000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "It's way more efficient to submit as much data in a single tx as possible, so 6 blobs is the cheapest option if it gets included on chain reliably/fast enough.  If nothing else, for each transaction you pay 21k gas which is amortised over the number of blobs in each tx.",
        "created_at": "2024-06-21T22:52:00.443000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "One simple option here would be to restrict the maximum number of blobs per tx to 3. Then you guarantee you can fit at least two blob tx into each block.  You'd still have some inefficiency if someone posts a single blob tx as you'd likely wind  up with 4 in a block but that's better than currently where you typically wind up with just the 1 because you can't fix a 6 blob tx in. Of course that increases the cost a little for L2s as they can't amortise the tx cost as much.",
        "created_at": "2024-06-21T22:53:28.321000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "It also assumes that the problem is just one of packing and not things like efficient replication.  Ultimately the market will sort itself out because if 6 blob tx aren't getting included reliably L2s will naturally reduce the number of blobs to something that is more likely to fit (eg op-mainnet reduced to 5 blobs a little while back so that we could fit in alongside 1 blob transactions and didn't need to bump gas prices as often).",
        "created_at": "2024-06-21T22:55:21.562000+00:00",
        "attachments": null
    }
]