[
    {
        "author": "abcoathup",
        "category": "general",
        "parent": "",
        "content": "Does anyone have public summary/notes for RollCall #3?",
        "created_at": "2024-02-15T00:14:31.602000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cthegaram33\u003e - EIP-4844 readiness. zkSync reported they’ll roll out the feature on Sepolia this week and they’re soon ready for mainnet. Taiko has also started integration. Arbitrum has submitted the upgrade DAO proposal this week.\n- With 4844 comes the blob transaction mempool (aka blobpool), which is completely separate from the mempool for non-blob transactions. In geth’s implementation, if you already have a pending transaction in the txpool, you cannot submit a transaction into the blobpool (\"address already reserved\"). \u003c@266231791369715713\u003e reported that this causes challenges since they use the same sender account to submit batches (blob transaction) and validity proofs (normal transaction).\n- \u003c@459963806450450432\u003e mentioned that they have ongoing discussions with RPC providers about beacon chain RPC availability and support for archive blob, used for node syncing.\n- Reminder from @CarlBeek to use the correct version of the KZG trusted setup parameters (see link in the agenda).\n- Summary and feedback on breakout calls. Main feedback is that they're useful but could be less frequent. The next one will be in 2 weeks (28 Feb) about shared sequencing, led by \u003c@269786774660710400\u003e .\n- \u003c@880092147150389319\u003e presented RIP-7614, a new precompile RIP, proposed by OpenZeppelin, Forta, and other contributors. The goal is to expose the call stack to contracts, so that dapps can use libraries and on-chain oracles / detection engines to reject malicious transactions.\n- Some concerns raised: Are these mechanisms generally applicable, can they be circumvented? E.g. a freshly created contract could not have been flagged, and if it's created in tx1 and used in tx2 in the same block then we couldn't detect that it's a new contract. Other concerns are about added complexity and zk proving cost.\n- New RIP editor: @ulerdogan.",
        "created_at": "2024-02-15T09:12:48.214000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "I just listened to the recording now, \nre: Zach (sorry unsure which zach to tag here), you can only have txs in a blobpool or in the txpool. But nothing should stop you from lining up multiple blobs or txs, you just can't have tx \u0026 blobs from the same address at the same time on the same node. This behaviour is a long term choice afaik, so it can be assumed it'll behave this way long term. \n\nThe entire txpool/blobpool explanation (for geth, but most ELs are similar if not same): https://github.com/ethereum/go-ethereum/pull/26940",
        "created_at": "2024-02-15T10:24:56.350000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cthegaram33\u003e a simple solution (also discussed on the call) is to use separate sender accounts for commitment and finalization transactions. the former will operate in the blobpool, the latter in the txpool. Scroll already does this but I see that managing two accounts is less convenient.",
        "created_at": "2024-02-15T10:36:45.148000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003crbayardo\u003e Apologies for not making the RollCall sync this week. Wanted to share the OP Stack readiness for mainnet: the work is complete we are just awaiting governance approval to activate. If all goes well we'll activate on OP and Base mainnets on 3/18.   Sepolia fork will happen on Feb 21.  It's already live on our Goerli testnets. https://gov.optimism.io/t/upgrade-proposal-5-ecotone-network-upgrade/7669",
        "created_at": "2024-02-15T19:24:15.727000+00:00",
        "attachments": null
    }
]