[
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cCarlBeek\u003e EIP-2935 will modify `BLOCKHASH` to return historical block hashes. It has a buffer that needs to be (back)filled with historical hashes, and the easiest way for L1 clients to do so is to have `BLOCKHASH` return `0x00` for ~45 mins (256 blocks). I'm interested in hearing if this would break things for you and how badly?",
        "created_at": "2024-05-15T09:15:53.977000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003ctyneslol\u003e This design would require manual intervention during that timeframe to keep op stack withdrawals secure. The fault proof relies on a reliable blockhash opcode (re @CarlBeek: EIP-2935 will modify BLOCKHASH to return historical block hashes. It has a buffer that needs to be (back)filled with historical hashes, and the easiest way for L1 clients to do so is to have BLOCKHASH return 0x00 for ~45 mins (256 blocks). I'm interested in hearing if this would break things for you and how badly?)",
        "created_at": "2024-05-15T11:51:51.151000+00:00",
        "attachments": []
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "This is persuasive, so I doubt it (a window of broken BLOCKHASH) will happen now.",
        "created_at": "2024-05-15T11:56:36.973000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003clightclient\u003e sounds like clients pref now is to not modify blockhash to use the 2935 contract until verkle",
        "created_at": "2024-05-15T12:00:51.324000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cgakonst\u003e The blockhash opcode still behaves as before, it can lookback 256 blocks at Pectra.\n\nThe System Contract gets filled as the Pectra blocks get added to the chain, and the buffer is full 8192 blocks later.\n\nIf you want to access longer than 256 blocks in the last between Pectra and Osaka you use the contract.\n\nAt Osaka, the block hash opcodes start to route to the system contract. (re @tyneslol: This design would require manual intervention during that timeframe to keep op stack withdrawals secure. The fault proof relies on a reliable blockhash opcode)",
        "created_at": "2024-05-15T12:24:09.146000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cgakonst\u003e One idea is you do a fault proof upgrade once the buffer is filled to always use the system contract. \n\nIf you don't want to do an upgrade, you could also detect if the system contract 8192th item is non zero and transition to the post Osaka fault proof.\n\nAnother way to hack it could be to detect Osaka activation by checking the gas used of blockhash and make your contract route to the opcode or the system contract in between.",
        "created_at": "2024-05-15T12:26:38.307000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003ctyneslol\u003e Sounds like we could just do nothing and be fine, ty \u003c@486477492434239488\u003e for the explanation",
        "created_at": "2024-05-15T12:36:17.293000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cHighlander1969\u003e For those interested, the L2 Standards WG starts in 40 min (7 am PT) discussing the L2 Transaction Fee API spec PR and the article about account abstraction, key management across chains and self-sovereign identity. \n\nMeeting zoom link is here:\nhttps://us02web.zoom.us/j/81599021689?pwd=VmxPVUNCVmE5RkkweGY1YmN1OWMrZz09",
        "created_at": "2024-05-15T13:21:06.757000+00:00",
        "attachments": []
    }
]