[
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cdrjones1\u003e Hi all! Anyone thoughts on tx data vs state diff compression efficiency? \n\nhttps://x.com/jonastheis_/status/1882349755763986460",
        "created_at": "2025-01-23T09:48:51.473000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cHighlander1969\u003e @drjones1 the tweet talks about L2 costs per blob. The reason why there is no significant difference between, for example, era and linea, is because both post the tx call data to the blob. The same holds for optimistic rollups.\n\nThe primary difference between the rollups is what is still posted on the L1 and there the difference between e.g. starknet and a zk rollup is the proof size kb vs bytes (re @drjones1: Hi all! Anyone thoughts on tx data vs state diff compression efficiency? \n\nhttps://x.com/jonastheis_/status/1882349755763986460)",
        "created_at": "2025-01-23T15:21:20.177000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cthegaram33\u003e zksync era posts state diffs, not transaction data.",
        "created_at": "2025-01-23T15:38:20.391000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cthegaram33\u003e the avg cost associated with proof size and verification cost can be reduced very effectively by proof aggregation. the same does not apply to DA costs, there's a limit to how well you can compress tx data.",
        "created_at": "2025-01-23T15:38:23.454000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cHighlander1969\u003e Proof aggregation and recursion is already done by the zk-rollups. All except starknet post zk-snarks where the primary difference on the snark side is the number and size of public inputs. Snarks are by definition succinct aka small aka a few hundred bytes. Starknet also uses proof aggregation but of starks and the final starkproof is about vs bytes. FYI all rollups use starks because of proof generation costs, and then most wrap the final stark proof into a snark. (re @thegaram33: the avg cost associated with proof size and verification cost can be reduced very effectively by proof aggregation. the same does not apply to DA costs, there's a limit to how well you can compress tx data.)",
        "created_at": "2025-01-23T16:04:55.813000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cthegaram33\u003e yeah. my point is that you can reduce on-chain proof verification cost by aggregating multiple proofs into a single proof (most zk rollups already do this).\n\nthat's why there's more concern about DA cost (as opposed to finalization costs) as blobs are getting more expensive.\n\nand, as @drjones1 is pointing out, DA for state diff rollups is supposed to be cheaper than DA for transaction data rollups. but of course this also depends on the tx state access pattern, aggregation window, how they encode state diffs, etc.",
        "created_at": "2025-01-23T16:44:26.824000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003celiastzr\u003e i would argue that we need more validiums, for most chains having alternative DA is good enough",
        "created_at": "2025-01-23T17:18:14.811000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "general",
        "parent": "",
        "content": "\u003cHighlander1969\u003e Verifiably correct, and available with enough economic security guarantees. Remember, you can sue the DTCC if they screw up ... but not ... (re @eliastzr: i would argue that we need more validiums, for most chains having alternative DA is good enough)",
        "created_at": "2025-01-23T17:49:04.020000+00:00",
        "attachments": []
    }
]