[
  {
    "author": "marcinbugaj_94168",
    "category": "Execution Layer",
    "parent": "l1-zkevm",
    "content": "Cranelift as alternative backend for WASM compilation",
    "created_at": "2026-02-04T14:53:42.168000+00:00",
    "attachments": []
  },
  {
    "author": "marcinbugaj_94168",
    "category": "Execution Layer",
    "parent": "l1-zkevm",
    "content": "I've been looking into WebAssembly compilation options for our bare-metal RISC-V64IM platform and had an idea that might align with our push for tool diversity and security.\n\n**Quick background on the landscape**\n\nFor compiling WASM to bare-metal RISC-V, the main options are:\n\n- **WAMR (WebAssembly Micro Runtime)** - Uses LLVM for AOT compilation, has bare-metal support. This is what we're using now.\n- **Wasmtime/Wasmer** - Use Cranelift as backend but target operating systems, not bare-metal platforms.\n\n**The idea: Add Cranelift alongside LLVM**\n\nIt occurred to me that we could build a Cranelift-based compilation pipeline alongside our existing WAMR setup. This would let us compile the same WebAssembly with two completely independent compilers and compare the results before acting on them.\n\nThis feels like it fits well with the company's drive for diversifying our toolchain and improving security - we'd be able to catch compiler bugs, detect potential compromises, and have more confidence in correctness.\n\nCranelift is designed to be used as a library for exactly this kind of thing, so using it for bare-metal targets isn't fighting against its design.",
    "created_at": "2026-02-04T14:56:57.507000+00:00",
    "attachments": []
  },
  {
    "author": "marcinbugaj_94168",
    "category": "Execution Layer",
    "parent": "l1-zkevm",
    "content": "**What it would take**\n\nThis would be a fair amount of work:\n\n1. **Adapt WebAssembly → Cranelift translation** - Wasmtime already does this, we'd need to adapt it for bare-metal\n2. **Build the runtime environment** - Memory management, function tables, imports/exports, stack handling\n3. **Configure for RV64IM** - Set up Cranelift for our specific instruction set\n4. **Integration** - Run both versions and compare outputs\n\nSince we assume that WASM files are audited and from trusted vendors, we can skip a lot of the complexity, e.g. no need for trap handling (bounds checks, division-by-zero checks, etc.) since audited code won't hit these cases (hopefully)\n\n**Performance-wise**\n\nLLVM would stay our primary compiler (better performance). Cranelift would be the validation path - we run both, compare results, and only proceed when they match.\n\n**Just an idea**\n\nAnyway, this seemed like an interesting direction that fits with what we're trying to do as a company. Wanted to get your take on it - does this seem worth exploring further, or should we stick with what we have?",
    "created_at": "2026-02-04T14:56:59.644000+00:00",
    "attachments": []
  },
  {
    "author": "kevaundray",
    "category": "Execution Layer",
    "parent": "l1-zkevm",
    "content": "I think this was discussed also with <@381789485777682434> a while back and I think it makes sense if we have more than one language that has llvm as a backend",
    "created_at": "2026-02-04T14:58:25.077000+00:00",
    "attachments": []
  },
  {
    "author": "marcinbugaj_94168",
    "category": "Execution Layer",
    "parent": "l1-zkevm",
    "content": "Well, that idea applies only to languages that (can) go through WASM as an intermediate step in the compilation pipline",
    "created_at": "2026-02-04T14:59:44.501000+00:00",
    "attachments": []
  },
  {
    "author": "marcinbugaj_94168",
    "category": "Execution Layer",
    "parent": "l1-zkevm",
    "content": "That applies to most languages of interest: C/C++/Rust/Go/C# afaik although an intermediate WASM step introduces significant (3-4x) overhead as compare to direct \"native\" compilation (language -> target platform)",
    "created_at": "2026-02-04T15:01:45.953000+00:00",
    "attachments": []
  },
  {
    "author": "marcinbugaj_94168",
    "category": "Execution Layer",
    "parent": "l1-zkevm",
    "content": "<@427491045308235776> , shall we discuss this idea and potentially/eventually put on the roadmap? It's actually a good time to do that after the experiments in `wasrisc` repository",
    "created_at": "2026-02-04T15:04:02.175000+00:00",
    "attachments": []
  }
]