[
    {
        "author": "kevaundray",
        "category": "Execution Layer",
        "parent": "",
        "content": "Testing",
        "created_at": "2025-06-02T20:59:35.554000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003ckevaundray\u003e testing",
        "created_at": "2025-06-02T20:59:58.048000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003ccorcoranwill\u003e 👋",
        "created_at": "2025-06-02T21:03:06.611000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003ckevaundray\u003e Hello, \n\nPosting a summary of some of the sub-projects we have been working on and their statuses here: https://hackmd.io/@kevaundray/BymXlcsfgx for those that have not been following github",
        "created_at": "2025-06-02T21:10:16.150000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003ckevaundray\u003e On standardization, one thing we are currently thinking about are the precompiles and how we can start to at least, have a standardized set that we agree is useful.\n\nCurrent proposal is for us to have one github org, that initially contains all of the precompiles/libraries being used. \n\nThis org would be maintained by the zkEVM team at the EF and when benchmarking, we would use this repository as the source of truth.\n\nOver time, I'd expect that we want to decrease the number of different libraries that perform the same functionality, for example risc0 uses tiny-keccak while sp1 uses sha3-keccak. \n\nAnd also experiment with ways to decrease the number of syscalls, for example, what is the impact on prover performance if we had a bigint syscall instead of a syscall for each elliptic curve.\n\n@jbruestle @pumatheuma @yisun @moodlezoup and of course others, it would be great to get your opinions on this proposal",
        "created_at": "2025-06-02T21:11:01.060000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003ckevaundray\u003e A different and better proposal which was proposed by @jbruestle was to upstream some of these changes into the respective repositories, however RustCrypto maintainers noted that they would only accept pure rust code and would like to only support Tier 1 targets. \n\nSince this is the library that is patched the most, we went with the proposal above instead",
        "created_at": "2025-06-02T21:15:42.049000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003cjbruestle\u003e Definitely excited on anything that makes cross zkVM interoperability easier for users.  As \u003c@427491045308235776\u003e mentioned, longer term I'd very much like to see more efforts on deeper standardization, as well as pushing precompile patches upstream.  That said given the disinterest by some upstream libs in providing  support for non Tier 1 platforms (which rules out even rv64gc, much less zkVM platforms), I think looking at doing something simpler near term is the right approach.  A way to allow users to use the same patches across zkVMs and have the patches then use feature flags or platform information to appropriately call the right acceleration on the zkVM side seems like a good intermediate step.  In general though, open to consideration of multiple approaches.",
        "created_at": "2025-06-02T21:40:17.787000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003cjbruestle\u003e Regardless, I think as the use of RISC-V zkVMs seems to be expanding, some coordination to make things easier on users at a technical level is good for everyone.",
        "created_at": "2025-06-02T21:41:05.269000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003cgakonst\u003e Super bullish zkboost",
        "created_at": "2025-06-02T22:25:22.777000+00:00",
        "attachments": null
    }
]