[
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "There are a number of reasons to consider a bridge. The most compelling is to satisfy users demand. The obvious reason to delay or not do one at all is to keep 2.0 development unencumbered and moving along quickly",
        "created_at": "2019-10-22T13:03:41.756000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "As mentioned in \u003c#598292067260825641\u003e, having a bridge on the roadmap along with the ability to carry out transfers would, combined, give a strong basis for arguing that the asset is the same and just being used for different purposes.\n\nSo it's more a question of enabling transfers in phase 0 and giving a statement of intent than slowing down development.",
        "created_at": "2019-10-22T13:08:31.317000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "I'm pretty sure that having liquidity but not fungibility would certainly lead to two tokens being traded regardless of intent. Beyond that, maybe you could try to legally argue they are the same because they will eventually be the same, but I am unsure of the actual consequences here",
        "created_at": "2019-10-22T13:18:05.854000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "You could argue that they are the same, and the current lack of trading between chains is case of \"not yet running\".",
        "created_at": "2019-10-22T13:20:05.225000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I suspect that arbitrage would balance out the price differences between the \"value of Ether\" on the two different chains",
        "created_at": "2019-10-22T13:20:47.453000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "But either way, if we can put in place a system that gives people a fighting chance of making Ether on the two chains legally the same in whatever jurisdiction they live in it's better than the alternative",
        "created_at": "2019-10-22T13:21:51.604000+00:00",
        "attachments": null
    },
    {
        "author": "kiwi.eth",
        "category": "general",
        "parent": "",
        "content": "You can also argue that BETH has more risk associated with it than eth",
        "created_at": "2019-10-22T13:21:52.421000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "\u003c@!118185622543269890\u003e not sure that's relevant.  I could build a smart contract that took your ETH and gave you a 50/50 chance of getting back 0 or 150%.  It would still be ETH",
        "created_at": "2019-10-22T13:22:51.427000+00:00",
        "attachments": null
    },
    {
        "author": "kiwi.eth",
        "category": "general",
        "parent": "",
        "content": "You're expecting people to hold Beth at the same value that ETH is held?",
        "created_at": "2019-10-22T13:23:21.835000+00:00",
        "attachments": null
    },
    {
        "author": "kiwi.eth",
        "category": "general",
        "parent": "",
        "content": "If there is a bridge, that is",
        "created_at": "2019-10-22T13:23:32.002000+00:00",
        "attachments": null
    },
    {
        "author": "cdetrio",
        "category": "general",
        "parent": "",
        "content": "Let's be more specific when talking about a \"bridge\".  The past few weeks there's been all this discussion about a protocol-layer two-way bridge between ETH and bETH (because users want it - like they want faster horses, and lawyers recommend it).   But consider an application-layer bridge as well, which provides effective two-way convertibility and lets eth2 develop unencumbered",
        "created_at": "2019-10-22T13:24:06.732000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "\u003c@256103085099712512\u003e think I replied to that in \u003c#598292067260825641\u003e",
        "created_at": "2019-10-22T13:25:08.883000+00:00",
        "attachments": null
    },
    {
        "author": "cdetrio",
        "category": "general",
        "parent": "",
        "content": "yes, but there is a more interesting discussion to be had than developers speculating on how lawyers and tax authorities might perceive an application-layer bridge vs a protocol-layer bridge",
        "created_at": "2019-10-22T13:27:38.773000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "\u003c@!118185622543269890\u003e perhaps I misunderstood but if the concept is for Ether on main net and Ether on Ethereum 2 to ultimately be fungible then the value should be retained in a 1:1 fashion with bridges available both ways (perhaps immediately, perhaps in the future).\n\nIf the prices diverge and *then* the fungibility comes in that would be a bit of a mess, no?",
        "created_at": "2019-10-22T13:28:00.614000+00:00",
        "attachments": null
    },
    {
        "author": "alex.eth",
        "category": "general",
        "parent": "",
        "content": "Cryptoeconomics involves more than just developers/development.  Assuming developers should only focus on development is shortsighted if that's what's being implied.  I agree discussion in general may not apply to everyone, though, so keeping in off-topic makes sense.  I appreciate the discussion, and realize the need for different people to focus on different areas.  Flat up ignoring potential economic impacts doesn't make sense to me, though.",
        "created_at": "2019-10-22T13:31:18.497000+00:00",
        "attachments": null
    },
    {
        "author": "cdetrio",
        "category": "general",
        "parent": "",
        "content": "on second thought, an application layer bridge would basically be a DEX for exchanging ETH and bETH.  So not true fungibility..",
        "created_at": "2019-10-22T13:33:30.739000+00:00",
        "attachments": null
    },
    {
        "author": "kiwi.eth",
        "category": "general",
        "parent": "",
        "content": "The sound of trying to force Beth into being the same value as eth doesn't sound very welcoming IMO",
        "created_at": "2019-10-22T13:33:40.132000+00:00",
        "attachments": null
    },
    {
        "author": "kiwi.eth",
        "category": "general",
        "parent": "",
        "content": "There's a lot going on economically wise",
        "created_at": "2019-10-22T13:34:00.294000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "And yet there is a hard-coded 1:1 bridge going from main net to the beacon chain...",
        "created_at": "2019-10-22T13:34:26.316000+00:00",
        "attachments": null
    },
    {
        "author": "kiwi.eth",
        "category": "general",
        "parent": "",
        "content": "What about new supply thats minted into eth1 from the eth2 chain?",
        "created_at": "2019-10-22T13:34:29.785000+00:00",
        "attachments": null
    },
    {
        "author": "kiwi.eth",
        "category": "general",
        "parent": "",
        "content": "Is that the same as newly minted eth?",
        "created_at": "2019-10-22T13:34:42.697000+00:00",
        "attachments": null
    },
    {
        "author": "kiwi.eth",
        "category": "general",
        "parent": "",
        "content": "People will consider them to be different things, they won't be trading under the same ticker, if trading at all",
        "created_at": "2019-10-22T13:35:21.017000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Why should the be considered different, though?",
        "created_at": "2019-10-22T13:35:53.465000+00:00",
        "attachments": null
    },
    {
        "author": "kiwi.eth",
        "category": "general",
        "parent": "",
        "content": "I'm speaking from a trader standpoint",
        "created_at": "2019-10-22T13:35:57.736000+00:00",
        "attachments": null
    },
    {
        "author": "kiwi.eth",
        "category": "general",
        "parent": "",
        "content": "Technologically they're the same if there is a bridge back and forth, but if exchanges were to list Beth that would change things",
        "created_at": "2019-10-22T13:36:33.775000+00:00",
        "attachments": null
    },
    {
        "author": "kiwi.eth",
        "category": "general",
        "parent": "",
        "content": "I think if it's possible to avoid beth being a traded asset while there being a two way bridge, that would be the best route",
        "created_at": "2019-10-22T13:37:28.690000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "But if they could be traded back and forth then arbitrage, either across chain or in exchange, would keep them in line.  At which point, why bother having a separate listing?",
        "created_at": "2019-10-22T13:37:32.650000+00:00",
        "attachments": null
    },
    {
        "author": "kiwi.eth",
        "category": "general",
        "parent": "",
        "content": "The bridge would need to be seamless then if so",
        "created_at": "2019-10-22T13:38:19.362000+00:00",
        "attachments": null
    },
    {
        "author": "kiwi.eth",
        "category": "general",
        "parent": "",
        "content": "And we would need to make sure Beth isn't traded",
        "created_at": "2019-10-22T13:38:37.004000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I don't think it has to be immediate, or painless.  But as long as it is functional then Ether would continue to be treated as a single asset regardless of where it happens to reside",
        "created_at": "2019-10-22T13:39:09.595000+00:00",
        "attachments": null
    },
    {
        "author": "kiwi.eth",
        "category": "general",
        "parent": "",
        "content": "It does add a lot of complexity though",
        "created_at": "2019-10-22T13:39:10.245000+00:00",
        "attachments": null
    },
    {
        "author": "kiwi.eth",
        "category": "general",
        "parent": "",
        "content": "That would be much simpler after the migration",
        "created_at": "2019-10-22T13:39:16.717000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Absolutely agree that a two-way bridge is not the simplest of things.  Which is where I come back to the idea that the main net to beacon chain bridge is in place first, transfers in along with the launch of the beacon chain, and the beacon chain to main net bridge comes \"later\"",
        "created_at": "2019-10-22T13:40:32.146000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Gets us most of the way there, with enough weight behind it that it gives people a fighting chance to argue their case with whatever jurisdictions they live in that staking Ether is not a taxable event, and we remove one of the barriers to people staking their Ether",
        "created_at": "2019-10-22T13:42:21.525000+00:00",
        "attachments": null
    },
    {
        "author": "cdetrio",
        "category": "general",
        "parent": "",
        "content": "is it a taxable event when you convert ETH to ponzi3DWrappedETH and then convert back to ETH?",
        "created_at": "2019-10-22T13:44:32.127000+00:00",
        "attachments": null
    },
    {
        "author": "cdetrio",
        "category": "general",
        "parent": "",
        "content": "does it make a difference if ponzi3D has the logic in EVM at L1 or in state channels at L2 or if it's a sidechain? The armchair legal discussion quickly becomes ridiculous",
        "created_at": "2019-10-22T13:51:31.399000+00:00",
        "attachments": null
    },
    {
        "author": "cdetrio",
        "category": "general",
        "parent": "",
        "content": "In any case, I'd bet at pretty high odds that any eth1 HF adding a two-way ETH conversion gadget in the protocol-layer, will be controversial and result in a chain split (ETH1x and ETH2).  So rushing a bridge could result in two tokens anyway (opposite of the intended effect)",
        "created_at": "2019-10-22T13:56:27.209000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "\u003c@256103085099712512\u003e the point is not to attempt to cover all possible bases.  The point is to build a structure from which can be argued that the process of staking via the deposit contract does not involve trading one asset for another.",
        "created_at": "2019-10-22T14:08:05.796000+00:00",
        "attachments": null
    },
    {
        "author": "kiwi.eth",
        "category": "general",
        "parent": "",
        "content": "Yeah rushing it doesn't seem very nice honestly when itll be considerably seamless with no extra work in the future",
        "created_at": "2019-10-22T14:10:39.952000+00:00",
        "attachments": null
    },
    {
        "author": "cdetrio",
        "category": "general",
        "parent": "",
        "content": "devcon3: we're gonna launch shards using a shard manager contract on eth1. Coming soon!\n\ndevcon4:  building on eth1 is a pita, we're going to a launch a new PoS chain: eth2.  two-way convertibility between eth1 and eth2 is too complex and messy. It will be simpler if everyone does a one-way burn of all their ETH to migrate over to eth2\n\ndevcon5: ok ok, if you insist, here's how a two-way bridge would look. This will provide liquidity and fungibility, unifying eth1 and eth2 into the \"one true ETH\"\n\ndevcon6: it turns out a two-way bridge is controversial and will likely split ETH into ETH1x and ETH2.",
        "created_at": "2019-10-22T14:34:36.897000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Any evidence for a two-way bridge being controversial?\n\nAnd anyway, that would be better than:\n\ndevcon6: we built it but no-one is using it.  Who knew?",
        "created_at": "2019-10-22T14:37:58.551000+00:00",
        "attachments": null
    },
    {
        "author": "cdetrio",
        "category": "general",
        "parent": "",
        "content": "I think we'll start seeing more appreciation for soft forks soon..",
        "created_at": "2019-10-22T14:39:09.429000+00:00",
        "attachments": null
    },
    {
        "author": "cdetrio",
        "category": "general",
        "parent": "",
        "content": "ProgPow on eth1 is technically trivial, but socially controversial.  An HF on eth1 to add a 2-way bridge to eth2 is both technically controversial (high risk, complicated integration of two completely separate systems;  it's hard to imagine a 2-way bridge making it through AllCoreDevs any time soon).  And it's socially controversial (the stakes for PoW vs PoS are much greater than Ethash vs Progpow).",
        "created_at": "2019-10-22T14:49:31.844000+00:00",
        "attachments": null
    },
    {
        "author": "cdetrio",
        "category": "general",
        "parent": "",
        "content": "Talking about a protocol-layer bridge (requiring an eth1 HF) is lip service to calm people down. it's not realistic (on the timeline people are expecting) imho",
        "created_at": "2019-10-22T14:55:54.197000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Well the story to date that I have seen has been that Ether is the same underlying asset for both Ethereum 1 and Ethereum 2.  Furthermore, at the point that Ethereum 1 becomes an EE in Ethereum 2 Ether will be fungible regardless of it it moved over to Ethereum 2 via the deposit contract or the EE state shift.  If this happens then being separate currencies before that point would cause serious upset to the community as one version of Ether would lose value compared to the other.\n\nI'm not saying that we must have a two-way bridge; I understand the difficulties involved.  But if we want people to stake Ether it has to be as easy as possible, and doing as much as we can to support the \"its all Ether\" argument on the technical side is important.  And progress towards a two-way bridge, both theoretical and practical, can only help.",
        "created_at": "2019-10-22T14:57:27.973000+00:00",
        "attachments": null
    },
    {
        "author": "cdetrio",
        "category": "general",
        "parent": "",
        "content": "fair enough. I suppose I'm a bit biased here, being a big switchover proponent.  A switchover HF would be much cleaner than a 2-way bridge, imo. And I don't think a 2-way bridge would happen any sooner.   hmmm... the \"bridge versus switchover\" debate is beginning to feel a bit like \"ProgPow vs PoS\" hehe",
        "created_at": "2019-10-22T15:03:51.915000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "If we end up in a situation where the two-way bridge is abandoned because the switchover HF occurs that's fine; it's more about direction of travel being clearly \"it's all Ether\" rather than talking about ETH Vs. bETH or whatever",
        "created_at": "2019-10-22T15:07:38.975000+00:00",
        "attachments": null
    }
]