[
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "In sufficiently large groups random sets of people equal out each other's lack of knowledge. Additionally, large groups also tend to be the most reflective of all views",
        "created_at": "2020-09-26T03:46:37.680000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "If you were to say, stagger the voting date for all participants randomly and then just tell them to research it themselves if they want, you'll likely get non-biased results",
        "created_at": "2020-09-26T03:47:12.299000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "If you randomly select you would get views from all lines of spectrums and if it's set up properly that's the maximum representation of democracy without relying on ring-leaders, node owners, etc. which all would introduce bias into the system",
        "created_at": "2020-09-26T03:48:30.658000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "this would be used, for example, in deciding whether a hard fork is done",
        "created_at": "2020-09-26T03:48:59.144000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "and you could make it fully on-chain / no one knows the results until they're annouced",
        "created_at": "2020-09-26T03:49:28.124000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "preventing manipulation",
        "created_at": "2020-09-26T03:49:33.419000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003c@104006934562107392\u003e I think you may be overestimating people's ability to resist influence.",
        "created_at": "2020-09-26T03:54:33.538000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "You can look at most modern democracies to see how easy it is to influence voters.",
        "created_at": "2020-09-26T03:54:58.196000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "It also far more easy to influence the actual voters (politicians) with greed",
        "created_at": "2020-09-26T03:55:24.349000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "so at the end of the day, you're far more likely to reach an acceptably fair system if you put the power in the hand of random people",
        "created_at": "2020-09-26T03:56:00.021000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "by acceptably fair I mean that the people invovled in the democracy think it's fair",
        "created_at": "2020-09-26T03:56:14.625000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003e so at the end of the day, you're far more likely to reach an acceptably fair system if you put the power in the hand of random people\nAh, we disagree here then.  🙂 \nExperts in a field are sufficiently harder to influence within that field than laymen in a field.",
        "created_at": "2020-09-26T03:58:00.695000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "also, the discussion of governance is a catch 22 in that we the people are easily influenced and yet we are also the most dependent on the system. But you'll reach the most fair if you make it a lot of work to influence the vote of every person in expectation that any one person could be a voter",
        "created_at": "2020-09-26T03:58:02.432000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e sounds like exactly what an expert in the field would say 😉 mostly joking, but it would depend on the specific topic I suppose",
        "created_at": "2020-09-26T03:59:19.056000+00:00",
        "attachments": null
    },
    {
        "author": "brent.allsop",
        "category": "general",
        "parent": "",
        "content": "Time and time again, people have implemented voting “on chain”  The once great but now failed (or subsumed by EOS) Bitshares is a good example.  Even when everyone can vote, not nearly enough people take the initiative to make the vote legitimate.  Limiting this further, by only allowing a random subset of the group to vote, would only make this situation worse.  To say nothing of the fact that you’d likely lose the one first expert who knows how to save society.  Any system must be able to work, even if only a few people are willing to get involved.  You need to know what everyone wants, concisely and quantitatively, with no compromise and no censoring of anyone.\n\nAnd there must be “experts” people trust. (i.e. influencers)  Not everyone can be an expert on everything.  With canonizer, we have infinite, real time delegation, different for each topic.  My kids delegate to me, I delegate to my friend who knows more than I do on a particular issue, who delegates to someone he knows is the words greatest expert, on that ONE issue.  (i.e. checks and balances built in because every topic has a unique expertise tree)  Then, when an expert to whom 70% of the population has delegated their vote to jumps camps, the entire organization can change, instantly, on a dime, easily outperforming any singular hierarchical organization at large scale.\n\nAnd, since it is real time.  If that guy screws up, everyone can instantly delegate their vote to someone else.",
        "created_at": "2020-09-26T04:05:52.802000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "this assumes that those whom would normally take the initiative are spread out perfectly evenly. It also ignores that people given a feeling of importance (by being the 0.03% chosen to participate) are far more likely to be involved than those not. To maintain a feeling of involvement throughout the whole system, it would merely require more frequent decisions to be taken by the people. In this case, if you know nothing and are given the oppurtunity the vote and want to do so, then you are likely to research the topic and get a much more broad view of the problem. Including the claims of a super hero expert. In other words, the influencers ability to influence the vote is still intact but more distant to avoid direct manipulation.",
        "created_at": "2020-09-26T04:11:51.153000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "additionally, a system like this which is based on general participation in the network would encourage more participation in general, growing the network, growing the pool, growing the validity of the democracy.",
        "created_at": "2020-09-26T04:12:43.353000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "I would argue that most regular people don't participate in democracy not because they don't care but because we have a system that tells them their vote doesn't matter",
        "created_at": "2020-09-26T04:13:27.030000+00:00",
        "attachments": null
    },
    {
        "author": "brent.allsop",
        "category": "general",
        "parent": "",
        "content": "\u003e It also ignores that people given a feeling of importance (by being the 0.03% chosen to participate) are far more likely to be involved than those not.\n\u003c@!104006934562107392\u003e",
        "created_at": "2020-09-26T04:13:39.323000+00:00",
        "attachments": null
    },
    {
        "author": "brent.allsop",
        "category": "general",
        "parent": "",
        "content": "No, you don’t measure the “popular” consensus because it is right, you measure that because you know that is what needs to change.  You compare that to the “expert” consensus.",
        "created_at": "2020-09-26T04:14:23.100000+00:00",
        "attachments": null
    },
    {
        "author": "brent.allsop",
        "category": "general",
        "parent": "",
        "content": "and so on.",
        "created_at": "2020-09-26T04:14:42.113000+00:00",
        "attachments": null
    },
    {
        "author": "brent.allsop",
        "category": "general",
        "parent": "",
        "content": "amplifying the wisdom of the crowd, by building and tracking consensus.  That which you measure, improves.",
        "created_at": "2020-09-26T04:15:40.847000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "but who's wisdom?",
        "created_at": "2020-09-26T04:16:01.425000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "it opens the road for manipulation",
        "created_at": "2020-09-26T04:16:08.421000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "I don't have much more to really support my point, but I think it would be an interesting thing to investigate",
        "created_at": "2020-09-26T04:16:46.593000+00:00",
        "attachments": null
    },
    {
        "author": "brent.allsop",
        "category": "general",
        "parent": "",
        "content": "Yes, investigation is good.\nAs far as “who’s wisdom?”  You have multiple canonizer algorithms that select only the experts a particular group of people trust.  So, the ProgPow supporters would ‘canonize’ things their way, and anti people could use a different canonizer algorithm.  Then when you want to get a camp ‘on board’ you use their canonizer algorithm, and their experts, all from their point of view, using their terminology, and so on.",
        "created_at": "2020-09-26T04:20:16.705000+00:00",
        "attachments": null
    },
    {
        "author": "brent.allsop",
        "category": "general",
        "parent": "",
        "content": "And you measure if your arguments are working, by how many people they convert, and so on.",
        "created_at": "2020-09-26T04:21:02.314000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003c@396163506757435403\u003e How does it handle multiple groups that support the same end goal but disagree on the reasoning?",
        "created_at": "2020-09-26T04:21:18.253000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Potentially, to the point of not wanting to be associated.",
        "created_at": "2020-09-26T04:21:31.011000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Like anti-mask people who believe masks are ineffective vs anti-mask people who believe masks are a government conspiracy to mind control us all.",
        "created_at": "2020-09-26T04:22:10.901000+00:00",
        "attachments": null
    },
    {
        "author": "brent.allsop",
        "category": "general",
        "parent": "",
        "content": "That’s the beauty of the hierarchical camp structure that keeps the focus on what people agree on.  You focus on what everyone agrees on, in the supper camp.  Then you push any of the always less important disagreeable stuff, out of the way of consensus, into competing, yet supporting the consensus sub camps.",
        "created_at": "2020-09-26T04:23:04.243000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "it's not working well in america",
        "created_at": "2020-09-26T04:29:51.611000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "where we have two parties that no one likes",
        "created_at": "2020-09-26T04:30:00.462000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "and yet no other party can make a dent",
        "created_at": "2020-09-26T04:30:05.444000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "That is a problem with first-across-the-line voting mostly I believe, but this is rapidly ranging far from Ethereum R\u0026D.",
        "created_at": "2020-09-26T04:31:03.542000+00:00",
        "attachments": null
    },
    {
        "author": "brent.allsop",
        "category": "general",
        "parent": "",
        "content": "The United Utah party is exploding in Utah.\nhttps://www.unitedutah.org/\nInstead of people asking what the party’s platform is, it asks you what you want the platform to be.  https://canonizer.com/topic/208-Governmental-Priorities/1\nAnd everyone uses the same topic, they just either use a republican or democratic or UUP... canonizer algorithm.",
        "created_at": "2020-09-26T04:34:04.417000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "Fair enough \u003c@!301186049323958275\u003e , thanks for the nudge. For later with more evidence!",
        "created_at": "2020-09-26T04:34:57.547000+00:00",
        "attachments": null
    }
]