[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This isn't an appropriate server for this kind of content.  If you have a line of research you are interested in pursuing, posting relevant images is reasonable.  However it isn't appropriate to post random images of charts in this server.",
        "created_at": "2021-09-18T04:26:45.618000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This type of content also isn't appropriate for this server.  \u003c@\u0026595685821026271242\u003e this smells relatively strongly of shilling as well.",
        "created_at": "2021-09-18T04:28:35.108000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Thanks for your response, Micah.\nThe line of research that I’m actively pursuing is analyzing the effect that EIP-1559 has had on ETH supply. And since AFAIK only one other source besides me is following the supply inflation rate (and IMO that other source is doing so wrongly by disregarding PoS issuance), that’s why I’m plotting my own charts using data from a trustworthy source: Etherscan.\nAlthough this Discord server is focused on development, I thought that maybe the developers who worked on EIP-1559 might be interested in seeing the tangible result of their work on ETH supply.\nBut if you still think that the charts that I shared are “random images”, I’ll be more than happy to delete that post and refrain from posting any more in the future.\nThanks again.",
        "created_at": "2021-09-18T05:37:33.236000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Generally speaking, this server focuses on technical changes and not on economic changes.  Any change in ETH supply is a side effect of improving/aligning incentives, but it isn't a primary target (other than achieving minimum viable issuance).  Also, \u003c#692078615269212180\u003e is a more appropriate place to discuss the effects of EIP-1559, but again with a focus on end-user UX rather than holder financial prospects.",
        "created_at": "2021-09-18T05:40:01.801000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Understood, Micah. I will stop posting these charts here. Cheers.",
        "created_at": "2021-09-18T05:42:24.554000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "pretty sure the top regarding fees is in now that btc maxis have decided to chime in https://www.coindesk.com/policy/2021/09/17/ethereums-design-choices-are-inherently-political/",
        "created_at": "2021-09-18T10:09:02.246000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "once the pending transaction count reaches 0 i believe it will be very hard to have it rise again due to blocksize being able to double in times of spikes",
        "created_at": "2021-09-18T10:16:22.822000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "ugh since when does coindesk entirely not work with js disabled",
        "created_at": "2021-09-18T16:44:50.844000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "guess I won't be able to read *that* article 😩",
        "created_at": "2021-09-18T16:45:12.455000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "will it though?  does that mean a undesirable end case like where the basefee is relatively high but tips are nearly always 0",
        "created_at": "2021-09-18T16:46:56.763000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "imo tips will most likely be 2 or so forevertm. but the basefee might be 1. but lets see",
        "created_at": "2021-09-18T20:53:15.480000+00:00",
        "attachments": null
    }
]