[
    {
        "author": "phabc",
        "category": "general",
        "parent": "",
        "content": "I guess this would become much easier with good lightclients",
        "created_at": "2021-05-08T14:26:45.548000+00:00",
        "attachments": null
    },
    {
        "author": "onqtam",
        "category": "general",
        "parent": "",
        "content": "Has anyone ever proposed mapping addresses to indexes? For example all new transactions after block X (some upgrade) could be checked if a mapping exists and if the to/from addresses don't have an address=\u003eID mapping - such could be generated (with an auto incrementing global counter) and stored in the state on-the-fly. Then for subsequent transactions involving those addresses the unique indexes from the mapping can be used ==\u003e reducing the bytes required to describe a transaction ==\u003e reducing the block size \u0026 chain growth \u0026 network bandwidth. This means that there would be 2 ways to encode transactions and this can be done either gradually (as explained here) or perhaps all nodes can scan and map all addresses to indexes as a batch job in preparation for block X in the future after which the new encoding would be allowed. This could also be applied to the r \u0026 s components of the ECDSA signatures if those don't change as well for a particular user (not familiar with that part of crypto).\n\nI haven't done any calculations but it seems to me that for simple transactions that don't have big inputs (simple transfers) this could save maybe about ~50% of the size, and I think the biggest thing in blocks is the list of transactions...?\n\nCurrently in order for me to check my balance I need to send requests to a full node anyway so in the future the translation of indexes to actual hashes/addresses/keys shouldn't be much of a problem as well.\n\nThoughts? Is this worth investigating \u0026 drafting a proposal in ethresear.ch or has this obvious idea been rejected in the past?",
        "created_at": "2021-05-08T16:57:52.755000+00:00",
        "attachments": null
    }
]