[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "\u003c@!751712784852451359\u003e \u003c@!129305432891195393\u003e \u003c@!311971895828283393\u003e \n\u003e Sincere apologies to the ETH devs for my off topic post, but this is ridiculous. So LUKSO wants to merge geth with prysm, spin off a completely separate blockchain with their own LUKSO token, making billions by just copying public goods built by the engineers and devs in the Eth ecosystem, want to  do this even before the official Eth PoS merge is out (so they can claim to go online even before Eth does)...and come here to figure out how to do so? This is an exploitation of public goods, and ideally the mods have some form of easy identification for client team members\nI don't see anything substantially wrong here. Part of being open source is that you will have to deal with this. There are numerous examples of actual contributions that started from simple forks. The whole openethereum project and what's currently Erigorn still has the EVM of geth, Grandine has the whole P2P stack of Lighthouse. This is not a zero sum game and the fact that these teams are experimenting with PoS and Sharding enriches the system more than it harms. It's besides the point whether or not they want to monetize from this research, as long as they keep it Open Source and freely accesible I see it as a win for the whole community. In addition to this, the fact that the founder is ex EF and has contributed to things we use today and that people like \u003c@!206016661470314496\u003e are in the board of advisors, gives legitimacy to the project.",
        "created_at": "2021-11-16T00:09:49.050000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "Yeah I mean I thought the other comment was a little hyperbolic",
        "created_at": "2021-11-16T00:13:45.117000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "Although Grandine not being free software does feel parasitic in a way that other projects like this do not",
        "created_at": "2021-11-16T00:19:46.380000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "as being \"merely\" open source misses the point of free software",
        "created_at": "2021-11-16T00:20:26.530000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Agreed, although I was under the impression that grandine's non-free status was temporary and it had more to do with the University than the devs",
        "created_at": "2021-11-16T02:03:49.323000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "oh I was not aware of that",
        "created_at": "2021-11-16T02:40:38.371000+00:00",
        "attachments": null
    },
    {
        "author": "samajammin",
        "category": "general",
        "parent": "",
        "content": "FWIW looks like the Yellow Paper also references block numbers without any separators",
        "created_at": "2021-11-16T04:49:19.408000+00:00",
        "attachments": [
            {
                "type": "image/jpeg",
                "origin_name": "Image_2021-11-15_at_10.47.32_PM.jpg",
                "content": "44c0ede0623016bbbc1ae5126158bfd645eeda3e33ec64eafeb4c35f1e71769c"
            }
        ]
    },
    {
        "author": "muddlebee",
        "category": "general",
        "parent": "",
        "content": "Not sure if its the right place to discuss. because couldn't find any other appropriate channel. I apologize in advance.\n\nmy two cents. this discord Ethereum R\u0026D has grown and accumulated too much value within itself. If you closely analyze all the discussion happening in discord channels its mostly either the core ethereum folks or the ones from ethereum support or friends of ethereum.\n\nIt's kind of difficult for the newcomers/outsiders to chime in and contribute. newcomers in the sense new to crypto world, new to ethereum and so forth. \n\nEthereum Foundation follows the `philosophy of subtraction` means resisting the natural tendency of organizations to grow and accumulate value within themselves, and ensure instead that this value is created outside the Foundation in the broader Ethereum ecosystem. https://blog.ethereum.org/2019/05/21/ethereum-foundation-spring-2019-update/#2-our-philosophy\n\nI am not exactly sure how to solve this issue. 🤔 But would love to listen what y'all have to say on this.",
        "created_at": "2021-11-16T16:56:03.318000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "i'm not sure what you're suggesting with regard to subtraction, knowledge is most productive in close proximity to related domains. It makes sense for this discord to exist for that reason. \n\nTo your second point, this server is actually an amazing onboarding tool for anyone looking to dive deep: a collection of domain experts willing and available to answer questions. That's powerful!\n\nAnyone can listen, learn and start to contribute in their own way. Danny Ryan started as a lurker watching channels and absorbing information, before there was a discord.  I attended every core dev call for years to get a sense of people and the relationships.\n\nWhat you're pointing out is not an issue. Even with a deeply technical background, it can take 6-9 months to be properly onboarded and able to meaningfully contribute to the core protocol.",
        "created_at": "2021-11-16T17:56:35.754000+00:00",
        "attachments": null
    },
    {
        "author": "muddlebee",
        "category": "general",
        "parent": "",
        "content": "Im not suggesting anything. I was just curious 👀  I came across this ethereum philosophy and this discord. something felt off. No disrespect to anyone or any member of this community tho.",
        "created_at": "2021-11-16T18:00:06.795000+00:00",
        "attachments": null
    },
    {
        "author": "muddlebee",
        "category": "general",
        "parent": "",
        "content": "and yes. you are right 👍  I agree with whatever you said.",
        "created_at": "2021-11-16T18:01:33.034000+00:00",
        "attachments": null
    },
    {
        "author": "mrfwashere",
        "category": "general",
        "parent": "",
        "content": "As someone who has been actively lurking for about 4 months I think there is some substance to what he said. \n\nCurrently it feels like there is no place to ask stupid questions or get involved casually and to me there is a void between the CryptoDevs server for beginner devs and the advanced discussions in here. \n\nI doubt I'm the only one sitting in this grey area, *probably* not smart enough to ever offer real contributions but still very interested or just wanting to express some appreciation for you guys. \n\nI think you could gain some value from a true offtopic channel hidden down below without really losing anything - hardcore R\u0026D only people like Micah can just mute it and continue like nothing has changed, and it may catch some potential contributors who otherwise wouldn't engage. \n\nI realise this goes against the general ethos of this server and apologise for any wasted time, but it has been on my mind for most of my time here and this seems like the opportunity to mention it.",
        "created_at": "2021-11-16T20:32:14.748000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "don't apologize! appreciate the feedback. IMO the problem with a true offtopic channel is that it's hard to keep the offtopic in that channel. (we even have trouble sometimes with keeping existing channels on topic). \n\nwhile it may seem intimidating, i'd encourage you to sidestep the intimidation and ask away. the only caveat is that there's an expectation you've at least tried to find the answer on your own first before asking here. Generally, people are more than happy to answer questions about the protocol - it's what occupies the majority of their mental energy! there's also a group of devs that jump into the voice channel after every core dev call, maybe you'd like to join / ask questions there?\n\nor, have you checked out other places like Cat Herders or the Eth.org servers? these are Ethereum focused, but with more open areas for disussion and a broader mix of technical backgrounds.",
        "created_at": "2021-11-16T20:46:43.482000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "That's interesting that you feel that way. A year ago I had just bought my very first crypto and was trying to justify it. I didn't even know about this channel, I can now easily interact with some of the channels here, learning in 99% of cases, but I'm sure I can contribute as well. If you look to the apprenticeship channel, there's a lot of newcomers there that are now core devs writing the next specification. I strongly feel the situation is exactly the opposite of what you describe and that this community is overly inclusive. Often times engaging in conversations even with trolls that are obviously just arguing for the sake of it",
        "created_at": "2021-11-16T22:17:16.531000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "A quick browse here will find a bunch of examples of those as well",
        "created_at": "2021-11-16T22:18:05.728000+00:00",
        "attachments": null
    },
    {
        "author": "mrfwashere",
        "category": "general",
        "parent": "",
        "content": "I haven't really explored those servers but this place seems like the final boss for important contributions and interesting discussions - however I am more than several levels below asking any questions without it being a total derailment. \n\nFor example the conversation earlier about TTD and TBH was extremely fascinating, but it's just not appropriate for me to fill that channel with basic questions on all of those concepts, burying all the important discussions for everyone else. \n\nAs you say, it's expected for us to look for the answers on our own first, but when you know so little that most conversations are over your head it's not easy to pick a starting place, and some people like me will struggle with any type of learning besides being spoon fed explanations. \n\nAs a mediocre programmer with only surface level understandings of these concepts (and stuck half disabled without ADHD medication in my case) despite a desire to contribute something useful one day it doesn't really feel feasible to work my way there, and I haven't made much progress in these past months. \n\nWhat area could I possibly work towards that isn't covered by someone 100x better in a fraction of the time and physical effort it takes me just to barely grasp the ideas? \n\nThis is my thought process suggesting a lower level or less restricted channel that can essentially be ignored unless people have spare time or interest in those low level discussions. \n\nBut, perhaps the pool of people like that who may end up useful contributors is small and not worthy of the extra resources to deal with - probably a very poor ratio of effort spent from important persons to value gained.",
        "created_at": "2021-11-16T22:23:30.048000+00:00",
        "attachments": null
    },
    {
        "author": "muddlebee",
        "category": "general",
        "parent": "",
        "content": "I found something meaningful on  `How to grow decentralized communities` and how other communities like Gitcoin ,RaidGuild, Bankless, MetaGame are building https://medium.com/1kxnetwork/how-to-grow-decentralized-communities-1bf1044924f8",
        "created_at": "2021-11-16T22:55:27.810000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "time is the ultimate helper here - you'll get a better understanding of foundational concepts, and start to see the connective components between them. i encourage you to stick around. these aren't simple topics, and as i mentioned above it can even take experienced devs the better part of a year to really get deep into how to contribute to the protocol\n\nmaybe also check out the Apprenticeship, and pick a specific topic to dive deep into",
        "created_at": "2021-11-16T22:56:23.012000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Yep, focus is key to surviving in the Ethereum space.  Initially that likely means picking one fairly small topic and learning it well. You will necessarily need some understanding of other concepts it relates to but you don't have to know them in depth.  You'll naturally find that you understand more and more about those related topics and can then branch out to learning one of them in detail next and so on.",
        "created_at": "2021-11-16T23:00:38.315000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Even the people around here that seem insanely smart and like they understand everything have areas they aren't following in detail and need to ask clarifying questions about.",
        "created_at": "2021-11-16T23:01:47.411000+00:00",
        "attachments": null
    },
    {
        "author": "muddlebee",
        "category": "general",
        "parent": "",
        "content": "Also somewhat `ethereum.org discord` is following the same model \u003c@!643099918998831144\u003e \u003c@!485238712415027221\u003e",
        "created_at": "2021-11-16T23:06:34.046000+00:00",
        "attachments": null
    }
]