[
    {
        "author": "markizano",
        "category": "general",
        "parent": "",
        "content": "Hi all! Happy Taco Tuesday!\n\nI hope I've found the right place to ask such a question. If not, I'll be happy to follow direction as I cannot seem to find the right terms in Google's search box to find such an answer.\n\nTopic is around: ETH vs ETH-derived wallet addresses (e.g. COMP, UNI, DAI, etc..).\nThey look the same, but are they compatible for transactions or do they need to first be converted to the derived wallet address before transactions can take place successfully?\n\nI guess I am asking if wallet addresses are strict or if they are forgiving for one using something like Pay 0.01 ETH-\u003eUNI [without an intermediary exchange].",
        "created_at": "2021-06-23T00:29:43.192000+00:00",
        "attachments": null
    },
    {
        "author": "hiturunk",
        "category": "general",
        "parent": "",
        "content": "This is kind of off-topic, and as a rule of thumb, I try not to @ important people (So I won't), but in the off-chance you scroll through \u003c#595721451651465227\u003e...\n\n[But this is in relation to Ethereum's ecosystem at large and thus why I'm asking for thoughts here]\n\nI've been ruminating on the concept of UNI as an oracle token, as suggested by our Lord and Saviour @Vitalik, which functionally seems like one of the most important ecological roles Uniswap has had in the defi ecosystem [as a TWAP oracle for lending platforms, etc].\n\nWould integrators pay for such a service? Would they want to? [a la Chainlink, on a per-request basis?]\n\n Up until now this [the Oracle service] has been a public good that uniswap provides, and it's  current monetization strategy is to take fees from operation of an exchange.\n\nAs a governance delegate from Uniswap, I'm really interested to hear others' thoughts on this subject [Not just the Uniswap community's] and how it would relate to the ecosystem at large.\n\nFor those interested, you can find Vitalik's original post in the Uniswap Governance forum here: https://gov.uniswap.org/t/uni-should-become-an-oracle-token/11988/10\n\nIf you have strong opinions on the subject or helpful thoughts; feel free to @ or PM me.",
        "created_at": "2021-06-23T12:54:22.841000+00:00",
        "attachments": null
    }
]