[
    {
        "author": "memeplexx",
        "category": "general",
        "parent": "",
        "content": "Are they mutually exclusive?",
        "created_at": "2021-11-13T00:10:01.194000+00:00",
        "attachments": null
    },
    {
        "author": "memeplexx",
        "category": "general",
        "parent": "",
        "content": "Some day they might be collaborating on mathematics research on top of Ethereum 🤷🏻‍♂️",
        "created_at": "2021-11-13T00:10:54.110000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "\u003c:xmr:874684927197724712\u003e \u003c:bridge:854398709998551067\u003e \u003c:ethpurple:898538253202915368\u003e \u003c:nice:900769106201022514\u003e",
        "created_at": "2021-11-13T03:38:11.771000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Is this possible?",
        "created_at": "2021-11-13T03:38:22.287000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "what?",
        "created_at": "2021-11-13T03:45:17.297000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Just like bitcoin to xmr atomic swaps. Is there anything that can do eth xmr atomic swaps?",
        "created_at": "2021-11-13T03:55:58.234000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "probably",
        "created_at": "2021-11-13T04:59:05.361000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "you'd *only* be able to do swaps with it not like tokenizing it",
        "created_at": "2021-11-13T04:59:57.968000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "@vbuterin @jgm \u003c@301186049323958275\u003e Centralization around dominant extractors is indeed terrible. Also, because most EV goes to the miner due to competition, extractors are still incentivized to own their own validators. So Flashbots style auctions fail to mitigate structural centralization as well as facilitating content centralization. MEV is fundamentally centralizing.",
        "created_at": "2021-11-13T08:58:36.638000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "What is your proposal for decentralizing block building and proposing?",
        "created_at": "2021-11-13T09:01:25.895000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "If you have a strategy that makes you 0.1 eth on someone else's validator and 0.5 on your own, youll want to own your own. Don't know why it took me so long to see it",
        "created_at": "2021-11-13T09:01:52.602000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "Let validators do it but enforce consensus rules on content",
        "created_at": "2021-11-13T09:03:03.585000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "What consensus rules on content?",
        "created_at": "2021-11-13T09:03:30.908000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "Pretty lax rules at first. Tighten them up over time",
        "created_at": "2021-11-13T09:03:44.176000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Can you give some examples of these rules?",
        "created_at": "2021-11-13T09:03:59.897000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "\u003c@273808422753796097\u003e s suggestion here is a good start",
        "created_at": "2021-11-13T09:07:01.804000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "https://ethresear.ch/t/two-slot-proposer-builder-separation/10980/4?u=pmcgoohan",
        "created_at": "2021-11-13T09:07:05.758000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "I have my own ideas, but I always seem to start chatting to you when I've got breakfast on the table Micah 😅Get back to you soon",
        "created_at": "2021-11-13T09:08:25.971000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The problem presented in that post seems to explain why it is not a good solution.",
        "created_at": "2021-11-13T09:09:28.158000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Also, we cannot assume that attestors all share the same world view (which is what Vitalik is alluding to is that post).",
        "created_at": "2021-11-13T09:10:19.169000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I can simultaneously send two transactions with the same nonce to two different attestors.  Each will now have a different view of the mempool, thus will not agree on what \"correct\" transaction ordering should be.",
        "created_at": "2021-11-13T09:11:11.181000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Also, we shouldn't assume that every attestor has even a complete transaction pool, or the same size transaction pool.",
        "created_at": "2021-11-13T09:11:43.739000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "One attestor may have a transaction pool that is 100x as big as another attestor.",
        "created_at": "2021-11-13T09:12:12.754000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "Doesn't this assume that all block producers (/EV extractors) will at all times be the ones to propose a block no? What if it's _my_ turn to propose a block, there is EV, but I don't know how to extract it. Doesn't it make sense for someone else to give me a block that makes them (as a block producers) some money, and makes _me_ some additional money as well?",
        "created_at": "2021-11-13T09:31:34.296000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I don't have a problem with block proposers outsourcing block building if they want to, and there's nothing that could be done to prevent that anyway.  But forcing block proposers to include a given execution payload goes, for me at least, against the grain of what a decentralized network is tying to achieve (note there is no definition of \"winning\" so I cannot be certain this is the intention, but it certainly suggests it).",
        "created_at": "2021-11-13T10:06:20.378000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "Not if the payload is the product of consensus- then it is fully decentralized. Block proposers acting on their own are perfectly centralized, just as they would be if they got to decide account balances etc on their own.",
        "created_at": "2021-11-13T10:10:35.380000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Although block producers are (by definition) individually centralized that doesn't matter, as far as I can see, as they only individually have 1/250000 of the network under their control.  So for censorship they could decide to censor a given transaction but that would have minimal impact on the network overall as their chance to be able to censor for _n_ blocks goes to 0 pretty quickly.\n\nAs for payload being the product of consensus: this comes back to my \"sledgehammer to crack a nut\" comment earlier.  The economic incentives for validators require no more than self-interest for them to work (assuming the no more than 1/3 are corrupted with perverse incentives in some way).  MEV, in most of its forms, is ultimately just one or another way of profiting from existing inefficiencies and as long as those inefficiencies remain I don't see MEV disappearing,  Having a consensus mechanism for what goes in to a block, when the only efficient answer is already \"what pays most\", seems like significant overkill.  What would it enable/prevent?",
        "created_at": "2021-11-13T10:21:39.220000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "\u003e they only individually have 1/250000 of the network under their control",
        "created_at": "2021-11-13T10:29:54.413000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "Your 1/250000 argument is true only of consensus content. Currently, each validator has 100% control of their block. It doesn’t matter how quickly these dictators rotate, Ethereum is still under dictatorial control from one block to the next. When you add MEVA into this then they can literally be a single well resourced actor.",
        "created_at": "2021-11-13T10:30:31.498000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "From what you're saying, you may as well forget about attesters completely, and just trust proposers to do the right thing. Sure, they’re centralized, but they keep changing so it’ll be fine. You’ll certainly keep bandwith/work/complexity down- but I wouldn't say it's decentralized or secure! As for structure, so for content.",
        "created_at": "2021-11-13T10:32:08.342000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "What is it that you are trying to enable, or prevent, though?",
        "created_at": "2021-11-13T10:35:24.358000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "(And there is a significant difference between attesting to a block and selecting the execution payload for it.  The former is critical to the correct operation of the protocol, the latter is, to be frank, irrelevant to it.",
        "created_at": "2021-11-13T10:37:17.422000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "Ethereum becoming too expensive for widespread adoption, centralized around a monopolistic gatekeeper running an extortion economy and punctuated by severe attacks from hostile, unstaked parties.",
        "created_at": "2021-11-13T10:37:25.359000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Okay, but say that in to terms that already exist in Ethereum.  What do you want a block proposer to do, or not do?",
        "created_at": "2021-11-13T10:38:54.341000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "Ensure transactions do not deviate unacceptably from arrival time",
        "created_at": "2021-11-13T10:40:28.785000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "I'm collecting data on this from globally distributed nodes at the moment. P2P propogation looks very effective and arrival times far more knowable than some would have you believe.",
        "created_at": "2021-11-13T10:41:36.049000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "That seems to deny the whole gas price system, however.  For it to even have a chance then all fees would have to be the same, which removes the system for block congestion control.",
        "created_at": "2021-11-13T10:42:14.119000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "(I have to nip out, but will be back in an hour or so.  Interesting conversation!)",
        "created_at": "2021-11-13T10:42:27.155000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "No longer true with eip1559. We have a base fee for congestion/DDOS control. Just need a fixed tip. Still keep the beloved burn.",
        "created_at": "2021-11-13T10:44:30.401000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "Yes good to chat! I'll be on and off too.",
        "created_at": "2021-11-13T10:45:23.917000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "A tip is there to compensate for some required effort from the propser, and also to compensate for orphaning risk (which is not constant)",
        "created_at": "2021-11-13T10:46:14.250000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "Even though a transaction might be rather late in arriving to the proposer (say 0.5 seconds before its \"deadline\" of 4 seconds into slot time), if the tip is high enough it might be worth the risk.",
        "created_at": "2021-11-13T10:46:51.235000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "On consensus solutions, I think Vitalik was too dismissive of his own idea. His objections seem to be that attesters are ineffective. If that is true then it is a fundamental problem with eth2 consensus, not a problem with bringing content into that consensus. I don't think it is true btw.",
        "created_at": "2021-11-13T10:46:58.720000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "Boundary cases like this drop away as the window of tolerance increases. Say you required a tx to be included once it had been seen for 12 secs. 99.9% of nodes will have seen it after then (made up figures- I'm collecting real data right now), so the proposer knows their block will fail if they don't include the tx",
        "created_at": "2021-11-13T10:56:55.052000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "A fixed priority fee prevents users from expressing time preference to the protocol.  It also assumes that the core devs (or whoever controls the fixed priority fee) have perfect information on the operational costs of running a node.",
        "created_at": "2021-11-13T11:13:05.072000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think this assumes a healthy gossip network, which I don't think the protocol/consensus should assume.",
        "created_at": "2021-11-13T11:14:05.435000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "Judging by all the BGP fuck ups / hijacking in recent years, I very much agree",
        "created_at": "2021-11-13T11:38:27.608000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I don't see that EIP-1559 fixes this.  For example, if a tx with max base fee _x_ entered the ordered queue of transactions (or broad equivalent) and at the point the tx was due to be added to a block the base fee was higher than _x_ it wouldn't be included, and would remain unincluded for an unbounded amount of time.",
        "created_at": "2021-11-13T12:17:27.548000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I think we either have strict ordering of some sort, which is complicated and slow and comes with its own set of attacks, or we accept that there's no single unequivocally fair way to do this and let market forces and decentralization be the push and pull that finds an equilibrium (with the potential for having some sort of \"proof of fair selection\" for block proposers if required due to the equilibrium moving too far towards a long-term centralized result).\n\nMy opinion is that any strict ordering system is going to be very hard to build, although I'd be very happy to take a look at any proposed system.  And anything less than a strict ordering system is going to be open to abuse enough such that it wouldn't look too different from the free-for-all that nominally exists today.  But again, happy to take a look at anything that could provide a workable solution.\n\n(Another opinion is that I think that the requirements on the chain today will look very different from the requirements on the chain in a few years' time, and so worry about anything that builds for the current requirements and places an undue burden on a chain whose primary role would be to secure data roots and proofs on a periodic basis.)",
        "created_at": "2021-11-13T12:25:59.943000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "I don't buy that objection. If a node is suffering a network failure such that they can't see a tx after 12 secs, they won't be able to attest anyway. Again, this is a general problem for eth2 consensus and is not specific to the content consensus.",
        "created_at": "2021-11-13T16:16:05.682000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "\u003e they won't be able to attest anyway\nAfaik they still are?",
        "created_at": "2021-11-13T16:22:17.883000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "That's a good point. Txs that don't specify a high enough base fee will still be vulnerable to delays, but that is different from censorship. The difference is that it will be a deterministic function of network rules and not the preference of one miner, which is significant.",
        "created_at": "2021-11-13T16:22:33.390000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "If their network problems are that severe they likely can't for the same reason they haven't seen the tx after 12 secs. Ethereum will be having problems will low attestor participantion anyway.",
        "created_at": "2021-11-13T16:24:19.393000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "Not really",
        "created_at": "2021-11-13T16:25:41.998000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "As a backstop you could add a client rule that if there have been network problems, the client is more lenient, eg: they give the proposer 24 secs or whatever they calculate network lag to be",
        "created_at": "2021-11-13T16:25:51.763000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "That binary view of perfect fair ordering or none at all is what I'm arguing against. If you keep MEV within one block or so, then you dont mitigate DEX arbs and sandwiches but you don't get the severe stuff like multi-block censorship-as-a-service \u0026 unstaked highjacks and dapps have a chance to mitigate with batch processing etc. Zks can't get griefed by censors when they start rolling up every 1 min. Don't let perfection be the enemy of the good.",
        "created_at": "2021-11-13T16:32:46.377000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "The proposals for both Flashbots relayers and PBS are very involved with many new actors. This proposal involves no new actors, just a change in voting conditions. Proposals of this kind seem trivial in comparison.",
        "created_at": "2021-11-13T16:36:35.087000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "I think in general the idea/direction of Ethereum so far to move somewhat to a separation of concerns to prevent ending up with too high of a requirements for running validators (which is centralizing). PBS is a like this, but so is DAS+sharding.\nAs I understand it, you want every validator to see, verify, and store every transaction they see, and include that logic (\"should be in block within N seconds\") in the fork choice rule?",
        "created_at": "2021-11-13T16:40:08.257000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "That's a good point and needs thought. Certainly geth full nodes see all pending txs at the moment, but im aware that sharding is  moving away from this. Seems again there is a general eth2 consensus tradeoff here about how hands-off validators can safely be.",
        "created_at": "2021-11-13T16:52:42.723000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "Yes, there's also movements the opposite direction though. Or rather, making sure validators do the work we want them to do themselves instead of relying on some centralized party at no cost to themselves (i.e. no loss of privacy/slashability). [0]\nAs far as making block composition more fair and/or including it in fork choice/consensus, it'd make sense to make sure that it's not cheatable by lazy validators that just defer that \"delay check\" to some centralized party (to get around e.g. bandwidth and latency requirements that come with listening to all tx activity yourself).\n\n[0] https://dankradfeist.de/ethereum/2021/09/30/proofs-of-custody.html",
        "created_at": "2021-11-13T17:03:33.295000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "Thanks. I'll read when I get the chance. Sharding is way further out than the merge though right? No reason this can't be an interim solution, especially as it is trivial to implement. Vitalik had an idea about sharded censorship  resistance on the 2nd ethresear.ch PBS thread.",
        "created_at": "2021-11-13T17:38:02.689000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "Luckily I'm not the one you have to convince that this \"interim\" solution is worth the implementation efforts. I do think that, at least as far as the \"within N seconds\"-proposal is concerned, it's kind of pointless if there's no penalties associated with it. \n\nEDIT: Someone correct me if I'm wrong, but as far as I know it is (barring any to-be-added penalties) in the validator's best interest to vote for a wrongly ordered block (i.e. better than letting the slot end up empty). That will net a validator the most rewards. But _proving_ whether someone saw or didn't see a transaction in a certain time window is challenging (if not outright impossible).",
        "created_at": "2021-11-13T17:46:37.663000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Yeah it's proving that an entity did or did not see a given transaction that is, as far as I'm aware, tricky to achieve (I haven't looked at the various DAG-based solutions for transaction ordering for a while, but they all used to have some sort of ultimate system to resolve conflicts and decide on a canonical ordering so wouldn't work for our needs, even ignoring the gas issue).",
        "created_at": "2021-11-13T19:36:20.311000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "The problem with a 90% fair system is that the remaining 10% can be exploited, and given that there is money to be made then it's likely that the 10% will utilize whatever holes exist in the system.\n\nIn my opinion the best bet against censorship is to give each block proposer autonomy, as we'll only hit censorship problems if all of the proposers are corrupt (reduce all to whatever value you want for censorship duration,but given that we already assume that at least 2/3 of the network is not corrupt, or at least self-interested enough to do what is best for themselves, it seems that isn't an issue).",
        "created_at": "2021-11-13T19:39:37.476000+00:00",
        "attachments": null
    }
]