[
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "chainshot is definitely a solid crew!",
        "created_at": "2021-04-28T19:59:27.179000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "banned",
        "created_at": "2021-04-28T20:00:20.848000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "banned",
        "created_at": "2021-04-28T20:00:24.497000+00:00",
        "attachments": null
    },
    {
        "author": "definitelynotcharles7176",
        "category": "general",
        "parent": "",
        "content": "is the merge schedule oct 2021 real and committed?",
        "created_at": "2021-04-28T21:40:59.704000+00:00",
        "attachments": null
    },
    {
        "author": "definitelynotcharles7176",
        "category": "general",
        "parent": "",
        "content": "i have people i can communicate this to in the real world and miners who would want to know",
        "created_at": "2021-04-28T21:41:22.115000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "No.  Ideally this year but absolutely no commitments on timing and unlikely to be ready by October.",
        "created_at": "2021-04-28T21:41:57.677000+00:00",
        "attachments": null
    },
    {
        "author": "definitelynotcharles7176",
        "category": "general",
        "parent": "",
        "content": "Ok Adrian, thanks for your answer. What you said seems like the status quo, in that 2.0 is being worked on, however the end of mining and the merge is uncertain and generally \u003e12 months away.\n\nThis is different from a separate announcement, that there would be strong effort and strong likelihood to to finish in 2021. \u003c@!552133098075193354\u003e communicated this different message to us in the old 1559 channel shortly before it was closed.",
        "created_at": "2021-04-28T21:45:45.125000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I didn't say \u003e 12 months away that would put it mid next year.  I said ideally this year but no commitments.",
        "created_at": "2021-04-28T21:54:30.961000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "There is a strong effort and at least a likelihood the merge will happen in 2021.  It's a distributed system so there are multiple people and organisations involved so there's no committments.",
        "created_at": "2021-04-28T21:55:26.953000+00:00",
        "attachments": null
    },
    {
        "author": "definitelynotcharles7176",
        "category": "general",
        "parent": "",
        "content": "The difficulties of timelines with OSS is well known and ETH 2.0 is a prominent example of a delayed timeline. \n\nTim signalled a special, new effort that involved dropping components in order to ship the merge. This statement was very strong and specific. Unfortunately this was deleted now.",
        "created_at": "2021-04-28T22:00:29.867000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "The merge is the focus and work is underway on it.  I'm not really sure what you want here.  I know Tim well and read all the messages in the 1559-dev channel so I know no commitment was made on timelines, just predictions.  You may want to review the latest ACD where there was discussion of the next couple of forks for eth1 including an agreement to prioritise the merge and the \u003c#826479341784662056\u003e channel is full of discussions of work ongoing towards the merge.",
        "created_at": "2021-04-28T22:04:15.273000+00:00",
        "attachments": null
    },
    {
        "author": "definitelynotcharles7176",
        "category": "general",
        "parent": "",
        "content": "This in was the old mining channel that was deleted. \n\nAgain, \u003c@!552133098075193354\u003e actively made an unusual and out of context announcement about 2.0 being prioritized, with 6 months being the ballpark figure. \n\nYou saw this announcement by Tim and so did \u003c@!273808422753796097\u003e. Indeed, I was skeptical of this timeline and you seemed to push back on me, strongly suggesting this timeline with high probability of 6 months was a serious effort.\n\nOf course ECD should be focused on 2.0 in some sense but your comments are weaker than this announcement.",
        "created_at": "2021-04-28T22:13:01.535000+00:00",
        "attachments": null
    },
    {
        "author": "definitelynotcharles7176",
        "category": "general",
        "parent": "",
        "content": "\u003e  I'm not really sure what you want here. \n\nIt's unclear how your timeline or messages now can be distinguished from \"business as usual\".\n\nGiven the presence of senior developers who observed Tim's announcement, this might affect how miners see future announcements.\n\nMy question here follows up on this and is highly valid. \n\nYour question \"I'm not really sure what you want here\" come across as a little combative. I point out you argued the exact opposite with me at Tim's announcement, with me pointing out how OSS is a mess and you saying that it was highly credible to ship soon.",
        "created_at": "2021-04-28T22:14:01.616000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "When I say I don't know what you want I mean it.  What exactly are expecting to get from me?  I'm telling you that things are panning out exactly at Tim's prediction suggested.  Work is underway, it does look like it will be this year but there are no commitments because that's not how things work in a decentralised environment.\n\nYou seem to expect that there's some authority that can make commitments of set exact plans but Ethereum is far more decentralised than that. \n\nIf you want to get a sense of what happening you need to look at the work being done.  You can see the work ongoing and the progress being made particularly in the \u003c#826479341784662056\u003e channel at the moment.  We've had teku/geth merge testnets working for some time and now multiple other clients are starting to support the merge as well with multiclient public testnet aiming to be launched.",
        "created_at": "2021-04-28T22:21:43.314000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "The merge is basically the #1 priority for everyone after the forks that are in progress (Altair and London). I think 6 months from now is a pretty optimistic timeline, 6 months after London/Altair (which are due in ~July) seems possible, but I definitely would not make that a \"final timeline\": we barely have those for the current forks that are being planned. We mentioned a few times that the merge could happen sooner if there was a strong push (e.g. a miner attack) and I still think that's true, but we're just not in a spot where we need to drop absolutely everything and ship it _now_.",
        "created_at": "2021-04-28T22:26:22.229000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Agreed with Adrian I'm not really sure what you are trying to \"get\" here?",
        "created_at": "2021-04-28T22:27:13.076000+00:00",
        "attachments": null
    },
    {
        "author": "definitelynotcharles7176",
        "category": "general",
        "parent": "",
        "content": "I am trying to get timelines from credible source.\n\n\u003e I think 6 months from now is a pretty optimistic timeline, 6 months after London/Altair (which are due in ~July) seems possible, but I definitely would not make that a \"final timeline\"\n\nThe timelines now seem less certain than the strong predictions that had greater than 50% probability in 2021. \n\nThis variance and communication reduces my ability to get timelines in two ways: \n\n1. On an object level, the predictions have slid in date, and also have become less firm. \n2. Also, the communication here acts as if there is no variance at all, when it is large.",
        "created_at": "2021-04-28T23:12:27.461000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "We've been over this so many times I'm not sure how to say it anymore.  There is no one who can be a \"credible source\". No one has definitive control over Ethereum like that. I think there is still a greater than 50% probability of the merge in 2021, if anything it's looks more likely than it was previously.\n\nYou will never get a firm commitment of when things are due in Ethereum, that's just not how decentralised governance works.",
        "created_at": "2021-04-28T23:14:41.496000+00:00",
        "attachments": null
    },
    {
        "author": "definitelynotcharles7176",
        "category": "general",
        "parent": "",
        "content": "You and Tim are credible sources in the sense you can say there is greater than 50% chance of a merge and we should believe you.",
        "created_at": "2021-04-28T23:15:36.454000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "1. initial devnets\n2. refinement and freezing of specs\n3. more production development\n4. longer lived testnets\n5. beat the thing to death with testing and security analysis\n6. set testnet and mainnet fork blocks",
        "created_at": "2021-04-28T23:15:57.837000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "we're working hard on (1) and (2)",
        "created_at": "2021-04-28T23:16:05.922000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "those will then lead into the next phases",
        "created_at": "2021-04-28T23:16:18.327000+00:00",
        "attachments": null
    },
    {
        "author": "definitelynotcharles7176",
        "category": "general",
        "parent": "",
        "content": "It is Ok to slide in deadlines and this conversation is not a critical comment on your current work or progress. I'm sure it's approximately insanity and there are situations where any progress is heroic.",
        "created_at": "2021-04-28T23:16:46.925000+00:00",
        "attachments": null
    },
    {
        "author": "definitelynotcharles7176",
        "category": "general",
        "parent": "",
        "content": "This conversation is about variance between estimates that many miners in the world depend on.",
        "created_at": "2021-04-28T23:17:41.706000+00:00",
        "attachments": null
    }
]