[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I feel like we need a better grant program for people who develop quality censorship resistant software.  Specifically, after-the-fact grants to enable continued development by teams with a proven track record.",
        "created_at": "2021-01-02T03:27:53.781000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "A prime example of the problem here is that Uniswap team built Uniswap v1 which was a pristine piece of censorship resistant software.  It had no rent, no schemes, no misaligned incentives.  Just really well built censorship resistant software.  Unfortunately, they wanted to expand their team and keep building but this required generating revenue because there wasn't enough grant money to keep them going, so they introduced a bit of rent into Uniswap v2.  Of course, in the current legal climate around blockchains one cannot just extract that rent so they had to do a complicated token sale, which came with some silly scheming in order to get it to sell (like everything these days).",
        "created_at": "2021-01-02T03:30:20.209000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I have to wonder, if more grant money were given to them if they could have continued to build Uniswap v2 and eventually Uniswap v3 while sticking to the original censorship resistant swap platform free of rent and scheming.",
        "created_at": "2021-01-02T03:30:58.616000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We also saw something similar with Tornado.  They built a great privacy product for Ethereum, but they too needed funding and so they have a closed source UI (to try to protect themselves from copy-cats) which is really bad from a risk standpoint and they introduced a token and schemes in order to try to extract some value.",
        "created_at": "2021-01-02T03:32:08.639000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I have to wonder, if more grant money were given to them if they could have built Tornado as a censorship resistant anonymity platform with fully open source components and no scheming or rent collection.",
        "created_at": "2021-01-02T03:32:41.775000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We also have Arbitrum, which is building a pretty ideal L2 system for Ethereum with no native token and no scheming.  However, I suspect that with enough time eventually they'll fall down the same hole that every other app on Ethereum seems to fall down and they'll add schemes and rent seeking in order to extract some value so they can continue development.",
        "created_at": "2021-01-02T03:34:11.337000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Is the issue that there just isn't enough grant money available?  Is the issue that the grant money isn't being allocated well?  Is grant money going to new teams rather than established/proven teams?",
        "created_at": "2021-01-02T03:34:59.716000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I wonder if we can somehow signal that \"grant money will be given *after* the fact to teams who build censorship resistant platforms free of rent and schemes\" then people will start building more of those things and less things like SushiSwap or Mythril.",
        "created_at": "2021-01-02T03:35:44.676000+00:00",
        "attachments": null
    }
]