[
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "What I’ve said many times is that if I was a miner, I would plan to breakeaven at the latest by EOY 2021. I much prefer to be too conservative in these predictions than not, but it’s absolutely not a guaranteee for a merge date. If I was a miner, I’d also be following these channels closely and updating my estimates based on actual progress.",
        "created_at": "2021-04-29T01:06:47.499000+00:00",
        "attachments": null
    },
    {
        "author": "etaipo",
        "category": "general",
        "parent": "",
        "content": "I think most miners are going to be moving to raven",
        "created_at": "2021-04-29T02:22:25.253000+00:00",
        "attachments": null
    },
    {
        "author": "etaipo",
        "category": "general",
        "parent": "",
        "content": "although they can sell off their consumer-grade hardware for a profit",
        "created_at": "2021-04-29T02:22:42.558000+00:00",
        "attachments": null
    },
    {
        "author": "etaipo",
        "category": "general",
        "parent": "",
        "content": "it's a very sensitive topic though, due to how significant the impact of changes like PoS and even EIP1559 are",
        "created_at": "2021-04-29T02:23:47.006000+00:00",
        "attachments": null
    },
    {
        "author": "lattechad",
        "category": "general",
        "parent": "",
        "content": "What has triggered this great hurry to ship 2.0? It wasn't too long ago that it was slated for summer '22. Just wondering",
        "created_at": "2021-04-29T09:42:05.021000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "Ethereum 2.0 is already live. R\u0026D progressed and what was previously phases became features: Merge, sharding, light client. Shards became data shards (+DAS), not execution shards; merge turned out to be far simpler than thought, with Vitalik's \"minimum merge\" proposal. PoS is years past schedule - going for the merge next is simply what's, well, next. There are more features to be had for the EVM, but there will *always* be more features for the EVM, and if you always wait for \"just one more thing, one more feature fork\", you're never going to merge. For some value of never.\nDisclaimer: My interpretation of things by reading this Discord and skimming ACD calls; *not* an authoritative opinion in any way.\n\n\u003c@!335695776728612880\u003e ^^",
        "created_at": "2021-04-29T15:47:07.768000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "\u003c@!555483069038198827\u003e \"For GPU miners, you can't do this: The same GPUs can still be used for the new mining algorithm\" -- maybe? I am sorta-not-following the ETC discussion around SHA3, and my impression was that they are considering SHA3 precisely because it is not at all GPU-friendly, and requires new ASICS, which means they can't be overwhelmed by hash rate \"sloshing over\" from Ethereum after merge.",
        "created_at": "2021-04-29T15:49:03.722000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "ETG maybe as well? Though that project is incredibly slim on technical detail.",
        "created_at": "2021-04-29T15:50:22.357000+00:00",
        "attachments": null
    },
    {
        "author": "manasbrahmarshiparashuramajankha",
        "category": "general",
        "parent": "",
        "content": "is omg the only childchain layer 2 solution?",
        "created_at": "2021-04-29T18:22:40.353000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Have been bugging ETG a lot",
        "created_at": "2021-04-29T19:29:57.590000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "I know the people behind it but its like Area 51 when it comes to written documentation",
        "created_at": "2021-04-29T19:30:24.046000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "Just looking at the docs and press releases it's really weird, \u003c@!636289909359116290\u003e . Stuff like \"Ethereum wants to shard PoW\", those are words, but I don't know what they mean. They seem nonsense. Granted that may not have been the ETG team directly, or the outlet got it wrong. And stuff like \"we hate 1559, but also tx fees will be near zero\". Okay -- more detail please. If tx fees are already near zero, what's bad about 1559? What makes tx fees be near zero? More gas in the block? But that blows up state. How would this then be \"the people's blockchain\"? Or some other method? But then which? Or just \"we are going to be so low-volume gas won't be an issue, and we plan to address it in these ways going forward?\" Would all be good detail.\n\n Forking a chain is easy. Maintaining it, and doing the R\u0026D to keep it moving forward, that's hard.",
        "created_at": "2021-04-29T21:41:39.401000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Yeah",
        "created_at": "2021-04-29T21:44:26.529000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "I talked with them about their plan....made a lot of suggestions",
        "created_at": "2021-04-29T21:44:34.391000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "They have some good points but I haven't seen any mention of the good points in any news release. So dunno if those points are top secret or non-existent",
        "created_at": "2021-04-29T21:45:00.703000+00:00",
        "attachments": null
    },
    {
        "author": "etaipo",
        "category": "general",
        "parent": "",
        "content": "yeah I'll probably skip ETG then",
        "created_at": "2021-04-29T22:59:48.867000+00:00",
        "attachments": null
    },
    {
        "author": "etaipo",
        "category": "general",
        "parent": "",
        "content": "sounds like it'll be a messy attempt at a mining fork",
        "created_at": "2021-04-29T23:00:17.725000+00:00",
        "attachments": null
    }
]