[
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "Ok sure, although the p2p logic seems nearly identical for txs and blocks.\nThe nodes have 100 connections each so I'd expect that to be enough to bypass some nodes withholding.\nIt feels like something else is going on to do with the pending/queueing logic, as this is unique to tx p2p.\nIt'll help when I can see what these tx are and whether they are valid.\nOne thought (pure conjecture) given that gas price oscillates under 1559:\n- you send a tx that would be valid in the current block\n- by the time it reaches a node the base price has gone up and is too high for the tx to execute\n- so the node queues it rather than adding it to pending and does not relay, and then fails to move it to pending",
        "created_at": "2021-12-07T10:40:48.626000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Would be awesome we have stuck payouts once every week that need to wait for lower gas",
        "created_at": "2021-12-07T15:52:24.612000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "general",
        "parent": "",
        "content": "where should questions about https://forkmon.ethdevops.io/ go? specifically that it is presenting an invalid cert, and as of yesterday was running an out of date, known bad besu release?",
        "created_at": "2021-12-07T15:52:30.892000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "Interesting. If possible, would you mind sending the hash of a tx that got stuck over the last 4 weeks? It'll be interesting to see which of my nodes detected it (quite understand if you don't want to!)",
        "created_at": "2021-12-07T15:56:39.087000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Apologies it’s not stuck anymore and I have no idea which one it was in history",
        "created_at": "2021-12-07T16:18:55.117000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "No problem. I'm building a site so soon you'll be able to check yourself whether my nodes have picked up your txs",
        "created_at": "2021-12-07T16:33:01.882000+00:00",
        "attachments": null
    }
]