[
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "I would phrase it as the difficulty bomb is an anti-zombie network device. Co-ordinating a hard fork isn't terribly difficult (eg classic's forks, particularly thanos and diehard) but it does require willing participants.",
        "created_at": "2021-10-25T00:18:51.483000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "Ropsten's heaviest chain right now is actually berlin, so that's a good example of a network someone set miners against and forgot about.",
        "created_at": "2021-10-25T00:19:48.805000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "(this is what I mean by zombie chain)",
        "created_at": "2021-10-25T00:20:53.114000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "not everything can be measured in as simple categories as \"centralized\" or \"decentralized\"",
        "created_at": "2021-10-25T00:46:46.355000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "by that kind of logic you could say bitcoin's reward halving is centralized",
        "created_at": "2021-10-25T00:47:53.593000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "Notice I said more centralized, in the way that it's not a binary choice. I mean that it makes the network require some sort of leadership to coordinate the bomb delay. On every upgrade that changes anything, the bomb may be delayed too, which makes the upgrade fork more prone to succeed and a possible fork against it to halt. So that, if part of the community splits against the upgrade, the dissidents also need to coordinate into their own upgrade to delay the bomb. Under a social fork, it makes harder for the smaller group as it forces them to coordinate too.\n\nBTC halving was set when it started and it happens automatically, no need of a leadership to coordinate it or against it. AFAIK its behavior was never changed. And also it has its own feature, which is decrease currency production over time into a limited total amount. Difficulty bomb has no useful feature on its own.",
        "created_at": "2021-10-25T00:59:58.273000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Stagnation != decentralisation.  The difficulty bomb means that stagnation is not an option. The choice of what to do about that is still fully decentralised.  It could just as easily be argued that Bitcoin is more centralised because the \"no change\" option has such a strong bias towards it, giving the original developers centralised control.",
        "created_at": "2021-10-25T01:03:24.455000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I'm not sure that's really true, but it's just as good an argument as saying that regular upgrades are a form of centralisation.  It's really just that stagnation and centralisation are completely different axis.",
        "created_at": "2021-10-25T01:04:03.524000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "hmm yeah I understand ur point",
        "created_at": "2021-10-25T01:04:07.951000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "it forces against stagnation and sets a timeline into a manual upgrade, it promotes a coordinated and active nodes community, it acts against forks because in case of a fork it benefits the more coordinated group and leads a stagnated group into death",
        "created_at": "2021-10-25T01:07:57.388000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "It doesn't act against forks. If anything it acts for forks. You have to fork regularly or the chain stops.",
        "created_at": "2021-10-25T01:09:27.768000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "I mean, a secondary fork, a split into 2 or more chains",
        "created_at": "2021-10-25T01:10:07.987000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "not a hardfork to make upgrade",
        "created_at": "2021-10-25T01:10:17.230000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Hmm, is there an argument against hard fork and in favor of network upgrade that I'm not aware of?",
        "created_at": "2021-10-25T02:20:15.950000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "really it's just that the social contract between developers and users is skewed more towards \"if you use the software now you should always be able to use it and you'll only miss out on *new* features\"",
        "created_at": "2021-10-25T02:28:00.763000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "that's the irreconcilable difference in values",
        "created_at": "2021-10-25T02:28:30.130000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Same as the argument against the term eth2 - a hard fork sounds like it’s creating a new chain or that it’s a chain split when in fact it’s usually (all but one case?) just a smooth upgrade and there’s still only one Ethereum.",
        "created_at": "2021-10-25T02:31:41.283000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I find this argument compelling.  I accept.",
        "created_at": "2021-10-25T02:48:51.611000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "It's a pitty that the \u003c#796057759858425866\u003e channel has moved to an entire new server. It seemed like it wasn't a very high volume channel and it was nice to follow at least superficially the progress being made",
        "created_at": "2021-10-25T14:40:34.734000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "This channel has been renamed to `uncategorized` to try and signal a little more clearly that it is not just for *any* topic.",
        "created_at": "2021-10-25T15:17:00.744000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "This isn't the first time I've seen this feedback in the last week.  I think there's something valid here but I don't know how to act on it.  With multiple client implementations underway, we hit a point very quickly where we needed separate channels for client specific development discussions, and that didn't feel appropriate to be here on the R\u0026D server anymore.",
        "created_at": "2021-10-25T15:18:46.883000+00:00",
        "attachments": null
    },
    {
        "author": "symme7ry",
        "category": "general",
        "parent": "",
        "content": "I'm looking for a detailed analysis of how censorship (by a group of validators) would be dealt with by ETH2. Is there a good writeup on this? Specifically I'm wondering: If a censorship attack is happening, how would the censoring validators be identified (so we could slash them)? I assume there's no automatic way to identify and slash censorers, so it would require community coordination. If you tried to slash any particular validator, couldn't they easily say \"I just happened to not include the censored transactions in my block for \u003cother reasons\u003e\"? How could we have high confidence that those reasons weren't credible?",
        "created_at": "2021-10-25T15:32:18.988000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "the broader community historically understands hard forks to be something contentious, and also something where they end up with 2 coins with financial value. this is improving lately, but the misconception persists. IMO it's easier to change the term used than explain \"no this is a non-contentious hard fork\"\n\n(hopefully I can double convince you)",
        "created_at": "2021-10-25T15:51:08.661000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "There is no formal process defined.  IN fact, I would argue *against* defining a formal process because such a process can be gamed and we *specifically* are reserving the process for situations that *cannot* be automatically dealt with, which weakly implies that a well defined process may not be possible.",
        "created_at": "2021-10-25T15:53:52.368000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The gist though is in the case of blatant censorship, you can lead with a threat that \"anyone who continues to censor X will be slashed via user activated slashing\".  If censorship continues at that point, people don't have a legitimate excuse (in the rare case they did have an excuse before hand).",
        "created_at": "2021-10-25T15:54:54.453000+00:00",
        "attachments": null
    },
    {
        "author": "symme7ry",
        "category": "general",
        "parent": "",
        "content": "OK, that makes sense. Am I right that censorship in PoS would require \u003e 50% of stake just like in PoW, and would look essentially the same? Like if a validator proposes a block that contains txns that the censorers don't like, the censoring cartel orphans it and only builds on chains where it's orphaned, and they win because they get to propose more than 50% of blocks?",
        "created_at": "2021-10-25T15:57:44.635000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "I'd make a question prior to that still. How do we identify on Ethereum that a tx is being censored?",
        "created_at": "2021-10-25T16:00:06.359000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think so, though someone else may be able to answer better than I on that.  You need 66% to achieve finality I believe, but if \u003e50% are censoring the remaining honest validators will follow along I think.",
        "created_at": "2021-10-25T16:01:42.661000+00:00",
        "attachments": null
    },
    {
        "author": "lem888",
        "category": "general",
        "parent": "",
        "content": "I actually have a somewhat related question. Is there a way to get off-chain data on slashings etc.? I've been collecting data on validator slashings (specifically when slashing happened vs when whistleblowing happened), but everything i have is from beaconscan/beaconcha.in and all the data there is on-chain stuff.",
        "created_at": "2021-10-25T16:02:45.621000+00:00",
        "attachments": null
    },
    {
        "author": "symme7ry",
        "category": "general",
        "parent": "",
        "content": "Seems doable non-automatically. People will start complaining about their txns being censored. They'll share them. Any other user can try re-broadcasting that txn and see for themselves that it's paying a high enough fee and the network is ignoring it.",
        "created_at": "2021-10-25T16:11:09.705000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "interesting... but where would the complaint be done? is there any ETH official or popular forum where it would be seen?",
        "created_at": "2021-10-25T16:39:11.167000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "reddit, ethereum-magicians, eth-research, ...",
        "created_at": "2021-10-25T16:46:14.144000+00:00",
        "attachments": null
    },
    {
        "author": "hikariws",
        "category": "general",
        "parent": "",
        "content": "tnx gonna take a look on them",
        "created_at": "2021-10-25T16:46:57.307000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "1/3 and you can stop block finality",
        "created_at": "2021-10-25T17:44:08.048000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "That's a very expensive attack to carry, so I'd say the protocol deals with this well. What \u003c@301186049323958275\u003e is pointing is correct though, \u003e50% are censoring then the rest will follow.",
        "created_at": "2021-10-25T23:01:06.354000+00:00",
        "attachments": null
    },
    {
        "author": "lem888",
        "category": "general",
        "parent": "",
        "content": "Anyone knows that please? Would really appreciate!",
        "created_at": "2021-10-25T23:59:24.659000+00:00",
        "attachments": null
    }
]