[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Only development teams do as far as I know.",
        "created_at": "2021-02-20T01:42:10.997000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Ah ok ty",
        "created_at": "2021-02-20T01:49:23.059000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "One of the arguments in favor of mining (specifically GPU mining) is that someone in a country where the purchase/sale of crypto-currency is banned could use a modern GPU to convert electricity (usually bought in local currency) into ETH which they could then use to purchase goods/services online.  After The Merge, this will no longer be possible.  This conversion doesn't need to happen at a profit, it could happen at a small loss and still be valuable to people in those situations.\n\nI wonder if there is some system we could implement that mints a small amount of ETH per block (e.g., 0.01 or something, significantly less than ETH2 inflation) to people participating in this mining after the merge?  We would, presumably, want to switch over to something like ProgPoW since the goal is to have this service available to desktop users and not mining farms (we can't prevent farms, but we can at least make it so desktop users don't have to pay 2-5 times as much per ETH when mining with their desktop GPU).\n\ncc \u003c@273808422753796097\u003e since I know you are a fan of social goods, curious to hear if you think this would qualify as a social good?",
        "created_at": "2021-02-20T05:48:46.884000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Having the reward be low (like 0.01 ETH per block, or maybe even lower) helps us make this not particularly attractive for mining farms.  0.01 ETH at today's price is on the order of $40M / year (revenue, not profit, hopefully profit is negative).  Maybe 0.001 would be better?  The goal is to make it so there is *some way* for people to convert electricity into ETH, not to fund large enterprises.",
        "created_at": "2021-02-20T05:50:19.838000+00:00",
        "attachments": null
    }
]