[
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "possible, but very unlikely to be longterm successful. there are existing PoW EVMs already",
        "created_at": "2021-07-06T01:36:59.510000+00:00",
        "attachments": null
    },
    {
        "author": "babyxbt",
        "category": "general",
        "parent": "",
        "content": "Thanks 🙏🏻",
        "created_at": "2021-07-06T03:46:10.019000+00:00",
        "attachments": null
    },
    {
        "author": "foxis86",
        "category": "general",
        "parent": "",
        "content": "That’s how Eth Classic was created, but it didn’t turn out be a threat to Ethereum. BTC had many forks too, none of them replaced BTC",
        "created_at": "2021-07-06T04:31:58.163000+00:00",
        "attachments": null
    },
    {
        "author": "babyxbt",
        "category": "general",
        "parent": "",
        "content": "Yep. I know. I just wrote like 2 pages explaining the difference between ETH and ETC for Reddit. I wasn’t sure if it happened again would the miners keep ETH meaning the abbreviation and all of the marketing capital the name alone holds",
        "created_at": "2021-07-06T04:33:33.360000+00:00",
        "attachments": null
    },
    {
        "author": "foxis86",
        "category": "general",
        "parent": "",
        "content": "I think user adoption is what’s going to determine which is the real ETH. Even if miners fork, all Eth ecosystem (exchanges, wallets, block explorers) will update to Eth 2. So the miners will have to develop new ecosystem for their fork",
        "created_at": "2021-07-06T04:36:51.165000+00:00",
        "attachments": null
    },
    {
        "author": "foxis86",
        "category": "general",
        "parent": "",
        "content": "That and also there is the difficulty bomb",
        "created_at": "2021-07-06T04:38:01.518000+00:00",
        "attachments": null
    },
    {
        "author": "foxis86",
        "category": "general",
        "parent": "",
        "content": "I’m more worried about fork of flashbot which allows miners to collude on block size after EIP 1559",
        "created_at": "2021-07-06T04:38:37.642000+00:00",
        "attachments": null
    },
    {
        "author": "foxis86",
        "category": "general",
        "parent": "",
        "content": "But even if that happens, Vitalik suggested idea to increase the slack to 3x which would require 2/3 participation for successful attack",
        "created_at": "2021-07-06T04:41:31.363000+00:00",
        "attachments": null
    },
    {
        "author": "babyxbt",
        "category": "general",
        "parent": "",
        "content": "I’ve written extensively on what I call ETH gas price fixing. I can’t prove it’s happening but there is a lot of evidence to suggest back in april and May something was going on. Either they colluded about price or they colluded to drop major amounts of ETH on the market at predetermined prices or at predetermined times speeding up this past consolidation period. Someone was using a destructive selling strategy (this exists in stock markets)",
        "created_at": "2021-07-06T04:45:27.393000+00:00",
        "attachments": null
    },
    {
        "author": "babyxbt",
        "category": "general",
        "parent": "",
        "content": "That’d be like hacking a website and when you get through your computer is physically on fire.. meaning it’s not worth it",
        "created_at": "2021-07-06T04:46:13.478000+00:00",
        "attachments": null
    },
    {
        "author": "babyxbt",
        "category": "general",
        "parent": "",
        "content": "Destructive sales defined (defined as the intentional use of unethical tactics including lying, misrepresenting product/service performance, misleading the client, spreading rumors about the competition, etc. by professional salespeople) —— sorry I got off topic",
        "created_at": "2021-07-06T04:47:07.736000+00:00",
        "attachments": null
    },
    {
        "author": "babyxbt",
        "category": "general",
        "parent": "",
        "content": "And I understand financial activism but that only hurts miners because it makes their ETH worth less too.. I guess this all goes back to how powerful miners truly are as a collective and how I am so happy to eventually be able to run my own validating node w 32 ETH",
        "created_at": "2021-07-06T04:49:53.766000+00:00",
        "attachments": null
    },
    {
        "author": "foxis86",
        "category": "general",
        "parent": "",
        "content": "I don’t think miners have that  tools or even motivation to collude to this degree. But whales might be able to, especially that they could use things like MEV and flashloans . At least gas prices now will be semi-regulated by the network with 1559.",
        "created_at": "2021-07-06T04:55:26.907000+00:00",
        "attachments": null
    },
    {
        "author": "babyxbt",
        "category": "general",
        "parent": "",
        "content": "You’re right - I wish I had the education in DeFi  back then that I have now .. it’s not hard to watch whales buying and selling once you get the hang of it - that’s why the ETH Blockchain is so amazing to me. We can look back on transactions for ever in theory",
        "created_at": "2021-07-06T04:57:42.404000+00:00",
        "attachments": null
    },
    {
        "author": "foxis86",
        "category": "general",
        "parent": "",
        "content": "Indeed. It would be cool if some develop open Big Data platform to perform blockchain analysis, which enables developers to write tools that employs AI , machine learning, pattern recognition,..etc  on the blockchain. The blockchain is really hard to analyze and we lack open tools as community to understand what’s going on",
        "created_at": "2021-07-06T05:05:55.359000+00:00",
        "attachments": null
    },
    {
        "author": "babyxbt",
        "category": "general",
        "parent": "",
        "content": "Yea but limit those tools lol .. or maybe not .. large institutions are already paying for algotrading bots, AI, machine learning to help them make money. Would be nice if the normal ppl who brought the value to ETH could do the same@",
        "created_at": "2021-07-06T05:12:48.043000+00:00",
        "attachments": null
    },
    {
        "author": "babyxbt",
        "category": "general",
        "parent": "",
        "content": "Just to understand real time data - not to profit",
        "created_at": "2021-07-06T05:13:12.674000+00:00",
        "attachments": null
    },
    {
        "author": "foxis86",
        "category": "general",
        "parent": "",
        "content": "Lol yea it could be double edged sword. There will be always malicious users",
        "created_at": "2021-07-06T05:15:22.890000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I'm very much not a fan of locking down Discord.  There are a number of people who have become contributors who started by just popping in and talking.",
        "created_at": "2021-07-06T05:39:20.351000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "Some channels open, some closed?",
        "created_at": "2021-07-06T05:51:42.641000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I don't really see the value in that.  It isn't like we have one channel that is heavily targeted and every other channel is perfectly contained.  I also find it unlikely that people would simply walk away because they couldn't talk in one channel but they could talk in others.",
        "created_at": "2021-07-06T05:58:09.440000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "Might be bad idea but how about 5 min test to ensure ppl have requisite knowledge to contribute to discussion? I personally would love if there were easy ways to learn what's needed without looking into github specs :/",
        "created_at": "2021-07-06T06:09:42.417000+00:00",
        "attachments": null
    },
    {
        "author": "clefru",
        "category": "general",
        "parent": "",
        "content": "I often have questions that are on-topic, but I don't feel qualified to ask them, because I know that those questions are rather basic in nature and I don't want to busy core devs with my chatter. So I withhold them even if they are technically on topic.",
        "created_at": "2021-07-06T09:59:14.393000+00:00",
        "attachments": null
    },
    {
        "author": "clefru",
        "category": "general",
        "parent": "",
        "content": "Maybe I should just ask in \"education\".",
        "created_at": "2021-07-06T09:59:59.451000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003c#672059911034634243\u003e is for discussing how we as a community can better educate people.  It isn't meant to be a Q\u0026A.",
        "created_at": "2021-07-06T10:08:03.189000+00:00",
        "attachments": null
    },
    {
        "author": "albusdompeldorius",
        "category": "general",
        "parent": "",
        "content": "Perhaps you could ask them in https://ethereum.stackexchange.com/ ?",
        "created_at": "2021-07-06T10:10:49.650000+00:00",
        "attachments": null
    },
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "would be great if that was pinned in the channel, I really thought it was the place for questions\nI second what \u003c@!381414973747757059\u003e said but on-topic but basic questions - would be good to have a dedicated place for those",
        "created_at": "2021-07-06T12:15:40.854000+00:00",
        "attachments": null
    },
    {
        "author": "aldekein",
        "category": "general",
        "parent": "",
        "content": "Please post to the relevant issue – https://github.com/ethereum/devops/issues/698 - it's important to collect all feedback in one place.",
        "created_at": "2021-07-06T13:32:08.713000+00:00",
        "attachments": null
    },
    {
        "author": "aldekein",
        "category": "general",
        "parent": "",
        "content": "Additionally, allcoredevs starts with 'a' and is on the top of the list, so lazy users see it and do not read further.",
        "created_at": "2021-07-06T13:36:13.572000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "\u003c@!154453240535056384\u003e not sure I really see the point of making Goerli a shard.. the state isn't meant to be long-lived, it's a testnet",
        "created_at": "2021-07-06T13:40:10.618000+00:00",
        "attachments": null
    },
    {
        "author": "hiturunk",
        "category": "general",
        "parent": "",
        "content": "The point is it's already there and has state and is easy to transition to this purpose - as evidenced by the bridges being built that were linked in \u003c#745077610685661265\u003e.\n\n Alternately, do you think we should instead focus on building out a new shard for this purpose explicitly? One must be built at some point to fulfill the promise of Ethereum 2.0 [or else the Beacon chain has nothing to synchronize]",
        "created_at": "2021-07-06T13:41:18.385000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "Plan is merge before sharding. Don't wanna half ass it",
        "created_at": "2021-07-06T14:05:59.946000+00:00",
        "attachments": null
    },
    {
        "author": "syentist.",
        "category": "general",
        "parent": "",
        "content": "I'd recommend having only verified Eth devs/researchers to have write access to most of the current discord sub-channels and just have one new subchannel for community members to discuss/ask entry level questions/suggestions etc",
        "created_at": "2021-07-06T14:35:30.160000+00:00",
        "attachments": null
    },
    {
        "author": "syentist.",
        "category": "general",
        "parent": "",
        "content": "And perhaps have a landing page for new users informing them of the site decorum (i.e. read but don't comment unless you're a core dev/researcher)",
        "created_at": "2021-07-06T14:37:31.722000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "general",
        "parent": "",
        "content": "FYI, the andre cronje goerli thing seems to be a bridged version of mainnet ETH on goerli. No actual goerli ETH with value",
        "created_at": "2021-07-06T14:38:05.335000+00:00",
        "attachments": null
    },
    {
        "author": "hiturunk",
        "category": "general",
        "parent": "",
        "content": "That was not explicitly stated and if it was unwelcome for me to post in \u003c#745077610685661265\u003e, I apologize, I was only asking why Core Devs are making fun of the idea of bridging Goerli and using it as infrastructure. It's actually a compelling idea!\n\n We've been in a gas auction all day, continuously, on news of London - So perhaps discussion of scaling solutions is more appropriate than making fun of the people building them. Although it is unexpected to see Goerli get used that way - perhaps it could actually be useful to scaling if we bridged testnets or eventually transitioned them in to shards under the beacon chain (Maybe even before the Eth Layer 1 shard!)\n\n Do developers in this space not have a right to comment here?\n\nIf not, then you are correct, there could certainly be better permissions set on the channels so we, as users of the discord, have better understanding of where our commentary is welcome and where it's not. I'm a user in 500+ Discord servers, so forgive me if a notification (on what I consider an important) discord server pops up and I reply.\n\n There is NOTHING in the welcome that says anything as what your post suggests to me about the \"decorum\" here.\nI'd further suggest that if those are the expectations we clearly lay them out to avoid situations in which \"new users\" (the community, made up of guys like me who've been in bitcoin since 2012, and Ethereum since the ICO) give their input in an unwelcome way.",
        "created_at": "2021-07-06T18:16:57.309000+00:00",
        "attachments": null
    },
    {
        "author": "hiturunk",
        "category": "general",
        "parent": "",
        "content": "I still reiterate my point that I think the testnets would make ideal initial shards, or even l2 infrastructure. Thanks.\n\nDon't think I'll post there again. 😛",
        "created_at": "2021-07-06T18:22:17.265000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Goerli is a proof of authority chain.  It is controlled by a handful of developers.  Nothing on it should have any value, because there is no decentralized security.  The chain could be turned off at any time (and it commonly is, although often not on purpose).\n\nIt is worth pointing out that this is an R\u0026D server, as per its name.  More general proposals and discussions often happen at https://ethereum-magicians.org/",
        "created_at": "2021-07-06T18:45:15.735000+00:00",
        "attachments": null
    },
    {
        "author": "hiturunk",
        "category": "general",
        "parent": "",
        "content": "\u003c@!144468805697929216\u003eI do think if that's incorrect decorum it would help a lot to just clearly lay that out somewhere, or as the previous poster noted, just toggle some permission(s) in the discord so guests don't accidentally comment where they're unwanted - thanks for the link though. 😄\n\nIn reference to, Goerli is a PoA chain..so are quite a few other scaling solutions..but this is a completely valid argument.",
        "created_at": "2021-07-06T18:45:56.096000+00:00",
        "attachments": null
    }
]