[
    {
        "author": "cryptoblockchaintechnologies",
        "category": "general",
        "parent": "",
        "content": "It is a shame to see so many new people in the crypto space that are not like the first people who came here. The first people understood what crypto meant in standing up against the system and the influence of powerful governments and media. The new people are the ones so easily controlled by the media and lack the ability to do their own research and think for themselves.\n\nPut quite bluntly, the POW energy thesis is a lie to promote POS. I am in favor of POS for Ethereum for one reason, it has always been on the roadmap. I don't need some woke crutch to convince me it is the right thing to do for society.\n\nStick to facts not fantasy.",
        "created_at": "2021-03-27T08:46:43.104000+00:00",
        "attachments": [
            {
                "type": "image/jpeg",
                "origin_name": "Screenshot_20210312-150719_Brave.jpg",
                "content": "e67cb6f0643edc63d7b2ae20ce55840f5eef9506e03733d7ef61f39875e78189"
            },
            {
                "type": "image/jpeg",
                "origin_name": "Screenshot_20210312-150845_Discord.jpg",
                "content": "1c97f30c0129c575d87fb4735b13f6fd1dfbb970a86732a9b3da89cc9ba6db32"
            }
        ]
    },
    {
        "author": "philburrt",
        "category": "general",
        "parent": "",
        "content": "I actually posted that pie chart on my twitter today lol",
        "created_at": "2021-03-27T08:47:58.116000+00:00",
        "attachments": null
    },
    {
        "author": "philburrt",
        "category": "general",
        "parent": "",
        "content": "and I agree, don't think it's a big deal. but clearly this perception  is powerful",
        "created_at": "2021-03-27T08:48:14.810000+00:00",
        "attachments": null
    },
    {
        "author": "philburrt",
        "category": "general",
        "parent": "",
        "content": "on the other hand, it forces ppl to learn about the tech",
        "created_at": "2021-03-27T08:48:42.469000+00:00",
        "attachments": null
    },
    {
        "author": "cryptoblockchaintechnologies",
        "category": "general",
        "parent": "",
        "content": "Yeah it is all part of the media whilwind to promote Ethereum over Bitcoin. It is coming",
        "created_at": "2021-03-27T08:48:55.193000+00:00",
        "attachments": null
    },
    {
        "author": "philburrt",
        "category": "general",
        "parent": "",
        "content": "at least the few who decide to think critically",
        "created_at": "2021-03-27T08:48:56.875000+00:00",
        "attachments": null
    },
    {
        "author": "philburrt",
        "category": "general",
        "parent": "",
        "content": "they're gonna LOVE eth when it's PoS. it's like the environment narrative just 100x'd in importance",
        "created_at": "2021-03-27T08:49:57.296000+00:00",
        "attachments": null
    },
    {
        "author": "cryptoblockchaintechnologies",
        "category": "general",
        "parent": "",
        "content": "Yeah seeing all this media hype about how POS is so pro energy only convinces me more that the people with money and power are on board. This is how they play the game, to win. Won't be the first time I benefited from knowing which game they are playing and won't be the last.",
        "created_at": "2021-03-27T08:53:04.013000+00:00",
        "attachments": null
    },
    {
        "author": "cryptoblockchaintechnologies",
        "category": "general",
        "parent": "",
        "content": "Would not be suprised post merge to see more (some places have already started) government  regulations on POW mining and higher electricity rates. Probably also one of the drivers pushing the merge quicker.",
        "created_at": "2021-03-27T08:56:36.490000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "For one, PoW's energy consumption makes it easy to physically locate mining farms. It's a big fat target for oppressive governments.\n\nIt's much easier to conceal staking validators under oppressive regimes - and this really hits home for me.",
        "created_at": "2021-03-27T12:33:28.564000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "Since we are on Ethereum discord, Ethereum was never ever meant to be mined in large farms. If you read the yellow paper it was agaist ASICs and the centralization of mining. I see it as a failure on the development side to not make algo changes as needed to keep the intended state so small miners could be the primary miner. If this were true there would be very little farms which would not be an issue for locating them by oppressive governments. So POW only misses meeting your goals because it failed at living up to POW goals it made in the yellowpaper.",
        "created_at": "2021-03-27T14:16:45.972000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "Small farms are *still* a blip on the energy grid radar - afaik Russian govt did want to start tracking e.g. apartments that consume too much electricity",
        "created_at": "2021-03-27T14:18:34.599000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "And yet the years of negative experience I and most people of POS coins are discounted here. Trust me there are a lot more negatives for POS than POW just in governance alone.",
        "created_at": "2021-03-27T14:20:30.335000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "Always easier to think the grass is greener. I can't wait for the admissions of how well we had it when all we had to worry about was miners and as long as we did not burn their own fees in front of their faces they were good with any EIP",
        "created_at": "2021-03-27T14:22:26.598000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "well, it is tricky, sure - given that blocks have to be essentially mined online, with verifiable random\n\nbut the arms race of PoW is not really tenable long-term",
        "created_at": "2021-03-27T14:23:19.980000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "PoS or dPoS? I may be wrong, but afaik real, large scale PoS are just Polkadot and Cosmos right now",
        "created_at": "2021-03-27T14:24:24.072000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "dPoS and PoS with low validator count are PoA with bells and whistles",
        "created_at": "2021-03-27T14:24:40.901000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "And then there is the reality coming soon that you will need more than a raspberry Pi to run a validator. Then how does that fit into 3rd world countries where not only do people need $60K to stake they need to buy a $1500 system. Oh but then you will say they can do partial staking with ex changes. And guess what, you are now going away from crypto needing to be decentralized. So you might want to look into how the long run has worked out for other coins in terms of centralization. One thing is for sure is it will be so much easier for the 3rd world oppressive government you speak of to sieze someone's coins at an exchange being staked than in a HW wallet being mined in POW.",
        "created_at": "2021-03-27T14:29:02.215000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "There is a world of difference between rpi and GPU farm\n\nI don't mind a good Ryzen machine (even available in NUC form factor) being a requirement for a validator",
        "created_at": "2021-03-27T14:32:12.261000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "Yes, it's more expensive than rpi, but at least it's still portable, doesn't require that *much* power, and is general purpose equipment after all",
        "created_at": "2021-03-27T14:32:50.267000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "Also the Ethereum yellowpaper talked about moving to POS as a roadmap and was written at a time when it still an idea mostly and not a reality. Now that we have seen how horrible it is we still continue to move forward with the notion it will be better. Why is this? Ethereum already has a governance issue, how will it get better with POS when all POS coins have issues with governance except a few.\n\nI find it fascinating how people choose to only take seriously something that was only mentioned twice in the yellowpaper (POS) but disregard how against ASICs Ethereum was since they were mentioned 9 times and called a plague.",
        "created_at": "2021-03-27T14:40:08.735000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "PoS is not _horrible_ so the rest of your message is invalid",
        "created_at": "2021-03-27T15:41:58.460000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "you can't just take the percentage of energy that comes from renewables in the location and assume mining uses it in the same proportion. this may be true for hydro which is somewhat stable, but the sun doesn't shine at night and mining is a 24/7 activity, shutting down every night would destroy the roi. mining is the worst possible energy demand pattern for renewables - constant baseload. its only advantage over other demand sources is that it can be in remote locations.",
        "created_at": "2021-03-27T16:19:34.604000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "if we stretch the renewable definition a bit, nuclear power has stable output",
        "created_at": "2021-03-27T16:55:17.950000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "thinking about it, renewable energy is recent energy from the sun, while fossil energy is old energy from the sun \u003c:peepothink2:754852084121206824\u003e nuclear doesn't fit",
        "created_at": "2021-03-27T19:54:18.677000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "but breeder reactors do produce new fuel 🙂",
        "created_at": "2021-03-27T20:46:38.999000+00:00",
        "attachments": null
    }
]