[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "now that everyone seems to be happy to wildly guess timings, I'll vote that Q1 2022 is still too optimistic. The specs for the merge are very much fluctuating. And even though implementation is very much underway and may be ready way sooner than that (I'd expect most of the engineering work be done by this northern hemisphere Summer). This thing has only been tested for security in the brains of the protocol researchers. When we have some actual testnet, the actual work on trying to break it will start, and this will take several months and possibly several iterations of testnets. Fuzzing, DDos, eclipse attacks, and whatever is that people may try to do to this will take time and effort. And as far as I can tell, the people that will be doing that work, already have their hands full with other areas of research/engineering. So I wouldn't say those betting on 2023 are crazy, and certainly wouldn't call Q1 2022 conservative.",
        "created_at": "2021-05-13T01:27:39.435000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "do you expect the testnet and validation process to be at least slightly faster due to learned experiences from the Beacon Chain?",
        "created_at": "2021-05-13T01:29:47.810000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I'd guess that testing will be slower, as the execution layer is much more complicated, more valuable, and with many more attack vectors. Once that the network actually is validating for something, there will be an incentive to attack it. Currently just a little over 4M ETH are at stake, as soon as we merge there's over 100M in danger. If I were to bet I'd say that work will be ready early, and then it will be tested as much as possible, and only deployed in case it's either absolutely necessary, or everyone from every corner is satisfied with testing. The latter I think will very hardly happen before Q1 2022, it may, but I wouldn't say it's a \"conservative\"  bet.",
        "created_at": "2021-05-13T01:34:05.926000+00:00",
        "attachments": null
    }
]