[
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "\u003c@301186049323958275\u003e the POW chain is supposed to become a shard right? So could it be maintained with a low block reward? That also helps reduce the risk of a separate pow chain continuing and competing with the pos chain. I wrote on eth magicians that a seperate pow chain may offer price competition for the pos chain causing them both to race to the bottom in a battle for business.\n\nI don’t see the argument for paying the equivalent of their electrical costs unless@every other coin they could mine pays less than that.",
        "created_at": "2021-02-21T06:26:51.801000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "No, it will be maintained by PoS.  We would need to add in something new to reward PoW hashing if we wanted to provide an avenue to go from electricity to ETH.",
        "created_at": "2021-02-21T07:02:13.414000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Ah thanks my mistake",
        "created_at": "2021-02-21T07:02:46.727000+00:00",
        "attachments": null
    },
    {
        "author": "cronoss5638",
        "category": "general",
        "parent": "",
        "content": "Just want to say that I really like this idea and the thoughts behind it 🙂\n\n\u003c@!636289909359116290\u003e  Conveniently, it also highlights a _huge_ advantage of favoring GPU-mining  over ASIC-mining today: Allowing the possibility to obtain ETH without KYC _using commodity hardware_.\n\nIf you're going to implement this after PoS you might also consider switching to a PoW scheme targeted at CPUs (like Monero's RandomX) or maybe even create one targeted at the hardware acceleration in smartphones (if possible).",
        "created_at": "2021-02-21T13:01:29.782000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I don't see this as being a core function of Ethereum.  No reason why someone couldn't create an ERC-20 that awarded tokens for some sort of useful work and that could be swapped for ETH if desired, but I'd like to see us move past the \"burn electricity for security\" narrative.",
        "created_at": "2021-02-21T14:32:34.323000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This wouldn't be for security at all.  It would be a social good.  A small tax on Ethereum holders (via inflation) in exchange for allowing people in restricted/censored situations to acquire ETH.",
        "created_at": "2021-02-21T14:41:10.237000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "You cannot just \"create a token\" for this, because that token would need to have value to be useful.",
        "created_at": "2021-02-21T14:41:41.166000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "That would be the point of it doing some sort of useful work (folding, hunting primes, anything).  Make the work worth something.",
        "created_at": "2021-02-21T14:48:54.787000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It is very non-trivial to come up with useful work that has the property that it is many orders of magnitude easier to verify the result than to calculate the result.",
        "created_at": "2021-02-21T15:30:23.364000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Sure, but the point would be to not make it part of the protocol.  Having a \"work for tokens\" model could be a simple \"burn electricity for ETH\" in the degenerate case easily enough, but would be bounded and allow for more interesting work.",
        "created_at": "2021-02-21T18:08:24.740000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "Would anyone find usefulness in an open source crypto tax software? The current options out there are pretty rediculous ($50+ to format a. csv with your transactions)",
        "created_at": "2021-02-21T22:20:15.865000+00:00",
        "attachments": null
    },
    {
        "author": "definitelynotcharles7176",
        "category": "general",
        "parent": "",
        "content": "This seems like a fantastic project or even business idea really. From what I can tell, many more conventional business folk getting into this thingy.",
        "created_at": "2021-02-21T22:21:00.187000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "I mean idk about business just cause there are already a bunch of amazing businesses that do it but at least the option to do it automatically would be good",
        "created_at": "2021-02-21T22:24:23.551000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "Also would be interesting to build it as a tool so softwares like coinbase could output tax info automatically",
        "created_at": "2021-02-21T22:25:07.662000+00:00",
        "attachments": null
    },
    {
        "author": "definitelynotcharles7176",
        "category": "general",
        "parent": "",
        "content": "It seems you know a lot about the space and I'm not well informed. \n\nIn your opinion, why would it be a great OS project? It seems like there are many dependencies and sensitivities (tax laws changing and mistakes hurt). I don't know a lot about OS theory but I would like to hear your thoughts to improve my understanding.",
        "created_at": "2021-02-21T22:25:43.047000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "Oh so the reason OS is ideal is for exactly that reason. As tax laws change, formats change, etc. It'll allow for incremental changes to the software",
        "created_at": "2021-02-21T22:35:25.797000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "It also doesn't have to nice.",
        "created_at": "2021-02-21T22:35:36.672000+00:00",
        "attachments": null
    },
    {
        "author": "alita85",
        "category": "general",
        "parent": "",
        "content": "It's just a tool",
        "created_at": "2021-02-21T22:35:39.868000+00:00",
        "attachments": null
    }
]