[
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Guys is ETH 2.0 staking profitable? Any guides for running your own nodes? Any advice? Anyone knowledgeable please!",
        "created_at": "2021-05-21T02:05:09.945000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "https://discord.gg/P2AEf8PX",
        "created_at": "2021-05-21T02:06:26.612000+00:00",
        "attachments": null
    },
    {
        "author": "halfinney.",
        "category": "general",
        "parent": "",
        "content": "\u003c@552133098075193354\u003e is there any conclusion on the timeline you proposed in the ACD channel? I don’t see a concrete yes/no or what needs to be done from any teams",
        "created_at": "2021-05-21T15:25:13.429000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003c@!487281155679191041\u003e clearly the teams need time to test the txn pool stuff, and I suspect that's what they are/will be working on. We'll see on the next ACD call where everyone is at. It can be hard to give a good estimate for this type of stuff because there are unknown unknowns. At least I know where most of the issues are now 🙂",
        "created_at": "2021-05-21T15:32:32.168000+00:00",
        "attachments": null
    },
    {
        "author": "halfinney.",
        "category": "general",
        "parent": "",
        "content": "Thanks! I think word needs to be put on Twitter about this. People have unrealistic expectations about 1559 happening mid July and it sure seems that devs might not be completely on board with that because of mutiple factors, the tx pool testing stuff being one of them. I see a lot of influencers constantly mentioning the July 14th date. It will only get cleared up if it comes from you or from someone in an official capacity. A simple trivial tweet from the Ethereum JS team also got huge amount of likes and retweets. I feel public expectations need to be readjusted at least till the client teams have enough confidence",
        "created_at": "2021-05-21T15:41:28.806000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "So, the discord is public, anyone interested can read here. I put out updates every two weeks at most, and doing so more frequently often leads to things being changed. After the next ACD, I'll be sharing the status, and on the past call we made it clear the July 14th date was an \"everything goes right\" date (see: https://twitter.com/TimBeiko/status/1393235240974311429). If we decide that date doesn't make sense anymore on the next call, that will be communicated then as well.",
        "created_at": "2021-05-21T15:43:55.988000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Until then, of course, everyone is free to look at the code/discord/etc. and \"read the tea leaves\" 😅",
        "created_at": "2021-05-21T15:44:16.899000+00:00",
        "attachments": null
    }
]