[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Are you guys following the experiments with JiuZhang 2.0? \u003chttps://journals.aps.org/prl/abstract/10.1103/PhysRevLett.127.180502\u003e  looks pretty serious, I wonder how long do we have with BLS signatures",
        "created_at": "2021-10-29T09:26:52.770000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "how practical actually is this though?",
        "created_at": "2021-10-29T09:33:37.906000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Who knows, but the orders of magnitude compared to Google's experiment 2 years ago and the fact that these guys are publishing in serious journals (this particular experiment came out in phys. Rev. Lett. And science) says that both they're advancing quite fast and that these guys are serious",
        "created_at": "2021-10-29T09:35:41.176000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "god that image preview is awful on mobile",
        "created_at": "2021-10-29T09:52:57.228000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "I should go back to sleep instead",
        "created_at": "2021-10-29T09:53:16.274000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "\u003c@420951281910284289\u003e you seem to be the right person to ask this. I'm a little over 1 year since I've started looking into crypto and therefore Ethereum. I've experienced in this year a few different feelings about human resources in the community. With some people being celebrities in one niche and completely unknown in others. It seems that there's a rich place to do research about personal influence given that it's a focused community, fairly contained and probably highly connected and measurable. Are there social measures published? More to the concrete side: are there explicit correlations measured of transactions on-chain right after an ACD call, how about an Ethstaker's? And Vitalik appearing with some TV celebrity? I honestly think this info may be worth something.",
        "created_at": "2021-10-29T23:23:48.683000+00:00",
        "attachments": null
    }
]