[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Something with a commit-reveal scheme for transaction submission.",
        "created_at": "2021-06-21T01:58:32.826000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "You would submit your transaction with payment information, bet no transaction details, then after order is established you would submit the details.",
        "created_at": "2021-06-21T01:59:06.883000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The problem is that this makes censorship attacks more powerful as it allows an attacker to cost the sender money by censoring the transaction body.",
        "created_at": "2021-06-21T01:59:46.826000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "another problem is that you need to penalize not submitting the details afterwards. There are ways having the transaction to automatically decrypt after a while. But still it becomes technically a hassle to implement a scheme where transactions go encrypted. It also adds latency to the market and on wild swings where the standard tool is to stop and form a book, it delays this as well.",
        "created_at": "2021-06-21T02:17:53.041000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Have the user pay for the transaction in the commit, regardless of whether it was revealed.",
        "created_at": "2021-06-21T02:19:14.045000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "However, I agree that this solution is not without problems.",
        "created_at": "2021-06-21T02:19:31.379000+00:00",
        "attachments": null
    },
    {
        "author": "tedsteen",
        "category": "general",
        "parent": "",
        "content": "Thanks. So far I've only got 1 concrete answer (Obyte) https://www.reddit.com/r/CryptoCurrency/comments/m8cymx/defi_without_frontrunning/\n\nBut they're not technically a blockchain",
        "created_at": "2021-06-21T07:53:32.706000+00:00",
        "attachments": null
    },
    {
        "author": "gusto_m",
        "category": "general",
        "parent": "",
        "content": "Hello. Please can you advise me? I have done the calculation and return on eth for 271 days. Is it possible that eth will remain on proof of work during this time?",
        "created_at": "2021-06-21T11:08:07.590000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Do not spam the same question in multiple channels \u003c@856485632447873024\u003e.  I answered your question, but deleted it once I saw you spammed.",
        "created_at": "2021-06-21T11:13:47.026000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "it's not only about gas, but you can submit long and short operations in the same transaction and only reveal the winning one later if there's no penalty",
        "created_at": "2021-06-21T11:16:44.456000+00:00",
        "attachments": null
    },
    {
        "author": "gusto_m",
        "category": "general",
        "parent": "",
        "content": "ok a deleted msg i others channels. plz cann you  resend you first answer?",
        "created_at": "2021-06-21T11:20:29.151000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "You would have to pay up front for worst case scenario, and then get refunded at execution time if you use less than that.",
        "created_at": "2021-06-21T11:29:07.549000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I recommend planning on PoW ending this fall for business planning purposes.  PoS may launch later like next year sometime, but for a business that isn't a wise thing to bank on.",
        "created_at": "2021-06-21T11:30:10.004000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "I think some level of centralization is ok here, because the worst case is mev extraction. So it could work by using a sgx-based sequencer. Even if there's a new sgx hole and it's exploited for a while, new microcode updates would fix it. Users could verify that the sequencer they are sending transactions to is running the last version of sgx.",
        "created_at": "2021-06-21T17:23:02.494000+00:00",
        "attachments": null
    },
    {
        "author": "tedsteen",
        "category": "general",
        "parent": "",
        "content": "That's sounds real simple, has it been discussed somewhere? Would love to hear the arguments",
        "created_at": "2021-06-21T17:49:31.523000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "you're close enough that maybe you've already found this, but Flashbots are working on an SGX signer for MEV",
        "created_at": "2021-06-21T18:11:48.479000+00:00",
        "attachments": null
    },
    {
        "author": "steve.eth",
        "category": "general",
        "parent": "",
        "content": "Anyone know of any existing wallet manager software, like https://gnosis-safe.io/,  that allows a team to enforce time delays before you can transfer tokens? This would make it publicly on chain and obvious to the token's community that a transfer has been initialized so there is no surprise that tokens have been transferred or market sold later. \n\nFor example:  a significant amount of the supply is in this custom wallet, managed by the team. If we wanted to transfer out let's say 10,000 tokens , we would have to call the \"initialize\" on chain call and pass in 10,000 as a value that would unlock 10,000 tokens in 1 week from now, assuming the built in time delay is 1 week.  After waiting 1 week, now we have 10,000 tokens unlocked available for transfer.",
        "created_at": "2021-06-21T19:25:10.848000+00:00",
        "attachments": null
    }
]