[
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "\u003e if we stretch the renewable definition a bit, nuclear power has stable output\n\u003c@!329594653097721856\u003e  to me nuclear is renewable especially with breeder reactors",
        "created_at": "2021-03-28T01:03:33.757000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Sure it can run out someday, but so can all the material we use to build solar panels.",
        "created_at": "2021-03-28T01:03:47.256000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "From purely a governance standpoint POS goes against crypto founding principals that looked to create a decentralized system. POW chains that make continual updates to their algos will ultimately be the best decentralized crypto on the planet in terms of decentralization. Whether the new people coming into this space even understand what decentralization is seems to have been lost.\n\nThis space is still evolving but I do think Ethereum will eventually be controlled by the very people crypto sought to eliminate from the inner workings. Special interests will eventually take completely over POS and we have already seen the power Defi already has while we are still in POW. It is no coincidence that the powerful are pushing POS by pitting it against POW not being green in an effort to gain support. But it is what it is and I learned a long time ago you cannot fight the powerful. Let them run their course and jump on board the plane and enjoy the ride while it lasts.",
        "created_at": "2021-03-28T01:54:46.051000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "I'm sorry but DeFi effectively *is* Ethereum, or at the very least the primary use case for trustless storage backend",
        "created_at": "2021-03-28T02:06:57.919000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "Crypto is a new technology much like the internet that is still evolving. NFTs are just one example of the limitless applications of smart contracts. Sure Defi is the first significant application, it is however also the riskiest and will eventually implode and the evolve to a lower risk system, much like banking with lower yields. Your statement is like saying America Online, which was the first internet explosion application back then was and always will be the internet.",
        "created_at": "2021-03-28T02:11:56.479000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "your comparison is wrong - America Online as a company didn't retain the foothold, but its services laid the foundation of Internet ecosystem",
        "created_at": "2021-03-28T02:40:04.205000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "general",
        "parent": "",
        "content": "likewise, I can't predict which DeFi companies will survive, but DeFi as a concept is there to stay",
        "created_at": "2021-03-28T02:40:32.473000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "America Online never had a foothold on the internet so saying they did not retain it is incorrect. They were one of the first GUI systems that ordinary, non tech savy people could use to connect to each other through email and chatrooms. Way before them there was IRC, BBSs, and newgroups that were used by technical people that did not need GUIs, much like Linux users today. There was a company called Netscape (who got bought by AOL) that was in fact the first lay to the groundwork for the browsers we have today. The point I was making is Defi is only one of many applications that is and and will be developed on Ethereum. Making broad statements like \"*DeFi effectively is Ethereum*\" is shortsighted and implies without Defi Ethereum would be nothing. Just like AOL they are the first major expansion of a new technology that is reaching a lot of people. The internet survived without AOL and so will Ethereum without Defi.",
        "created_at": "2021-03-28T03:02:44.128000+00:00",
        "attachments": null
    },
    {
        "author": "fliguy.eth",
        "category": "general",
        "parent": "",
        "content": "first to market can usually keep there foothold if they have the community which Ethereum has, fees are hurting it short term but if its gets sorted in the near future it has all the boxes ticked to keep going.",
        "created_at": "2021-03-28T03:51:37.498000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "Fees are not hurting Ethereum, it is full blocks that are. People will always use the network with the highest concentration of people. They will also pay a price premium to do so. The system is working as intended; there are more people wanting to make transactions than the system can handle, so only the people willing to pay a premium get included in a block.  Noone wants to use a network that only 10 people use each day. The inability to scale Ethereum fast enough is the issue. High fees are just a byproduct of hitting the maximum TPS it is currently scaled for. High fees are telling you something is wrong and making one group of people take a pay cut is short sighted, but it does divert attention away from the real issue.",
        "created_at": "2021-03-28T03:55:07.798000+00:00",
        "attachments": null
    },
    {
        "author": "fliguy.eth",
        "category": "general",
        "parent": "",
        "content": "The high fees are a result of full blocks and reaching maximum TPS of course, L2 is the short term solution for that, the fee cut to miners is to increase the value of Ethereum and make it sound money (deflationary), lets just hope it works out that way for everyone and miners end up satisfied when the value goes up, personally as a miner myself I just wish I had gotten in earlier to get more ETH so I can stake on my own 🙂",
        "created_at": "2021-03-28T04:05:21.975000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "\"*the fee cut to miners is to increase the value of Ethereum*\" You might want to do some research on how other monetary manipulation schemes to increase the price of Ethereum relative to BTC have worked over the years. ETH/BTC is at the same place it was at Genesis after many many mining reward reductions. This is just another scheme for short term gains and lacking long term implementation (not strategies) on how to grow network capacity. You would not need to step on other people for short term gains if the hard things are implemented like sharding. Scapegoating a group of people for lack of implementation is shameful. I did get in early and I am running validators. But I am different than most people and I stand back and look objectively at the big picture and do not see any long term value in burning miner fees except a short term play to keep interest up in Ethereum while the developers stumble on scaling TPS.",
        "created_at": "2021-03-28T04:14:01.013000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "unknown.png",
                "content": "7950771b1baecafa6c946d581b4931af896b0c3fa03cfc4057983cfdde1f9ea1"
            }
        ]
    },
    {
        "author": "fliguy.eth",
        "category": "general",
        "parent": "",
        "content": "possibly it wont go as planned, trying to be optimistic and hope that it does, watched this vid and it made some sense to me https://www.youtube.com/watch?v=bWqhn1hXvVc, all we can do is hope that it works out how the developers plan it to work out.",
        "created_at": "2021-03-28T04:19:30.053000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Scam youtube EF account",
        "created_at": "2021-03-28T05:58:56.449000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-28T05:59:02.783000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "unknown.png",
                "content": "4a3eaa19ae4965f95a7c71592fab98c5f0ed2b7fd50eff833fe15f82521f9566"
            }
        ]
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "with 70k followers",
        "created_at": "2021-03-28T05:59:10.224000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "From 2009",
        "created_at": "2021-03-28T05:59:31.154000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2021-03-28T05:59:33.439000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "unknown.png",
                "content": "96534a33586eaf89d7fc00ea4da015ccaf618525c9403601f9b73979ce65cd26"
            }
        ]
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Please don't link to scams in chat.  Some people click on them without reading (or cannot read/comprehend due to language barrier).",
        "created_at": "2021-03-28T07:03:04.367000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Ok deleted the link",
        "created_at": "2021-03-28T07:03:37.992000+00:00",
        "attachments": null
    },
    {
        "author": "huntingisland",
        "category": "general",
        "parent": "",
        "content": "https://twitter.com/IslandHunting/status/1376190720684527622",
        "created_at": "2021-03-28T15:17:35.286000+00:00",
        "attachments": null
    }
]