[
    {
        "author": "cf0009",
        "category": "general",
        "parent": "",
        "content": "\u003c@!97774605351010304\u003e is there some issue? why are we mining empty blocks? https://etherscan.io/address/0xea674fdde714fd979de3edf0f56aa9716b898ec8#mine",
        "created_at": "2021-06-06T06:20:36.535000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "probably mev reward \u003e uncle risk",
        "created_at": "2021-06-06T06:33:48.558000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Practice for London.  😉",
        "created_at": "2021-06-06T06:41:28.113000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Some of those blocks appear to have no MEV.",
        "created_at": "2021-06-06T06:43:14.653000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "At least, nothing that is easily identifiable as MEV.",
        "created_at": "2021-06-06T06:43:21.575000+00:00",
        "attachments": null
    },
    {
        "author": "cf0009",
        "category": "general",
        "parent": "",
        "content": "Nah this isn't it. There's a floor at 11 gwei",
        "created_at": "2021-06-06T06:43:24.728000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "My guess is that Ethermine inappropriately has a gas floor set.",
        "created_at": "2021-06-06T06:43:41.189000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Gas price floor should be on the order of 1 or 2.",
        "created_at": "2021-06-06T06:43:52.503000+00:00",
        "attachments": null
    },
    {
        "author": "cf0009",
        "category": "general",
        "parent": "",
        "content": "wei",
        "created_at": "2021-06-06T06:44:05.334000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Unless Ethermine has some secret information that no one else has.",
        "created_at": "2021-06-06T06:44:08.020000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "nanoeth per gas.",
        "created_at": "2021-06-06T06:44:13.973000+00:00",
        "attachments": null
    },
    {
        "author": "cf0009",
        "category": "general",
        "parent": "",
        "content": "too expensive",
        "created_at": "2021-06-06T06:45:27.305000+00:00",
        "attachments": null
    },
    {
        "author": "cf0009",
        "category": "general",
        "parent": "",
        "content": "polygon has spoilt me",
        "created_at": "2021-06-06T06:45:54.341000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "https://tenor.com/view/batman-thinking-thinking-about-you-think-thinking-of-you-gif-20503421",
        "created_at": "2021-06-06T06:45:59.922000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The EV to miners goes negative somewhere around 0.5-2 nanoeth/gas.",
        "created_at": "2021-06-06T06:46:05.159000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "(I think it is around 0.8 last I checked, accounting only for block reward)",
        "created_at": "2021-06-06T06:46:29.970000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If you account for average MEV on top of that it bumps up to like 1.",
        "created_at": "2021-06-06T06:46:43.216000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I could see some miners with poor connectivity bumping that up to 2 to be safe.",
        "created_at": "2021-06-06T06:46:54.539000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "But 10 seems like a bug or someone doesn't understand how miner opportunity cost works.",
        "created_at": "2021-06-06T06:47:10.266000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Sadly, I think Ethermine is big enough that if they don't fix that we likely won't see gas prices drop to single digits.  😢",
        "created_at": "2021-06-06T06:59:15.706000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This is the nature of the free market though, if Ethermine wants to leave money on the table we can't stop them.  All we can do is encourage hashing power to move to mining pools that aren't leaving money on the table.",
        "created_at": "2021-06-06T06:59:39.805000+00:00",
        "attachments": null
    },
    {
        "author": "cf0009",
        "category": "general",
        "parent": "",
        "content": "We'll get there. The most time sensitive function (more gas) is swapping, and there's not much going on recently",
        "created_at": "2021-06-06T08:21:53.631000+00:00",
        "attachments": null
    },
    {
        "author": "charleshe3782",
        "category": "general",
        "parent": "",
        "content": "Hi, \n\nMy name is Charles He.\n\nI have a Phd in economics, know some game theory, computer sci, worked for tech companies, etc. \n\nRight now I’m writing an “article” or blog post that is skeptical of crypto and blockchain. \n\nI’m not that important, but some important or thoughtful people might read it. \n\nI’ve got a summary or outline below.\n\nI’m here because I wanted to check if there anything substantially wrong, mischaracterized or omitted with the points below. \n\nI could be wrong and I’m genuinely trying to check my opinions and “give crypto and blockchain a fair shake”, but to be clear, the article may still turn out highly negatively.",
        "created_at": "2021-06-06T23:40:53.900000+00:00",
        "attachments": null
    },
    {
        "author": "charleshe3782",
        "category": "general",
        "parent": "",
        "content": "**Liberatarian or “Cypherpunk” Value of Crypto is Limited**\n\nA major facet that motivates crypto is creating alternative currency or information structures that can protect individuals from the flaws of existing institutions, e.g. current governments, “fiat” currency, etc. \n\nI’m uncertain, but I think it’s useful to just lump the entirety of these motivations into the philosophy of “Cypherpunk”, which is a genuine, coherent and principled movement. \n\nHowever, the usefulness of crypto to Cypherpunk (or Cypherpunk as a whole) seems limited:\n\n— It seems clear that the main or popular adherents to crypto do not genuinely believe in Cypherpunk. Instead, by far, speculation and standard entrepreneurship are the main drivers of activity in the crypto space.\n\n— Importantly, the claims of crypto proponents that anonymous transactions and storage of money are useful in societal change seems highly implausible.\n\nFor example, there are narratives that say, disenfranchised women in Afghanistan could be economically liberated by Bitcoin. However, such a person still requires physical freedom and free access to other services (such as the internet). Otherwise, her property, including crypto keys, can be seized like any other property. The societal barriers that would prevent her from holding or using money meaningfully seem unaffected, regardless if she has a large amount of cryptocurrency. These issues seem like they could only be solved by institutional or societal change, which seems genuinely difficult.\n\nSimilarly, the ideas or narratives that cryptocurrency will enable cab drivers to work independent from services like “Uber” or provide financial freedom to mathematicians seem implausible. These claims and their worldviews seem to ignore the key role that organizations and systems of control and governance play in organizing economic activity, and grossly overweight the value of being able to transact small amounts of money.",
        "created_at": "2021-06-06T23:53:13.013000+00:00",
        "attachments": null
    },
    {
        "author": "charleshe3782",
        "category": "general",
        "parent": "",
        "content": "— In 2021, as crypto grows beyond a niche market, it’s not clear it resists the forces of institutions, money or governmental power that it typically claims to oppose. For example, mining and therefore control of the Bitcoin network is concentrated in a single, non-western country. In the US and western countries, if crypto currencies become wholeheartedly accepted, regulations and “KYC” seem likely to be fully inserted into crypto with implications for control and governance. A major, new trendy currency, Chia seems to have an entirely conventional business plan, with copyright enforcement, KYC and 1099 for pools and miners. In ETH, the highest quality community, control or power is concentrated in the hands of a few dozen developers. These people can and have edited the ETH blockchain to seize assets (to recover from a theft) and it is widely understood they effectively control development of functionality as well as “monetary” policy over the currency.",
        "created_at": "2021-06-06T23:53:21.492000+00:00",
        "attachments": null
    }
]