[
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "For example NEAR has implemented state rent (and I would still consider them a \"brand new blockchain\"): \n\n\"NOTE: Accounts are charged recurrent rent for the total storage. This includes storage of the account itself, contract code, contract storage and all access keys.\"\n\nFrom: https://nomicon.io/DataStructures/Account.html?highlight=rent#account",
        "created_at": "2021-10-21T07:24:42.797000+00:00",
        "attachments": null
    },
    {
        "author": "boop3247",
        "category": "general",
        "parent": "",
        "content": "Just learned about this worldcoin thing... some weird stuff right there",
        "created_at": "2021-10-21T18:14:20.231000+00:00",
        "attachments": null
    },
    {
        "author": "boop3247",
        "category": "general",
        "parent": "",
        "content": "with that name I thought it was another OneCoin but apparently it's got some pretty credentialed folks behind it (pretty credentialed is actually an understatement here 😄 )",
        "created_at": "2021-10-21T18:14:37.783000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "\u003c@!386593326402633741\u003e \n\u003e But what confuses me is how to determine WHEN the first whistleblow message happened. Take example of https://beaconcha.in/validator/4390#blocks . It says that this validator was \"Slashed by 11111 at Slot 17,184, Reason: Attestation Violation\". But how do I check when the first whistleblowing message actually took place?\nOK, I'll describe the procedure detailed here, but in addition to what \u003c@!364458974906548225\u003e said, it would be better if you read about slashing before, so that you understand how the mechanism is, before trying to do data analysis on it. In this particular case, the block \u003chttps://beaconcha.in/block/17184#attester-slashings\u003e contains 2 attester slashings. The validator you care about is 4390 which has a surrounding attestation. Attestation 1 is 531 --\u003e 534 and attestation 2 is 532--\u003e533. As the slashing can only happen after 534, we look at what was the slot in which 4390 was assigned in 534. This validator was assigned in 17097 in that epoch. However, the blockroot in the slashed attestation (you can see it's `0xe2f4ec7a975...`  corresponds to slot 17044. That means, the validator sent a vote for block 17044 as target in epoch 534, but that block is from epoch 532. This attestation says that it was in slot 17091, so it looks as though this validator thought it was suppose to attest in slot 17091, and attested for head in slot 17044, which may be due to a badly synced clock. The other attestation was in slot 17072 and looks like a good attestation 532--\u003e533. Finally, the attestation 531--\u003e534 is hard to know when exactly went out. We know it could not have been before slot 17044 cause the head vote is for that. Since the validator wasn't even assigned for slot 17091 my guess is that the clock was off, and the validator thought it was voting to target in 534 when in fact it was 532. This is supported by the fact that the attestation on 532 (which was for slot 17024) was missed. So the actual attestation that triggered",
        "created_at": "2021-10-21T18:36:37.132000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "the slashing I'm guessing it happened on slot 17072",
        "created_at": "2021-10-21T18:37:10.851000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "which is the good attestation 532--\u003e533",
        "created_at": "2021-10-21T18:37:26.332000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "so the earliest this validator could have been slashed is 17073 and was slashed 11 slots later.",
        "created_at": "2021-10-21T18:38:15.940000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Does not look like a \"censored\" message, but may be that there aren't many  slashers out there and peers gossiping those messages.",
        "created_at": "2021-10-21T18:39:50.221000+00:00",
        "attachments": null
    },
    {
        "author": "lem888",
        "category": "general",
        "parent": "",
        "content": "On that, there was a recent slashing due to attestation violation (https://beaconcha.in/validator/42708#attestations). Beaconcha.in says validator was slashed at Slot 2,332,099. So my question is: does this imply that **the slashable offence happened at last slot prior to actually being slashed**? Which in this case is at slot 2,332,096? Beaconcha.in says that this validator actually attested at that slot, though. Please help me understand this.",
        "created_at": "2021-10-21T21:35:26.302000+00:00",
        "attachments": null
    },
    {
        "author": "lem888",
        "category": "general",
        "parent": "",
        "content": "I cross checked this with  Beaconscan data (https://beaconscan.com/slot/2332099#attesterslashing) and it seems like that could be the case. Please correct me if I'm wrong.",
        "created_at": "2021-10-21T21:36:19.061000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "This link shows that the slashable offense was in relation to attestations signed for slot 2332096",
        "created_at": "2021-10-21T21:38:24.524000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "and included in a block at slot 2332099",
        "created_at": "2021-10-21T21:38:33.795000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "so a few slots delaye",
        "created_at": "2021-10-21T21:38:37.858000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "the validator performed some slashable action (double signing) in slot 2332096\n\nIt was included in chain and they were \"slashed\" at slot 2332099",
        "created_at": "2021-10-21T21:39:39.850000+00:00",
        "attachments": null
    },
    {
        "author": "lem888",
        "category": "general",
        "parent": "",
        "content": "okay!",
        "created_at": "2021-10-21T21:39:45.842000+00:00",
        "attachments": null
    },
    {
        "author": "lem888",
        "category": "general",
        "parent": "",
        "content": "sounds good. Thank you so much \u003c@!291925846556540928\u003e  🙂",
        "created_at": "2021-10-21T21:39:55.051000+00:00",
        "attachments": null
    },
    {
        "author": "grgwgrgw",
        "category": "general",
        "parent": "",
        "content": "Can someone give a quick rundown on smart contract wallets (e.g. Argent, Loopring)? I’ve seen marketing articles talk about social recovery etc. but it’s not clicking for me. Any thoughts/links be great.",
        "created_at": "2021-10-21T23:14:36.669000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "your mistake is reading marketing articles, look for more technically-focused articles that have more details like maybe this one https://vitalik.ca/general/2021/01/11/recovery.html",
        "created_at": "2021-10-21T23:43:10.393000+00:00",
        "attachments": null
    }
]