[
    {
        "author": "angyts.eth",
        "category": "general",
        "parent": "",
        "content": "I have something quite off topic to ask. What is the difference between choosing the main net hard fork on 28 july according to expectations VS choosing a later block in august? Cos the \"general expectation\" on most of the internet is london will fork by July...",
        "created_at": "2021-06-24T14:30:51.290000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Security of the network is the main factor. \"General expectations\" will change once we have a block. We will discuss this on the allcoredevs call tomorrow.",
        "created_at": "2021-06-24T15:22:38.751000+00:00",
        "attachments": null
    },
    {
        "author": "angyts.eth",
        "category": "general",
        "parent": "",
        "content": "sorry i'm really a tech noob.. so the later blocks are more likely to be secure compared to the earlier blocks?",
        "created_at": "2021-06-24T15:39:00.682000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "My message wasn't clear. A later block is not \"more secure\", but waiting until we have more data about testnet usage can increase our confidence that everything is working as expected, \u003c@!567865362541182987\u003e. If we wait, then we delay the earliest possible block we can choose for mainnet because we want to keep the same time delay between choosing the block and the actual fork so that clients can put out a release, we can share that in a blog post, and node operators have a few weeks to upgrade.",
        "created_at": "2021-06-24T16:06:54.018000+00:00",
        "attachments": null
    },
    {
        "author": "brandonautry2010",
        "category": "general",
        "parent": "",
        "content": "Hello! If I may ask. Will 1559 bring any benefits to miners? Please excuse my ignorance if this has already been answered.",
        "created_at": "2021-06-24T18:46:48.800000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "it will give them a more stable mining environment by removing the perverse incentive of reorging the chain when pursuing MEV activities generally, transaction fees specifically.",
        "created_at": "2021-06-24T20:20:03.371000+00:00",
        "attachments": null
    }
]