[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "There are no censorship resistant and permissionless rollups yet, except Fuel but that was just a prototype it appears.",
        "created_at": "2021-11-08T02:27:16.301000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Specs, in theory, will be the ability to run a full Ethereum node (including bodies and receipts from since when the rollup started) plus the L2 software.",
        "created_at": "2021-11-08T02:29:51.305000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "What's the standard for censorship resistance and permissionlessness? The operational rollups still have admin keys ready in case bugs show up. And they also tend to run sequencers that provide high performance, but at least in the case of Arbitrum if you get a message to the L1 inbox you only need one honest staker to advance it.",
        "created_at": "2021-11-08T18:22:14.781000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "The admin key is a full stop, but do privileged sequencers that must accept L1 posted messages break censorship resistance and prermissionlessness?",
        "created_at": "2021-11-08T18:23:23.444000+00:00",
        "attachments": null
    },
    {
        "author": "mightypenguin",
        "category": "general",
        "parent": "",
        "content": "A floating gas limit was one of the amazing innovations of Ethereum early on and perhaps something like it could be extended for opcodes.\nHas anyone looked at this?\nWe wouldn't have to allow all opcodes to float, but perhaps there could be an allowed list of ones that can.\nEach client could either hard code the values, or have a benchmark suite to set those values for that client.\nIf worried about large farms pricing out smaller ones, the movement of prices could be limited so that the slowest/most-expensive execution clients would not be priced out too quickly.",
        "created_at": "2021-11-08T20:34:02.419000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003c@!640291058068094985\u003e \n\u003e So I'm pretty new to the Ethereum space and I have some questions: are we going to do the Shangai fork next now that Altair is done or are we going straight for the Merge?\nWe will have a small fork on the PoW chain, Arrow Glacier, which pushes back the difficulty bomb, and then The Merge \n\n\u003e  Do you guys think we can get the Merge out by spring/summer next year? \nThere isn't a clear timeline yet, but that's roughly what we are aiming for. Hard to predict with much accuracy when there are still a lot of unknowns.\n\u003e \n\u003e Also, what can I do to help out? My coding skills are novice at best but I want to help however I can.\nWhat do you want to do to help 😄 ? We need people using the software, trying to find bugs, writing explainers, etc.",
        "created_at": "2021-11-08T21:15:28.415000+00:00",
        "attachments": null
    }
]