[
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "\u003e [it's] in the validator's best interest to vote for a wrongly ordered block (i.e. better than letting the slot end up empty)\n\nThen it is also in the validator's best interest to vote for a block involving a double spend attack.\n\nEvery objection I have so far heard to bringing content into consensus is actually an objection to PoS consensus itself. \n\nPBS proposed two solutions, one which required a change to fork-choice and one which did not. The same decision can be made for consensus content. In either case my proposed change is trivial compared to the PBS/Flashbots proposals as it involves no new actors.",
        "created_at": "2021-11-15T10:14:40.362000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "\u003e Yeah it's proving that an entity did or did not see a given transaction that is, as far as I'm aware, tricky to achieve\n\nThe data I am collecting for the EF on global arrival times will give us an acceptable window of tolerance that includes say 99.9% of nodes having seen a tx.\n\n\u003e The problem with a 90% fair system is that the remaining 10% can be exploited, and given that there is money to be made then it's likely that the 10% will utilize whatever holes exist in the system.\n\nSure they will, and that is still a 90% improvement. How is that unattractive?\n\nMy proposal reduces both the quantity and the severity of MEV. You can still do sandwiching, but DEX arbs and liquidations will become less exploitative (happen faster), and you can't run an effective multi-block censorship market or perform an unstaked hijack.\n\n\u003e In my opinion the best bet against censorship is to give each block proposer autonomy, as we'll only hit censorship problems if all of the proposers are corrupt\n\nThat is a very weak guarantee, formally non-existent in fact. You are hoping that people will behave honestly, but you are not incentivizing them to.\n\nMy arrival times proposal rewards behaviour that is good for the network, it does not expect altruism.\n\nIf we are now are trusting proposers to do the right thing, then why have attesters at all? Why not just trust proposers not to double-spend etc? \n\nI think the EF's inconsistency here comes down to having underestimated the risks of MEV, which has become quickly and disturbingly normalized. It's not just a bit of DEX frontrunning (still illegal and a regulatory risk btw)- it is a clear existential threat to make no effort at all to defend the content of the chain from centralized monopolies.",
        "created_at": "2021-11-15T10:20:50.172000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "\u003e Sure they will, and that is still a 90% improvement. How is that unattractive?\n\nIf MEV can live in the 10% then the 90% of abiding-by-the-rules-and-being-ordered-correctly is just those transactions that either don't have any MEVable properties, or are put in naively by users believing they are using a fair system.  It's additional constraints and complexity with little-to-no benefit to the end user in terms of their ability to be used in MEV.\n\n\u003e You are hoping that people will behave honestly, but you are not incentivizing them to.\n\nThere is a difference between honest and selfish.  The network does not trust validators nor expect them to be honest.  Instead they expect them to be self-interested: the selfish block producer will not censor a transaction if they can make money out of it, so a transaction producer would expect them to include their transaction if it is worthwhile to do so.\n\nRegarding your proposal: do you have it written up anywhere and formalized?",
        "created_at": "2021-11-15T10:31:14.616000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "\u003e little-to-no benefit to the end user in terms of their ability to be used in MEV\n\nIt will benefit end users too.\n\nThe remaining 10% will be the most benign, by which I mean it will exhibit the least divergence from send time order. The longer you can censor a tx for, the more you can exploit it. That can be formally proved for DEXs, but I'm sure you can see it intuitively.\n\nMy EF grant work will shed more light on this, but look at these examples in the meantime:\nhttps://twitter.com/pmcgoohanCrypto/status/1413258416152252419?s=20\nhttps://twitter.com/pmcgoohanCrypto/status/1410870866670460928?s=20 (note: Plain Alex mentioned here is not my current proposal)\n\nBut yes, I agree that any improvement must not be overstated to users so they don't get a false sense of security.\n\n\u003e the selfish block producer will not censor a transaction if they can make money out of it,\n\nYeah the trouble is that I have shown in my posts on secondary censorship markets that a selfish block producer will make more if they allow users to bribe them to censor transactions as well as to include them- in fact they must do this to win blocks.\n\n\u003e Regarding your proposal: do you have it written up anywhere and formalized?\n\nNot yet sadly- I'm having personal bandwidth issues. My EF grant is collecting data that will be very useful to it. Could use a few other people looking at this stuff tbh. MEV auctions have been a big/pointless brain-drain IMO.",
        "created_at": "2021-11-15T10:58:42.765000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Is the data of the EF grant-related projects already available and open source?",
        "created_at": "2021-11-15T11:36:17.054000+00:00",
        "attachments": null
    },
    {
        "author": "pmcgoohan",
        "category": "general",
        "parent": "",
        "content": "It will be but is not currently available. I'm working on it.",
        "created_at": "2021-11-15T11:56:23.534000+00:00",
        "attachments": null
    },
    {
        "author": "joshuaisbuilding",
        "category": "general",
        "parent": "",
        "content": "Is there a 'correct' way to reference block/epoch numbers on Ethereum?\n\nLondon block number: 12,965,000\n\n**OR**\n\nLondon block number: 12965000\n\nOr is it entirely subjective?\n\nPR that made me question this for context: https://github.com/ethereum/ethereum-org-website/pull/4452",
        "created_at": "2021-11-15T12:31:38.399000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "I think I was wrong on this, a validator is best off voting in line with what others do.  I'm still not convinced it makes sense to include tx arrival times in consensus/fork choice as you can never be sure if someone's (some other validator) is lying or not. They cannot be held accountable, and as a selfish validator I will wait until I see attestations fly around and just do whatever they do. I other words, defer my judgement to others.\n\nThe same issue of deferring judgment is happening right now with block contents as well, which is the reason I linked PoC. If there's no way of doing something similar for what you propose, I expect it'll be difficult to get it accepted.\n\nIn the back of my mind I'm thinking of ways of getting rid of centralizing forces (something I tend to value quite a lot), so I do hope you can work something out!",
        "created_at": "2021-11-15T12:31:55.155000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "There is no official/correct way.  Depends on your locale really (different countries represent large numbers differently).  Have you considered `1.2965e7`?  😄",
        "created_at": "2021-11-15T13:45:24.139000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "not long ago I lost an argument cause when I grew up my locale would separate large numbers with dots, as in 12.965.000, but apparently this was changed a few years back and now we officially separate them with spaces every 3 digits unless the number has 4 digits in which case there is no separation. I found this new version more appealing and less prone to errors: 12 965 000",
        "created_at": "2021-11-15T14:37:45.325000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "how do `.` users display decimals and larger numbers?",
        "created_at": "2021-11-15T15:30:48.786000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "In Dutch `,` is the decimal separator, and `.` is for thousands. In practice both are used, and you have to be somewhat careful when parsing numbers 🤷‍♂️",
        "created_at": "2021-11-15T16:23:13.652000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Is there an international standard for this?",
        "created_at": "2021-11-15T16:26:33.401000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "If there is, it probably uses % as the separator because that was the compromise character 😄",
        "created_at": "2021-11-15T16:27:34.526000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "Spaces are the internationally recommended thousands separator. It's a compromise.",
        "created_at": "2021-11-15T16:47:18.837000+00:00",
        "attachments": null
    },
    {
        "author": "samajammin",
        "category": "general",
        "parent": "",
        "content": "One interesting note -  looks like Etherscan chose to display block numbers without any separators despite using separators for other fields (e.g. gas, difficulty, size): https://etherscan.io/block/12965000",
        "created_at": "2021-11-15T19:49:22.004000+00:00",
        "attachments": null
    },
    {
        "author": "samajammin",
        "category": "general",
        "parent": "",
        "content": "Not sure why.",
        "created_at": "2021-11-15T19:49:29.537000+00:00",
        "attachments": null
    },
    {
        "author": "samajammin",
        "category": "general",
        "parent": "",
        "content": "Perhaps easier to copy/paste?",
        "created_at": "2021-11-15T19:49:35.883000+00:00",
        "attachments": null
    },
    {
        "author": "joshuaisbuilding",
        "category": "general",
        "parent": "",
        "content": "Curious... would you denote decimal places?",
        "created_at": "2021-11-15T20:40:59.051000+00:00",
        "attachments": null
    },
    {
        "author": "joshuaisbuilding",
        "category": "general",
        "parent": "",
        "content": "https://www.integers.co/questions-answers/how-is-10000-formatted-in-other-languages-or-countries.html",
        "created_at": "2021-11-15T20:41:07.872000+00:00",
        "attachments": null
    },
    {
        "author": "joshuaisbuilding",
        "category": "general",
        "parent": "",
        "content": "Seems to be so",
        "created_at": "2021-11-15T20:41:13.055000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "commas",
        "created_at": "2021-11-15T20:42:14.486000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "after 10 years living int he US, coming back to a country where the other localization is used has been a pain.",
        "created_at": "2021-11-15T20:42:58.576000+00:00",
        "attachments": null
    },
    {
        "author": "joshuaisbuilding",
        "category": "general",
        "parent": "",
        "content": "€99.999,99",
        "created_at": "2021-11-15T20:44:00.563000+00:00",
        "attachments": null
    },
    {
        "author": "joshuaisbuilding",
        "category": "general",
        "parent": "",
        "content": "That would definitely confuse me..",
        "created_at": "2021-11-15T20:44:20.986000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "That's not so bad, because there's two decimals (which is a rather common amount). I'd say that €99.999,999 is harder on the eyes. And things get very confusing if you have to parse a number like 999,999 or 999.999 , who knows at that point",
        "created_at": "2021-11-15T22:11:33.061000+00:00",
        "attachments": null
    }
]