[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003c@\u0026595685821026271242\u003e Getting DM spam (`\u003c@295653472978599946\u003e`)",
        "created_at": "2021-07-21T10:44:29.095000+00:00",
        "attachments": null
    },
    {
        "author": "qbk_91",
        "category": "general",
        "parent": "",
        "content": "Hello guys, do you know what is going on with ropsten?",
        "created_at": "2021-07-21T14:48:48.127000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "see \u003c#745077610685661265\u003e",
        "created_at": "2021-07-21T15:17:02.325000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I barely follow what happens in the execution layer, but would be happy to learn how in hell this wasn't caught before: 1559 has been up on testnets for weeks and an insufficient funds transactions mined be geth would have been one of the very first tests I'd suppose",
        "created_at": "2021-07-21T17:14:31.026000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I suspect this will be discussed at length on Friday's call 😅",
        "created_at": "2021-07-21T17:24:59.325000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "🙂 I'll make sure not to miss that one, it should be fun",
        "created_at": "2021-07-21T17:27:59.123000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Actually the more I think about this the more I worry. Prysm has a release coming up fixing something that should have been caught by their CI. In that case, even being an actual mistake, is somewhat understandable in that it was a non critical part and that the software is relatively new. But insufficient gas transactions on geth is something thay I cannot believe is not regularly tested in their own interop tests.",
        "created_at": "2021-07-21T21:21:48.178000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "There are many ways that a transaction can have insufficient funds - its not as simple a case as it sounds. 🙂",
        "created_at": "2021-07-21T21:56:44.238000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "But wouldn't they all have failed in the same way here, or is it because the txn actually had enough to cover the effectiveGasPrice but not the maxFee?",
        "created_at": "2021-07-21T22:02:24.513000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I'm not up to speed enough on the exact details so could have it wrong, but yeah it looks to me like something like you suggest happened.",
        "created_at": "2021-07-21T22:10:38.568000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Oh yeah that's my assumption and that's why I cannot believe insufficient funds is not in geth's CI. But just speaking purely as an ETH staker I am truly, honestly worried that this fork happens on two weeks. No sort of other meaning intended, perhaps I'm just a worrisome person, I was also against beacon-chain launching in December",
        "created_at": "2021-07-21T22:34:31.394000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Just as it was with Spadina: testnets are to find bugs. This test worked and they found one. I would consider starting the test again",
        "created_at": "2021-07-21T22:41:52.308000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "And just like it was with Spadina: if this is the last bug of this measure that's fine, but if it's not then a reorg in mainet is not the same as it will be on ropstein",
        "created_at": "2021-07-21T22:43:13.929000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Geth's CI can't possibly have picked this up - the tests would have had the same, incorrect, understanding of the calculation to be done and thus just verified that it performed incorrectly.  There's a missing reference test covering this case which will be added as a result of discovering this. I guess the key point I'm trying to get across is that these kinds of consensus failures always have a lot more details than they first appear. It's extremely difficult to evaluate the severity of a bug or the risk of other bugs like it unless you understand all those details. So I wouldn't freak out over this, just let the people who do know it well work through it.",
        "created_at": "2021-07-21T23:07:59.873000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "But, to be clear, we’ll of course have a discussion on the pros and cons of potentially delaying London over this. It’s just worth noting that with the mainnet releases out, there is  a risk in changing the block number too",
        "created_at": "2021-07-21T23:20:04.833000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I think it's not about the severity of the bug nor about finger pointing. My point is clear and simple minded: there's a reorg of 1000 blocks on a testnet 2 weeks before a major fork. Instead of just assuming this was  the only issue that not one but at least two clients were subject to, I think there should be a serious talk of whether more testing is needed or not. Bad press about a delay is one thing. A consensus failure on mainnet is a different thing",
        "created_at": "2021-07-21T23:24:04.165000+00:00",
        "attachments": null
    }
]