[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I completely agree with this, and that's why it's important to be the network where people move to, not merely a testnet where kids got to play managing billions. I don't think this is a light problem. There's clearly under qualified people in a position to make decisions that affect many. This is not something we should be aiming at this stage.",
        "created_at": "2021-08-11T00:08:32.968000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "is archival nodes going to be playing a bigger role as rollups get adopted?",
        "created_at": "2021-08-11T01:17:24.866000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "how long does it take to calculate an older state if you dont already have it, in case there is a dispute or something?",
        "created_at": "2021-08-11T01:18:10.772000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "what are people using archival nodes for today?",
        "created_at": "2021-08-11T01:19:55.563000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We are very much *not* betting our scalability on side chains.  Scalability is from optimistic roll ups and zkRollups, of which there are currently zero censorship resistant ones in production last I checked.",
        "created_at": "2021-08-11T03:07:14.625000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "\"If ETH gets security status after merge\" is this an actual concern? Why would the merge change anything in this regard?",
        "created_at": "2021-08-11T05:34:55.018000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "https://twitter.com/tanybro/status/1425193448278200320?s=20",
        "created_at": "2021-08-11T05:35:04.306000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If you want to understand why the SEC arbitrarily changes the rules on what is and isn't a security, or what the latest incarnation of qualifications are, you should contact the SEC, not Ethereum developers.",
        "created_at": "2021-08-11T08:01:35.855000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Also, I recommend against taking financial advise from Twitter.",
        "created_at": "2021-08-11T08:02:24.057000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Also, this isn't the appropriate server to discuss politics.",
        "created_at": "2021-08-11T08:02:36.316000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Looks like it was an actual exploit on contract calls instead of a rug of a single keeper",
        "created_at": "2021-08-11T08:36:48.741000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "That applies to this particular case and network, although all rollups that I'm aware of have planned side chains and are similar companies to polygon. There is some blame to put on the user that decides to move coins on BSC if Binance robs them eventually. But this does not apply to users of polygon, as far as users are concerned everything indicates they were putting their money on a legitimate project. It is something very worrisome when legitimate projects get hacked like this, and when they get hacked so often. Are we expecting users not to use any of these projects or do users need to be security experts and try to find bugs themselves? I'm aware that bugs will always be there, but the frequency of these hacks is a different level and I'd argue that is a concern for the core protocol. Although I concede that there's probably nothing that can be done at the core level, perhaps something can be done at the human level, several of these projects get grants from the EF, perhaps it would be good to encourage **not** to deploy contracts too soon",
        "created_at": "2021-08-11T08:45:36.890000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003e But this does not apply to users of polygon, as far as users are concerned everything indicates they were putting their money on a legitimate project. \nEverything except the legitimate security experts in the field telling people explicitly to not put their money into Polygon...",
        "created_at": "2021-08-11T08:47:57.355000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Polygon is a 5/9 multisig to instantly liquidate everything.  This is not censorship resistant at all, it is just a centralized side chain masquerading as a layer 2 solution.",
        "created_at": "2021-08-11T08:48:41.368000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003e Are we expecting users not to use any of these projects or do users need to be security experts and try to find bugs themselves?\nWhat would be nice is if users learned that they shouldn't believe everything people slap on a website and instead should build up and utilize a more reliable trust network to gain information on who to trust.",
        "created_at": "2021-08-11T08:49:30.820000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003e I concede that there's probably nothing that can be done at the core level, perhaps something can be done at the human level, several of these projects get grants from the EF, perhaps it would be good to encourage not to deploy contracts too soon\nThe EF can do what it wants with its money.  I would love to see the EF become more insistent that grant recipients must build something that aligns with the ethos of Ethereum, which *at least* means not claiming to be L2 if you are really just a custodial solution.",
        "created_at": "2021-08-11T08:50:45.389000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If Polygon wants to build something that is *eventually* censorship resistant that is one thing, but I do find it distasteful that they advertise as an L2 solution just because they plan to *eventually* be an L2 solution.",
        "created_at": "2021-08-11T08:51:23.424000+00:00",
        "attachments": null
    },
    {
        "author": "eaoe",
        "category": "general",
        "parent": "",
        "content": "Any channel here i can ask about solidity ?",
        "created_at": "2021-08-11T13:41:37.176000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "https://discord.com/channels/595666850260713488/672059911034634243/874980427272699964",
        "created_at": "2021-08-11T14:39:44.998000+00:00",
        "attachments": null
    },
    {
        "author": "blockdev",
        "category": "general",
        "parent": "",
        "content": "Hi, I saw there is an apprenticeship program. I noticed it but it was too late to apply. Will there be another cycle of this program sometime soon?",
        "created_at": "2021-08-11T18:48:32.975000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Yes, \u003c@!835519759545401344\u003e !",
        "created_at": "2021-08-11T18:48:49.062000+00:00",
        "attachments": null
    },
    {
        "author": "jacknelson",
        "category": "general",
        "parent": "",
        "content": "ooh yay",
        "created_at": "2021-08-11T18:49:06.042000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Keep an eye out in \u003c#843176491386667018\u003e or \u003c#595701770034872362\u003e for the second cycle. I expect it will happen this fall, and know \u003c@!364458974906548225\u003e is actively working on it.",
        "created_at": "2021-08-11T18:49:19.333000+00:00",
        "attachments": null
    },
    {
        "author": "blockdev",
        "category": "general",
        "parent": "",
        "content": "that's great to know. It may be reaching out too far, but any advice on how to maximize the chances of being accepted? (I understand if you may not be able to answer that).",
        "created_at": "2021-08-11T18:55:13.367000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I'll let Piper expand on that, but I think the shortest advice is \"do the work\": we've seen several people get involved despite being rejected and then being admitted at a later date because they were contributing. In general, we want to optimize for folks who will make solid contributions and are biased towards getting things done 🙂",
        "created_at": "2021-08-11T19:01:34.426000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "To get initially accepted, having some demonstration of interest (e.g. side projects, research posts, etc.) really helps too",
        "created_at": "2021-08-11T19:02:04.359000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "Yup, there are roughly the following ways in the door.\n\n1. have some form of demonstrable and in someway relevant open source contribution history.\n2. show up and \"do the work\" and demonstrate you are capable and \"get things done\".\n3. find some other way to stand out against the background noise.",
        "created_at": "2021-08-11T19:14:22.649000+00:00",
        "attachments": null
    },
    {
        "author": "0xmoomi",
        "category": "general",
        "parent": "",
        "content": "https://twitter.com/thegostep/status/1425547669670436866?s=21",
        "created_at": "2021-08-11T20:19:23.411000+00:00",
        "attachments": null
    },
    {
        "author": "t0biiiiii",
        "category": "general",
        "parent": "",
        "content": "Does anyone here know for sure whether or not DAI can be frozen by makerdao?\nOr addresses blacklisted?",
        "created_at": "2021-08-11T21:46:56.339000+00:00",
        "attachments": null
    }
]