[
    {
        "author": "simonk.icecreamswap",
        "category": "general",
        "parent": "",
        "content": "Hello, can someone help me with some questions about state pruning? I'm running a RPC cluster for a EVM L1 chain utilizing Geth. The Node is synced in full mode but not an archive node. Since my last resync of my Nodes, I get a ton of \"missing trie node ...\" errors and RPC calls for older blocks are also resulting in that error on the client side. Looks like state pruning deleted all historical states except for a few new blocks. Does Geth has an possibility to set how many recent blocks to exclude from state pruning? Also Is this the expected behaviour as my Get console is completely spammed and the console logs are actually bigger than the chain state.",
        "created_at": "2022-11-24T15:03:23.535000+00:00",
        "attachments": null
    },
    {
        "author": "simonk.icecreamswap",
        "category": "general",
        "parent": "",
        "content": "A Geth RPC node without archive mode enabled seems to not be usable due to the massive log spam about all the missing trie nodes. I'm sure I'm missing sth. simple and important.",
        "created_at": "2022-11-24T15:07:35.342000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "I don't really understand what's special about self destruct. why is contract code different than state that makes it hard to change in the verkle tree model, but state can change? why're they treated differently?",
        "created_at": "2022-11-24T18:51:30.988000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "the argument about unlimited state destruction is a gas cost question",
        "created_at": "2022-11-24T18:52:12.787000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "In a MPT, all the storage for the contract is stored under a common root, so you can just find that and delete all its subtrees. In VTs, the storage is spread across the tree, so you need to scan \"all\" (in practice, there are probably optimizations that make this \"more of\") the tree. The reason we want VTs is because they are \"short and fat\", kinda like a bush, which means providing a proof for a leaf node is smaller than a MPT, which is \"tall and slim\", like a christmas tree, where the proof length ~= the height of the tree.\n\nAll of this is probably not 100% correct at the implementation level, but conceptually that's roughly why.",
        "created_at": "2022-11-24T19:08:47.345000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "so the only issue is with deleting (zeroing) all state? not changing contract code?",
        "created_at": "2022-11-24T19:09:55.996000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "There's a weird thing about 0 not being equal to empty in Verkle Tries too.  \u003c@353136597522448385\u003e halp",
        "created_at": "2022-11-24T19:10:21.425000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "well from what I got now the easiest change is to remove state zeroing? and allow code deletion + reinit as before\nit's not 100% compatible but much better than total ban",
        "created_at": "2022-11-24T19:11:07.444000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "yeah, i'm now very much out of my depth 🌊  Guillaume or Dankrad would know 🙂",
        "created_at": "2022-11-24T19:11:53.438000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "state to be zeroed could be provided in the access list in the selfdestruct executing tx? \u003c:think:815760797938221056\u003e ie. the meaning -\u003e zero all warm fields\nso if reinit is structured in a way that assumes zero (empty) initial value of some fields, this would even fix this case",
        "created_at": "2022-11-24T19:13:21.046000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "general",
        "parent": "",
        "content": "The gist is that a key in a regular tree can be in two states:\n\n- Present in the tree \n- Not present in the tree\n\nSo if I delete something from the tree it’s no longer there and its not possible to know whether it was there once it’s deleted. You can just tell that it’s not present right now.\n\nFor verkle trees, there are three states:\n\n- Present in the tree\n- Was never in the tree\n- Has been deleted / marked as deleted\n\nSo you never actually remove a key from the tree, you just “mark it as deleted” with a special value (zeroed out).\n\nIf you search the verkle tree and you do not see the key, then you know it was never inserted.\n\nIf you see the special  value for deletion then you know that it was in the trie at one point, but it has now been marked as deleted (zeroed out)\n\nIf you search the trie and see a value that is not the deletion marker, then you know that it is present",
        "created_at": "2022-11-24T23:26:46.117000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "general",
        "parent": "",
        "content": "The verkle trie itself has no concept of delete though, it’s just that it allows you to differentiate between never present and zeroed out, with the latter you can use contextually to say that some key was present and has been deleted/zeroed out",
        "created_at": "2022-11-24T23:28:26.479000+00:00",
        "attachments": null
    }
]