[
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "If state deletion is the only issue, then adding the incarnation nonce to state indexes would preserve full evm side compatibility at a low cost. Ie sload/sstore(key) turns into h(incarnation ++ key) if incarnation \u003e 0, exclusively the node side.\n\nThere's no real reason to remove selfdestruct.",
        "created_at": "2022-11-29T03:27:23.460000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "having to zero out storage before using it would be fun (not)",
        "created_at": "2022-11-29T13:46:22.130000+00:00",
        "attachments": null
    },
    {
        "author": "joeysantoro",
        "category": "general",
        "parent": "",
        "content": "I have a question, it seems having more client diversity also means network upgrades have to have more implementations and testing. How do the core devs reason about the tradeoff between diversity and increased upgrade effort/complexity?",
        "created_at": "2022-11-29T15:01:25.754000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "There definitely is a tradeoff, but client teams show up slowly enough that it's not like it's a worth very formal process. A lot of effort is spent building cross-client testing suites \u0026 tooling, which hopefully help a new client onboard.",
        "created_at": "2022-11-29T18:47:24.457000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "So, if we move from say 4 to 5 or 6 ELs, the process is pretty similar. I think if we got close to 10 EL \u0026 CLs, stuff would break and it'd need to be more actively managed. One more thing to note is that it usually takes a few years (though it might be getting easier!) for a client to be fully \"production ready\", and so there's time to evolve the processes.",
        "created_at": "2022-11-29T18:48:00.033000+00:00",
        "attachments": null
    },
    {
        "author": "joeysantoro",
        "category": "general",
        "parent": "",
        "content": "yeah 4-6 seems pretty ideal. Somewhat cool to see this as a schelling point without formal process",
        "created_at": "2022-11-29T19:04:06.995000+00:00",
        "attachments": null
    }
]