[
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "if it was that straightforward then why aren't they already doing it?",
        "created_at": "2022-06-05T00:22:31.016000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "I mean binance and the rest have never exactly been at the forefront of eth/crypto tech. Plus 100% aren’t on mev yet.",
        "created_at": "2022-06-05T00:30:07.973000+00:00",
        "attachments": null
    },
    {
        "author": "0xraino",
        "category": "general",
        "parent": "",
        "content": "\u003c@291925846556540928\u003e , from https://notes.ethereum.org/@djrtwo/risks-of-lsd\n\u003e In the extreme, if an LSD protocol exceeds critical consensus thresholds such as 1/3, 1/2, and 2/3, the staking derivative can achieve outsized profits compared to non-pooled capital due to coordinated MEV extraction, block-timing manipulation, and/or censorship\nI never dug deep enough into the beacon chain to have a fine-grained map of what happens at each of these thresholds (besides for being able to finalize an invalid chain at 2/3). Is there a resource that has an up-to-date, precise mapping of the powers unlocked at each of these thresholds?",
        "created_at": "2022-06-05T00:41:59.702000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "\u003e1/3 -- prevent finality through non-participation but this becomes increasingly costly with quadratic leak\n\u003e1/2 -- can control fork choice (censor) and can likely construct censored finalized chains with care but if noticed as malicious the rest can choose to not follow and majority would win fork choice but not finalize (for some time)\n\u003e2/3 -- can censor and finalize easily\n\nno one can introduce invalid state transitions as long as other validators and other full nodes are actually running the protocol",
        "created_at": "2022-06-05T03:16:47.774000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "the failure case at 1/3 isn't too terrible with LSD. They can likely extort with that power but not induce specific attacks other than non-finality on their own",
        "created_at": "2022-06-05T03:17:29.919000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003e if I were in charge of making those commitments for a client I wouldn't\nWhy not?",
        "created_at": "2022-06-05T05:05:34.930000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think everyone would be interested in a game theoretically sound alternative.  We want to build a solution that is robust as possible in the real world, which means we have to work with the constraints of reality like \"validators will prefer more money over less money\".",
        "created_at": "2022-06-05T05:06:47.591000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Absolutely, I'd love to see a PBS that sorted out the kinks that exist today.  But we also need to address the fact that there will be a period of time where this doesn't exist, and we don't want to have market capture in the meantime.  So something out-of-protocol is likely to be required.",
        "created_at": "2022-06-05T07:57:35.442000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Do you have something in mind?",
        "created_at": "2022-06-05T07:57:57.399000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Not that stands up to any scrutiny yet, because I'm focusing on the more basic requirements for the merge.  But it's on the list.",
        "created_at": "2022-06-05T08:04:12.087000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Because I don't like blurry lines and that's one. One allows oneself to rationalize penalizing certain behavior that is not against the protocol today and tomorrow we're are the ones that are censoring and forking off  other clients blocks in the name of the network. If the line was clear enough that it would deserve a commitment from teams then we should put it in the specs",
        "created_at": "2022-06-05T09:38:48.209000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Why do you think we should switch to Proof of Stake then, if we are not willing to leverage retroactive punishment?  Why not just stay on Proof of Work which provides some nice benefits that Proof of Stake lacks?",
        "created_at": "2022-06-05T10:08:46.464000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I don't mind retroactively punishing bad actors. I don't mind long forks DAO style either. I just think there's big difference between the community deciding this and then enforcing it via an EIP/spec PR, and teams unilaterally committing to this. I certainly do not want to make those decisions",
        "created_at": "2022-06-05T10:11:05.279000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Doing nothing in the face of censorship *is* making a decision.  Classic trolly problem.",
        "created_at": "2022-06-05T10:22:13.562000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "There are a lot of grays of nothing, teams can be in charge of redacting those EIPs and Ethereum history shows that client teams members are highly active in that process",
        "created_at": "2022-06-05T10:23:48.050000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I think the question is if there should be a pre-commitment to _x_, for a particular value of _x_. I think that the general point of \"we should consider social methods in the face of out-of-protocol attacks\" is agreed upon, but I don't see that we can be more specific until facing an actual attack.",
        "created_at": "2022-06-05T10:25:17.937000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I agree with this, but I don't think there *is* agreement that we should code and propose to users a hard fork that slashes censorious validators.  This is what I want a credible commitment on.",
        "created_at": "2022-06-05T10:26:32.450000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The specifics of \"where is the line that needs to be crossed\" is less important, and in fact I think there is value in it being fuzzy as it makes executing an attack much riskier for the attacker.",
        "created_at": "2022-06-05T10:26:57.944000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "But I think there is *huge* value in the core devs asserting that if there is a 51% validator attack (in their opinion) they will write the code necessary and propose a hard fork that slashes participating validators.",
        "created_at": "2022-06-05T10:27:38.970000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Just that credible threat is likely enough to make it so the attack never happens.",
        "created_at": "2022-06-05T10:27:55.152000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "And this is kind-of my point. Agreeing on a definition of \"censorious\" would likely take a lot of effort, and is unlikely to result in something that would withstand reality. Plus if we make this statement, what about all of the other areas where social methods may be required? By not drinking them, are we implicitly allowing them?",
        "created_at": "2022-06-05T10:30:08.822000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I hope no client team asserts they will write such code without it being in the specs and specially not because of an attack *in their opinion* as opposed to the community opinion. For a regular staker this shifts the guarantees on his money from faults in the protocol to faults in the random devs coding the implementations",
        "created_at": "2022-06-05T10:30:17.108000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "On the other hand you do have a clear agreement that teams will follow the spec, so if the community decides to slash the censoring validators, client teams will implement this",
        "created_at": "2022-06-05T10:32:06.170000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I don't think we need to agree on the definition of censorious today.  I think we just need to commit to a user activated hard fork to slash *if we collectively decide it has happened*.",
        "created_at": "2022-06-05T10:32:16.935000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I think this is already in place",
        "created_at": "2022-06-05T10:32:38.309000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I don't feel it is, which is why I am constantly requesting it.  😄",
        "created_at": "2022-06-05T10:32:50.174000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Or at least, it isn't publicly known.",
        "created_at": "2022-06-05T10:32:55.396000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I *do* suspect that internally most of the core devs understand this and believe it.  However, I think signaling it publicly is where we get the majority of the value.",
        "created_at": "2022-06-05T10:33:20.807000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Secretly being prepared to retroactively punish validators doesn't help us avoid the attack in the first place, while signaling willingness to do so does.",
        "created_at": "2022-06-05T10:34:24.629000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I think that the closest to a definition of *collectively decide* for these kinds of incidents is that it's cemented in the consensus spec repo, and there is a community understanding that clients will follow that specification",
        "created_at": "2022-06-05T10:36:50.911000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I don't think having that concrete of a process is healthy for fork based governance.",
        "created_at": "2022-06-05T10:40:38.453000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It allows you to capture the process by capturing the consensus specs repository alone.",
        "created_at": "2022-06-05T10:40:49.121000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "By having each client team make their own decision, it means that to capture the system you must capture all of the client teams, which is much harder.",
        "created_at": "2022-06-05T10:41:11.245000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The goal, IMO, should be to have a system of governance that is sufficiently decentralized so as to make it incredibly difficult to capture it because there is no one central piece that is critical to be captured.",
        "created_at": "2022-06-05T10:41:57.051000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This is going on a bit of a tangent, but I wish that we had better contentious fork support built into our process.  I wish it was easier/more reasonable to support community splits without having to fight over who gets what trademarks/assets.  I feel that the ETC situation and most of the Bitcoin forks were good examples of how *not* to handle community splits.",
        "created_at": "2022-06-05T10:43:26.150000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "oh but that would be much easier to argue: if we feel that the consensus spec repo is taken, we will move otherwise. You could argue that this is yet another blurry line, as now I could say \"Danny's a dictator on the CL-repo, from now on, we follow Potuz's\".",
        "created_at": "2022-06-05T10:43:27.747000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "With this I agree, actually there's no provision in our codebase to deal with the opposite: reverting large mass slashings for example. And this is not trivial to implement",
        "created_at": "2022-06-05T10:44:12.733000+00:00",
        "attachments": null
    },
    {
        "author": "slodkokwasny.",
        "category": "general",
        "parent": "",
        "content": "I think some people might take statements like this from devs as hostile and trying to assert dominance over the network.\n\nA better idea would be making a poll \"if malicious censor gained 2/3 of validators, would you follow a fork wiping his funds?\" and let people vote with their eth (probably in the future though, since transactions fees would discourage a lot of them)\n\nThen do some social work to make sure the message gets to everyone who could try such attack. I'm pretty sure most would vote \"yes\", even if they would act differently in the actual scenario.\n\nAnd at the end, it's the decision of community whether to do something or not. If they decide to start censoring transactions from Russia from now on, you can't really do anything.",
        "created_at": "2022-06-05T10:46:59.074000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think we (core devs) are almost unanimously in agreement that ETH voting *should not* be the way we handle anything.",
        "created_at": "2022-06-05T10:47:34.838000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Ultimately what it comes down to is setting expectations.  Right now I don't think users have an *expectation* that a user activated fork that wipes out validators is on the table, and I think that is incorrect given my conversations with core devs.",
        "created_at": "2022-06-05T10:48:30.942000+00:00",
        "attachments": null
    },
    {
        "author": "slodkokwasny.",
        "category": "general",
        "parent": "",
        "content": "I wouldn't consider a poll \"handling anything\". It's just a statement.",
        "created_at": "2022-06-05T10:49:13.438000+00:00",
        "attachments": null
    },
    {
        "author": "slodkokwasny.",
        "category": "general",
        "parent": "",
        "content": "I'm not suggesting a poll would be made to \"follow X fork or follow Y fork\". Just a poll trying to get people's opinion about certain scenario that might happen in the future",
        "created_at": "2022-06-05T10:49:59.149000+00:00",
        "attachments": null
    },
    {
        "author": "slodkokwasny.",
        "category": "general",
        "parent": "",
        "content": "A reddit/twitter/whatever poll would have the same effect, but it would be spammed by bots.",
        "created_at": "2022-06-05T10:51:16.622000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Voting doesn't capture the values of the people we care about, and unfortunately it runs into information asymmetry problems where most voters don't fully understand what they are voting on.",
        "created_at": "2022-06-05T11:10:02.188000+00:00",
        "attachments": null
    },
    {
        "author": "slodkokwasny.",
        "category": "general",
        "parent": "",
        "content": "Well you're right. But as a fact, the devs commitment promise you're proposing doesn't do that either. It's just an empty threat that cannot be fulfilled, because it's ultimately the decision of the community to fork off or not. If some government gains 2/3 of validators and starts censoring transactions from Russia, you can try to punish them, but what if the community says \"no, fuck russia\" and simply ignores you? It's not the devs statement that would scare off any attackers; it's the statements of the community.",
        "created_at": "2022-06-05T11:24:54.421000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "A lot of the community follows the core devs, and any fork away from the current core devs would require a new set of developers to maintain/iterate on it.  While you are entirely correct that ultimately the decision is up to the users, I think that there is significant value in the core devs telegraphing their plans as much as possible.",
        "created_at": "2022-06-05T11:27:49.857000+00:00",
        "attachments": null
    }
]