[
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "In light of the ropsten TTD joy from last week and thinking ahead for the merge, what if we were to select an excessively large TTD.. and start date... and then apply an exponential decay per second such that rather than waiting for the TTD to increase (which will happen but unknown what happens if the hashpower drops off), the TTD would be constantly decreasing.... I put the thinking in bash.. granted, not artwork.. but you get the idea.. https://gist.githubusercontent.com/mrabino1/4f4cf068845b4e219cfc86c04ca59c5f/raw/e643d493c0ff2d46b476146402ee62741da277a9/ttd-decay.sh\n\nand if we want it go faster.. we just modify the coefficient of the decay (e.g from 99% to 95%)..\n \nI know it is late in the game for such an implementation.. had we not had the joy from last week, this wouldnt even be needed..",
        "created_at": "2022-05-31T17:08:29.768000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "The whole point of testing is to find bugs/exploits being unaware of one is not a solution to one",
        "created_at": "2022-05-31T17:12:23.398000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Blaming the person who finds a bug/exploit on a testnet is shooting the messenger 😅 sure it’s not really able to be done on mainnet but fixing a security hole isn’t a bad idea.",
        "created_at": "2022-05-31T17:12:56.353000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think it is too late to change the TTD strategy barring a major security bug found.  That being said, I think the ideal scenario is one where we can predict approximately when the merge will happen.  Maybe I'm misunderstanding, but it feels like this solution would result in more uncertainty?",
        "created_at": "2022-05-31T17:18:57.167000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "well from my eyes it removes uncertainty... as it would be reducing the merge TTD trigger.. as the actual underlying TTD is increasing... we just dont know how fast it will increase... so having the TTD decay down to match in my eyes, bring more certainty..",
        "created_at": "2022-05-31T17:21:31.699000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "for example.. if we used mainnet TTD  then times 2...  if we applied a known date in the future to start the decay... and then had the decay be an aggressive 97% or even 95%...  then even if the hashpower cut in half... the decay would continue as it is based only on time.. and it would intersect and trigger the merge....",
        "created_at": "2022-05-31T17:23:24.437000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "point being... is if we go down the path of publishing a TTD... (the real one).. .we might have the hash power leave... at which point, there might be wisdom is coordinating an update to that TTD.. to whcih some will get that message and some wont...  so maybe it is easier to publish a matrix of days and TTDs (if we dont merge).. but at that stage.. a decay in the TTD is not epic code... it si just setting a huge TTD .. a date.. and decay factor..",
        "created_at": "2022-05-31T17:25:02.880000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "my sense..",
        "created_at": "2022-05-31T17:25:04.515000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I agree with \u003c@496267636082999316\u003e this may have been a good strategy to follow given that miners essentially only weapon is to remove hashrate. It is also very simple to implement, having TTD instead of a constant function of block number it should be a decreasing function. But I also agree with \u003c@301186049323958275\u003e that's too late for such changes. The method in place is secure",
        "created_at": "2022-05-31T17:26:39.869000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "general",
        "parent": "",
        "content": "the largest concern is that miners \"could\" cause havoc... as the TTD could be set too high... (and thus take too long)... and then as good actors.. we then coordinate to reduce it to something more likely to occur... (closer in the future).. .and then as a result a bad actor then slams the hash power UP.... before the node operators have a chance to really update their setup with the appropriate TTD... better question (and this is my ignorance) might be how much spare hash power is possibel... or even furture, what happens if half of the network thinks the merge has already happened.. and the other half doesnt... (which is precisely what I am trying to avoid)",
        "created_at": "2022-05-31T17:30:05.954000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Realistically 80% of miners probably don’t even know the merge is happening or what it is 😂",
        "created_at": "2022-05-31T17:35:54.246000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "But yes it’s good to have a fault tolerant system",
        "created_at": "2022-05-31T17:36:07.256000+00:00",
        "attachments": null
    },
    {
        "author": "azurefa1c0n",
        "category": "general",
        "parent": "",
        "content": "Can you point to the source of this 80% claim? Seems wildly unrealistic to me.",
        "created_at": "2022-05-31T17:51:28.154000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Ah I am the source hahahah expert opinion",
        "created_at": "2022-05-31T18:37:54.593000+00:00",
        "attachments": null
    },
    {
        "author": "azurefa1c0n",
        "category": "general",
        "parent": "",
        "content": "Oh all right, glad that's clarified then 🙂",
        "created_at": "2022-05-31T18:42:48.529000+00:00",
        "attachments": null
    },
    {
        "author": "rufusg.",
        "category": "general",
        "parent": "",
        "content": "But it’s the pool operator that could cause the havoc right?",
        "created_at": "2022-05-31T19:56:58.552000+00:00",
        "attachments": null
    },
    {
        "author": "rufusg.",
        "category": "general",
        "parent": "",
        "content": "Not saying they would…",
        "created_at": "2022-05-31T19:58:09+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "True",
        "created_at": "2022-05-31T20:05:44.921000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Though many pool ops are useless too 😂",
        "created_at": "2022-05-31T20:05:55.766000+00:00",
        "attachments": null
    }
]