[
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "Tyranny usually arrives like slowly boiling a frog in water as nobody wants it if it arrived suddenly.",
        "created_at": "2022-11-02T03:30:32.712000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "Is that saying that the changeowner function will do nothing instead of revert when the permissions are not correct?",
        "created_at": "2022-11-02T03:32:33.483000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Private relays make it so FB can win every bid even if they censor.  Only requirement is that the total value for private relay transactions is greater than the value of censored transactions.",
        "created_at": "2022-11-02T04:03:42.423000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Just because a validator configures to use multiple relays doesn't mean a non censoring relay stands a chance at winning bids against FB.",
        "created_at": "2022-11-02T04:04:09.644000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Well but there's no reason to believe that censoring relays will win every bid either. The whole point is that we don't have this data afaik at least in a public form. What these numbers brought in this channel are giving is the percentage of blocks that are being produced by censoring relays today, that does not mean that a censored party has the corresponding chances of getting their transaction included. For all we know, a censored party may well be guaranteed fast inclusion still by just increasing gas payment",
        "created_at": "2022-11-02T09:43:31.397000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Yeah, I agree that the data currently available is that censoring relays are currently winning a significant percentage of bids, but it is unknown whether that is because they are the only bidder, or because they are bidding higher.  My argument, broadly, is that it doesn't matter which is the case and we should not assume that they will lose bids just because non-censoring builders have access to censored transactions.",
        "created_at": "2022-11-02T09:48:17.420000+00:00",
        "attachments": null
    }
]