[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Current best practice is to just ignore leap seconds entirely.  😄",
        "created_at": "2022-11-20T03:34:02.932000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "I wish it was, they cause so many problems :)\nIf anyone is curious.... most people use NTP, and NTP signals with a flag that a leap second is arriving earlier in the day, then at midnight UTC the kernel adds or removes the leap second. If you just use the local clock, there is a leap second file that will tell the kernel when to do a leap second if it is upd to date, there is only a few months notice from when the leap second committee measures the earth's rotation and votes to add/remove a leap second. PTP has the ability to do several different types of leap seconds as a 1 second jump can screw up trading applications so some times it is better for the entire datacenter to be off by up to a second from everyone else, but still in sync with each other.",
        "created_at": "2022-11-20T11:23:38.807000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I honestly don't understand what's the whole discussion about leap seconds here. Everywhere I know of in Ethereum, timestamps are in Unix epoch",
        "created_at": "2022-11-20T12:05:47.074000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "but that's exactly the question right; what if smearing sources mess up the \"seconds since epoch\"?",
        "created_at": "2022-11-20T12:16:17.184000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Do you mean if the Linux kernel for example got wrong it's clock?",
        "created_at": "2022-11-20T12:24:31.084000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "no, if the NTP sources \"lie\" about what time it is",
        "created_at": "2022-11-20T12:25:03.220000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "I don't understand how smearing of leap seconds work, all the examples I've seen don't cover \"seconds since epoch\". They do all say scary things like \"every second lasts a tiny bit longer\"",
        "created_at": "2022-11-20T12:26:36.048000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "What's the problem with that? We already have that trust assumption anyway. What's so special about leap seconds?",
        "created_at": "2022-11-20T12:45:04.354000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "Well, assuming smearing affects \"seconds since epoch\" (I really don't know, I hope it doesn't)... if half of the network uses smearing sources, and the other half doesn't, we could expect some disruption in the sense of lower attestation rates",
        "created_at": "2022-11-20T12:53:24.376000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "NTP does not have leap seconds, all it has is a flag it sets when a leap second is happening at midnight, and weather it is adding or removing one. NTP does not care about leap seconds and it is up to the kernel to handle leap seconds when offerin gtime to applications.",
        "created_at": "2022-11-20T13:08:13.177000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "also there won't be a leap second for 6 months... they already voted for the next one to not happen, and it is customary to only do a leap second on 2 days a year, even though the protocol allows for a leap second at the end of any month",
        "created_at": "2022-11-20T13:12:42.370000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The problem is that not all systems handle leap seconds the same way.",
        "created_at": "2022-11-20T13:57:31.813000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Some will have a particular second occur twice in a row, others will have a particular second just take twice as long to get through, others will have a bunch of seconds all take a bit longer to get through over the course of a day/week.",
        "created_at": "2022-11-20T13:58:25.770000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Essentially this means not everyone's clock agrees on what time it is for a bit, even with ultra high precision's clocks/time servers.",
        "created_at": "2022-11-20T13:58:55.498000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "And different systems behave differently.  For example if you do `doEvery(12 seconds)`, what happens if you get the same second twice vs if you have one second that is extra long vs lots of seconds that are a little long?",
        "created_at": "2022-11-20T14:00:17.068000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "a second is never twice as long, you don't use the wall clock when sleeping",
        "created_at": "2022-11-20T15:07:21.465000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "do you have any examples in the Ethereum code that use a wallclock time, instead of the amount of time since the system booted to measure a duration?",
        "created_at": "2022-11-20T15:17:34.641000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "do you have any examples of commonly used systems that don't do leap seconds the normal way by adding/removing a second from the end of the day?",
        "created_at": "2022-11-20T15:19:56.499000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "did you simply just read about leap seconds for the first time and are trying to show you ignorance of how it is implemented?",
        "created_at": "2022-11-20T15:20:22.436000+00:00",
        "attachments": null
    }
]