[
    {
        "author": "gwintery",
        "category": "general",
        "parent": "",
        "content": "yeah but almost all client pairs are represented. The main point of the shadowforks is to find client related bugs rather than preparing users. So I don't think another public testnet is necessary.",
        "created_at": "2022-08-12T03:10:21.089000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Not necessary just suggested 😛 and it’s not like there isn’t time@before the merge to do it",
        "created_at": "2022-08-12T03:14:22.360000+00:00",
        "attachments": null
    },
    {
        "author": "rufusg.",
        "category": "general",
        "parent": "",
        "content": "Between LSDs and MEV-Boost centralizing block construction in this post TC OFAC world I’m getting very nervous that the bitcoin maxis were right",
        "created_at": "2022-08-12T16:02:19.676000+00:00",
        "attachments": null
    },
    {
        "author": "rufusg.",
        "category": "general",
        "parent": "",
        "content": "IMHO post merge we need to focus 100% on getting back to censorship resistance and decentralization or we might find that the system has been captured and it is too late",
        "created_at": "2022-08-12T16:03:22.613000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "that's what PBS is trying to work towards",
        "created_at": "2022-08-12T17:19:26.619000+00:00",
        "attachments": null
    },
    {
        "author": "coocoocacha",
        "category": "general",
        "parent": "",
        "content": "Is there a future scenario where PBS is effectively ignored and people just stick with something like mev-boost?",
        "created_at": "2022-08-12T17:32:22.679000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Pbs is enforced by the protocol",
        "created_at": "2022-08-12T17:35:09.503000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "ice age under PoS guarantees that ofac sanctions will be included on a protocol level eventually.\nbecause it's guaranteed that eventually ethereum devs will be forced to do that, and the only working defence is to keep the status quo, ie. not fork and keep running unofficial node versions.",
        "created_at": "2022-08-12T21:37:13.857000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "bitcoin doesn't solve anything here.",
        "created_at": "2022-08-12T21:37:32.105000+00:00",
        "attachments": null
    },
    {
        "author": "slodkokwasny.",
        "category": "general",
        "parent": "",
        "content": "I don't think ice age has anything to do with censorship resistance. If eth devs were to include ofac in a fork, some random anon guy would copy the client upgrade, remove ofac from it (while keeping other upgrades if they were bundled), and release it to the public.",
        "created_at": "2022-08-12T21:44:21.697000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "because exchanges and major stablecoins would follow the 'official' fork",
        "created_at": "2022-08-12T21:44:53.578000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "the anon fork would get another name",
        "created_at": "2022-08-12T21:45:09.862000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "it's much easier to ignore the fork rather than to switch to something else.",
        "created_at": "2022-08-12T21:45:25.811000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "which is in fact, the whole reasoning behind the ice age in pow.",
        "created_at": "2022-08-12T21:45:36.782000+00:00",
        "attachments": null
    },
    {
        "author": "slodkokwasny.",
        "category": "general",
        "parent": "",
        "content": "I guess the chain would do an ETC type split. I don't think users would accept an ofac fork. Exchanges\u0026stablecoins would be forced to, but exchanges are off chain, so there'll be always an exchange which doesn't follow the ofac (in countries like latvia etc.). As for stablecoins, they'd have to announce weeks beforehand that they will support the hostile fork, so people who stay on honest fork would simply get rid of all their stablecoins. Not all of course, and there are a lot of unknowns, and much of it depends on celebrities actions, btc maxis, people like vitalik... that's why i'm guessing it would be a chaotic ETC type fork.",
        "created_at": "2022-08-12T21:57:59.324000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "countries like latvia?!?",
        "created_at": "2022-08-12T21:58:39.112000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "that's eu and eurozone...",
        "created_at": "2022-08-12T21:58:50.361000+00:00",
        "attachments": null
    },
    {
        "author": "slodkokwasny.",
        "category": "general",
        "parent": "",
        "content": "I just named a random country",
        "created_at": "2022-08-12T21:58:54.896000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "countries that don't follow sanctions are russia, iran, china",
        "created_at": "2022-08-12T21:59:29.985000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "I don't think there's legal basis to force developers to make specific changes yet. so there's still a short period of time in which further development is possible. but rule of law is visibly in its last years globally if control over ethereum is important, you will see 'official' people like vitalik, geth developers even being tortured in prison to force them to do something, like publicly say the new fork with sanctions is good, etc.\nthere's only one defence - to allow the system to run forever without any protocol level changes, and ideally declare end of all forks pre-emptively. no need for a chaotic etc-type fork then.",
        "created_at": "2022-08-12T22:00:27.968000+00:00",
        "attachments": null
    },
    {
        "author": "slodkokwasny.",
        "category": "general",
        "parent": "",
        "content": "I think we all agree on that. But unfortunately there are still years ahead of us before the chain reaches state where it no longer needs to be actively upgraded.",
        "created_at": "2022-08-12T22:04:03.017000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "so how about *not* making it easier for governments by introducing an ice age that forces forks with active developers.\ntechnically after the merge eth can work forever as is, even if only scalable globally with validium",
        "created_at": "2022-08-12T22:06:23.797000+00:00",
        "attachments": null
    },
    {
        "author": "rufusg.",
        "category": "general",
        "parent": "",
        "content": "I agree but only in that Bitcoin has a fraction of the utility of Ethereum.  It’s starting to feel like eth has too many attack surfaces and it’s censorship resistance is turning into a house of cards.",
        "created_at": "2022-08-12T23:16:41.400000+00:00",
        "attachments": null
    },
    {
        "author": "rufusg.",
        "category": "general",
        "parent": "",
        "content": "I think our best hope is that some big boys mount a legal/policy challenge to censorship attempts long enough for Eth to ossify and solve some of its centralization issues. The good news is that the TC overreach lit a fire under a lot of people to refocus on hardening the ecosystem from top to bottom (which I think had been neglected recently in favor of other priorities)",
        "created_at": "2022-08-12T23:21:41.198000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Or that the crypto community grows large enough that each party fights to appeal to them",
        "created_at": "2022-08-12T23:30:15.441000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "bitcoin is extremely vulnerable with no defence.\nlegally all american ln operators have to enforce sanctions on bitcoin addresses. the problem is that ln has onion routing. so basically providing a ln node is a potential 30 years sentence in america. but it's not enforced (yet?)\npow is very vulnerable to regulations separately to that, because big miners aren't going to break the law - as anonymity is impossible\ntornado still works. the issue is with centralized actors banning people who use it. if ethereum was centralized it would just be down.",
        "created_at": "2022-08-12T23:38:19.392000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "the theoretical design most resistant to censorship would be a native zkrollup on PoS, which may happen eventually, but it's not yet technically realistic.",
        "created_at": "2022-08-12T23:39:48.965000+00:00",
        "attachments": null
    }
]