[
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "Correct me if I am wrong but will Ethereum post merge not be susceptible to the issues solana has been having due to network congestion since Ethereum has seperate EL and CL clients? Is this the benefit versus a single POS client doing everything?\n\nAlso I assume that the shadow forks are running alongside mainnet and processing mainnet transactions also to allow high transaction period testing? \n\nhttps://bitcoinist.com/solana-blockchain-faces-outage-for-the-seventh-time/",
        "created_at": "2022-05-02T15:38:38.753000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This is incorrect.  IIUC, the Solana outages are because they don't have a fee market for transaction inclusion.  Ethereum does, so it doesn't face that class of problems.",
        "created_at": "2022-05-02T15:42:42.725000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We actually had a mainnet shadowfork merge in the middle of the recent block space demand spike (quite opportunistic).",
        "created_at": "2022-05-02T15:43:28.209000+00:00",
        "attachments": null
    },
    {
        "author": "undying1200",
        "category": "general",
        "parent": "",
        "content": "Well it is somewhat correct, congestion caused the outage, congestion was caused by not having fee market transaction inclusion? Either way it is a great way to compare two POS chains and as some people claim it is a competitor to Ethereum. Also good to know shadow forks are running to test high mainnet load periods. Thanks.",
        "created_at": "2022-05-02T15:49:48.477000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Have shadow forks tried ramping up block gas limits to see the limit a pi4 can handle? Am curious",
        "created_at": "2022-05-02T15:59:17.835000+00:00",
        "attachments": null
    }
]