[
    {
        "author": "quezacoa",
        "category": "general",
        "parent": "",
        "content": "\u003c@334288075356241920\u003e \u003c@552133098075193354\u003e \nContinuing the discussion from \u003c#745077610685661265\u003e re: EF communications \n\nRight, there are many \"official\" channels to share correct and up-to-date information about the project. The question is whether enough interested people (especially the average users as the majority) can be reached by them to share information you want to share. If you rely on media to digest this correct and up-to-date information to put it together in \"easier\" formats for the average user - such as crypto news articles, newsletters, podcasts, YouTube videos, ... - you can be certain that misconceptions arise.\n\nWhat about a news format on what's up and what's next and / or an interview style on recent FAQs and misconceptions on YouTube provided on an official EF YouTube channel? Thus you combine correct and up-to-date information in an easy to digest format that is official.",
        "created_at": "2022-01-13T06:17:10.715000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "I deliberately don’t share the link to this channel to the avg eth miner or user 🙅‍♂️\n\nI do think Reddit should be used more",
        "created_at": "2022-01-13T07:09:27.152000+00:00",
        "attachments": null
    },
    {
        "author": "denverklaytn9992",
        "category": "general",
        "parent": "",
        "content": "Hi all. \nI got a question about feehistory api. \nBig thanks in advance.\n\nI already tested(ran test codes), read, and understood codes but still confused about line 294 - 297.\nsource link: https://github.com/ethereum/go-ethereum/blob/045e90c8971cddbabeac0abd54240cf02bc1d94d/eth/gasprice/feehistory.go#L285-L299\n\nI have no idea about that lines. (Please check the below snippet)\n            // getting no block and no error means we are requesting into the future (might happen because of a reorg)\n            if i \u003c firstMissing {\n                firstMissing = i\n            }\n\nWhen this condition actually activated?  (+ What does \"reorg\" means?)\n\nIs there a test code about this condition or article or comments to understand this condition? \n\nI checked commit messages, but there was no clue about this condition.\n\nBig Thanks to all 🙂",
        "created_at": "2022-01-13T07:19:46.865000+00:00",
        "attachments": null
    },
    {
        "author": "gwintery",
        "category": "general",
        "parent": "",
        "content": "Wise choice 😂",
        "created_at": "2022-01-13T09:25:50.442000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "All our development calls are public, on Youtube, the EF blog shares major updates, I'll try and explain things ~monthly at https://hackmd.io/@timbeiko/acd, and I believe there was a reddit AMA in the last few weeks. \n\nAgreed we should perhaps be better about cross-posting things to Reddit, though",
        "created_at": "2022-01-13T15:19:58.288000+00:00",
        "attachments": null
    },
    {
        "author": "mattwills3781",
        "category": "general",
        "parent": "",
        "content": "Hey everyone .. I'm not 100% sure this is the right channel for this, so feel free to lmk if not...\n\nI think interoperability is critical for trustlessness to be able to exist in the metaverse - If a functional NFT isnt interoperable, then surely you have to trust the platform issuing the NFT to actually give it life and therefore value?\n\nFor that reason, I'd love to be able to generalise NFT avatar and 3D model support, and for other metaverse platforms to follow. \n\nAre there any erc721 metadata standards for avatars, or 3D models of any kind?\n\nIf not, would anyone be interested in looking into it with me and trying to set one up? Does anyone else have any experience in this area?",
        "created_at": "2022-01-13T18:12:19.779000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "general",
        "parent": "",
        "content": "The OpenSea server might be a good place to find interested parties ( https://discord.gg/opensea ) since they do have support for 3D models?",
        "created_at": "2022-01-13T22:41:06.245000+00:00",
        "attachments": null
    }
]