[
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "\u003chttps://etherchain.org/correlations\u003e",
        "created_at": "2022-04-30T08:26:23.850000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "unknown.png",
                "content": "857a775f657856ceca724b2b9eebcc2454c3b795286efd38fc7fc330c0833ef1"
            }
        ]
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "you can vote for a gas limit increase \u003c:4Shrug:917500397470486579\u003e",
        "created_at": "2022-04-30T08:30:15.603000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "IMO the next HF should be the merge (if possible), to avoid confusion within the community. Miners could make up for longer block times with a gas limit increase for a month or two which does not require a HF. Wdyt? \u003c@552133098075193354\u003e",
        "created_at": "2022-04-30T08:37:11.787000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "One issue with varying block times is that it becomes harder to estimate when the TTD will be hit.",
        "created_at": "2022-04-30T11:20:54.868000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "How so? Isn't the total difficulty increasing at a constant'ish rate per second, even with an ice age hitting?",
        "created_at": "2022-04-30T11:28:24.767000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Difficulty increases with the (inverse of) derivative of block times. If that stays constant I agree that modeling is not so bad. But if that changes at higher rates it becomes quite complicated. It's also a feature that we want, otherwise attacking the merge block would be easier",
        "created_at": "2022-04-30T11:32:57.650000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "I would say that, if the first order approximation is that the difficulty per unit of time stays the same (assuming constant hash rate but increasing block times), it's really not a big deal to have increasing block times. There are much larger uncertainties around the hash rate itself as the merge approaches imo",
        "created_at": "2022-04-30T11:36:30.590000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "You aware that the difficulty increase is exponential?",
        "created_at": "2022-04-30T11:38:02.746000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "And you aware that it is going to break some things as not a lot of services expect blocks to be bigger",
        "created_at": "2022-04-30T11:38:47.898000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Pretty much none I’d say.",
        "created_at": "2022-04-30T11:40:46.431000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Also no difficulty bomb pushback is going to make devs rush a lot, which could then lead to catastrophic consequences.",
        "created_at": "2022-04-30T11:42:32.356000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "when you measured block time, what are you measuring? the time between blocks being broadcast on the network, or the time between the block timestamp in the block header?\nthese two numbers can be vastly different (I have personally randomly seen a block header broadcast and added to Eth 70 seconds after it was created)",
        "created_at": "2022-04-30T11:47:19.559000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "The ice age was designed to destroy any chain that does not fork, to allow the devs to keep a stranglehold on the future of Ethereum.... saying you are fine with it going off is silly.",
        "created_at": "2022-04-30T11:50:46.209000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "I mean if you don’t have the skill to delay the bomb you probably shouldn’t be running a chain. \n\nThat being said allowing blocks to take longer and gas to go up is something I suspect most eth users would vote against. It serves no purpose and delaying the bomb has been done many times with almost no work on anyone’s end. There should be a standard that the decision is made before the bomb goes off not after when things are rushed.\n\nAlso are there any exploits/hacks that can occur with 15-20+ second blocks? I guess we will find out.",
        "created_at": "2022-04-30T12:40:52.097000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "\u003e Also are there any exploits/hacks that can occur with 15-20+ second blocks? I guess we will find out. \nI hope you realize those block times are not a rare occurrence even right now",
        "created_at": "2022-04-30T14:15:55.748000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "I knew it but didn’t think about it when I said that 😂 I assume more time on average to examine the mempool and front run will make mev searchers happy.",
        "created_at": "2022-04-30T14:19:14.006000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "More time, more competition amongst searchers, and more competition would lead to more of the rewards going to miners, which would make miners happy.\n\nThat's not a serious argument (which I hope is obvious), but just to say that these things are much more complicated and nuanced. Sad to see statements like \"devs will be rushed, leading to catastrophic consequences\" or \"if you don’t have the skill to delay the bomb you probably shouldn’t be running a chain\". Needlessly antagonistic imo, and almost implying devs lack basic reasoning skills. And definitely out of place for this Discord.",
        "created_at": "2022-04-30T15:11:39.971000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "I do think being rushed will risk things. Berlin (a minor fork) wasn’t rushed but a major bug didn’t show up in testing and ended up crashing OE which most exchanges used. We’re now dealing with more clients and a lot more complexity. Financial gains aside I think it’s a mistake to discuss merging when bugs are still popping up. Instead the discussion should be how can we better find bugs and ensure there are none? How can we make things better?  The merge should be like an airplane any issue is absolutely unacceptable because lives are at risk. If the merge goes without a few months minimum of being bug free I’m definitely cashing out everything first or moving it to other chains. \n\nI also strongly suggest there be better risk management plans so it’s clear if things happen what the reaction will be to fix it and definitely there needs to be better centralized communication and coordination. I may have missed parts and if I’m mistaken I apologize. \n\nAs for the second I didn’t mean to antagonize anyone and apologize if I did.",
        "created_at": "2022-04-30T15:57:15.585000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "30-60 second average block time would certainly make it easier to extract MEV",
        "created_at": "2022-04-30T16:13:57.748000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "would be funny when EIP-1559 keeps the gas price up for minutes after a period of high demand",
        "created_at": "2022-04-30T16:14:21.279000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Do you have any proposals or it's simply \"just be better and don't have bugs\"? Do you want more testing instead of rushing it? But as you just said, Berlin wasn't rushed and there still was a bug.  You can never be sure something is bug-free. You test it until you fell it's enough, and then that's it. You mention there are more clients now, but how is it a bad thing? It's slower to test, but the results of the tests are more meaningful – different implementations means covering more bug surface, which allows Ethereum to have shorter test phases than 1-client chains, where a failure of any kind would be catastrophic.",
        "created_at": "2022-04-30T17:12:05.149000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "I’d suggest a third party audit and crisis tests that deliberately introduce a bug during merge and test everyone’s response. Along with that I’d suggest appointing a lead merger to coordinate/head everything and setting up a specific channel for all major parties involved. I’d also draw up a suggested plan for all dapps and exchanges to suspend deposits and withdrawals the day of until the team gives the all clear along with other guidelines. I’d also suggest introducing a better bug bounty system and working on better fuzzers. Major players should also be called out to join testnets rather than just assuming they will, we all know how lazy and reactive exchanges are.",
        "created_at": "2022-04-30T18:17:40.068000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "There are multiple examples of bug crisis responses, usually they have some kinds of writeups like this: https://hackmd.io/@prysmaticlabs/HyZqgTA-c Generally you are supposed to treat every bug as if it happened on mainnet. I'm not sure what do you mean by \"lead merger\". Tim Beiko is the EF coordinator. There are communication channels on this discord, one of them requires permissions to participate. There is no way of suspending Dapp/exchange activity. What better bug bounty program do you propose? What better fuzzers do you suggest?",
        "created_at": "2022-04-30T18:28:47.462000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Definitely not an expert so I’ll readily admit I am making mistakes here. Even if it’s only $10 I think people participating in testnets actively should be rewarded and implementation teams and others should be able to  recognize their contributions. Perhaps a total amount and a points system then the total can be divided up? For fuzzers I think there needs to be a better bounty system and more testers need to be on boarded you have a ton of programmers in the flashbots channel just chilling thinking up new ways to exploit mainnet who should be here.",
        "created_at": "2022-04-30T18:38:34.929000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003c@456226577798135808\u003e there will be no additional EIPs along with the Merge. We’ve also stopped adding new ones to the fork after until we’re a bit farther in the merge process. That said, if you want to come on the call to get some feedback on the EIP, you are welcome to. Simply leave a comment on the agenda for the next call in the Issues section of the ethereum/pm repo",
        "created_at": "2022-04-30T20:48:27.857000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Audits generally don’t help because a lot of the issues show up in weird edge cases based on multiple pieces of software interacting. \n\nMyself, Danny and several others are coordinating a lot of these efforts, with specific people owning specific items (e.g. Mikhail for specs, Pari for devnets, etc.). \n\nI personally communicate with several exchanges and blog posts around the actual upgrade will highlight what exchanges and infra providers should look for to pause/re-enable deposits and withdrawals. \n\nFor apps on chain, the merge won’t cause any downtime and we already have a blog post on the EF blog explaining what changes they can expect. \n\nWe have two bug bounties, are paying 2-3 external teams to help with testing, along with ad-hoc grants to especially engaged community contributors. \n\nI’ve been spending a huge chunk of my time getting major infra and tooling providers to use Kiln (most of them publicly acknowledged in a twitter thread, unless they asked not to) and so far no one has reported a significant issue.",
        "created_at": "2022-04-30T20:56:23.264000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Thanks I didn’t know a lot of that and it’s great to hear.",
        "created_at": "2022-04-30T20:57:31.450000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Yeah, we try to share some stuff publicly, but a lot of it also happens “below the surface”",
        "created_at": "2022-04-30T20:57:50.066000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Perhaps a more focused merge discord would be better?",
        "created_at": "2022-04-30T20:58:02.546000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "We have one here?",
        "created_at": "2022-04-30T20:58:12.075000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "There are 3 channels about it 😅",
        "created_at": "2022-04-30T20:58:19.871000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "I meant seperate from eth r\u0026d entirely",
        "created_at": "2022-04-30T20:58:24.624000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "And half the ACD and CL calls are about it",
        "created_at": "2022-04-30T20:58:31.212000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Why?",
        "created_at": "2022-04-30T20:58:34.837000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I think it’s good most of this activity is public",
        "created_at": "2022-04-30T20:58:44.630000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "A lot of stuff gets mixed up for instance one day an eip is discussed the other day merge. But yes the current system works fine too.",
        "created_at": "2022-04-30T20:59:05.118000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Obviously, I have a bunch of random private chats with different people involved in different efforts, and so do others, but most of the discussion is actually happening here",
        "created_at": "2022-04-30T20:59:15.277000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "The other place where it happens is in each client’s discord/chat",
        "created_at": "2022-04-30T20:59:42.340000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "I do appreciate the public part and see how annoying it is sometimes which I contribute to at times (really appreciate the effort you guys make)",
        "created_at": "2022-04-30T20:59:45.570000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Believe it or not I’m very invested in eth I don’t just cashout 😂",
        "created_at": "2022-04-30T21:01:28.286000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "And believe it or not, we want to ship the merge when it’s safe, not just ASAP 😄",
        "created_at": "2022-04-30T21:02:41.794000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "A bad merge is *much* worse than a late merge",
        "created_at": "2022-04-30T21:03:01.619000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "But we’re getting close !",
        "created_at": "2022-04-30T21:03:25.466000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Yes I don’t expect you to ship when it’s unsafe. But I know from Berlin that things get missed no matter if they pass all basic tests. More testing never hurt.  As you said there’s a lot more going on than I was aware of though which is great!\n\nAlso I’m really against how rushed it is. Personally to me it seems crazy to run both clients and maintain two databases. I know that won’t change but it does indicate that things are being rushed such that an imperfect product is being shipped. Not a developer so I don’t know how much extra work it is but seems a lot better to just have one replacement client than build a second client that duplicates a lot of the work done by first one and run it in parallel.",
        "created_at": "2022-04-30T21:06:51.680000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "And if anyone else has a skillset suited to help with testing, reach out!",
        "created_at": "2022-04-30T22:32:15.564000+00:00",
        "attachments": null
    }
]