[
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I was just asking myself this about the planned PBS. How does a builder make sure to get paid? Couldn't proposers just take the built block (perhabs change it a bit) and propose it without paying the builder?",
        "created_at": "2022-02-21T14:51:45.184000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "In full PBS the full block isn't shared with anyone until after the proposer commits to it.",
        "created_at": "2022-02-21T15:02:07.105000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "That makes sense, thx. How are builders being paid? Is it just whatever MEV the builder can extract? And can we expect that while competing against each other some builders will offer some of the MEV to the proposers? Are builders expected to also take the tips?",
        "created_at": "2022-02-21T16:33:16.298000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I imagine it would be a race to the bottom for builders as everyone can try to build a block but only 1 validator has the right to propose. So am I wrong in the assumption that most of the MEV/Tips would tend to go to the proposers?",
        "created_at": "2022-02-21T16:34:44.026000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "This last point I would want to see how it pans out, I worry that the staking landscape may be very much centralized, and if the \"builder\" coincides with the \"proposer\" in the case of very large staking pools, or a cartel of such, then censoring attacks or simply waiting out a couple of blocks may be an option if there aren't that many builders. DankSharding also makes the entry point of hardware for builders a little steeper, so this is not attenuated. I am not claiming that this will be the result, but that it's not so obvious to me that all proposers will benefit from these fees, for example I'd expect single home stakers to not really gain from this market unless there's a fully trustless both ways setup implemented, something that likely won't happen at the merge",
        "created_at": "2022-02-21T21:49:38.394000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Personally I'd take any solution that could provide a stable equilibrium of \u003e1 builder, that's all that is needed for a market to form.",
        "created_at": "2022-02-21T21:51:38.016000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I tend to agree that if running a searcher and build is not prohibitively expensive (and it looks like it won't be) then eventually we'll see non-censoring builders",
        "created_at": "2022-02-21T21:59:37.865000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "But on the other hand I think this will be contrasted with several private mempools and then builders may need access to those if the public mempool does not have much extractable MEV",
        "created_at": "2022-02-21T22:01:30.301000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "My problem is that I don't see how multiple builders survive in the current proposed solution.  Once a builder becomes dominant all transactions will flow to them because there will be basically 0 chance of blocks from other builders being proposed.",
        "created_at": "2022-02-21T22:02:35.384000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Yeah so this is the risk with the private mempools, although I suppose L2 batches will be in the public mempool",
        "created_at": "2022-02-21T22:06:01.443000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Maybe, although I suspect they'll end up having to go to the single builder and cutting a deal for inclusion.",
        "created_at": "2022-02-21T22:12:53.533000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I think crLists guarantee inclusion, but not timely inclusion, in a period where you get several blocks in a row that are full, crLists won't guarantee your transaction is included until the blocks are emptier, and also you need to be the proposer",
        "created_at": "2022-02-21T23:00:47.899000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "crLists seem to force a two-stage block build, as well as requiring the proposer to reveal themselves in advance of their proposal.  Neither are particularly desirable, as far as I can see.",
        "created_at": "2022-02-21T23:01:11.062000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "(And in the specific case of a L2 batch the proposer would need to push for that particular tx to be included, and as \u003c@!755590043632140352\u003e says you need to be the proposer and interested in pushing that particular tx for it to be included.  I don't think the issue is so much straight censorship as timeliness requirements for L2 proofs to be included on L1 to be such that they would have to overpay significantly to ensure they will be guaranteed inclusion.)",
        "created_at": "2022-02-21T23:03:37.291000+00:00",
        "attachments": null
    }
]