[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Hi, where can I read how gas limit can change either by miners or validators after the merge? What are the limits from block to block and basic things like this? In EIP-1559 I can find\n```python\n# check if the block changed the gas limit too much\n\t\tassert block.gas_limit \u003c parent_gas_limit + parent_gas_limit // 1024, 'invalid block: gas limit increased too much'\n\t\tassert block.gas_limit \u003e parent_gas_limit - parent_gas_limit // 1024, 'invalid block: gas limit decreased too much'\n\n\t\t# check if the gas limit is at least the minimum gas limit\n\t\tassert block.gas_limit \u003e= 5000\n```\nAre these all the conditions? Anything that a proposer/miner decides with these bounds is valid?",
        "created_at": "2022-06-08T01:09:09.226000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "yep",
        "created_at": "2022-06-08T03:10:47.029000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "i don't know the history on the gas floor (the transaction gas floor is 21k so 5k seems a bit arbitrary) but it could have been grandfathered in since homestead or frontier\n\notherwise, the only parameters a proposer has for the block gas limit is the ability to change up to but not including 1/1024 of the parent's gas in either direction, as you can see in the EIP you linked",
        "created_at": "2022-06-08T03:12:51.423000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "we can hop to \u003c#874767108809031740\u003e where i can say more about gas limit wrt the external builder network bc it is imperative that validators retain control of this parameter and not have it controlled by a comparatively smaller number of builders",
        "created_at": "2022-06-08T03:13:35.494000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "\u003c@815253824650084362\u003e Moving the faucet stuff here, with a bit of brief history. The trouble is that there were / are incentivized testnets. So now some people are behaving like rational actors - it costs next to nothing to drain faucets using bots; there were rewards to be grabbed by having test eth before; may as well drain every faucet the moment it goes live",
        "created_at": "2022-06-08T06:41:36.252000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "Ethstaker shut their Goerli faucet down because of it. Safe guards such as depositing on people’s behalf and having a cool down period worked for a short while until bots adjusted.",
        "created_at": "2022-06-08T06:41:49.305000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "BrightID is a way to have a faucet again. Hopefully its graph-based verification is strong enough that we can get an acceptable compromise … yes have a BrightID and be sponsored by an app; but no you don’t need N already known truly trusted connections to get test ETH.",
        "created_at": "2022-06-08T06:42:59.058000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "It’s a one time effort to prove someone is human and has a unique, not duplicated, ID; and there are high hopes it’s just enough of a hurdle to keep the bots out, this time.",
        "created_at": "2022-06-08T06:43:47.828000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "The alternative for ethstaker is to go back to how it used to be and not have a faucet at all.",
        "created_at": "2022-06-08T06:44:06.665000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "If this current BrightID method isn’t strong enough then it gets a bit cumbersome. At that point we’d need to lean further into it and require full bitu verification, which bots can’t get through because they can’t make enough connections with honest users at the centers of the graph. But it’s preferable to not have to go there.",
        "created_at": "2022-06-08T06:48:01.547000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Was there any discussion ever about ETH being a PoW/PoS hybrid, only thing I could find in .ch was 2019 example by qizhou, but no discussion? \nhttps://ethresear.ch/t/proof-staked-work-a-simple-hybrid-pow-pos-with-potential-stronger-51-attack-resistant/4740\n\nAnd am I the one only one genuinely stressed out about ditching the entire PoW community? I am just looking at youtube videos and discussions, and  a lot of people seem to be negative about it. For example recently on a  ropsten merge video Rabid mining - granted probably mostly PoW audience-, but all the replies to him:",
        "created_at": "2022-06-08T06:59:18.976000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2022-06-08T06:59:20.712000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "unknown.png",
                "content": "47877738eed31cad998eebb37739a4c898967abca01bf022b0568780895b72de"
            }
        ]
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "Miners being angry is to be expected",
        "created_at": "2022-06-08T10:04:20.327000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Thanks, my question comes actually from trying to understand  the builder API. There are serious concerns that we may end up with only one builder and it's in the interest of builders to raise the gas limit. I can't see how to protect our users from that",
        "created_at": "2022-06-08T10:06:46.546000+00:00",
        "attachments": null
    },
    {
        "author": "dalitslayer",
        "category": "general",
        "parent": "",
        "content": "Merge is bullish or bearish short term",
        "created_at": "2022-06-08T11:20:56.154000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "sheepish 🐑",
        "created_at": "2022-06-08T11:38:22.889000+00:00",
        "attachments": null
    },
    {
        "author": "0xfornax",
        "category": "general",
        "parent": "",
        "content": "Hey Yorick, I appreciate the reply. I have no issues with the BrightId verification, as I have followed it and believe it is a healthy measure to avoid bots draining the faucet. The thing that got me angry was that I did all this hurdle to be verified, waited 4 days to get an extra 0.7 from the faucet and being scolded by someone on the team. I believe you guys are right to protect the funds on the faucet, but there should be a way for it to be refilled after some time so you don't need to go all the way to calling people greedy for getting a total 33 ETH from it.",
        "created_at": "2022-06-08T12:28:56.939000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "I'd like to get to the bottom of this. Our faucet dispenses 32.5 and no one should have called you greedy. This is the ethstaker faucet you speak of? Or another one?",
        "created_at": "2022-06-08T12:41:49.165000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "\u003c@456226577798135808\u003e \"And am I the one only one genuinely stressed out about ditching the entire PoW community?\" Pretty much yes. PoS has been on the roadmap since at least 2016. There has been constant communication since. Miners are service providers to the chain, who get paid for their service. Just like stakers will be, now. Both groups are largely disinterested in protocol details, miners maybe a little more so. That's perfectly fine, providing the service doesn't require deep interest in the roadmap.",
        "created_at": "2022-06-08T12:43:43.239000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Thats not true though. Peak of ETH was during miner influx. Miners tell their friend and family and are involved in the network as well. And for many ETH PoW has been the stepping stone into crypto world",
        "created_at": "2022-06-08T12:45:37.656000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "And miners that got an actual interest in crypto have been following the PoS saga ever since and have plans on how to transition. Or they really hate the design and they plan to move their focus to other chains. All good.",
        "created_at": "2022-06-08T12:46:38.586000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "What's funny is that this is pretty much the 1559 pattern. Years of design work and opportunity for input and R\u0026D and coding, and then in the last few months there's an outcry of \"we shouldn't do it this way\".",
        "created_at": "2022-06-08T12:47:21.477000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "Spec is final, code is being put through final tests: Now is not the time to weigh in to R\u0026D matters about the merge. Or 1559 before it.",
        "created_at": "2022-06-08T12:47:43.456000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "But now is the time still to weigh in on verkle tries, (proto)danksharding, zk EVM, and so on.",
        "created_at": "2022-06-08T12:48:09.203000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "There is always time before implementation",
        "created_at": "2022-06-08T12:48:39.856000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "Yep. There indeed was. Pre-2020 for the broad design, from 2020 on for the details of how PoS will work and merge.",
        "created_at": "2022-06-08T12:49:22.014000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "We are now at the end of that.",
        "created_at": "2022-06-08T12:49:26.423000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I mean if you are going full waterfall then sure",
        "created_at": "2022-06-08T12:49:39.373000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "But not at the end for data shards, statelessness/expiry, zk ... that's all still early",
        "created_at": "2022-06-08T12:49:46.595000+00:00",
        "attachments": null
    },
    {
        "author": "0xfornax",
        "category": "general",
        "parent": "",
        "content": "Yes, I got 32.5 on June 3rd from the EthStaker faucet. Created a validator with it. Mined enough to get 31.2 eth but couldn't mine the rest because of the hash power added to ropsten, waited 4 days and called the faucet again to get the remaining 0.7 ETH so I could help a friend learn how to spin up a validator.",
        "created_at": "2022-06-08T12:49:46.614000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "Ah gotcha. Typically the friend would go through BrightID as well. Bonus: Now you have an already-known strong connection to help build a social recovery network.",
        "created_at": "2022-06-08T12:50:43.474000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "Still no one should have called you greedy. If you can link to the convo, and it was a staff member, I'll have a word.",
        "created_at": "2022-06-08T12:51:07.273000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "Even Agile there's a point where the design is done and being implemented and tested. Further refinement happens, but revamping PoS is years off. That said: Also still *very* early to weigh in on single-slot finality PoS. That needs a lot of R\u0026D still.",
        "created_at": "2022-06-08T12:52:23.759000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "That's what I mean though by \"largely disinterested\": Block producers by their nature, miners and stakers both, aren't terribly focused on roadmap and how the protocol may look years down the road.",
        "created_at": "2022-06-08T12:52:59.994000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "That's 100% okay.",
        "created_at": "2022-06-08T12:53:14.569000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I think you missed my point, I am not arguing for miners, but about totally abandoning the 1.3 PHs and the free marketing and so on their involvement provide",
        "created_at": "2022-06-08T12:54:44.824000+00:00",
        "attachments": null
    },
    {
        "author": "0xfornax",
        "category": "general",
        "parent": "",
        "content": "getting verified was not an easy task for me (had to attend one of those zoom calls), so I was trying to keep it simple for him and just focus on the validator side of things. here's the convo https://discord.com/channels/694822223575384095/981359474923175976/983819355479478372",
        "created_at": "2022-06-08T12:55:06.433000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "More than 50% of miners actively mine on pools that are robbing them blind. They do 0 research and don’t participate in anything. The only person more ignorant than a miner will likely be a validator.",
        "created_at": "2022-06-08T12:55:47.180000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "im, I am saying this abandonment is more from the miner side than the protocol side. PoS has been on the roadmap since 2016. Maybe before then, I am a little shaky on my history. Miners could have weighed in all along, followed the protocol developments, communicated roadmap. Instead, attempts to bring roadmap to the community were actively discouraged. This is and was a choice. I think it's an okay choice to make, and as @chs2 says, stakers won't be any different.",
        "created_at": "2022-06-08T12:56:56.706000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "The protocol in the meantime is working hard to fulfill its promise of non-financial uses cases, for which we need L2s and data shards, for which we need PoS.",
        "created_at": "2022-06-08T12:57:38.923000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "The difference is, you have people who start mining on their gpu to get a few dollars worth of ETH and start reading about crypto, and then they tell their friends and family about ETH who decide to research on it or even use it - butterfly effect",
        "created_at": "2022-06-08T12:58:37.098000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "F2Pool has 15 million just sitting because they are so rich off stealing 😂😂😂\n\n https://etherscan.io/address/0x61c808d82a3ac53231750dadc13c777b59310bd9",
        "created_at": "2022-06-08T12:58:53.822000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "Sure. And maybe this now happens with stakers, who put a couple ETH into RocketPool or some other LSD, and then tell their friends and family. Or not.",
        "created_at": "2022-06-08T12:59:17.597000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "Bottom line: PoS is really happening, for real, and it's close for a change. Barring last-minute disastrous revelations 😄",
        "created_at": "2022-06-08T12:59:44.872000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "One great thing about the crackdown in China is it shutdown the mining pools that likely would have stolen their validators eth",
        "created_at": "2022-06-08T13:02:19.209000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "That being said completely expect a 10-20% rate of theft come 2.0",
        "created_at": "2022-06-08T13:02:39.481000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "If they hold a few ETH they wont be new to crypto unless they live in Dubai, but this was beside the point anyway. How did you get into crypto? You mined BTC and ETH? Did you start with a PoS project? Or tried a ETH miner and then read about ETH and thought it was great?",
        "created_at": "2022-06-08T13:05:19.533000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "I started mining, quickly realised that was a proper business, and sold my GPUs.",
        "created_at": "2022-06-08T13:11:41.195000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "We now have people coming in who start with building a validating node.",
        "created_at": "2022-06-08T13:11:55.544000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "I'm not quite certain what you are advocating for. If it is \"let's stop the merge and go back to the drawing board and have a new PoW/PoS hybrid algorithm\" ... that's at least 5 years late to have this discussion. We can go in circles about it, and it won't change a thing.",
        "created_at": "2022-06-08T13:13:28.081000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "Pragmatically this is a done deal now.",
        "created_at": "2022-06-08T13:13:36.008000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "Thanks. I reached out to him and asked him to reach out to you.",
        "created_at": "2022-06-08T13:14:12.526000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "There's been a lot of farming and botting and scamming and it has the team on edge - and still, we want to always be welcoming.",
        "created_at": "2022-06-08T13:14:41.239000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "the argument to stay on PoW here is that its easier to get started?",
        "created_at": "2022-06-08T13:16:00.008000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "I think so. And that there is an existing community.",
        "created_at": "2022-06-08T13:16:14.134000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "maybe there are other solutions to get people started? better starting documentations and such?",
        "created_at": "2022-06-08T13:16:34.035000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "It can be useful to look at what could have been, see Vitalik's \"the roads not taken\". But not to stop, but to reflect.",
        "created_at": "2022-06-08T13:16:52.024000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "Always. We actually have really good guides. Somer has them for systemd and I have them for automation/docker, if people want something in minutes. Remy and crew are putting together a UI, which will take a while yet.",
        "created_at": "2022-06-08T13:17:30.411000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "There's also the Coincashew systemd guide and the Stereum installer on docker, as alternatives",
        "created_at": "2022-06-08T13:18:03.386000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "There are YT videos demonstrating it all.",
        "created_at": "2022-06-08T13:18:13.739000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "It is indeed easy to get started, and ethstaker Discord is there to help.",
        "created_at": "2022-06-08T13:18:25.139000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "As is the RocketPool Discord for those who want to be a node operator there.",
        "created_at": "2022-06-08T13:18:43.018000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "There was a proposal to maintain a tiny emission for a pow side chain (pow at a large loss versus power use) just to help the third world.",
        "created_at": "2022-06-08T13:31:39.025000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "O.o, sounds really wasteful",
        "created_at": "2022-06-08T13:32:26.886000+00:00",
        "attachments": null
    },
    {
        "author": "0xaren",
        "category": "general",
        "parent": "",
        "content": "Was it a proposal or was it a suggestion? I remember reading it on discord but never saw anything on ethresearch or eip.",
        "created_at": "2022-06-08T13:33:13.723000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Suggestion*",
        "created_at": "2022-06-08T13:33:23.701000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Maybe an eip will come someday 😅 everyone’s merge merge merge these days though",
        "created_at": "2022-06-08T13:33:42.715000+00:00",
        "attachments": null
    },
    {
        "author": "0xaren",
        "category": "general",
        "parent": "",
        "content": "Yeah I thought it was a good suggestion. Hopefully one day cpu mining could return.",
        "created_at": "2022-06-08T13:36:33.696000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "If assume it would be cpu based since gpus aren’t easy to get",
        "created_at": "2022-06-08T13:39:26.001000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "so its part of the builder specs that builders *MUST* respect validators' preferences wrt gas limit",
        "created_at": "2022-06-08T13:56:29.074000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "they can specify it in their `ValidatorRegistration`, https://github.com/ethereum/builder-specs/blob/main/specs/builder.md#validatorregistrationv1",
        "created_at": "2022-06-08T13:56:55.514000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "at first there will only be \"social pressure\" to follow this rule but we can imagine as we develop PBS further we can start to get bonded builders and make this a slashable offense",
        "created_at": "2022-06-08T13:57:27.709000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Sure, I understand how full fleshed PBS solves this issue (and many more) but I think validators will be easily coerced to raise the gas limit in the current design.",
        "created_at": "2022-06-08T14:02:30.412000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "i don't think that is given, is there something you see in particular?",
        "created_at": "2022-06-08T14:04:23.779000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Builders immediately benefit and they have the hardware to handle it. Validators also benefit with larger blocks as long as their hardware can execute it fast enough that it doesn't affect consensus. All large validators should have top hardware.  I don't see validators socially organizing to punish builders in case they decide to raise the limit. I do see validators respecting the default in their software sending 30M.",
        "created_at": "2022-06-08T14:17:41.495000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "the peak of miner influx was when interest in eth was at the peak, it's not the cause.",
        "created_at": "2022-06-08T14:18:35.104000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "the limit is definitely too low, especially under PoS.",
        "created_at": "2022-06-08T14:19:35.223000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I think the situation is very different than now that miners need to coordinate to raise the limit. Builders will be much more centralized and can easily pull this off",
        "created_at": "2022-06-08T14:19:47.273000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "i would need to see data substantiating this claim before i buy it 🙂",
        "created_at": "2022-06-08T14:20:09.855000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "one validator node costs ~$57k just in eth. which means as long as a high-end pc can run a node, the gas limit should be increased",
        "created_at": "2022-06-08T14:20:18.145000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "right i mean this was why i wanted to make sure it was part of the builder spec",
        "created_at": "2022-06-08T14:21:00.350000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I agree here with you, but even that is secondary: even if the limit is too low, we want it to be decided by people with stake (and slashable stake) in the game",
        "created_at": "2022-06-08T14:21:16.922000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Validator node operational costs aren't the reason to keep blocks small.",
        "created_at": "2022-06-08T14:21:17.020000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "the stock software will reject a bid that does not respect a validator's preferences",
        "created_at": "2022-06-08T14:21:19.877000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "yes i completely agree",
        "created_at": "2022-06-08T14:21:39.962000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We want *users* to be able to run nodes, and given that we already way over reasonable, so we shouldn't make the situation worse.",
        "created_at": "2022-06-08T14:21:41.628000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "normal users don't need to run nodes, that's weird full validation fetishism from bitcoin. if the consensus works, then validators are enough. if it doesn't, then users validate a broken and useless chain. therefore, users don't need to run nodes.\nnodes for productive purposes like devs etc. are also not a problem, everyone can easily afford it, or use a third party service",
        "created_at": "2022-06-08T14:22:40.492000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "we don't want to have to trust the valdiators",
        "created_at": "2022-06-08T14:23:04.071000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Wait I'm missing something here, how does the software get the gas limit. I thought the bidder just sends a hash and the validator signs it without knowing the actual payload header until after the fact.",
        "created_at": "2022-06-08T14:23:47.453000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "in practice, very few users that won't be either in the productive category or validators are going to run nodes in the first place",
        "created_at": "2022-06-08T14:23:58.152000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "so it's a theoretical concern that's completely meaningless in practice",
        "created_at": "2022-06-08T14:24:08.412000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003e if the consensus works, then validators are enough.\nThis is definitely not the intended design of Ethereum.",
        "created_at": "2022-06-08T14:24:31.066000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "the only thing a proposer does *NOT* see is the list of transactions (they only get the hash tree root of a ssz list of them)",
        "created_at": "2022-06-08T14:24:34.123000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "they see everything else in cleartext which is validated by relays, mux software (mev-boost) and could even be validated by the beacon node and validator client if you wanted",
        "created_at": "2022-06-08T14:25:01.832000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The entire portal network is being built specifically so end-users don't have to trust centralized operators or validators.",
        "created_at": "2022-06-08T14:25:11.444000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "well then the 'intended' design is wrong and going against the interest of literally everyone. normal users don't run nodes except for an insignificant minority and they won't run nodes after the merge",
        "created_at": "2022-06-08T14:25:53.292000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Yeah but the validator has zero guarantee that the limit is what that is said. I understand f from your sentence above that flashbots' relayer will reject the bid that doesn't satisfy the validator then, right?",
        "created_at": "2022-06-08T14:26:11.150000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This is correct, and a big problem that is being worked on.  Ideally, we want every user of the chain to run a consensus compatible client of some kind and validate the data they receive.  Things are certainly far from perfect right now, but we are working on making them better and we are trying to avoid making them worse.",
        "created_at": "2022-06-08T14:27:03.016000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "that's never going to happen. even if running a node was as simple as installing it and letting it run with literally 0 cpu/disk/network use. normal users won't run it. it's easier to use a remote rpc.\ndecentralization rests on active actors. which are: validators, devs, other entities that actually need nodes. but for them the limit is a high-end home pc (same for bandwidth).",
        "created_at": "2022-06-08T14:28:54.412000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "so if you optimize for something that has zero chance of happening, you're pointlessly hurting everyone - because there's no gain. only loss.",
        "created_at": "2022-06-08T14:29:28.897000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "? if the stated gas limit is wrong then the entire block is invalid and the builder would forgo all of their profit",
        "created_at": "2022-06-08T14:30:27.058000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "with miners the reason the block limit was so low is because they didn't give a fuck about ethereum. it actively hurt ethereum and led to massive move away to other chains. validators have long-term interest and it makes sense to raise the gas limit. although there's a separate issue with centralized custodial staking that somewhat replicates the issues with mining pools",
        "created_at": "2022-06-08T14:32:53.166000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If Portal Network is maximally successful, every dapp you use could have a client built into it that runs while you are on the page.",
        "created_at": "2022-06-08T14:33:11.671000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Oh I see what you mean, yeah I agree so being coerced here requires being active as well and changing the blind block to match the given limit by the builder?",
        "created_at": "2022-06-08T14:33:38.831000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "so lets walk thru the process: \n\na builder wants to build a block, it has already collected a preference from the target proposer to have a gas limit of G.\nit assembles an execution block targeting a gas limit of G (keeping in mind it can shift some wrt the parent like your original post up above)\nwhat is most likely to happen next is that the builder sends the full execution payload to the relay\nthe relay can validate every last detail of the execution block\nit will select the most valuable one of these blocks it gets from the pool of connected builders and send this execution block to the proposer to sign when they ask with one important caveat: the transactions have been \"blinded\" by just sending the hash tree root of them\nthe proposer likely uses mev-boost to validate what it can locally (or just trust the relay on this) and will sign the \"blinded\" block",
        "created_at": "2022-06-08T14:34:08.336000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "so i am trying to add builder signing on top of relay signing so it is harder to mutate anything",
        "created_at": "2022-06-08T14:34:45.933000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "and/or if things are messed w/ they can be attributed",
        "created_at": "2022-06-08T14:34:55.803000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "i dont really follow what this means: \"requires being active as well and changing the blind block to match the given limit by the builder\"",
        "created_at": "2022-06-08T14:35:26.259000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "oh if the validator is being coerced",
        "created_at": "2022-06-08T14:35:45.778000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "if the proposer is colluding w/ the builder then they can do whatever",
        "created_at": "2022-06-08T14:36:00.629000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "\u003eThe planned architecture for bridge nodes is to pull data from the standard JSON-RPC API of a Full Node and \"push\" this data into their respective networks within the Portal Network.\n\u003eFull \"bridge\" nodes acting as benevolent state providers are responsible for bringing in this data from the main network.\n\u003eNodes must be able to choose how much state they want to store.\nso it's a data distribution method from full nodes, with every portal node able to only store whatever it's interested in? which is an argument to keeping full nodes artificially constrained why?",
        "created_at": "2022-06-08T14:36:01.788000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "we could make the claim that relays may be honest and add some (imo weak) defense here",
        "created_at": "2022-06-08T14:36:13.011000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "so the failure mode to watch out for is proposer bribery",
        "created_at": "2022-06-08T14:36:30.591000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "but that is no different than today",
        "created_at": "2022-06-08T14:36:36.898000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "otherwise builders/relays could ignore what proposers request and in that case ppl like us have to get very loud on twitter 🙂",
        "created_at": "2022-06-08T14:36:57.604000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "even at 10x gas keeping state for just one dapp isn't that hard. I assume it assumes verkle trees so no big merkle witnesses",
        "created_at": "2022-06-08T14:37:38.672000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I recommend checking out some presentations by Piper on his plans/goals for the Portal Network.  I think there are some good ones out there.",
        "created_at": "2022-06-08T14:37:58.464000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Once the Portal Network (plus some other changes) are live, my position on the gas limit may change, but we have to wait and see how successful these projects are first.",
        "created_at": "2022-06-08T14:38:45.605000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Yeah thanks, I was missing this, it seems that if the CL checks that its sent gas limit is sent before signing the blind block, then validators will have to actively change this behavior to change the limit. And this amounts to collusion with the builders",
        "created_at": "2022-06-08T14:39:42.957000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "a separate point is that all this is mostly contradictory to the rollup scaling roadmap. if everything is on big rollups that require connecting to sequencers via rpcs, keeping computation on mainnet artificially low doesn't matter. I don't see how you can verify shard data in the browser, that's massive. at best you can verify zkproofs for a hash. but then that's possible even with 1000x gas because you only need a block header + witness for the particular zk verification tx.",
        "created_at": "2022-06-08T14:40:42.604000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Isn't gas limit part of the execution payload header, so it is set by the proposer?  The only thing that the builder could do would be to build a transactions list that was invalid compared to the block gas limit, but outside of that control remains with the proposer.",
        "created_at": "2022-06-08T14:41:33.686000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "in practice the builder will already know ahead of time what the proposer wants and set it for them, there can be several checks along the block pipeline to ensure that the suggested block aligns w/ what the proposer ultimately wants",
        "created_at": "2022-06-08T14:43:42.962000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "but yeah for this parameter, the proposer gets to see what they are signing before they sign it so have options (even fallback to local builder they control)",
        "created_at": "2022-06-08T14:44:41.199000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I don't think we have this check in prysm, but will add the issue",
        "created_at": "2022-06-08T14:45:27.275000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "arguably this is a thing to demand in your mev-boost software",
        "created_at": "2022-06-08T14:45:59.566000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "it may open a can of worms to have e.g. the beacon node validate everything",
        "created_at": "2022-06-08T14:46:18.759000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "it gives undue power to validators to enforce an unpopular hard fork on non-validators",
        "created_at": "2022-06-08T15:01:32.442000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "it's a systemic effect not an individual one",
        "created_at": "2022-06-08T15:01:46.016000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "often you would run a full node for the rollups you have funds on",
        "created_at": "2022-06-08T15:02:31.408000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "There were supposed to be tests to check block gas limits? Any idea if those have happened yet?",
        "created_at": "2022-06-08T16:49:07.957000+00:00",
        "attachments": null
    },
    {
        "author": "3esmit.stateofus.eth",
        "category": "general",
        "parent": "",
        "content": "Do anyone know an easy way to get an rawtx from mainnet?  I dont have a node synced here right now, ill try a light node...",
        "created_at": "2022-06-08T18:25:40.142000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "You mean the raw bytes?  What's the tx hash?",
        "created_at": "2022-06-08T18:38:11.641000+00:00",
        "attachments": null
    },
    {
        "author": "3esmit.stateofus.eth",
        "category": "general",
        "parent": "",
        "content": "the raw transaction contains all data needed to broadcast a transaction, such as to,value,data,gasprice,gaslimit,chainid, etc + signature;",
        "created_at": "2022-06-08T21:39:42.928000+00:00",
        "attachments": null
    },
    {
        "author": "3esmit.stateofus.eth",
        "category": "general",
        "parent": "",
        "content": "Aka Signed Raw Transaction",
        "created_at": "2022-06-08T21:46:16.560000+00:00",
        "attachments": null
    },
    {
        "author": "3esmit.stateofus.eth",
        "category": "general",
        "parent": "",
        "content": "What you can paste here https://etherscan.io/pushTx",
        "created_at": "2022-06-08T21:46:25.223000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "So you want to create one, or fetch one that is already on the chain?  If the latter, what is its hash?",
        "created_at": "2022-06-08T21:47:38.673000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Easiest way would be to query eth_getRawTransaction from infura or similar services",
        "created_at": "2022-06-08T22:11:42.689000+00:00",
        "attachments": null
    }
]