[
    {
        "author": "katernoir",
        "category": "general",
        "parent": "",
        "content": "Hey, I'm not sure if this is the right channel to ask this, but I'm trying to understand validator deposits after the merge / after shanghai. As far I understand, the deposit contract will still exist after the merge and validators will have the same flow there as right now. Is that correct? Looking at EIP-4895 (I know this is not finalized), withdrawals will later then be pushed to the withdrawal address as a balance change. Accounting for the ETH in the deposit contract, does that mean that by staking and unstaking I basically make 64 ETH out of 32 (32 new ETH on the withdrawal address and 32 inacessible in the deposit contract)?",
        "created_at": "2022-07-29T10:31:31.002000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Nothing changes with regards to deposits or withdraws with The Merge.",
        "created_at": "2022-07-29T10:36:04.387000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "There is active research/development on withdraws, but that won't land on mainnet until sometime after The Merge (no timeline yet).",
        "created_at": "2022-07-29T10:36:40.504000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "For questions about EIP-4895, the best place to ask would be in the discussions-to thread (link at the top of the EIP).  I believe there is discussion around whether we should care about the \"total supply\" of ETH becoming more complex to calculate or not.",
        "created_at": "2022-07-29T10:38:23.452000+00:00",
        "attachments": null
    },
    {
        "author": "katernoir",
        "category": "general",
        "parent": "",
        "content": "Thanks! I totally missed the discussion link at the top of the page! Will read through the track and ask any remaining questions there ✌️",
        "created_at": "2022-07-29T10:41:09.556000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "i would not count eth in the deposit contract when calculating total supply",
        "created_at": "2022-07-29T13:34:42.776000+00:00",
        "attachments": null
    }
]