[
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Thinking of long term ETH value isn’t there a danger if gas becomes too cheap? If gwei becomes 1 then there’s no need for large amounts of ETH so ETH loses value because you don’t need more than a few cents worth. People can then easily buy up a lot of ETH and stake to control the network and go after the USDC/other stablecoins right?",
        "created_at": "2022-06-03T00:38:06.429000+00:00",
        "attachments": null
    },
    {
        "author": "azurefa1c0n",
        "category": "general",
        "parent": "",
        "content": "I don't think mainnet basefee will ever go that low - if it did, that would signal there is not enough demand for block space. Considering that block space is what Ethereum the blockchain effectively sells, this obviously would mean that the blockchain is not valuable. ETH's primary value accrual is through the burn, which would be zero in this case. Staking rewards would just inflate the supply and dilute the holdings of non-stakers, so everyone would be incentivized to stake - similar to Cardano, for example. What gives ETH the asset value is people choosing to use (and thereby burn a part of) their ETH. So yes, if basefee was 1 gwei, I think that would also mean there is not much value behind ETH.\n\nThe reason it wouldn't go that low is because as the basefee gets lower it makes more and more types of transactions valuable. You can see this on Solana and their various p2e games for example which thrive in a lower cost block space environment and the same was true for Axie before it moved to Ronin. Nowadays even before mainnet on-chain games are viable, l2 on-chain games will be. In a few years' time I expect most of mainnet blockspace will be l2 calldata/proofs. Since these are highly valuable (thousands of transactions batched), rollups will be happy to pay 100s of gwei basefee to post them - they will recoup this cost from the l2 fees. This will in turn result in value accrual for ETH and economic security for the mainnet.",
        "created_at": "2022-06-03T00:56:44.076000+00:00",
        "attachments": null
    },
    {
        "author": "azurefa1c0n",
        "category": "general",
        "parent": "",
        "content": "If ETH scales further through Danksharding, this will inflate the block space supply, but I believe it will bring about its own demand cases. Imagine if you could put the contents of Wikipedia or the Library of Congress on-chain. At some point it becomes economically feasible enough to do it and people will proceed to do so. Look at the current throughput of the internet and how much content you can access that wasn't feasible 20 years ago. The demand scaled with the supply and there is no sign of it lagging behind anytime soon.",
        "created_at": "2022-06-03T01:07:02.910000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Indeed I assume there does need to be an economic consideration where gas is kept from being too low. From what I’ve seen most development hasn’t considered the price of eth. Perhaps in the future a set minimum price of eth should be the goal with block space demand balanced by the value of a successful attack",
        "created_at": "2022-06-03T01:26:05.536000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "While I can't speak for everyone, the impression I get from most of the core devs and my own personal position is that the purpose of Ethereum and the target we are shooting for isn't \"ETH go up\", it is to build a censorship resistant public good platform that allows people to transact freely/unrestrained with each other.",
        "created_at": "2022-06-03T04:15:46.876000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If ETH price is very low, but the platform is useful for human coordination free from censorship then we were successful.  If the ETH price is high but Ethereum isn't actually useful to people, then we were unsuccessful.",
        "created_at": "2022-06-03T04:16:57.859000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Yep that was one of my points that so far price hasn’t been a priority. But it may need to be a factor in future decisions if buying eth becomes too cheap",
        "created_at": "2022-06-03T04:28:23.724000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "There is no lower bound on ETH price that would cause me to shift focus.",
        "created_at": "2022-06-03T04:28:57.437000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "We could also easily increase the amount of ETH each validator is required to stake if we thought there was a risk the amount wasn't worth enough.",
        "created_at": "2022-06-03T04:32:56.622000+00:00",
        "attachments": null
    },
    {
        "author": "0x2e",
        "category": "general",
        "parent": "",
        "content": "I think the concern is more about the safety of the Beacon chain, not necessarily the motivation of devs by gains",
        "created_at": "2022-06-03T04:39:34.002000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The only risk I can think of is the one that Adrian just mentioned, which is that we could end up with too many validators which increases the bandwidth required by the protocol.  That is a relatively easy thing to adjust though, and the solution isn't to \"make ETH worth more\" but rather to fix the very specific problem of too many validators by increasing the amount required to be a validator.",
        "created_at": "2022-06-03T04:44:55.635000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "What I’m referring to is if eth price went to say $.01 so someone could validate and takeover the network for far less than they’d gain as they’d be able to create usdt/usdc and others. So I think there needs to be a high cost to gain control of the network which requires high eth price which requires high use of eth for gas.",
        "created_at": "2022-06-03T04:47:38.228000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "You can't create usdt/usdc as a validator - not even if you're 100% of the validators.  It may be worth doing some more work to understand the protocol before spouting random theories.",
        "created_at": "2022-06-03T04:48:27.201000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Ah I didn’t realize that. I thought you could rewrite things.",
        "created_at": "2022-06-03T04:48:55.160000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Things a malicious validator set can do:\n1. Censor transactions.  Prevent certain transactions from making it to the blockchain.\n2. Reorg back to the most recent finalized block.\n3. Cause finality to stop occurring.  This gets more and more expensive as time goes on as they'll be bleeding money executing this attack.",
        "created_at": "2022-06-03T04:50:45.389000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Interesting",
        "created_at": "2022-06-03T04:55:00.971000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Presumably, if any of the above occurred it would become quite noticeable/visible to human observers and we (the Ethereum community) would coordinate a hard fork that confiscated/burned the funds of all validators that participated in the attack.",
        "created_at": "2022-06-03T04:55:07.050000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Then there is a financial incentive if they could block say a l2 like polygon and short matic",
        "created_at": "2022-06-03T04:55:22.653000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Since validators can't withdraw funds quickly in large volumes, most of the attackers would suffer severe financial consequences.",
        "created_at": "2022-06-03T04:55:32.749000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "My example is assuming eth=$0.01",
        "created_at": "2022-06-03T04:56:32.711000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "So it’s matic they’d make money from",
        "created_at": "2022-06-03T04:56:44.215000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Yes.  L2s need to be designed such that they are cognizant of the fact that L1 censorship *can* occur for some amount of time.  zkRollups are ideal here, because there usually aren't time constraints.  If an L2 is susceptible to L1 censorship attacks (like optimistic rollups are), then it needs to carefully tune its parameters such that they can withstand a long-ish period of L1 censorship.  They also may want to adjust these up significantly if the L2 has more value on it than L1 has.",
        "created_at": "2022-06-03T04:57:48.377000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Interesting thanks for explaining",
        "created_at": "2022-06-03T04:58:35.588000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Assuming the community is healthy and able to coordinate an after-the-fact penalty on censors, then any censorship can be addressed *eventually* through user activated validator penalizing forks.  However, these should be assumed to take weeks to months, and during that time the censorship will continue.  So an OR that has more value on it than Ethereum has in the validator pool should set its parameters such that it can withstand months of censorship before failing.",
        "created_at": "2022-06-03T05:00:43.528000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Or people should convert to zkRollups.  😄",
        "created_at": "2022-06-03T05:00:57.668000+00:00",
        "attachments": null
    },
    {
        "author": "0x2e",
        "category": "general",
        "parent": "",
        "content": "don't zkRollups experience the same censorship problem? If they can't get the proof included due to censorship. Ah i guess the argument was to ensure someone has enough time to trigger the dispute for the OR even if the network is heavily censored.",
        "created_at": "2022-06-03T05:03:02.465000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "With zkRollups, the L2 doesn't finalize until the proof shows up on L1.  With optimistic rollups, the L2 finalizes if some configured amount of time passes without a challenge.  This means that with a ZR, you just end up with finality delayed until the proof lands, and this is visible to everyone.  With an OR, you can still get finality even though the L2 chain isn't valid.",
        "created_at": "2022-06-03T05:23:05.151000+00:00",
        "attachments": null
    },
    {
        "author": "0x2e",
        "category": "general",
        "parent": "",
        "content": "To solve the \"finality without actually being committed\" can't you just make finality \"2 weeks after transaction inclusion\" instead of a flat 2 weeks?",
        "created_at": "2022-06-03T05:24:49.778000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If validators are censoring, they can selectively censor and only censor challenges but not censor the L2 finality proposal.",
        "created_at": "2022-06-03T05:56:33.524000+00:00",
        "attachments": null
    },
    {
        "author": "0x2e",
        "category": "general",
        "parent": "",
        "content": "True i guess",
        "created_at": "2022-06-03T06:24:08.726000+00:00",
        "attachments": null
    },
    {
        "author": "rufusg.",
        "category": "general",
        "parent": "",
        "content": "Certainly there’s some floor on the ETH price below which the network starts suffering.  Let’s imagine a future where all the vast majority of transactions move to a few L2s and data blob incentivation results in very cheap L2 costs.  No burn is happening and priority fees are essentially 0.  ETH price plummets and validators leave as no apr is worth holding ETH.  Now you have x00 billion $ secured on L2s which can be griefed/censored further driving value away from the Eth network as a whole.",
        "created_at": "2022-06-03T06:44:16.252000+00:00",
        "attachments": null
    },
    {
        "author": "rufusg.",
        "category": "general",
        "parent": "",
        "content": "It seems that maintaining some floor on the utility and therefore price of Eth as we move to rollups is integral to the health of the network.",
        "created_at": "2022-06-03T06:47:05.453000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This is one of the reasons why zkRollups are superior to optimistic rollups, they don't suffer as badly from L1 censorship and you can't steal L2 money via L1 censorship like you can with optimistic rollups.",
        "created_at": "2022-06-03T06:55:38.655000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "The adoption of Ethereum is directly related to the ETH price",
        "created_at": "2022-06-03T11:36:07.474000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "ETH price is a \"side effect\" here though, the market cap is what matters.",
        "created_at": "2022-06-03T11:36:56.479000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Eth price can't be low if everyone would use it. Low price and mass adoption are just incompatible words.",
        "created_at": "2022-06-03T11:37:49.904000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "He is not wrong tho, is someone manages to access 66% and finalize anything to the chain, we have bad news.",
        "created_at": "2022-06-03T11:39:26.573000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Of course this isn't a thing post merge as the EL validates everything, but with sharding where the verification is being outsourced to the beacon chain, it is quite a concern.",
        "created_at": "2022-06-03T11:40:51.022000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If that is true, it is merely a side effect as you said, not a primary target.  The primary target is building a secure, censorship resistant, permissionless platform.  The platform should work properly independent of the price of ETH, and I believe this to be largely true.",
        "created_at": "2022-06-03T12:00:43.751000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Correct",
        "created_at": "2022-06-03T12:01:10.853000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "What I said is ETH price directly affects the amount of users involved",
        "created_at": "2022-06-03T12:01:37.390000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Not that ETH price should be a primary target",
        "created_at": "2022-06-03T12:01:49.370000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "\u003c@\u0026595685821026271242\u003es can we get a \"Please move this conversation to off-topic\" emoji and an off-topic channel?",
        "created_at": "2022-06-03T15:16:42.954000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "this is a very common misconception about PoS",
        "created_at": "2022-06-03T15:28:26.574000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "should we just change the name of this channel?",
        "created_at": "2022-06-03T15:28:58.681000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "I'd vote for that, yes",
        "created_at": "2022-06-03T17:12:15.766000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Certainly, historically this channel was meant to be R\u0026D talks that wouldn't fit in another channel, but a) it's impossible to avoid off-topic/pseudo governance discussions, and b) given the number of channels in this server, it's hard to find an actual R\u0026D topic that is not covered in one",
        "created_at": "2022-06-03T17:32:11.392000+00:00",
        "attachments": null
    }
]