[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think there is value in making it clear that this server isn't the right place to talk about things that aren't Ethereum R\u0026D.  Even though off topic does happen, I think the lock of an off-topic channel makes it happen less.",
        "created_at": "2022-06-04T02:24:57.264000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "I’d suggest a more inclusive model like the etc or polygon discords where general eth discussion is part of the general portion while actual r\u0026d happens below. Helps get more ethereum users watching/involved at the price of making it easier for people to say stupid off topic things in the wrong channel",
        "created_at": "2022-06-04T02:33:44.042000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "While we're giving out opinions, I would definitely _not_ like such a model. This server is nice and focused, which makes it somewhat easy to follow even if you're not having Discord open 24/7. I understand the desire for random conversations, or even an off-topic channel, but I honestly mostly see downsides for people working on R\u0026D or those that want to keep track of such efforts.\n\nAnd I agree with Micah that allowing more off-topic discussions even in some channels will lead to more noise overall (we certainly have seen so here in the past). I'm afraid that that in turn will lead to people actually working on R\u0026D to lose track of discussions and/or move somewhere else like private chats.",
        "created_at": "2022-06-04T10:52:30.642000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "+1, I love this server being quiet and dense as per useful information per message. Easy to follow and no need to monitor Discord 24/7, unlike regular servers where people chat casually.",
        "created_at": "2022-06-04T11:14:30.825000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "I do support the idea of creating a community Discord server for Ethereum users",
        "created_at": "2022-06-04T11:15:15.569000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "That would also reduce the \"off-topicness\" of this server, as people who want to discuss about off topic things would move to that sever. It's like creating a shooting range for people so they don't do it in other places, like creating a racetrack so people won't race on public roads.",
        "created_at": "2022-06-04T11:18:40.323000+00:00",
        "attachments": null
    },
    {
        "author": "gwintery",
        "category": "general",
        "parent": "",
        "content": "The thing is, some people post here cause they can get the attention of the coredevs.",
        "created_at": "2022-06-04T11:43:25.878000+00:00",
        "attachments": null
    },
    {
        "author": "gwintery",
        "category": "general",
        "parent": "",
        "content": "I think ethereum community in general is already pretty fragmented, idk how a community discord could be made for it",
        "created_at": "2022-06-04T11:44:10.402000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I don't think an \"off-topic channel for devs to ignore\" could exist. Some shy soul will post their meaningful question/opinion there instead of the technical channel, then a core dev will happen to answer it, the discussion will develop, others will join too, and eventually the channel will end up being observed by core devs anyway. There is a lot of better places for off-topic talk: https://ethereum.org/en/community/online/\n\nI don't think anything should be done about the current state of this server. The Merge is a big update and of course random people will come by and talk some nonsense, try to convince core devs to do X or Y. But once the merge is done, do you think they will stay here to talk about withdrawal methods or danksharding?\n\nIf anything must be done, I'd suggest just giving all devs or community members moderator roles and a green light to delete any off-topic talk more restrictively than it is done now. (EDIT: Like, Micah just had to tag mods to delete a post in \u003c#745077610685661265\u003e , why doesn't he have a moderator role himself?)",
        "created_at": "2022-06-04T11:59:43.380000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Micah explicitly asked to not have that role",
        "created_at": "2022-06-04T14:40:40.417000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "The Best Mods Are the Ones Who Don't Ask for the Job.",
        "created_at": "2022-06-04T16:29:59.587000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Maybe Vitalik should give mod privileges to Micah's role?",
        "created_at": "2022-06-04T17:39:06.871000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "unknown.png",
                "content": "fb112a3d9e3c3240db941a9c0d09d944a805d575baf0f873de8bd3831217ec35"
            }
        ]
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "That would be it, assuming that he doesn't want to have the mod role because it gets tagged all the time",
        "created_at": "2022-06-04T17:39:25.827000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "\u003c@301186049323958275\u003e \n\u003e It has been discussed, and some of us have been trying to get a bit of an unofficial commitment from the core devs about whether they would write code against and/or support a fork that wiped out censors after the fact.\nInteresting, do you see a clear line about this? I can imagine myself losing my position at prysm over this. Luckily the team seems to be always on the same side. But this particular issue I think it will be dividing",
        "created_at": "2022-06-04T17:57:52.930000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I would like a credible commitment from various core dev teams, I think with that we will likely never see any such attacks.  Without a credible commitment, someone may eventually try it and hope to profit off a potential split.",
        "created_at": "2022-06-04T18:25:51.604000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Given that we are most likely to be in a world post-merge where validators sign blocks blind, that seems like a poorly aimed request.",
        "created_at": "2022-06-04T18:31:30.954000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Why do you say that?",
        "created_at": "2022-06-04T18:34:11.510000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Who do you believe would be carrying out censorship, and who would you punish for said censorship?\n\n(Forgetting the question of how to prove censorship, but we'll gloss over that for now.)",
        "created_at": "2022-06-04T18:35:26.917000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The validators that did the censorship (e.g., deep reorg, or refusing to build on top of blocks with certain transactions in them or signed by certain validators).",
        "created_at": "2022-06-04T18:36:36.721000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If you are referring to the attackers being custodians (e.g., Coinbase) or delegates (Lido/Rocketpool), it doesn't matter.  Not your keys, not your coins.  If you delegate your decision making to someone else and they make a bad decision, you will suffer the financial consequences of it.",
        "created_at": "2022-06-04T18:38:01.757000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If we don't uphold that, then Proof of Stake becomes radically less secure and (IMO) offers no tangible benefit over Proof of Work.",
        "created_at": "2022-06-04T18:38:31.059000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The whole thing with Proof of Stake that makes it so powerful is that a user activated hard fork *can* retroactively punish bad actors for doing things that we cannot automatically catch.  This is unlike Proof of Work where once you execute the attack, you cannot be punished retroactively.",
        "created_at": "2022-06-04T18:39:31.774000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Either of those situations would require a supermajority of them to be owned by the controlling entity.  Which is a more general problem than reorging the chain.\n\nAnd that is both expensive and overcomplicated.  With MEV-boost a validator is given a hash of the transactions to sign, so has no idea if it is carrying out censorship or not (on a transaction level, anyway).  As long as a single builder is in control (and I think we agreed on this back on a post on ethresearch that this seems highly probably to be the case) then they can censor transactions at source, never appearing in a block, and can not only provide plausible deniability (\"I didn't see it in the dark pool from which I built the blocks\"; \"there were always better transactions to include\") but even if the community decided that they their denials rang hollow there would be no way to punish them, as they don't have any skin in the game.",
        "created_at": "2022-06-04T18:42:27.765000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Ah.  If someone tries to censor with PBS it only takes one non-PBS validator to prevent the censorship.",
        "created_at": "2022-06-04T18:44:03.152000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "While I agree that there will likely be a dominant builder, I find it unlikely that no validator will defect from the strategy of \"always accept blocks from the single dominant builder\".",
        "created_at": "2022-06-04T18:44:30.617000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "So I am less worried about PBS censorship because any altruist can break the cycle, unlike majority validator censorship (only way to break the cycle is user activated slashing fork).",
        "created_at": "2022-06-04T18:45:14.057000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Although true in theory, a 1/400000 chance of being able to avoid the censorship every 12 seconds seems like practical censorship.",
        "created_at": "2022-06-04T18:45:23.851000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Sorry, when I say \"one validator\" I meant \"one validating client\" (possibly multiple validators).  Your point still generally stands though.",
        "created_at": "2022-06-04T18:46:19.491000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I think we have good ideas for in-protocol solutions to that which can likely be deployed prior to any single builder completely taking over.",
        "created_at": "2022-06-04T18:46:56.382000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I do think this is likely the largest danger to Ethereum today: the likely dominance of a single builder. I think that instead of going into the merits of whether clients should  commit to punish censoring large entities (which, if I were in charge of making those commitments for a client I wouldn't) I think I would turn around the question and ask if clients would compromise on punishing a censoring builder. I think this is something where stock clients have a saying. I find it weird that clients are already supporting a client-relay-builder API when a skeleton of the relay-builder API was just released this weekend. There's an honest fear amongst clients that those that don't implement MEV-boost will be left aside. This is a reasonable fear and at the same one a dangerous one. I think if we are faced with the situation of a single censoring builder then clients will be faced with the option of either\n1- leave things as they are\n2- drop support for MEV-boost and accept their loss of share\n3- become uncensoring builders themselves",
        "created_at": "2022-06-04T20:02:30.670000+00:00",
        "attachments": null
    },
    {
        "author": "killari.",
        "category": "general",
        "parent": "",
        "content": "forking the chain because someone is censoring is going to be really controversial",
        "created_at": "2022-06-04T20:11:27.407000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I think that 2) and 3) are basically the same thing.\n\nI argued in the past that having non-consensus, non-stake actors (builders) be a critical piece of the chain wasn't a great way to go, but the \"untrusted validator/trusted builder\" model took hold.  Realistically, it will take a community effort to counterbalance this (I don't think that a consensus-level solution is going to happen any time soon).",
        "created_at": "2022-06-04T20:35:46.866000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I agree with this except the very first sentence. I believe clients just simply wiping out their MEV-boost support will see their usage drop down to zero. As such they will be forced to come up with a viable alternative or accept the loss. And yes, I believe with you that a building monopoly is going to be the devil we'll have to fight soon. But on the other hand, I myself can't come up with a better solution than PBS+crList and hope for the best at the moment.",
        "created_at": "2022-06-04T20:39:33.276000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "The fallback is to build blocks from the public mempool.  As that's all that a non-dominant builder is likely to have available in terms of transactions, if they walk away from MEV-boost they'll have to build their own blocks, no?",
        "created_at": "2022-06-04T20:41:20.999000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "yeah, and that will mean loosing a big chunk of their use-base. Unless they become competitive builders themselves",
        "created_at": "2022-06-04T20:42:30.198000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "which is 3",
        "created_at": "2022-06-04T20:42:34.437000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "as opposed to 2",
        "created_at": "2022-06-04T20:42:38.124000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "I don't think that becoming a competitive builder is an option, because they won't have the transactions from which to build high-value blocks.\n\nIf a searcher finds a high-value MEV opportunity then I don't see them sending it to many builders. In fact, I suspect they won't want to send it to more than 1 because that massively increases the chance that the opportunity will be reverse-engineered.  So they'll only send it to the current largest builder as that gives them the highest % chance of their MEV being included in the next block.\n\nGiven this, I don't see an easy way of a strong second place builder existing, let alone others further down the list.",
        "created_at": "2022-06-04T20:48:15.096000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Here's the part that is to fight internally within teams, but if this is given as an option to counteract a monopolitic censoring builder, then teams have the leverage of actually doing 2+3 at the same time, leaving users with the option of switching clients and effectively saying that they want to censor to gain more MEV, or accept that for a short term they may get less until the market sees that 1 of (as of today 5) clients is not using transactions from the relay pool",
        "created_at": "2022-06-04T21:14:36.483000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I strongly suspect that both prysm and lighthouse today have this leverage to play against any censoring agent",
        "created_at": "2022-06-04T21:15:07.235000+00:00",
        "attachments": null
    },
    {
        "author": "tokey1475",
        "category": "general",
        "parent": "",
        "content": "this a really interesting thought.  MEV-funded protocol development.  Ethermine currently runs their own mev-relay and I imagine many searchers send their bundles to them as well as flashbots.   While I agree with jgm that searchers will be very hesitant to send their bundle to an unknown upstart relay, if each client team ran their own builder which was their clients default block-builder, searchers would essentially be forced to send to each clients relay.  I think the clients could also generally be trusted to run honest relays.  I would much rather see MEV revenue go to client teams than to third-party builders.   In practice I'm not sure how well this would work though, as flashbots (or another builder) could just fork prysm, etc.. as they currently do with geth to redirect to their own relay.",
        "created_at": "2022-06-04T22:13:50.475000+00:00",
        "attachments": null
    },
    {
        "author": "tokey1475",
        "category": "general",
        "parent": "",
        "content": "client teams have some leverage to be sure, but I think a lot of it will come down to community pressure as it did with the client diversity push",
        "created_at": "2022-06-04T22:16:28.499000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "What’s currently missing from mev is cuthroat competition. If everyone does mev then eventually companies will figure out they can pay slightly extra to have everyone blacklist their competition. That’s when MEV becomes undesirable to the network.",
        "created_at": "2022-06-04T23:22:58.156000+00:00",
        "attachments": null
    }
]