[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I don't have an explanation to what happened here, I was afraid that prysm would attest for 346 in slot 347 if we ran with a special flag (`--attest-timely`) but checked that we don't. Asked other clients but I suppose they don't either. Perhaps the timings here do not reflect most of the network? In any case, if 346 gets synced and becomes head during slot 347 and then the node is caught in second 4 while syncing 347 and performing the reorg, then nodes would attest for 346.",
        "created_at": "2022-03-16T00:45:45.250000+00:00",
        "attachments": null
    },
    {
        "author": "saml0552",
        "category": "general",
        "parent": "",
        "content": "Thanks for looking into this! \n\n\u003e and then the node is caught in second 4 while syncing 347 and performing the reorg, then nodes would attest for 346.\n\nNot sure if I follow this, can you elaborate?",
        "created_at": "2022-03-16T02:26:16.997000+00:00",
        "attachments": null
    },
    {
        "author": "saml0552",
        "category": "general",
        "parent": "",
        "content": "Might very well be something with timing/routing, I was running on an Australian VPS so maybe routing to it was messed up or something for some proposers 🤷‍♂️ I might try and see if I can recreate this by running on an American VPS and maybe using a different beacon chain client, just in case something's funky there. FWIW I don't think this was the only slot that I saw this phenomenon in during my testing.",
        "created_at": "2022-03-16T02:29:41.460000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "1) We are all in slot 345, block 345 arrives in time, everyone attests for it, everyone's head moves to 345. \n2) We move to slot 346, no block arrives on time, at second 4 everyone attests for their head which is 345. Everyone agrees that 345 is still head.\n3) We move to slot 347. Block 346 arrives right at the beginning of the slot. Everyone syncs it, it's valid, so now head is 346 for everyone.\n4) Still in slot 347, attesters are still waiting for the right block to arrive. Block 347 could not have been based in 346 since the proposer never saw 346 in time, so 347 will be based in 345. There are two cases\n4a) Block 347 never makes it on time, so at 4 seconds into the slot, everyone will attest for 346 as their head. \n4b) Block 347 does arrive (in your example if everyone's timing was as yours, it would be 1.5 seconds into the slot), then everybody syncs it, they perform state transition, and fork choice will most likely make it win over 346 due to proposer boost, so there will be a reorg so that the canonical chain will become 345 --\u003e 347. \n\nNow if block 347 does arrive during the first 4 seconds of the slot, but attesters cannot sync it and perform the state transition in time, at 4 seconds they will attest for their head at that moment, which would still be 346. So this is just like case 4a)",
        "created_at": "2022-03-16T09:14:22.382000+00:00",
        "attachments": null
    },
    {
        "author": "saml0552",
        "category": "general",
        "parent": "",
        "content": "Ah, thanks, that makes sense! It does seem most likely that everyone saw 347 later than I did then I suppose - there doesn't really seem to be any other reasonable possibilities? I'll see how I go with replicating it 🙂",
        "created_at": "2022-03-16T09:50:24.005000+00:00",
        "attachments": null
    }
]