[
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "that is smart if they were hoping to find an unlocked phone to try to get private keys",
        "created_at": "2022-10-17T04:13:35.845000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "hopefully all of the people that need so sign a withdraw from the EF wallet are not in the same place, or someone might steal $500m",
        "created_at": "2022-10-17T04:15:53.958000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "\u003e Meanwhile going to a Colombian nightclub 😂\n“What could go wrong?” 😂",
        "created_at": "2022-10-17T08:00:11.022000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "No, EF really has not pushed the Pi4 as the recommended device. Joe at RocketPool was keen on the Pi4 for a while, but now considers it too restrictive, too hard to make work. He’s moved on to Rock5 B. \nThe bulk of solo stakers use a NUC or miniPC of some sort. Some build a home server instead, with a SuperMicro or AsRock Rack board, some buy a miniPC from dAppNode with turnkey software, and some use dedicated servers with hosting services.",
        "created_at": "2022-10-17T11:26:22.303000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "There’s a small number of Windows PCs and macs. Those usually have a harder time because the bulk of the testing and documentation is Linux based, particularly Debian and derivatives.",
        "created_at": "2022-10-17T11:31:00.222000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "\u003e tornado transactions are so rare impact on total mining profits would be basically zero, leaving ideology as the only possible factor to switch. Switching is manual work and miners are least likely to care of everyone.\nIt's one click basically.\n\n\u003e Solo mining would be purely ideological because there were no mev relays, making it a loss making move, and in the long run literally impossible - because difficulty slowly rises to a level in which most efficient miners are the only ones making a tiny profit, which includes mev profits.\nThis is a good argument, although if you are large enough you could get connected to Flashbots.\n\n\u003e Legally pools are inherently public entities, making them much easier to attack than anonymous solo validator somewhere. This means that a situation in which all pools censor was a likely outcome, and there would be literally nothing to be done about it while keeping PoW.\nYou'd have to be based in the US to be forced to comply with their sanctions. And funnily, the share of American ETH pools was 0% back when Ethereum was powered by PoW.",
        "created_at": "2022-10-17T15:51:29.656000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "While they didn't push it, they **were** advertising that a a single 8GB Pi 4 is enough to run a validator back then.",
        "created_at": "2022-10-17T15:53:20.417000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "source?",
        "created_at": "2022-10-17T15:53:31.012000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "No source, just my personal observation of general developer relations in 2020 when ETH testnets was a thing and there was a huge community testing Eth2 (I was a part of it back then)",
        "created_at": "2022-10-17T15:55:12.317000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Anyway, we do not need to argue about this",
        "created_at": "2022-10-17T15:55:49.522000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "I was around back then as well. And having spent most of those days recommending and talking people through setting up hardware and staking setups in general, in my memory it was always promoted with the disclaimer that it was rather adventurous. And beholden to particular low-resource clients, and also with the disclaimer that computational/storage loads would change and it might not be possible anymore in the future (i.e. now)",
        "created_at": "2022-10-17T16:01:24.857000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "https://ethereum.org/en/developers/tutorials/run-node-raspberry-pi/",
        "created_at": "2022-10-17T16:06:11.341000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "IMG_7256.png",
                "content": "036620ef73d74160234662a23f7bffc531732ffa874ff7bfc242239e3d34a40a"
            }
        ]
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "https://ethereum-on-arm-documentation.readthedocs.io/en/latest/quick-guide/recommended-hardware.html\n\n“Recommended Hardware\n\nIn order to run an Ethereum node with our images, you will need a Raspberry Pi 4, an Odroid M1 or a Rock 5B Board with some additional components.\n\nThis is the recommended hardware to run an Ethereum 1.0 node, An Ethereum 2.0 node or both. “",
        "created_at": "2022-10-17T16:07:10.813000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "https://nimbus.guide/pi-guide.html",
        "created_at": "2022-10-17T16:08:44.876000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "I mean there’s been no direct official statement but there’s a ton of associated organizations that have pushed it.",
        "created_at": "2022-10-17T16:09:47.545000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "Yes, so language is important. When you say \"Ethereum has for a while pushed the pi as the recommended device\":\n- Unclear who or what \"Ethereum\" is. Certainly not the EF, and I also question the \"ton of associated organizations\" (a ton or a few, associated to who exactly)\n- It wasn't really pushed. There are some guides out there, sure.",
        "created_at": "2022-10-17T16:16:34.505000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "This. Yes RocketPool in particular had a community that liked the Pi4 narrative for a while. And there was always the \"we are at the forward edge of \u003c:Nerdge:875451583796764682\u003e dom here\" disclaimer.",
        "created_at": "2022-10-17T16:56:59.796000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "ethereum.org is a decentralized site. There was a recent talk at Devcon about that: 1k contributors I think I remember? If \"Ethereum\" means \"the decentralized Ethereum community\" variously put forward Pi4 as an option: Sure. That was never the mainstream recommendation though. The bulk of it was x64, 4 CPU, 16 GiB RAM, 1TB/2TB SSD - later updated to \"maybe don't do 1TB any more\"",
        "created_at": "2022-10-17T17:00:02.095000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "There are still people happily running their Pi4. That requires Nimbus and Geth with reduced cache, and there is one (1) known SSD model that works, and ... it can be done, people are still doing it, and they are having fun.\n\nI wouldn't recommend it to someone new. That's hard mode.",
        "created_at": "2022-10-17T17:01:37.130000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "If you need to speak to the Manager of Ethereum about it, that would be \u003c@584920944762552346\u003e 😄",
        "created_at": "2022-10-17T17:02:24.386000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "So you say that EF is the \"real\" Ethereum but not independent organizations that build the ecosystem?",
        "created_at": "2022-10-17T17:55:48.139000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I believe also this was the case, probably a wayback search will find this. I will certainly not give it time",
        "created_at": "2022-10-17T18:13:40.239000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "What I'm saying is that \"Ethereum has pushed\" is really vague on who it is. It gives off the feeling of \"the ecosystem  at large\" (to me anyway, and accusing me in the process), when in fact it's more like \"a couple guys, most notably X\".",
        "created_at": "2022-10-17T19:49:33.284000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "I checked r/ethstaker's 2020 hardware guide post, and there also it's \"you can do it, but recommend against it\". But maybe that was just my EthStaker bubble of people, which I like to think of as a big part of \"Ethereum\" 😉",
        "created_at": "2022-10-17T19:53:43.109000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Indeed they are.\n\u003e  But maybe that was just my EthStaker bubble of people\nI think that could be it",
        "created_at": "2022-10-17T21:11:49.457000+00:00",
        "attachments": null
    }
]