[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I think this is a wrong assessment, specially because the person asking the question used the word \"validating\". We should be emitting clear and concise signs to not be bitten up later. For users nothing is expected to change in regards to disk space or CPU usage. I'm not qualified to say anything about confirmation waiting times. For stakers (which I assume the question came from) a good way of thinking of a bound is this: consider your daily execution database growth (Besu,Erigorn, geth, Nethermind, etc) call that x. Consider your daily consensus client database growth (LightHouse, Lodestar, prysm, Teku) call that y. Then expect a little less than y + 2x daily growth after the merge",
        "created_at": "2022-03-19T01:06:32.784000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Why would execution DB growth rate double after the merge?",
        "created_at": "2022-03-19T03:20:33.298000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Also, my understanding is that `y` is insignificant compared to `x`.",
        "created_at": "2022-03-19T03:20:50.067000+00:00",
        "attachments": null
    },
    {
        "author": "quezacoa",
        "category": "general",
        "parent": "",
        "content": "Thanks potuz for chiming in. \n\nIf y+2x and my assumption (pruning equals a node being offline in terms of validation) are correct this means either\n\n- more downtime\n- or more (hardware) requirements (second setup or second VPS during pruning of the main node or a very big SSD)\n\nUntil we have a solution. \n\nAre there any other options I can't see? To optimize network health I think we should transparently share it, maybe in a blog post? Well it might not be that significant.",
        "created_at": "2022-03-19T06:58:27.489000+00:00",
        "attachments": null
    },
    {
        "author": "quezacoa",
        "category": "general",
        "parent": "",
        "content": "Well, Micah indicted that there is at least one client having an auto prune feature, Nethermind.",
        "created_at": "2022-03-19T07:03:34.599000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Pruning doesn't need to mean a node is offline.  That's the case for geth but Besu, Nethermind and Erigon all have approaches that don't require offline pruning.",
        "created_at": "2022-03-19T08:49:51.229000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Because the execution payload will be stored twice, by the EC and the CC, eventually this will be improved in many ways, but not right after the merge",
        "created_at": "2022-03-19T09:23:29.534000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Hmm, that is unfortunate.  The entire block header + body?",
        "created_at": "2022-03-19T09:45:02.816000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "This structure \u003chttps://github.com/ethereum/consensus-specs/blob/dev/specs/bellatrix/beacon-chain.md#executionpayload\u003e",
        "created_at": "2022-03-19T09:46:26.935000+00:00",
        "attachments": null
    },
    {
        "author": "quezacoa",
        "category": "general",
        "parent": "",
        "content": "According to https://eth-docker.net/docs/Usage/ResourceUsage/ all EL clients have a growing DB, thus will eventually need pruning, although pruning was enabled at least for Nethermind (that is something I don't really understand).\n\nWhat I like to avoid post merge is the necessity for a backup system / \u003e1TB SSD, or put simpler, a sustainable solution for as long as possible.\n\nOkay so a combination of Teku+Erigon would be the one with the least disk space need with only 1 GB DB growth per week pre merge which seems to be the most sustainable solution 🤔 \n\nAnyway, I am looking forward to see the solutions being implemented :)",
        "created_at": "2022-03-19T10:45:39.788000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Does Erigon not store blocks? I'm a bit surprised by these numbers, I've seen people computing around 5Gb/day post merge. Haven't sat down myself to look into this",
        "created_at": "2022-03-19T10:57:00.073000+00:00",
        "attachments": null
    }
]