[
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Any idea what’s causing the current spike?",
        "created_at": "2022-03-18T02:39:18.545000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "image0.png",
                "content": "ffe30a349ccb2aa370a5c83f8a27c276dcf87f12c9070188db9656cce9bef728"
            }
        ]
    },
    {
        "author": "abcoathup",
        "category": "general",
        "parent": "",
        "content": "Assume it is people claiming an airdrop token (APE)",
        "created_at": "2022-03-18T02:56:05.140000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Ah should be under token guess we gotta fix that ty",
        "created_at": "2022-03-18T03:07:01.451000+00:00",
        "attachments": null
    },
    {
        "author": "quezacoa",
        "category": "general",
        "parent": "",
        "content": "Following up on the discussion above...\n\nDo we know more details on the hardware requirements (especially disk space growth) for a node post merge?\n\nWithout the possibility to connect to a third party service a node can't be validating while pruning manually. AFAIK the growth can be assumed to be 1 MB / 12 s, 7,2 GB a day, ~50 GB a week. A fully pruned node has 400+ GB. Thus a node with a 1TB SSD needs to go offline to prune every ~10-12 weeks. \n\nI bluntly guess that most home run nodes have a 1TB SSD as it is sufficient for now pre merge and that most of those node operators will manually prune prior to the merge. Thus we could see an increased chance of a low participation every few months until the prunings diverge a bit. Probably it is not that bad, but should it be considered somehow?\n\nThe only way I know of to keep the validator running is a second setup to run the same validator on, which introduces risk of slashing. \n\nIs there another way to avoid having to buy another setup?\n\nIf I understand eip 4444 correctly, it comes with an auto prune mode, so to say. I guess this would help with the introduced complexity described above.",
        "created_at": "2022-03-18T07:32:21.712000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Disk growth rates aren't expected to change meaningfully with the merge.",
        "created_at": "2022-03-18T07:33:14.549000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "There are a number of solutions to the disk growth problem in the works, including state expiry, statelessness, history pruning, portal network, etc.",
        "created_at": "2022-03-18T07:34:06.262000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "You can *today* prune history with some clients (like Nethermind).  This isn't great for network health, but it is better for the network than outsourcing execution to a third party.",
        "created_at": "2022-03-18T07:34:37.571000+00:00",
        "attachments": null
    }
]