[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Not at all. I can't predict the future but my guess is that pools will want to do partial withrawals of their excess balance to spin new validators. This takes a couple of weeks max",
        "created_at": "2022-10-16T00:29:17.412000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Celsius voyager Hodlnaut validators will be backing things up I expect longer but have no evidence so I’m very open to being wrong",
        "created_at": "2022-10-16T00:38:10.057000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Even if that's the case, if there is a run to exit it would start before the hardfork and the queue may not be long at the time withdrawals are enabled. We'll only find out then, I do suspect there'll be some exits at the time, but not something dramatic",
        "created_at": "2022-10-16T01:14:13.392000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "In any case I suspect 4844 may cause more exits from validators that can't handle the bandwidth",
        "created_at": "2022-10-16T01:14:53.223000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "That's not true, censoring blocks means getting less in profits and thus people will switch to other pools. It's just that no one bothered doing that since PoS was right around the corner. With PoW you are not locked to a single pool, you can change it in a couple seconds without any losses.\n\nAlso, no idea why Ethermine/Bitfly (the only pool that was censoring) censored Tornado.cash transactions as they are Austrian, they do not have to follow OFAC rules. Maybe \u003c@97774605351010304\u003e can explain this.\n\nAlso, as Chris said, 32 ETH worth of equipment. At the last days of mining when the difficulty was 12 PH and the price was $1,700, you could buy 72 RTX 3080 GPUs (assuming $700 GPU price and $50 misc price per GPU), which is 72 * 102 = 7344 MH/s. At that rate, you will find a block once per 1.2e+16 \u003cdifficulty\u003e / 7344000000 \u003chashrate per second\u003e = 18.911875 days. 18.9 days per block and you get the funds instantly (no need to wait for withdrawals), and you are free to go offline as long as necessary without penalties and you can leave/join on demand instantly without needing to wait.",
        "created_at": "2022-10-16T10:05:56.669000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "Could you stop pinging me for pow related comments? thanks",
        "created_at": "2022-10-16T10:10:37.141000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Sorry, will not do it.",
        "created_at": "2022-10-16T10:22:28.989000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "tornado transactions are so rare impact on total mining profits would be basically zero, leaving ideology as the only possible factor to switch. Switching is manual work and miners are least likely to care of everyone.\nSolo mining would be purely ideological because there were no mev relays, making it a loss making move, and in the long run literally impossible - because difficulty slowly rises to a level in which most efficient miners are the only ones making a tiny profit, which includes mev profits.\nLegally pools are inherently public entities, making them much easier to attack than anonymous solo validator somewhere. This means that a situation in which all pools censor was a likely outcome, and there would be literally nothing to be done about it while keeping PoW.\n\nRight now, empirically majority of mev enabled validators runs multiple relays which was confirmed yesterday due to a bug in reporting profits (as relays are trusted currently). Which means that full censorship right now is impossible as there's always a fee that makes most mev-enabled validators choose a block with tornado transactions. This is true even for pure profit-maximizing validators. Ideological validators don't have to run mev at all, and because there's no difficulty mechanism that only means lower profits, not a loss-making operation. It's also possible to run only non-ofac enforcing relays for a negligible profit difference.\nhttps://twitter.com/jon_charb/status/1581396552815632384",
        "created_at": "2022-10-16T12:03:30.789000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "It's beyond obvious censorship resistance after the merge is much, much higher, even if the explanation is too technically complex to sell it to the general public",
        "created_at": "2022-10-16T12:04:37.702000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Manifold said its an issue with Flashbots. I have no idea whether thats true or not.",
        "created_at": "2022-10-16T18:11:30.224000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Meanwhile going to a Colombian nightclub 😂",
        "created_at": "2022-10-16T19:22:51.502000+00:00",
        "attachments": [
            {
                "type": "image/jpeg",
                "origin_name": "IMG_20221017_025542.jpg",
                "content": "67c73b6ff4d1ca093671e1b8b8b1cd29c3c4eb63cba188b7ca9fd2922f3fc31a"
            }
        ]
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "Yes, but it shows the minimum fraction that runs multiple relays",
        "created_at": "2022-10-16T19:28:41.217000+00:00",
        "attachments": null
    }
]