[
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "Release the code for the merge, but leave it disabled. Announce that if no bugs are found that the next merge will only defuse the bomb, and enable the merge using the existing code. Give people enough time to mess with it, have weekly merges on testnets forking from mainnet, and offer an 8 figure bug bounty for a list of specific classes of issues people could find.\nIf you don't have a final version out for months, you have not given people enough time to take a serious look at reviewing the code. \nEthereum's market cap is $400T, major bugs will destroy a portion of this value since people would lose faith in the dev's ability to run Ethereum. This is still true if you respond to them immediatly and appropriatly. Offer a small portion of what would be lost to protect against that, from the Ethereum Foundation's wallet.",
        "created_at": "2022-05-01T00:58:33.067000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "It's open source, the code is already displayed for everyone to use and test and review and do whatever they want with it. https://github.com/ethereum",
        "created_at": "2022-05-01T01:02:29.260000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "Is the code on there done being changed until merge, outside major bugs?",
        "created_at": "2022-05-01T01:03:10.860000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I'm not a client developer but as far as i know the code shouldn't really change at this point. I don't think it has changed much since kiln testnet release in march.",
        "created_at": "2022-05-01T01:05:05.444000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "there is commits in the last week.....",
        "created_at": "2022-05-01T01:07:05.089000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "I used to do testing, and it took about 1-2 years of testing for our team to make sure a software release would work for our customer that essentially wrote a blank check for making sure our code would work when they upgraded too it.",
        "created_at": "2022-05-01T01:08:18.661000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Tempted to blame the 7000 gwei gas on the bomb 😂😂😂✌🏻✌🏻",
        "created_at": "2022-05-01T02:18:29.678000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "The spec is effectively final at this point, aside from params like TTD, what remains is ironing out client implementation issues, which are what the many testnet dry runs are for, all of which are also completely public",
        "created_at": "2022-05-01T03:58:35.021000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "The spec is one thing, the code of all the implementations is another. It is far more likely to have a problem in one of the various implementations that can be abused to break something, than it is to have a problem in the spec itsself.",
        "created_at": "2022-05-01T05:44:31.108000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "That is what the testnets are for",
        "created_at": "2022-05-01T06:44:39.476000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "\u003e Also I’m really against how rushed it is. Personally to me it seems crazy to run both clients and maintain two databases. I know that won’t change but it does indicate that things are being rushed such that an imperfect product is being shipped. Not a developer so I don’t know how much extra work it is but seems a lot better to just have one replacement client than build a second client that duplicates a lot of the work done by first one and run it in parallel. \nWhat to you might seem \"rushed\" to me seems as \"careful\". Making single monolithic clients right away is just introducing needless complexity (for now anyway), and if you were to do that on the same timeline would make it rushed imo.\n\n There will no doubt someday be a monolithic client that does all, or other types of convenience wrappers that make it seem you're running a single client. Do note that there has been exploration in the (opposite) direction of splitting up the EL client, most notably I remember Erigon/Silkworm/Akula (talking about) going there. Either way a client (monolithic or not) will have internal APIs/boundaries as well, with people (mostly) working on their own side of the fence.\n\nI do wonder what you mean with \"duplicates a lot of the work done by first one\". What exact parts are you talking about here?",
        "created_at": "2022-05-01T08:16:43.514000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "For instance needed to run two syncs",
        "created_at": "2022-05-01T08:19:57.836000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "What about it? You think that would be different with a single client?\n\nTo elaborate on that, there's two chains with two separate histories. The only way I can think of getting rid of duplicate sync requirements is to have a regenesis. Again rather unneeded complexity for switching to PoS imo, although eventually definitely a possibility to get rid of sync requirements for the pre-PoS era. Not sure how likely it is to be implemented though.",
        "created_at": "2022-05-01T08:21:38.074000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "The Merge replaces tiny (in terms of programming complexity) PoW with sophisticated PoS consensus algorithm. The complexity of creating a monolithic client is gonna be huge, it's much bigger than supporting Engine API as a communication channel between the pair of clients. And it's likely to have two parts of the team -- one with well understanding of consensus part, another with the same regarding execution part. From this standpoint having a separation of concerns between clients and client teams does seem natural to me",
        "created_at": "2022-05-01T08:25:16.415000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I'd say the most important thing though is that the current system lets us progress much more incrementally.  More incremental means smaller change sets and reduced risk. That's a pretty fundamental part of effective software engineer practices. The other part is not leaving testing until the end - it's integrated through the whole process which is why we don't need to spend two years in a code freeze while testing happens.",
        "created_at": "2022-05-01T08:28:03.488000+00:00",
        "attachments": null
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "Definitely learning things here thank you.",
        "created_at": "2022-05-01T09:06:33.465000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "On the context of duplication. Not as a complaint on the merge itself but as an honest question cause I don't understand how the EL syncs. We will be keeping completely separate p2p stacks right? I see how the CL will be gossiping blocks, attestations and the such on one network. Also how the EL will be sending transactions and keeping a mempool on it's own (let's not enter in the complications of relays). But also the EL will be sending back and forth payloads on their own, right? If they're syncing or missing blocks they'll request them from their own peers, right? This seems like an area that can be optimized in the future as there's no need for independent discovery, handshaking, etc. I understand that the naive approach would add complexity as a bidirectional communication would be required between layers. But I suspect the overall complexity will decrease as one of the two sides would completely disappear",
        "created_at": "2022-05-01T11:06:59.725000+00:00",
        "attachments": null
    },
    {
        "author": "quezacoa",
        "category": "general",
        "parent": "",
        "content": "This hasn't been decided yet. Have a look at Tim's latest tweet, the acd summary",
        "created_at": "2022-05-01T13:11:07.810000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "This is exactly what we are currently testing with mainnet shadow forks, hive and fuzzing. On the last ACD call we basically agreed to only move to testnets once these things are all green 😄",
        "created_at": "2022-05-01T14:57:59.505000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "There is some potential for simplification there yes. But since both networking approaches already had to exist separately the simplest first step was to keep them both. Whether it’s worth doing the work to have a single networking stack is an open question - there’s a lot of stuff built around the devp2p layer already and it includes world state sync which is very specialised to the EL and would be far too inefficient to route via the CL.",
        "created_at": "2022-05-01T22:41:59.343000+00:00",
        "attachments": null
    }
]