[
    {
        "author": "denverklaytn9992",
        "category": "general",
        "parent": "",
        "content": "Hi, I'd like to 100% understand what you said but there are some confusing points for me.\n\nCan you take a look to see if I understand correctly?\n\n\"\nEvery bit of gas in your block means that it takes longer to process and propagate, increasing the chance that it will be an uncle\n\"\nI understood what you said like below.\n\n* Including(processing) transactions in a block takes more time than not including it(empty block case) because processing txs takes time.\n* So, including txs when generating a block takes some risk that the block being mined may become uncle because there are miners who try to create an empty block which takes little time than including txs.",
        "created_at": "2022-01-17T02:22:02.278000+00:00",
        "attachments": null
    },
    {
        "author": "denverklaytn9992",
        "category": "general",
        "parent": "",
        "content": "* The reason why miner does not take txs with \u003c 1 Gwei prority fee is they think this is the minimum required benefit to take a risk being mined as uncle.",
        "created_at": "2022-01-17T02:25:01.410000+00:00",
        "attachments": null
    },
    {
        "author": "denverklaytn9992",
        "category": "general",
        "parent": "",
        "content": "Please let me know if I'm missing something. Thanks all.",
        "created_at": "2022-01-17T02:25:25.342000+00:00",
        "attachments": null
    },
    {
        "author": "tokey1475",
        "category": "general",
        "parent": "",
        "content": "larger blocks also require more bandwith so propogate around the network more slowly",
        "created_at": "2022-01-17T02:51:46.456000+00:00",
        "attachments": null
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "Is there any value in identifying **overpriced** opcodes, and giving them priority in block construction software (rather than repricing them during a HF)?",
        "created_at": "2022-01-17T02:55:22.978000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "What you said is more or less correct.  It is unclear you have a firm grasp on the nuance behind those statements, but you seem to get the gist.",
        "created_at": "2022-01-17T11:50:57.487000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "You aren't competing against miners who mined an empty block, you are competing against miners who included slightly less transactions than you, or mined a block just before you did but which hasn't fully propagated yet.",
        "created_at": "2022-01-17T11:51:52.181000+00:00",
        "attachments": null
    }
]