[
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003e You know how one of the big problems of crypto at this stage is identifying legitimate human accounts vs bot accounts\nI don't consider this to be a big problem.  What I consider to be a big problem is people caring about whether a human is interacting or a bot.  🙂",
        "created_at": "2022-02-27T06:35:23.701000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This is a form of KYC/AML, and it violates people's privacy.  It makes it so someone who is not comfortable giving out their cell phone number to a an untrusted centralized party is unable to interact with the system.  i.e., a barrier to entry that reduces the total set of people who *can*/*are willing* to interact with the system.",
        "created_at": "2022-02-27T06:37:03.259000+00:00",
        "attachments": null
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "Individual DAOs (or other institutions/groups requiring identification) are free to run this if they wish. However simswapping / simjacking exists, and it might be far easier for someone connected/affiliated with a service provider. Of the past 48 months I've spent over 30 without a cellphone, so I personally wouldn't be a fan of it.",
        "created_at": "2022-02-27T12:26:08.219000+00:00",
        "attachments": null
    },
    {
        "author": "modernlegend.",
        "category": "general",
        "parent": "",
        "content": "why do you view people caring about whether a human is interacting with a bot (and vice versa) be a problem? Bots have very destructive properties to human coordination - e.g. bots can  be leveraged by a single human to distort legitimate social influence by flooding said human's target post with upvotes/likes. But also bots can also be used to dos a network with spam transactions, etc.  To care about our mechanics around handling bots is to care about creating a more successful human coordination system. Isn't that largely the point of this whole project?",
        "created_at": "2022-02-27T13:58:02.727000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The root problem is almost always something else, and not the bot vs human thing.  For example, mis-aligned incentives.",
        "created_at": "2022-02-27T14:02:53.561000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It is very rare that I see a problem where I feel the *right* solution is differentiating humans and bots.",
        "created_at": "2022-02-27T14:03:18.707000+00:00",
        "attachments": null
    },
    {
        "author": "modernlegend.",
        "category": "general",
        "parent": "",
        "content": "Ok, so how would you solve the social media problem of using bots to game influence?",
        "created_at": "2022-02-27T14:05:24.775000+00:00",
        "attachments": null
    },
    {
        "author": "modernlegend.",
        "category": "general",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e",
        "created_at": "2022-02-27T14:20:12.753000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "There's a real problem in that an entity with enough funds will still find more difficult  finding humans do do their deed or to support their agenda than using a botnet. So a government system where there's a vote per person, Even if it's legal to sell it, is less prone to these attacks than a system where there's a vote per address or anything that can be impersonated by a bot",
        "created_at": "2022-02-27T14:26:45.010000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "What you *actually* want is a trust network.  Current social media platforms have completely failed to build such a thing.",
        "created_at": "2022-02-27T14:28:22.654000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "You can't blame them too much, building a human trust network is *really hard*.",
        "created_at": "2022-02-27T14:28:35.064000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Humans are *incredibly susceptible to manipulation.  In todays \"democracy\", we already have the problem of the party with the most financial interest (most willing to spend) gets what they want.",
        "created_at": "2022-02-27T14:30:05.118000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The best you can hope for is that the system is complicated enough to game that it bogs things down so change is slow.",
        "created_at": "2022-02-27T14:30:49.614000+00:00",
        "attachments": null
    },
    {
        "author": "modernlegend.",
        "category": "general",
        "parent": "",
        "content": "right, so you used the term \"trust network\". This goes back to the question of 'how does one build trust around identity while preserving privacy'. Seems like there's just two criteria that the solution needs to meet:\n1.  Identity needs to be anchored to something that's difficult to replicate en-masse (i.e. an ip address does not meet this criteria)\n2. It should preserve privacy. \n\nThe best (certainly imperfect) idea I can think of at the moment at least is a cell phone (most people have one, and it's hard to get a mass of them), and perhaps the system for registering it on the chain leverages some kind of zero knowledge technology where your privacy is still preserved. But perhaps a better solution would require the introduction of a new physical, real world asset which we would intentionally make difficult to replicate (as difficult as a birth certificate), but it would be less attached to doxing info?",
        "created_at": "2022-02-27T14:42:08.793000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "This is true, but no matter how susceptible humans are, they'll never be as easy to manipulate like bots",
        "created_at": "2022-02-27T14:42:54.511000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "\u003e This goes back to the question of 'how does one build trust around identity while preserving privacy'\nOne can choose to trust a non-human.  I trust my dog to identify intruders more than I trust basically anyone else in the house to do so.",
        "created_at": "2022-02-27T14:43:45.413000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Similarly, one may trust certain bots more than they trust humans.  A good trust network doesn't assert which actors are worth of trust, that is for the individuals in the trust network to decide.",
        "created_at": "2022-02-27T14:44:24.185000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I may trust an AI news aggregator more than a CNN or Fox news anchor.",
        "created_at": "2022-02-27T14:44:39.048000+00:00",
        "attachments": null
    },
    {
        "author": "modernlegend.",
        "category": "general",
        "parent": "",
        "content": "I'm not sure that's a fair analogy. When you \"choose\" to trust any entity you're taking the risk of that entity betraying your trust. Blockchain is powerful because you don't have to 'choose' to take a risk of trust on a single entity.  Provided you accept the trust assumptions of the consensus mechanism (e.g. an honest majority of nodes), one doesn't \"choose\" who to trust. One accepts that the system has been designed to necessarily be trust worthy. It's not \"I hope this entity doesn't betray me\", it's \"this entity can't betray me given this rule set\"",
        "created_at": "2022-02-27T14:47:42.877000+00:00",
        "attachments": null
    },
    {
        "author": "modernlegend.",
        "category": "general",
        "parent": "",
        "content": "I think we've basically solved it for the \"trust that a given transaction is valid\" through current blockchain tech, but we haven't solved that \"trust a given set of alleged identities are in fact distinct, autonomous  identities\"",
        "created_at": "2022-02-27T14:49:39.902000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "This is really big, in a well-tuned system people shouldn't feel the need to cheat it with bots",
        "created_at": "2022-02-27T15:06:57.182000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "A well designed human trust network applies something along the lines of Bayesian modeling, rather than trusting any individual.  You may have 5 friends who all make different and incompatible claims, and it is up to you to figure out which one you should trust.",
        "created_at": "2022-02-27T15:08:30.053000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "Or rather, if they do it shouldn't cause the system to lead to bad outcomes",
        "created_at": "2022-02-27T15:08:39.223000+00:00",
        "attachments": null
    },
    {
        "author": "modernlegend.",
        "category": "general",
        "parent": "",
        "content": "Is that essentially what the stake/slash system is? A system designed to guard against potentially destructive behavior (regardless of whether that behavior is bot or human)? And if yes, could this design be a generalized primitive for all systems including social media? i.e. a Twitter where every actor must stake to participate, and other actors have ways of detecting rule breaking behavior, which, if found, can result in slashing of the bad actor’s stake?",
        "created_at": "2022-02-27T17:24:37.641000+00:00",
        "attachments": null
    },
    {
        "author": "modernlegend.",
        "category": "general",
        "parent": "",
        "content": "Okay so I think I’m tracking now - y’all’s assertion is that a truly neutral well designed system should actually be “entity type” agnostic. It simply has actors and needs a game mechanic to punish the actors that jeopardize the integrity of the system. Is that what y’all are saying?",
        "created_at": "2022-02-27T17:46:56.002000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "You can kinda think about it like that, except usually that misbehavior is defined more formally and within the protocol",
        "created_at": "2022-02-27T21:50:04.398000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "You should try to design systems assuming *every* participant is capable of doing anything, regardless of if they're a program or made of meat",
        "created_at": "2022-02-27T21:50:57.642000+00:00",
        "attachments": null
    },
    {
        "author": "modernlegend.",
        "category": "general",
        "parent": "",
        "content": "going back to example of \"building a twitter that doesn't suck\" - how would you formalize what constitutes a legitimate expression of a vote (be it up or down) in the protocol  a way that's agnostic of entity type and solely considers the idea of an 'actor'? I suppose it's unreasonable to expect you to have an answer here, as it sounds like a challenging problem that has yet to be solved",
        "created_at": "2022-02-27T21:54:08.722000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I think this misses the point of how to decide *who* is the participant, the current staking algo we have on the ethereum consensus layer is an obvert oligarchy. Other systems may not work under this regime, and being resistant to sybil attacks may be desired. Certainly banning bots and proof of humanity is not a solution, but it is a step forward and having a resistance against developments in the area doesn't make sense to me",
        "created_at": "2022-02-27T21:56:51.339000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "The way I interpret it is that the incentives of the protocol keep those \"participants that are capable of anything\" incentivized to keep choosing do act out the protocol as intended",
        "created_at": "2022-02-27T21:59:31.987000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "Which is way different than saying something like \"a human can only click about 5 buttons per second\"",
        "created_at": "2022-02-27T22:00:37.447000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "incentives in well designed system may be impossible to define or even if well defined they may not be quantifiable. Even assuming that everyone's incentive when they go to the ballots to chose their president is generally the same, say something like \"I'm choosing the one that will bring prosperity to most in my Country\", we may disagree on what prosperity is, or what are the means to achieve it. We may even dissagree on how many votes do I get to have vs how many do you have. It doesn't need to be something at that scale, whatever governance system, from the whole Ethereum ecosystem just voting in the protocol guild, whatever mechanism you choose will benefit some interests and hurt others. What is clear is that in some of these, for example all the decision making processes listed: from the national elections with one vote per citizen, through the Ethereum ecosystem with a loose governance system where technical knowledge and work done gives you a little more leverage, to the protocol guild where every voting person and he's weight is chosen beforehand, in all of them, you will not want to have one person accumulating votes. If everyone is willing to sell his vote for $10, that puts a number to a centralized entity that wants to attack this system. this is a more secure system than any system susceptible to impersonation and bots placing votes, as long as the cost of deploying these votes is less than $10 times the number of required votes. At some small scales we can rely on good sense, but this is not the case always",
        "created_at": "2022-02-27T22:18:46.205000+00:00",
        "attachments": null
    }
]