[
    {
        "author": "jessepollak",
        "category": "general",
        "parent": "",
        "content": "Hi everyone - as folks may have seen, today we launched Base, an Ethereum L2. We'll be hosting an hour long overview and Q\u0026A session with some of the earliest builders on Base... and no one has been more critical to making Base possible than this group.\n\nIf you want to join, it's at 11a ET tomorrow and you can attend via this link: https://meet.google.com/mtc-upxu-ixk. Please bring any and all questions and I'll try my best to answer!\n\nMore details on Base here: https://twitter.com/BuildOnBase/status/1628759581353549825?s=20",
        "created_at": "2023-02-24T00:17:06.266000+00:00",
        "attachments": null
    },
    {
        "author": "jessepollak",
        "category": "general",
        "parent": "",
        "content": "I'm also open to answering any and all questions here - if folks want to ask, just throw 'em in the thread.",
        "created_at": "2023-02-24T00:18:09.498000+00:00",
        "attachments": null
    },
    {
        "author": "0xraino",
        "category": "general",
        "parent": "",
        "content": "Can someone provide me with a list of all the account abstraction proposals? So far I have 3074, 4337, but I think there's at least one more main one?",
        "created_at": "2023-02-24T01:00:09.219000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "2938",
        "created_at": "2023-02-24T04:03:13.663000+00:00",
        "attachments": null
    },
    {
        "author": "butta",
        "category": "general",
        "parent": "",
        "content": "Dear Ethereum Core developers,\n\nI hope this message finds you well. I would like to bring to your attention a concern that many in the Ethereum community have been facing. The rapid pace at which new features are being added to Ethereum is making it difficult for block explorers like beaconcha.in to keep up.\n\nAs you know, these explorers are crucial for users to understand and track their transactions and participate in the network. Therefore, I kindly request that you consider slowing down on adding new features and take some time to focus on ensuring that the existing infrastructure can handle the load.\n\nI understand that the Ethereum ecosystem is constantly evolving, and there is a need to introduce new features and updates to stay competitive. However, it is important to strike a balance between innovation and stability. Perhaps taking a vacation or a short break could help you come back refreshed and better equipped to address these concerns.\n\nThank you for your hard work and contributions to the Ethereum ecosystem. I hope we can work together to find a solution to this issue.\n\nBest regards,\n\nbutta",
        "created_at": "2023-02-24T10:48:14.905000+00:00",
        "attachments": null
    },
    {
        "author": "yperbasis",
        "category": "general",
        "parent": "",
        "content": "With Erigon you need less than 3TB for an archive node.",
        "created_at": "2023-02-24T14:05:55.823000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Sounds too ChatGPTish",
        "created_at": "2023-02-24T18:00:15.036000+00:00",
        "attachments": null
    }
]