[
    {
        "author": "thenateway",
        "category": "general",
        "parent": "",
        "content": "https://btc.blyss.dev/ there appears to be a encrypted block explorer for btc, could easily imagine an etherscan equivalent (I don't think you could privately write (ie broadcast a tx) using this, just encrypted execution of read-only functions)",
        "created_at": "2023-10-08T16:45:27.318000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "That doesn't generalize like that, the example you sent works because it's just summing some values, but arbitrary FHE circuits are tremendously expensive still and may be just impossible with the EVM model.  You could specialize that for ERC20s and build a database that supports these kinds of encrypted lookups though.",
        "created_at": "2023-10-08T18:04:00.189000+00:00",
        "attachments": null
    },
    {
        "author": "thenateway",
        "category": "general",
        "parent": "",
        "content": "interesting! I wonder what some of the approaches would be to tackling the problem. I hope it turns out like zkevm (5+ years or maybe impossible -\u003e a couple years).\n\nOn the privacy front I also was wondering about network level privacy. I noticed that this BIP-324 was recently merged into bitcoin core, and I wonder if something similar would make sense for ethereum clients: https://github.com/bitcoin/bips/blob/master/bip-0324.mediawiki\n\nSearching for \"privacy\" in this discord gives a lot of discussion about validator privacy, but I am thinking more of the node runner, who expects privacy when performing txns given that they took the trouble to run their own node.\n\nWhen running your own node, you do get privacy for your read-only requests, but for tx broadcasting, it seems like you'd be better of sending them to a public url over tor. It would be very nice if clients had some way of adding plausible deniability that they were the originator of a gossiped tx. This bip-324 doesn't seem to promise that entirely, but does seem to make undetected surveillance of nodes a lot more difficult.",
        "created_at": "2023-10-08T18:33:38.422000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "The thing with the zkEVM work was that it was *already plausible* from the beginning, some talks on it even cited they're just using the SNARKs for C technique (https://eprint.iacr.org/2013/507.pdf), the limitation was just circuit size, which got a lot easier with newer constructions like PLONK.  Whereas with FHE you're always going to be very limited in the kinds of programs you're able to run due to the expoential blowup in ciphertext size and we'd probably need something on the level of a turing-award winning improvement in the state of the art to do anything like full FHE EVM execution.  You can go pretty far with private database queries like the above but it's always going to require some upfront setup unique to the use-case / contracts in question.",
        "created_at": "2023-10-08T22:50:27.128000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "BIP-324 is really just bringing Bitcoin's p2p network up to the same level as most later generations of blockchain networks.  Ethereum uses devp2p/libp2p which both already do transport encryption to a similar level that BIP-324 achieves.",
        "created_at": "2023-10-08T22:52:21.848000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "You may be interested in looking into dandelion transaction routing.",
        "created_at": "2023-10-08T22:53:14.825000+00:00",
        "attachments": null
    }
]