[
    {
        "author": "adammbq",
        "category": "general",
        "parent": "",
        "content": "Why does burning of tokens lead to better security?",
        "created_at": "2023-03-20T01:28:48.621000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "it does not, but eth devs hate POW miners, and they pretend that miners and everything related to paying them is evil.",
        "created_at": "2023-03-20T01:46:06.364000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Accurate 😂\n\nBut jokes aside, main reason it was done is because people believed that burning ETH will \"moon\" it, but so far things are much worse than expected looking at ETH/BTC chart (-20% since Merge as of now).\n\nAnd no, **Mods, you have no right to delete this while citing \"price discussion\"** because it's **related to Ethereum R\u0026D**. This was the mostly the main motivation for EIP-649, EIP-1234, EIP-1559, and **arguably** EIP-3675 and the introduction of Ice Age as whole.",
        "created_at": "2023-03-20T10:56:01.728000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It was not the main motivation behind any of those.",
        "created_at": "2023-03-20T10:57:31.823000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "\"mostly\"",
        "created_at": "2023-03-20T10:59:16.571000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "While I am a pretty strong detractor of the Ethereum development process these days, I haven't seen evidence that things have deteriorated to the point where \"make ETH price go up\" is a primary goal for any of the core devs.",
        "created_at": "2023-03-20T10:59:28.492000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I haven't even seen any indication that it is a secondary goal of any of the core devs.",
        "created_at": "2023-03-20T11:00:25.160000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Let me collect some evidence for you",
        "created_at": "2023-03-20T11:00:42.030000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I disagree pretty strongly with *many* decisions being made, but I don't think those decisions are being made because the core devs are trying to pump the ETH price.",
        "created_at": "2023-03-20T11:01:07.643000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "can you provide any evidence or argument to the contrary that eth devs used the bomb to force eip-1559 on us to hurt miners and decrease eth issuance?\n\nHere is some that you agree that miners are overpaid, which supports the argument that 'price go up' (or really price stop going down) is a motivation to lower POW mining payments.",
        "created_at": "2023-03-20T12:13:26.460000+00:00",
        "attachments": null
    },
    {
        "author": "acid0003",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2023-03-20T12:13:33.115000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "image.png",
                "content": "054426bbbad959b5d95a97fe40385487e258557dab2b456bafe2288728c164ce"
            }
        ]
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "\u003e Here is some that you agree that miners are overpaid, which supports the argument that 'price go up'\nThat is a _massive_ logic step. You're missing some important links on e.g. how issuance relates to price action.\n\n\u003e is a motivation to\nYou might be able to argue it's a _consequence_ (see above), but nothing in that quote supports saying it's a _motivation_ .\n\nAnyway, we've all been over this a hundred times way back when. I see no reason to rehash it, especially if it's the same old arguments based on \"here's me mind-reading people's intentions\"",
        "created_at": "2023-03-20T12:43:51.710000+00:00",
        "attachments": null
    },
    {
        "author": "0xblueshark",
        "category": "general",
        "parent": "",
        "content": "Hi, just wondering if someone worried that LSD protocols like LDO has too much staked ETH which may cause the centralized problem. After Shanghai upgrade, this may get worse. Do u guys think its a threat to ETH?",
        "created_at": "2023-03-20T12:59:10.876000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Upon researching, indeed, core developers rarely discuss tokenomics, especially when the topic is controversial (i.e., making a reward reduction for someone), as they appear to be extremely careful not to say something that may cause cascading disagreements and protests (like what was with EIP-1559).",
        "created_at": "2023-03-20T13:34:38.212000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "# Part 1 - EIP-1559\n\nThe most heated and controversial change was EIP-1559, and most of the time, I will talk about this EIP here. Initially, it was proposed in early-mid 2019, but it is visible that no definitive action regarding actual implementation was done, after which it was somewhat forgotten until the spring of next year, which is *shortly* after Tim Beiko from Consensys joined. After that happened, we can see the work effort quickly escalated, with the first serious ACD discussions sparking, the series of EIP-1559 implementers' calls launched, and all that happened rapidly. Originally, there was little mention of fee burn and almost no evidence that suggests that the original introduction of EIP-1559 was made primarily because of the fee burn; however, later, we can see that it got picked up because of that.",
        "created_at": "2023-03-20T13:34:43.868000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Initially, most of the publicity was attracted to EIP-1559 because it was believed that it would reduce fees. It was not uncommon to see \"EIP-1559 fixes high gas fees\" from many people on social media platforms like Twitter, Reddit, and others. That continued to be the case closely through 2020-2021, with the visible efforts to increase the awareness of this misconception being visible closer to mid-2021 only. My opinion on this is that it suggests the omission of efforts to destroy this misconception might have been intentional, as when things are \"almost done\", it is almost impossible to make any structural changes which would require rewriting the implementation.",
        "created_at": "2023-03-20T13:34:48.818000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "In early 2021, miners protested the EIP-1559 fee burn, demanding action from core developers - either removing the fee burn or increasing the reward to compensate for it. Initially, Tim Beiko and core developers seemed to care, and they even hosted an EIP-1559 Community Call in February 2021 and opened EIP-1559-related discussion channels in the R\u0026D Discord server. However, although core developers provided visible efforts, no definite action was made to address this issue to make miners happy; there was not even a 10% static block reward increase. This indirectly suggests how important the fee burn was in EIP-1559 and low miner rewards in general.",
        "created_at": "2023-03-20T13:34:53.423000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Closer to mid-2021, after the common misconception that EIP-1559 is for reducing fees was effectively eliminated, there was a new \"wave\" of what seemed to be marketing that Ethereum is \"ultra-sound money\" and that Ethereum is going to be deflationary, which will (openly) make the price go up. While there is no evidence suggesting the firms that manage the core development are related to this, this fact still deserves mention.",
        "created_at": "2023-03-20T13:34:59.309000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "# Part 2 - Investors\n\nMany companies participate in core development, but the most notable are the Ethereum Foundation (the official foundation company of Ethereum) and Consensys. While the EF is funded with premine, Consensys is funded by VCs.",
        "created_at": "2023-03-20T13:35:04.202000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "While there is little motivation for EF to be focused on the price reaction when making core development decisions (although arguably there is, to sell their premined ETH for higher), Consensys definitely does have since it's a for-profit company. Consensys is a large player in Ethereum that no one is discussing, while this firm appears to be behind the actions mentioned above. Looking at their financials, they live off investment rounds (with the last Series D funding, collectively raised US$450M of investment funds from large private venture capital firms). They are technically not a \"regular\" company, and they do not make any profit directly. Instead, they are investing in projects around the Ethereum ecosystem and account for a significant contribution to the Ethereum protocol development itself. Sometimes, their level of control gets comparable to the EF's (Ethereum Foundation), the go-to company to refer to as \"Ethereum\". We do not need to be geniuses to understand that VCs who invest in Consensys are here for profit; this is not altruism. And think for a bit, what is the way how investing money into Ethereum can be profitable? The answer lies right in front of us - to profit off the Ethereum adoption, which is directly related to ETH price.",
        "created_at": "2023-03-20T13:35:09.486000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "While EF was the only company doing core development before 2019-2020, Consensys has started its growth of control since then and grown into the most influential company in the Ethereum space after EF, closely following the latter. Combined, investors account for all governance that happens behind Consensys as a whole, and they are the entities who make the decisions that collectively represent the decisions of Consensys as a company — and these decisions are made **for profit** (this is important).",
        "created_at": "2023-03-20T13:35:15.803000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "Core developers themselves need to get funded to finance their work, and since the software they provide is freeware, there must be an external source of cash flow. It does appear that a vast majority (95%+) of that are investments, and it's in the name - they are made for profit. Now ask yourself a question, what's the only way to finance core development? The only reasonable answer that can be provided is to buy ETH low, work on it, and sell ETH high. Hence, while directly Ethereum core development has nothing to do with tokenomics, indirectly, it's as related as it can ever be.",
        "created_at": "2023-03-20T13:35:19.950000+00:00",
        "attachments": null
    },
    {
        "author": "alexssd7fp",
        "category": "general",
        "parent": "",
        "content": "And I do agree with you, Micah. Indirectly, the employees of companies (the faces of it) that do core development on Ethereum have no relation to the Ethereum price, but the decisions and commands instructed to them are directly related. Look beyond the \"visible bubble\" of Ethereum core development (and arguably the governance too).\n\n# Conclusion\n\nI think I have provided enough information here. There is a lot more, however. It was only a brief write-up on this. All these facts suggest that, albeit indirectly, core development decisions are heavily related to tokenomics and Ethereum price in general. Now think about it closely. Provided all of this has happened combined, it is either a rare coincidence or behind-the-scenes core developer coordination, which is not public, unlike the discussions we have here.",
        "created_at": "2023-03-20T13:35:25.427000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "It's also possible it will get better, as Lido was an early mover and Rocketpool and SSV were immature, so some people who deposited via Lido would have used more decentralized alternatives",
        "created_at": "2023-03-20T16:51:37.717000+00:00",
        "attachments": null
    },
    {
        "author": "joey_02",
        "category": "general",
        "parent": "",
        "content": "Hi are there any execution clients that prune automatically?",
        "created_at": "2023-03-20T18:38:04.929000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "it's in a large way a consequence of no withdrawals",
        "created_at": "2023-03-20T21:02:38.010000+00:00",
        "attachments": null
    },
    {
        "author": "0xsadcat",
        "category": "general",
        "parent": "",
        "content": "they charge fees, but you gain liquidity in return. once withdrawals arrive, they stop making much sense for larger stakers",
        "created_at": "2023-03-20T21:03:08.656000+00:00",
        "attachments": null
    }
]