[
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "Hmm I mean ... it depends on what the goals for decentralized tech and blockchain actually are. Cause they can defend against various actors, coordinate actors in various ways.\n\nIf the goal is being able to do communication, identity, payments without your nation state blocking you or punishing you - then it has to be possible to do all this without being deanonymised. You might want this for political reasons (say you're a small party or a journalist, and the majority party is colluding with ISPs, payment gateways etc in your country to find and block you, typically bypassing any democratic process)\n\nAs of today I find the state of this grim - there are very few actors successfully defending privacy against nation states and the bar for doing so in terms of technical skills is very high. You can see how many dark web drug markets are active versus shut down for instance. Again, the point is not actually to sell drugs, it's to see whether there's anyone on Earth who is able to defend privacy against a sustained effort by a nation state.",
        "created_at": "2023-09-12T06:12:57.847000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "I also feel like privacy is much more important than censorship resistance - if you're deanonymised your state can just send police or thugs at your door, they don't need to censor anything",
        "created_at": "2023-09-12T06:14:32.570000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "And if you cannot be deanonymised then censorship resistance becomes less important - why will an ethereum validator or p2p layer or anyone censor you if they know nothing about who you are. Although yes censorship resistance still useful in some cases",
        "created_at": "2023-09-12T06:16:19.995000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Just in case \u003c@206016661470314496\u003e the link in the release email \u003chttps://blog.ethereum.org/2023/09/12/geth-v1-13-0\u003e is a 404",
        "created_at": "2023-09-12T11:10:43.303000+00:00",
        "attachments": null
    },
    {
        "author": "0xraino",
        "category": "general",
        "parent": "",
        "content": "good point",
        "created_at": "2023-09-12T14:16:37.283000+00:00",
        "attachments": null
    }
]