[
    {
        "author": "joey_02",
        "category": "general",
        "parent": "",
        "content": "I have a general question I was hoping to get help with. Since BLOB space in 4844 is pruned, rollups can not use it as data availability correct? \n\nDoes this mean rollups still have to use calldata and don't get reduced fees? From what I understand, if you post data on BLOBs you would still need to use something Celestia for data availability since you can't rebuild state from BLOBs after it is pruned. Please let me know if I am misunderstanding this",
        "created_at": "2023-06-08T19:31:50.910000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "They can use it for DA because their challenge/exit window is shorter than the blob retention period",
        "created_at": "2023-06-08T19:59:53.233000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I believe blobs are stored for ~18 days now, and Arbitrum + Optimism both have 7 day withdrawal windows",
        "created_at": "2023-06-08T20:00:14.639000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "So if there was a fraud proof to be processed, the data would be available to retrienve on-chain. So once the data is pruned, it would be too late to  submit a fraud proof to the L2 anyways.",
        "created_at": "2023-06-08T20:01:00.343000+00:00",
        "attachments": null
    },
    {
        "author": "joey_02",
        "category": "general",
        "parent": "",
        "content": "Thank you so much for the help! That makes sense for verifying state transitions, however what happens if a node has to rebuild state from scratch? Are they able to retrieve the L2 state somehow from the L1 contract or would they need the tx data in the blobs?",
        "created_at": "2023-06-08T20:08:05.736000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I don't know enough about the various L2s to comment, but my gut feeling is that it would not be possible to rebuilt an L2 state from scratch using solely L1 data. \n\nThat said, I can imagine L2 constructions that allow you to verify an earlier state + set of blocks/transitions you've gotten off-chain ends up at the same state as what is currently posted to L1",
        "created_at": "2023-06-08T20:10:41.506000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "As Tim said there's a few options. One of them is to just embrace snap sync/checkpoint sync so you're starting from close to the chain head by downloading the world state and don't need historic data.  But you can also make historic data available from places with much lower trust thresholds like torrents etc but it's just there for historic info rather than for reaching agreement on the canonical chain.",
        "created_at": "2023-06-08T21:27:14.788000+00:00",
        "attachments": null
    }
]