[
    {
        "author": "0x1984",
        "category": "general",
        "parent": "",
        "content": "Yes, very stable at 29K for transfer. It’s intriguing that limit can surge that much",
        "created_at": "2024-02-12T00:37:15.536000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It is entirely deterministic.  Any difference is an artifact of the contract being called.  Best to talk to the authors of the contract to better understand the difference.",
        "created_at": "2024-02-12T02:51:53.730000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "Without a specific transaction we can only guess.  Like this guess.  Did the account have an existing balance?  For a typical token contract if the receiving address didn't have any token balance and receives a balance a storage slot will transition from zero to a new value, which is charged 20k extra gas, and would requires 49k gas if that's the only impact.  EIP-2200 covers all the cases on what to charge on specific storage cases.",
        "created_at": "2024-02-12T15:20:08.802000+00:00",
        "attachments": null
    },
    {
        "author": "0x1984",
        "category": "general",
        "parent": "",
        "content": "Thanks! I followed \u003c@301186049323958275\u003e advice to contact ACX token devs directly and they gave out the same answer - extra gas needed to initialize account with non-prior ACX token balance. My transfer tax went out of gas limit with MetaMask which is how I noticed this - but surprised that MetaMask did not implement EIP-2200?",
        "created_at": "2024-02-12T20:25:05.263000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "Metamask doesn't have an EVM, to my knowledge, so EIP-2200 wouldn't matter.  Not sure why the gas estimate was low.",
        "created_at": "2024-02-12T22:31:40.441000+00:00",
        "attachments": null
    }
]