[
    {
        "author": "0x1984",
        "category": "general",
        "parent": "",
        "content": "Less about rejected EIPs, but more about hotly debated EIPs(for example, cut slot time to 1/2 \u0026 keep gas limit, or simply double gas limit). And in the future it’s going to have similar EIPs in such nature that it might be a good idea but there is no data backing it. It could not be devnet as it needs wide participation. It could not be Sepolia or Holeski as they are used regularly. Then it can just be a fork of Holeski. One extra DevOps engineer can handle the branching and deployment of this extra testnet",
        "created_at": "2024-12-17T02:47:40.783000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I haven't been paying close attention to ACD.  Has it been decided that we don't really care about disk growth anymore, or that we are willing to take on debt today in hopes that future hypothetical improvements will address the disk problem?",
        "created_at": "2024-12-17T03:26:33.608000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "In the past when I would bring up the issue it would get some mumbles of semi-agreement, but it feels like these days it only receives pushback, but maybe I'm missing some context.",
        "created_at": "2024-12-17T03:27:33.378000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "I’m not part of ACD. From the outside, it looks as if disk space worries are being taken seriously enough to expire pre-merge history by May 1st 2025, which kicks the can down the road for another year to get full 4444 - or at least more expiry.",
        "created_at": "2024-12-17T12:34:51.684000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Is 4444 actually being implemented and is it generally agreed on as a good thing?  Last I heard it was still undecided, and it sounds like people want to increase disk growth now and figure out whether we will do 4444 or not later.",
        "created_at": "2024-12-17T12:41:59.745000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "My very unscientific Xitter poll with n=~55 shows some 47% ish of responders wanting to stay on 2TB, and the rest are either on 4TB or are planning to move to 4TB.\n\nPre-merge expiry would allow that 2TB group to run for another year.",
        "created_at": "2024-12-17T12:42:02.139000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "general",
        "parent": "",
        "content": "Your finger is closer to the pulse than mine on that. I saw “all client teams have agreed to expire pre-merge history by May 1st 2025” which at least sounds like 4444 is still on the table.",
        "created_at": "2024-12-17T12:43:06.183000+00:00",
        "attachments": null
    },
    {
        "author": "milos88",
        "category": "general",
        "parent": "",
        "content": "Current agreement between execution client teams is that every client will be free to drop pre-merge bodies and receipts on May 1st. Which is partial step towards full 4444. More details in \u003c#953349957400821860\u003e channel",
        "created_at": "2024-12-17T12:52:21.561000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "This is actually what we do today, if there's an intent to bump gas limit or blob count then we run some tests to see what the impacts would be. Mekong(temporary testnet) for e.g had the gas limit at 36M before any of the other testnets, second was sepolia. We additionally did local devnets with kurtosis to check the impact as well. However assigning a person to do this all the time feels un-necessary to me, if there's intent we have and would assign someone to the task. \n\nHowever slot times are a much more fundamental change and cannot be touched without deep involvement of client teams as there are enough implications that need thinking through. afaik there's no immediate push to change slot times.",
        "created_at": "2024-12-17T13:38:06.368000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "I think you have a misunderstanding about the current status of 4444s - users will be able to get history in a decentralized way. either through torrent or portal. so we do not limit any applications. if you applications relies on the devp2p, then it is your problem - we never committed to make devp2p usad by applications other than ethereum core. also yes - we are moving forward with a first prune on may 1st (decided) and rediscuss it later",
        "created_at": "2024-12-17T20:43:28.701000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "This response seems unrelated to my inquiry about whether 4444 is slated for inclusion, and if so when.  Perhaps you meant to reply to something else?",
        "created_at": "2024-12-17T20:45:52.750000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "oh - yeah i got a wrong impression",
        "created_at": "2024-12-17T21:16:07.828000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "eip4444 does not have an inclusion yet but some degree of history expiry is already confirmed",
        "created_at": "2024-12-17T21:16:38.739000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "something in 2025 will be done or some form that accomplish the same thing",
        "created_at": "2024-12-17T21:17:03.933000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "general",
        "parent": "",
        "content": "i think i got the impression from a post you made on ethereum magicians about breaking apps, sorry abt that",
        "created_at": "2024-12-17T21:17:54.714000+00:00",
        "attachments": null
    }
]