[
    {
        "author": "catwith1hat",
        "category": "general",
        "parent": "",
        "content": "My apologizes for asking that here, I hope that doesn't rub people the wrong way.\n\nI don't understand how Solana is able to achieve their TPS numbers. The \"network environment\" on the public internet is the same for everyone. Their block time of 400ms seem incredibly short when you have to account for network propagation time (hello speed of light!). Is their \"Turbine\" architecture really able to reliably push large blocks to everyone in the network within a 400ms time horizon?\n\nYes, 1 gbit/s solana validator requirement allows you to push more bytes than Ethereum's 5mbit/s validator requirement, but bandwidth != latency, so network convergence is still at risk. \n\nHas someone (preferably with an Ethereum background) written a view on Solana that identifies either their scaling secret sauce, or on how they give different security guarantees than other blockchains? Are Solana valdiators just all collocating close to or in AWS us-east-1 and telling nobody?",
        "created_at": "2024-10-03T17:24:20.624000+00:00",
        "attachments": null
    },
    {
        "author": "sophia_24798",
        "category": "general",
        "parent": "",
        "content": "They don’t merklize state and don’t use gossip for block propagation (turbine is hierarchical). Imo those are both very centralizing design decisions. Most importantly, the TPS numbers you’re reading might be bs: either using synthetic load or including consensus operations",
        "created_at": "2024-10-03T18:51:01.551000+00:00",
        "attachments": null
    },
    {
        "author": "treyzania",
        "category": "general",
        "parent": "",
        "content": "One thing they do as well is that txs require they list their storage accesses upfront so they can do some prefetching and execution in parallel, which is similar to EVM access lists but as a a hard requirement instead of merely a discount",
        "created_at": "2024-10-03T19:38:31.158000+00:00",
        "attachments": null
    },
    {
        "author": "catwith1hat",
        "category": "general",
        "parent": "",
        "content": "I have not fully understood why Ethereum does full state merkelization with every block. For syncing clients, once per epoch would be enough.",
        "created_at": "2024-10-03T20:54:52.734000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "general",
        "parent": "",
        "content": "It used to be per-taransaction, and it was part of the receipt.  It was cut back to per -block for performance reasons fairly early.  It's a logical progression to move per-epoch, but it is not the absolute limit on performance it was when it was changed.",
        "created_at": "2024-10-03T21:09:23.947000+00:00",
        "attachments": null
    }
]