[
    {
        "author": "g1.eth",
        "category": "general",
        "parent": "",
        "content": "Hi \u003c@755590043632140352\u003e,\n\nSuppose I’m running a network based on Ethereum at block 10,000. If I decide to stop and go back to block 5,000 — essentially starting a new chain from that point onward, leaving behind all state and history beyond block 5,000 as if it never happened — is something like that technically possible using the existing Ethereum client tooling (e.g., beacon and execution clients)? I’m not looking to influence the canonical chain or achieve majority consensus — I’m more thinking in terms of a divergent local chain or test network for research purposes.\n\nThe broader reasoning behind this is: let’s imagine a catastrophic scenario, such as a critical bug or major vulnerability introduced through a protocol upgrade or application logic, where the only real way to \"undo\" the damage is to revert the chain to a block before the incident occurred — essentially moving Ethereum back to a state where the issue never took place.\n\nI understand that Ethereum’s design intentionally disallows such reorgs beyond finalized checkpoints, and that rolling back finality would require a two-thirds majority of stake, making it practically impossible on mainnet. But I’m curious — from a design philosophy perspective, is this kind of rollback or reorganization mechanism something Ethereum intentionally avoids having? For example, if a false or malicious transaction were ever to make it into a finalized block (something like the DAO incident), would Ethereum always aim to live with that finalized state rather than introduce any built-in ability to revert?",
        "created_at": "2025-07-29T11:11:05.272000+00:00",
        "attachments": null
    },
    {
        "author": "g1.eth",
        "category": "general",
        "parent": "",
        "content": "I realize Ethereum has no built-in mechanism for rolling back to a specific historical block, but I’d love to understand whether this is purely a technical limitation or a deliberate architectural principle.\n\nThanks   and I’ll make sure to take any Prysm-specific questions to the Prysm Discord moving forward.",
        "created_at": "2025-07-29T11:11:33.937000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I think this would be implementation dependent. In prysm this would be impossible right now without heavily hacking the code. We have a Todo list to precisely do this since the Goerli fiasco but haven't had time to work on it. We do need to have mechanisms in place to roll back the chain or even revert finalization in case of a bad block happens to be finalized. But today we can't do that on an existing database",
        "created_at": "2025-07-29T11:36:25.120000+00:00",
        "attachments": null
    }
]