[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "It used to be the case that people didn't lose the attribution when they left a team, I was told once this was to \"keep historical context\", probably that's changed?",
        "created_at": "2025-07-10T00:18:35.597000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I hadn't heard that policy before.  I know when I left teku I removed my own teku role to ensure people didn't think I was any kind of authority on teku anymore. It also seems unwise to have someone who's had to be laid off for whatever reason still have an official badge mostly because of the potential for confusion but also the potential for controversy even if that's not normally an issue here.",
        "created_at": "2025-07-10T00:24:45.170000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Could create a role for \"ex-foundation\" so there is still some attribution and historical context, but without confusion.  Would probably want a single bucket role, maybe \"ex-R\u0026D\"?",
        "created_at": "2025-07-10T06:02:47.711000+00:00",
        "attachments": null
    },
    {
        "author": "mariovmendes",
        "category": "general",
        "parent": "",
        "content": "Hi! I am new to how ethereum and proof-of-stake works and was reading  a bit more about it. Upon reading that “dishonest validators are punished by having their staked ETH burned and removed from the network… sending the crypto to a wallet without private keys taking it out of circulation”, I wonder if distributing the burned ETH among other validators (that have been trustworthy) instead of burning would be possible and make sense?",
        "created_at": "2025-07-10T22:05:49.638000+00:00",
        "attachments": null
    }
]