[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "That sentence applies in many contexts, but in Ethereum L1, validators that are dishonest and commit some offenses that are \"slashable\", that ETH is removed from their balance and it's not sent to any address without a private key, it's simply removed from existence. Giving it to other validators would also make it slightly cheaper for the dishonest validator to carry on since it would receive a share of that ETH on other validators.",
        "created_at": "2025-07-11T01:14:06.485000+00:00",
        "attachments": null
    },
    {
        "author": "mariovmendes",
        "category": "general",
        "parent": "",
        "content": "Oh, I see. I thought the slashing worked differently. But, how could the dishonest validator also receive a share of that ETH that was burned? I understand that it is possible to have multiple validators by staking 32 ETH for each validator, but wouldn’t it be possible to just check if those validators belong to the same owner and not include those validators when distributing the ETH?",
        "created_at": "2025-07-11T09:56:24.799000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "A single person may own multiple validators, and they may be programmed to behave differently.",
        "created_at": "2025-07-11T09:58:04.548000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Besides, the purpose of slashing and minting isn't to be zero sum.  It is to ensure there are incentives and disincentives for certain behaviors.  Validators are already rewarded (via minting) for taking actions that are helpful to the system.  They also get punished (via burns) for taking actions that are harmful to the system.  We do not need to move the money anywhere because we can both mint and burn.",
        "created_at": "2025-07-11T09:59:15.115000+00:00",
        "attachments": null
    },
    {
        "author": "mariovmendes",
        "category": "general",
        "parent": "",
        "content": "Ok, got it! With minting for incentivising good behaviour and burning for punishing, there would be no need to distribute ETH as it is already “balanced”",
        "created_at": "2025-07-11T10:08:18.748000+00:00",
        "attachments": null
    },
    {
        "author": "mariovmendes",
        "category": "general",
        "parent": "",
        "content": "Thank you 👌🏼",
        "created_at": "2025-07-11T10:08:29.138000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It isn't balanced, but it doesn't need to be.  If everyone behaves, it will be net minting.  If lots of people misbehave all the time, it may be net burning.  It is actually extremely unlikely to be net neutral at any given point in time.",
        "created_at": "2025-07-11T10:25:16.961000+00:00",
        "attachments": null
    }
]