[
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "1. they can w/ probability 1/2, so they could commit and toss data and half of the time be fine. however, if this is their typical strategy we realize the expected value here which is losing half of their stake (and/or being slashed)",
        "created_at": "2021-03-03T00:22:07.701000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "2. for just the proof of custody scheme, the validator only needs the data they have committed to -- think a particular shard block",
        "created_at": "2021-03-03T00:22:53.881000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "the validator can be challenged on this, having to ultimately put some part of the shard data on-chain to prove they in fact have the data",
        "created_at": "2021-03-03T00:23:40.402000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "if by proposed you mean \"shard block proposal\" then the way the specs are currently laid out, the beacon committee is responsible for the proof of custody game",
        "created_at": "2021-03-03T00:25:02.016000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "so the shard proposer can just publish whatever and then separately the beacon committee only signs off on it (including the custody commitment) if they in fact deem it available",
        "created_at": "2021-03-03T00:25:38.332000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "3. i believe after the custody secret has been revealed the period of the custody is over for the given `D`",
        "created_at": "2021-03-03T00:26:41.456000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "so the validator is no longer responsible for responding to challenges or keeping custody of the data",
        "created_at": "2021-03-03T00:27:07.056000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "the idea w/ the proof of custody game is to only ensure availability for a fixed window of time at the consensus layer",
        "created_at": "2021-03-03T00:27:27.525000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "we will need separate mechanisms at other layers to ensure the data can be found some way, outside the custody period, etc",
        "created_at": "2021-03-03T00:27:49.652000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "ideas along the line of some kind of DHT have been proposed (i can go find links if you'd like)",
        "created_at": "2021-03-03T00:28:14.234000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "but this is separate to the custody game",
        "created_at": "2021-03-03T00:28:23.924000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "DAS is happening in parallel to the custody game and AIUI is happening in real-time",
        "created_at": "2021-03-03T00:29:09.919000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "so you would be following the network and its gossip and be able to do DAS on current shard blocks/data",
        "created_at": "2021-03-03T00:29:34.122000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "we could imagine some kind of DAS scheme for historical data but that point you (assumedly) have a recent consensus you trust so have more efficient ways to verify authenticity of historical data",
        "created_at": "2021-03-03T00:31:55.858000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "(again assuming we have some medium for getting that historical data -- which is where some kind of DHT (?) solution comes in)",
        "created_at": "2021-03-03T00:32:19.075000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "Cross-layer",
        "parent": "",
        "content": "In https://ethresear.ch/t/1-bit-aggregation-friendly-custody-bonds/2236 Vitalik wrote:\n\u003e If the value that they compute is not the same, then they can play a game, where they publish a series of challenge values to the chain, each representing some intermediate step in the computation, and the validator is required to respond to all challenges, and the responses are checked for compliance with the bit that they published. If the published bit is wrong, then there is a strategy that anyone can follow to zero in on the precise point in the computation where it went wrong, and prove to the chain that it actually was wrong, and by doing so steal that validator’s deposit.\n\nFrom this I understand that the more challenges are published, the less likely it is for the validator to not get slashed (1/2 to the power of [number of challenges]). Is this true?",
        "created_at": "2021-03-03T09:35:05.791000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "Cross-layer",
        "parent": "",
        "content": "OK, so let me please make sure I understand it correctly.\n\nDAS happens in real time to make sure that the chain can advance. The role of Proof of Custody is to incentivize validators to keep the data they have committed to for some period of time, and the beacon committee is responsible for signing off on the availability of the data and/or challenging the validator.\n\nIf this is correct, what is the main benefit of Proof of Custody? Having the data available for some longer period in case when it fails DAS? (let's say the data had been originally properly published to subnets, but somehow got lost in the meantime)",
        "created_at": "2021-03-03T09:54:12.239000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e From this I understand that the more challenges are published, the less likely it is for the validator to not get slashed (1/2 to the power of [number of challenges]). Is this true?",
        "created_at": "2021-03-03T20:09:55.992000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "if they have committed to the correct value then they won't get slashed",
        "created_at": "2021-03-03T20:10:19.800000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "So (1) is a bit off. The correct bit comes at the time of signing. It matters that yuo had the data to compute your bit at time of signing (that can be found out later and proved as fraud)",
        "created_at": "2021-03-03T20:10:41.135000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e Assume validator V commits data D and doesn't keep it. Because of this V won't be able to respond to a challenge, right?\nthey can't get rid of their data with probability 1/2 because again a challenge on your custody of the data during the period is unrelated to the bit. The probability you can do it is related to probability of getting challenged (which is far less than 1/2) but the penalties are maximal so in expectation if you toss out some or all of your ata, you will eventually get caught",
        "created_at": "2021-03-03T20:12:03.555000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "note -- you aren't certain to be slashed if you get rid of the data, you instead are taking on counterparty risk that yuo can find the data if it were requested by the consensus",
        "created_at": "2021-03-03T20:12:30.387000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "there are three games in some sense\n\n1. bit challenge/fraud proof\n2. chunk challenge\n3. custody key reveal\n\n(1) ensures that you had the data at time of making the claim that it was available. You need to run a computation on the data along with your secret and that will tell you the \"bit\". If later, it is found out you got the bit wrong -- slashed\n\n(2) ensures that you keep the data during the custody period. at any point in the custody period you can be challenged for part or all of the block data you made a commitment to. If you can't show up with the challenged data in the challenge window -- slashed\n\n(3) ensures that you reveal your secret so previous commitments can be checked. at the end of a period, you must reveal your custody secret for that period. after you do this, other validators can see if your previous bits were correct (and challenge if not). If you don't reveal your key in a timely manner, you are preventing the bit-challenge from being checked so it is assumed you did something nefarious and are trying to hide thus -- slashed",
        "created_at": "2021-03-03T20:17:12.295000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e bit challenge/fraud proof\nThe assumption of fraud proof is going away in the latest DAS proposal right? With polynomial commitment, erasure coding and some minority honesty assumption, the fraud proof  is no longer needed",
        "created_at": "2021-03-03T20:23:42.616000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "DAS and proof of custody are separate\n\nyou can run DAS without PoC or PoC without DAS, but if you run PoC, my understanding is that a fraud proof after secret key is revealed is critical to the construction",
        "created_at": "2021-03-03T20:25:04.421000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "I see. So we cant skip bit challenge part and solely rely on DAS",
        "created_at": "2021-03-03T20:26:34.913000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "you can in theory but the schemes can compliment eachother nicely",
        "created_at": "2021-03-03T20:26:53.502000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "Committee based confirmations (with a cryptoeconomic commitment that the data was avaailbe -- PoC) provide a faster confirmation on chain that data is available and can be used",
        "created_at": "2021-03-03T20:28:11.958000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "The custody period of PoC also provides a safety mechanism that there is a subset of the network taht will store the data for some period",
        "created_at": "2021-03-03T20:28:37.280000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "DAS allows for the beacon chain to not be corrupted (before finality) even if there is a corrupted committee",
        "created_at": "2021-03-03T20:29:05.372000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "and also allows for the entire network to take part in vetting availability at each step of the way",
        "created_at": "2021-03-03T20:29:26.643000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Makes sense. I can see how L2 operators and dapps that use data will like faster confirmation better.\n\nWhen we say committee based confirmation, it's really just when `ShardHeader` gets the support of 2/3 of the committee right?",
        "created_at": "2021-03-03T20:35:08.890000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "in the beacon chain, yes. I mean actual confirmations on chain",
        "created_at": "2021-03-03T20:35:49.398000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "whereas the DAS process that utlimately dictates the fork choice of the beacon chain might take more time to resolve",
        "created_at": "2021-03-03T20:36:11.658000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "also, without a committee based mechanism, you'd probably just have the beacon chain proposer proposer the shard headers directly and rely entirely on the fork choice DAS filter",
        "created_at": "2021-03-03T20:36:46.251000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "but this puts too much power in a single validator's hands",
        "created_at": "2021-03-03T20:37:18.280000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "for things like censorship",
        "created_at": "2021-03-03T20:37:25.052000+00:00",
        "attachments": null
    }
]