[
    {
        "author": "yblue19",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks for the information. Is there document that I can read more?",
        "created_at": "2021-11-03T01:25:31.939000+00:00",
        "attachments": []
    },
    {
        "author": "yblue19",
        "category": "Cross-layer",
        "parent": "",
        "content": "Technical details, roadmap, etc..",
        "created_at": "2021-11-03T01:29:43.491000+00:00",
        "attachments": []
    },
    {
        "author": "chair1233",
        "category": "Cross-layer",
        "parent": "",
        "content": "Could someone help me understand the concept of shard blobs please? So at a high-level, it's my understanding that for every slot there is a proposer on each committee which corresponds to a shard. That proposer then broadcasts the shard blob, which contains the signatures from the majority of the validators in the committee as well as the shard header, which stores some information about the current state of the shard. The following is the part I'm less sure about: From there, all the validators on the network vote on which shards attestation to include in the beacon chain block and if it gets 2/3 of the votes then it is included. Can multiple shards be included in one block? Or are they constantly competing to be included in the block? If so, how do we ensure that a shard header will be included in the block if 64 shard blobs are being proposed every slot?",
        "created_at": "2021-11-03T14:23:38.522000+00:00",
        "attachments": []
    },
    {
        "author": "chair1233",
        "category": "Cross-layer",
        "parent": "",
        "content": "From the annotated spec \"In the normal case, each shard can be crosslinked into the beacon chain once per slot\" So that means each slot contains a link to all 64 slots? How is this possible? Is there some aggregation of the shard blobs from each committee to form a beacon block?",
        "created_at": "2021-11-03T14:31:48.816000+00:00",
        "attachments": []
    }
]