[
    {
        "author": "nashatyrev",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm sure the things would work perfectly fine within a slot fraction timeframe 99.9% of time ('happy case' as \u003c@!203220829473996800\u003e mentioned). \nI'm a bit concerned regarding 'non-happy case': if for example blobs dissemination across the network starts lagging (for whatever reason) then I'm not sure about the mechanism of including those blobs into the beacon chain at later time. I.e. attester has no means to attest a late blob besides of delaying his slot attestation production. So it looks like the lack of some asynchrony.\nOne possible solution in theory could be attesting beacon chain and blobs separately (i.e. producing distinct  `Attestation`s for them) but that I guess would double overall network load, so is not feasible. \nJust wanted to note that I'm probably missing something in the current design and my assumptions are just incorrect",
        "created_at": "2021-05-06T12:11:43.868000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Cross-layer",
        "parent": "",
        "content": "What's wrong with attestations just getting included a few slots later in the unhappy case?",
        "created_at": "2021-05-06T16:06:14.939000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Cross-layer",
        "parent": "",
        "content": "The shard blocks still get confirmed if that happens",
        "created_at": "2021-05-06T16:06:24.598000+00:00",
        "attachments": null
    },
    {
        "author": "nashatyrev",
        "category": "Cross-layer",
        "parent": "",
        "content": "No problems with attestation _inclusion_ to block, I was meaning the situation with attestation _production_. I.e. the attester normally publishes its attestation for the slot `N` at the time `N + 1/3`. Within this time frame it should receive both `blob` and `blob_header`  and validate them. If there is any delay with one of them the attester will most likely vote for the 'empty' blob and the blob would be dropped without any chance to be attested at later time. \nAm I correctly getting the intention?",
        "created_at": "2021-05-06T16:50:05.925000+00:00",
        "attachments": null
    },
    {
        "author": "nashatyrev",
        "category": "Cross-layer",
        "parent": "",
        "content": "There is another closely related concern. If my understanding is correct an attester would vote for a blob as soon as it is gossiped and _before_ he sees its `blob_header` in a block. If this `blob_header` is eventually not included into any block the attestation would be just lost (attestation is not valid if the state doesn't contain referenced `blob_header`) and so a valid vote for a beacon block would be lost. Couldn't it potentially be a problem?",
        "created_at": "2021-05-06T16:59:12.857000+00:00",
        "attachments": null
    },
    {
        "author": "nashatyrev",
        "category": "Cross-layer",
        "parent": "",
        "content": "For the latter issue \u003c@!425572898787426305\u003e proposed potential solution: Include the full `blob_header`  (instead of just its `root`) to the Attestation (and don't include it separately to the block). But that would increase the `Attestation` size more than twice",
        "created_at": "2021-05-06T17:04:17.883000+00:00",
        "attachments": null
    }
]