[
    {
        "author": "radekkapka",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e They submit data-TXs to get these included in some shard. Once these blocks are confirmed as available, they send rollup transition TXs to the rollup smart contract, transitioning the state root from A to B to C.\n\nPlease let me know if I understand the above correctly. In Eth1, the rollup chain would submit 3 state-transition TXs to the eth1 chain, which would transition the Eth1's state root (pre-A -\u003e A, A -\u003e B, B -\u003e C). In Eth2 they would submit 3 data TXs first, wait for the data to become available and then submit 1 state-transition TX, which would transition the Eth1's state root (pre-A -\u003e C).\n\nIf this is correct, then we have 3 state-transition TXs vs 3 data TXs + 1 state-transition TX. Asumming a state-transition TX takes `s` time to complete and a data TX takes `d` time to complete, we have `3s` vs `(3/16)*d + s` in the best-case scenario when each of the three data TXs is sent to a different shard. The worst-case scenario, sending all data TXs to the same shard, would take `3d + s`.\n\nIs this is more or less accurate?",
        "created_at": "2021-01-04T09:09:08.060000+00:00",
        "attachments": null
    },
    {
        "author": "nrryuya",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thank you for clarifying!",
        "created_at": "2021-01-04T14:06:14.136000+00:00",
        "attachments": null
    },
    {
        "author": "nrryuya",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e So when a data-tx with a tx-fee commitment is sent, it likely needs to be for a particular shard. \nThat makes sense, but such a sharded data-tx and fee market system is totally fine even if there is only one gas-price globally? To have one global gas-price seems quite nice for simplicity.",
        "created_at": "2021-01-04T14:06:38.379000+00:00",
        "attachments": null
    },
    {
        "author": "nrryuya",
        "category": "Cross-layer",
        "parent": "",
        "content": "BTW we have started to develop an emulator of data sharding (i.e., \"ganache for Eth2\") and build a proof-of-concept of rollup in Eth2 with the emulator (based on our prior work called Shargri-La). The purpose of this is to understand how rollups look like in Eth2 at the implementation-level. It is still at a very early stage. We will share updates here!",
        "created_at": "2021-01-04T14:07:30.235000+00:00",
        "attachments": null
    },
    {
        "author": "nrryuya",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think before the merge, we also need to consider the latency for the Eth2 light client contract on Eth1 to verify the shard data. IIUC, it takes a few epochs for the shard data to be linked by a beacon block B, and the beacon block B becomes verifiably finalized on the state of a later beacon block B', and the light client committee signs B'.",
        "created_at": "2021-01-04T14:21:07.736000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e To have one global gas-price seems quite nice for simplicity\nwhen you say gas-price, do you mean 1559 style base-fee? or just the market price for data?\nI'm not sure if we get to decide if the latter is fixed across shards if the markets are independent in any way (e.g. separate mempools)",
        "created_at": "2021-01-04T15:19:24.110000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "In a pre-merge world, it would likely be 1 to 2 epochs if the light client contract gets updated on a per-epoch basis, but the light client protocol could be updated per slot which would give a minimum latency of ~3 slots (shard data proposed, data included in beacon chain, light client on eth1 updated)",
        "created_at": "2021-01-04T15:21:04.892000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "Latencies would probably be best considered in terms of \"slots\".\n\nIf I can include some batch of data in a single slot and do a state transition in the following slot, it would be a 2 slot latency",
        "created_at": "2021-01-04T15:22:51.249000+00:00",
        "attachments": null
    },
    {
        "author": "nrryuya",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ah, I meant the 1559 style base-fee. I should have made it clear.",
        "created_at": "2021-01-04T23:48:30.704000+00:00",
        "attachments": null
    },
    {
        "author": "nrryuya",
        "category": "Cross-layer",
        "parent": "",
        "content": "Is it assumed that the light client contract accept a beacon block which is not yet finalized by FFG optimistically here?",
        "created_at": "2021-01-04T23:59:29.744000+00:00",
        "attachments": null
    }
]