[
    {
        "author": "radekkapka",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hey \u003c@!291925846556540928\u003e  , thanks again for responding.\n\n1.\n\u003e at the end of a period, you must reveal your custody secret for that period. after you do this, other validators can see if your previous bits were correct (and challenge if not)\nIs the challenge part necessary? Don't incorrect bits make the validator immediately slashable?\n\n2.\n\u003e Committee based confirmations (with a cryptoeconomic commitment that the data was avaailbe -- PoC) provide a faster confirmation on chain that data is available and can be used\nThis seems counter-intuitive to me. Don't we have to wait until the secret is revealed before we can be sure that the data is correct, which is a looong time compared to e.g. an epoch?\n\n3.\n\u003e I'm not sure I understand this statement\nWhat I meant is that if a validator cannot find a piece of data through DAS they could challenge the proposer for that piece of data.\n\n4.\n\u003e In practice, you would be asked to present a subset of the block you committed to. an actual \"chunk\" of the data. and yuo would prove it against the commitment to the data (hash or kate commitment)\nIs this commitment the same commitment that Dankrad talked about during the workshop (KZG) or are we talking about yet another commitment here?",
        "created_at": "2021-03-08T07:05:45.097000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Cross-layer",
        "parent": "",
        "content": "5.\n\u003e Because we use signature aggregation only of like messages, having a single bit induces two messages types for the same attestation (the message that is the primary vehicle for info from the validator). Attestations are produced once per epoch by each validator (once per 6.4 minutes) so the idea with a single bit is that in expecation, if the validation is shirking this duty, they will guess the bit incorrectly very quickly\nUnfortunately I don't understand this part at all. Firstly, I don't know what a \"like\" message is (sorry...). Secondly, why use PoC on attestations at all? Is this because we want to start slashing validators for invalid attestations, where invalid means something else than the current double/surround vote?",
        "created_at": "2021-03-08T07:20:29.794000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Cross-layer",
        "parent": "",
        "content": "One thing I got from (5) is that guessing the bit for every attestation will get the validator slashed sooner or later, which is kind of equivalent to using more bits.",
        "created_at": "2021-03-08T07:22:17.341000+00:00",
        "attachments": []
    }
]