[
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "The notion of shard block is essentially a container of data (maybe some header properties, e.g. a proposer signature) and attempted links back into the beacon chain by committees that say the adta is available. The notion of \"chainedness\" of the shard independent of hte beacon chain is no longer there. It isn't really needed for data availability-first applications and greatly reduces consensus complexity.\n\nYes, there isn't really an ordering of shard data. Applications that might want to use the shard data would provide its own ordering.\nExample: rollup chain wants to get in *ordered* blocks A, B, and C. They submit data-TXs to get these included in some shard. Once these blocks are confirmed as available, they send rollup transition TXs to the rollup smart contract, transitioning the state root from A to B to C. If B and C were confirmed, but A wasn't, then the rollup (depending on their contract design) would likely have to wait until A also got confirmed to then trigger the transitions.",
        "created_at": "2021-01-03T15:39:09.163000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": ".\nIt is still possible that there would need to be a data gas-price on each shard. The data-tx mempools for shards will likely need to be \"sharded\", otherwise nodes would have to process and store 64 shards worth of data-txs in the mempool and gossip network. So when a data-tx with a tx-fee commitment is sent, it likely needs to be for a particular shard.\n\nThat said, shard-data fee mechanics are still being discussed",
        "created_at": "2021-01-03T15:40:49.575000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e For the Eth2 light client contract in Eth1 used for rollups, Eth1 need BLS12-381 \nyes this is the case until the \u003c#692062809701482577\u003e",
        "created_at": "2021-01-03T15:41:03.236000+00:00",
        "attachments": []
    }
]