[
    {
        "author": "radekkapka",
        "category": "Cross-layer",
        "parent": "",
        "content": "Another question about Danksharding. According to https://youtu.be/e9oudTr5BE4?t=1635, validators attest to rows/columns only if the assigned row/column is available for the entire epoch. I would like to know:\n1. What does the term `entire epoch` mean? My understanding is that if I am assigned to attest at slot 20 of epoch 1, then I attest only when the row/column is available since slot 21 of epoch 0. Is this correct? However, https://members.delphidigital.io/reports/the-hitchhikers-guide-to-ethereum (apparently discussed with Dankrad) says:\n\u003e I attest to the availability of my rows and columns in slot 26 of epoch 2, but I only do this if my assigned rows and columns were also available for every slot since the last block I attested to\n2. A more important question: why is this designed in such a way?",
        "created_at": "2022-06-08T09:15:20.565000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Cross-layer",
        "parent": "",
        "content": "Another question from the same slide. Can anyone please explain this calculation:\n\u003e An unavailable block (\u003c75% available) cannot get more then `2^(-2s) = 1/16` attestations",
        "created_at": "2022-06-08T09:34:35.545000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Cross-layer",
        "parent": "",
        "content": "Another one: Why do we even need to sample these rows and columns when we have DAS?",
        "created_at": "2022-06-08T09:37:37.261000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@308223150725005322\u003e the vid is already half a year old, I'm not sure if I understand the context of your question. And the article might have small mistakes (can't find your quoted text in there either).\n\nRegarding question 1: I think there are two important things there to get:\n- Attesting something is available implies that the previously included things are available, so hence the \"but only do this if ... is available for every slot since the last attestation\". Every validators attests once per epoch, so you may as well say \"entire epoch\" (although not as clear, and not quite correct if a validator misses an epoch)\n- An attester may be assigned to columns and rows to recover them individually. This is much less work than recovering the full block, so it gives some robustness to the system to allow participants to recover pieces without downloading 50% of the full thing.\n\nRegarding question 2: the 2D construction increases the threshold to 75% required, but does so for all \"shards\" (really just the collection of blobs confirmed in the same beacon block) at once, as opposed to individually. So even though it requires more samples to be queried vs a single 1D construction, it's still much better than doing the 1D check of every blob in the beacon block. And you get the benefits of being able to reconstruct data in 2 ways.\n\nRegarding question 3: \"Why do we even need to sample these rows and columns when we have DAS?\"\nThat doesn't quite sound right. Sampling smaller pieces from rows or columns is DAS (Data Availability Sampling). If you mean \"why are we pulling complete rows or columns\"? We're not necessarily (some non-validating nodes might only pull samples, and not participate in gossip of rows or columns), but we can afford to do a small amount of work like gossiping 2 rows and 2 columns per slot per validator, to ensure the data is published to the whole network. Having the full columns/rows of something allows the validator to seed samples on overlapping rows/columns, where others might be missing data.",
        "created_at": "2022-06-08T10:28:28.854000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e the vid is already half a year old, I'm not sure if I understand the context of your question. And the article might have small mistakes (can't find your quoted text in there either)\nContext-wise, I just wanted to share the slide thinking it might be helpful in some way. I believe the article does have some mistakes, and you can't find the text because it's embedded in an image (you have to look for an image of row/column sampling).",
        "created_at": "2022-06-08T10:36:29.896000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e Attesting something is available implies that the previously included things are available\n\u003e (...)\n\u003e is available for every slot since the last attestation\nLet me give an example. Let's say that we are at the beginning epoch 1 and I am to attest for slot 20. I get assigned rows `R1` and `R2`, and columns `C1` and `C2`. At epoch 2 I am to attest for slot 30. I get assigned rows `R3` and `R4`, and columns `C3` and `C4` (I suppose we get new rows/columns for each epoch). This means that I need to fetch information about `R3`,`R4`,`C3`,`C4` since slot 20 of epoch 1 because that's when my previous attestation happened.",
        "created_at": "2022-06-08T10:49:48.671000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Cross-layer",
        "parent": "",
        "content": "The above is how I understand it",
        "created_at": "2022-06-08T10:50:05.008000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e Regarding question 2\nMy question was specifically how to get to the number `1/16` intuitively",
        "created_at": "2022-06-08T10:50:30.039000+00:00",
        "attachments": []
    }
]