[
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I have a feeling this convo will happen more than once. For tracking, I've captured the options and preference under this issue: https://github.com/ethereum/execution-apis/issues/333\nFeel free to edit or add anything I missed!",
        "created_at": "2022-12-12T01:09:01.218000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "Once blobs are obtained by CL what would be the purpose to send them back to EL? Is this to re-use `engine_getBlobsBundle` in the block build process? Can we redesign it in a way that some blobs and corresponding commitments may not be supplied by EL and in this case CL falls back to its local database and picks those from the storage indexed by versioned hashes?",
        "created_at": "2022-12-12T10:43:22.922000+00:00",
        "attachments": null
    },
    {
        "author": "inphi",
        "category": "Cross-layer",
        "parent": "",
        "content": "thank you. in option 2, are we expecting some EL to serve hashes with the full blob tx even after a reorg? Depending on how deep reorgs get, ELs may not want to keep blobs around.",
        "created_at": "2022-12-12T15:14:04.145000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e Once blobs are obtained by CL what would be the purpose to send them back to EL? I\nAs a proposer or as a syncing node? I dont see any reason in both cases. CL can verify the blobs independently through aggregated proof, commitments and version hashes. The only reason to send them back to EL is maybe to notify them what's getting reorg'ed out in the event EL clients don't see all the blobs\n\n\u003e option 2, are we expecting some EL to serve hashes with the full blob tx even after a reorg? Depending on how deep reorgs get, ELs may not want to keep blobs around.\nAgreed. That won't work if that's case",
        "created_at": "2022-12-12T22:48:22.603000+00:00",
        "attachments": null
    }
]