[
    {
        "author": "inphi",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks Kev! This looks promising",
        "created_at": "2022-07-20T01:18:11.411000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003casn_d6\u003e \u003e \u003casn_d6\u003e  Hey @inphi ! We looked at this here in ethcc with @adietrichs carl and @protolambda .\n\nTwo points:\n\na) Your benchmark code of the KZG proof technique looks sane, but it's also much slower than expected. We did some benchmarks and it seems like most of the time is spent on the barycentric formula and specifically on calculating modular divisions. In particular it spends about 20ms calculating 4096 modular divisions which seems kinda excessive based on some napkin calculations. Please do check if bls kilic has a batch inversionn operation because that would make things much much faster.\n\nAlso, in the spec we are using ssz merkle hashing of the fiat-shamir random evaluation point which causes thousands of extra hashes. We should remove that and replace it with straight hashing.\n\nWe hope that these changes will decrease the verification cost to something more reasonable.\n\nb) In terms of batching, we did some analysis of verifying multiple transactions at the same time. You can indeed get some savings: e.g. verifying N transactions, can be done with N+1 pairings instead of 2N pairings, etc. but you are not gonna get any crazy gains.\n\nAlso, @adietrichs believes that you will not get enough blob transactions on the mempool to make multi-transaction verification worth it under honest conditions. Under malicious conditions, you want to do individual verification so that you can detect bad transactions and penalize your peer with peer scoring to avoid DoS.\n\n——\n\nLet me know if the above did not make sense. (re @sharded_data_bot: \u003cInphi\u003e I'm working on implementing EIP-4844 for clients and recently implemented @asn (George Kadianakis) 's optimization (https://github.com/ethereum/EIPs/pull/5088) for blob verification using KZG proofs.\nAs expected this improves single transaction verification time by a factor of 2-3x:\n```\nBenchmarkVerifyBlobs-8             57      20378432 ns/op     2195321 B/op   \u003cclipped message\u003e",
        "created_at": "2022-07-20T14:45:52.769000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003casn_d6\u003e \u003e \u003casn_d6\u003e  Hey Kev! What does that code do? In our case all KZG proofs are opening to different evaluation points, so it's harder to group the pairings together. Is there a trick around that? (re @sharded_data_bot: \u003cKev\u003e [reply]: If you are iteratively verifying N kzg proofs, which is costing you a pairing per verification, you can change this to batch verify all N kzg proofs by using randomness)",
        "created_at": "2022-07-20T14:51:26.344000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hey 🙂 yeah this works with different evaluation points, as it’s doing batch verification, for N kzg proofs, it verifies all of them with 1 pairing instead of N by swapping those pairings out for a random linear combination of the proofs. Where the randomness is private to the verifier , which differs from prover side aggregation where the verifier needs to know the randomness being used, this is usually done via the fish Shamir",
        "created_at": "2022-07-20T20:49:16.580000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "Not sure how many malicious transactions you are expecting, but you can always do batch and then halve each batch each time to find the bad tx. This might be okay for you, I don’t know the circumstances",
        "created_at": "2022-07-20T20:51:39.759000+00:00",
        "attachments": null
    }
]