[
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cinphi\u003e The cost here incurred by the network; are you referring to the cost of including data to the mempool. I'm proposing that we make the data unavailable if it's associated with a failed tx, while still burning data fees. The data fee burned should \"cover\" the cost induced by the mempool.",
        "created_at": "2022-10-10T01:40:25.488000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e how do you make the data \"unavailable\"",
        "created_at": "2022-10-10T03:40:44.272000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cprotolambda\u003e I think the thought is that we could make the data retention conditional based on the tx EVM execution, but IMO we should keep those things independent.",
        "created_at": "2022-10-10T04:51:28.784000+00:00",
        "attachments": null
    },
    {
        "author": "kanagwa",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hi, this was our ETHBogota project. I’m sharing here as might be of interest to the chat: https://ethglobal.com/showcase/blobscan-explorer-5bmqk",
        "created_at": "2022-10-10T12:45:55.599000+00:00",
        "attachments": null
    },
    {
        "author": "kanagwa",
        "category": "Cross-layer",
        "parent": "",
        "content": "As a hackathon project it is an early prototype and not syncing with existing 4844 devent. We saw interest on the tooling so we plan to continue working on it, ping me if you want to collaborate or have ideas",
        "created_at": "2022-10-10T12:46:13.352000+00:00",
        "attachments": null
    },
    {
        "author": "mrabino1",
        "category": "Cross-layer",
        "parent": "",
        "content": "fwiw, RE the notion of spending gas to get a data blob on the DA layer...  from my lens, we need to defend against spam attacks and mempool overflows.. and at the same time generally leave the EL aside.. maybe a solution would be commit a transaction (that includes the size of the payload and a hash of it, but NOT the actual payload).. and then provided that transaction was accepted, thereafter the payload would be gossip'ed and accepted.. point being is that the clients would have a heads-up to reject blobs accordingly.... (note: the above is just brainstorming fwiw)thx..",
        "created_at": "2022-10-10T13:00:11.510000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cinphi\u003e \u003e \u003cinphi\u003e  yeah that's my thinking. It will complicate kzg verification in CL though and leak more of the EVM there. (re @protolambda: I think the thought is that we could make the data retention conditional based on the tx EVM execution, but IMO we should keep those things independent.)",
        "created_at": "2022-10-10T13:22:52.818000+00:00",
        "attachments": null
    },
    {
        "author": "roberto.bayardo",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think I prefer the existing proposal of charging for datagas regardless of execution success. More spam disincentive, less EVM leakage into CL, less complexity overall.",
        "created_at": "2022-10-10T14:15:34.401000+00:00",
        "attachments": null
    }
]