[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Do you have a reference for this? No pure mathematician I know would use this term either. Thanks \u003c@427491045308235776\u003e for the references. Both are in computer science or applied sciences and both help in my view of this culture shock. Wondering if there's someone in mathematics that uses this terminology",
        "created_at": "2022-09-24T12:24:04.496000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "Oh that’s surprising, what would they call the action of repeatedly applying the group operation to the same element?",
        "created_at": "2022-09-24T12:38:02.948000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Oh that's the Z action on any abelian group, so we would call that a multiplication. But I've seen the term \"scalar multiplication\" being used here a lot for  `a P` where `a` is in the base field (interestingly enough called here also the \"scalar field \" because of this reason I assume) and P being a point in the curve",
        "created_at": "2022-09-24T12:40:48.128000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "Oh I think that’s where the disconnect is, as that’s usually called an exponentiation by cryptographers.\n\n\nSo given a group (G, *) we define an exponentiation to the power of k as:\n\nX* X* X* X \u003c- k times \n\nThis would be written as X^k \n\nSince X is a group element, you can think of it as an elliptic curve point.\n\nIf I follow your additive notation. I could define the group as (G, +)\n\nInstead of exponentiation, we define a multiplication of X k times as:\n\nX+X+X+X \u003c- k times\n\nThis would be written as ‘k X’\n\nA lot of people tend to use additive notation, so multiplication means to apply the group operation to an element k times in this context",
        "created_at": "2022-09-24T12:56:35.163000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "`X+...+X`(k times) would be written as `k X` the same way in any Abelian group and this is fine. No need to explain me the concept, I'm not asking to what the operation is, I'm asking where can I find references for it. But notice that I'm referring explicitly to the situation where `k` above is not in Z (which is correct) but the situation where `k` is in `F_q` and a \"representative\" is used. I can find you a lot of references for people in this community  using this terminology.",
        "created_at": "2022-09-24T13:02:54.120000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "The term scalar multiplication comes from the fact that given a field of prime characteristic F_p, I can define the elliptic curve group as E(F_p) or E/F_p , not quite sure what the convention is with pure mathematicians.\n\nE(F_p) is a group and in particular we choose E(F_p) such that it has a large prime order subgroup. This subgroup has order ‘r’ so we define another field F_r called the scalar field. \n\nSince we only want to operate over the prime order subgroup, we then just use the term scalar multiplication to denote repeatedly applying the group operation r or more times",
        "created_at": "2022-09-24T13:03:52.338000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "Since the group of prime order is cyclic",
        "created_at": "2022-09-24T13:04:33.496000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Again, the Z-module structure on the abelian group `E(F_p)` is clear, I don't want you to explain me what do you mean by \"scalar multiplication\". I am looking for original references or big names calling \"scalar multiplication\" when they abuse the notation and act by elements in the base fields, represented as integers. I can show you documents by Vitalik or Dankrad using explicitly this. I want some names/papers from other areas perhaps.",
        "created_at": "2022-09-24T13:07:54.788000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "By the way this is just a tiny bit of what I am planning to write about what someone coming from math has to relearn when entering the world of crypto. Things like \"polynomial evaluations\" on points of elliptic curves gives me the shivers still",
        "created_at": "2022-09-24T13:18:14.808000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ah I was doing some accounting to confirm that I understood your question correctly.\n\nIt’s the scalar field and not the base field in this case.\n\nF_p is referred to as the base field and F_r the scalar field\n\nIt’s a good question as to where the notation originated from, I can’t quite scratch where I originally saw it being used (it was quite an old paper, where they explicitly noted that they were abusing the notation)",
        "created_at": "2022-09-24T13:20:02.444000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "Does this help any with the polynomial evaluation topic?",
        "created_at": "2022-09-24T13:23:31.379000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "Screenshot_2021-11-22_at_17.56.53.png",
                "content": "ba7f14aaf36701d4c873f49589b71c918b291a1f845cc951eb022e88f912128a"
            }
        ]
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "It does not matter if you take F_p or F_r as \"scalar field\", E(F_p) is not a module over either, the multiplication from F_p or F_r is not well defined on either.",
        "created_at": "2022-09-24T13:24:11.681000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "right, that notation for polynomials giving rise to points on curve is another instance of this abuse of notation",
        "created_at": "2022-09-24T13:25:10.085000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yep I was not refuting that, just noting that in line with the abuse of notation, they would have used scalar field and not base field",
        "created_at": "2022-09-24T13:26:56.900000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e Wait where is the abuse of notation here?",
        "created_at": "2022-09-24T20:50:10.687000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e if r is the order of the elliptic curve (subgroup) E, then E is an Z_r module. (A vector space in fact since F_r is a field)",
        "created_at": "2022-09-24T20:51:07.090000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e I don't think there is any abuse of notation whatsoever",
        "created_at": "2022-09-24T20:51:56.827000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is false, an Fp module is a rational variety (think P1 in dimension one, so genus zero) not genus one",
        "created_at": "2022-09-24T20:57:42.162000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e I am going by this definition: https://en.wikipedia.org/wiki/Module_(mathematics)",
        "created_at": "2022-09-24T20:59:03.022000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e",
        "created_at": "2022-09-24T20:59:31.881000+00:00",
        "attachments": [
            {
                "type": "image/jpeg",
                "origin_name": "file_1.jpg",
                "content": "6ce99b60d23b68ca1d4761d30f6ea300c8cd060fa04645f7abd31898607c4401"
            }
        ]
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e Does it not fulfill that?",
        "created_at": "2022-09-24T20:59:39.058000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e It is however not an F_p module, that is correct",
        "created_at": "2022-09-24T21:05:17.326000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e It is only an F_r module if you define the addition as the elliptic curve group operation and the scalar multiplication as the repeated addition x times for x*G",
        "created_at": "2022-09-24T21:06:00.456000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sure, I don't dispute that as mere \"sets\" when you take points of an elliptic curve they form an abelian group, so they are always a Z-module. IF moreover you take torsion points these are a finite Abelian group and therefore they will be Z_n modules for some n... I don't dispute this at all. Just that I do not know math literature that uses this linear structure referred that way. Specifically, in a bunch of articles related to 4844 that I am reading now, there's an identification of this Z_n with F_q, the base field of the curve, and this is what brought me here",
        "created_at": "2022-09-24T21:08:40.406000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e That would be a mistake, can you point to where this happened? F_q != F_r",
        "created_at": "2022-09-24T21:12:40.366000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e But why is it important whether a \"pure mathematician\" has spoken of an elliptic curve subgroup as an F_r module/vector space? You do agree that it is one, and therefore there is nothing wrong with calling it a scalar multiplication.",
        "created_at": "2022-09-24T21:14:41.725000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I didn't want this to become a math discussion since I just wanted to have some references. But just to be precise: mathematicians view elliptic curves as geometric objects. If they are defined over a field F_q, you can take points E(R) over any other F_q algebra R. The group operations of E make E(R) a group, but as a group this is just a set, while E, the underlying geometric object is more than a group, the group operation is nice with the geometry (it's a morphism of schemes). This \"linear\" operation is not compatible with the geometry, that's why I don't recall seeing explicitly anything like this, nor polynomials with values on E, etc... I don't think there's anything wrong in the literature here, just is a suprising terminology and I'm trying to track references to see if there are branches of algebraic geometry that use this, or if this is contained to cryptography.",
        "created_at": "2022-09-24T21:16:27.508000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is just a tiny point of the things that I find a \"culture shock\" in that there are intersections of topics with different notations, I'm just writing a little essay with these diverging branches and I want to know if this particular one is really a divergence or is my lack of knowing the literature (since I'm not a pure geometer per se and when I do I work in characteristic zero).",
        "created_at": "2022-09-24T21:18:18.176000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e I mean maths is all about abstraction and we are just abstracting away the geometry because it is not relevant for using the elliptic curve group in this way. To us it is just an F_r module. We have definitions like this in maths exactly for the reason that we can talk about objects independently from their underlying structure.",
        "created_at": "2022-09-24T21:21:22.484000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e For this reason I am pretty sure that pure mathematicians have talked about this structure as an F_r module as well, since it is just a natural thing for them to do, but I could not give you a reference",
        "created_at": "2022-09-24T21:22:04.832000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e anyway if you find places where we've incorrectly identified F_q and F_r I would still be highly interested",
        "created_at": "2022-09-24T21:22:34.150000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "yep, trying to refind some early writings on this, but I looked at yours and Vitalik and you use correctly F_p for the order of the group...",
        "created_at": "2022-09-24T21:33:22.983000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "Cross-layer",
        "parent": "",
        "content": "hi all, I'm having some issues running a node on the devnet following the instructions from here https://hackmd.io/@inphi/SJMXL1P6c#Peering\nFor some reasons, my CL and EL seem to be waiting on each other infinitely:\n- geth: `Local chain is post-merge, waiting for beacon client sync switch-over...`\n- prysm: `INFO powchain: terminal difficulty has not been reached yet latestDifficulty=0 terminalDifficulty=40`\n\nI'm also having issues getting a peer on prysm, getting some goodbye messages from peers due to fault error. \nI'm running the node on Ubuntu 22 on MacOS with intel CPU. Any help appreciated!",
        "created_at": "2022-09-24T23:03:37.373000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "unknown.png",
                "content": "d9760971681d5e1efca5b905ad1b047f14d97dee3a4df75c1605c82e9279d515"
            }
        ]
    },
    {
        "author": "inphi",
        "category": "Cross-layer",
        "parent": "",
        "content": "the beacon chain bootnodes were updated recently. We added a new bootnode with better connectivity. In case you haven't already, try updating your prysm node using the latest changes at https://github.com/Inphi/prysm/tree/inphi/clean-slate and let me know if that works.",
        "created_at": "2022-09-24T23:59:07.519000+00:00",
        "attachments": null
    }
]