[
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I wonder if it would help with client diversity if the developers implemented new features in other clients first, rather than Geth first?",
        "created_at": "2022-05-16T03:08:04.924000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm not sure if Geth's usage within the core dev community is driving user adoption or not.  🤔",
        "created_at": "2022-05-16T03:08:24.785000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't think it's a simple answer here.  On the one hand when people default to prototyping on the majority clients those clients wind up with \"free\" development and all the other clients have to play catch up. That means the design tends to suit the majority client better and the majority client dev team winds up with more time available for optimisation/other features etc rather than just trying to keep up with specs.\n\nHowever, when it is the core team doing the prototyping work then that's just them contributing to the ecosystem like all clients do (which works well because we often have different focusses so prototype different stuff and Ethereum as a whole advances faster).\n\nSo generally yes it would be helpful if researchers/non-client-developers used minority clients for prototyping more but it also depends on whether the client team has the bandwidth/priorities to give them the assistance they need at that time (plus preferences for languages etc). I'm not sure it makes enough of a difference in final adoption to be worth much advocacy.",
        "created_at": "2022-05-16T03:18:52.415000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Excellent insight.  I hadn't considered that, but I agree.",
        "created_at": "2022-05-16T03:20:23.705000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Cross-layer",
        "parent": "",
        "content": "Geth has a reasonably accessible design (i.e. no complex db/sync access patterns, lots of forks, tests and well documented code), and Golang is quite popular too. I don't think we should be surprised it's used for prototyping so often. I like the other clients too, and would like to support them in the testnets, but the story is different there. In general there needs to be some momentum to create more forks/prototypes with other clients to build that non-client-dev expertise in the codebase before large EIPs will start with something else than Geth. And Prysm is there in the list because the team is a relatively active contributor to the EIP / sharding roadmap (which is a good thing, all clients should be encouraged to experiment with new ethereum things), no EIP-4844 author touched it. I would be happy to include any other client that has the bandwidth to bridge the gap between technical outsider and client-dev.",
        "created_at": "2022-05-16T03:44:06.709000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Nethermind has a plugin system, which makes adding features quite easy.  I'm surprised no one uses it.",
        "created_at": "2022-05-16T04:50:20.735000+00:00",
        "attachments": []
    },
    {
        "author": "asn_d6",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hey Alex. I've heard this request before and in some ways it makes sense. Can you please expand on the downsides part (since I think the upsides are pretty clear)? How much additional design/engineering overheard do you think it's gonna be? Thanks!",
        "created_at": "2022-05-16T09:50:40.533000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "it would depend on what we want to expose but in the limit we just say EIP-2537 is a dependency for EIP-4844\n\nso everyone has to add those precompiles, test them, etc\n\nwe could still have the single precompile for `kzg_verify` and it can call out to the 2537 precompile implementations if it made sense",
        "created_at": "2022-05-16T15:58:45.723000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "if anyone is strongly against this then i'd like to hear about it\n\notherwise i may bring this to ACD for a temperature check once we return to more seriously doing shanghai planning",
        "created_at": "2022-05-16T16:00:05.277000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "In my experience, championing 1559 with Besu, I think it's more or less \"marketing\" early on for the minority client team, but from the EIP champion PoV, it's more about making sure the spec works with \u003e1 codebase, which means you will need to use at least one more client 🙂",
        "created_at": "2022-05-16T16:29:12.421000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "it definitely does make sense to discuss at some point on ACD. I would also suggest not coupling them too quick because there is a world where we have either of 4844/2537 in Shanghai and not the other",
        "created_at": "2022-05-16T16:31:54.109000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "thats certainly a path forward",
        "created_at": "2022-05-16T16:32:51.948000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "if we ship 4844 and don't have BLS arithmetic exposed then i will wonder if there is a way to emulate BLS signature verification using KZG point verification",
        "created_at": "2022-05-16T16:33:46.208000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "i think you could start to do some polynomial math and get the result you want but i'm not a cryptographer",
        "created_at": "2022-05-16T16:34:08.701000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Unrelated question: is there any case for not unrestricting the max blobs per tx to the same as per block? mempools are of course still free to have size restrictions for gossip, but seems unnecessary to enforce that on the consensus level. am I missing anything?",
        "created_at": "2022-05-16T16:34:30.040000+00:00",
        "attachments": []
    }
]