[
    {
        "author": "arpit.srivastava0309",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hi All, Arpit from Coinbase here too.I am happy to collaborate and support EIP-4844.",
        "created_at": "2022-05-14T04:05:56.019000+00:00",
        "attachments": null
    },
    {
        "author": "liamhorne3565",
        "category": "Cross-layer",
        "parent": "",
        "content": "👋 hey everyone!",
        "created_at": "2022-05-14T18:39:54.283000+00:00",
        "attachments": null
    },
    {
        "author": "liamhorne3565",
        "category": "Cross-layer",
        "parent": "",
        "content": "Relevant panel from yesterday with some notes on 4844 and sharding in general: https://www.youtube.com/watch?v=N5p0TB77flM",
        "created_at": "2022-05-14T18:40:29.436000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hey everyone, thank you for the support! The current open tasks to get to a testnet are:\n\n- Implementing the latest optimization (bring blob verification from 40ms to \u003c4ms):\n    - Review EIP-4844 optimization technique (from devconnect workshop discussion and prior ideas from Dankrad): https://github.com/ethereum/EIPs/pull/5088\n    - Port over the above optimization to the consensus-specs (for fast verification of synced blobs in the network layer)\n    - Implement the above optimization in the Geth prototype (https://github.com/protolambda/go-ethereum/pull/1)\n    - Implement the above optimization in the Prysm prototype (blocked by consensus specs update)\n- Transaction fee parameter improvement:\n    - The spec can has an over-simplified fee, as well as a more complex fee. This should be unified in a simplified and more general fee structure, to reduce complexity and also be more useful in L2 contexts.\n    - The prototypes currently implement the simplified fee payment for data, but this is not viable for production.\n- Finish implementation of blobs-sidecar sync in Prysm prototype; serve blobs by range from db, and request missing blobs for span of required blob data (a backfill process after regular beacon sync)\n- Add new API endpoint to Prysm to read the blobs from storage (blobs sidecar keyed by beacon block root, slot)\n- Rebase Geth prototype on latest Merge work\n- Rebase Prysm prototype on latest Merge work\n- Continue compatibility testing between updated Prysm/Geth prototypes\n- Set up a testnet with the above prototypes (primarily devops work)",
        "created_at": "2022-05-14T19:07:15.540000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Cross-layer",
        "parent": "",
        "content": "And when a tesntet is ready:\n- Modify L2 implementations to try out the scaling on above EIP-4844 testnet. Optimism will definitely work on this, other L2s are welcome too (we need to ship the above testnet first though).\n    - In general this means that rollups that want to experiment need to adapt their way of deriving L2 blocks from L1 data. Instead of scanning transactions for calldata input to the rollup, it should scan for referenced blobs, and load them via API from Prysm.\n- Build/Extend tooling for testnet:\n    - We have some tooling to build blob txs as a user for testing, see https://github.com/asn-d6/blobbers but we can extend this (e.g. better interface to pick data and sign a full blob tx to submit to the tx pool)\n    - Visualization/Indexing: any tooling to track the blob data nicely, like a block explorer, but just for raw L2 data\n\nOnce the above optimization and fee parameter improvement lands in specs+prototypes I think we can move the EIP from \"draft\" to \"review\" status.\n\nAnd then to get to a testnet we'll primarily have to work on the Prysm prototype to be ready.",
        "created_at": "2022-05-14T19:07:37.832000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e And when a tesntet is ready:\nAt this point, it also makes sense to start looking at non-Geth/Prysm prototyping.",
        "created_at": "2022-05-14T19:19:31.961000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "If people do have experience with other codebases and want to get started even earlier, that's good too. There are a lot of learning going from a single to multi client implementation.",
        "created_at": "2022-05-14T19:19:57.307000+00:00",
        "attachments": null
    }
]