[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hi, a bit off topic but I couldn't find a better place to ask. I'm thinking on writing an informal essay on cultural shock and need some help. Can you give me a reference for the usage of the term \"linear combination\" in the context of elliptic curves? I can even settle for \"scalar multiplication\" in this context. An old or original reference would be great, but otherwise some big renowned person using this terminology would be good too. I know Vitalik uses it, but I'm looking for some pure mathematician and specifically not from the cryptography environment.",
        "created_at": "2022-09-23T22:03:38.930000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e most pure mathematicians would call it an \"exponentiation\" rather than a \"multiplication\" because they are used to a different notation for groups/elliptic curves (this is just a matter of definition, rather than one or the other being correct)",
        "created_at": "2022-09-23T22:24:13.468000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "As dankrad mentioned, linear combination is another way to say multi-scalar multiplication or multi-exponentiation. Depending on whether you define your group using additive or multiplicative notation. \n\nIf you want to look for references for the term \"linear combination\" and \"elliptic curves\" , there are some papers whom use the terminology \"vectors\" and \"matrices\" when referring to a set of group elements. You can see usage of this in section 1.1 of this paper \u003chttps://eprint.iacr.org/2019/944.pdf\u003e\n\nSection 2/2.1 also describes the dlog in terms of vector terminology, though this may be out of scope for the informal essay.",
        "created_at": "2022-09-23T23:02:57.186000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "Another reference is Bootle's thesis on the _Ideal Linear Commitment Model_ where the prover and verifier send vectors in this ideal model, which is then instantiated using groups.\n\n\u003chttps://discovery.ucl.ac.uk/id/eprint/10079416/1/Bootle_000_Thesis.pdf\u003e Skimming that paper or grepping for \"linear combinations\" should yield a ton of results concerning linear combination of group elements",
        "created_at": "2022-09-23T23:06:32.215000+00:00",
        "attachments": null
    }
]