[
    {
        "author": "protolambda",
        "category": "Cross-layer",
        "parent": "",
        "content": "https://hackmd.io/@protolambda/eip4844-meta\nNew EIP-4844 meta spec to help everyone find all the resources",
        "created_at": "2022-03-14T15:54:40.047000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@!415548822983278593\u003e re: \n\n\u003e btw, could be interesting to explore if this could possibly be solved by a market / pricing mechanism: have txs specify the availability time \u0026 pay proportionally for it. expose it in the EVM, so L2 management contracts could enforce minimum availability time.\n\u003e if that seems at all feasible, we could trivially make 4844 forward compatibly by introducing an additional TTL opcode that for now just statically pushes 3 weeks (or whatever we end up with) on the stack\n\nI think this is interesting, and I would assume that if we eventually want to do this, whatever we hardcode today should be expected to be a lower bound in the future, otherwise we'll be in the situation where things have relied on it, even though we told them not to",
        "created_at": "2022-03-14T19:49:41.222000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "One thing I like a lot about these types of constructions is giving users the flexibility to pay ETH to have the network store things forever (and reduce their dependencies) or (likely by default) manage things out of band",
        "created_at": "2022-03-14T19:50:54.041000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "not sure I understand the lower bound point: L2s that want to use 4844 could just include a \"require TTL \u003e= 3 weeks\" check, then their system would be safe, even if at some point later we allow for shorter TTLs",
        "created_at": "2022-03-14T19:51:16.487000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "or are you saying it is unrealistic to expect they would remember to add that check?",
        "created_at": "2022-03-14T19:51:39.517000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "it seems like the number of L2s is small enough that we could just manually make sure they do that",
        "created_at": "2022-03-14T19:51:59.243000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Cross-layer",
        "parent": "",
        "content": "The problem is that fees right now are adjusted for the price at inclusion-time. This is for a short-lived piece of work. And why permanent state-storage is so broken. If we have a dynamic time for blobs to live (i.e. some expiry time, paid for in advance), I'm afraid it becomes more broken the higher the max bound is.",
        "created_at": "2022-03-14T19:52:25.854000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "right, that is certainly a concern. the nice thing is that with an initially hard-coded TTL we would only commit to always allowing at most that TTL",
        "created_at": "2022-03-14T19:53:30.911000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "but that could then be an argument for keeping a relatively low TTL cap",
        "created_at": "2022-03-14T19:54:06.311000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "ah, that makes sense, yes. I guess there is no case of an unupgradeable contract which would break if TTL was less than 3 weeks",
        "created_at": "2022-03-14T19:54:12.287000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "right, we would of course have to make sure that 3 weeks would always remain an allowed TTL, later on introducing a 2 week cap would break all these contracts",
        "created_at": "2022-03-14T19:55:13.405000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "but we already wanted to give blobs their own fee market, so I think this is one of the aspects that should be part of the relevant considerations there (sorry, that comment was again in reference to Proto's point about paying for future services)",
        "created_at": "2022-03-14T19:56:02.418000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Cross-layer",
        "parent": "",
        "content": "If the TTL was very low, and costs were cheaper, does that also increase the blob throughput? Each Blob uses a constant amount of bandwidth, regardless of TTL",
        "created_at": "2022-03-14T19:57:45.799000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "right, so this only makes sense if the final mechanism is able to constrain both bandwidth and data-guaranteed-available-at-any-point-in-time to whatever limits we want to set",
        "created_at": "2022-03-14T19:59:20.021000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "not sure yet that works, but interesting enough to explore imo",
        "created_at": "2022-03-14T19:59:49.504000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think storage is very cheap compared to bandwidth in blockchains.",
        "created_at": "2022-03-14T20:00:01.370000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Cross-layer",
        "parent": "",
        "content": "Still needs to be bounded, but the difference between 2 weeks and 3 weeks might not matter much compared to increase/decrease in blob size",
        "created_at": "2022-03-14T20:00:43.591000+00:00",
        "attachments": []
    }
]