[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@203220829473996800\u003e continuing the Twitter argument. I like the idea of using RPC methods  in the eth namespace. I just wanted to mention that regardless what we do, we do not want to add overhead to `notify_newPayload` cause any delay in this method is direct delay in block synchronization: we can't even put the block to forkchoice without the EL returning.  This is not the case with FCU, by the time we call FCU all of the block synchronization is essentially done. We do go back to extract objects from orphaned blocks and we could add extra logic for blobs but\n1. I'm hesitant to let the CL do this as it couples consensus and execution in deeper ways than we envisioned at the merge.\n2. Clients currently have different implementations about this even for consensus objects: at prysm if we had a canonical block that gets orphaned later, we come back and grab attestations for example. But we do not do this for blocks that were never canonical. This is something that we need to fix and it's not trivial to do so given our design. I think doing this for blobs will add significant complexity.\n3. Perhaps we can think about sending all blobs/hashes to the EL as initially \u003c@206016661470314496\u003e suggested, but not on newPayload but rather async during the dead part of the slot and we let the EL decide how and when to cache those transactions? This way there's better encapsulation of duties.",
        "created_at": "2022-12-11T13:42:29.892000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Cross-layer",
        "parent": "",
        "content": "Agreed. And I think reorged txs don’t have to be re-included instantly anyway, I think it’s fine to use the dead part of the slot to insert them, and it can be async @, and it can just use existing rpc methods to do so \u0026 be an optional part of the spec.",
        "created_at": "2022-12-11T19:19:00.111000+00:00",
        "attachments": []
    }
]