[
    {
        "author": "inphi",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hello,\nThe Capella upgrade will contain Withdrawals and potentially EIP-4844. Client teams have already begun implementing Withdrawals so we expect/hope EIP-4844 to follow. As such, it makes sense to integrate EIP-4844 with the Capella spec. I assume client teams are branching EIP-4844 off of their mainline Capella implementation. However, Capella is still early in development and we'd like to *initially* be able to implement and test EIP-4844 without being blocked by Capella specific bugs. A EIP-4844 testnet will be setup *soon*, with sufficient client implementations, prior to the main Capella testnet. It'll be easier for us to evaluate issues and narrow down client bugs in the testnet if we can avoid withdrawals altogether.\n\nTo do this, I've drafted a spec that rebases EIP-4844 on top of Capella. It also introduces a \"feature flag\" consensus parameter that'll allow implementers to disable withdrawals. This feature flag only comes into effect when processing withdrawals specific state transitions. The idea here is to minimize issues in withdrawals that are most likely to arise when testing multi-client interop, i.e. the state transition function. All existing Capella containers and structures will remain inherited by the EIP-4844 spec, irrespective of the feature flag setting.\n\nLooking for feedback from core devs on this approach. I hope that this'll minimize the code changes needed to disable withdrawals during testing.\nOnce the (future) EIP-4844 testnet is mature enough, we remove the feature flag completely and completely integrate EIP-4844 with the full Capella spec for the next round of testnets.\n\nPlease take a look at the updated EIP-4844 spec for the details - https://github.com/ethereum/consensus-specs/pull/3052.",
        "created_at": "2022-10-20T15:05:50.345000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Are these testnets going to be public?  If not then an easier (no-code) approach would be to ask that all validators on the testnet are created with BLS withdrawal credentials.  This could also be enforced by creating validators for the genesis state and not having a deposit contract.",
        "created_at": "2022-10-20T16:39:15.755000+00:00",
        "attachments": []
    },
    {
        "author": "inphi",
        "category": "Cross-layer",
        "parent": "",
        "content": "The testnets will be public.\nI'd like to avoid having any withdrawal logic being triggered. Does having preset validators in the genesis state prevent this from happening?",
        "created_at": "2022-10-20T16:58:06.705000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Well they could be set with BLS withdrawal credentials so that the withdrawal logic would not come in to play initially. This would not stop people from sending withdrawal credential change operations, but someone would need to actively be trying to disrupt the chain this way to do so.",
        "created_at": "2022-10-20T18:39:37.614000+00:00",
        "attachments": []
    },
    {
        "author": "inphi",
        "category": "Cross-layer",
        "parent": "",
        "content": "oh i see. So nonpublic in the sense that the validator set is restricted. That could work! Not totally yet sure if we'll do that. \u003c:thinkFish:851582798426931210\u003e",
        "created_at": "2022-10-20T21:18:42.869000+00:00",
        "attachments": []
    }
]