[
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "is anyone working on blob archiving tooling?\n\nideally I can run a single binary and have it scrape a beacon node to store _all_ blobs\n\n(this will be a critical piece of the availability story)",
        "created_at": "2023-08-04T16:30:12.317000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdannyryan\u003e define \"critical piece of the availability story\"",
        "created_at": "2023-08-04T16:31:13.857000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdannyryan\u003e but it's something we've talked about with some of the devops folks — make a simple tool just dumps and stores for testing, archival, etc purposes\n\n(even though the security of DA applications does not rely on a perpetual storer)",
        "created_at": "2023-08-04T16:32:11.597000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "i have been working on some ideas in the mev-boost eco where having history of blobs is very handy (and likely required for that eco to be comfortable adopting)",
        "created_at": "2023-08-04T16:32:56.626000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "the use case would be moving the validator registrations onchain and the concern is around handling historical registrations in the event a blob expires",
        "created_at": "2023-08-04T16:34:09.418000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Possibly related to https://github.com/ethereum/consensus-specs/issues/3286 which is something I'd love to get back to.  I suspect that it won't become a priority for anyone though until we have bandwidth and storage measurements from testnets to decide if blobs are going to result in a significant additional barrier to home stakers or not.",
        "created_at": "2023-08-04T16:39:07.196000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "I can provide a prysm flag that `--stores-blob-forever`. Think you need anything else more than this?\nL2 nodes that support historical syncing will likely require consensus node to have such flag too",
        "created_at": "2023-08-04T16:54:39.413000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdannyryan\u003e Won't L2 nodes serve their own p2p (and store portions of a subset of L1 blobs -- their blocks) however they want?",
        "created_at": "2023-08-04T17:06:46.639000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdannyryan\u003e L1 is to make such data available to avoid withholding attacks but then applications (roll-ups) should be built in ways custom tailored to their application",
        "created_at": "2023-08-04T17:07:38.830000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cterencechain\u003e \u003e \u003cterencechain\u003e  If an L2 node wants to trustlessly sync an L2 chain outside the L1 retention window, it'll need an blob archival node to provide that data. \nThis is different than today with CALLDATA (re @dannyryan: Won't L2 nodes serve their own p2p (and store portions of a subset of L1 blobs -- their blocks) however they want?)",
        "created_at": "2023-08-04T17:11:23.867000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cralexstokes\u003e and also worth recognizing the CALLDATA semantics here change in a post-EIP-4444 world",
        "created_at": "2023-08-04T17:12:33.161000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdannyryan\u003e The semantics don't change?",
        "created_at": "2023-08-04T17:13:10.399000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdannyryan\u003e The semantics are exactly the same. You execute the block and the data is within the block",
        "created_at": "2023-08-04T17:13:31.427000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdannyryan\u003e It's just a matter of if you can get that block from the p2p",
        "created_at": "2023-08-04T17:13:40.840000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdannyryan\u003e \u003e \u003cdannyryan\u003e  trustless wrt to what? safety or liveness?\n\nYou can trustlessly safely sync historic L2 data given a head/finalized L1 chain.\n\nL1 does not provide a liveness guarantee on L2 historic sync. So at that point you are either going to the L2 ecosystem itself — e.g. sequencers or p2p nodes — and relying on them for liveness (not safety). Or you are going to some sort of other data provider — e.g. some service that stores all blobs and can parse your requests for what you want.  And, in both cases, there are questions to answer — do they provide blobs for all history? or do they provide states at some depth (e.g. 2 weeks) and just allow state sync [similar questions that nodes have to answer on L1]\n\n In any case, you are in a similar trust model (can verify safety against L1 but no liveness is on external actors). L1 is agnostic to users sync and who helps them do so.\n\nFor the non L2 specific provider — the generic blob data storer/provider, I agree that being able to set your prune period at some value \u003e min_da_prune_period is valuable and I tihnk it natural for clients to be able to configure at any value \u003e than the in-protocl minimum. In fact, I suspect that block explorers, academics, and others are going to want this independent of specific L2 needs. (re @terencechain: If an L2 node wants to trustlessly sync an L2 chain outside the L1 retention window, it'll need an blob archival node to provide that data. \nThis is different than today with CALLDATA)",
        "created_at": "2023-08-04T17:32:24.842000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah we ran the idea through one or two brainstorming sessions. Landed on a simple script that calls an api and pushes to s3 using perhaps something like s3cmd to ensure easier config. Should be minimal cost to archive for a long time this way, s3 backends can also be selfhosted for those interested.",
        "created_at": "2023-08-04T17:33:02.694000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdannyryan\u003e also for data providers in general, they might use L1 nodes with extended prune periods but they'll also almost certainly chuck it into more sophisticated storage structures",
        "created_at": "2023-08-04T17:33:36.964000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cterencechain\u003e \u003e trustless wrt to what? safety or liveness?\n\nliveness, safety doesn't have a retention window in this context, you can always run point evaluation precompile outside of retention window\n\n\u003e L1 does not provide a liveness guarantee on L2 historic sync\n\nYep yep agreed. Just pointing out that it's a paradigm shift vs. CALLDATA. L2 needs to adapt to this. I might be mixing L2 and L1 nodes a little bit. In many cases, L2 service historical data is really just an L2 node running a REST client and requesting an archival L1 node for historical data and serving it back to other peers",
        "created_at": "2023-08-04T17:43:40.917000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdannyryan\u003e got it — you could imagine an architecture that doesn't do such a pass-through and just stores it in L2 specific node. (which seems a more sane approach given how much data might be pumped through L1 at some point...)\n\nI certainly support clients having configurable windows beyond the default prune window",
        "created_at": "2023-08-04T17:45:52.144000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "i just mean that you can't rely on L1 stock nodes providing all history in a post-4444 world",
        "created_at": "2023-08-04T18:05:15.607000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "and i was interpreting what terence was saying as, today / pre-4444, we can rely on this fact and essentially use the full node as storage",
        "created_at": "2023-08-04T18:06:06.633000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "in addition to availability of CALLDATA",
        "created_at": "2023-08-04T18:06:17.667000+00:00",
        "attachments": null
    }
]