[
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "But would 4844-ssz tx require refactoring (and what) in all ssz future?",
        "created_at": "2023-05-04T05:33:41.735000+00:00",
        "attachments": []
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hm. There's also the \"transaction-in-a-bottle\" thing, where someone may have a type 0 tx pre-signed.\n\nCould a zk proof for these be done by splitting it up into two parts:\n1. Create a proof that it was validated, and correctly converted to a normalized form according to whatever the latest hash format is (SSZ, Poseidon, whatever)\n2. The zk-evm itself only takes those normalized txes as input\n3. (Optional) New TXes can be constructed in the preferred format directly to avoid step 1 (and could be prized cheaper to push adoption and have a deprecation path for those old-style txes that need conversion?\n\nI'm wondering, if those ZK-EVMs operate on the raw signed transaction (using their original implementation), or whether they should operate on a pre-processed version (similar to EIP-6404 currently) that already extracted the signer and the contract destination address (for CREATE tx).\n\nWe could add zk commitments to the EIP-6404 object as well, multidimensional fees and create2 can be extended with another field, only the encrypted transactions would need a separate tree (similar to deposits / withdrawals). And then, have ZK only operate on a single type instead of having to fold together proofs or do recursive proofs to cover all cases.\n\nNote, my zk knowledge is relatively limited, still, but would be curious about your thoughts on the roadmap there.\n\nThe original representation only really matters if we try to align it with its post-block inclusion form (e.g., the union approach). But I still see the problem there that it doesn't work too well for old-style transactions, and also doesn't work well if the post-block inclusion form is changed, e.g., to a zk friendly hash algo, without creating even more tx types (that the signer doesn't even necessarily care about).",
        "created_at": "2023-05-04T06:37:35.268000+00:00",
        "attachments": []
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "also, step 1 is only necessary when building blocks. for historical sync where block headers are known, could have only a single form (EIP-6404 style) that solely depends on the corresponding fork.",
        "created_at": "2023-05-04T06:40:43.458000+00:00",
        "attachments": []
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "Essentially, what's the mempool format doesn't matter too much in that case, as all the nice properties that clients may want (proofs for individual fields, zk friendly hashes, commitments to tx signer, tx id, and contract destination, and so on) can be added retroactively in step 1",
        "created_at": "2023-05-04T06:42:55.178000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e  it is almost a certainty that either i) we have to change something about it [4844 ssz] in the future (defeating the purpose a bit) or ii) we are unnecessarily constrained when we do decide make the full transition to SSZ.",
        "created_at": "2023-05-04T13:38:24.367000+00:00",
        "attachments": []
    },
    {
        "author": "hsiaowei",
        "category": "Cross-layer",
        "parent": "",
        "content": "draft CL spec change for the de-sszify situation: https://github.com/ethereum/consensus-specs/pull/3345",
        "created_at": "2023-05-04T16:41:30.316000+00:00",
        "attachments": []
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "Wondering if we should try and set up a meeting around Edcon to discuss SSZ? \n\u003c@543900561460822016\u003e \u003c@273808422753796097\u003e and anyone else interested, would you be around there?",
        "created_at": "2023-05-04T19:49:55.492000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "i am thinking of coming yes",
        "created_at": "2023-05-04T19:51:01.601000+00:00",
        "attachments": []
    }
]