[
    {
        "author": "__flcl",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hi everyone! In case we agree on SSZfication of all types of transactions, their hashes and tx root. Do you guys feel it's possible to implement it in Cancun and is enough as the first step of bringing SSZ to EL side?",
        "created_at": "2023-05-10T07:52:36.150000+00:00",
        "attachments": null
    },
    {
        "author": "yperbasis",
        "category": "Cross-layer",
        "parent": "",
        "content": "`calc_data_fee` is called on parent, right? (Similar to how `get_data_gasprice` is called on parent). Here's a PR to amend a small inconsistency in the definition of `calc_data_fee`: https://github.com/ethereum/EIPs/pull/7008",
        "created_at": "2023-05-10T16:07:10.535000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think not having a go SSZ library that takes arbitrary interfaces (like our RLP library) has slowed us down a lot on trying to implement different SSZ ideas. We don’t like fastssz much, so that is a big issue for us. Also agreeing on the ssz format is proving to be quite difficult",
        "created_at": "2023-05-10T16:34:34.579000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Cross-layer",
        "parent": "",
        "content": "Think that prysm used to have something like this, but it was slow, hence fastssz.  Certainly for the scale of the production environment and number of items that have to be hashed, having dedicated code for each struct is pretty much a must-have rather than anything that relies on reflection or the like.\n\nUnderstand that it may slow down prototyping, though.",
        "created_at": "2023-05-10T16:52:40.616000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah that is probably the case, but we'd like to cross that bridge when we get there! also just having a general purpose ssz library is useful for all kinds of other reasons",
        "created_at": "2023-05-10T17:39:31.786000+00:00",
        "attachments": null
    },
    {
        "author": "roberto.bayardo",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@552133098075193354\u003e has queued up several 4844 topics for tomorrow's ACDE. https://github.com/ethereum/pm/issues/768\n🙏",
        "created_at": "2023-05-10T20:33:14.994000+00:00",
        "attachments": null
    }
]