[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@555483069038198827\u003e didn't want to post on the GitHub issue cause it's off topic and you seem to be sure of it. I am not so sure someone might be creative and optimistically count with the majority of nodes holding some blobs. It's free to send a few more blobs than the ones with commitments in the block and rely on the majority of nodes holding them.",
        "created_at": "2023-10-21T04:15:39.541000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't claim there's free DA but also I am not so sure it's not exploitable if the proposer can force clients to keep useless data",
        "created_at": "2023-10-21T04:17:21.757000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e The majority of nodes holding a blob is still not data availability. But even if it were, how do you count them? How do you prove on-chain that they held it?\n\nYou could make them sign it, but at that point, you are adding a new protocol, and it would pretty much look like EigenDA.",
        "created_at": "2023-10-21T11:16:49+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cadietrichs\u003e right - the scarce thing here is not “making data available” - that you can do basically for free on the internet in many ways. what makes blobs special is that they are available in a way that is legible on-chain. so if proposers can “exploit” the network to make a few extra blobs available, but can’t prove that on-chain, all they get is a really really bad and low capacity dropbox 🙂\n\nSo the only concern I would have is whether this is in any way a griefing vector, by putting significant extra load on the network.",
        "created_at": "2023-10-21T11:27:26.095000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e I am not too worried about this because the vector comes at significant orphan risk cost to the proposer",
        "created_at": "2023-10-21T11:28:53.802000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think it's zero risk to the proposer depending on client implementation. Currently at least the only client I'm aware of, doesn't check blob index against the block but rather against the Max so anyone proposing can add invalid blobs for free that will be propagated and not penalized by anyone. You guys seem pretty certain that this is fine but to me it looks like every 12 seconds that we don't have 6b blobs on a block, the proposer can gossip some extra data and be sure that 1) the p2p network will gossip it without any penalization and 2) clients may keep that useless data for some time. \n\nNow I give you that I don't know how to exploit this in any meaningful way, but it doesn't take away the fact that both of these are there and we know that anything that the network offers will be taken",
        "created_at": "2023-10-21T20:09:52.961000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Just to be clear: there's zero risk of orphaning if you publish your block early with 3 commitments and then submit 6 blobs",
        "created_at": "2023-10-21T20:11:22.158000+00:00",
        "attachments": null
    }
]