[
    {
        "author": "winnsterx",
        "category": "Cross-layer",
        "parent": "",
        "content": "Can a blob be shared by multiple rollups after EIP-4844?",
        "created_at": "2023-02-02T00:00:58.432000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003casn_d6\u003e nothing stops rollups from doing so",
        "created_at": "2023-02-02T00:02:05.436000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003casn_d6\u003e (altho it will likely increase complexity on their side)",
        "created_at": "2023-02-02T00:03:16.021000+00:00",
        "attachments": []
    },
    {
        "author": "winnsterx",
        "category": "Cross-layer",
        "parent": "",
        "content": "Does a blob always have a fixed size of ~0.13MB even if the tx data doesnt actually fill up whole blob?",
        "created_at": "2023-02-02T00:21:50.817000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e yes",
        "created_at": "2023-02-02T00:30:57.189000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "Follow up question on the crypto libraries audit in the context of block/block decoupling. Do I understand correctly that `verify_aggregate_kzg_proof` verifying a single blob would be slower than `verify_single_kzg_proof`?",
        "created_at": "2023-02-02T15:24:17.947000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003casn_d6\u003e very slightly slower tbh",
        "created_at": "2023-02-02T15:24:52.732000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003casn_d6\u003e the pairing is the expensive part",
        "created_at": "2023-02-02T15:25:10.420000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e yes. There is also the possibility that we just commit to the change (single blob verification) independently from block/blob decoupling (the so called \"block/blob decoupling decoupling\") to get remove this decision from the critical path",
        "created_at": "2023-02-02T15:26:18.107000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "What if we would put both functions for the audit? They both might have an utility in the future",
        "created_at": "2023-02-02T15:26:19.748000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't know the math and potential optimisation paths behind these two function in detail. But they may have common parts so the cost of the audit won't be significantly different",
        "created_at": "2023-02-02T15:29:48.860000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e as I said I would rather just switch to individual blob verification in all cases than maintaining two version of this function",
        "created_at": "2023-02-02T15:30:36.062000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "I agree especially if using an aggregate version results in a slight improvement",
        "created_at": "2023-02-02T15:31:50.093000+00:00",
        "attachments": []
    },
    {
        "author": "roberto.bayardo",
        "category": "Cross-layer",
        "parent": "",
        "content": "Regarding today's ACDE discussion around the proposal for sending each blob individually instead of coupling all with the block:\n\n    - Advantages include: supports processing the blobs in parallel, allows for bandwidth-reducing optimizations (similar to attestation propagation), and should be more future compatible with ideas like erasure-coding blobs for network dissemination.  We should have more data around the networking benefits in a week or so, though Jacek mentioned ~30% savings in bandwidth was seen from the attestation optimizations allowed by separation.\n\n    - Disadvantages are the impact on the crypto APIs which need to be frozen soon for audit, though parallel discussion in the C-KZG telegram channel suggests we could just commit now to sending individual proofs for blobs as that would work with whatever proposal (with slight additional overhead should we stick with coupling).\n\nAnother disadvantage which wasn't explicitly acknowledged in today's call was the additional implementation complexity which could push out our readiness date. (Note that we settled on a coupled design previously because it was simpler).  I understand we do want to eventually end up propagating blobs independently \u0026 separately, but what are the consequences of deciding to do this post-Cancun, e.g. when we decide to increase the blob sizes? Migrations are always painful but would a migration from coupled to non-coupled be particularly so?  If so I can understand the desire to adopt uncoupled blobs now, but I'm having trouble gauging the migration challenges vs the complexity of implementing the change now.\n\nMy impression is coupling (small) blobs with the block for Cancun remains a good approach of incrementally getting us to the desired end state, but interested in hearing what more experienced client devs think.",
        "created_at": "2023-02-02T16:12:21.256000+00:00",
        "attachments": []
    },
    {
        "author": "roberto.bayardo",
        "category": "Cross-layer",
        "parent": "",
        "content": "---------\nRegarding the migration of all txs (not just blob txs) to SSZ in the block:\n\nThough these proposals also add a good deal of additional complexity to plans for 4844, it does feel like we should be biting that bullet now. Otherwise, the new blob tx type 4844 introduces might just be creating additional legacy complications for the eventual migration. The current 4844 spec where we only encode blob txs as ssz doesn't seem buy us much in terms of incrementally getting us to the desired end state.",
        "created_at": "2023-02-02T16:19:19.799000+00:00",
        "attachments": []
    },
    {
        "author": "roberto.bayardo",
        "category": "Cross-layer",
        "parent": "",
        "content": "The proposals for migrating fully to SSZ also neatly resolve the question around blob-txs with 0 blobs (Vitalik's proposal introduces a new tx type specifically for 0 blobs, Etan's proposal has blobs as an optional field in a unified tx type).",
        "created_at": "2023-02-02T16:34:23.703000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Cross-layer",
        "parent": "",
        "content": "Assuming it's not too hard to decouple the blocks \u0026 blobs \"later\", I also think it's probably right to keep them coupled now and potentially get the SSZ transition done",
        "created_at": "2023-02-02T23:16:40.585000+00:00",
        "attachments": []
    }
]