[
    {
        "author": "jimmygchen",
        "category": "Cross-layer",
        "parent": "",
        "content": "I've updated the blob download Beacon API spec PR to the latest CL spec, would be great to get some feedback on this 🙏  FYI \u003c@159152274659082240\u003e \u003c@363800010518822915\u003e \nhttps://github.com/ethereum/beacon-APIs/pull/286",
        "created_at": "2023-02-24T12:39:32.646000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hello, has there been any research in separating the execution payload from the blob transactions?  I understand that eventually home stakers won't be able to produce blocks because they won't be able to compute the KZG commitments to blobs. But how about validators being allowed to get separate bids for an execution payload and a list of blob transactions. And the validator may fall back to local execution for the first part while keeping the second one? This is not possible currently with 4844 I understand, but is there any fundamental reason as to why this is not possible?",
        "created_at": "2023-02-24T17:16:54.805000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e not really possible, as the blob transactions can interact with the state and so blob transactions can't be executed independently from the others",
        "created_at": "2023-02-24T19:09:37.681000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "but is this really something that is fundamentally required? I can impose that all blob transactions go after the others and are just data, so the EVM only sees them in the next block",
        "created_at": "2023-02-24T19:26:56.497000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Builders will pack all non-blob transactions first (and they are allowed to interact with the blobs from the previous blocks) and then after those all blob transactions",
        "created_at": "2023-02-24T19:27:43.633000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "retaining the ability to locally produce an execution block seems to me something that we should try to keep",
        "created_at": "2023-02-24T19:28:15.343000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cralexstokes\u003e as long as blob transactions use eth for payment then they touch the state and so you can’t really differentiate like that",
        "created_at": "2023-02-24T20:51:30.633000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cralexstokes\u003e that being said a home staker could always just produce a local payload without blobs",
        "created_at": "2023-02-24T20:52:08.569000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdannyryan\u003e If they didn't execute, you could likely tack them on the end or beginning with some sort of comms or maybe proofs with the builder",
        "created_at": "2023-02-24T20:52:35.455000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdannyryan\u003e I was thinking about this a while back. I certainly agree with the motivation but am unsure if there is a clean construction",
        "created_at": "2023-02-24T20:53:11.484000+00:00",
        "attachments": []
    }
]