[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The fact that they touch the state is not so problematic. So does the payload and we can definitely include it by only knowing its hash. If it's only payments those can be included in the header and that's enough for the local builder to compute the stateroot without getting the blobs. Not very nice, but surely there must be ways of solving this, doesn't seem to me as much as a fundamental problem as the problem of not being able to produce a better local payload if it pays more than the builder for example",
        "created_at": "2023-02-25T00:38:39.364000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Actually if it's only payment one can just verify validity of the blobs without touching the state and the next block is forced to start by transferring payments from the right accounts. Either the chain stalls or the transactions are guaranteed unless the block is reorged",
        "created_at": "2023-02-25T01:04:05.929000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e They payload touches the state, but the point is that it is the only thing that touches the Eth1 state. If you constructed something else that also touches it then the two would be in competition and the whole construction doesn't work",
        "created_at": "2023-02-25T09:18:31.281000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e There are advantages that blob transactions are full Eth1 transactions, not just payments for the blob data. This allows them to immediately update the rollup state and you can even interact directly between rollup and base layer in that way.",
        "created_at": "2023-02-25T09:19:42.118000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "If you include blobs at the end of the block then the EVM can interact with them immediately in the next block. Rollups would care more about censorship resistance than instant interaction on L1",
        "created_at": "2023-02-25T11:06:13.840000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e How do you know there is enough in the accounts to pay for the blobs?",
        "created_at": "2023-02-25T13:51:41.898000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "Cross-layer",
        "parent": "",
        "content": "blobs could include a \"proof of payment ability\" where you defer settlement of the payment until the next block but the design would start to feel a bit contorted imo",
        "created_at": "2023-02-25T14:48:17.520000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The payments themselves can go in the header and the proposer can check the validity before signing, that's the comment above, it's not nice, but can be hidden at the cost of a little cryptographic complexity.",
        "created_at": "2023-02-25T15:23:32.313000+00:00",
        "attachments": []
    }
]