[
    {
        "author": "ajsutton",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't have exact numbers but the blob market is an interesting one.  Last I looked there were lots of 1 blob transactions and lots of 6 blob transactions.  As a result, op-mainnet changed to use 5 blob transactions so we could sneak in alongside the 1 blob transactions but still amortise the tx cost over as much data as possible. I doubt the system has reached equilibrium yet either - just like op-mainnet changed to 5 blobs, others may change their behaviour in response to what they observe and as they optimise their system more.",
        "created_at": "2024-09-27T00:40:35.597000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Cross-layer",
        "parent": "",
        "content": "I wonder if instead of max-blob it would be better to apply a multiplier to blob tx profits to reflect the higher chance of reorg. Might not work given 1559 means you generally wind up including all transactions though I guess.  But if it factored in the number of blobs, it might result in favoiuring 1 blob transactions over 6 blob ones and still follows financial incentive well.\nThat said, if you can never publish a 6 blob block in time on your connection then a hard limit is what would be needed.",
        "created_at": "2024-09-27T00:42:47.342000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Cross-layer",
        "parent": "",
        "content": "right, and right now if i'm sysoping this problem, i would reduce my peer count a lot",
        "created_at": "2024-09-27T00:50:09.543000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Cross-layer",
        "parent": "",
        "content": "Reducing peer count is not great because it does really impact your viability... next release teku will allow nodes to turn off flood publishing and that'll help, and also `idontwant` will help, not sure if thats in next release..",
        "created_at": "2024-09-27T01:17:36.257000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This was effectively happening for a while before builders/relays fixed their act: homestakers would be including 6 blobs and builders would either completely censor them or include 3 max. Blob gas fee was effectively 0 but rollups would have to tip to get their blob tx included. This creates a whole new game of distortions because the tip is only counted in the execution part of the block, this led to some transactions that would be paying a lot more on tips, to not be included because of the homestaker's local mempool rules would prioritize cheaper transactions in fact (a whole different subject to talk about). Hopefully that is fixed now that relays and builders are including blobs. We still trust them to not censor in the next spike, this has yet to be battle tested.",
        "created_at": "2024-09-27T01:55:34.178000+00:00",
        "attachments": null
    }
]