[
    {
        "author": "robocopsgonemad",
        "category": "Cross-layer",
        "parent": "",
        "content": "what would happen if I, as a (vanilla) block producer, always under-include the target number of blobs. i.e. instead of aiming for 3, I ignore that and only include 1 blob in my block. My understanding is that it wouldn't affect consensus at all, but I'm not sure I understand if it'll hurt blob pricing somehow.",
        "created_at": "2024-09-26T21:39:35.437000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Cross-layer",
        "parent": "",
        "content": "I understand that I would be leaving money on the table, and not reducing excess blob gas as much as if I hadn't.  So I'd be slowing a return to the mean, which would then perhaps delay L2s waiting for ideal pricing.",
        "created_at": "2024-09-26T21:43:13.820000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think it would be the opposite effect - because the number of blobs included is under the target the base price would fall making blobs cheaper even though the number of blobs trying to be included are in excessive of the capacity (or at least of the self-limited capacity).\nThat reduces the benefit of the EIP-1559 style pricing somewhat but assuming you'd still include the highest priority fees so it still works ok.",
        "created_at": "2024-09-26T22:36:43.346000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Cross-layer",
        "parent": "",
        "content": "oh crap, right i've got it backwards, i'd be increasing excess blob gas",
        "created_at": "2024-09-26T22:39:16.069000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Cross-layer",
        "parent": "",
        "content": "How many transactions only include 1 blob?  I think we also need to look at the blob distribution in TXes, which could impact the ability to under-include blobs. And also, exactly how much money is being left on the table? Is it better to drop blob revenue to make sure you get included (for home stakers)?",
        "created_at": "2024-09-26T22:40:53.815000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Cross-layer",
        "parent": "",
        "content": "home staker wise its sometimes a question of successfully produce vs a missed proposal",
        "created_at": "2024-09-26T22:43:08.343000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Cross-layer",
        "parent": "",
        "content": "idk how often mempool will have tx's friendly to this, but the selection wouldn't be too bad - i pick the most profitable tx with my configured max-blobs, and then only any other blob txs that refer to those same versioned hashes get included.",
        "created_at": "2024-09-26T22:44:17.271000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Cross-layer",
        "parent": "",
        "content": "besu has a layered transaction pool, which might be particularly amenable to that implementation, but am still exploring",
        "created_at": "2024-09-26T22:45:01.186000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Cross-layer",
        "parent": "",
        "content": "proposers get no financial incentive for blob inclusion if i understand correctly, but they do miss a sizable reward if they fail to produce anything in a timely manner. So especially with increases in blob count on the cards, this will become more and more relevant to solos, shameless plug...",
        "created_at": "2024-09-26T22:48:01.160000+00:00",
        "attachments": null
    }
]