[
    {
        "author": "beringela1311",
        "category": "Cross-layer",
        "parent": "",
        "content": "hi all, I was looking at a type 3 transaction in a regular block explorer (https://sepolia.etherscan.io/tx/0xe8d7b12cbf423f2d5164715ee1f2754a9795067721e810d1f327b210101aa9d4) and I can see **from** and **to** addresses (as I'd expect given its a transaction). How should I interpret these fields? Who can send a blob transaction, is it only certain addresses or roles? And who can receive a blob transaction, is that some special address or role? I was thinking that the sender of a blob was \"an L2 chain\" and the recipient of the blob was \"the L1 chain\" but clearly there is more to it, that I don't yet understand. Thanks in advance!",
        "created_at": "2024-03-07T09:51:31.663000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Anyone can send a blob transaction and to anyone, from and to can be any address.",
        "created_at": "2024-03-07T11:51:09.524000+00:00",
        "attachments": []
    },
    {
        "author": "beringela1311",
        "category": "Cross-layer",
        "parent": "",
        "content": "for type 3 transactions, I can see a data field containing the blob data (e.g. https://sepolia.blobscan.com/blob/0x01d64d539d8d3933a34bf60e074bb7ec3fccd2ffa93dd3cd384b0ba951344915), but where is the schema for that data? Is that schema only known to the transaction sender (perhaps it is held off-chain?) or is it held on-chain so that anyone can easily make sense of what the data is?",
        "created_at": "2024-03-07T12:21:34.214000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "blob data is just arbitrary, different consumer of those blobs may encode them differently",
        "created_at": "2024-03-07T12:28:27.470000+00:00",
        "attachments": []
    }
]