[
    {
        "author": "jimmygchen",
        "category": "Cross-layer",
        "parent": "",
        "content": "That's good to know - I think this is very helpful for the initial blob count increase, although I think some form of distributed block building would still help de-risk in the shorter term and still necessary if we are increasing beyond 32 blobs block. This would definitely buy us some time to think about optimizing proof building for the longer term though.\n\nJust some numbers for context - on a quad logical core staking machine today, proof generation for 16 blobs (4mb with erasure coding) could take 1+ seconds, and 5+ seconds to broadcast if we assume the same broadband requirement (10mbps up \u0026 down) today.\n\nThe good thing is distributed blob building itself doesn't necessary require a hard fork - so we could optimise as we go and when we increase the blob count further.",
        "created_at": "2024-09-18T00:37:59.871000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "On ePBS a home staker self building will have 12 seconds to do both: construct the proofs and broadcast",
        "created_at": "2024-09-18T00:47:57.995000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The next proposer needs to have all validated to not reorg it, that's why the 12 seconds. The next attesters only need to validate all by 15 seconds",
        "created_at": "2024-09-18T00:49:11.626000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cdankrad\u003e is 7732 currently considered for inclusion in pectra?",
        "created_at": "2024-09-18T17:30:57.793000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cterencechain\u003e nope (re @dankrad: is 7732 currently considered for inclusion in pectra?)",
        "created_at": "2024-09-18T17:32:31.114000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "No, but if Pectra is split as it seems it will, it can easily be considered for the F fork",
        "created_at": "2024-09-18T19:57:07.357000+00:00",
        "attachments": null
    }
]