[
    {
        "author": "parithosh",
        "category": "Cross-layer",
        "parent": "",
        "content": "ser, lets not open the fork rescoping again. The moment we open that box the split would have been pointless.",
        "created_at": "2024-09-19T09:01:12.574000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003csauliusgr\u003e Well, if the second batch is rescoped then the split at least gives a chance to ship the first batch fast. I personally doubt that the second batch will only contain EOF and PeerDAS (assuming it's the current thinking).",
        "created_at": "2024-09-19T09:02:58.176000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003csauliusgr\u003e I even would say that it's not so bad pattern - do an early scoping and try to push all the accepted things forward, then at half-way simply move the things (EOF, PeerDAS) that delays the fork to the next fork. Sorry, I'm not big believer in the splits when then second batch is scoped until the first batch is delivered.",
        "created_at": "2024-09-19T09:07:42.932000+00:00",
        "attachments": []
    },
    {
        "author": "parithosh",
        "category": "Cross-layer",
        "parent": "",
        "content": "Would be nice if we actually talk about this at devcon and decide on which approach we're gonna stick to for the future. I'm mostly fine with either approach and personally think no feature will guaranteed make it on mainnet until the slot after the fork has occured. \n\nI personally don't think we have the dev capacity overall to focus on so many things at once, but that might ofc just be my view. e.g: last fork had the full attention of everyone in the team vs this fork we've had to strategically split resources to make sure each feature gets someone working on it. Downside of this approach, fewer eyes on each feature and more corners being cut - Upside, more short term progress on each individual feature.",
        "created_at": "2024-09-19T09:22:46.841000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm simply pointing out that peer DAS is scoped, it has several problems with resource management and all these problems seem to be solved by something that is already speced and being implemented",
        "created_at": "2024-09-19T09:58:37.424000+00:00",
        "attachments": []
    }
]