[
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "thanks! and I agree, ForkVersion + a name (e.g., Fulu1/2/3, for beacon-api Eth-Consensus-Version header) would be safe, as that's essentially what every other fork also bumps. btw, ForkDigest is automatically derived from ForkVersion, if ForkVersion changes the additional xor special snowflake code is no longer needed.",
        "created_at": "2025-08-20T03:37:02.872000+00:00",
        "attachments": null
    },
    {
        "author": "raulvk",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@881905303011086387\u003e here are my thoughts, posting here to cross-check and discuss first:\n\n- Valid concern, without forkversion bump we have no segregation at the signature level which could cause beacon nodes to indeed go chasing blocks from the non-upgraded branch if they're exposed to them (because their signatures are valid)\n- As for the attack, one part can be prevented by only boosting the score if their fork won the forkchoice (but this means deferring and unwinding after the whole branch was retrieved and validated). In this case it wouldn’t boost because the branch has lower weight. This is a tightening of the original heuristic (which based on your message rewards mere data availability), and might be undesirable if only necessary to address a shortcoming of BPOs as currently specified.\n- Another problem is: if a long-lived pre-BPO fork exists, an attacker could keep cross-publishing every block from a non-empty slot in that fork, triggering this behaviour repeatedly, right?",
        "created_at": "2025-08-20T09:58:03.605000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah, I don't see the scenario that the current solution of the ForkDigest-only bump protects against a single node re-broadcasting the data between the partitions... could just go simple and colocate all traffic on same digest. that way at least does not lead to split view scenario.\n\nif forkversion bumped (plus a name is assigned), it's just a regular fork (meaning, the weird forkdigest computation logic etc is no longer needed), with the added convention that the blob config change is the only semantic change; which is similar to how the difficulty bomb forks were handled in the past.",
        "created_at": "2025-08-20T11:05:14.775000+00:00",
        "attachments": null
    },
    {
        "author": "raulvk",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@881905303011086387\u003e Not rotating ForkDigest is unsafe because we’d have valid and invalid payloads circulating on the same topics (based on the subjective view). It leads to mesh degradation (due to peer scoring) and, worse, the inability to know if a peer is on the right fork or not (because there’s no external signaling). So partitions would be created and destroyed continuously anyway and the full network would flap",
        "created_at": "2025-08-20T11:51:25.382000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "how is it different from a single peer broadcasting all payloads across both topics?",
        "created_at": "2025-08-20T12:11:23.991000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "the peers cannot detect the origin of a payload, one can simply re-broadcast with different ForkDigest",
        "created_at": "2025-08-20T12:11:44.386000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "signature is still valid, if ForkVersion is not bumped",
        "created_at": "2025-08-20T12:11:56.492000+00:00",
        "attachments": null
    },
    {
        "author": "raulvk",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@881905303011086387\u003e I think we agree that the current solution is suboptimal. I was just pointing out why dropping the ForkDigest partitioning as suggested here would still be problematic:\n\n\u003e could just go simple and colocate all traffic on same digest. that way at least does not lead to split view scenario.",
        "created_at": "2025-08-20T12:22:10.107000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah, dropping ForkDigest would solely simplify things (but it would still have all the problems, just in a hidden-by-default way)\nI think only the full `ForkVersion + Name` truly fixes the problems.",
        "created_at": "2025-08-20T12:26:48.172000+00:00",
        "attachments": null
    },
    {
        "author": "raulvk",
        "category": "Cross-layer",
        "parent": "",
        "content": "Here’s the record of the consensus at ACD on abandoning the fork_version path (PR linked therein) in favor of fork_digest: https://github.com/ethereum/consensus-specs/issues/4331#issuecomment-2917327652",
        "created_at": "2025-08-20T13:16:46.258000+00:00",
        "attachments": null
    },
    {
        "author": "raulvk",
        "category": "Cross-layer",
        "parent": "",
        "content": "I’m surprised that the scenario you outlined wasn’t brought up if something similar had been a real concern in the past (it wont be straightforward to course-correct this so late in the Fusaka timeline)",
        "created_at": "2025-08-20T13:19:07.346000+00:00",
        "attachments": null
    },
    {
        "author": "raulvk",
        "category": "Cross-layer",
        "parent": "",
        "content": "That said, my suggestion is to focus on assessing the exact preconditions, probabilities, mechanics and impact to determine next steps. I’ll start something and would love your input \u003c@881905303011086387\u003e \u003c@592004585506340885\u003e",
        "created_at": "2025-08-20T13:28:52.221000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "well, with rushed timeline, it's tricky to do thorough reviews and security analysis of every small detail timely...\nI poked eth-magicians ~2 weeks ago, and now raised it here as well as that thread seems to not be active.",
        "created_at": "2025-08-20T13:32:47.832000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "If this comes down to, they need all the infrastructure a hardfork does, for Glamsterdam and beyond, I'd still advocate for, just drop BPOs and call them hardforks, complete, with, yeah, names",
        "created_at": "2025-08-20T13:41:37.824000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "It doesn't matter how much or little the logic changes, it matters that the forking mechanism has to 100% be in place regardless",
        "created_at": "2025-08-20T13:42:13.144000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "Then all the beacon API, req/resp etc parts naturally work too",
        "created_at": "2025-08-20T13:42:29.104000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e Another problem is: if a long-lived pre-BPO fork exists, an attacker could keep cross-publishing every block from a non-empty slot in that fork, triggering this behaviour repeatedly, right?\nNot sure this would be possible. Excess blob gas calculations would differ in the execution payload pretty quickly.",
        "created_at": "2025-08-20T18:40:15.734000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm like 99% sure it's too late to change anything. Also, I like BPO forks and believe our current approach will work fine.",
        "created_at": "2025-08-20T18:40:59.832000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "cc \u003c@\u00261367819082019377202\u003e \u0026 \u003c@520034910149410861\u003e",
        "created_at": "2025-08-20T22:24:39.110000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Cross-layer",
        "parent": "",
        "content": "If we could go back in time then yes i'd agree, just make it a hard fork, but 2 weeks from release i see no reason to down tools and adjust. we've basically implemented an alt-fork mechanism with all the plumbing, just without a name and some boilerplate code.",
        "created_at": "2025-08-20T22:32:27.913000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "I agree on this point, I'm not saying do this now",
        "created_at": "2025-08-20T22:42:05.514000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This attack seems only plausible if the chain is already non finalizing, is that the concern?",
        "created_at": "2025-08-20T22:59:22.905000+00:00",
        "attachments": null
    },
    {
        "author": "raulvk",
        "category": "Cross-layer",
        "parent": "",
        "content": "I've been working through the details and I'm growing convinced that this isn't cause for major concern. For something to go wrong, a sizeable part of the validators would have to remain on the minority fork (already highly unlikely). To that, add the following:\n- The minority chain will be sparse (predominantly empty slots), and an attacker can only cross-feed blocks that are *actually* proposed.\n- Beacon nodes representing large validator sets are likely to follow the fork in a timely manner given their stake. That leaves only a small set of laggers that may not update in time. These laggers are only relevant if they represent validators who are elected to propose before the minority fork dies.\n- As any laggers migrate over to the majority fork, the minority chain will become even sparser, offering fewer opportunities to cross-feed over time (reducing the impact of the repetitive element).\n- Even in the case of continuous cross-feed, CL clients limit their parent search until the finality checkpoint (or 32 in the case of Lighthouse), or until they encounter a block previously marked as bad (which would've been the attacker's last cross-fed block.) So the superfluous work that could hypothetically be triggered is well-bounded anyway.\n\nSo even if someone tries this, the impact would be immaterial, and any residiual impact would decay quickly IMO.\n\n**On the peer scoring front:**\nThe spec treats a block with an unknown parent as ValidationIgnore, which should not bump peer scores at the gossipsub level. Unless CLs are doing extra accounting that leads to a score boost in this case (would appreciate pointers), or are bumping scores on ValidationIgnore (would be a bug), it doesn't seem like the score would be affected.",
        "created_at": "2025-08-20T23:22:42.591000+00:00",
        "attachments": null
    }
]