[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\"32 in case of lighthouse\", can we confirm this \u003c@602753420033785856\u003e this sounds inherently dangerous so I suspect there's a misunderstanding here",
        "created_at": "2025-08-21T01:52:13.134000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Cross-layer",
        "parent": "",
        "content": "we switch to head sync/range sync after backtracking 32 is my understanding",
        "created_at": "2025-08-21T01:53:35.674000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Cross-layer",
        "parent": "",
        "content": "so not inherently unsafe",
        "created_at": "2025-08-21T01:53:39.443000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'll let someone who actually knows about sync weigh in if you want more detail (cc \u003c@491624610215886849\u003e )",
        "created_at": "2025-08-21T01:54:12.402000+00:00",
        "attachments": null
    },
    {
        "author": "raulvk",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@602753420033785856\u003e \u003c@491624610215886849\u003e wouldn’t it be more efficient to use the current finality checkpoint is as a lower bound? If the chain is finalizing, what’s the reason we’d want to recurse deeper than that?\n\nAnd under non-finality exceeding a depth 32, how does head/range sync behave? And is it safer than letting the search continue?",
        "created_at": "2025-08-21T08:41:27.862000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Oh so you do sync branches longer than 32 slots, just that you do it by requesting by range? What if these branches aren't canonical in any of your peers, but some do have them?",
        "created_at": "2025-08-21T09:28:09.018000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "There has been some more activity on EthMag regarding this topic as well:\n- https://ethereum-magicians.org/t/eip-7892-blob-parameter-only-hardforks/23018/7?u=etan-status\n- https://ethereum-magicians.org/t/eip-7892-blob-parameter-only-hardforks/23018/8?u=etan-status",
        "created_at": "2025-08-21T09:52:11.522000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e The minority chain will be sparse\nthe minority chain is initially not necessarily the one that upgraded. with 1/3 non-upgraded, it is unlikely but possible that the majority chain is initially on the non-upgraded partition\n\n\u003e Beacon nodes representing large validator sets are likely to follow the fork in a timely manner given their stake\nno, the canonical chain would be withheld from them, they are not necesarily subscribed to the correct gossip network",
        "created_at": "2025-08-21T09:57:49.348000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "also, I think when someone requests via req/resp, they can subsequently attest, but won't publish the block from the resp on gossip xD",
        "created_at": "2025-08-21T10:10:52.539000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "so to farm attestations from the other partition, one could publish an attestation from the other partition, wait for peers to req/resp the block, then collect their attestations (without the block ever hitting gossip on the primary partition), and include those attestation on the alternate partition",
        "created_at": "2025-08-21T10:12:11.071000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Cross-layer",
        "parent": "",
        "content": "one thing I don't understand about bpo: \"scale to meet demand\" - if that was the case, why wouldn't we just release the max-demand version at once? ie either we're confident about a change, _or_ it feels like waiting for the next hard fork _isn't that much of a deal because changing requires research_",
        "created_at": "2025-08-21T10:12:13.148000+00:00",
        "attachments": null
    },
    {
        "author": "raulvk",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e the minority chain is initially not necessarily the one that upgraded. with 1/3 non-upgraded, it is unlikely but possible that the majority chain is initially on the non-upgraded partition\ni.e. both partitions would share some portion of the chain immediately after the BPO epoch. i don't see why that is a practical problem? they will diverge:\n- quickly if baseFeeUpdateFraction is changed during the BPO [as \u003c@592004585506340885\u003e pointed out above], and\n- immediately as soon as a valid block with more blobs is proposed (if the blob limit goes up)",
        "created_at": "2025-08-21T10:12:55.264000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "not if the initial slots have proposers from the 1/3 minority...",
        "created_at": "2025-08-21T10:14:17.149000+00:00",
        "attachments": null
    },
    {
        "author": "raulvk",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e no, the canonical chain would be withheld from them, they are not necesarily subscribed to the correct gossip network\nwhat i'm saying is that it's reasonable for the purposes of this discussion to expect that stakeholders with large validator counts (e.g. pools) will be prepared to follow the BPO fork in a timely manner. do we have reason to believe otherwise?",
        "created_at": "2025-08-21T10:16:47.543000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "what is the targeted security level? 1/3 malicious is the one that ethereum usually operates on",
        "created_at": "2025-08-21T10:17:45.576000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "it doesn't matter if you correctly upgrade your pools, you won't see the other partition, and with a 1/3 minority it is possible that they get the initial couple slots and you won't see them",
        "created_at": "2025-08-21T10:18:16.062000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "so, let's say I control 1/3 minority, on the non-BPO partition. \nthen I identify who is attester for the initial 11 slots and send them my chain via req/resp during their slot so they attest to it.\nthen I include their attestations on the non-BPO chain and together with my own 1/3 I get justification, no? without any of the non-bpo blocks ever hitting gossip on the bpo topic.\nand then I stop revealing my blocks to the bpo chain, so have a withhold justification to reveal later",
        "created_at": "2025-08-21T10:19:39.286000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think the idea is that there is only so much confidence that we can get without testing on mainnet — so shipping incrementally, starting at much lower numbers allows us to safely gather information about how mainnet reacts",
        "created_at": "2025-08-21T10:20:08.519000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Cross-layer",
        "parent": "",
        "content": "because its a very hard problem to know how the entire networking stack + nodes running on mainnet will behave. Predicting it months in advance is even harder. So even if we test devnets (irrespective of size) with 72 blobs, it doesn't give us a 100% certainity mainnet will run at that throughput - it just gives us an educated max value. Additionally mainnet runs things like DVT, middlewares, varied types of networking equipment/hosts/orchestration tools - all adding subtle variations to the throughput. \n\nThe safe way to scale is to make changes, collect data and asses how the network reacted to the scale and to continue scaling. BPOs allow us to do this while maintaining the ability to cancel an upgrade.",
        "created_at": "2025-08-21T10:21:29.511000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Cross-layer",
        "parent": "",
        "content": "we won't know how mainnet reacts _under an attack_ until an attack happens",
        "created_at": "2025-08-21T10:21:32.383000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Cross-layer",
        "parent": "",
        "content": "you're collecting the metaphorical survivor data, introducing a bias into your conclusions",
        "created_at": "2025-08-21T10:22:32.486000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "The ability to \"cancel\" an upgrade isn't unique or unusual to BPOs. It's exactly as easy/hard to \"cancel\" a BPO as an ordinary hardfork",
        "created_at": "2025-08-21T10:22:42.143000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "This idea that BPOs can be \"canceled\" is part of the problem",
        "created_at": "2025-08-21T10:22:58.370000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Cross-layer",
        "parent": "",
        "content": "Why is it survivor data? missing data is also captured by the system. We can notice and calculate attestations arriving later or not arriving at all.",
        "created_at": "2025-08-21T10:23:14.121000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Cross-layer",
        "parent": "",
        "content": "because you're measuring the case where only benign acitivy is happening on mainnet - we maintain a safety margin for the purpose of withstanding _unusual or adverserial_ behaviors",
        "created_at": "2025-08-21T10:23:58.800000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Cross-layer",
        "parent": "",
        "content": "you're meauring the planes that  come back and strengthening the parts with holes in them",
        "created_at": "2025-08-21T10:24:24.462000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah of course, which is why we never run mainnet at the complete max of the system. We do the exact same thing with gas limits, there's engineering margins baked into this, known attacks give us more educated engineering margins.  You can run mainnet at 100M if you want, but you open yourself up to plenty of attacks - which is why we don't run mainnet at 100M.",
        "created_at": "2025-08-21T10:25:07.036000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Cross-layer",
        "parent": "",
        "content": "we also didn't change gas limits for .. 4-5 years? ie it's a lot of complexity for an adjustment that you'll do 2-3 times and then let it rest _most likely_ - ie even in the maximalist case that we aggressively adjust the limit, that's how many adjustments before it settles? the complexity however will stay forever",
        "created_at": "2025-08-21T10:28:13.263000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Cross-layer",
        "parent": "",
        "content": "BPO, whose premise relies on gathering data that is incomplete and biased at best, has a significant cost for everyone involved, including users that now have to pay attention much more often, further increasing the cost to be an operator and thus limiting who will _want_ to participate",
        "created_at": "2025-08-21T10:32:32.158000+00:00",
        "attachments": null
    },
    {
        "author": "raulvk",
        "category": "Cross-layer",
        "parent": "",
        "content": "it's pretty common in engineering and the software to roll out changes progressively when introducing architectural redesigns to critical systems. yes, you can spend months and months trying to increase confidence and attempt to perfectly capture all variables, only to discover that you missed a small case that ends up playing out in production. because er.... we're all humans. and you need to balance this pursuit of perfection against actually shipping something meaningful *in time*.\n\nnow, mapping this to PeerDAS and BPOs. PeerDAS is a massive architectural change from the p2p standpoint. we are testing every happy and unhappy scenario we can imagine (and everyone is welcome to contribute scenarios), but we'll never get to perfection in testnets to reproduce the *exact* p2p mainnet networking conditions so that everyone feels comfortable shipping with 48 or 72 blobs out of the gate.\n\nso from that standpoint, it's more practical to ship the redesign, keep the capacity equal, ensure all looks nominal, and increase the count incrementally. lather rinse repeat.",
        "created_at": "2025-08-21T10:33:33.547000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Cross-layer",
        "parent": "",
        "content": "sure, it's certainly nice to treat our validators as an on-call devops team that will be on standby for our live experiments 😉",
        "created_at": "2025-08-21T10:37:55.693000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Cross-layer",
        "parent": "",
        "content": "it's common when you have total control over the system indeed - it's .. less common in distributed systems to enforce coordinated upgrades on a frequent basis - instead, we tend to bear the cost on the development side since forcing everyone to participate is a major hassle",
        "created_at": "2025-08-21T10:39:46.090000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Cross-layer",
        "parent": "",
        "content": "but more than that, I suspect we won't be as happy with the measurements as you might think, for the bias reason, meaning that we can squeeze out a few percent here and there with quickly falling returns - that's what we're getting, in return for the cost",
        "created_at": "2025-08-21T10:40:59.426000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Cross-layer",
        "parent": "",
        "content": "To clarify, the plan was to ship multiple BPOs at once. i.e, Fusaka + BPO1 + BPO2 would be shipped in one release. The staged increase would give us a period of time between each activation to collect data. The first two increases are meant to be minor, so that we can validate: Fusaka as a fork and p2p changes, increase 1 and its effects, increase 2 and its effects. We then analyse everything and decide what the new headroom and margins are. We then decide how many BPOs to ship and what new ceiling we are comfortable with. \n\nTo me this is strictly better and requires less on-call devops work than shipping fusaka with a 2-3x blob increase without any real data. the chance of breaking mainnet and causing a ton of work to fix is is strictly higher in this approach.\n\nits the same number of upgrades required by the community, i.e: 1.",
        "created_at": "2025-08-21T10:42:23.029000+00:00",
        "attachments": null
    },
    {
        "author": "raulvk",
        "category": "Cross-layer",
        "parent": "",
        "content": "no one is imply using validators as a standby for live experiments; what we're saying is that there are variables we don't control and that we can't measure reliably in test environments. therefore, we prefer to adopt the safer approach of shipping the new \"foundations\" (PeerDAS), and _then_ gradually increasing capacity (via BPO) **because** we are confident about the next level.",
        "created_at": "2025-08-21T10:43:57.945000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e its the same number of upgrades required by the community, i.e: 1. \nin the happy case?",
        "created_at": "2025-08-21T10:46:18.311000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Cross-layer",
        "parent": "",
        "content": "Well if we have to abort a BPO due to mainnet being unable to have it, we atleast can. if we ship fusaka with a 3x increase and it breaks mainnet, we cant even abort anything to fix. so yes, it is less co-ordination.",
        "created_at": "2025-08-21T10:47:02.697000+00:00",
        "attachments": null
    },
    {
        "author": "raulvk",
        "category": "Cross-layer",
        "parent": "",
        "content": "anyway, can we continue discussing the BPO philosophy in a separate thread? it's kinda distracting us from assessing the security implications of rotating only fork_digest.",
        "created_at": "2025-08-21T10:47:12.171000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Cross-layer",
        "parent": "",
        "content": "thanks for the arguments, will consider",
        "created_at": "2025-08-21T10:47:36.148000+00:00",
        "attachments": null
    },
    {
        "author": "raulvk",
        "category": "Cross-layer",
        "parent": "",
        "content": "whether these clients attest to the 1/3 minority block depends on client behaviour. some clients wait until the 4s mark to release attestations (as of today), and they'll pick the heaviest chain. for them to pick your chain as heaviest, you would've had to repeatedly conduct the loop of harvesting 1/3 extra attestations from the majority partition (to sum to yours) to boost your chain's weight. all this while your majority chain is 2/3 empty, so you have less ability to actually sustain the heavier weight. and all of this is only possible until the base fee diverges or a block with a higher blob count (only allowed under the new BPO) appears. at that point the chains will split due to an EL rejection.",
        "created_at": "2025-08-21T10:59:08.953000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "every validator only attests once per epoch. so you only need to harvest 1/3 of 1/32 per slot.\nthe assumption here is that there is a 1/3 attacker, and that they get the required luck to have all the initial slots after a BPO activation. \n4s should be enough to send someone an attestation, have them req the block from you because they miss it, and send it to them so that they attest for it.\nas outlined in my ethmag post, if a lower security assumption is made during BPO activation, that could also be a resolution, it should just be known (the EIP does not list any security impact at all)",
        "created_at": "2025-08-21T12:01:12.108000+00:00",
        "attachments": null
    },
    {
        "author": "raulvk",
        "category": "Cross-layer",
        "parent": "",
        "content": "before we consider adding anything to the security considerations (i'm happy to, once we finish characterizing this), can we align on assumptions? i don't think the ones you list are complete. \n\nif the goal is to harvest attestations to justify a checkpoint on the minority chain, like i said above, you'd also need the chains to not diverge due to base fee and blob count during the epoch, which makes this even more implausible.\n\nalso, those 1/3 of 1/32 are not fungible, so you'd need to specifically target and mislead concrete attesters that are up for attester duty in every slot. it requires extensive planning and sophistication. we can dive into the exact p2p mechanics, but a priori it seems implausible (especially under the timing constraints).\n\nall this while you need to sustain the weight of the alternative chain over the majority chain. if you happen to be the proposer for the next 32 slots, yeah, sure, you can do that, as long as you produce post-BPO compliant blocks. at which point... do we really have a problem?",
        "created_at": "2025-08-21T12:16:55.132000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "32 slots of continuous proposer is not realistic with 1/3 but also not required. the first ~17 consecutive slots is theoretically possible, with enormous luck",
        "created_at": "2025-08-21T12:32:53.870000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "the problem happens when a justification happens that is only known to the non-BPO partition",
        "created_at": "2025-08-21T12:33:34.259000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e align on assumptions\nI'd propose 1/3 malicious, as that's the threshold used for fork choice security. but also, I'm not an expert on fork choice, maybe there are other factors in play.\nfor the libp2p stuff, I don't know how reliable IP addresses of nodes can be identified. it is known in advance who will attest during what slot though.",
        "created_at": "2025-08-21T12:36:18.561000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "if fusaka + bpo1 + bpo2 are shipped in one release, why is there any need for ForkDigest changes? \nthere is no fork at bpo1 / 2, anyone who installs fusaka is automatically on bpo1 and bpo2 as well.",
        "created_at": "2025-08-21T12:38:46.059000+00:00",
        "attachments": null
    },
    {
        "author": "raulvk",
        "category": "Cross-layer",
        "parent": "",
        "content": "Quick AI-assisted back of envelope math to characterize the assumption: the probability that a 1/3 attacker controls 17 proposers selected in a row out of 1MM is 7.74 × 10⁻⁹ (or about 1 in 129 million). And we speculated above with the level of sophistication and external preconditions needed to actually pull off any impact (if the black swan did ultimately happen) which further reduces/eliminates my residual concerns.",
        "created_at": "2025-08-21T12:58:41.247000+00:00",
        "attachments": null
    },
    {
        "author": "raulvk",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@881905303011086387\u003e does this line up with your views?",
        "created_at": "2025-08-21T13:15:40.391000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "yes, the ~17 slots in a row is based on that probability, as that's about the lowest one that is sometimes hit in practice in lotteries. I didn't use AI for that, though. there could be additional contributing factors, but I exclude randao manipulation as that would also mean controlling consecutive slots at the tail of the prior epoch. but I think if an attack is modeled it should be possible to pull it off throughout 17 slots to be feasible, anything more than that allows a second chain to emerge on the BPO partition (but many attesters will have already used up their vote by that time!)",
        "created_at": "2025-08-21T13:19:25.658000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "the process essentially being to define the worst case scenario, then try to prove if the system is safe in that scenario",
        "created_at": "2025-08-21T13:22:32.146000+00:00",
        "attachments": null
    },
    {
        "author": "raulvk",
        "category": "Cross-layer",
        "parent": "",
        "content": "Right. As a next course of action, I suggest that we draft an EIP update to mention the fork_version vs fork_digest tradeoff in the Rationale section, and then briefly touch on downstream Security Implications. Primarily to make sure the output from this analysis is well documented. That said, at this stage I don’t see this being a showstopper nor requiring design changes. WDYT, \u003c@881905303011086387\u003e?",
        "created_at": "2025-08-21T13:25:11.362000+00:00",
        "attachments": null
    },
    {
        "author": "ethdreamer",
        "category": "Cross-layer",
        "parent": "",
        "content": "At this point it feels like we're just playing around with an intellectual exercise than a realistic attack.",
        "created_at": "2025-08-21T13:27:14.174000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't believe that such an attack is likely, in current mainnet conditions (and also never claimed that it is). However, any impact on security should be researched (by the folks who know how to do these simulations / proofs properly!), and, as outlined in my ethmag post, I think if the end result is \"yes, it lowers the security during the fork transition, but data has shown that it is currently not a practical issue\", that's fine. It should just be documented as such.\n\nand the other question obviously still applies, whether the eip motivation actually makes sense:\n- if the BPO are scheduled together with fulu, there is noone who will be on the wrong partition, so we don't need to separate traffic there and can stay on a single network partition.\n- if raising blob target involves additional work in the CL rather than just typing in a new number, it is not a trivial fork to do and the arguments against full fork become weak.",
        "created_at": "2025-08-21T13:28:55.724000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "which is the entire point of looking into security, to mitigate in advance",
        "created_at": "2025-08-21T13:29:47.833000+00:00",
        "attachments": null
    },
    {
        "author": "ethdreamer",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm saying that if the odds are approaching 1 in 129 million.. and the attack can only occur from a sophisticated attacker during a limited window.. then we're being impractical to worry about this to the point of deep simulation investigation. The odds that we have critical consensus bugs in the clients *right now* are greater than 1 in 129 million and those could be exploited at any time.",
        "created_at": "2025-08-21T13:43:30.401000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "the odds that I mention are a suggestion for the bounds of an adverserial model. if the protocol can be proven to be safe under these assumptions, I think it's fine to accept it. I did not find any research on the security level that is still safe, maybe 10 slots are enough to break it? maybe 8 are? maybe a full epoch is needed?",
        "created_at": "2025-08-21T13:53:54.512000+00:00",
        "attachments": null
    },
    {
        "author": "ethdreamer",
        "category": "Cross-layer",
        "parent": "",
        "content": "wouldn't this also only be an attack if the BPO parameter moves *down*? The minority chain would use the old BPO limit. So if that limit is increasing, the attacker's chain is still an entirely valid chain after the fork.. in which case justifying the attacker's chain is fine..",
        "created_at": "2025-08-21T13:55:57.735000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "the problem is not the justification per se, it is that the peers on the other partition will not see that a justification took place",
        "created_at": "2025-08-21T13:56:36.494000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "if the BPO parameter moves down, and the old network still produces blocks with higher blob counts, the problem doesn't exist, as blocks from the old chain are not valid on the new network",
        "created_at": "2025-08-21T13:58:44.648000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I have a question about this issue. Is it fair to say that on a normal fork, peers on the updated chain will see some missing blocks from the not updated nodes but the chain will proceed as normal. \n\nIn a BPO scenario like described, is it fair to say that we can see an actual branch instead of missing blocks? Even if this branch is short lived, and assuming the above is true, do we want this on mainnet? We may see tooling failing or UX degradation by getting confirmations on the wrong branch, etc. Am I missing something obvious?",
        "created_at": "2025-08-21T15:52:35.793000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Cross-layer",
        "parent": "",
        "content": "on a _normal_ fork, a new signing domain is used, so any traffic from non-upgraded clients is invalid",
        "created_at": "2025-08-21T16:02:15.536000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes, that's why my phrasing above",
        "created_at": "2025-08-21T16:06:03.106000+00:00",
        "attachments": null
    },
    {
        "author": "pawandhananjay",
        "category": "Cross-layer",
        "parent": "",
        "content": "we don't recurse beyond the finalized checkpoint.  if we get a block that conflicts with finality, then we drop the chain. So its essentially min(finalized, current-32). The mechanism is mainly to protect from someone feeding us a bogus chain and waste resources on it. \nIf it goes beyond 32, we switch to range sync and feed everything to fork choice and let it figure out the canonical chain",
        "created_at": "2025-08-21T16:37:52.893000+00:00",
        "attachments": null
    }
]