[
  {
    "author": "zomboy",
    "category": "general",
    "parent": "",
    "content": "Hello everyone, you can call me Zomboy for now. I'm an academic researcher with a blockchain research group in The Netherlands, and I'm participating in research into legally-recognized DAO structures, models, technology, platforms - you name it. Our goal is to research and design a model for legally-recognized DAOs that are able to be registered with the government without needing to reveal the identity of contributors. \n\nThe European Commission is quite aware of the \"threat\" that DeFi and DAOs pose to the status quo of business operations and the broader digital economy, but are investigating options for a \"light touch\" in terms of allowing anonymity and decentralization while still adhering to the rule of law. That's where I come in.\n\nI am a computer scientist with a background in cybersecurity and data privacy (as well as blockchain engineering) looking to create a proof of concept for an anonymous investment DAO that is legally registered with the chamber of commerce and has a legal tax ID, such that the government doesn't need to worry about tax avoidance (a big fear of theirs) without stifling innovation (something the EC is trying to contrast with the US/China). We are operating under several government grants and have the sanction/blessing of the Dutch government to develop as we please, so long as our research is made public. We're hoping this is a big first step towards the legal recognition of (hopefully anonymous) DAOs in the EU and EEA.\n\nAnyways, that's my introduction. I'll be perusing the discord to see what everyone is up to, and hopefully I can find a place here to ask questions and learn about what everyone is working on, while sharing some of my work as it develops.\n\nCheers!",
    "created_at": "2021-09-30T13:12:44.527000+00:00",
    "attachments": null
  },
  {
    "author": "adamavfc",
    "category": "general",
    "parent": "",
    "content": "Hi everyone!\n\nI've been involved in crypto since 2014 in terms of investing. However, only yesterday I started thinking about writing some code to help with some of my defi yield stuff and i'm loving it. It makes me even more bullish for the whole space that from my laptop I can put something out there to the world! So powerful.\n\nKeen to get involved and help out where possible 🙂\n\nThanks",
    "created_at": "2021-09-30T20:15:03.155000+00:00",
    "attachments": null
  }
]