[
    {
        "author": "ladyleatherman",
        "category": "general",
        "parent": "",
        "content": "Hey folx— I compulsively count colors, enjoy patterns, and am trying to get as much knowledge as possible to not only understand cryptocurrency better, but how to be more savvy in an eco-friendly fashion.  🤷‍♀️  I will fully admit I’m intimidated by some of your amazing credentials.",
        "created_at": "2021-05-20T01:34:23.535000+00:00",
        "attachments": []
    },
    {
        "author": "zc4str0",
        "category": "general",
        "parent": "",
        "content": "omg I found a discord full of nerds",
        "created_at": "2021-05-20T13:14:01.429000+00:00",
        "attachments": []
    },
    {
        "author": "zc4str0",
        "category": "general",
        "parent": "",
        "content": "Hello folks! I'm a young nerdy guy from brazil who struggle to learn things alone on internet since I remember myself as a person",
        "created_at": "2021-05-20T13:14:37.298000+00:00",
        "attachments": []
    },
    {
        "author": "zc4str0",
        "category": "general",
        "parent": "",
        "content": "Since I don't have much access to formal education, I just try to huebr around on internet, here in my country blockchain is treated like something from another world, so I hope I can connect with experienced people to learn anything",
        "created_at": "2021-05-20T13:15:53.663000+00:00",
        "attachments": []
    },
    {
        "author": "zc4str0",
        "category": "general",
        "parent": "",
        "content": "My english is not perfect, but i'm still learning too. If you feel like you want to talk, please contact me, I would like to talk too",
        "created_at": "2021-05-20T13:16:23.371000+00:00",
        "attachments": []
    },
    {
        "author": "zc4str0",
        "category": "general",
        "parent": "",
        "content": "I have 22 years old, I'm very curious person and I am always interesting on some topic about technology. I'm still very very beginner on blockchain/Ethereum topics, but I'm not afraid to learn everyday! Now the current question I struggle to understand is: \"What still needs to be improved to Ethereum become a world widely-used platform?\" and \"Why no one uses it if is it so disruptive? What still needs to be done?\"\n\nI would love to talk with anyone about those topics, please don't be shy!",
        "created_at": "2021-05-20T13:22:01.337000+00:00",
        "attachments": []
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "\u003e Why no one uses it if is it so disruptive?\n\nstill early, and a lot of work to do! we'll get there tho 🙂",
        "created_at": "2021-05-20T14:05:30.468000+00:00",
        "attachments": []
    }
]