[
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "but the fed reserve comment also makes sense. ETH issuance is centrally planned to meet certain goals, it's not left to the free market or chance - like how whoever digs oil gets to keep it.",
        "created_at": "2021-09-21T09:19:13.271000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "(before I'm hanged for saying \"centrally planned\" - on paper Fed should respect citizens wishes via democratic structure and ACD should respect ethereum users wishes via rough governance - in practice ofc its all debatable.)",
        "created_at": "2021-09-21T09:22:13.038000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "ETH is also closer to a fiat currency than oil in the sense that it primarily derives its value not from utility but from a community of believers in its value.",
        "created_at": "2021-09-21T09:24:47.748000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "\u003e free market or chance\nOPEC?",
        "created_at": "2021-09-21T12:37:28.041000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "I'd say that has become less and less true over time. To arbitrage/trade and make money you need to spend gas. You'll only do traders where you earn more than you spend. But they also means that if the price drops more opportunities open up, driving up demand for gas. Certainly feels like a commodity to me.\nAnd it's not like there aren't commodities whose value is mostly based on speculation, gold comes to mind. And lately also some stocks really can't be classified as typical \"growth or value\" anymore. Not a trait beholden to (debt-based) currencies I would say",
        "created_at": "2021-09-21T12:44:51.981000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "valid. still diff imo cause thats more emergent behaviour on top of an otherwise free market. versus a system where issuance (of $$ or ETH) isnt really left to the market in the first place.\n(ok fine there's lots of caveats here but still)",
        "created_at": "2021-09-21T13:11:03.759000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "except all that demand to trade is contingent on ETH having value in the first place. i'm not yet convinced DeFi has invented a perpetual motion machine where ETH derives its value primarily from fees off people who want to trade ETH. ETH also needs other sources of demand for this to be stable, so a community of holders",
        "created_at": "2021-09-21T13:15:32.260000+00:00",
        "attachments": null
    },
    {
        "author": "ghosts_in_the_code",
        "category": "general",
        "parent": "",
        "content": "i agree that its not a trait for just fiat currencies",
        "created_at": "2021-09-21T13:20:53.519000+00:00",
        "attachments": null
    }
]