[
    {
        "author": "protolambda",
        "category": "general",
        "parent": "",
        "content": "For that new user sharing a weird link that promises eth, asking if it's a scam: of course it is! There's no such thing as free money. I'm banning the next person who even posts such thing out of precaution, don't accidentally (or intentionally) bait more people in your scam, wtf.",
        "created_at": "2021-05-18T12:41:37.353000+00:00",
        "attachments": []
    },
    {
        "author": ".mindey",
        "category": "general",
        "parent": "",
        "content": "Hello, everyone, my name is Mindey, and I'm just a curious random process that wants to explore and optimize all universes ☆ (originally got to know about b-money in 2007, on weidai.com, searching Google for answer to Q: \"How to create a universe, where everything could exist?\", as he's got a mailing list on similar topic), and I've contributed to original genesis sale, because I liked Gavin's paper. However, I have lost access to my `3325.11 ETH` from that sale, that I bought on `ethereum.org` website, and here is the issue on the website's repo (https://github.com/ethereum/ethereum-org-website/issues/3069). Given that Ethereum was developed as a really flexible system, I'm looking for a way to create oracles-based smart contract for the recovery based on facts that remained in various other systems and databases to construct a proof beyond reasonable doubt, because I still have private key of the Bitcoin address that I used to credit my account on Cryptsy.com, from which I made the contributions, and I still have its user password, still have Gmail account that I got confirmation e-mails from ethereum.org, and still got those memories in my neurons as well. This experience made me think, how human != private key, and come up with the idea of CRISPR-Hash Pills (CRISPR-hash pill ( https://0oo.li/event/23/hash-pill )), that would deterministically tie identity with one's unique biological processes. While not a thing that could solve my problem, but a thing that could prevent future problems like mine. There is a saying: records matter scientifically, even if they are not on any blockchain -- records on various databases, records on people's minds, etc., they can be difference between life and death (as described in this video https://youtu.be/iVrQqWIs6ZE ). And it seems it is my case here too, because I've contributed, but I'm left with nothing.\n\nWhat is the best channel to discuss the idea of _Smart Contract for Recovery of Genesis Ether Sold On Etherum.org_?",
        "created_at": "2021-05-18T13:53:47.832000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I would suggest opening a post on ethereum-magicians.org for this 👍",
        "created_at": "2021-05-18T14:32:20.472000+00:00",
        "attachments": []
    },
    {
        "author": ".mindey",
        "category": "general",
        "parent": "",
        "content": "Will try to! :) Thanks for the tip \u003c@!552133098075193354\u003e .",
        "created_at": "2021-05-18T14:48:18.697000+00:00",
        "attachments": []
    },
    {
        "author": ".mindey",
        "category": "general",
        "parent": "",
        "content": "\u003c@456226577798135808\u003e I hope so, and \u003c@!552133098075193354\u003e , I've posted it on Ethereum-Magicians (topic: https://ethereum-magicians.org/t/ethereum-org-genesis-ether-recovery-smart-contracts-based-on-oracles-for-identity-proving/6270/), and got to know that community is not ready for it yet: there is _EIP-867 (Standardized Ethereum Recovery Proposals)_, but as \u003c@!221567393539817472\u003e said, _\"There is no desire to introduce a mechanism into the protocol that allows for stuck funds to be recovered. \"_ :( It may look negligible to the community in the grand scheme of things, because such cases are few, but perhaps, once identity-based recovery becomes a standard practice, this issue will be revisited? After all, physical human != ether private key...",
        "created_at": "2021-05-18T21:24:36.876000+00:00",
        "attachments": []
    }
]