[
    {
        "author": "mattdesl",
        "category": "general",
        "parent": "",
        "content": "Hey all! Artist/coder here, keen to see how Eth2 shapes up and what dev/R\u0026D opportunities might apply to future crypto art space. 👋",
        "created_at": "2021-04-24T09:34:06.126000+00:00",
        "attachments": null
    },
    {
        "author": "fluffy__cat",
        "category": "general",
        "parent": "",
        "content": "Greetings everyone. Not sure if this is the best place to ask: I'm interested in contributing to the development and accelerated adoption of social recovery wallets similar to what Vitalik outlined here ( https://vitalik.ca/general/2021/01/11/recovery.html ). I see some already exist on Loopring and Argent, but am interested in contributing to an open source alternative with no additional fees.  If there's already a project along these lines, happy to contribute to it. If not, considering kicking one off.  Haven't learned Solidity yet, but am a full stack developer comfortable with Python, Go, Java, JS, etc.; I've developed similarly complex projects in the past and have several design ideas to increase adoption of social recovery wallets I'd like to contribute.  If similar projects already exist happy to help out in whatever capacity would be most beneficial (another set of eyes auditing code; UX prototypes, etc.)",
        "created_at": "2021-04-24T18:28:44.647000+00:00",
        "attachments": null
    },
    {
        "author": "fluffy__cat",
        "category": "general",
        "parent": "",
        "content": "Related: Is the prerequisite infrastructure ready for a project like this? In a recent podcast Vitalik explained this functionality will primarily operate in layer 2. It looks like Loopring uses their own layer 2 zkRollup implementation. The concept of a social recovery wallet seems simple enough to design and implement, but if doing so today requires further engineering of L2 protocols, it's probably too much for me to attempt as a solo volunteer. I can move this to \u003c#595721451651465227\u003e if that'd be better.",
        "created_at": "2021-04-24T18:47:36.392000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "general",
        "parent": "",
        "content": "\u003c@!167489045436432386\u003e you can probably find good discussions about EIP 3074 (for some kind of account abstraction to improve such wallet UX) in this server, but we are not focused on GUI or Dapp type of applications much here, so for that part you may want to try another server (ethglobal discord maybe? They have a month long hackathon where you can probably find help to build this)",
        "created_at": "2021-04-24T18:58:34.097000+00:00",
        "attachments": null
    },
    {
        "author": "fluffy__cat",
        "category": "general",
        "parent": "",
        "content": "\u003c@!203220829473996800\u003e  Thanks! I'll review EIP3074 and see if I can find collaborators in ethglobal.",
        "created_at": "2021-04-24T19:01:24.016000+00:00",
        "attachments": null
    }
]