[
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@425279588009246720\u003e or \u003c@427903869226582018\u003e  when you have the time, I had some questions after reading the eip :\n\n- What were the current blockers with evmmax?\n\n-  Is there somewhere I can read to see what gas pricing would roughly look like for something like the bls precompiles with evmmax?\n\n- EIP says \"Gas models assume a rate of 1 gas per 25ns of execution time.\" -- I don't think 25ns makes sense since there is no standardized hardware for gas costs. Can this not be measured based off of the price of another instruction?\n\n- Since these are instructions for the modular arithmetic and not curve operations, what would be the plan to re-deploy the bls12/bn254 precompiles in client software?\n\nOne concern I have here, is that if it is contract bytecode, then it would need to be the same across all clients, which seems like a net negative from what we have now where different people(gnark, blst and cloudflare) have implemented the precompiles in different ways and they have been independently refactored/optimized over time without needing all clients to agree. \n\n- Was there consideration to allow something like : `addN(modulus, [n1, n2, n3], [n4, n5, n6])` This would just return `[n1 + n4, n2+n5, n3+n6]` -- This could initially be priced the same as doing 3 separate additions with the same precompile. \n\n- Out of curiosity, what was the rationale for not including something like INVMODX?\n\n- I'm not sure I understand the memory model -- can you say when I would need to call STOREX/LOADX? \n\nI'm thinking of the case where I have a point which is two integers (x,y) and I want to do a scalar mul, then perhaps put the result into an array in my function, then do another scalar mul -- Ideally this never takes my point out of the montgomery domain",
        "created_at": "2024-10-28T20:45:43.186000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "-----------------------------------------------------------\n\nOn numbers for the bls precompile, just to get a rough idea of the savings if any for the two basic bls12-381 opcodes assuming the gas cost model:\n\nIf we say that 1 gas per 25ns on some hardware is a reasonable benchmark.\n\nThen we say that a field multiplication costs 25ns for bls12-381. (I think the average might be closer to 40-50ns when considering devices on the lower end of the spectrum)\n\nThen we say a group addition costs roughly 20 field multiplications -- I just rounded up the numbers from: https://hyperelliptic.org/EFD/g1p/auto-shortw-jacobian-3.html#addition-add-2007-bl\n\nThen a G1Add would cost 20 gas. In the 2537 EIP, it currently costs 500, so I think something is off here.\n\nFor scalar mul, assuming GLV with double and add. The scalar length due to GLV would be 128 bits, so there are 128 group doublings, and on average 64 additions. So thats 192 group additions, which would cost 3840 gas. \n\nWe also need to do a subgroup check here, which boils down to doing 2 scalar multiplications with a 64 bit integer that has hamming weight 6. This means we are doing 128 doublings and 12 additions, which is roughly 140 group additions, so that would cost 2800 gas. In total G1Mul would cost 6640 Gas. Compared to 2537 which has it at 12,000 GAS",
        "created_at": "2024-10-28T21:17:51.454000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "For completeness; If we use Mamy's suggested repricing, then G1Add is still better with EVMMAX, but slower for G1MUL.\n\nI think it might make sense to wait for the bls12-381 precompile gas price to ossify, though I think in either case it would be surprising to me if we conclude that G1Add for EVMMAX should cost less than 100 GAS for example",
        "created_at": "2024-10-28T21:46:16.533000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "Screenshot_2024-10-28_at_21.22.20.png",
                "content": "6fa560c0352c5fa4adce907bc76a0f8968860cd0fc2a3f653d8d88d9b39d9400"
            }
        ]
    }
]