[
  {
    "author": "taulepton_",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "Nice! By the way, one complication with compression is that most zstd libraries do not support `no_std` and as such can not be operated in zkVMs. This is problematic if we want to charge for the transaction based on its compressed size rather than its raw size. Additionally, many compression algorithms are not deterministic, so you will have different outputs for the same input. There are solutions for both of these issues, but I just wanted to share that context so that we can consider it in protocol design.",
    "created_at": "2026-02-02T08:11:01.482000+00:00",
    "attachments": []
  },
  {
    "author": "taulepton_",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "Very interesting that encode and decode with zstd_3 are actually faster compared to no compression",
    "created_at": "2026-02-02T08:12:41.142000+00:00",
    "attachments": []
  },
  {
    "author": "jih2nn",
    "category": "Cross-layer",
    "parent": "l1-zkevm-protocol",
    "content": "This is great! Here is my two cents:\n\n- RLP gave us slightly better results than SSZ, but this shouldn't be a stopper for SSZ adoption, if any.\n- Although it is rare, `bitpack_254` led us to smaller blobs than `naive_31`. `bitpack_254` took nearly 6 times more for decoding, which is roughly 6 milliseconds per blob. I don't think `bitpack_254` introduces lots of complexity and there is no reason to have a chance to waste network bandwidth occasionally.\n- Given that different language with different implementation could yield different result, I think we don't have to settle in concrete strategies today.\n- With current gas limit (60M), there are 1-2 payload blobs per block, and current target blob is 14. Let's see how this changes by the time BiB could be shipped.\n- I've noticed that the data used is `execution_payload` not `transactions`, but it shouldn't matter much.\n- Hope we don't try to invent a new compression algorithm? ethzip? LOL",
    "created_at": "2026-02-02T09:40:19.173000+00:00",
    "attachments": []
  }
]