[
    {
        "author": "lmat1",
        "category": "general",
        "parent": "",
        "content": "I'm learning about Eth2 and have some questions. From some that I've read, it seems that smart contract (computation) support is a pretty low priority. There is talk of having no computation shards or perhaps 6 of the 64 shards are capable of computing, etc. In my brief experience with Ethereum, smart contract execution is the bread and butter of the protocol. For instance, gas usage for smart contract execution vs gas usage for \"simple\" eth transfers aren't even comparable, right? What am I missing?",
        "created_at": "2020-12-15T21:56:02.897000+00:00",
        "attachments": null
    },
    {
        "author": "lmat1",
        "category": "general",
        "parent": "",
        "content": "I hope this is the best channel for this sort of channel. If not, please let me know where I should be. Thank you!",
        "created_at": "2020-12-15T22:02:46.975000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "i would not say it is a \"low priority\"",
        "created_at": "2020-12-15T22:57:48.847000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "i think our understanding of how we will scale on-chain computation has evolved over the last 2-3 years w/ lots of research and development",
        "created_at": "2020-12-15T22:58:17.099000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "the most promising direction i currently see is the \"executable beacon chain\" proposal: https://ethresear.ch/t/executable-beacon-chain/8271",
        "created_at": "2020-12-15T22:58:53.385000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "in this setting, the \"shards\" from the sharded eth2 are primarily used to hold data for roll-ups",
        "created_at": "2020-12-15T22:59:22.885000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "and the minimum amount of computation required to advance the on-chain state of the roll-ups is performed by all clients of the beacon chain",
        "created_at": "2020-12-15T23:00:14.585000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "along side this is the work in-progress to merge eth1 into eth2 -- a very straightforward path is to just drop the eth1 state \"into\" the beacon chain and then proceed as usual",
        "created_at": "2020-12-15T23:02:42.286000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "and then the shards are still available as a \"data layer\" for all of today's dapps",
        "created_at": "2020-12-15T23:03:08.841000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "from there, we can consider extending how much base layer computation is under consensus by bringing more shards online as \"computation shards\" but we may not need to",
        "created_at": "2020-12-15T23:03:47.675000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "L1 sharded computation seems to introduce a bunch of base layer complexity that we are better off not bringing under the core consensus if we can get away with it (bc then we will only need consensus over a \"simpler\" thing... and the easier we can make our collective jobs on this the better)",
        "created_at": "2020-12-15T23:04:56.536000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "\u003e gas usage for smart contract execution vs gas usage for \"simple\" eth transfers aren't even comparable, right\none can be much higher than the other (e.g. 1.2million gas vs 21000) -- but ultimately every transaction on ethereum today just consumes a given amount of gas proportional to the resources it consumes",
        "created_at": "2020-12-15T23:09:01.938000+00:00",
        "attachments": null
    }
]