[
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "Makes sense. Is that linearity undesirable somehow however?",
        "created_at": "2021-06-14T00:51:23.388000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "general",
        "parent": "",
        "content": "Hmm, I don't think G2 points are used for commitments. The hash function is not that important IIUC because you always reduce to a field, so you could use sha512 and then reduce for example, instead of sha256",
        "created_at": "2021-06-14T09:47:32.876000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "general",
        "parent": "",
        "content": "I don't think it is undesirable, but because polynomials are over fields, you need to convert the commitment to a field which can be done using `hash_to_field(bytes : Vec\u003cu8\u003e) -\u003e Field`",
        "created_at": "2021-06-14T09:48:51.495000+00:00",
        "attachments": []
    },
    {
        "author": "mrsometwo",
        "category": "general",
        "parent": "",
        "content": "I'm confused. Why is chosen to make withdrawals only possible after the merge instead of directly accepting withdrawals towards other ETH2 addresses? Also, is there anywhere a roadmap with approximate dates towards withdrawals or next phases?",
        "created_at": "2021-06-14T14:10:33.220000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "There is no such thing as ETH2 addresses, so I'm not quite sure what it is you are referring to. There is no approximate dates roadmap, best is to just lurk here from time to time to see what the progress / rough consensus is among client teams.",
        "created_at": "2021-06-14T18:17:15.142000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Hi! I hope this is the right channel, anyway I'm new to Ethereum and I was wondering.... What's the point of publishing a contract on Swarm ? I can't find anything in the docs",
        "created_at": "2021-06-14T21:12:41.246000+00:00",
        "attachments": []
    }
]