[
    {
        "author": "evanvanness",
        "category": "general",
        "parent": "",
        "content": "It's hard for me to consider your idea without prejudice when you sum up the Ethereum community's opposition to onchain governance with \"i know Vitalik has spoken negatively....\"",
        "created_at": "2021-03-14T02:09:39.436000+00:00",
        "attachments": []
    },
    {
        "author": "fliguy.eth",
        "category": "general",
        "parent": "",
        "content": "its because that is what is put out by other alt coins and bitcoin maximilists, that Vitalik makes the decisions and everyone follows, even though this is not the case,  its the perception, recently Dan Held put out a video saying this was the difference between Bitcoin and Ethereum.",
        "created_at": "2021-03-14T02:15:32.021000+00:00",
        "attachments": []
    },
    {
        "author": "evanvanness",
        "category": "general",
        "parent": "",
        "content": "Solution: don't listen to those who spread misinformation",
        "created_at": "2021-03-14T02:41:11.187000+00:00",
        "attachments": []
    },
    {
        "author": "paperliss",
        "category": "general",
        "parent": "",
        "content": "I don't feel like I did that. I addressed the con's listed on the document I linked to. Regardless I will do more research on the issue. If I am misunderstanding the arguments surrounding this issue, please feel free to direct me to some resources where I can further educate myself",
        "created_at": "2021-03-14T03:35:39.384000+00:00",
        "attachments": []
    },
    {
        "author": "paperliss",
        "category": "general",
        "parent": "",
        "content": "Also, it probability was a mistake bringing up Vitalik in my post. I'm fully aware he doesn't have the power over the Ethereum network that bitcoin maximalists think he does. I posted this to point out that on-chain governance could be the solution to some of the technical issues surrounding the merge, but then it kind of turned into a rant about on-chain governance more generally.",
        "created_at": "2021-03-14T03:48:55.387000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "There is no functional off chain governance in Ethereum either.  Client developers write code.  Users choose whether to run the code or not.",
        "created_at": "2021-03-14T03:55:43.753000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The value of ETH is an indicator of Ethereum's long term value proposition and doesn't drive decisions.",
        "created_at": "2021-03-14T03:56:26.719000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It is possible that the right decisions for Ethereum include some that decrease the value of ETH, and that is okay if it means Ethereum is more successful (fulfills the needs of users better) long term.",
        "created_at": "2021-03-14T03:57:49.318000+00:00",
        "attachments": []
    },
    {
        "author": "paperliss",
        "category": "general",
        "parent": "",
        "content": "I have taken the time to read https://medium.com/@Vlad_Zamfir/against-on-chain-governance-a4ceacd040ca and https://vitalik.ca/general/2017/12/17/voting.html and I have changed my mind about on-chain governance in general, but I'm still willing to stand by a more watered-down version of the point I was trying to make. An on-chain vote could be helpful to validate the state of eth1 on eth2 at the point of the merge if no other solution is found.",
        "created_at": "2021-03-14T07:36:22.148000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "There is already a voting process in the beacon chain to agree on the eth1 chain to recognise.  I wouldn't call that on-chain governance, that's just cross chain consensus - same as both eth1 and eth2 have technical means to reach consensus on the canonical chain.",
        "created_at": "2021-03-14T07:38:18.423000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Specifically, it works reasonably well when it doesn't really matter what choice is made, only that everyone agrees.",
        "created_at": "2021-03-14T07:38:56.493000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Such as when deciding which block is head, given two competing head blocks, it is most important that we choose one of them (and quickly) and less important *which one* is chosen.",
        "created_at": "2021-03-14T07:39:28.390000+00:00",
        "attachments": []
    }
]