[
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Hello! \nI have been wondering, does anyone here know how to make a function in an erc20 contract to take 1% from each buy and sell and send it to a designated wallet?\nPlease and Thank you",
        "created_at": "2021-06-12T09:56:01.623000+00:00",
        "attachments": []
    },
    {
        "author": "joshuaisbuilding",
        "category": "general",
        "parent": "",
        "content": "Does anyone have any information  on what will happen to the existing testnets after the merge?",
        "created_at": "2021-06-12T11:53:34.777000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "It hasn’t been decided yet \u003c@643099918998831144\u003e but I suspect like for current upgrades, we’ll likely run the merge on one of the existing testnets before mainnet",
        "created_at": "2021-06-12T15:51:03.119000+00:00",
        "attachments": []
    },
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "Hey everyone, I had a few questions regarding verkle trees. I figured this would be a better place than \u003c#824798757618188339\u003e to ask, but let me know if I'm wrong.\n\n1) As far as I understand, the inner nodes in the tree are being labelled with the hash of a Kate vector commitment for its children. I'm not sure I understand why this needs to be a hash and not the commitment directly. Any reason? We still need to know the unhashed commitment in order to evaluate the Kate proofs, right?\n\n2) This article seems to propose a branching factor of 2^10 (1024) in the verkle tree. Isn't that huge? (each nodes needs to occupy \u003e 1024*X bytes of memory). Is this to guard against \"attacks\" on the verkle tree, by keeping the average depth very small?\n\n3) What exactly are these attacks against the verkle tree? To which tries do they apply? How bad are they, even in the worst case, with the maximum number of collisions?\n\nHere are some notes I took on verkle trees, if additional context is needed to understand the questions: https://www.notion.so/Stage-0-Discovery-dcbb7318ba664687ba83adca727ff283#1323d81058d64e10944e47e48d1599b9",
        "created_at": "2021-06-12T22:34:25.514000+00:00",
        "attachments": []
    }
]