[
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "i see. thank you. this might not be possible, but what if i created my own wallet, and sent a transaction with nonce 3, skipping 1 and 2. Then I generated thousands of transactions, with nonces 3, 4, 5, 6,...etc. and sent them to the network. Based on my understanding of nonces, they are not part of account state and are generated dynamically and keep track of an accounts confirmed txs. Also, they establish an order to transactions, in that if nonce n-1 is not confirmed, then tx with nonce n will not be. so since i didn't create tx with nonce 1 and 2, then will these just sit in the network and take up resources?",
        "created_at": "2021-07-01T01:19:18.123000+00:00",
        "attachments": []
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "wait the above is flawed cuz wallets don't decide nonces, its calculated dynamically by clients counting the number of confirmed tx from an account",
        "created_at": "2021-07-01T01:19:56.995000+00:00",
        "attachments": []
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "wait so what if i sent a tx with 0 gas price, and this will probably not be included in a block for awhile (idk how long). then i spammed a few thousand transactions, all with 0 gas. they would just sit in the miners tx pools, right? is there some way to mitigate this, perhaps clients have some rule to drop tx after some time?",
        "created_at": "2021-07-01T01:21:35.851000+00:00",
        "attachments": []
    },
    {
        "author": "chopsueyiscool",
        "category": "general",
        "parent": "",
        "content": "So this is the \"main\" eth discord right?",
        "created_at": "2021-07-01T02:54:59.654000+00:00",
        "attachments": []
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "there might be others. but yes, this is the main research discord",
        "created_at": "2021-07-01T04:05:54.732000+00:00",
        "attachments": []
    },
    {
        "author": "pelumi.",
        "category": "general",
        "parent": "",
        "content": "Sad i missed this...is it still on? and how can I participate?",
        "created_at": "2021-07-01T06:59:42.900000+00:00",
        "attachments": []
    }
]