[
    {
        "author": "mohamed.mansour",
        "category": "general",
        "parent": "",
        "content": "When you mean bundled into one, does that mean it is represented as a merkle tree? Or just the merkle root is persisted on mainnet? Rollups just verify that root?",
        "created_at": "2021-05-27T00:02:21.522000+00:00",
        "attachments": null
    },
    {
        "author": "mohamed.mansour",
        "category": "general",
        "parent": "",
        "content": "I have read some dev doc for eth2 light clients, where they use zk proofs to verify that lyou just need a few leaf nodes in a merkle tree to compute the root. That seems like magic",
        "created_at": "2021-05-27T00:04:05.640000+00:00",
        "attachments": null
    },
    {
        "author": "timhc22",
        "category": "general",
        "parent": "",
        "content": "it is a really excellent question \u003c@!147269256042643456\u003e , I'm also trying to get my head around how this all works. I initially thought that when data is 'rolled up', it can't be unwrapped to get the original data, but I'm not not sure I was correct in thinking that..\n\nI'd be really interested in validating my own understanding on this, especially in regards to: \"Can a solution which uses rollups, be used to recreate a list of all transactions again (in human readable form), so that they can be replayed from the start to the finish in order to get the current state?\"",
        "created_at": "2021-05-27T00:56:08.126000+00:00",
        "attachments": null
    },
    {
        "author": "timhc22",
        "category": "general",
        "parent": "",
        "content": "someone said I should read this: https://vitalik.ca/general/2021/01/05/rollup.html, I've tried, but I'm not quite as smart as Vitalik just yet 😉 (and never will be I'm sure: I can only speak 3 languages, and not perfectly haha)",
        "created_at": "2021-05-27T00:57:07.325000+00:00",
        "attachments": null
    },
    {
        "author": "mohamed.mansour",
        "category": "general",
        "parent": "",
        "content": "Aha thanks \u003c@!597792256837156971\u003e https://vitalik.ca/general/2021/01/05/rollup.html#ok-so-how-exactly-does-a-rollup-work the contract in a rollup has just one variable, the state root, the L2 chain has all transactions. To verify, they use fraud proofs or zk-snark. I am going to dig deeper in this",
        "created_at": "2021-05-27T01:32:48+00:00",
        "attachments": null
    },
    {
        "author": "marcel1no",
        "category": "general",
        "parent": "",
        "content": "someone willing to shed some light on the idea of dapps to a blockchain newbie in the voice channel? 👀",
        "created_at": "2021-05-27T08:37:48.544000+00:00",
        "attachments": null
    },
    {
        "author": "ganant_",
        "category": "general",
        "parent": "",
        "content": "Hi,\n\nI have been reading up for the past day and have a sufficient understanding of Merkle Patricia Tries and RLP encoding and verifying Merkle proofs in Solidity (https://github.com/lorenzb/proveth).\n\nI am planning to create a contract on one block chain which gets a state root from another blockchain (this part is done) and then an account can submit a Merkle proof to show that some state existed within a certain contract given that state root. I'm getting stuck and can't seem to find any good resources for how to create such a proof and just how state roots are determined in general.\n\nAny help is appreciated 🙂\n\nThanks.",
        "created_at": "2021-05-27T23:56:02.543000+00:00",
        "attachments": null
    }
]