[
    {
        "author": "colin1509x3305",
        "category": "general",
        "parent": "",
        "content": "Hello, sorry to ask one question. I came across this sentence \"when you run a full node on Bitcoin, you can sync all the way from the genesis block (first block ever mined) to today's latest transaction. With Ethereum, you can only sync up to the latest three months. So if you've been disconnected from the Ethereum network for more than three months, the only way to sync up is to ask a few semi-trusted sources what the current state is and accept it as an assumption.\" Is this statement \"with Ethereum, you can only sync up to the latest three months\" correct? I thought when a new node comes into Ethereum network, it can sync from the genesis block to the latest block.",
        "created_at": "2021-05-14T07:00:53.205000+00:00",
        "attachments": null
    },
    {
        "author": "colin1509x3305",
        "category": "general",
        "parent": "",
        "content": "Source: the last paragraph from this article https://michaelmcguiness.com/essays/why-eth-will-win-store-of-value",
        "created_at": "2021-05-14T07:03:19.300000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "It can, source is wrong.",
        "created_at": "2021-05-14T07:57:09.855000+00:00",
        "attachments": null
    },
    {
        "author": "colin1509x3305",
        "category": "general",
        "parent": "",
        "content": "Thanks \u003c@!301186049323958275\u003e how about Eth2 nodes?",
        "created_at": "2021-05-14T09:57:01.171000+00:00",
        "attachments": null
    },
    {
        "author": "colin1509x3305",
        "category": "general",
        "parent": "",
        "content": "And the author thanks Justin Drake (Eth2 researcher) for \"reading the draft of this article\" 😅 So I'm curious about the correctness of this part.",
        "created_at": "2021-05-14T10:20:16.597000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "They're probably referring to the weak subjectivity period (/long range attacks) . Also, having been offline for more than 3 months on Bitcoin in the past (a looong time ago), I very much still needed to ask a semi-trusted source (or multiple, if you include block explorers) for whatever the latest version of the Bitcoin client/protocol was. That is why I think it doesn't really matter overall.\n\nSo I would say that, yes, you can sync from genesis for both protocols. Assuming will never be any upgrades to the protocol and you never have to update you client _ever_, you could argue that that is more secure against long-range attacks (you only have to trust your source once). In the real world though, we tend to have to upgrade software (for whatever reason), so there's always a recurring element of trust.",
        "created_at": "2021-05-14T14:19:00.720000+00:00",
        "attachments": null
    },
    {
        "author": "timhc22",
        "category": "general",
        "parent": "",
        "content": "It is full nodes which sync the whole chain right? But just validators which do the last 3 months?",
        "created_at": "2021-05-14T14:19:14.274000+00:00",
        "attachments": null
    },
    {
        "author": "timhc22",
        "category": "general",
        "parent": "",
        "content": "Also, for anyone interested in digging further into zero knowledge, the team over at zero knowledge podcast has an event coming up. Definitely interesting if you are looking into scaling and privacy:\n\nhttps://hopin.com/events/zksessions-the-zk-languages-showdown",
        "created_at": "2021-05-14T14:21:22.029000+00:00",
        "attachments": null
    },
    {
        "author": "timhc22",
        "category": "general",
        "parent": "",
        "content": "\u003c@801024474442235925\u003e *",
        "created_at": "2021-05-14T14:21:37.588000+00:00",
        "attachments": null
    }
]