[
    {
        "author": "racarr.",
        "category": "general",
        "parent": "",
        "content": "Hi all, I am a single computer OS developer humbled by your world computer. I've been studying Ether 2.0 sharding, and trying to evaluate the challenges in Ether scaling to provide a service like Twitter as a dapp. Just as a curiosity to myself about where the direction of computer science is going (free software developer frustrated by takeover of centralized services, excited to see if the tide is really turning). Anyway what I noticed is that many of the issues in sharding were essentially much easier in a reduced model (e.g. no arbitrary contract execution, just a few operations built in to the protocol). Likewise state management seems much easier if all your state is associated with a few semantically meaningful buckets (can impose state expiry on tweets that run out of gas from likes, etc...). While ether can always make progress here and much of this can be implemented in contracts on ether, a more specialized blockchain could always scale more efficiently in its domain. Computer Science has always featured squeezing out performance by specializing, and so I guess it will continue too. In particular block chains which aren't trying to achieve solve finance levels of accuracy may have a lot more freedom. I know people are thinking about linking other blockchains to ether via oracles, etc...but I am wondering if anyone is thinking of this as closer to a built in feature of ether? e.g. \"Shard per dapp, and the shard can play by house rules\". I think this would effectively mean: Ether is easily \"forkable\", it's easy to scale down a fork (it seems 2.0 doesn't scale down well/easily unless im misunderstanding), it's easy to link this forks native token to a contract on the main chain. What other solutions are people considering? I don't see us building all the dapps the world needs in 64 shards but I also don't want the world writing the basic block chain protocol and infrastructure code over and over. Anyway, hope it's not too much misinformed rambling 🙂 Thanks",
        "created_at": "2021-03-08T08:29:41.930000+00:00",
        "attachments": null
    },
    {
        "author": "paperliss",
        "category": "general",
        "parent": "",
        "content": "I know its kind of late for this but I feel like we should consider decreasing the block reward in Berlin considering both ethash asic's and GPU's are sold out everywhere",
        "created_at": "2021-03-08T23:15:40.593000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Far too late - Berlin has gone out in client releases. 🙂 The current increase in hash rate is driven largely by the spike in ETH price and the high transaction fees.  Both are highly variable so most of the time you just let them play out rather than trying to constantly adjust the block reward to get the perfect level.  1559 in London will significantly reduce the volatility of rewards from tx fees because of the burning mechanism.  That's also a good reason not to reduce the block reward since payments to miners will already be dropping as part of London.",
        "created_at": "2021-03-08T23:19:29.472000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "general",
        "parent": "",
        "content": "Please contact Infura support via https://community.infura.io/c/questions/6 this Discord is for on-going Ethereum research and development not for product support.  Thanks!",
        "created_at": "2021-03-08T23:45:34.741000+00:00",
        "attachments": null
    }
]