[
    {
        "author": "timhc22",
        "category": "general",
        "parent": "",
        "content": "\u003c@!221704135714668556\u003e, \u003c@!84772078993039360\u003e, do you have any knowledge of how projects like lazy (the NFT displaying site) and Opensea are able to provide a list of NFTs in one's wallet? I guess they would have a (centralised) caching system constantly monitoring the blockchain and creating a new data set right?",
        "created_at": "2021-05-23T02:48:27.900000+00:00",
        "attachments": []
    },
    {
        "author": "steelyeyedspaceman",
        "category": "general",
        "parent": "",
        "content": "\u003c@597792256837156971\u003e they probably have a local DB that stores contract addresses as people upload the contract address. Once you have the address you can get the url that links to the NFT offchain metadata via web3. Opensea just hosts all their NFT metadata themselves though, so it makes it easy to bring up and display. Although it goes against the spirit of decentralization",
        "created_at": "2021-05-23T15:28:13.746000+00:00",
        "attachments": []
    },
    {
        "author": "steelyeyedspaceman",
        "category": "general",
        "parent": "",
        "content": "I use IPFS for my NFTs, cuz decentralized is fun. Although I'll admit, even IPFS isnt decentralized unless someone else pins your data",
        "created_at": "2021-05-23T15:29:26.485000+00:00",
        "attachments": []
    },
    {
        "author": "timhc22",
        "category": "general",
        "parent": "",
        "content": "Yea but, if I want to see all the nfts  (or tokens) in someone's wallet, before I can even get the meta data, I have to scan every contract on ethereum for every appearance of my wallet address, and then find the current 'state' of what I own for each one (at least if I understand correctly)",
        "created_at": "2021-05-23T18:42:59.006000+00:00",
        "attachments": []
    },
    {
        "author": "timhc22",
        "category": "general",
        "parent": "",
        "content": "So.. (and I hope this is an OK place for this conversation, \u003c@301186049323958275\u003e please let me know if it isn't), so every time anything new is minted, it would need to be scanned and constantly checking for the appearance of my interacting with it",
        "created_at": "2021-05-23T18:49:58.395000+00:00",
        "attachments": []
    },
    {
        "author": "timhc22",
        "category": "general",
        "parent": "",
        "content": "The only project I really know of doing something in this area, is The Graph, but that is more of a tool than a decentralised indexing system. Are there any decentralised indexing systems out that that anyone knows of? (or maybe I'm completely misunderstanding something fundamentally re how the tech works here)",
        "created_at": "2021-05-23T18:51:13.963000+00:00",
        "attachments": []
    },
    {
        "author": "timhc22",
        "category": "general",
        "parent": "",
        "content": "Also, re meta data, I helped out a bit with this project https://checkmynft.com, it's an interesting tool, so maybe add to the répertoire if you haven't already!",
        "created_at": "2021-05-23T18:52:30.996000+00:00",
        "attachments": []
    },
    {
        "author": "hunnenkoenig",
        "category": "general",
        "parent": "",
        "content": "I created an Erc20 token in the ETH Robsten test network. I added 1.5 eth liquidity to this test token, but now it is possible to buy this token completely with 10.5 eth. is this normal or is it the test network",
        "created_at": "2021-05-23T21:12:58.852000+00:00",
        "attachments": []
    }
]