[
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "check this: https://www.notion.so/norswap/State-Expiry-Statelessness-in-Review-8d531abcc2984babb9bf76a44459e611#621e2a542e8c4bc683089e7955ce0d36\n(you might have to read the rest for context though 😅 )\nbut tl;dr: as there is a lot of work ongoing with state management, adapted network protocols might be needed\none such initiative that is already underway is the portal network, whose goal is to have light clients be able to request and share state while not holding onto the full state",
        "created_at": "2021-06-30T12:20:58.463000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "you might be interested to check out Fe - syntax inspired by Rust and Python\n\nhttps://fe.ethereum.org/",
        "created_at": "2021-06-30T14:05:18.190000+00:00",
        "attachments": null
    },
    {
        "author": "andrewhong5297",
        "category": "general",
        "parent": "",
        "content": "Oh awesome - thanks!",
        "created_at": "2021-06-30T17:08:46.606000+00:00",
        "attachments": null
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "I have a couple questions related to gas and tx:\n1. If gas price can be set to 0, what incentivizes a miner to include it in\ntheir block?\n2. What if gas price is 0, but gas limit is incredibly high? Then this is a very\nexpensive or resource intensive computation, but there is no compensation for\nthe miner. What happens to this transaction? Does it stay in the pool or is it\neventually removed somehow? Since transactions can't be canceled, is the\nsender's wallet now \"stuck\" and can never send transactions (due to nonces)?\nif this is the wrong discord to ask these questions, feel free to direct me to the right one.",
        "created_at": "2021-06-30T18:48:02.965000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "\u003e 1. If gas price can be set to 0, what incentivizes a miner to include it in their block?\n\n0 gas price tx are likely one of two things:\n\n1. the miner sending their own transactions: eg. payout to mining pool participants. however, it's not truly \"0 gas price,\" because there is the opportunity cost of including someone else's paying transaction + the MEV opportunity that might arise from that.\n\n2. the result of an off-chain agreement, where the Miner is still paid, but it doesn't get recorded onchain. this can be either in ETH, or some other token. eg. Flashbots and MEV use this. this is also sometimes called a \"Direct to Miner\" transaction",
        "created_at": "2021-06-30T21:37:35.199000+00:00",
        "attachments": null
    }
]