[
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "Question about https://snakecharmers.ethereum.org/the-winding-road-to-functional-light-clients-part-3/\n\u003e By addressing the data by it's path in the trie, we can eliminate the need to walk down the trie and instead have O(1) access for leaf data. If you recall, the naive GetNodeData style approach ends up requiring on average seven network round trips to access the data stored in the trie leaves.\n\nI'm not sure I understand why that is. \u003c@!364458974906548225\u003e",
        "created_at": "2021-06-23T13:45:58.599000+00:00",
        "attachments": []
    },
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "Other question: do non-miner nodes validate transactions before propagating them via gossip?",
        "created_at": "2021-06-23T14:16:47.477000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "You can probably answer this with a little reading of client TX pool code",
        "created_at": "2021-06-23T14:54:01.469000+00:00",
        "attachments": []
    },
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "Alright, I'll put that on my todo then",
        "created_at": "2021-06-23T14:58:00.808000+00:00",
        "attachments": []
    },
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "What about that other questions, I thought that with `GetNodeData`  you could simply pass a hash (=key) in the trie and get back the node?\nUnless I'm misinterpreting the spec and the hashes passed to `GetNodeData` are actually the hashes of the nodes along the path?",
        "created_at": "2021-06-23T15:01:14.234000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "hi, I'm new here to Ethereum in general. I've gone through \u0026 setup a GETH full node (fully synced already). I'm curious if I need to do anything like port forwarding to allow incoming connections so I can begin being useful \u0026 contributing to the Ethereum network as a whole. I've been able to do this for other projects like running a full Dogecoin Core node, but I can't find anything similar to how to set up for incoming connections for GETH. Any place I should be looking, or am I barking up the wrong tree? 🙂 Sorry in advance is this is not the correct place to post this question - I'll happily move it to where ever is suggested. Thank you 🙂",
        "created_at": "2021-06-23T18:39:49.902000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "first thing I'd like to do is become useful to the network with my full node, second is figuring out how to use it for my own transactions to reduce fees",
        "created_at": "2021-06-23T18:40:13.182000+00:00",
        "attachments": []
    }
]