[
    {
        "author": "paperliss",
        "category": "general",
        "parent": "",
        "content": "Can you please link me to this EIP? particularly after your comment I don't understand why we would want to limit the validator count.",
        "created_at": "2021-03-26T00:31:23.549000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I don't have the link at the moment - it's just a proposal from \u003c@!273808422753796097\u003e at the moment and not currently scheduled for a hard fork because the limits it was planning to be applied can't be reached for quite a while due to the limits on how fast the validator set changes.\n\nIt's likely to be required at some point because as I mentioned, the CPU and network bandwidth requirements continue to increase as the number of validators increase.  Without a reasonable limit on the number of active validators the resources required to be a validator will become too great and lead to centralisation and instability of the chain.",
        "created_at": "2021-03-26T00:35:31.985000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "This is my latest proposal",
        "created_at": "2021-03-26T00:36:22.726000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "https://notes.ethereum.org/@vbuterin/validator_rotation_proposal",
        "created_at": "2021-03-26T00:36:24.517000+00:00",
        "attachments": []
    },
    {
        "author": "paperliss",
        "category": "general",
        "parent": "",
        "content": "maybe I should finish looking through the eth2.0-specs repo before asking these kinds of questions, as I don't 100% understand\nreturn set(\n            active_validators[compute_shuffled_index(i, validator_count, seed)]\n            for i in range(len(excess_validators // ROTATION_RATE))\n        )\nin \"get_slept_validators\" but am I incorrect in thinking that the \"slept\" validators are chosen randomly?",
        "created_at": "2021-03-26T01:50:31.245000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "general",
        "parent": "",
        "content": "Yes they are",
        "created_at": "2021-03-26T02:01:12.498000+00:00",
        "attachments": []
    },
    {
        "author": "paperliss",
        "category": "general",
        "parent": "",
        "content": "Why not have the validator incentive be lowered sometime before the validator count becomes an issue and letting validators self-select? Ether way past some validator number, the yield is going to decrease whether it be from lowering total issuance or forcing some validators to sit out for an Epoch. Generally, I prefer the idea of working these kinds of problems out with economics rather than a hard cap",
        "created_at": "2021-03-26T02:56:33.828000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "It's not really a hard cap in the sense that you're thinking of. Validators can still enter, but they'll just have an additional state of \"sleeping\"",
        "created_at": "2021-03-26T02:59:30.780000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Same effect really as the way you get fewer and fewer block proposals as more validators enter.",
        "created_at": "2021-03-26T03:00:04.062000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Now you just aren't guaranteed an attestation slot each epoch either.",
        "created_at": "2021-03-26T03:00:14.184000+00:00",
        "attachments": []
    },
    {
        "author": "paperliss",
        "category": "general",
        "parent": "",
        "content": "I don't see a mechanism by which a validator can become active again. would a validator need to un-stake then re-stake their eth?",
        "created_at": "2021-03-26T03:06:03.919000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "No the set of \"sleeping\" validators is rotated randomly periodically.",
        "created_at": "2021-03-26T03:10:21.771000+00:00",
        "attachments": []
    },
    {
        "author": "paperliss",
        "category": "general",
        "parent": "",
        "content": "generally, the idea of increasing issuance for every new validator that comes online right up until the point where we need to limit it feels wrong to me",
        "created_at": "2021-03-26T03:16:15.941000+00:00",
        "attachments": []
    },
    {
        "author": "paperliss",
        "category": "general",
        "parent": "",
        "content": "Although I understand the \"status quo\" point of view",
        "created_at": "2021-03-26T03:22:16.236000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I think this is just an argument for simplicity.  The rewards to validators drop as the number of validators increases so there's already reduced incentive for new validators to join.  Theoretically that could tail off further as the limit is reached but its unnecessary complexity.  The aim is that the limit would be able to be increased as hardware and client implementations advance to be able to handle it.  Keeping that limit independent of the issuance rate makes such changes a lot simpler.\n\nAnd, it's just a proposal if we need it.  Last time it was discussed it was decided we didn't need it so its not currently scheduled for implementation.",
        "created_at": "2021-03-26T03:26:22.286000+00:00",
        "attachments": []
    }
]