[
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "So I understand a merkle proof goes something like this: Given a piece of data, d, a set of intermediate hashes, I, and the Merkle root of the tree r, we can prove d is in that tree if we produce a Merkle root r' such that r' = r.\n\nI understand how we can do the hashes to recreate the path from the data piece all the way to the merkle root. However, this requires that\n1. the root of the tree is the legitimate root\n2. the set of intermediate hashes are correct\n\nHow do we verify the legitimacy/integrity of the root we are comparing against, and how do we obtain the intermediate hashes in the first place? in the context of ethereum, whe, why, and how is a merkle proof executed?",
        "created_at": "2021-09-11T20:28:27.843000+00:00",
        "attachments": null
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "so ig one scenario is I would like to prove a transaction is in the transaction tree of a particular block. So I have the data I wish to prove, and I can also find the merkle root of the tree in the canonical block. Now, where do I get the intermediate hashes? I was under the assumption that only the root of the tree is stored by clients, and the intermediate hashes are not stored to save space. Also, who am \"I\"--another node, a wallet?",
        "created_at": "2021-09-11T20:32:14.721000+00:00",
        "attachments": null
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "In the portal network, we talk a lot about requesting proofs. when we say requesting a proof, what does this proof consist of? i suppose i understand how merkle proofs work, but not about the context surrounding the proof",
        "created_at": "2021-09-11T20:33:46.904000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "The root is trusted, in your example because it is part of the data confirmed by consensus.   The Intermediate hashes come from an off-chain store of the entire tree, and is requested from a provider of some sort.  The important point is that the provider doesn't need to be trusted, because the proof it provides can be easily verified.",
        "created_at": "2021-09-11T20:50:36.400000+00:00",
        "attachments": null
    },
    {
        "author": "duncancmt4886",
        "category": "general",
        "parent": "",
        "content": "Anybody know of any EIP712 implementations that _don't_ use both the `name` and `version` fields (or that don't expose those `name` or `version` fields in their ABI)?\n\n(Is this the right channel for that question?)",
        "created_at": "2021-09-11T22:38:56.142000+00:00",
        "attachments": null
    }
]