[
    {
        "author": "muddlebee",
        "category": "general",
        "parent": "",
        "content": "\u003e Red Hat is a particularly interesting story because in '93, Red Hat was actually two different companies that came together. One was a catalog business that sold Linux and Unix software accessories and then a second business which was actually \n\u003e \n\u003e Red Hat Linux which was its own Linux distribution that Mark Ewing had started. The two companies actually came together in 1995 and that was how Red Hat, the software company came together. Red Hat became public in 1999 and, lost in history, but Red Hat had I think like the eighth biggest or the 10th biggest first day gain in the history of Wall Street.\n\u003e \n\u003e It sort of brought this open source business into the limelight in such a dramatic way. \n\nCoooool",
        "created_at": "2021-12-04T05:02:02.403000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "One potential theory is that open source is inherently less revenue generative at the onset, but doesn’t need much in marketing and R\u0026D spend so maybe it is similar profitability levels. And certainly more durable given community driven network effects, lots of fork dependencies, and higher quality code assuming there is a healthy and actively engaged community",
        "created_at": "2021-12-04T05:15:35.333000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "Researching the history of open source would be fascinating",
        "created_at": "2021-12-04T05:15:55.265000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "May be the best business model out there at scale when combined with censorship resistance, full onchain transparency, and tokenomics",
        "created_at": "2021-12-04T05:18:54.875000+00:00",
        "attachments": null
    }
]