[
    {
        "author": "strangenoob",
        "category": "general",
        "parent": "",
        "content": "Hello Everyone,\nI am working on a DeFi App for a College minor project. Where can I get help to ask some doubt?",
        "created_at": "2021-08-11T10:50:56.738000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "general",
        "parent": "",
        "content": "r/ethdev, maybe on the cryptodevs discord (https://discord.gg/5W5tVb3), stackexchange",
        "created_at": "2021-08-11T11:39:50.212000+00:00",
        "attachments": null
    },
    {
        "author": "strangenoob",
        "category": "general",
        "parent": "",
        "content": "Okay Thanks",
        "created_at": "2021-08-11T12:02:15.734000+00:00",
        "attachments": null
    },
    {
        "author": "eaoe",
        "category": "general",
        "parent": "",
        "content": "We are looking to read the data from a 3 dimensional mapping on solidity using assembly \nExample : `mapping (address =\u003e mapping (address =\u003e uint256)) private _allowances;`\n\nWe know reading a two dimensional array could be done with the code below\n\n`function getStorageValue(uint num, uint slot) public view returns (address result) {\n    assembly {\n        // Store num in memory scratch space (note: lookup \"free memory pointer\" if you need to allocate space)\n        mstore(0, num)\n        // Store slot number in scratch space after num\n        mstore(32, slot)\n        // Create hash from previously stored num and slot\n        let hash := keccak256(0, 64)\n        // Load mapping value using the just calculated hash\n        result := sload(hash)\n    } `\n\nBut failed to figure out 3 dimensional arrays.\n\nTo any Dev who knows how to do it, please share us your knowledge",
        "created_at": "2021-08-11T16:39:43.764000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "general",
        "parent": "",
        "content": "\u003c@363955106850275331\u003e I'm not a solidity dev, but iirc, for a nested map the separate keys are hashed together into one. You probably want to join an application-layer focused server for this kind of question. Here we just focus on protocol related things",
        "created_at": "2021-08-11T18:28:31.682000+00:00",
        "attachments": null
    },
    {
        "author": "narli14",
        "category": "general",
        "parent": "",
        "content": "Hi Everyone,\n\nWe're helping developers jump ship into crypto. We've been running courses and have been getting flat 10 NPS over the last two months. These courses are completely asynchronous.By the end of this month, we will cover all the competency path for beginners and intermediate level Ethereum and Solana development.\n\nWe're a Y - combinator backed company looking to help as many developers get started with crypto.DM me or join our Discord group to get started! \n\nDiscord group link : https://discord.gg/hjgq5uzJ\n\nThanks!",
        "created_at": "2021-08-11T23:07:25.426000+00:00",
        "attachments": null
    }
]