[
    {
        "author": "beyondgodlikebot7425",
        "category": "general",
        "parent": "",
        "content": "Hi all, I've got a few questions that I'm hoping to find answers for:\n\nFrom my understanding of the scalability problem: \n```\nas a blockchain scales, the number of transactions per second a node needs to process increases which translates into increasing costs of running a node. Higher and higher costs lead to less and less participants who can afford to run a node, incentivizing them to pool together, raising the risk of centralization to unacceptable levels.\n```\n\nThe understood way to avoid this is to: \n```\nKeep the costs of running a node trivially small compared to a participant’s profit/income\n```\n\nWhat I don't understand is:\n1. Is sharding just a temporary solution? Splitting a blockchain into multiple smaller blockchains, thereby reducing the costs of running a node, will only be a temporary solution as shards will inevitable scale...?\n2. How does the shift to PoS help at all? The real world already shows us that when people can compound their wealth without risk (e.g. land ownership), the rich gets richer, poor gets poorer, and it tends to a pareto distribution (i.e. centralization)??\n3. PoS + DeFi has been highlighted by researchers to create a chaotic feedback loop which makes the decentralization/security model very unclear... based on profit maximization, whether the rational participant stakes his coins, or loans it out via some DeFi app is purely dependent on price. This means that the amount of staked coins can fluctuate.. leading to high risk of centralization. This does not happen with PoW because it is decoupled from the price \n4. Is PoS not very suspectible to state actors covertly taking over? It seems to me that governments like the US will not conceed the domainance of the USD that lightly.. \n5. Why are we abandoning PoW? It seems to me that PoW is by far the best for decentralization?? You need to actually risk your investment (mining costs) in order to stand a chance of gaining rewards...",
        "created_at": "2021-02-11T09:27:49.737000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "(1) The design doesn't need to infinity, just to \"very big\".  Sharding + rollups are likely to give us many orders of magnitude improvement, which may be \"big enough\".",
        "created_at": "2021-02-11T10:07:59.653000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "(2) PoS isn't a scaling solution, it solves a different set of problems like finality and certain classes of attacks against the network.",
        "created_at": "2021-02-11T10:08:55.468000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "(3) The system is designed to decrease rewards as more people stake, and increase rewards as fewer people stake.  You can see a chart of this in the Staking and Rewards section of \u003chttps://launchpad.ethereum.org/\u003e",
        "created_at": "2021-02-11T10:10:30.518000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "(4) A state actor can take over, but with PoS we can at least ensure that they will be severely punished (they lose their money) if they execute a censorship attack, and they cannot execute reorg attacks like PoW can.  Also, with PoS if the current stakers are truly evil (e.g., they halt the chain or prevent all transactions from being accepted) users can fork them and (assuming the market accepts the fork instead of the original) they'll lose their money executing the attack.  This cycle can repeat until the attacker runs out of money.  🙂",
        "created_at": "2021-02-11T10:12:46.583000+00:00",
        "attachments": null
    },
    {
        "author": "beyondgodlikebot7425",
        "category": "general",
        "parent": "",
        "content": "hi \u003c@!301186049323958275\u003e , thanks for answering my questions. However, from your replies its still not clear to me why the shift from PoW to PoS... you are trading strong decentralization for non-probablistic finality? but it doesn't seem to be worth it as decentralization is the raison d’être of non-permissioned blockchains...",
        "created_at": "2021-02-11T10:15:05.331000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Speaking more personally (above are just the \"facts\"), the shift is from a system where we cannot punish attackers to a system where we can punish attackers.",
        "created_at": "2021-02-11T10:15:46.035000+00:00",
        "attachments": null
    },
    {
        "author": "beyondgodlikebot7425",
        "category": "general",
        "parent": "",
        "content": "compounding effects of money will inevitably lead to centralization... at least PoW has a consistent variable running cost of mining",
        "created_at": "2021-02-11T10:16:14.182000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Also, decentralization is *not* the raison d'être of Ethereum.  Censorship resistance is.  This is an incredibly common misconception in my experience (despite all my efforts to clarify it whenever it comes up).  Decentralization is one mechanism of creating a censorship system, but it isn't a goal, just a means to a goal.",
        "created_at": "2021-02-11T10:16:44.211000+00:00",
        "attachments": null
    },
    {
        "author": "beyondgodlikebot7425",
        "category": "general",
        "parent": "",
        "content": "decentralization = incorruptibility (such as immutability and censorship resistant)\nit is the only known way in existence to achieve that\nhow do you justify that you can achieve censorship reistance without decentralization?",
        "created_at": "2021-02-11T10:18:23.292000+00:00",
        "attachments": null
    },
    {
        "author": "beyondgodlikebot7425",
        "category": "general",
        "parent": "",
        "content": "if you do not have decentralization, i.e. one person has majority control, that is highly suspectible to external incentives overpowering the built in incentives...\nsay for example Tesla owned majority of ETH2, the US government can easily force them to censor certain things on their behalf",
        "created_at": "2021-02-11T10:20:07.850000+00:00",
        "attachments": null
    },
    {
        "author": "eaoe",
        "category": "general",
        "parent": "",
        "content": "does anyone know how to capture a smart contracts function call outputs using web3j",
        "created_at": "2021-02-11T11:41:36.601000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "My moving the consensus participant into the protocol with PoS, it also opens up the design landscape for things like sharding. Randomly sampling PoW consensus participants is non-trivial and not really practical in many senses.\n\nAlso, PoS has better security properties than PoW under many threat models. For example, in PoW, if there is a 51% attack, that's game over (spawn camp attack) unless you change the mining algorithm which then negatively affects the good guys too. In PoS, there are attributable faults that make such an attack a one-time thing because the capital used for the attack will be burned.",
        "created_at": "2021-02-11T12:59:51.841000+00:00",
        "attachments": null
    },
    {
        "author": "paperliss",
        "category": "general",
        "parent": "",
        "content": "Is there any plan to implement Callbacks and promises into the EVM? Also please elaborate on any technical issues in doing this.",
        "created_at": "2021-02-11T22:04:21.994000+00:00",
        "attachments": null
    }
]