[
    {
        "author": "andrewhong5297",
        "category": "general",
        "parent": "",
        "content": "not really a comparison of rust and solidity, but I did do an ecosystem comparison of solana and ethereum https://twitter.com/andrewhong5297/status/1412233198101319686",
        "created_at": "2021-07-06T02:26:02.791000+00:00",
        "attachments": null
    },
    {
        "author": "andrewhong5297",
        "category": "general",
        "parent": "",
        "content": "or the notion page if you want to skip the thread summary https://www.notion.so/Solana-Rust-Intro-for-Solidity-Devs-e27d881a14794a3199514336ee032d0c#eb143eaecb5c4ff4a5d7129826df83c8",
        "created_at": "2021-07-06T02:26:15.770000+00:00",
        "attachments": null
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "why does node discovery protocol use UDP as underlying transport protocol, and not something else like TCP? I've brainstormed some reasons as to why, but I'm not sure if my reasoning is sound:\n- Node discovery requires low latency. But what is so important about finding nodes quickly?\n- Node discovery can tolerate some packet loss. This means that ping, pong, find_node, or nodes packets may be lost, and it is said in specs that the sender should not resend the request. This seems like an added pain—why wouldn't we want reliable data transfer? But I suppose the network can tolerate loss since losing a NODES packet is not critical—the sender can always send a request later\n- The biggest reason why I can come up with why UDP was chosen over something like TCP is that the services provided by TCP are simply *not needed*, and just cause additional unnecessary overhead. The req/res pairs such as ping\u0026pong, find_nodes\u0026nodes, aren't really \"connection-oriented\". Nodes aren't going to maintain lengthy connections with each other, and continually transfer data—instead, they just periodically send pings, and send node requests when they need one. This fact, plus the fact that UDP has lower latency, makes UDP the transport protocol of choice.",
        "created_at": "2021-07-06T21:51:56.643000+00:00",
        "attachments": null
    }
]