[
    {
        "author": "ncsyannex",
        "category": "general",
        "parent": "",
        "content": "Hi everyone, quick question regarding a block's gas limit.  Is the added tip  taken into consideration when determining the block's gas limit ? And pre-EIP-1559 would it have been possible to have a single transaction in 1 block providing the gas associated with it would fill the block's gas limit ?",
        "created_at": "2021-09-27T07:24:56.124000+00:00",
        "attachments": []
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "The block gas limit is in gas however, not gwei. A single transaction can still consume all of the gas in a block.",
        "created_at": "2021-09-27T07:26:57.301000+00:00",
        "attachments": []
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "As far as I know there isn't a relevant limit to how much wei (Ether) a tx or block may contain (or the tx fee side).",
        "created_at": "2021-09-27T07:27:49.150000+00:00",
        "attachments": []
    },
    {
        "author": "ncsyannex",
        "category": "general",
        "parent": "",
        "content": "Thanks for the clarification !",
        "created_at": "2021-09-27T07:36:13.466000+00:00",
        "attachments": []
    },
    {
        "author": "alyeska_97",
        "category": "general",
        "parent": "",
        "content": "I have some general Ethereum questions I hope I can ask here.\n\nFrom what I know, each transaction has to be verified by every validator before they can be added to the transaction pool. This seems necessary, because any one validator could change their client's software to approve of an invalid transaction (for example, to not consider the nonce of the transaction when hashing it with the public key to get the signature). But this process seems very unclear to me and I had some questions about it.\n\n1. Do validators whose verification result does not match with the majority of the validators get penalized? \n2. How exactly does a transaction propagate to each validator? Does it start by going to one validator, and then all the validator's peers (if the validator hasn't seen it yet)? \n2b. If a transaction is only sent to one validator initially, how do we choose the first validator to send it to?\n3. How does a transaction go from being approved to going into the transaction pool of a miner? Is this also sent to one miner and propagated on the peer-to-peer network?\n\nIf there is a resource that has this information, please guide me to it; thank you!",
        "created_at": "2021-09-27T16:38:03.269000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "1. yes, you make less reward *or* can even be penalized depending on how wrong your attestation is\n2. yes, this uses gossip which involves each node forwarding to some of their peers. Specifically we use libp2p's gossipsub algorithm\n2b. Note, a message is sent to many peers on the initial hop. not just one. If you sent to just one peer, it would be too easy for it to be accidentally dropped or even censored\n3. I'm not sure I understand the question. Essentially, if a TX can pay for itself and has a correct nonce and signature, it can be added to a mempool",
        "created_at": "2021-09-27T16:58:25.334000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "Also note, I just changed the name of this channel to \u003c#672059911034634243\u003e  as it is less about answering education questions but more focused on creating education materials (blog posts, diagrams, wikis, etc)",
        "created_at": "2021-09-27T16:58:57.205000+00:00",
        "attachments": []
    },
    {
        "author": "alyeska_97",
        "category": "general",
        "parent": "",
        "content": "Thank you so much! Where can I ask you follow-up questions about this?",
        "created_at": "2021-09-27T18:33:52.911000+00:00",
        "attachments": []
    },
    {
        "author": "alyeska_97",
        "category": "general",
        "parent": "",
        "content": "And where should we ask questions instead?",
        "created_at": "2021-09-27T18:34:50.854000+00:00",
        "attachments": []
    }
]