[
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "I have a question regarding ssz--how does a machine know whether an offset is an actual offset, or just another uint32? For example, suppose we have a container type:\nstruct example {\n       id: uint32,\n       bytes: List[uint8, 64],\n       next: uint64\n}",
        "created_at": "2021-09-30T22:29:21.514000+00:00",
        "attachments": null
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "then instantiating it: ex = example(14, [0,1,2], 45)",
        "created_at": "2021-09-30T22:29:56.906000+00:00",
        "attachments": null
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "this returns a single byte array after being encoded as ssz: [14,0,0,0, 12, 0, 0, 0, 45, 0, 0, 0, 0, 1, 2]",
        "created_at": "2021-09-30T22:31:14.595000+00:00",
        "attachments": null
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "since ssz is stateless, as i understand it has no notion of what the struct looks like, so how would it be able to tell that 12,0,0,0 is a uint32 that represents an offset, and not just another uint32?",
        "created_at": "2021-09-30T22:32:50.948000+00:00",
        "attachments": null
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "i guess for that matter then, how would the machine know 14,0,0,0 is a single uint32 field, and not 4 separate uint8 fields?",
        "created_at": "2021-09-30T22:33:28.263000+00:00",
        "attachments": null
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "okay after typing this out i see that the machine performing the demarshaling must know the struct it is decoding the byte array from. the data structure maybe like \"blocks\" and we want this to be publicly available knowledge",
        "created_at": "2021-09-30T22:35:34.809000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "SSZ can only decode if it knows the schema.  JSON on the other hand is self describing, so it doesn't need a schema.  SSZ knows because the SSZ type (the schema) dictates exactly how the data would be laid out.",
        "created_at": "2021-09-30T22:36:12.562000+00:00",
        "attachments": null
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "hmm, so since ssz has various types, vectors, containers, lists, etc., and each machine knows the structure of these types as defined by the specification, does this mean that there is a specific \"field\" in each type, telling the machine that, eg this incoming byte stream is a \"container\" as indicated by some field in the stream.\n\nor by schema do you mean that each ssz type has a particular structure that is unique to it, and this automatically lets the demarshaling side know which type it is dealing with",
        "created_at": "2021-09-30T22:43:09.795000+00:00",
        "attachments": null
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "wait i think i got it",
        "created_at": "2021-09-30T22:45:30.836000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "The latter, you can only decode an ssz stream if you know the encoded type",
        "created_at": "2021-09-30T22:49:02.076000+00:00",
        "attachments": null
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "to confirm: by the \"SSZ type\" having a schema, you mean the specific struct we are dealing with at the application level, e.g. a Ping, findcontent, msg, or my example struct, *not* the SSZ types as defined in the spec like container, list. It wouldn't make sense for those to have a set schema since the container types for ex have infinite possible structures",
        "created_at": "2021-09-30T22:49:11.510000+00:00",
        "attachments": null
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "so in my example above then with the \"struct example\", the demarshaling side would see 14,0,0,0 know that that fits a uint32 field, then see that the next field is a List of bytes, so thus it knows that 12,0,0,0 is an offset as this is a variable length",
        "created_at": "2021-09-30T22:51:52.879000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "You request a \"beaconstate\" and get back an ssz encoded list of bytes. You can decode it as a beaconstate by knowing that this is a container containing these precise fields that have to be encoded in a precise manner",
        "created_at": "2021-09-30T22:52:02.272000+00:00",
        "attachments": null
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "that makes sense, thanks! i was getting confused by \"ssz type\" as i thought that was referring to the specific types in the spec",
        "created_at": "2021-09-30T22:53:31.977000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I just read your example: the offsets are interleaved in precise positions",
        "created_at": "2021-09-30T22:53:43.941000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "so for a  container that has some fixed size fields and then some variable size fields you expect to see some offsets at precise positions indicating where the variable sized field are going to be located",
        "created_at": "2021-09-30T22:54:36.114000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "the layout of the offsets is dictated by the structure itself. So you request a particular kind of structure and when you get some set of bytes, you are in charge of determining if these bytes actually decode to a valid instance of your structure",
        "created_at": "2021-09-30T22:55:24.490000+00:00",
        "attachments": null
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "so everything comes back to the specific structure then. the particular structure provides a sort of \"metadata\" for ssz to be able to decode the byte stream properly",
        "created_at": "2021-09-30T23:04:31.739000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Right.  I think Piper chose the right wording, it's really a schema",
        "created_at": "2021-09-30T23:05:36.337000+00:00",
        "attachments": null
    }
]