[
    {
        "author": "m.kalinin",
        "category": "general",
        "parent": "",
        "content": "The merge or consensus upgrade (from PoW to PoS) should not affect TPS by itself. But, in perspective, it provides native access to the data availability layer (i.e. shards) which is important for rollups that are about to significantly increase TPS.",
        "created_at": "2021-03-25T04:36:58.554000+00:00",
        "attachments": null
    },
    {
        "author": "paperliss",
        "category": "general",
        "parent": "",
        "content": "I have recently found out that there is a validator limit in eth2, which initially felt like an odd design decision considering total network issuance increases as the number of validators do. My thought process being we increase issuance as the validator count goes up because we want more of them, but then we also impose a hard limit? So I read https://github.com/ethereum/research/blob/master/papers/discouragement/discouragement.pdf, which explains that the network issuance increase discourages a \"discouragement attack\". Then I tried to find a resource that explained the hard limit, but the best I could do was a statement in https://blog.ethereum.org/2020/03/27/sharding-consensus/ that suggests that the eth2 consensus algorithm is not constant time with respect to validator count (O(n) I would assume).\n\nI still have a few questions. Are there factors I have not considered in either of the design decisions mentioned above? If the number of validators reaches its limit and more want to join, who gets left out? Could a validator hard limit be used as a centralization vector? In the event of a \"discouragement attack\" could we not just fork away the attacker's eth?",
        "created_at": "2021-03-25T23:39:23.242000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "The limit on the number of validators is currently 1,099,511,627,776 and I don't think there's enough ETH in existence to actually reach that.  You are right that the consensus process is not constant time or resources in the number of validators (network bandwidth and CPU are both issues as the number of validators increase).  There's a proposal from Vitalik somewhere to provide a much lower cap on the number of active validator and validators would be randomly cycled between active and dormant if that cap is exceeded.",
        "created_at": "2021-03-25T23:44:54.718000+00:00",
        "attachments": null
    }
]