[
    {
        "author": "madhavanmalolan",
        "category": "general",
        "parent": "",
        "content": "Makes sense, thanks \u003c@!420951281910284289\u003e",
        "created_at": "2021-06-17T04:49:59.350000+00:00",
        "attachments": []
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "i'm trying to learn about computer networks, and have a question abt the devp2p protocol. Is ethereum built on top of the internet, that is, does it use TCP/IP as its underlying transport and network layers?",
        "created_at": "2021-06-17T13:12:20.994000+00:00",
        "attachments": []
    },
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "I'm trying to wrap my head around EVM CALL vs CALLCODE vs DELEGATECALL\n- in CALL,  we have the \"default sender\" (i.e. the origin for the initial call, or the contract that caused the call), the value and the recipient are freely specifieid\n- in CALLCODE, we still have the default sender, but the recipient is the current account (= default sender), value still freely specified\n- in DELEGATECALL, we the sender is delegated (i.e. it's the current call's sender), the recipient is the current account, and the value is also delegated\n\nWhat I don't get:\n1) Why is the value delegated in DELEGATECALL? Aren't there cases where we would like to delegate the sender but not the value?\n2) There is a notion of memory I'm probably hazy on. Contracts can access memory (e.g. data declaration in solidity). Memory is addressed via some sort of key (right?) and scoped per account (you can't touch other's account's memory - can you read it however?).\n3) When using CALLCODE or DELEGATECALL, you let code you don't own make modifications to your memory (as you set the current account as the recipient). Does this code (typically library/utility function) perform some kind of check to see what recipient it is called with? (e.g. via a check on `this` in solidity) ? (This would avoid cluttering the utility contract's state - though of course the sender would pay for it if that's the case.)\n4) On the net, many people seem to say that CALLCODE is essentially deprecated in favour of DELEGATECALL. Are there any legitimate uses for CALLCODE?",
        "created_at": "2021-06-17T14:01:55.054000+00:00",
        "attachments": []
    },
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "Yes, see https://github.com/ethereum/devp2p/blob/master/rlpx.md\nAt this point in time, it's not really possible to send things that are not IP over the internet. It's very difficult (because of all the middleboxes) to send things that are not either TCP or UDP.",
        "created_at": "2021-06-17T14:05:57.188000+00:00",
        "attachments": []
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "thank you. is this just because all the ISPs run IP on their routers and infrastructure, and how the internet has already been designed?",
        "created_at": "2021-06-17T16:10:41.657000+00:00",
        "attachments": []
    },
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "Yes, IP is the network layer, which allows routing packets between hosts on the network. Underneath is the datalink layer, which only allows point-to-point (two directly connected nodes) communication. It's not that we couldn't do something else than IP, but all intermediate nodes on the network would need to know about it.\n\nIf you're interested in pure networking, I very highly recommend this textbook: https://www.computer-networking.info/2nd/html/\nhere's the part about the networking layer: https://www.computer-networking.info/2nd/html/protocols/ipv6.html",
        "created_at": "2021-06-17T16:26:15.868000+00:00",
        "attachments": []
    }
]