[
    {
        "author": "samsaffarian5116",
        "category": "general",
        "parent": "",
        "content": "Hi Trent! I have an informed consent form which provides all relevant details. As far as judging whether people can be of help, all that is required is that the developer has spent time developing on blockchain platforms so far as they can speak about their experiences and thoughts regarding the governance mechanisms they are subject to in detail.",
        "created_at": "2021-06-25T10:54:38.747000+00:00",
        "attachments": []
    },
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "In https://dankradfeist.de/ethereum/2021/02/14/why-stateless.html\n\n\u003e Because if we go all the way, the executable Eth1 blocks can become a shard. Note that in the executable beacon chain proposal, all validators have to run the full Eth1 execution all the time (or they risk signing invalid blocks).\n\nI'm don't get this. After the merge, why should validators on other shards need to know about the state of the Eth1 shard (or risk signing invalid blocks)? Shouldn't the state of the beacon chain be enough?",
        "created_at": "2021-06-25T14:22:31.944000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "There are no validators on other shards that are not validating the beacon chain. And for the latter you need the ETH 1 state",
        "created_at": "2021-06-25T14:59:30.831000+00:00",
        "attachments": []
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "when you download a client, like geth or parity, does this include mining software for solving pow? i'm reading about the devp2p protocols, and it says \"nodes must exchange pending tx in order to relay them to miners\"...from what i understand, a node is not trying to solve the PoW hash puzzle that miners are, but is doing everything else like verifying, relaying tx, keeping track of blockchain state etc. Is there some option in the client software that \"turns on mining\". what's the difference between miner \u0026 node at an implementation level?",
        "created_at": "2021-06-25T21:34:50.215000+00:00",
        "attachments": []
    }
]