[
    {
        "author": "andrewhong5297",
        "category": "general",
        "parent": "",
        "content": "Finished my deep dive through these kinds of links, metamask and other wallet repo history proved to be very helpful too. Wrote an analysis article if anyone else might be interested https://twitter.com/andrewhong5297/status/1393529973126860801?s=19",
        "created_at": "2021-05-15T12:04:38.471000+00:00",
        "attachments": []
    },
    {
        "author": "timhc22",
        "category": "general",
        "parent": "",
        "content": "Are you working at Consensys \u003c@494908382889639977\u003e ?",
        "created_at": "2021-05-15T13:08:41.751000+00:00",
        "attachments": []
    },
    {
        "author": "andrewhong5297",
        "category": "general",
        "parent": "",
        "content": "Yeah!",
        "created_at": "2021-05-15T13:10:32.586000+00:00",
        "attachments": []
    },
    {
        "author": "timhc22",
        "category": "general",
        "parent": "",
        "content": "I have had a quick skim of the article, I'll read in more detail at some point soon, but (from reading the article), and from some other conversations recently, it seems that web3 is really starting to get to a stage where UX and UI are coming to the forefront, would you agree?",
        "created_at": "2021-05-15T13:12:17.242000+00:00",
        "attachments": []
    },
    {
        "author": "timhc22",
        "category": "general",
        "parent": "",
        "content": "Quote from a talk yesterday, Ian Lee (IDEO Co-Lab Ventures) on 'Hero moments' being REALLY important, but that it needs to be simple (i.e. good UX/UI) to get there:\n\n* setting up meta mask\n* buying first NFT\n* joining and then voting in your first NFT DAO\n* etc",
        "created_at": "2021-05-15T13:15:54.741000+00:00",
        "attachments": []
    },
    {
        "author": "andrewhong5297",
        "category": "general",
        "parent": "",
        "content": "Completely agree! So much so that I've started taking UX design courses on the side since engineering alone doesn't cut it anymore.",
        "created_at": "2021-05-15T13:18:32.797000+00:00",
        "attachments": []
    },
    {
        "author": "andrewhong5297",
        "category": "general",
        "parent": "",
        "content": "There are so many disparate user flows that it is really hard to design and educate for, on top of engineering for. It isn't just engineering a product that works through one dapp flow, it needs to work with all the possible flows in the ecosystem.",
        "created_at": "2021-05-15T13:19:15.723000+00:00",
        "attachments": []
    },
    {
        "author": "timhc22",
        "category": "general",
        "parent": "",
        "content": "one of the big ones is ENS in my opinion, I've spoken a few times with the team about it, and they are aware of what is needed, but currently there are 2 steps for getting an ENS domain: setting the record, and then separately setting the reverse record.\n\nIf these were consolidated into one flow (and even better, if everyone could be given one for free, #impossible?) then I personally think it would solve a huge part of the onboarding process to Web3. I don't want to assert this too hard though because, the Ethereum team will know better",
        "created_at": "2021-05-15T13:23:32.343000+00:00",
        "attachments": []
    },
    {
        "author": "andrewhong5297",
        "category": "general",
        "parent": "",
        "content": "yeah that's true! I did see a movement to give all the famous people free ENS names a day or two ago, maybe one day it will be free for all 🤣",
        "created_at": "2021-05-15T13:25:55.015000+00:00",
        "attachments": []
    },
    {
        "author": "timhc22",
        "category": "general",
        "parent": "",
        "content": "yea someone was trying to get one for Paris Hilton. Does anyone on the Ethereum team know her and could get her an ENS?",
        "created_at": "2021-05-15T14:41:18.020000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "\u003c@!420951281910284289\u003e hey, I'm interested in the apprenticeship that was announced. I'm mainly a front-end developer, graduated with an EE degree recently so I also know some C/C++. what kind of applicants are you guys accepting? do I have a chance?",
        "created_at": "2021-05-15T15:28:45.597000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "\u003c@!364458974906548225\u003e",
        "created_at": "2021-05-15T15:31:48.623000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "sorry to bother, it just looks like a very cool opportunity!",
        "created_at": "2021-05-15T15:31:59.655000+00:00",
        "attachments": []
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "i would still apply regardless! can't hurt 😉",
        "created_at": "2021-05-15T15:34:06.965000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "Not a bother.  I'm running the program for a reason and by my own volition",
        "created_at": "2021-05-15T16:03:36.360000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "We are not placing any firm restrictions on prior experience or expertise.  The best applicant is one that is intrinsically motivated, capable of learning \"all-the-things\", and ideologically aligned (working on open source protocols is worth more to you than cashing out big working for Defi or otherwise doubling down on the capitalism game).",
        "created_at": "2021-05-15T16:06:06.875000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "And there's things that \"signal\" those things, but ultimately, there's very few firm qualifications that we could put into place that wouldn't potentially filter out the wrong people.",
        "created_at": "2021-05-15T16:07:24.595000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I see, that's good to hear. I really like this sort of stuff, I'm just inexperienced, so I hope I can find a place in this.",
        "created_at": "2021-05-15T16:09:28.491000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "The best way to find that place is to be bold.  Join publicly posted calls and lurk.  Ask for invites to calls that sound potentially interesting.  Read the discussions that are happening here in this server.  Ask a clarifying question when you have one.  But mostly, take personal responsibility for your own learning.  When you think you understand something, write it down and post it somewhere public to get feedback on whether you've got it right.",
        "created_at": "2021-05-15T16:17:18.073000+00:00",
        "attachments": []
    }
]