[
    {
        "author": "ethdreamer",
        "category": "general",
        "parent": "",
        "content": "So do I understand this correctly?\n\nZK rollups with validity proofs do NOT rely on crypto-economic incentives (like a capital lockup) for security. They don't need liveness. Even if everyone left the roll-up and you came back years later you could still submit your own transaction to withdraw your funds?\n\nAlthough I'm also guessing that if you submit a validity proof for a block of roll-up transactions, there may be a minimum threshold for the number of roll-up transactions included in the block in order for the block to be more succinct than regular L1 transactions. Below that threshold, the validity proof may introduce too much overhead so that submitting that block ends up consuming more gas than a regular L1 transaction.\n\nIf that's the case, then submitting a single withdrawal transaction might be quite expensive..",
        "created_at": "2021-01-22T15:34:01.819000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "\u003e ZK rollups with validity proofs do NOT rely on crypto-economic incentives (like a capital lockup) for security. They don't need liveness. Even if everyone left the roll-up and you came back years later you could still submit your own transaction to withdraw your funds?\nright, the idea is that the validity proof is verified on-chain such that only valid state roots are accepted. withdrawal proofs can be made against this state root. if you lack the state or relevant parts of it, you can recompute it (regardless of operator status/liveness) as everything you need is on-chain (why this is a \"rollup\"vs a channel or plasma construction)",
        "created_at": "2021-01-22T18:10:11.580000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "afaiu you don't need a validity proof to make a withdrawal -- the validity proof is only to advance the state of the off-chain state as agreed by the L1 contract",
        "created_at": "2021-01-22T18:11:37.612000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "but yeah, if you deploy a zk-rollup and not enough people are using it, you could see fee revenue below the cost to verify a L1 transition -- but given demand on L1 today i don't really see this being a common outcome",
        "created_at": "2021-01-22T18:12:41.557000+00:00",
        "attachments": []
    }
]