[
    {
        "author": "timhc22",
        "category": "general",
        "parent": "",
        "content": "https://capitalgram.com/posts/history-of-cryptocurrencies/\n\n\u003c@494908382889639977\u003e MOAR history\n\u003c@364458974906548225\u003e I hope this falls under 'all-the-things' as you mentioned (those who forget history doomed to repeat its mistakes and all that jazz)",
        "created_at": "2021-05-17T05:15:14.829000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "general",
        "parent": "",
        "content": "Deleted a message: This channel is for ethereum protocol education, not random services that help students cheat at writing essays.",
        "created_at": "2021-05-17T10:24:29.745000+00:00",
        "attachments": []
    },
    {
        "author": "velorum6",
        "category": "general",
        "parent": "",
        "content": "Hi, I'm doing some research on consensus methods and I'm stuck on the part of how the network understands that transactions hashed by miners have not been manipulated and therefore are valid.\n\nI have tried to look for information about this exactly on the internet but all the texts that talk about this topic, simply assume that this happens this way and I have not found what I want exactly, I know that here you do not answer those questions, but is there any place where I can ask these questions or where there are more technical explanations?. Thank you.",
        "created_at": "2021-05-17T10:51:06.432000+00:00",
        "attachments": []
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "The transactions can be reordered without their validity changing in the case of bitcoin. I'm not sure whether this is the case in ethereum.",
        "created_at": "2021-05-17T11:13:00.431000+00:00",
        "attachments": []
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "Miners still don't know the private keys to the addresses signing the transactions, so they can't change the contents of the transactions nor which address may receive funds.",
        "created_at": "2021-05-17T11:14:08.900000+00:00",
        "attachments": []
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "There's a vitalik.ca article that words it along the lines of \"MEV (miner extractable value) is large but bounded\" since miners can reorder or censor (exclude a transaction) but they can't sign fraudulent transactions. If there were a fraudulent tx then when someone checks it, they'll realise it's invalid. Can't recall the article, but this is a solid explainer: https://youtu.be/bBC-nXj3Ng4",
        "created_at": "2021-05-17T11:16:39.873000+00:00",
        "attachments": []
    },
    {
        "author": "velorum6",
        "category": "general",
        "parent": "",
        "content": "That makes sense, I was aware of how MEV worked and seeing that the miners had some freedom in how to place transactions I wanted to find out exactly how the method worked to confirm that the transactions were valid and not manipulated by the miners.\n\nI watched the video and it helped me to understand how the transactions are verified with the user's signature.\n\nThank you \u003c@!339771292884664320\u003e",
        "created_at": "2021-05-17T12:08:53.859000+00:00",
        "attachments": []
    },
    {
        "author": "timhc22",
        "category": "general",
        "parent": "",
        "content": "hey \u003c@!344069590009118723\u003e I put together some notes on the FlashBoys essay, you are welcome to use them in your essay if they are helpful, it deals mainly with how miners can be paid to order transactions within blocks:  https://docs.google.com/document/d/1KPx9Vwf9yHJy0LGIEu42sL4n7B4QyEN507mT7AXKNoM/edit",
        "created_at": "2021-05-17T17:43:22.277000+00:00",
        "attachments": []
    },
    {
        "author": "timhc22",
        "category": "general",
        "parent": "",
        "content": "I don't know if this addresses the specific point you made above, but it might be helpful in getting there. Would be interested in reading the article when you finish!",
        "created_at": "2021-05-17T17:44:32.445000+00:00",
        "attachments": []
    },
    {
        "author": "scottypoi",
        "category": "general",
        "parent": "",
        "content": "I have been putting together a website as a resource for SSZ - SimpleSerialize.  Here you can find the actual specs, as well as an overview and guide that I have compiled from various people's blogs and message boards.  As an 'outsider' looking in, I have done my best to organize the information out in a helpful way.  Now that a 'mostly' functioning website is deployed, I would appreciate any feedback or contributions from the community, both from those trying to learn about SSZ, and from those who know it better than I and can correct my mistakes, and fill in the gaps. \n\nCurrently I am working on the next phase of the site, which involves actually visualizing and demonstrating the functions of SSZ in an interactive playground.\n\nhttps://www.ssz.dev/\n\nhttps://github.com/ScottyPoi/SSZ-SimpleSerialize/tree/deploy",
        "created_at": "2021-05-17T19:53:54.463000+00:00",
        "attachments": []
    },
    {
        "author": "velorum6",
        "category": "general",
        "parent": "",
        "content": "Thank you I will take a look, it seems interesting. 🙂",
        "created_at": "2021-05-17T20:21:32.205000+00:00",
        "attachments": []
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "Would it be an improvement to include the current Yellow Paper Cheat Sheet[0] in the Yellow Paper[1] itself?\n\nIt resembles / functions much like the appendices we already have. It could be possible to merge the cheat sheet with Appendix L. (List of mathematical symbols).\n\nThe overlap with Appendix A. (Terminology) doesn’t seem to be an issue. Opcodes already receive 2 appendices... On that topic, I wouldn't want to see the opcode appendices (G. and H.) merged, though it could be feasible. \n\nThe main point here is that Appendix L., inclusive of the cheat sheet, could coexist with Appendix A. The readability justifies the overlap. Thoughts? \n\n[0]: https://github.com/benjaminion/YellowPaper_CheatSheet/blob/master/YPCheatSheet.pdf\n\n[1]:  https://github.com/ethereum/yellowpaper",
        "created_at": "2021-05-17T22:05:29.093000+00:00",
        "attachments": []
    }
]