[
    {
        "author": "ctrl_alt_lulz",
        "category": "general",
        "parent": "",
        "content": "Would anyone here know of any good 1-page style summaries of run/space time complexity for math functions? \n\nIdeally it would function like a sparknotes for these sorts of books: Modern Computer Arithmetic - Richard P. Brent and Paul Zimmermann\n\nEg. Something along this crude csv style example in attachment would help me make rough back of the envelope approximations for system design planning a bit easier. It'd also make it easier to see the relationships between runtimes to the math functions, and make optimizations easier to spot (eg if transforming some trig func to an equivalent form could be more efficient over xyz cases)\n\nupdate: found this wikipage which covers lots of basics, would be great to find a more comprehensive one though: https://en.wikipedia.org/wiki/Computational_complexity_of_mathematical_operations\n\na +1000 version though would let you write symbolic math -\u003e generate a table of what math funcs get called to solve the equation (or at least a guess, or different iterative paths) to find the shortest cost path (using param boxing). i doubt something like this exists though that is free? been awhile since ive used matlab that sort of software before, wonder if anyone has an practical experience using symbolic math toolkits and how well they perform?\n\nupdate1: found this cool article on symbolic math solving, unfortunately doesn't look like the code is public or that it's production ready: \n\narticle: https://www.quantamagazine.org/symbolic-mathematics-finally-yields-to-neural-networks-20200520/\npaper: https://openreview.net/forum?id=S1eZYeHFDS\n\nupdate2: this wikipage is promising https://en.wikipedia.org/wiki/List_of_computer_algebra_systems\n\nsymPy looks decently easy to use, I'll play around with that to start with: \nsymPyTutorial: https://scipy-lectures.org/packages/sympy.html\n\nmathematica looks like the most mature symbolic solver (but closed source): https://reference.wolfram.com/language/tutorial/AlgebraicManipulation.html#13694",
        "created_at": "2022-10-04T14:34:43.691000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "Screen_Shot_2022-10-04_at_7.34.17_AM.png",
                "content": "f1d5961a83070fb84d1a21a8edcf332c8de2ce08f9c4c0b30f12bd516b9549b3"
            }
        ]
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I'm not really sure what you're looking for, one of the links that got you excited above is a list of CAS, in that case, if you're looking for open source I'd concentrate on Sage and its dependencies. Sage itself is incredibly slow based on Python, it's strength is in its categorical approach in that you can implement some algebraic structure and essentially get for free the graded/super/finite dimensional,... versions.  However the libraries it's built on top are top notch, Singular for polynomial and commutative ring computations (think Gröbner bases), GAP for groups,  Maxima, etc...\nIf you're looking for closed source but serious mathematical software you may also look into Magma.",
        "created_at": "2022-10-04T15:47:29.797000+00:00",
        "attachments": null
    },
    {
        "author": "hurricane_mitch99",
        "category": "general",
        "parent": "",
        "content": "hello. I'm heading for Devcon, and I wanted to ask - - are there any tutorials or resources for Core ETH Development? cant find many",
        "created_at": "2022-10-04T15:58:34.080000+00:00",
        "attachments": null
    },
    {
        "author": "ctrl_alt_lulz",
        "category": "general",
        "parent": "",
        "content": "use cases for me (short term, long term potentially)\n\n1. high quality playground tools and reference pages with breadth to refresh on math related to sharding, and crypto funcs, and how math translates into efficient hardware solutions. not too focused on the libraries being super fast, would only be toy problems here\n\n2. much later on, exploring techniques on iterating computer symbolic math to solve paths over different hardware + algorithm combos. to help answer questions like can this run on consumer hardware reliably, meet etc timing requirements, use GPUs or an alternative, etc\n\neg this is made up right now, but something like this fnEquationSolver(symbolic equation, accuracy level needed, confidence level on accuracy) \n-\u003e taylor series solution 1\n-\u003e other solution type 2\n-\u003e N\n\nthen using that to automate testing -\u003e pipeline(run taylor series, hardware params) -\u003e report statistics\n\n-- \u003c@755590043632140352\u003e thanks for those tips! hmm I'll have to take a look at magma. using something closed source would be fine for my use case 1, esp if it's more user friendly/easier to conceptualize in eg. if it has great graphics and detailed solution solving to walk you through vs getting stuck in the weeds on something unimportant",
        "created_at": "2022-10-04T15:59:35.412000+00:00",
        "attachments": null
    },
    {
        "author": "rodrigoh0623",
        "category": "general",
        "parent": "",
        "content": "Check EIP 150",
        "created_at": "2022-10-04T18:38:05.328000+00:00",
        "attachments": null
    }
]