[
    {
        "author": "80raghavendra",
        "category": "general",
        "parent": "",
        "content": "A basic question. Why do we need two things - state tree (Merkle Patricia Trie) and a state db (rocksdb / leveldb)? Isn't data duplicated? \n\nI know state tree provides state root and Merkle proofs, then why do we need state db, use just state tree all the time?",
        "created_at": "2022-03-28T14:15:55.453000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "general",
        "parent": "",
        "content": "It seems your question is: **If we have a trie/tree why do we also need a database?**\n\nIf you have a **trie data structure**, you will also need a **storage layer** to store the original data and also any intermediate data that the trie may produce such as hashes.\n\nThe storage layer could be in-memory or it could be persistent like rocksdb or leveldb.\n\nThe trie is able to access the storage layer in order to do operations such as make merkle proofs, compute/update the state root. \n\nSometimes implementations do duplicate data by creating two storage layers. One is persistent and could be rocksdb/leveldb. The other is in-memory and is referred to as a cache. The cache is much faster to access, so you put commonly retrieved items in it to make trie operations faster.\n\n(This is in general, I don't know how it works exactly in Ethereum)",
        "created_at": "2022-03-28T16:13:54.205000+00:00",
        "attachments": null
    },
    {
        "author": "80raghavendra",
        "category": "general",
        "parent": "",
        "content": "Thanks \u003c@!427491045308235776\u003e \n\nSuppose we do not need Merkle roots for some reason, then is rocksdb not enough?\n\nSuppose also that I take care of cache. Then do I need state tree at all? I can work on rocksdb directly. It too provides efficient read and write accesses",
        "created_at": "2022-03-28T22:16:20.062000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "general",
        "parent": "",
        "content": "Yeah exactly, if you don’t need to create merkle proofs or a merkle root, then you could store the data directly in a key value database.",
        "created_at": "2022-03-28T22:31:03.198000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "general",
        "parent": "",
        "content": "You will still be able to verify merkle proofs given a root, but you would need to get the root from some trusted source",
        "created_at": "2022-03-28T22:31:46.978000+00:00",
        "attachments": null
    },
    {
        "author": "muddlebee",
        "category": "general",
        "parent": "",
        "content": "miss your blogs ser",
        "created_at": "2022-03-28T23:55:53.246000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "general",
        "parent": "",
        "content": "I don’t understand, can you rephrase?",
        "created_at": "2022-03-28T23:57:32.047000+00:00",
        "attachments": null
    }
]