[
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "Think the flashbot GitHub should have good resources. Hasu from paradigm has good writings/talks on the topic as well as you pointed out w/ uncommon core",
        "created_at": "2022-01-10T05:08:48.683000+00:00",
        "attachments": []
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "Perhaps yet another dumber question than the one first asked by \u003c@427013411004612618\u003e — why is MEV a problem at all? Is MEV that much of a deadweight loss to the system vs being a source of revenue capture to allow block proposers to operate profitably, thereby being part of the “necessary” security budget of ethereum?\n\nTo use the “ethereum is a nation-state” analogy, I’d rather have a well-funded defense budget that is deployed in the best interests of the commonwealth but have a little bit of “corruption” than a squeaky clean one that is ineffective and would need to be funded with seigniorage",
        "created_at": "2022-01-10T05:18:40.095000+00:00",
        "attachments": []
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "One issue is that capturing MEV creates negative externalities / degrades throughput, and another is that MEV can lead to consensus instability (reorgs at a minimum degrade UX of accepting payments, and be even nastier). \n\nConsider a humble sandwich attack: a single Uniswap tx that consumes about 105,000 gas leads to another transaction on either side. Now there's 315,000 gas consumed for the utility of a single person swapping, at the expense of the primary swapper.\n\n(there are 'triple stacked sandwiches' with three 'authentic' tx with the two MEV-capture tx (the bread) on either side, but these are far rarer than the single-stacked, humble sandwich).",
        "created_at": "2022-01-10T05:47:17.429000+00:00",
        "attachments": []
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "Thanks that’s helpful. Yeah agree sandwich attacks / MEV in general seems to be a “non-productive” use of gas (could make a similar claim in tradfi about usage of bandwidth for HFT / algo hedge funds which is probably the right analogy here). \n\nThat said, it seems like explicitly tagged “MEV bots” actually account for a very small portion of gas used per this: https://ultrasound.money/\n\nI wonder if anyone has done a study / crunched the data on how much more incremental slippage MEV causes on DEXs or how much of the total gas usage around DeFi-specifically (not sure how MEV works in the context of NFTs for example?) comes from productive activities vs MEV",
        "created_at": "2022-01-10T07:14:03.608000+00:00",
        "attachments": []
    },
    {
        "author": "xenonmind",
        "category": "general",
        "parent": "",
        "content": "Hey. I want to get into blockchain development on ethereum. I am fully fluent in python and above average in java. Can someone suggest me a path from where I can begin the blockchain development?",
        "created_at": "2022-01-10T08:54:55.551000+00:00",
        "attachments": []
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "I'm waiting on actual Yakuza MEV. ETH organizations like exchanges paying protection fees to ensure their stuff is included or paying mercenary fees to ensure their competitions transactions are excluded. There's a lot of real world examples of practices that were banned that haven't been tried yet.",
        "created_at": "2022-01-10T10:30:14.113000+00:00",
        "attachments": []
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "I'm not well read on HFT, but I think there are claims that liquidity commands a premium: if a stock trades close to the stock exchange's tick size then the market might function worse / be less efficient (e.g. respondant to information). Share splits / redomination shouldn't add value (outside of the psychological) except in unit issues like this.",
        "created_at": "2022-01-10T12:55:27.699000+00:00",
        "attachments": []
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "There are other arguments for the value of liquidity, so at least HFT provides some positive externality.",
        "created_at": "2022-01-10T12:55:46.905000+00:00",
        "attachments": []
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "If miners took smaller cuts from Flashbots Searchers, then DEX prices might be a little better, since they'd accept making smaller arbitrages than they do now.",
        "created_at": "2022-01-10T12:57:43.067000+00:00",
        "attachments": []
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "Do Ethermine reorgs come close enough?",
        "created_at": "2022-01-10T12:59:16.049000+00:00",
        "attachments": []
    },
    {
        "author": "chris2_2_2",
        "category": "general",
        "parent": "",
        "content": "I’ll admit my ignorance there. They don’t have enough hashrate to reorganize eth I think?",
        "created_at": "2022-01-10T13:09:20.029000+00:00",
        "attachments": []
    },
    {
        "author": "muddlebee",
        "category": "general",
        "parent": "",
        "content": "check the pinned post at \u003c#745072678079168654\u003e",
        "created_at": "2022-01-10T18:18:47.909000+00:00",
        "attachments": []
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "Assuming they have 25-35% hashrate, they'd be able to pull off short-term reorgs with decent probability. If the MEV eclipses the tx fees it could be worth risking. https://miningpoolstats.stream/ethereum places them at 32%, and miningpools.com/ethereum/ places them at 27%. I'm not sure about my statements here though.",
        "created_at": "2022-01-10T23:38:35.504000+00:00",
        "attachments": []
    }
]