[
    {
        "author": "behkod",
        "category": "general",
        "parent": "",
        "content": "But we're already counting some coins that can never move, like the ones w/ lost keys (that we consider those as being HODL)",
        "created_at": "2022-09-24T13:07:25.948000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Why would you do that?",
        "created_at": "2022-09-24T13:07:51.448000+00:00",
        "attachments": null
    },
    {
        "author": "behkod",
        "category": "general",
        "parent": "",
        "content": "I don't intentionally do that. I mean this is a mistake that's already being made by chart/report providers. We're already counting \"coins that never move\"",
        "created_at": "2022-09-24T13:09:44.310000+00:00",
        "attachments": null
    },
    {
        "author": "behkod",
        "category": "general",
        "parent": "",
        "content": "Does anyone know a more complete (or updated) version of \"Ethereum EVM illustrated\" by \"Takenobu T.\"?",
        "created_at": "2022-09-24T13:10:55.153000+00:00",
        "attachments": null
    },
    {
        "author": "randomishwalk",
        "category": "general",
        "parent": "",
        "content": "Hi all - I'm helping dartmouth blockchain (a very student-run club and effort) find interesting/high-impact open source projects to start contributing to. Any ideas? Would be awesome if you can respond in the thread given I'm hoping this can all be somewhat consolidated in one place for the students. Thank you guys 🙏 \n\nhttps://twitter.com/randomishwalk/status/1573701918031073280?s=20\u0026t=Ad3r1caobGyDcQjnVjjzyQ",
        "created_at": "2022-09-24T16:15:00.262000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "What I mean is consider whatever is in the deposit contract and not consider the beacon chain. Whenever a full withdrawal is made, subtract 32ETH from the contract. This does not have the problem of having to check a bound as in \u003c@144468805697929216\u003e comment's, but there's the issue of distinguising full withdrawals from partial ones. If we didn't have BLS accounts it would be easy to just consider full anything that has above ejection balance.",
        "created_at": "2022-09-24T21:56:15.669000+00:00",
        "attachments": null
    }
]