[
    {
        "author": "wqed.",
        "category": "general",
        "parent": "",
        "content": "Hello folks, I'm interested in the MEV problem, but I have many gaps in my basic understandings that I'm trying to work out.  Was wondering if someone could point me to resources or a set of concepts which expose the answer to this question:\n\nWhy is MEV inevitable?  Many solutions I see being proposed seem to lean into the idea that MEV is going to exist because some block proposer always has the ability to order transactions to maximize self interest, so instead of elimination of the possibility of MEV, it's harnessed in PBS.  My stupid question is: why can't MEV be eliminated by imposing some transaction ordering in proposed blocks?   Sorry if this is super basic, Thanks for any insight or pointers!",
        "created_at": "2022-01-06T00:43:19.270000+00:00",
        "attachments": []
    },
    {
        "author": "abcoathup",
        "category": "general",
        "parent": "",
        "content": "Try the Flashbots documentation: https://docs.flashbots.net/new-to-mev",
        "created_at": "2022-01-06T01:31:20.310000+00:00",
        "attachments": []
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "\u003e My stupid question is: why can't MEV be eliminated by imposing some transaction ordering in proposed blocks?\n\nIn this case transactions could be omitted from a block to make the block more favourable, or the ordering method (e.g. time of arrival) may be difficult to implement without being gamed or without leading to centralisation (flashboys-style latency wars).\n\nI haven't thought enough about the downsides it brings about other than computational cost (which is significant) but one could require a minimum Spearman's rank correlation coefficient on tipfees vs transaction position within a block. I like the idea of 'higher tipfees = access to earlier gas in a block' like we saw with PGAs (Priority Gas Auctions): currently it's easier to land at the top of a block through flashbots, and the payments for preferred ordering can be out-of-band / non-ETH. This economic abstraction can occur for the tipfee but not the basefee, since tipfees bidding is essentially a first price auction. In principle there's no reason why in the PGA days (pre-EIP-1559) for high gas price bids to land one at the top of a block (miners could place you anywhere) but in practice they would tend to order it with highest fee transactions at the top (leading to users to bid more to secure the early gas in each block).",
        "created_at": "2022-01-06T02:42:32.911000+00:00",
        "attachments": []
    }
]