[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "For accounting purposes isn't it simpler to not count the ETH in the beaconchain?",
        "created_at": "2022-09-23T00:06:31.386000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "So that the issuance that we've been giving since 2020 is not really counted until it's realized in the execution layer",
        "created_at": "2022-09-23T00:07:27.875000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "it’s certainly simpler but also inaccurate :p if say 25% of all eth is on the CL, i think it’s important to include",
        "created_at": "2022-09-23T07:41:08.960000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "There was some discussion about zeroing out the Ether held in the deposit contract each block, is that no longer going to happen?\n\nAlternatively, is there any plan to reduce the balance in the deposit contract with amounts withdrawn from the CL (up to the limit of the balance in the contract, of course)?",
        "created_at": "2022-09-23T07:44:15.497000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "i don’t see why we need to complicate the implementation, supply calcs can simply ignore eth in that one contract as a special case",
        "created_at": "2022-09-23T07:58:26.761000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "issuance on the beacon chain means eth in the deposit contract cannot be matched 1:1 with withdrawals",
        "created_at": "2022-09-23T07:59:30.764000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "That's pushing the complication to all downstream systems rather than addressing it at the protocol.",
        "created_at": "2022-09-23T08:03:46.989000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "Yes, hence \"up to the limit of the balance in the contract of course\".\n\nIs zeroing the contract balance each block that difficult to do?  It seems that it would allow a simpler calculation of total supply being execution chain balance + consensus chain balance, and non-validating supply being execution chain balance.",
        "created_at": "2022-09-23T08:05:44.557000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "if we wanted to do that i’d just suggest a hard fork where that one contract has different semantics that all eth transfers are simply ignored, can clear the balance one-time at that fork",
        "created_at": "2022-09-23T08:11:14.660000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I’m not entirely sure that’s a reasonable definition even if the deposit contract was zeroed. You’d want to ignore the balance of the zero contract as well since that’s usually considered “burnt” but actually is just transferred to a place no one can control it anymore.",
        "created_at": "2022-09-23T08:12:43.442000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "general",
        "parent": "",
        "content": "True, but the common request is to know \"total supply\" rather than \"circulating supply\".  At current it's reasonable to sum all balances on the execution chain, but if we end up double counting anything that's gone to the CL and come back it seems that the number will become increasing out of whack over time.\n\nSum of EL + CL balances with deposit contract balance reset to 0 each block seems reasonable*, sum of EL + CL balances where deposit contract balance is reduced with withdrawal amount seems reasonable, but having to explain to the world why you subtract a big chunk of Ether each time someone asks will no doubt become painful, and another stick with which to beat Ethereum with for those who take the simple sum.\n\n*perhaps not until we have immediate deposits, though, as otherwise the combined balance will yo-yo with each new validator.",
        "created_at": "2022-09-23T08:19:14.548000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I would be surprised if people want \"total supply\" to mean \"including coins that can never move\" like those sent to 0 address or deposit contract.",
        "created_at": "2022-09-23T10:26:28.061000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I can't think of any legitimate reason for wanting that particular number.",
        "created_at": "2022-09-23T10:26:57.901000+00:00",
        "attachments": null
    }
]