[
    {
        "author": "cheeky_gorilla",
        "category": "general",
        "parent": "",
        "content": "Right, for example if USDC/Circle said they'd only support the \"non-buggy\" chain. Thanks for the clarification Adrian!",
        "created_at": "2023-04-05T06:34:52.355000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Yep. Or say if a major infrastructure provider like Infura used a minority client like say Teku a lot. 🙂 There’s a lot of factors involved and amount of eth staked is one of the least significant ones because stakers who followed an invalid chain didn’t do their job properly and really deserve to lose out - otherwise you get the nothing at stake problem.",
        "created_at": "2023-04-05T06:43:24.362000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "I have long lobbied that if a bug in a majority client resulted in a fork, regardless of the severity of the issue we (the community) should refuse to follow it.",
        "created_at": "2023-04-05T07:18:42.046000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Anyone who runs a majority client should understand that they are just putting themselves at risk and they will be punished if those risks come to pass, they will not be bailed out.",
        "created_at": "2023-04-05T07:19:05.934000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "That being said, I believe client diversity has improved to the point where this isn't a huge risk anymore.",
        "created_at": "2023-04-05T07:19:19.972000+00:00",
        "attachments": null
    },
    {
        "author": "sonic.1337",
        "category": "general",
        "parent": "",
        "content": "\u003e That being said, I believe client diversity has improved to the point where this isn't a huge risk anymore.\nI strongly disagree. The data I have collected so far (by asking the services/pools), seems to result with Geth at around 80 - 90%.\nAs you likely already know, it's not possible to get a full dataset, but assuming the data is somewhat reliable, we are still way above 2/3 Geth usage.\nThe project is work in progress, so I don't want to make a final statement yet.",
        "created_at": "2023-04-05T07:31:44.283000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If that is true then I will return to my original argument that there should be no bailout for a consensus bug in Geth.",
        "created_at": "2023-04-05T07:32:30.660000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "If there is a 2 week long fork of Geth behaving different from minority clients, then Geth will get patched and rolled back 2 weeks.",
        "created_at": "2023-04-05T07:33:07.524000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "IMO this point should be made *very* clearly to everyone, especially infrastructure providers and exchanges.  There is no excuse at this point for continuing to use a majority client.",
        "created_at": "2023-04-05T07:33:41.524000+00:00",
        "attachments": null
    },
    {
        "author": "sonic.1337",
        "category": "general",
        "parent": "",
        "content": "I agree 👍 \n\nI would really like help to get the data from larger exchanges, it's often impossible for me to get the data which I would need to make my data set complete. The first level support often does not understand what I want.",
        "created_at": "2023-04-05T07:37:06.304000+00:00",
        "attachments": null
    },
    {
        "author": "daniellehrner",
        "category": "general",
        "parent": "",
        "content": "Maybe \u003c@561275259454619659\u003e could help with the numbers for Coinbase? It would really be important to get a good estimate about the situation. \n\nHave you tried to reach out on Twitter to people working for other exchanges? Like that you would not need to go through the support channels.",
        "created_at": "2023-04-05T08:13:59.457000+00:00",
        "attachments": null
    },
    {
        "author": "cheeky_gorilla",
        "category": "general",
        "parent": "",
        "content": "If you're not already aware, rated.network has compiled this data for consensus clients (not execution clients afaik), though I cant speak to the methodology or accuracy. \n\nhttps://www.rated.network/o/Coinbase?network=mainnet\u0026timeWindow=1d (see \"Client Distribution\" towards the bottom)",
        "created_at": "2023-04-05T08:57:27.115000+00:00",
        "attachments": null
    },
    {
        "author": "siladu",
        "category": "general",
        "parent": "",
        "content": "Would be really handy if they put ELs on there too",
        "created_at": "2023-04-05T09:00:00.896000+00:00",
        "attachments": null
    },
    {
        "author": "sonic.1337",
        "category": "general",
        "parent": "",
        "content": "\u003e Maybe \u003c@561275259454619659\u003e could help with the numbers for Coinbase? It would really be important to get a good estimate about the situation. \n\u003e \n\u003e Have you tried to reach out on Twitter to people working for other exchanges? Like that you would not need to go through the support channels.\n\n\u003c@905058765022310460\u003e\nThanks for getting me in touch with the right person. Let's wait for a response.\nI'm not on Twitter at the moment, but that sounds like a good idea. 👍\n\n\u003e If you're not already aware, rated.network has compiled this data for consensus clients (not execution clients afaik), though I cant speak to the methodology or accuracy.\n\n\u003c@561890759897382912\u003e\nI'm aware of the consensus layer data, thanks. My project is dedicated to the execution layer only on purpose. The consensus layer distribution is well know thanks to the `blockprint` project from Michael Sproul / Lighthouse (\u003chttps://github.com/sigp/blockprint\u003e). While there's room for improvement in the consensus layer, my current focus is on the execution layer. I will add a section about the consensus layer to the FAQ.\n\n\u003e Would be really handy if they put ELs on there too\n\n\u003c@341574016160497665\u003e\nThe data I'm gathering will be made available as an open-source JSON file, allowing anyone interested to easily access and utilize it. It's possible that I could collaborate with the team at rated.network as well.\n\n\u003e IMO this point should be made very clearly to everyone, especially infrastructure providers and exchanges.  There is no excuse at this point for continuing to use a majority client.\n\n\u003c@301186049323958275\u003e\nI'm helping a lot of people on the EthStaker Discord, and I run into folks who don't know anything about this risk all the time. I assume those using staking services or liquid staking coins know nothing about this risk mostly.\nIt is not in the interest of the services/exchanges to inform the user about the risk, except in the small prints of the ToS, of course.\nTo be honest, I think the services wouldn't take any responsibility if a supermajority consensus bug occurs.\n\nThe problem goes even deeper, even the `ethereum.org` webpage shows services with **100% Geth** as **\"DIVERSE CLIENTS\"** (\u003chttps://github.com/ethereum/ethereum-org-website/issues/9840\u003e, comments highly welcome 😉)\n\nThe risk is not communicated good enough at many location, unfortunately. I'm trying to improve this, obviously.\n\nThank you all, that's more feedback than expected. 🙏",
        "created_at": "2023-04-05T11:18:00.268000+00:00",
        "attachments": null
    },
    {
        "author": "jessepollak",
        "category": "general",
        "parent": "",
        "content": "shoot me an email at jesse@base.org with the information you're looking for and I can try my best! thanks for doing this research 🙏🏼",
        "created_at": "2023-04-05T12:25:29.087000+00:00",
        "attachments": null
    }
]