[
    {
        "author": "eawosika",
        "category": "general",
        "parent": "",
        "content": "That could help. Although, the smart contract will likely require integrating with some bridging/interoperability protocol that has enough liquidity to support cross-rollup movement. Omni (https://omni.network/) and Polymer (https://www.polymerlabs.org/) are two projects I know that are building the kind of interoperability infrastructure to reduce UX issues around fragmented liquidity in rollups. If two or more rollups integrate with the same liquidity layer, then a solution like the one you describe should work.",
        "created_at": "2024-01-09T21:44:08.926000+00:00",
        "attachments": null
    },
    {
        "author": "eawosika",
        "category": "general",
        "parent": "",
        "content": "EIP-7002 (https://eips.ethereum.org/EIPS/eip-7002) introduces a mechanism for stakers to exit validators from the Ethereum's Beacon Chain using a validator's withdrawal credentials instead of relying on a validator's signing key to trigger voluntary exits. This reduces the trust element required in delegated staking by allowing stakers to retain control over their funds (since signing keys will be controlled by the node operator, not the staker). *EIPs For Nerds #2: EIP-7002* (https://ethereum2077.substack.com/p/eip-7002-execution-layer-exits) provides a comprehensive overview of EIP-7002 and answers questions like:  \n\n1. What is the current process for exiting a validator, and what problem does it introduce for delegated staking? \n\n2. How does EIP-7002 propose to address this by changing how validators can be exited?   \n\n3. What other potential advantages does EIP-7002 have, especially for solo stakers and distributed validator technology (DVT) staking setups? \n\n4. What are some potential risks or drawbacks around implementing EIP-7002? \n\nRead the full article here: https://ethereum2077.substack.com/p/eip-7002-execution-layer-exits",
        "created_at": "2024-01-09T21:49:16.147000+00:00",
        "attachments": null
    }
]