[
    {
        "author": "ramshreyas.rao",
        "category": "general",
        "parent": "",
        "content": "\u003c@880152584730578944\u003e and I have started a small newsletter where we explore possible futures of Ethereum based on the work people like all of you create. \n\nWe're currently sending it directly to a list we maintain but thought it would be worth sharing here as well for feedback and comments - Here are our latest articles:\n\nhttps://paragraph.xyz/@chaskin/why-is-everyone-in-ethereum-talking-about-tees\nWhy Is Everyone in Ethereum Talking About TEEs? (5 minute read)\n\nTEEs are emerging as part of Ethereum’s infrastructure. This piece provides a high-level overview of what they are and how Flashbots, Scroll, and Taiko are using them to shift MEV dynamics, enable rollup innovation, and improve bridge security.\n\nhttps://hackmd.io/@Ramshreyas/HJ_5E6fFkl\nRISC-V Business part 2: The Road to Real-time Proving (11 minute read)\n\nIn Part 1 of this series, we explored at a high level how the adoption of RISC-V as an open standard is likely to be the foundation on which the programmable cryptography future of Ethereum will be built, using Glue and Coprocessor architectures. We then used Risc0's VM to 'host' a simple piece of external code, executed it, and then produced a proof that it was executed correctly, to get a concrete, albeit simple caricature of this paradigm.\n\nIn Part 2, we will dive deeper first with an overview of the recently launched ETHProofs.org, followed by an in depth examination of how we can achieve real-time proving in the execution layer by looking at the anatomy of an Ethereum State Transition, identifying which steps can be 'coprocessed', and finally addressing how the proving of the entire execution trace can itself be sped up.\n\nOnce we have the lay of the land, we can proceed to lay out the road to real time proving and discuss how RISC-V can help get us there.",
        "created_at": "2025-02-12T10:23:01.154000+00:00",
        "attachments": []
    },
    {
        "author": "bkoshy",
        "category": "general",
        "parent": "",
        "content": "hey y'all, curious, what kind of content would you like to read or learn about on rollups?",
        "created_at": "2025-02-12T12:20:04.126000+00:00",
        "attachments": []
    },
    {
        "author": "lmbd",
        "category": "general",
        "parent": "",
        "content": "I've found this to be quite good:\nhttps://members.delphidigital.io/reports/the-complete-guide-to-rollups#introduction-337d",
        "created_at": "2025-02-12T15:19:24.087000+00:00",
        "attachments": []
    },
    {
        "author": "manunlp",
        "category": "general",
        "parent": "",
        "content": "The best videos so far I saw about explaining in simple words elliptic curves, trusted setups, KZK commitments, blobs...\nhttps://www.youtube.com/@zkmarek",
        "created_at": "2025-02-12T20:40:00.442000+00:00",
        "attachments": []
    }
]