[
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Giving an update after a chat with some slot time enjoyoors yesterday:\n- More analyses of block/attestation propagation incoming\n- Thinking through transaction inclusion latency in various configurations (see also \u003c#874767108809031740\u003e )\n- A new insight for me: The current data we've seen asks the question \"do we see a large enough share of attestations by the aggregation deadline?\" imo it's the wrong question, if we look at the mechanics of the consensus. What we really need to ensure is that we have high confidence that for each attestation committee, an aggregate is available that includes most of the honest attestations, where honest attestations are attestations released either on reception of the payload or at the attestation deadline, whichever is earliest.\n\n    Now how can we have high confidence? imo an argument of the shape \"as long as 4 out of 16 aggregators receive the attestations they care about to make their aggregates timely\" is convincing, we may not need to ensure that the *median* aggregator is able to do their job well, because aggregators are redundant. Of course, the lower percentile of aggregators we target means we lose in resilience, so we shouldn't go as far as saying \"as long as 1 out of 16 can do a good enough job, we're happy\".\n\n    This matters because the data that currently exists regarding attestation propagation assumes that it's nodes connected to all subnets and thus receiving all attestations that are relevant. But it may be the case that we care much more about the smaller nodes that perform aggregation, are not connected to many subnets and thus are more efficiently receiving attestations for the few they care about to make an aggregate.\n\n    In other words, we don't need to ensure that every node receives every attestation by the aggregation deadline. We need to ensure the relevant nodes receive the relevant attestations by the aggregation deadline.",
        "created_at": "2025-07-15T08:03:39.901000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "To increase network resilience further, it may even be worth it for aggregating nodes to keep issuing updated aggregates as they receive more attestations",
        "created_at": "2025-07-15T08:28:12.859000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Cross-layer",
        "parent": "",
        "content": "There’s a slight DoS risk with that as an aggregator could add attestations to the aggregate one at a time and so wind up making the aggregate topic have the same traffic as the single attestation topic. It would be capped at the number of single attestations available and cost the aggregator bandwidth but it would potentially cause heartburn for nodes that can’t keep up with all attestations.",
        "created_at": "2025-07-15T08:39:17.886000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Has there been any effort in specifying the issuance on the CL?",
        "created_at": "2025-07-15T09:02:31.407000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Couldn’t that be limited somehow? The aggregates are signed by the aggregator iirc",
        "created_at": "2025-07-15T09:25:03.015000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Haven’t seen code, easiest is likely to change BASE_REWARD_FACTOR and have the issuance be conditional on pre-fork and post-fork behaviour",
        "created_at": "2025-07-15T09:26:39.767000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Are you sure it's just a balance rescaling and that duties don't need to be balanced?",
        "created_at": "2025-07-15T09:27:22.447000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "I’m not 100% sure, but will look into it. Iirc all duties are scaled by this parameter",
        "created_at": "2025-07-15T09:28:07.653000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "instead of one at a time (not sure that's what you meant) couldn't do you do it after certain threhsold, like send one after 50% is aggregated, another one after 80% is aggregated\nthen we roughly know how aggregate subnet bandwidth will be increased up x2 x3... etc\nthen we can look into different parameters to test with like target aggregator per commit count",
        "created_at": "2025-07-15T14:18:51.307000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "I was imagining some rules similar to \"replace-by-fee\", e.g., you need 10% more attestations in your aggregate vs a previously released one. But since the aggregates are signed you can even let the aggregators decide, given a max number of messages they are allocated, how to allocate these messages",
        "created_at": "2025-07-15T15:15:37.118000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "right so I think two immediate questions top of my head is \n1. how many kb/s we are consuming on aggregate subnets today\n2. what happens if we lower aggregator per committee count to offset the differences",
        "created_at": "2025-07-15T15:31:50.423000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Posting here \u003c@1009418255913472000\u003e run with 4seconds execution blocks: \nhttps://x.com/ChodoKamil/status/1945154735058657357",
        "created_at": "2025-07-15T16:20:39.033000+00:00",
        "attachments": null
    }
]