[
    {
        "author": "quintuskilbourn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hey guys. I'm interested in geographic data about the ethereum network for some geodecentralisation research. I'm interested in answering questions as follows:\n* What is the relationship between validator location and average rewards? \n* What is the relationship between validator location and timely attestation, other attestation, MEV and other rewards? \n* Can we break it down further by relay?\n\nPosting in this channel since this EIP  is most obviously touching on geographic decentralisation",
        "created_at": "2025-07-17T20:54:43.649000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Me and \u003c@680234424037670912\u003e can give you data on the first one: rewards suck in the southern hemisphere 🙂",
        "created_at": "2025-07-17T22:28:01.527000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "But to add also a relevant question to the channel, for MEV experts out there. If I double the number of slots per 12 seconds. Will the spam MeV transactions increase as well or not? Is it really resonable to expect the same number of spam txs per second if we keep the overall number of txs/second? My natural guess would be that spam txs are tied to block availability and not just gas limit. Therefore I would have naturally guessed that the available block space for non spammy users may actually decrease with shorter slot times",
        "created_at": "2025-07-17T22:31:17.203000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Cross-layer",
        "parent": "",
        "content": "contributoor has a lot of this data \u003c@84562395988508672\u003e ?",
        "created_at": "2025-07-17T22:40:29.922000+00:00",
        "attachments": null
    },
    {
        "author": "samcm",
        "category": "Cross-layer",
        "parent": "",
        "content": "We don't have a mapping of `validator_index` to `geographical location` for privacy reasons which will make the above questions hard to answer. We have a lot of other data, like from Contributoor, which is home stakers sending us data: https://ethpandaops.io/data/xatu/\n\nIt's all publicly available, feel free to PM me if you need a hand getting setup or you have any questions \u003c@893667743830802434\u003e 🙏",
        "created_at": "2025-07-17T23:19:26.840000+00:00",
        "attachments": null
    }
]