[
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "\u003c@543900561460822016\u003e here you go",
        "created_at": "2021-06-22T17:08:35.479000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "perfect, thank you",
        "created_at": "2021-06-22T17:08:47.048000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "repost from telegram: \n\n\u003e Where we're at now:\n\u003e \n\u003e We've i) successfully generated the genesis state root for mainnet (mpt impl is working to some degree) and ii) we've processed a very simple transaction that adds two constants and sstores them (we cut some corners like skipping PoW check and some simpler header checks), but I think soon we can begin more rapidly develop the spec.\n\u003e \n\u003e What we're working on now:\n\u003e \n\u003e Polishing what we have and PRing it into the upstream eth1.0 spec repo. This will let us keep developing the rest in open. I'd like to have that opened this week, then get back to building out the spec. We're starting with the frontier fork and plan to implement each fork sequentially. We're taking two slightly different approaches from the eth2 spec. 1) we're compiling code docs to \"the spec\" instead \"the spec\" into something executable. we think this has several benefits, but it will be interesting to compare the two approaches as we go. 2) we want to avoid the concept a \"fork\" in the spec. The idea here is \"the spec is latest implementation of the protocol\". We think this will make reading the spec and modifying the spec much simpler. To test the functionality of forks, we'll have some \"release\" mechanism for the spec where we release a version of the fork. You can think of it like bumping major in semver. We'll have a tool and an interchange format (e.g. spit out entire state trie) that will shuttle state from one release to the next.",
        "created_at": "2021-06-22T17:09:27.174000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "and we just opened a PR against the upstream specs repo: https://github.com/ethereum/eth1.0-specs/pull/219",
        "created_at": "2021-06-22T17:10:38.224000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "I ran through the PR with a fine toothed comb.  There's nothing in there that stood out as \"must resolve\".  I left a lot of nitpicky comments and suggestions about style.  You can ignore all of them and I'm still 👍",
        "created_at": "2021-06-22T20:27:02.788000+00:00",
        "attachments": null
    }
]