[
    {
        "author": "peter.davies",
        "category": "general",
        "parent": "",
        "content": "Is there any pull request chasing etiquette I should know? I responded to the feedback on my eth2.0-specs pull request (https://github.com/ethereum/eth2.0-specs/pull/2496). Do I need to poke people about it and if so, how?",
        "created_at": "2021-07-01T16:10:36.214000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "cc \u003c@!291925846556540928\u003e ^ (not sure who else to tag that would be considered a maintainer of that repo)",
        "created_at": "2021-07-01T17:31:18.276000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "I need to take a look. and I'm sure hsiao-wei will do a followup\n\nitems that aren't on the immediate altair and merge spec and testing front just will take more time to hammer out",
        "created_at": "2021-07-01T17:47:51.601000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "very mmuch appreciate the contribution!",
        "created_at": "2021-07-01T17:47:58.626000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "I'm fine with different approach to (1) with a note that I hope we can conform on something by end of year\n\nAs for (2), I'm pretty unsure of the best approach. I think both have significant up and downside! \nWe actually discussed why no client has even tried maintaining separate binaries for different fork logic and just having a router/manager wrapped around it to be a full production client\n\nI think on eth2 side, even if we continue to build as we do today, I *think* we should be able to import multiple versions of a library without too much issue to be able to execute across fork boundaries for certain testing",
        "created_at": "2021-07-01T17:51:52.434000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I will say as a client implementer, that getting a spec which clearly shows the difference between forks is absolutely invaluable. If the Altair spec had been completely stand alone it would have been nearly impossible to find all the differences. We the changes prior to launch we had to diff the different versions of the spec and work through every little change which then makes it very difficult to ever rearrange the spec because that just makes everything appear changed in the diffs.",
        "created_at": "2021-07-01T21:34:35.834000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "interesting, i would’ve thought an “altair diff” would be much easier?",
        "created_at": "2021-07-01T21:44:19.947000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "the spec as given is essentially just the diff",
        "created_at": "2021-07-01T21:44:54.154000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "if something is \"missing\" it should be understood to be in the phase 0 spec",
        "created_at": "2021-07-01T21:45:10.620000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "☝️ Yep, that.  If you never do any reformatting or rearranging, then having to complete specs that you do a `git diff` type thing on is ok, but you can't ever reformat or rearrange things without doing the exact same thing to all versions so the diffs still work.  Essentially you're now maintaining a full spec for each fork (which is a lot of duplication) *and* have to carefully track the meta-version generated by diffing them.",
        "created_at": "2021-07-01T21:47:55.348000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "And for the record, I was part of the team that helped build Besu and it actually worked quite well to just start by implementing Frontier, then layer the next fork on top of that, then the next etc.  So a spec like the eth2 specs still works really well for that.\n\nI can definitely see that for people who just want to consult the spec for a specific topic that having the latest version as a complete spec makes life a lot easier.  So in my ideal world I'd have a diff based spec for each fork but also maintain a collapsed version for the latest fork - which funnily enough is pretty much what we have for eth1 with EIPs and the yellow paper, I'd just like the EIPs to be easier to find and the yellow paper more readable and up to date.",
        "created_at": "2021-07-01T21:51:29.888000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "Just providing this as one piece of feedback btw, not a demand or with any kind of confidence that I'm normal. 🙂",
        "created_at": "2021-07-01T21:52:06.095000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "yeah, just beacuse you *write* it as a diff, doesn't mean it needs to be displayed as a diff in the docs",
        "created_at": "2021-07-01T21:55:43.344000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "and I suppose that being able to toggle \"full london\" vs \"diff london\" would be incredibly useful",
        "created_at": "2021-07-01T21:56:12.462000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "another thing that came up in an irl convo with \u003c@!543900561460822016\u003e would be if you could toggle \"annotated\" on/off",
        "created_at": "2021-07-01T21:57:17.632000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "That type of rich feature makes me *much* more interested in the eth1.0-specs style than I was previously",
        "created_at": "2021-07-01T21:57:32.948000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "like rendering code + doc-strings + prose vs just the code?",
        "created_at": "2021-07-01T22:26:38.174000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "general",
        "parent": "",
        "content": "yes and something more rich than markdown rendering",
        "created_at": "2021-07-01T22:27:01.307000+00:00",
        "attachments": []
    }
]