[
    {
        "author": "joeysantoro",
        "category": "general",
        "parent": "",
        "content": "Hoping to get more feedback on EIP-7528: ETH (Native Asset) Address Convention  in the Eth Magicians forum https://ethereum-magicians.org/t/eip-7528-eth-native-asset-address-convention/15989\n\nIt proposes a convention for using the address 0x000000000000000000000000000000000000000E (0xe) in all contexts where an address is used to represent ETH in the same capacity as an ERC-20 token, including events and function methods.\n\n0xeeee is currently used more frequently but 0xe has cheaper calldata.\n\nCritically the proposal stipulates the address be reserved for a future precompile of an enshrined ERC-20 implementation, if this is ever desired. The benefit of reserving is primarily to give the address more importance and prevent collisions with other precompiles, rather than pushing for an enshrined ERC-20.",
        "created_at": "2023-10-12T18:53:53.252000+00:00",
        "attachments": null
    },
    {
        "author": "joeysantoro",
        "category": "general",
        "parent": "",
        "content": "\u003c@552133098075193354\u003e referencing your message in \u003c#745077610685661265\u003e the goal is not to enshrine anything in protocol for this EIP, purely reserve the address and establish a convention for how it should be used now and in the future. Do you think the EIP accomplishes this well? I may want to update the abstract to be super clear about reserving the precompile",
        "created_at": "2023-10-12T18:57:03.303000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "The challenge is I'm not sure \"where\" we should reserve that address. I know we have a list of transaction types somewhere, so perhaps there? I think if we go that route, then it makes sense for the EL python spec to potentially have a note too?",
        "created_at": "2023-10-12T19:02:04.369000+00:00",
        "attachments": null
    },
    {
        "author": "joeysantoro",
        "category": "general",
        "parent": "",
        "content": "where are the precompiles canonically referenced? in the EL spec?",
        "created_at": "2023-10-12T19:04:07.472000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "yeah, see: https://ethereum.github.io/execution-specs/autoapi/ethereum/shanghai/vm/precompiled_contracts/index.html",
        "created_at": "2023-10-12T19:05:39.530000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "but this is a bit weird because it would not \"be a precompile\" as much as \"be reserved as a precompile\"",
        "created_at": "2023-10-12T19:05:59.643000+00:00",
        "attachments": null
    },
    {
        "author": "joeysantoro",
        "category": "general",
        "parent": "",
        "content": "its not so weird to me, seems like the perfect place",
        "created_at": "2023-10-12T19:06:55.153000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "For example, the BLS precompile EIP would probably conflict with your proposal, as it introduces 9 precompiles and and they are in increasing address order: https://eips.ethereum.org/EIPS/eip-2537",
        "created_at": "2023-10-12T19:07:27.860000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "the reason it's weird is that the spec describes the canonical behavior. If we just \"reserve\" the address, and don't have a consensus rule about it, then it shouldn't be in the spec, as clients make no assumptions about what is at that address. A valid contract \"could\" be deployed there and follow all consensus rules",
        "created_at": "2023-10-12T19:08:22.283000+00:00",
        "attachments": null
    },
    {
        "author": "joeysantoro",
        "category": "general",
        "parent": "",
        "content": "those types of proposals could be updated to increase from 0xf if they needed to be contiguous",
        "created_at": "2023-10-12T19:08:25.127000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "oh yeah, they can be updated, all I'm saying is that now there is no great way for them to even know this is an issue except you raising it 😛",
        "created_at": "2023-10-12T19:09:20.292000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "whereas, for EOF, we actually have an in-protocol rule about address validity, see: https://eips.ethereum.org/EIPS/eip-3541",
        "created_at": "2023-10-12T19:09:31.093000+00:00",
        "attachments": null
    },
    {
        "author": "joeysantoro",
        "category": "general",
        "parent": "",
        "content": "Ah I see what you mean now. So either updating the current eip to core track and following that same format could be the optimal outcome?",
        "created_at": "2023-10-12T19:19:49.743000+00:00",
        "attachments": null
    },
    {
        "author": "joeysantoro",
        "category": "general",
        "parent": "",
        "content": "Is 3541 about address validity or code validity",
        "created_at": "2023-10-12T19:28:02.393000+00:00",
        "attachments": null
    },
    {
        "author": "joeysantoro",
        "category": "general",
        "parent": "",
        "content": "My read of it is that its the actual contract code. Something more like https://eips.ethereum.org/EIPS/eip-1352 is what has been proposed to reserve those addresses for precompiles. In that EIP it even says no explicit in protocol rules are required. Updating the EL spec should be good enough to allow others to know about this issue without needing any protocol changes imo",
        "created_at": "2023-10-12T19:30:56.352000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "ah, you're right, yes! Yeah, I'm not familiar enough with how the spec works to know if there's a way to have a sort of \"notice\" that's not interpreted as a \"spec code\". cc: \u003c@243183686562873344\u003e ?",
        "created_at": "2023-10-12T19:47:58.486000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "and yeah, then maybe also having an EIP for it that's purely informational could be valuable.",
        "created_at": "2023-10-12T19:48:12.131000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Also, a _very_ easy fix to your problem, but that will cost users extra gas forever, is to just use 0xEEEEE..EEE and this way you know for sure a precompile won't ever be deployed there because we go incrementally 😛",
        "created_at": "2023-10-12T19:49:09.559000+00:00",
        "attachments": null
    },
    {
        "author": "joeysantoro",
        "category": "general",
        "parent": "",
        "content": "This is a real possibility! I want to fully explore the other path first to save that sweet sweet gas",
        "created_at": "2023-10-12T20:14:26.534000+00:00",
        "attachments": null
    },
    {
        "author": "peter.davies",
        "category": "general",
        "parent": "",
        "content": "I don't think we have a clear process or understanding of how to deal with negative claims (situation X is impossible) about Ethereum. I'm planning to bring https://eips.ethereum.org/EIPS/eip-7523 to ACDE soon. It makes a big negative claim (no empty accounts on merged networks) and which should provide an opportunity to discuss the issue.",
        "created_at": "2023-10-12T21:38:20.281000+00:00",
        "attachments": null
    }
]