[
  {
    "author": "catwith1hat",
    "category": "general",
    "parent": "",
    "content": "I was discussion some beacon-API spec semantics with <@654267572107083777> yesterday, and we were both surprised about how Prysm/Lodestar handled an empty \"allowlist style\" array. This lead me to task Claude with a full review of the beacon-API spec for inconsistency and underspecifications. I am a bit surprised by how comprehensive the result is (and that it burned north of 200k tokens for this work).\n\nHere is the full report: [Ethereum Beacon API: Ambiguities and Underspecified Behavior](https://github.com/catwith1hat/beacon-APIs/blob/spec-check/IMPROVEMENTS.md#ethereum-beacon-api-ambiguities-and-underspecified-behavior). <@654267572107083777> saw a preliminary version of it yesterday and rightfully remarked that this is a low signal to noise document, so I added a [top-20 risks for interop section](https://github.com/catwith1hat/beacon-APIs/blob/spec-check/IMPROVEMENTS.md#top-20-interoperability-risks) at the bottom of the document. Each top-20 has an argument why this is an interop risk, and reading through a couple, I have the impression that this is a useful list overall.",
    "created_at": "2026-02-16T08:35:29.562000+00:00",
    "attachments": []
  },
  {
    "author": "nflaig",
    "category": "general",
    "parent": "",
    "content": "just a quick pass on your top 20 list\n\n1. not true, the version header is only needed if it's a versioned payload (ie. one that changes across forks)\n2. don't unterstand this, there is a schema per fork or if not the previos fork schema is used\n3. implementation detail not sure they spec should define that but sure\n4. wip, so expected\n5. attesting to syncing head = slashing? strange claim\n6. up to client what default to use\n7. unit64 should be clear enough\n8. yeah that is probably underspecified on some apis\n9. yeah, that one is bad, but changing it would be breaking and requires a v2 endpoint\n10. yes because schema didn't change, expected\n11. don't get that one, ssz encdoing is always on `data`, other fields are metadata\n12. sure errors could be more defined 503 is likely missing in a few places (validator apis mostly)\n13. I believe unit8 is correct here\n14. tjat endpoint is very old (from phase0), I would expect client are pretty aligned on the behavior\n15. I defined that for some endpoints a while ago but likely underspecified for others\n16. yeah seems like a bug\n17. worth fixing, seems like copy paste mistake\n18. I am pretty sure we defined that response can't have mixed attestation types (see return type of api)\n19. that well defined in CL spec, but a reference to that would be good\n20. 503 for syncing is not relevant for all endpoints\n\nNote: I haven't even read the details of each issue, just went through the table for most, could probably open separate PRs to clean a few up",
    "created_at": "2026-02-16T18:40:49.752000+00:00",
    "attachments": []
  },
  {
    "author": "catwith1hat",
    "category": "general",
    "parent": "",
    "content": "Thanks for taking the effort going through the list. I might copy&paste your comments back to an agent orchestrator, so that for each line you agreed, I get some type of proposal. At the same time, I want to be careful to create meaningful improvements to clarity and not just create a distraction factory.",
    "created_at": "2026-02-16T22:04:07.823000+00:00",
    "attachments": []
  }
]