[
    {
        "author": "onqtam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hello,\n\nI recently read the code-merkleization post on the ethereum blog and I have some thoughts: can't we skip code-merkleization by adding 1 new hash to the block header? I propose the following:\n\n- regarding the contract part of the witness: instead of code-merkleization each such witness should include just the chunks of the byte-code (either of size 32, 64, or whatever) along with a (sparse?) bitmap that represents which chunk should go where in the contract when laid out as bytecode in order for it to be executable - as an example if some contract is 340 bytes and the chunking is done on 32-byte boundaries then a possible 11-bit bitmap could look something like 01101011000 and along with it should be passed 5 chunks of 32-bytes of bytecode for the relevant referenced parts of the contract - just like in the case of code-merkleization\n- the witness should be comprised of the referenced state merkle proof (+ whatever else is in the witness format - I'm not familiar) + the code-related part which is a bunch of chunks \u0026 the placement bitmap for them - as discussed in the point above\n- the node that produces the current block executes some transactions in a specific order - it can construct witnesses for each transaction and also hash them and we can produce a merkle trie of those witness hashes (deterministically based on the order of execution) and we can then add a new field in the block header - the witness merkle root for all of the transactions\n- light clients would then need to just hash the witness(es) they've received (along with the witness proofs) and compare that to the witness root in the block - this could work for single transactions, parts of the transactions in a block, or even the whole block",
        "created_at": "2020-12-07T16:56:56.439000+00:00",
        "attachments": null
    },
    {
        "author": "onqtam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": ".\nTo sum up: everything related to a transaction (state merkle proof, code chunks \u0026 bitmap) ends up in a witness. The witnesses for all transactions in a block are hashed and a witness trie is constructed and then it's root is put in the block header by the block producer. Then some client may request the witness for a specific transaction and along with it a witness proof will be sent in order for the root to be validated. With blocks averaging ~200 transactions this merkle proof shouldn't be too big and multiple witnesses for multiple transactions can be sent together with a combined witness proof to validate the root for them.\n\nWith the addition of 1 root hash to the beacon block (hard fork...) we can eliminate the need for code merkle proofs by utilizing a bitmap and a witness trie - we might even be able to reduce chunking to 8 bytes if it's more optimal (roaring bitmap? etc... IMHO it could go as low as 1-2 bytes per chunk). Block producers will always be producing witnesses, and so will any other full node - they will produce the same witnesses and reconstruct the witness trie in order to validate the witness root in the beacon block from the proposer.\n\nI think I've read somewhere that adding something related to witnesses to the block headers is being considered but I'm not familiar with that so I decided to write this here. This can reduce witness size quite a bit and might be applied to the state trie as well (even though it's constantly changing - unlike the static contract code) so that merkle proofs for the state aren't necessary - not with a bitmap but perhaps with some uniquely-identifying trie-branching addressing scheme for the state at the time of execution - for example for a tree with 8 children per node `1/3/0/7/3` is a path from the root down to level 5 of the tree =\u003e way shorter than providing a bunch of 32-byte merkle proof hashes for a specific piece of data - removing the need to switch to a binary trie for the state to reduce witness size!",
        "created_at": "2020-12-07T16:57:05.798000+00:00",
        "attachments": null
    },
    {
        "author": "onqtam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This might be jibberish - my understanding of ethereum state, light clients and witnesses is probably way off. However, if this does make sense I can post it on ethresear.ch (with better wording and pictures) if that's the right place for this",
        "created_at": "2020-12-07T17:10:30.027000+00:00",
        "attachments": null
    },
    {
        "author": "howd2333",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@709839792308748308\u003e it's shud be a PR",
        "created_at": "2020-12-07T19:27:54.608000+00:00",
        "attachments": null
    }
]