[
    {
        "author": "_drinkcoffee",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e If account versioning is introduced you could potentially have contracts with different merkleization schemes simultaneously and transition gradually. That would mean however that clients must then be able to handle all of these variants. Interaction between different versions becomes complicated too\nAnother thing to consider is that we might not have \"versions\" which implies a higher version is newer and \"better\", but might have \"variants\", that is equally valid alternatives. One variant might be more appropriate that another for a certain contract. However, what happens if a new variant comes out, and someone wants to use the new variant.  I guess rather than methodology \"version\" maybe you could have a per-contract \"version\", and the latest per-contract \"version\" would be used.\nI am not sure that there would be interaction between different code merklization variants. How could that happen?",
        "created_at": "2020-06-25T02:05:24.048000+00:00",
        "attachments": []
    },
    {
        "author": "_drinkcoffee",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e Why do the ERC20 contract functions use code all over the place from the contract?\n\u003e Is it because they use lots of helpers that solidity calls into?\n\u003c@!273808422753796097\u003e yes it is. There is the code at the start of the contract to check for (is value != 0 \u0026\u0026 none of the functions are payable), then there is the function selector jump table, and then within functions there are helpers, for example loading a value from storage. Additionally, if there are multiple functions that use common code, for instance they all end with \"return bool\", then that common code will be separate.",
        "created_at": "2020-06-25T02:10:56.039000+00:00",
        "attachments": []
    },
    {
        "author": "_drinkcoffee",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e Couldn't that just be changed at the solidity level?\n\u003c@!273808422753796097\u003e Yes. Sort of. There is a discussion about this in the Q\u0026A time at the end of the talk / video. \nFor historic contracts, they can't be changed - which is the \"sort of\".\nFor contracts deployed in the future, the pricing could be set-up to influence Solidity developers (and other programming languages) to create code that produces functions on code chunk / code merklization boundaries, assuming fixed chunking.",
        "created_at": "2020-06-25T02:15:09.393000+00:00",
        "attachments": []
    },
    {
        "author": "s1na",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e I am not sure that there would be interaction between different code merklization variants. How could that happen?\nI was referring to a general criticism against account versioning. Like if you call a contract that has a different version, or if you do CREATE from a contract with variant 2 vs variant 1, etc. So far we don't have evidence that different approaches are much more suited to some use-cases/contracts vs others, and in that case i don't see why adding this complexity of handling multiple variants is worthwhile",
        "created_at": "2020-06-25T11:25:05.785000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I would advocate for simple account versioning and for this to only be used up determine whether an account has been \"upgraded\" yet, and for the upgrade to happen automatically anytime the account is touched.",
        "created_at": "2020-06-25T18:02:51.890000+00:00",
        "attachments": []
    },
    {
        "author": "_drinkcoffee",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003eSo far we don't have evidence\nI think we need to do more work to gather the evidence to definitively prove that methodologies are better or worse. My hope is that I will have had time to use the methodology we at TeamX have in place to analyse a million blocks (9M to 10M) for all contracts. This will still only be an approximation as it will assume all accessible code for a function is executed for each transaction.",
        "created_at": "2020-06-25T22:43:03.716000+00:00",
        "attachments": []
    }
]