[
    {
        "author": "onqtam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There's quite a bit of misunderstanding on my end in what I wrote yesterday regarding the state trie and the granularity of witnesses (for a single transaction (if that's a thing at all..) vs for a whole block) - I'm reading up on everything I didn't fully understand and will make another attempt at this. I don't think a PR against the witness spec is the way to go, so I'll post something here again.",
        "created_at": "2020-12-08T15:32:42.318000+00:00",
        "attachments": null
    },
    {
        "author": "s1na",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e I think I've read somewhere that adding something related to witnesses to the block headers is being considered\n\u003c@!709839792308748308\u003e yeah a hash of the witness (or access list) might be added to the block header regardless of code merkleization.\nWell here you're talking about light clients which have different security assumptions than stateless clients. You might be right that some light clients (depending on their security requirements) might be happy without code merkle proofs if the block has been buried deep enough in the chain.\nStateless clients however validate blocks independently, like a normal client. And there the problem is that without the merkle proofs (only chunks + bitmaps) they can't verify the correctness of the contract bytecode.",
        "created_at": "2020-12-08T15:32:47.456000+00:00",
        "attachments": null
    },
    {
        "author": "onqtam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!259648573401071617\u003e I also confused light and stateless clients yesterday - I meant stateless. Will try to come up with something more coherent.",
        "created_at": "2020-12-08T15:34:31.020000+00:00",
        "attachments": null
    },
    {
        "author": "onqtam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!259648573401071617\u003e can you point me to any online resource related to adding witnesses (or hashes of witnesses) to blocks?",
        "created_at": "2020-12-08T15:37:11.901000+00:00",
        "attachments": null
    },
    {
        "author": "s1na",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!709839792308748308\u003e Looking forward to reading it when you come up with something!\nIt might be difficult to overcome the need for those proofs though. To reduce the hashes sizes Vitalik proposed using polynomial commitments which have constant (and small) proof sizes. That's an interesting direction to explore",
        "created_at": "2020-12-08T15:37:23.565000+00:00",
        "attachments": null
    },
    {
        "author": "s1na",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "hm can't really think of a resource on that. I remember it only being discussed on some calls? top of my head the reason for adding a hash is to have a canonical version of the witness and to make it harder for clients to serve incomplete or too large witnesses",
        "created_at": "2020-12-08T15:39:35.915000+00:00",
        "attachments": null
    }
]