[
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "https://github.com/status-im/nim-beacon-chain/blob/interop/multinet/run_prysm.sh - prysm build \u0026 launch script added, thanks \u003c@399309815517544451\u003e !",
        "created_at": "2019-09-20T03:22:42.214000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "https://github.com/status-im/nim-beacon-chain/blob/interop/multinet/run_lodestar.sh - lodestar added, thanks \u003c@322222239850168331\u003e ! this script is preliminary, it might need some minor adjustments still",
        "created_at": "2019-09-20T06:43:50.102000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "I'm not really an expert at build systems or shell scripts, so patches welcome - I'll keep tweaking the scripts, but with a `USE_MULTITAIL=1 ./run_all.sh` I can get a network up and running pretty quickly and everything with native binaries so it's easy to debug (minus lodestar, but we'll get there soon :))",
        "created_at": "2019-09-20T06:48:22.088000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "I don't have scripts for:\n* artemis - one was floated, but it was pretty complex and I heard there  were improvements coming to the build process - when that has stabilized, happy to get it going (\u003c@604062686623432740\u003e )\n* shasper - ping \u003c@242032644232183808\u003e \n* harmony - ping \u003c@425572898787426305\u003e",
        "created_at": "2019-09-20T06:54:04.317000+00:00",
        "attachments": []
    },
    {
        "author": "jonny.derp",
        "category": "Testing",
        "parent": "",
        "content": "I'll write one for Artemis tomorrow (if not tomorrow very, very soon) .  I don't want to burden you with a bunch of weird dependencies so lemme try to streamline it for you.",
        "created_at": "2019-09-20T06:55:15.003000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "the scripts are really meant to be an easy starting point to test with a specific client.. they conveniently print the start commands, how to setup validators etc for each client - once they've run once and built the client it's meant to be easy to launch the client from command line \"manually\"",
        "created_at": "2019-09-20T06:55:53.199000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "yeah. I tried to balance what's system deps and whats build deps for the client.. generally, the scripts assume basic language support installed by the package manager of your OS while more.. er.. unique build aspects are mostly covered by the scripts",
        "created_at": "2019-09-20T06:57:10.350000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "generally looking at the scripts, I think it might make sense to launch clients with ssz state instead of num_validators/genesis_time - this way a state generator can be used once, and then the state is passed to every client the same way. in the scripts I use the nimbus state gen, but any could be used really (I vaguely remember that `zcli` might have the option).",
        "created_at": "2019-09-20T07:00:51.910000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "if we want to launch from an arbitrary state, it might make sense to adjust that to include (state, block) - that should be enough to launch from non-genesis blocks as well (you can't generate the genesis block for a non-genesis state, so there's a bit of an inconvenience to bootstrap without a block)",
        "created_at": "2019-09-20T07:02:04.282000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "potentially the block could be synced from other clients, but  I have a feeling that might be messy - haven't implemented yet though, so not sure",
        "created_at": "2019-09-20T07:03:21.302000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Testing",
        "parent": "",
        "content": "Zcli can generate interop testing keys, split key list files, and ingest them to create a genesis state with 👍",
        "created_at": "2019-09-20T07:04:53.405000+00:00",
        "attachments": []
    },
    {
        "author": "jonny.derp",
        "category": "Testing",
        "parent": "",
        "content": "\u003c@449019668296892420\u003e  I used zcli to generate a single genesis.ssz state and validator keys when running the 7 node interop script.  We have since migrated to jvm libp2p so I don't have everything working 100%, but this script essentially does what you are talking about.  It isn't 100% generic though bc of some hardcoded paths, but it might be useful to look at and adapt (or maybe not).  https://github.com/PegaSysEng/artemis/blob/a42b9b74477cdb811ee03b6c9f709ae30d716c04/scripts/interop.sh",
        "created_at": "2019-09-20T07:14:11.985000+00:00",
        "attachments": []
    },
    {
        "author": "jonny.derp",
        "category": "Testing",
        "parent": "",
        "content": "^ edited...had the wrong link",
        "created_at": "2019-09-20T07:15:25.475000+00:00",
        "attachments": []
    },
    {
        "author": "jonny.derp",
        "category": "Testing",
        "parent": "",
        "content": "to get it to work originally, I had to run all lodestar validators.  also, there might have been an issue with my nimbus config.  😜",
        "created_at": "2019-09-20T07:17:09.487000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "👍 most clients support variations of `start_validator_num, end_validator_num` or `start_validator_num,validator_count ` or custom keyfiles - every client is different here though in terms of how it loads keys and how it numbers validators (start/end vs start/number - I prefer the latter as it's unabigous in terms of open/closed range)",
        "created_at": "2019-09-20T07:37:23.647000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "no strong opinion on how it should pick which validators to run, but I guess in some distant future it'll be keyfiles. I'll check out `zcli` and how it splits up keys and see if that's easy to launch with, for now the scripts take `(start/number)` and convert to whatever the client needs",
        "created_at": "2019-09-20T07:39:02.205000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "\u003c@604062686623432740\u003e that's a good start, though the other scripts include instructions for cloning and building.. I like that because I can quickly look at the source in case there's something funny",
        "created_at": "2019-09-20T07:40:01.035000+00:00",
        "attachments": []
    },
    {
        "author": "sorpaas",
        "category": "Testing",
        "parent": "",
        "content": "We don't have script yet. Will try to get it done soon.",
        "created_at": "2019-09-20T07:41:06.247000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "\u003c@449019668296892420\u003e I have this script on a list. Would like to merge interop branch first and do some cleanups, it will, also, make sense to publish jvm-libp2p artefacts in order to avoid its local building. The letter thing now make sense to Artemis too 😉 \n\nAs I said before, I don't see a problem to start from any arbitrary state without a block if this state is considered as a finalized one. Actually, it would be better to implement a PoC cause I might miss something here.",
        "created_at": "2019-09-20T07:41:21.138000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "\u003c@425572898787426305\u003e yep - curious to hear how it goes - the problem we discussed was that we ideally want to have the full block contents of that block also, and not just header (for example to get the attestations right for fork choice)",
        "created_at": "2019-09-20T07:42:56.965000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "If this is finalized checkpoint you probably don't need to bootstrap the fork choice.",
        "created_at": "2019-09-20T07:44:22.987000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "that's a good point. if the header thing works, we can get the root and eventually download the block as well - I know that for us, it would be a bit of a mess that way because we don't really work with headers for now (only roots or full blocks, and we probably wouldn't want to implement header handling just for this reason)",
        "created_at": "2019-09-20T07:46:30.465000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "We don't work with them either. And I agree that it would be an overkill if we segregate headers only to bootstrap chain start with less data. Need to think more about headers, whether we need them segregated or not.",
        "created_at": "2019-09-20T07:52:22.593000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "notably, we've removed the header requests from the Req/Resp protocol, for similar reasons (simplicity/no real usecases identified)",
        "created_at": "2019-09-20T07:55:56.304000+00:00",
        "attachments": []
    },
    {
        "author": "jonny.derp",
        "category": "Testing",
        "parent": "",
        "content": "\u003c@449019668296892420\u003e ya understood about need install instructions.  the point of sharing it was to show how I ran the 7 clients on bare metal. it sounded like there was some overlap between what u r doing and that script I wrote. all good, disregard if it isn't helpful.",
        "created_at": "2019-09-20T08:01:31.850000+00:00",
        "attachments": []
    },
    {
        "author": "jonny.derp",
        "category": "Testing",
        "parent": "",
        "content": "I'll make an easy to use artemis as soon as I can",
        "created_at": "2019-09-20T08:02:09.024000+00:00",
        "attachments": []
    }
]