[
    {
        "author": "bitfalls",
        "category": "Testing",
        "parent": "",
        "content": "But if there's no option under which Eth2 will be running without Eth1, and given the various edge cases that can happen with deposits (fractional deposits which require ignoring subsequent deposit data and only increase balance of the first one, selfdestructs that deposit into the contract, overdepositing...) wouldn't it make more sense to have a primitive starter that actually _can_ track these changes and react to them from the get go rather than tack it on after the \"no new deposits\" start has been ironed out? A simple ganache script like the one in Thundercloud is IMO more than enough to cover all the cases, simulate delayed and fractional transactions, and more. I'm all for starting simple, but if there's no way a car will ever have rectangular wheels in production, why do unit testing for rectangular wheels at all?",
        "created_at": "2019-08-20T08:54:21.131000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Testing",
        "parent": "",
        "content": "There is also no option in which the interop network spec will be used in production, but we need to make compromises in our initial testing.\n\nI know based on conversations and initial survey feedback that adding a standard mocked eth1 server to progress eth1_data and deposits in our initial testnets during September is out of the question. This small mocked standard is an effort to that eth1 data updates at all, but is not strictly required during these interop tests. We could also put junk in eth1 data votes to ensure no new data is reached. \n\nThat said, I'd love to spec a standard for mocked eth1 chain that can provide continual fake block + deposit data. This is certainly a crucial component to be able to test this in a near production fashion.\n\nFurther down the line, I'd like to have our public eth2 testnets link to a public eth1 testnet to fully test the connection",
        "created_at": "2019-08-20T22:37:31.028000+00:00",
        "attachments": []
    }
]