[
    {
        "author": "nishant0",
        "category": "Testing",
        "parent": "",
        "content": "I dont think it would be that simple at least with an unmodified deposit contract. If we end up pre-loading deposits into the genesis state, there is no way to add in new deposits into goerli without some out of band logic to account for the preloaded deposits.\nex:\nhttps://goerli.etherscan.io/address/0xff50ed3d0ec03ac01d4c79aad74928bff48a7b2b#code\n\nin the currently deployed contract on goerli, new deposits would have an index starting from 0 , which would clash with the current validator set.",
        "created_at": "2021-03-17T03:45:56.667000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "The deposit index doesn't necessarily match the validator index though.  You might have invalid or partial deposits for instance. So the next deposit index to expect is 0 and the next validator index to assign will be 210k + 1.",
        "created_at": "2021-03-17T03:49:28.331000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "It's unusual to have it that way around - the common case is the next deposit index being greater than the next validator index.",
        "created_at": "2021-03-17T03:50:04.335000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Testing",
        "parent": "",
        "content": "I am not sure if it will be that simple in this case, especially in the context of eth1 voting and processing new deposits, will have to look more and see if there are issues with determining the correct deposit root with new deposits.",
        "created_at": "2021-03-17T03:58:47.534000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "Yeah it's definitely a new case we're hitting.  Theoretically I'm pretty sure it should work.  Whether it does in practice I'm less sure. 🙂",
        "created_at": "2021-03-17T04:00:38.931000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Testing",
        "parent": "",
        "content": "Yeah that is always the worry haha , lets see how it goes after the first voting period",
        "created_at": "2021-03-17T04:03:01.347000+00:00",
        "attachments": null
    },
    {
        "author": "donschoe",
        "category": "Testing",
        "parent": "",
        "content": "What's the difference of \"PreGenesis Local ENR\" and L\"ocal ENR\" in Teku? I'm setting up Prater bootnodes.",
        "created_at": "2021-03-17T10:45:55.917000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Testing",
        "parent": "",
        "content": "Pre genesis the validator root isn't known yet, so it defaults to a zeroed root, and results in a different fork digest which nodes will have in the ENR until the genesis state is known.",
        "created_at": "2021-03-17T11:33:14.273000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Testing",
        "parent": "",
        "content": "So I think that's the difference in Teku, correct me if I'm wrong",
        "created_at": "2021-03-17T11:33:41.435000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Testing",
        "parent": "",
        "content": "Validator root is listed in the PR I made to the Prater doc. In case you need it anywhere. My eth2-bootnode tool accepts it to compute fork digest with for example",
        "created_at": "2021-03-17T11:35:15.284000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "Yep, that's right.  Either ENR should work fine but since the genesis one is known may as well use the \"Local ENR\".  I *think* after the first startup only the \"Local ENR\" is shown but I could be wrong on that.",
        "created_at": "2021-03-17T20:56:28.385000+00:00",
        "attachments": null
    }
]