[
    {
        "author": "jimmygchen",
        "category": "Testing",
        "parent": "",
        "content": "what i meant was adding a dedicated network profile built in to each client, e.g. so when users start the clients with `--stakers-testnet`, it points to its current network config file (e.g. network ID 55555). \nWhen it's time for the network to reset, client teams could update just the network ID \u0026 chain ID for this network configuration (e.g. to 66666), so that running the new version of clients with `--stakers-testnet` would point to the new testnet (66666). \nUsers running old versions of the client would still be on the old testnet (55555). The old testnet then dies naturally once everyone stop running the old client version. This could be useful for practicing the staking setup, but less useful for multi-version interop testing.. (still possible to do so via providing the config file via the command). I guess the benefit is that it doesn't require any rollback mechanism to be built into client code, and only requires client to add a new network configuration, and update once in a while.",
        "created_at": "2022-11-11T14:23:39.748000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "Testing",
        "parent": "",
        "content": "(sorry for the late response - was on a long-haul flight)",
        "created_at": "2022-11-11T14:24:22.488000+00:00",
        "attachments": null
    },
    {
        "author": "tmiychao",
        "category": "Testing",
        "parent": "",
        "content": "Got it, thanks for elaborating on this! It sounds a bit like a hard fork to me, since only those who update will participate in the new network. But compared to a normal hardfork, there is no way for people to update in advance and old network will just continue as a fork. Another trade off is an overhead for client devs who have to update network periodically and for genesis validators/infrastructure providers to update at certain time. Coordination mechanism in client itself would make it much smoother. Maybe there could be a compromise of manual updates + checks in the client software",
        "created_at": "2022-11-11T17:14:46.071000+00:00",
        "attachments": null
    }
]