[
    {
        "author": "jimmygchen",
        "category": "Testing",
        "parent": "",
        "content": "What's everyones' view on client teams rolling out new network configs ( when needed) for this new staker-testnet client option, rather than building a rollback mechanism? I think some of the ideas proposed could help with extending the lifetime of this testnet, so the reset doesn't happen to often and introduce too much overhead",
        "created_at": "2022-11-05T09:52:13.607000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "Testing",
        "parent": "",
        "content": "potential downside (or not) i see is validators running older versions of the clients would stay on the old testnet until it dies, and updating the client version would force them to join the new testnet",
        "created_at": "2022-11-05T09:53:32.316000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Testing",
        "parent": "",
        "content": "As long as that decreases, not increases, load on the client teams. I'd be a bit worried that we are tying up resources with \"here's your quarterly testnet reset\"",
        "created_at": "2022-11-05T09:56:58.441000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "Adding the config to clients is really simple so I wouldn't worry about that. But generally client teams run the majority of validators and the setup of the boxes to run that is quite time consuming. We can automate it further but that will take a fair bit of effort too.",
        "created_at": "2022-11-05T11:02:57.863000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Testing",
        "parent": "",
        "content": "That's relative to running a new testnet, regardless of whether it's ephemeral, is that right?",
        "created_at": "2022-11-05T11:13:13.150000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Testing",
        "parent": "",
        "content": "ethstaker may be able to help with initial setup. I have ansible runbooks that initial-configure the host and then run an ethereum node in docker, any client combination",
        "created_at": "2022-11-05T11:18:55.300000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "Yes. We also have a lot of automation including spinning up new hosts etc but there’s always something involved that winds up taking a bunch of time. It would probably get more streamlined if we did it more often though.",
        "created_at": "2022-11-05T21:20:53.207000+00:00",
        "attachments": null
    }
]