[
    {
        "author": "m.kalinin",
        "category": "Testing",
        "parent": "",
        "content": "My argument on the historical data access was to be able to test historical data expiry (EIP-4444). Someone may want to check archival node capability with expired blocks data distributed out of the protocol. On the mainnet this kind of tests could take huge amount of time. Although, I guess Sepolia after it has been running for more than 1 year may also serve this goal well",
        "created_at": "2022-11-04T06:39:42.839000+00:00",
        "attachments": []
    },
    {
        "author": "yorickdowne",
        "category": "Testing",
        "parent": "",
        "content": "We're discussing \u003chttps://notes.ethereum.org/@mario-havel/stakers-testnet\u003e over on ethstaker Discord. Seeing an ephemeral staking testnet sooner rather than later would be a-ma-zing. For this reason constant reset has my vote. \"if testnet ETH runs out\" can be handled with a sufficiently large genesis faucet fund that can handle Nx queue depth for the lifetime of the network. No need to be stingy here. 10x or 100x or even 1000x is reasonable, for each faucet. All state resets anyway. \"If network doesn't reach finality\" can be handled with a sufficiently large genesis validator set. If genesis validator set \u003e= max queue depth / 0.3, we're good. We likely want a size that rivals mainnet anyway. 500k or 1mil validators in the genesis set feels reasonable, so the testnet can also be used to reason about main. In 4 weeks, even if every single validator that is added is abandoned, not enough can be added to cause non-finality.\n\nWhat can the ethstaker crew do to make this easier on client teams and get this sooner? What's the MVP? What is must-do for client teams, and what could be delegated to a community effort?",
        "created_at": "2022-11-04T16:50:44.727000+00:00",
        "attachments": []
    },
    {
        "author": "remyroy",
        "category": "Testing",
        "parent": "",
        "content": "Some of my notes on that ephemeral testnet proposal: \u003chttps://twitter.com/remy_roy/status/1588613245321072643\u003e",
        "created_at": "2022-11-04T19:34:17.547000+00:00",
        "attachments": []
    }
]