[
    {
        "author": "mariohavel",
        "category": "Testing",
        "parent": "",
        "content": "What do you mean by network configs vs rollback mechanism? \nNetwork config should be as close to mainnet as possible but if there are some consensus options configurable in clients, I agree to consider tweaking faster leakage of validators, etc.",
        "created_at": "2022-11-10T13:13:27.994000+00:00",
        "attachments": []
    },
    {
        "author": "mariohavel",
        "category": "Testing",
        "parent": "",
        "content": "If you mean to generate a new config file for each ephemeral network life, I like the idea as well. The whole thing could be run by an external script which just monitors the node, generates config and throws database when needed. The problem is it might not be that stable and in case when only genesis validators run this script, the rest of the active network might fork and go on. Having lifetime of the network defined within client would kill all nodes at certain epoch. \nProper implementation in client is still needed. Adding a preconfigured network option can be combined with a function for maximum lifetime and the rollback mechanism could just abuse the fork choice (not sure if that is trivially possible)",
        "created_at": "2022-11-10T13:18:41.264000+00:00",
        "attachments": []
    },
    {
        "author": "javimaravillas",
        "category": "Testing",
        "parent": "",
        "content": "Can you share what you have? I'm trying to work on this",
        "created_at": "2022-11-10T19:32:42.660000+00:00",
        "attachments": []
    },
    {
        "author": "yorickdowne",
        "category": "Testing",
        "parent": "",
        "content": "\u003chttps://github.com/CryptoManufaktur-io/backend-ansible\u003e ... it's not terribly well documented. site.yml does initial config and node.yml deploys eth-docker on it. Some of the runbooks can be removed like the email setup and unattended-upgrades, unless you want to keep it.",
        "created_at": "2022-11-10T20:00:49.180000+00:00",
        "attachments": []
    }
]