[
    {
        "author": "gandalf_the_dust_wizard",
        "category": "Testing",
        "parent": "",
        "content": "Hi all, I'm Gandalf from the RockX team and I'm hoping to have a conversation with a couple of different people groups. First, in relation to Holesky testnet, I'm hoping to understand more around managing the costs to run 100k validators at genesis. We'd like to be involved, but are unclear about how other teams are expecting to manage such a high cost? Can anyone give me some insight? Maybe I missed something about cost mitigation or incentives in the first call?\n\nThe second topic is around Sepolia Testnet, faucets and validators. I was speaking with \u003c@397809066115727383\u003e on the topic and he suggested, my best bet is to reach out to client teams. I don't want to tag all the teams in this post, but if anyone could help me bring this to their awareness I would really appreciate it. We have a faucet set up already to provide ETH and need to develop a sustainable solution to keep providing ETH to developers (currently ~210,000 requests funded). \u003c@543900561460822016\u003e was super generous and provided us with a large amount recently. But we expect to run out later this year and would like to work with teams to come up with a beneficial arrangement for all!",
        "created_at": "2023-06-26T07:07:20.264000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "Regarding the second item, do you have any idea of the amount of ETH you require, preferably in terms of amount per month?",
        "created_at": "2023-06-26T07:09:34.145000+00:00",
        "attachments": []
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "1) Napkin math: You could get away with 5-10k validators per 4 core/16gb/150gb ssd machine(only really fine on testnets and to keep costs lower). This should be roughly 100-150$/mo on some cheaper cloud providers. Alternatively you can buy 1 NUC at a standalone cost of ~500-1k if you have the bandwidth and location for it(definitely the cost effective option if you have the expertise for it). You'd need 15-20 of these for good measure to manage 100k keys. Its currently pure altruism, there's no incentive to run validators. For most teams, its a way to test at scale. Often client teams will deploy alpha versions on testnets to gather data before a more public beta. Similar goes for staking providers and dvts. Additionally, the testnet will undergo upgrades before mainnet, so its an easy way to know directly if your client/product/etc might face issues during the mainnet upgrade. If the cost/validator count is not something that makes sense for your setup, you can always run fewer validators and still help keep the testnet up and running.\n\n2)  Would you be able to provide some details on what sybil mechanism you're using? Knowing your needs in terms of eth/month would definitely help a well 🙂",
        "created_at": "2023-06-26T07:37:00.120000+00:00",
        "attachments": []
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "On a similar note, please do join the Holesky planning call on the 29th of June: https://github.com/ethereum/pm/issues/814",
        "created_at": "2023-06-26T07:37:33.787000+00:00",
        "attachments": []
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "We've currently managed about ~half of our required commitments for validators, it'd be great if missing client teams/projects would comment here before the thursday call: https://github.com/eth-clients/holesky/issues",
        "created_at": "2023-06-26T07:39:03.441000+00:00",
        "attachments": []
    }
]