[
    {
        "author": "pandapip1",
        "category": "Testing",
        "parent": "",
        "content": "How about this: add a 10% interest rate per month on Gorli eth (i.e. multiply everybody's eth balance by `1.00000043521` every block).\n\nThis could be done by storing a \"multiplier\" as part of the block data every block. The `BALANCE` opcode would return the actual balance times the multiplier. Likewise with the `CALLVALUE` and `SELFBALANCE` opcodes, and all the corresponding RPC endpoints. The `CALL`, `CALLCODE`, `CREATE`, and `CREATE2` have their value *divided* by the multiplier, and likewise with EOA transactions. The cost of gas is also divided by the multiplier.",
        "created_at": "2023-01-16T14:51:34.409000+00:00",
        "attachments": []
    },
    {
        "author": "pandapip1",
        "category": "Testing",
        "parent": "",
        "content": "Similar logic would be added to the gorli beacon chain",
        "created_at": "2023-01-16T14:53:36.400000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "Last time we talked about this I thought that the general idea was to move to:\n  - testnet with stable validator set for dapp and general execution layer testing: sepolia\n  - testnet with open validator set for validator testing: successor to goerli, reset every ~ 6 months\n\nHas this changed?",
        "created_at": "2023-01-16T15:56:43.352000+00:00",
        "attachments": []
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "Nope, that's still the general idea as far as I know. Mario, pk910, Remy et all are working a lot on the re-genesis/ephermeral testnet idea.",
        "created_at": "2023-01-16T15:58:08.276000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Testing",
        "parent": "",
        "content": "i think the problem is more that client teams don't want a testnet-specific fork, not the actual method of inflating the goerli supply",
        "created_at": "2023-01-16T17:39:35.833000+00:00",
        "attachments": []
    },
    {
        "author": "pandapip1",
        "category": "Testing",
        "parent": "",
        "content": "How about having the multiplier default to 1 if the parameter is missing from the block data? This way, no fork is needed (and if we wanted to make real ETH inflationary or even more deflationary, we can).",
        "created_at": "2023-01-16T18:29:10.154000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Testing",
        "parent": "",
        "content": "this was discussed and CL teams were generally okay with this, but ultimately was decided to just deprecate testnets instead",
        "created_at": "2023-01-16T20:50:25.292000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Testing",
        "parent": "",
        "content": "the argument against it is that for any value that's meaningful on a testnet (i.e. a 2x multiplier), then you can have someone crash the network \"relatively quick\"",
        "created_at": "2023-01-16T22:28:14.044000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Testing",
        "parent": "",
        "content": "perhaps if someone came up with a number that's high enough to provide good user funding but low enough as to not cause the testnet to blow up by compounding withdrawals, then CL teams could be convinced?",
        "created_at": "2023-01-16T22:28:55.191000+00:00",
        "attachments": []
    }
]