[
    {
        "author": "philngo",
        "category": "Testing",
        "parent": "",
        "content": "Hi all, I would like the gauge the idea of deprecating Goerli with a spectactular 🧨  for testing. With a majority of client teams and large node operators still controlling that network, what do you guys think about coordinating some sort of supermajority EL fork to collect data and provide the community with a demonstrative worst-case scenario outcome? This could also give all of our clients an idea of how we're handling a majority/minority fork scenario and if the protocol is functioning as intended. Thoughts?",
        "created_at": "2024-01-23T17:57:41.135000+00:00",
        "attachments": []
    },
    {
        "author": "ryanleeschneider",
        "category": "Testing",
        "parent": "",
        "content": "What would the technical process be for triggering the fork, can it be done with existing clients or would code changes be needed?",
        "created_at": "2024-01-23T18:52:37.117000+00:00",
        "attachments": []
    },
    {
        "author": "robocopsgonemad",
        "category": "Testing",
        "parent": "",
        "content": "you'd need code changes to introduce the bug, but triggering the fork is usually configurable",
        "created_at": "2024-01-23T18:54:53.159000+00:00",
        "attachments": []
    },
    {
        "author": "ryanleeschneider",
        "category": "Testing",
        "parent": "",
        "content": "could be interesting, I'd assume us normies not running goerli validators w/ the change would just stay on the minority chain?",
        "created_at": "2024-01-23T19:17:38.904000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "You'd only demonstrate the worst case impact if it winds up being the valid chain that's clearly accepted. If the majority of services just follow the invalid chain you just set the expectation that majority wins regardless.  And if the chain just dies I don't think anyone learns anything because the chain was going to die anyway.",
        "created_at": "2024-01-23T20:37:29.373000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I agree with this, it's not clear you'll get your intended result \u003c@578356786889752586\u003e. For all I know everyone may turn into running geth",
        "created_at": "2024-01-23T22:24:44.013000+00:00",
        "attachments": []
    }
]