[
    {
        "author": "yorickdowne",
        "category": "Testing",
        "parent": "",
        "content": "It’s just about Q4 ‘25, and that means Sepolia replacement would be launched MoreSoonerish if still keeping to the 4+1 schedule.\n\nIs that still the plan, \u003c@199561711278227457\u003e ? And more importantly, is there a name?\n\nOriginal lifecycle thread: \u003chttps://ethereum-magicians.org/t/proposal-predictable-ethereum-testnet-lifecycle/11575\u003e",
        "created_at": "2025-08-29T02:13:33.498000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Testing",
        "parent": "",
        "content": "This interacts in interesting ways with Fusaka. I don’t think giving clients the task to support another testnet pre-Fusaka is reasonable, so this’d launch post-Fusaka - right when everyone needs a holiday break.",
        "created_at": "2025-08-29T02:14:52.623000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Testing",
        "parent": "",
        "content": "There is also the option to not do that - pros and cons. Pro, dApps don’t need to redeploy; con, they don’t exercise their ability to do so. And - is Ethereum responsible for forcing them to?",
        "created_at": "2025-08-29T02:19:21.937000+00:00",
        "attachments": null
    },
    {
        "author": "abcoathup",
        "category": "Testing",
        "parent": "",
        "content": "Naming suggestions (haven't done a poll yet): https://ethereum-magicians.org/t/testnet-name-needed-for-sepolia-replacement/23221",
        "created_at": "2025-08-29T03:28:21.488000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "Its still under discussion and we haven't brought it up on ACD yet - but the team is internally leaning on not doing so this year. We just had a lot of testnet chaos earlier this year with Holesky/Hoodi that triggered a lot of re-deployments + the the interactions with fusaka timelines. We also got feedback from dapps/etc that they'd like testnets to churn less frequently - and I can see them changing 2x deployments in under a year as a lot of churn. Similar issues with documentation and tooling, we're yet to see full coverage for Hoodi. \n\nSo the proposal we're considering is to start up a new testnet maybe Q2' 26, giving us some respite from testnet churn. But this is still pending discussion on ACD of course.",
        "created_at": "2025-08-29T07:41:17.893000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Testing",
        "parent": "",
        "content": "Makes a lot of sense",
        "created_at": "2025-08-29T07:42:53.534000+00:00",
        "attachments": null
    }
]