[
    {
        "author": "daniellehrner",
        "category": "Testing",
        "parent": "",
        "content": "Hoodi will be the least stable of the 3 testnets. Core devs will do most of the scaling tests there and might also test long non-finality. It is also supposed to be the first testnet when testing hardforks and because of that the mostly likely to break. \n\nJust to double check: Did you consider that when moving there?\n\nCC \u003c@199561711278227457\u003e At least that was my understanding from yesterday's call. Please correct me if I am wrong.",
        "created_at": "2025-03-14T09:58:17.241000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "Testing",
        "parent": "",
        "content": "We'll have a post about hoodi and the associated usecase by Monday/Tuesday. Hoodi will be the stable testing target for valdiators. We will either repurpose holesky or have a new network that is larger than mainnet and pushing network limits, but that won't be hoodi! (we need it to be stable for pectra testing and beyond)",
        "created_at": "2025-03-14T09:59:56.638000+00:00",
        "attachments": null
    },
    {
        "author": "daniellehrner",
        "category": "Testing",
        "parent": "",
        "content": "Ok, thank you then I misunderstood that.",
        "created_at": "2025-03-14T10:02:59.607000+00:00",
        "attachments": null
    },
    {
        "author": "siladu",
        "category": "Testing",
        "parent": "",
        "content": "Thanks for clarification. It was not clear from the ethmag notes whether Hoodi would be the stable one and what the future of Holesky would be.",
        "created_at": "2025-03-14T10:17:06.313000+00:00",
        "attachments": null
    },
    {
        "author": "kamil_chodola",
        "category": "Testing",
        "parent": "",
        "content": "Idea (maybe not super correct but still worth thinking of)\nMake sure to get some kind of emergency contact to genesis validators of Hoodi - so we can avoid problems as we had for Holesky when we needed organized work to be made.\nEach entity should provide it and in case person leaves - make a replacement.\n\nit can be either email, phone, tg handle - whatever person will find comfortable and will commit that is taking a look at it frequently so we can reach out in case of urgent need (as we can see - very rarely).",
        "created_at": "2025-03-14T16:11:22.375000+00:00",
        "attachments": null
    },
    {
        "author": "kamil_chodola",
        "category": "Testing",
        "parent": "",
        "content": "I'd say nice idea repurposing Holesky for that - but would require still shadowfork and a better validator distribution so at least Core devs are having 66% of validator keys to recover it as needed.",
        "created_at": "2025-03-14T16:15:02.047000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "We have that for sepolia, with a small and known group, and there have still been times that nodes have been down for days/weeks.  I'm not against it, but not sure that it solves much.\n\nWe could say that each genesis validator needs two contacts in the 'Hoodi genesis validators' tg, that will probably be as close as we're going to get to having real emergency contacts.",
        "created_at": "2025-03-14T16:16:11.144000+00:00",
        "attachments": null
    },
    {
        "author": "kamil_chodola",
        "category": "Testing",
        "parent": "",
        "content": "TG was nice but still we struggled a lot to reach out to some of those.\nSo maybe something beyond TG which will be used only when sudden need arises would be nice to have imo.\n\nBut forcing 2 representatives and making sure that those are still in the company and care about their validators would be good (more frequently than each hardfork so we can see them offline :D)",
        "created_at": "2025-03-14T16:17:49.737000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "Many people don't care about testnet validators, though.  And it's not just stakers, it's also client teams and the like.  The reality is that they're (relatively) high maintenance and low value, which makes it hard for people to care.  Fro sepolia, for example, we had a big push a week ago in line with the hard fork and we're back to what looks like one operator being offline again (although they did find the time to apply to be a hoodi genesis validator).\n\nI'm all for people being responsive to testnets, and I applaud any effort.  I'm just not holding out massive hope for it.",
        "created_at": "2025-03-14T16:21:46.217000+00:00",
        "attachments": null
    },
    {
        "author": "kamil_chodola",
        "category": "Testing",
        "parent": "",
        "content": "Agree with above (sadly).",
        "created_at": "2025-03-14T16:29:30.659000+00:00",
        "attachments": null
    },
    {
        "author": "kamil_chodola",
        "category": "Testing",
        "parent": "",
        "content": "But - maybe if we will require that and point out that being genesis validator means some kind of commitment needs to be made and to be such validator, some better contact needs to be left maybe will filter out those who just applied \"to be included and be visible\" - not to tell that - some entities may treat it as a free advertisement.\n\nIf they want to benefit from that, at least commit to it and give some better contact point to you once we need you to act against your commitment.\n\nVery likely it may not work at all - but better to have it in such cases rather than try to write to companies on their public group emails or try to reach them indirectly somehow.",
        "created_at": "2025-03-14T16:31:57.188000+00:00",
        "attachments": null
    }
]