[
    {
        "author": "s1na",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If I'm not mistaken consensus (and hence client) simplicity was a major motivation behind EEs in eth2. But I'm not familiar enough with substrate to know their similarities/differences",
        "created_at": "2020-07-15T10:44:58.752000+00:00",
        "attachments": []
    },
    {
        "author": "jovial_cheetah_89960",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@456226577798135808\u003e super interesting problem that you're investigating. I watched the ACD last friday and ended up thinking a lot about it as well.  There I understood that data availability solutions would lie more on *increasing throughput of state sync* horizontally (torrent-like solutions) or vertically (having hi-throughput \"jumpstart\" servers).\n\nI do have some questions/concerns, so please bear with me: \n\n- What is the overall size of the snapshot we'd want to share?\n\nYesterday I started a geth node syncing in `fast` mode, and I'm not sure if it is usual or not, but my node hit quite a lot of \"too many peers\" errors in the dialing process. That led to some more questions:\n- Is there a chance that some fully synced servers are in a closed circuit, preventing new nodes to fill up all connections?\n- Is there any wiggle room in a devp2p level to help these entrant servers? eg: one synced node could propagate the message that there's a node with just a few active connections, so they would rebalance their connections to maximize throughput.",
        "created_at": "2020-07-15T14:46:42.716000+00:00",
        "attachments": []
    },
    {
        "author": "jovial_cheetah_89960",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "and lastly: isn't loading a state snapshot exactly what fast sync does?",
        "created_at": "2020-07-15T14:50:50.804000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "the big difference between loading a state snapshot and fast sync is that state snapshot is relatively static - in my current proposal it does not change for 6 months. Whereas the snapshot that fast sync is trying to obtain is changing every 15 seconds, and parts of it may become unavailable in the process. It is much easier to ensure availability of something that changes only infrequently",
        "created_at": "2020-07-15T15:02:33.982000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "and this makes all the difference - the technologies required for downloading something relatively static already exist and are pretty robust",
        "created_at": "2020-07-15T15:03:10.228000+00:00",
        "attachments": []
    },
    {
        "author": "vorot93",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yeah, I think it's closer to Warp sync which generates static chunks every 5000 blocks",
        "created_at": "2020-07-15T15:04:35.215000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "the overall size of the snapshot is mentioned in the ethResearch article. The state snapshot currently would be 50Gb, the blockchain file 150Gb, and receipt file 130Gb",
        "created_at": "2020-07-15T15:04:56.620000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "with the 6 months update schedule, you can reasonably assume that you can distribute content addresses (hashes) through the client implementation software",
        "created_at": "2020-07-15T15:07:01.410000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "if you reduce this snapshot update frequency, eventually you cannot rely on this distribution method anymore and need to think of another reasonable way.",
        "created_at": "2020-07-15T15:08:32.647000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "for example, if it is twice a month, you might need to ask users to do \"weak subjectivity\" and grab the addresses from \"official\" web-sites or twitter handles, etc.",
        "created_at": "2020-07-15T15:09:24.205000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "and provide them with the command line, or else fallback to the 6month snapshot",
        "created_at": "2020-07-15T15:09:41.790000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ok, 13 seconds",
        "created_at": "2020-07-15T15:30:33.915000+00:00",
        "attachments": []
    },
    {
        "author": "jovial_cheetah_89960",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "got it, thanks!",
        "created_at": "2020-07-15T15:36:55.523000+00:00",
        "attachments": []
    }
]