[
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hiya, I am struggling with implementing the snap protocol and trying to wrap my head around how I should import partial tries (in this example Account trie) into the client. The response to a GetAccountRange query is a set of: account hashes (the trie keys), the account data (the trie values), and it seems that there is a single (?) proof which is the proof of the final account hash (key) which is in the account data. I can import this final account just fine (dump the proof keys into the DB after verifying that the proof indeed leads up to the root) but I do not yet understand how I should import the other account data into the DB. I could imagine that (since the hashed keys are increasing) we could backfill the DB with these values, but have not managed to figure this out. I also do not seem to find where this logic happens in Geth. I have found this; (https://github.com/ethereum/go-ethereum/blob/141cd425310b503c5678e674a8c3872cf46b7086/trie/proof.go#L477) but I do not yet understand fully what this does and especially not how I can retrieve the right node keys/values to dump in the DB to reconstruct the partial trie. A pointer or a hint to the right logic should work for me, thanks 🙂 \u003c@\u0026688090867927482525\u003e",
        "created_at": "2022-08-15T15:43:15.320000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I added you to a snapsync QnA group where we've answered a lot of questions like this",
        "created_at": "2022-08-15T16:58:02.809000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In general, I'm not sure at what \"level\" I should answer that question. I'm not sure if it's a nitty-gritty detail answer you're seeking, or if it's more the general Big Idea that you have not yet grokked",
        "created_at": "2022-08-15T16:59:52.795000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think I get somewhat the idea, but I also think I am missing something obvious",
        "created_at": "2022-08-15T17:00:57.761000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The Big Idea is that you obtain the leafs only, split up in N batches from M peers, over a longish period of time.  You use those to reconstruct the trie on _your_ side.",
        "created_at": "2022-08-15T17:01:05.777000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, this is what I get; I do not see at this point how I reconstruct a partial trie when I get an answer on `GetAccountRange`",
        "created_at": "2022-08-15T17:01:49.916000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The end resuit is a mishmash of partial tries, where the lower key-space are fron 1000 blocks ago, and the upper key-space is only 100 blocks old (example numbers)",
        "created_at": "2022-08-15T17:01:55.120000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "At this point I only want to sync on a stalled node (so it does not import new blocks)",
        "created_at": "2022-08-15T17:02:21.739000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e  I do not see at this point how I reconstruct a partial trie when I get an answer on GetAccountRange\n\nWe use an abstraction called 'stacktrie'. It is a datastructure which can be fed keys in ascending order, and it can incrementally build up a trie. Also, once it's \"done\" with a subtrie, it stores it to database.",
        "created_at": "2022-08-15T17:03:04.673000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So feed it a few items, then it will save a few leafs and a fullnode.",
        "created_at": "2022-08-15T17:03:45.668000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Since it always flushes to disk, it is capable of calculating the hash of arbitrary-size trie, and also creating all intermediary nodes.",
        "created_at": "2022-08-15T17:05:43.721000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ohhhh wait a minute, I think I just have a gotcha. Thanks! 😄",
        "created_at": "2022-08-15T17:08:09.352000+00:00",
        "attachments": null
    }
]