[
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Right, I completely agree that if you run snap sync besides beam sync then snap would finish earlier than beam sync. So I guess we could deprecate this sync mode.\n\nThe idea to enforce it on RPC endpoints is a good one though 😄 Correct me if I'm wrong, but this should have the same security than if you would run this on a fully snap-synced node, right?",
        "created_at": "2022-09-01T04:36:13.755000+00:00",
        "attachments": []
    },
    {
        "author": "jason.carver",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah, although kind of the point is that \"finishing\" beam sync isn't that important, because you're essentially getting the same guarantees as if you had fast/snap-synced right to the header tip at launch, and then done full block evaluation from there. The reason to finish it is to reduce latency between the network's view of the head of the chain and your local view, because you may fall a few blocks behind the tip as you download/execute. But I think a the tradeoffs of a (longer sync + immediate access to the RPC endpoints + some added latency from the chain tip) is a tradeoff that many would be willing to make.",
        "created_at": "2022-09-01T04:41:10.461000+00:00",
        "attachments": []
    },
    {
        "author": "jason.carver",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yup, you still are checking all the state against the state root, which is the same you are getting from snap sync. 🙂",
        "created_at": "2022-09-01T04:41:54.489000+00:00",
        "attachments": []
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes I agree with the latency part. What would you suggest here? I think a sole beam-sync implementation would not make much sense, but would a beam+snap sync implementation make sense? Or would you say: use snap for the syncing, but expose the beam sync part for the RPC endpoints such that people can query those on recent blocks?",
        "created_at": "2022-09-01T04:44:34.679000+00:00",
        "attachments": []
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The only part I don't really like about implementing beam sync to serve these eth requests is that we could get a problem that many clients spin up their client just to perform one call, and then shut it down again (so they are leeching the network?)",
        "created_at": "2022-09-01T04:45:12.713000+00:00",
        "attachments": []
    },
    {
        "author": "jason.carver",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah, I think a beam+snap sync is a \"nice to have\" because you actually get to the point of fully verifying execution faster, but most people are fine with the tradeoff of ignoring execution verification up to the sync target.\nSo I guess practically I would recommend just supporting it for the RPC endpoints to get to a \"usable\" client state much faster.",
        "created_at": "2022-09-01T04:47:03.199000+00:00",
        "attachments": []
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Well I think a cool thing of beam+snap is that, if we expose beam on the eth RPC, then the beam+snap can (for a large portion of blocks) actually serve these RQs as well, where if they would use snap sync, we have to get \"lucky\" to have all trie nodes? 🙂",
        "created_at": "2022-09-01T04:48:07.191000+00:00",
        "attachments": []
    },
    {
        "author": "jason.carver",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah, though I suppose if someone really just needs to find the balance of one account, then right now they have to fully sync to get that balance and then shut down. So that seems to be a much bigger cost to the network than to just grab the state at that particular account and then quit.\nPlus hopefully if they really just need that lightweight of a use case, we will be able to guide them to something more like the Portal network 🙂",
        "created_at": "2022-09-01T04:49:42.937000+00:00",
        "attachments": []
    },
    {
        "author": "jason.carver",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think I follow: that because many RPC queries will probably be asking about state that has recently changed, beam+snap is more likely to have already requested the data that the RPC caller is looking for. Yeah 👍",
        "created_at": "2022-09-01T04:51:34.058000+00:00",
        "attachments": []
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yep exactly. So most likely your beam sync will fall behind on execution, so you will not have the full trie nodes of all blocks, but if someone requests it at a recent block they have decent chance that we have it. And if not, query a few blocks back, maybe we have it there (if you dont care about the absolute latest state).",
        "created_at": "2022-09-01T04:53:39.428000+00:00",
        "attachments": []
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This sounds like a great idea to experiment with at some point 🙂 (But we first have to implement snap sync and then beam sync 😅 )",
        "created_at": "2022-09-01T04:53:58.729000+00:00",
        "attachments": []
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hmm one thing I just realized: we can also just use web3 getProof. The only thing that doesnt have is PoW verification of the entire chain",
        "created_at": "2022-09-01T04:55:58.438000+00:00",
        "attachments": []
    }
]