[
    {
        "author": "fearlessfe",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "some quesentions about protocol version.\nnow version 1 has two break changes\n\nAdd detailed offer decline codes.\nAdd a varint size prefix to the content item send over uTP.\n\nif there are two nodes: Node A `pv:[0]` and  Node B `pv:[1]`, \nwhat happens when nodeA send a offer to NodeB? return a specific error?\nHow many versions do you plan to be compatible with?",
        "created_at": "2025-03-29T02:23:39.172000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "I'm general, two clients with no version overlap should avoid each other. \n\nCompatibility in clients should generally be a rolling window of the most recent version or two versions. It'll likely be a thing that we monitor until we see adequate adoption and saturation of the new version and then client teams can remove the old one.",
        "created_at": "2025-03-29T04:36:53.040000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "As for the specific question, what a node should do when a message arrives from a node that it has no mutually compatability with... anyone have a strong opinion on this? I'm inclined to say that the optimistic approach of responding with whatever the latest version of the protocol that you locally support seems like a reasonable strategy... but i can also see a case for ignoring the message.",
        "created_at": "2025-03-29T14:46:02.475000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "Nodes will need to be resilient to malformed messages either way.",
        "created_at": "2025-03-29T14:46:34.724000+00:00",
        "attachments": null
    },
    {
        "author": "acolytec3",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "Our initial approach is to blacklist any node we don't have a shared version with. This will mean we decline any messages from said nodes.",
        "created_at": "2025-03-29T17:13:23.691000+00:00",
        "attachments": null
    }
]