[
    {
        "author": "dock_boss",
        "category": "Execution Layer",
        "parent": "",
        "content": "I am currently drafting up the SRS doc for the JSON-RPC API, but I am still new to the community so I want to make sure I am on the right track. \nDoes the following paragraph accurately summarize the scope of the API?",
        "created_at": "2021-10-24T17:58:08.416000+00:00",
        "attachments": null
    },
    {
        "author": "dock_boss",
        "category": "Execution Layer",
        "parent": "",
        "content": "```The Ethereum execution layer JSON-RPC API will provide the basis for all external interaction with the Ethereum blockchain. The interactions with the Ethereum network can be divided into four categories. Transferring ETH, ERC-20 tokens, and ERC-721 tokens to different accounts or smart contracts. Pulling network, block, and transaction data from the blockchain. Allowing users to interact with and deploy Ethereum smart contracts. Lastly the JSON-RPC API **SHOULD** allow the sending and receiving of current client information and statuses. ```",
        "created_at": "2021-10-24T17:58:25.245000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "`s/will provide/provides`",
        "created_at": "2021-10-24T18:05:38.304000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e The interactions with the Ethereum network can be divided into four categories. Transferring ETH, ERC-20 tokens, and ERC-721 tokens to different accounts or smart contracts.\nThis isn't quite right.  This class of interactions with the Ethereum network are \"transfer ETH, deploy contracts, execute contracts\".",
        "created_at": "2021-10-24T18:06:31.144000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Tokens are a subset of the latter two and not really relevant for this level of discussion.",
        "created_at": "2021-10-24T18:06:43.728000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "What does \"sending of current client information and statuses\" mean?  Seems like that should be read-only.",
        "created_at": "2021-10-24T18:08:51.272000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Also, I think there is another category for \"administrative tasks\", though personally I think that should occur at a different endpoint and on the JSON-RPC API.",
        "created_at": "2021-10-24T18:09:15.737000+00:00",
        "attachments": null
    },
    {
        "author": "dock_boss",
        "category": "Execution Layer",
        "parent": "",
        "content": "I was trying to describe the endpoints that are focused towards people running nodes like eth_submitHashrate, eth_submitWork, and eth_syncing. Are these part of the administrative tasks?",
        "created_at": "2021-10-24T19:00:28.659000+00:00",
        "attachments": null
    }
]