[
    {
        "author": "0x6e69636f",
        "category": "Execution Layer",
        "parent": "",
        "content": "From a docOps perspective, it's far easier for me when I work on ETH2 REST API than on the ETH1 JSON-RPC one...\nETH1 API is now 6yo and we learned how to deal with it without a clear spec, most of the tools now know how to get around the few issues and the libraries are stable... and ETH2 is coming with a REST API that we document and spec using OpenAPI 3.\nIs it worth putting a lot of energy in a spec for RPC?\nShouldn’t we spec a REST API for ETH1 instead?\nThat would make it consistent with ETH2 so that when ETH1 and ETH2 will work together (I don’t know, in the sharding phase for example), it will help to have a unified interface? And even if they don’t work together, it would enable devs and users to only handle one kind of API.\nThe effort required to update spec and all RPC implementations is probably close to implementing the same endpoint using REST.\nThe effort required to update client applications would also be optional and would minimize the impact of the spec as apps could continue to use the current JSON-RPC API if it’s enough for them. They could switch to the REST/OpenAPI as needed, later.\nThe effort required for new client projects would be smaller if they directly implement REST/OpenAPI because it is easier than JSON-RPC. \nWe already did this when we implemented GraphQL, same sources, different APIs, “just” an overlay change in the code. Having a REST api alongside RPC (for backward compatibility of course) would not be a very different effort on the node developers side and would prepare for the future, give more choice to users, help using well known and user friendly documentation and code generation tools… and it would make my days a lot better I admit 😉",
        "created_at": "2021-02-05T11:58:10.098000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Execution Layer",
        "parent": "",
        "content": "For what it's worth, JSON-RPC has always felt to me like the worst of all worlds.\n\nOne thing I'm not sure is present for any ETH1 API proposal is a list of the requirements.  We spent more time going back and forth on them than picking the particular transport/protocol.",
        "created_at": "2021-02-05T12:20:44.271000+00:00",
        "attachments": []
    }
]