[
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Pending blocks aren't part of consensus, so they aren't specified in consensus EIPs.",
        "created_at": "2022-08-16T05:28:39.565000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "They *should* be specified in the JSON-RPC specs, but those are perpetually languishing.",
        "created_at": "2022-08-16T05:29:07.333000+00:00",
        "attachments": null
    },
    {
        "author": "fvictorio",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e An correct me if I'm wrong but I assume only the next actual validator knows the \"correct\" RANDAO value to add.  If that's the case 0x0...0 seems like a sane value for the JSONRPC to plug in but this area is definitely under-specified.\n\nAgree. Thank you for the feedback!",
        "created_at": "2022-08-16T08:03:26.659000+00:00",
        "attachments": null
    },
    {
        "author": ".crystal21.",
        "category": "Execution Layer",
        "parent": "",
        "content": "Hello, I am not sure if this the right place to ask. We noticed change of behavior with our Geth node,  eth_syncing returns false, while eth_blockNumber shows the node is still catching up. We are running Geth version 1.10.21-stable, paired with Prysm v2.1.4. We tested in both Goerli and mainnet, both environments have the same issue. This was not observed in older versions of Geth alone without CL. Any insights on the issue is much appreciated.",
        "created_at": "2022-08-16T13:23:02.556000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e They should be specified in the JSON-RPC specs, but those are perpetually languishing.\n\nOne way to help the specs team catch up would be if we dropped support for `pending` 😃",
        "created_at": "2022-08-16T21:36:44.918000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "Execution Layer",
        "parent": "",
        "content": "This Discord isn't really meant for specific client implementation behaviors, more around R\u0026D efforts on where the clients need to behave the same way.  That said, IIRC during my testing geth returns false for `eth_syncing` during snap sync, which was made the default sync mode in recent releases.  If this impacts you I'd suggest raising an issue on the go-ethereum Github.",
        "created_at": "2022-08-16T21:38:58.471000+00:00",
        "attachments": null
    }
]