[
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "Proposal to standardize `debug` namespace across clients: https://github.com/ethereum/execution-apis/pull/247",
        "created_at": "2022-06-24T09:07:57.900000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Weakly against because what information is readily available for debugging and the mechanism for getting that information out of clients is likely to differ significantly pur client.",
        "created_at": "2022-06-24T11:47:24.374000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "At the least, there should be a way for individual clients to add stuff to the debug namespace without fear of colliding with future things.",
        "created_at": "2022-06-24T11:47:46.540000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Execution Layer",
        "parent": "",
        "content": "The only one of those in the PR that could fall in to that category is `debug_getBadBlocks`, the rest shouldn't have any wriggle room in terms of what they return.  And the PR says it's a minimal set so from that I take that individual clients can continue to create additional endpoints if they so desire (and maybe even push for them to be added to standards, if they are found to be useful!).",
        "created_at": "2022-06-24T11:51:16.581000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "Right, clients are free to add more endpoints if they desire. But for things that are particularly useful, it would be great to just go through the process of standardizing them across clients. Realistically, if there is a collision we'll most likely just adjust the standard methods to avoid the collision",
        "created_at": "2022-06-24T13:36:35.242000+00:00",
        "attachments": []
    },
    {
        "author": "ryanleeschneider",
        "category": "Execution Layer",
        "parent": "",
        "content": "I'm also weakly against just because some of the debug namespace RPCs are inherently dangerous (as mentioned `debug_setHead` but there are others) so standardizing them feels like it might be misinterpreted by users that these are RPCs safe to expose.\n\nI'd be for keeping the debug namespace \"private\" and for us to petition that the RPCs mentioned be promoted to a different namespace (e.g. `eth` for most of them).",
        "created_at": "2022-06-24T21:02:20.707000+00:00",
        "attachments": []
    },
    {
        "author": "ryanleeschneider",
        "category": "Execution Layer",
        "parent": "",
        "content": "For example geth exposes it's `pprof` interface via `debug` and that can trivially be used to take down a node.",
        "created_at": "2022-06-24T21:04:58.620000+00:00",
        "attachments": []
    },
    {
        "author": "ryanleeschneider",
        "category": "Execution Layer",
        "parent": "",
        "content": "also my guess is multiple RPCs in that namespace can be used for data exfiltration since I'm not sure the ones that refer to filesystem paths have been properly secured",
        "created_at": "2022-06-24T21:06:02.589000+00:00",
        "attachments": []
    },
    {
        "author": "ryanleeschneider",
        "category": "Execution Layer",
        "parent": "",
        "content": "and i guess finally: do hive tests have access to the node over ipc?  If not this would require exposing the entire debug namespace over http to execute the tests.",
        "created_at": "2022-06-24T21:09:45.983000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "I think usually no, because the hive simulator runs in a different container than the client",
        "created_at": "2022-06-24T22:59:53.373000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "I removed setHead due to the feedback. There are now only 4 standard methods proposed for debug. All just read data about the chain. I’m not sure I understand the argument to promote the methods to `eth` instead? I think generally we want to avoid ppl from using these methods, they’re more for debugging chain issues. It’s just useful for all clients to provide similar interfaces so devs don’t need to know how to get info out of each client",
        "created_at": "2022-06-24T23:03:14.754000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "I made a proposal for how geth could reorganize its RPC namespace actually, so the methods that used to be in debug are moved to more appropriate namespaces https://github.com/ethereum/go-ethereum/issues/24808#issuecomment-1149916550",
        "created_at": "2022-06-24T23:05:03.890000+00:00",
        "attachments": []
    }
]