[
    {
        "author": "potuz",
        "category": "Execution Layer",
        "parent": "",
        "content": "Prysm supports syncing from genesis. Although backfilling will be up soon it's still not ready. I do think that eventually we need to get rid of genesis forward syncing, but removing this now will break historic prysm nodes",
        "created_at": "2023-09-22T00:19:51.442000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Execution Layer",
        "parent": "",
        "content": "Yes, CL should determine whether a block is pre-Deneb or pre-Capella by whatever mean it relies upon, it can be a slot number, timestamp etc. And then call the corresponding EL method",
        "created_at": "2023-09-22T06:34:29.916000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Execution Layer",
        "parent": "",
        "content": "this is because you must be sure that `timestamp` is provided before evaluating a check that involves the timestamp value",
        "created_at": "2023-09-22T06:35:31.295000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Execution Layer",
        "parent": "",
        "content": "considering genesis sync is still the case, i'd suggest we don't deprecate v1 either if there is no strong desire for that, and postpone its deprecation until the time after getting rid of the genesis sync when it becomes possible to do the deprecation of old versions with more or less regular cadence",
        "created_at": "2023-09-22T06:43:09.575000+00:00",
        "attachments": []
    },
    {
        "author": "robocopsgonemad",
        "category": "Execution Layer",
        "parent": "",
        "content": "sorry, i knew that but I should have elaborated: since that timestamp drives more than just the validity of the PayloadParam, we could consider passing it as its own arg to the rpc call. it happens to be a non issue in the case of validating v1 vs. v2 payloads from within the v2 method, since it is in the \"lowest common factor\" of the payload param.",
        "created_at": "2023-09-22T13:04:10.059000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Execution Layer",
        "parent": "",
        "content": "interesting idea! could you also please elaborate on why would it make more sense to check the fork support prior to checking the arguments? is this because the call with a payload belonging to the previous fork will be likely missing one of the require params?",
        "created_at": "2023-09-22T18:15:33.440000+00:00",
        "attachments": []
    },
    {
        "author": "robocopsgonemad",
        "category": "Execution Layer",
        "parent": "",
        "content": "that is the main reason, but it also allows us to choose the proper payload validator without assumptions on the payload, which makes them a bit more reusable. we are in the design phase of refactoring our Engine API, and this separation allows better encapsulation",
        "created_at": "2023-09-22T18:24:26.023000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Execution Layer",
        "parent": "",
        "content": "So the spec could change to the following sequence:\n1) Check that timestamp isn't null and respond with the invalid params error, check the fork is supported and respond with the error if not\n2) Check other fields depending on the fork and return the error if the check has failed",
        "created_at": "2023-09-22T18:29:46.473000+00:00",
        "attachments": []
    },
    {
        "author": "robocopsgonemad",
        "category": "Execution Layer",
        "parent": "",
        "content": "yes",
        "created_at": "2023-09-22T18:30:47.589000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Execution Layer",
        "parent": "",
        "content": "would you mind opening a PR with this proposal to bring this for discussion? maybe we can make it into Cancun as this is not a substantial change to the spec and implementations",
        "created_at": "2023-09-22T18:36:59.964000+00:00",
        "attachments": []
    },
    {
        "author": "robocopsgonemad",
        "category": "Execution Layer",
        "parent": "",
        "content": "i have a busy weekend planned, but could open one first thing monday",
        "created_at": "2023-09-22T19:16:42.913000+00:00",
        "attachments": []
    }
]