[
    {
        "author": "ryanleeschneider",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e This has turned out to break a bunch of stuff - most notably anything that tries to access the block hash of the current chain head block because that's not available on-chain when using latest but is for pending. \n\nPersonally I'd rather keep the change to `latest` but fix this issue, do you have an example tx that fails, if so I'll take a look and see if I can pinpoint the issue.  FWIW Infura has run w/ our default block for estimate gas patched to latest for the last couple years simply because performance of generating the pending block was so onerous it required way too much infra for this one RPC.",
        "created_at": "2023-06-28T16:30:16.272000+00:00",
        "attachments": []
    },
    {
        "author": "ryanleeschneider",
        "category": "Execution Layer",
        "parent": "",
        "content": "Oh I see, I think it's because for pending `BLOCKNUMBER` returns `latest + 1` so `BLOCKHASH` of the previous block is available, whereas if `BLOCKNUMBER` returns `latest` then the latest block's hash isn't actually available.  Hmm what do other clients like Besu do in that scenario?",
        "created_at": "2023-06-28T16:37:01.556000+00:00",
        "attachments": []
    },
    {
        "author": "big_tech_sux",
        "category": "Execution Layer",
        "parent": "",
        "content": "i've been discussing with several folks about adding an (optional) `returndata` field to the `eth_getTransactionReceipt` RPC, is the best place for this a new EIP or a PR to execution specs?",
        "created_at": "2023-06-28T18:23:49.264000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "pr to execution-apis",
        "created_at": "2023-06-28T19:15:22.885000+00:00",
        "attachments": []
    },
    {
        "author": "big_tech_sux",
        "category": "Execution Layer",
        "parent": "",
        "content": "ah ok. is eip-1474 kind of outdated then? if so it should be updated to point to execution specs as i think people still use it. i think there are other RPC-related EIPs including eip-1898, not sure if those should be updated as well.",
        "created_at": "2023-06-28T19:17:10.548000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "yeah i'm not sure the best way to deal with this - i'm not the author of those eips unfortunately",
        "created_at": "2023-06-28T19:18:03.262000+00:00",
        "attachments": []
    }
]