[
    {
        "author": "jgm",
        "category": "Execution Layer",
        "parent": "",
        "content": "[Following on from https://discord.com/channels/595666850260713488/745077610685661265/1172178198822387903]\n\nMy point (and I think that Micah said much the same in one of the comments to the items linked above) is that it isn't up to the client to be providing a priority fee value, it's up to the user.  Gas price and blob gas price, yes absolutely because they are known by the client and so the user needs to know them to create a transaction.  Putting them into a single call makes sense.  But tip should be purely user-driven.",
        "created_at": "2023-11-09T14:23:54.154000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "tip is based on current market conditions though",
        "created_at": "2023-11-09T14:24:49.454000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003c@144468805697929216\u003e what do you mean by gas price? the base fee?",
        "created_at": "2023-11-09T14:25:30.181000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Execution Layer",
        "parent": "",
        "content": "Yes.",
        "created_at": "2023-11-09T14:25:42.199000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Execution Layer",
        "parent": "",
        "content": "Very rarely.  Only comes into play if the current block is going to be 100% full.",
        "created_at": "2023-11-09T14:26:07.843000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "precisely, but at that point you need to ask the client for a reasonable max priority fee",
        "created_at": "2023-11-09T14:26:35.812000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "which we offer",
        "created_at": "2023-11-09T14:26:40.664000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "we’ll get to it",
        "created_at": "2023-11-09T14:29:04.261000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Execution Layer",
        "parent": "",
        "content": "Reasonable in what sense, though?  It's no guarantee of inclusion, and providing a value that results in anywhere from \"just missed out\" to \"way off the mark\" has the same ultimate impact.\n\nIf what you are supplying is actually \"this is the current median tip for the next block\" or similar that's reasonable, but I'd be inclined to give it a name that matches that (and possibly also include how full the next block is, if the idea is for the user to use this information to inform their decision on what tip to give).",
        "created_at": "2023-11-09T14:31:23.681000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "My strategy for priority fee selection is \"always 0.1\".  I think MetaMask uses this strategy by default as well, as do many other wallets I believe.",
        "created_at": "2023-11-09T14:59:36.190000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "This works perfectly like 99.9% of the time, and the times it doesn't work it still fails well (you get included a few blocks later).",
        "created_at": "2023-11-09T14:59:59.894000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I haven't been following the conversations that lead up to this discussion, but it seems unnecessary to include complexity in clients for a problem that no one has.",
        "created_at": "2023-11-09T15:00:41.347000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Well, I do have one exception to this strategy which is when I'm doing Tornado transactions, in which case I do \"always 1\" to help overcome the censorship that occurs on those transactions.\n👦 \"I would like to include this Tornado transaction.\"\n👮 \"No!\"\n👦 \"What about for $1?\"\n👮 \"Well, I guess just this one time.\"",
        "created_at": "2023-11-09T15:03:43.155000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "`eth_maxPriorityFeePerGas` just follows the naming convention of `eth_gasPrice` -- it is the name of the actual transaction value, max has nothing to do with guaranteeing inclusion",
        "created_at": "2023-11-09T17:58:31.866000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "if wallets don't use the method, i think we would be happy to remove it. ultimately the code complexity didn't really increase because it is the same code that was previously used to return a gas price value for `eth_gasPrice`",
        "created_at": "2023-11-09T17:59:38.833000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "more reason that `eth_gasPrices` method is probably not the right direction",
        "created_at": "2023-11-09T18:00:03.310000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Execution Layer",
        "parent": "",
        "content": "The fun thing about these strategies is that 0.1 tip on L2 is significantly overpaying, but lots of wallets do hard code it.  But then if you try to estimate the tip to use based on what other people are paying you wind up getting an answer around 0.1 because that's what everyone's paying.  op-geth did wind up modifying the gas price oracle logic so that if blocks aren't full it returns a hard coded lower value which seems to have made a difference.",
        "created_at": "2023-11-09T19:08:03.270000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Execution Layer",
        "parent": "",
        "content": "I do think that users should always be able to change the tip paid - any library or wallet missing that functionality is doing their users a severe disservice and making them either wait longer than they may want to in times where the base fee is rising or potentially overpay when really low tips might be accepted.",
        "created_at": "2023-11-09T19:09:30.819000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Execution Layer",
        "parent": "",
        "content": "The challenge with calculating a value is that you are basically trying to find the min tip accepted by miners on the network (otherwise you'll never get included) but that's not a single value and isn't actually visible anywhere. The best you can do is look at what the minimum tip of included transactions are and maybe look at tx stuck in your pool with low tips (but you may have filtered them out because your min fee is higher than the miners).",
        "created_at": "2023-11-09T19:11:38.247000+00:00",
        "attachments": []
    }
]