[
    {
        "author": "macfarla",
        "category": "Execution Layer",
        "parent": "",
        "content": "Something for the agenda if it isn't already - regarding what to do if block not found.\n\nThere’s hive tests for eth_getBlockReceipts\nbut fixing these hive tests broke hive tests for eth_simulate that use a future block, since besu has have common error handling for RPCs. \n\nIs it expected that we would want different behavior here or should eth_simulate also return null if the requested block is not found?\nmore context here on this draft besu PR https://github.com/hyperledger/besu/pull/9303\n\n(also this indicates there’s a gap in rpc-compat hive tests for error handling for other RPCs eg eth_getBalance, eth_getCode that will have the same issue/question)",
        "created_at": "2025-10-17T01:24:40.773000+00:00",
        "attachments": null
    },
    {
        "author": "s1na",
        "category": "Execution Layer",
        "parent": "",
        "content": "It looks like geth nethermind reth are all returning an error here, just with different error codes. I can see both points: stick to the usual approach of returning nil, but also see the point of returning an explicit error because of the complexity of eth_simulate and the many things that can go wrong.",
        "created_at": "2025-10-17T11:53:24.225000+00:00",
        "attachments": null
    },
    {
        "author": "smartprogrammer",
        "category": "Execution Layer",
        "parent": "",
        "content": "Note here about nethermind. we are going with the more strict parsing for block params and hashes. There is a flag you can change to go back to the loose parsing we had previously. implementation here:\nhttps://github.com/NethermindEth/nethermind/pull/9489",
        "created_at": "2025-10-17T15:31:23.088000+00:00",
        "attachments": null
    },
    {
        "author": "lukaszrozmej",
        "category": "Execution Layer",
        "parent": "",
        "content": "Something for the agenda if it isn't",
        "created_at": "2025-10-17T15:35:33.071000+00:00",
        "attachments": null
    }
]