[
    {
        "author": "pcaversaccio",
        "category": "Execution Layer",
        "parent": "",
        "content": "Hey I saw that you updated the JSON-RPC website; what sucks is that I cannot have a direct link to a specific method now, eg https://ethereum.github.io/execution-apis/api-documentation#eth_estimateGas. Direct links to a method is super valuable for sharing and also for docs. Would it be possible to add support for links directly to methods",
        "created_at": "2025-08-12T08:54:58.388000+00:00",
        "attachments": null
    },
    {
        "author": "acolytec3",
        "category": "Execution Layer",
        "parent": "",
        "content": "^^ \u003c@489914064919855114\u003e this could be something to consider on the near term for the generator code. Not sure how hard that would be to add",
        "created_at": "2025-08-12T12:20:23.129000+00:00",
        "attachments": null
    },
    {
        "author": "zcstarr",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003c@840207942581747712\u003e thanks for the feedback and \u003c@403636673914863626\u003e thanks for the ping. Tbh we're looking at an upcoming refactor of the docs to be more modern , which will have all the direct method link bells and whistles , as well as some other things to make it nicer.  We're looking at being able to replicate some of the functionality and flow of mintlify, so that would be including guides, method linkability , theming, and curl preview + the existing hit an rpc endpoint of your choosing support. We think that's what would have an imm. impact on the devex , speaking from the OpenRPC perspective. Are there other things you'd like to see happen with the docs as well?",
        "created_at": "2025-08-12T14:40:03.948000+00:00",
        "attachments": null
    },
    {
        "author": "pcaversaccio",
        "category": "Execution Layer",
        "parent": "",
        "content": "sgtm - I think having some swagger integration for experimenting could be useful, similar to e.g. this: https://safe-transaction-mainnet.safe.global/",
        "created_at": "2025-08-12T14:47:12.838000+00:00",
        "attachments": null
    }
]