[
    {
        "author": "sanleo",
        "category": "Execution Layer",
        "parent": "",
        "content": "Some input from me as an app dev, not a researcher\n\nPossible error code to standardise for `rpc-standard-errors` is that of rejection/unsupported/sanctions related errors\nSome RPCs deny certain methods because they don't want to serve them (e.g. commonly `eth_getLogs`), and some RPCs even will deny certain specific RPC requests if they touch sanctioned addresses\n\nFor example, trying to use `eth_getLogs` on tornado cash on some RPCs yields:\n```\nRpcRequestError: RPC Request failed.\n\nURL: https://eth.merkle.io\nRequest body: {\"method\":\"eth_getLogs\",\"params\":[{\"address\":\"0x12d66f87a04a9e220743712ce6d9bb1b5616b8fc\",\"topics\":[\"0xa945e51eec50ab98c161376f0db4cf2aeba3ec92755fe2fcd388bdbbb80ff196\"],\"fromBlock\":\"0x8b1d26\",\"toBlock\":\"0x8b1f1a\"}]}\n\nDetails: sanctioned\nVersion: viem@2.29.0\n    details: \"sanctioned\",\n   docsPath: undefined,\n metaMessages: [ \"URL: https://eth.merkle.io\",\n  \"Request body: {\\\"method\\\":\\\"eth_getLogs\\\",\\\"params\\\":[{\\\"address\\\":\\\"0x12d66f87a04a9e220743712ce6d9bb1b5616b8fc\\\",\\\"topics\\\":[\\\"0xa945e51eec50ab98c161376f0db4cf2aeba3ec92755fe2fcd388bdbbb80ff196\\\"],\\\"fromBlock\\\":\\\"0x8b1d26\\\",\\\"toBlock\\\":\\\"0x8b1f1a\\\"}]}\"\n],\n shortMessage: \"RPC Request failed.\",\n    version: \"2.29.0\",\n       code: -32603,\n       data: undefined,\n```\n\nOr on other RPCs yields some inconsistent error message about how they do not support `eth_getLogs`\nBut from what I can see for `rpc-standard-errors`, there's no specific code for an RPC specifically not supporting a method, only that a method is not found or has some internal error, so that might be nice to have\n\nAnother far more common footgun is having to play around to find limits, particularly on `eth_getLogs`, as basically every provider will limit the method in some way\n\nHowever finding the limit is always a gigantic pain, some document it, a lot do not, I've even found cases where they incorrectly document it vs what their RPC actually supports!\nMost will limit the method in these two ways, either\na) Restricting the startBlock -\u003e endBlock range\nb) Restricting the amount of logs to return\nOr often both, also.\n\nAnd so as an app dev for example, I might be testing my app and quickly find out that the RPC I'm using has a limit of 10k blocks, so I work around that.\nHowever then the app gets deployed, people begin to use it and there's a 10k block range where a lot of logs are published, and then all of a sudden the RPC begins to deny requests to users and the entire app breaks in prod.\nThis has happened to me a few times, very painful and annoying\nYou could say I just need to test more, but this is a super common footgun and new devs shouldn't have to work around this ideally, it feels like something that can be abstracted away with good libraries and standardisation\n\nSo it might be nice to have some kind of standardised way to understand these limits on `eth_getLogs`, so that if something like that happens in prod the library/log utils can auto adjust block ranges or other parameters to keep the app working.\n\nIt would also probably be a nice boost for indexing/syncing libraries, e.g. Ponder. In order to have a syncing engine with user-supplied RPCs remain reliable, they have to essentially look for literally every edge case with hundreds of possible RPCs, and be able to parse and use their individual error messages, specifically for `eth_getLogs`",
        "created_at": "2025-12-14T05:48:55.357000+00:00",
        "attachments": null
    }
]