[
    {
        "author": "antonydenyer",
        "category": "Execution Layer",
        "parent": "",
        "content": "Bit of random one (apologies if this has already been discussed), additional info being added to eth_getTransactionReceipt does not appear to have been considered during the 7702 implementation. \n\nTheres no way to confirm with the node if an authorization(s) was successful/valid.  For a given transaction you need to get the receipt, then get the block with hydrated transactions, filter to your transaction, calculate the authority and get the users nonce at that point in time then see if it's valid. This assumes you know what you're doing (which you probably don't because what you want to do is check you've done something right!). Whilst not impossible it's rather a lot of faff! \n\nDoes anyone know the reason why the \"validity\" was not returned as part of the receipt or in the hydrated block?\n\np.s for context https://x.com/_prestwich/status/1969144473977569558",
        "created_at": "2025-09-25T12:28:05.261000+00:00",
        "attachments": null
    },
    {
        "author": "s1na",
        "category": "Execution Layer",
        "parent": "",
        "content": "Out of curosity, why is it important to know at the transaction level if a authorization succeeded? eth_getCode can tell you at the block level if account is delegated, or at least it can tell you the last authorization within the block",
        "created_at": "2025-09-25T15:17:09.646000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "I assume because do filters for receipts instead of polling for an update to the code?",
        "created_at": "2025-09-25T15:59:25.110000+00:00",
        "attachments": null
    },
    {
        "author": "antonydenyer",
        "category": "Execution Layer",
        "parent": "",
        "content": "The other thing (bug admitedly) is most the RPCs aggressively cache get code, presumably because it never use to change",
        "created_at": "2025-09-25T16:09:40.424000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "interesting! i guess that makes sense",
        "created_at": "2025-09-25T16:12:36.891000+00:00",
        "attachments": null
    }
]