[
    {
        "author": "frangio_",
        "category": "Execution Layer",
        "parent": "",
        "content": "where do you see RPC methods related to keys and signatures fit if out of scope of this effort? standardization of those is a huge challenge. there are current gaps i've identified and there is no clear place to address them",
        "created_at": "2025-01-14T19:15:13.608000+00:00",
        "attachments": null
    },
    {
        "author": "frangio_",
        "category": "Execution Layer",
        "parent": "",
        "content": "just saw the note about that at the end of the doc. not sure wallet APIs should be part of this spec but i do think we're missing coordination mechanisms for them",
        "created_at": "2025-01-14T19:19:02.946000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Execution Layer",
        "parent": "",
        "content": "cool stuff, a couple notes on first review:",
        "created_at": "2025-01-14T19:41:35.724000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Execution Layer",
        "parent": "",
        "content": "1) the concept of trustless apis is interesting, but i don't see a need for it outside the section o n lightclients. I would propose that be it's own namespace, instead of spreading the need for trustlessness across the entire api.\n\n2) the idea of switching to a REST api (fine) but also requiring versioning (wat) is problematic. One of the key points of a REST api is to avoid versioning, since there isn't great ways to do it. This is a known controversy among API architects.\n\n3) no mention of callbacks/subscriptions. i think wallets care a lot about these types of apis, and i think we should plan to make this sub-domain more robust and richer as we plan a refactor.",
        "created_at": "2025-01-14T19:45:54.054000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution Layer",
        "parent": "",
        "content": "I realize now that it may have been a bit too much, putting that outlook for the new API in there",
        "created_at": "2025-01-14T20:53:21.518000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution Layer",
        "parent": "",
        "content": "I really just want to improve the JSON-RPC situation right now",
        "created_at": "2025-01-14T20:53:59.365000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution Layer",
        "parent": "",
        "content": "We are going to be working on that new API, and will be taking feedback around that, but it should not distract from the RPC",
        "created_at": "2025-01-14T20:54:34.687000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution Layer",
        "parent": "",
        "content": "I see this covered by the idea to add 'profiles' to the spec",
        "created_at": "2025-01-14T21:19:22.062000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution Layer",
        "parent": "",
        "content": "So we would define wallet-specific methods in their own profile",
        "created_at": "2025-01-14T21:19:47.320000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution Layer",
        "parent": "",
        "content": "The idea with building a new EL node API also solves this, in a way. If we move on from RPC in the nodes, the wallets have RPC to themselves and can define whatever functionality they want in there, as long as it is implementable on top of the node API",
        "created_at": "2025-01-14T21:22:31.887000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Execution Layer",
        "parent": "",
        "content": "well not really, we want RPC providers that serve wallets to also benefit from client diversity. we should be aligned on that.",
        "created_at": "2025-01-14T22:03:05.107000+00:00",
        "attachments": null
    },
    {
        "author": "robocopsgonemad",
        "category": "Execution Layer",
        "parent": "",
        "content": "so sure, it can be its own namespace, thats fine, but i would still want that aligned",
        "created_at": "2025-01-14T22:05:23.809000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "Execution Layer",
        "parent": "",
        "content": "I really like the idea of a \"core\" provable REST/RPC API that all the clients provide and then the providers can further diversify (codebase wise) over that.  I think there'd still be a successor \"user level\" API spec that all the providers would adhere to, since thats probably what wallets and dapps would talk to, but the logic could be implemented outside of the core clients (like Helios as mentioned in the doc) and the large RPC providers could more easily focus on delivering those APIs \"at scale\" without having to customize whole clients.\n\nThis only works though if the core API is cacheable and built for that use case though: Helios atm actually places more load on the \"backing node\" since generating the access list requires the backing node to run the full eth_call anyways, plus then generating the proofs.",
        "created_at": "2025-01-14T22:36:54.309000+00:00",
        "attachments": null
    }
]