[
    {
        "author": "jinfwhuang",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There a few things to unpack here.\n\n1. N server approach is definitely a viable one. The security model of 1-of-N should be sufficient for light client purposes.\n2. N server approach requires some planning too and detailed specification. For example, are the N servers discovered through a p2p mechanism, or they are found out of band? What are the communication protocol, e.g. json rpc, grpc, or libp2p resp/resp.\n3. I think we have 3 basic overall approaches. \n  - Define an out of band networking layer. Light client operator finds server endpoints manually and use those as parameters for the light client. This could still be a N server approach.\n  - Define a N server approach networking layer based on libp2p Req/Resp. We somehow convince most client teams to enable serving light-client-updates functionality by default.\n  - Use the portal network as the networking layer.\n4. These efforts do not have to be mutually exclusive. We need to coordinate its design work, however.",
        "created_at": "2021-12-16T01:30:26.284000+00:00",
        "attachments": null
    },
    {
        "author": "jinfwhuang",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There are a lot of work to be done here. I had started writing out the portal network spec. I haven't implemented anything there yet. Surprisingly, the portal network approach is the most concrete right now. Some one could start implementing a fully end-to-end light client POC with https://github.com/ethereum/portal-network-specs/tree/master/beacon-chain + https://github.com/ethereum/consensus-specs/blob/dev/specs/altair/sync-protocol.md. \nI am just starting to gather my thoughts to write down some details on a networking layer based on libp2p req/resp. I will share once I have a preliminary writeup.\n\nAfter that, I think the most interesting work would be building out both of those POCs. It is very possible that there are multiple light clients. One using a libp2p networking layer, and another using portal network.\n\nOn the portal network approach, if someone is building on golang, one only needs to implement the portal network part, the light client part is already done. The portal network component is not trivial.  On the libp2p approach, implementation will likely to be much easier because libp2p exists and portal network is not implemented yet in golang. All of the portal network implementation is in Rust, by the trin team.",
        "created_at": "2021-12-16T01:40:21.648000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e For example, are the N servers discovered through a p2p mechanism, or they are found out of band? What are the communication protocol, e.g. json rpc, grpc, or libp2p resp/resp.\n\nI was thinking found out of band. The user supplies them through an IP config, much like how the user provides a config to metamask to connect to alternate networks today. Communication method is the same as the communication method that clients use to talk to eg. Infura today",
        "created_at": "2021-12-16T13:21:41.832000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "3. I think we have 3 basic overall approaches. \n  - Define an out of band networking layer. Light client operator finds server endpoints manually and use those as parameters for the light client. This could still be a N server approach.\n  - Define a N server approach networking layer based on libp2p Req/Resp. We somehow convince most client teams to enable serving light-client-updates functionality by default.\n  - Use the portal network as the networking layer.",
        "created_at": "2021-12-16T13:22:25.839000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Do we *need* the middle approach?",
        "created_at": "2021-12-16T13:22:31.641000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Why not just have two, N-server out-of-band and portal-based?",
        "created_at": "2021-12-16T13:22:42.083000+00:00",
        "attachments": null
    }
]