[
    {
        "author": "arnetheduck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "relying on infura as a single point of failure is a massive step backwards though - it has nothing to do with security at that point, ie there's no way to verify what infura is giving you if that's the only thing you use for establishing trust in the consensus (for example behind a chinese or corporate firewall where the dns is hijacked and you're eclipsed)",
        "created_at": "2021-04-28T08:37:36.632000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "That’s the point of confirming it with the light client protocol. That said if you don’t have a reference within the weak subjectivity period you *have* to trust someone to give you the right state. You can check it in various ways but you have to start from something and have to have some external party you trust. That’s just the reality of weak subjectivity.",
        "created_at": "2021-04-28T08:55:46.127000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Also worth noting that if you’re eclipsed you are screwed regardless of your starting point.",
        "created_at": "2021-04-28T09:20:25.887000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "at some point of automation you effectively give up your free choice, _specially_ if there are no other mechanisms and safety nets around - it's a reality with modification - a weak subjectivity point that has sunk in and been distributed through multiple channels (newspaper, twitter and infura) will inherently be safer than \"do whatever this random web site says\" and from there you quickly want to forge ahead with light sync or whatever mechanism you choose to trust",
        "created_at": "2021-04-28T10:19:31.050000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Users are just as able to verify the current finalised checkpoint against the state they get as they are able to verify any older state.\n\nI’m not entirely sure what the complaint is here. Teku takes a file path or url to an initial state. For the vast majority of users it’s going to make most sense to use the latest finalised state and get in sync quickly. Most users don’t check multiple sources for the weak subjectivity checkpoints. They grab it from the place people pointed them to. The majority of verification is when they check their head block matches what’s shown on block explorers - as long as they get there the starting point doesn’t really matter. \nIf users want to start from an old state they can but for most users the age of the state won’t make any difference to how much they trust it or how much verification they do on it",
        "created_at": "2021-04-28T10:47:00.686000+00:00",
        "attachments": []
    }
]