[
    {
        "author": "jeremyakatsa",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hi Mihir. The best place to ask this would be within the C# team’s Discord at https://nethermind.io",
        "created_at": "2021-12-06T01:38:10.021000+00:00",
        "attachments": null
    },
    {
        "author": "jeremyakatsa",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hi All! So I created a topic about a project I’ve been thinking about now for quite some time… Open to any more ideas/collaborations/thoughts/etc https://ethresear.ch/t/light-client-custom-token-creation-proposal/11433",
        "created_at": "2021-12-06T01:40:06.794000+00:00",
        "attachments": null
    },
    {
        "author": "_jmc_.",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Looking back at your previous messages it seems you are running a lighthouse client, so you can use that as the source of the `beacon_state`. As I understand it, lodestar modified their beacon nodes to store updates in a db which is then queried by light clients, whereas to achieve the same using a standard beacon node you will have to implement an intermediate 'light server' that grabs the `beacon_state` via http request to a beacon node, processes it to generate updates and then serve those updates to your light client.",
        "created_at": "2021-12-06T09:28:49.108000+00:00",
        "attachments": null
    },
    {
        "author": "uink45",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Right, although, I do not have the right hardware to run a lighthouse client, is there a way to use DiscV5 to search for beacon nodes in the network and then request state from them? Also, is there any documentation (specification) for implementing the ‘light server’?",
        "created_at": "2021-12-06T09:32:05.660000+00:00",
        "attachments": null
    },
    {
        "author": "_jmc_.",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Afaik if you can find an ip address for a beacon node you can make the request, but not sure specifics atm. Regarding the light server, it is basically what is in the consensus_specs up to and including building the `LightClientUpdate` object, which you would then serve over http or rpc to your light client, which then implements the parts of the spec relating to processing those updates and populating the `LightClientStore`.",
        "created_at": "2021-12-06T09:39:29.912000+00:00",
        "attachments": null
    },
    {
        "author": "_jmc_.",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You can take a look at how I'm going about the light server side of things here, with the caveats that it is very WIP and the merkleization of the state object and proofs in the update object are dummies for now while we build out the necessary functionality in a separate repo. https://github.com/jmcook1186/beacon-light-client",
        "created_at": "2021-12-06T09:44:12.618000+00:00",
        "attachments": null
    },
    {
        "author": "uink45",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Interesting, thanks so much! In regards to using the IP address, I think the specifics may be hidden somewhere in the GitHub networking repositories.",
        "created_at": "2021-12-06T09:46:01.433000+00:00",
        "attachments": null
    },
    {
        "author": "jeremyakatsa",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@624875260373762069\u003e I second \u003c@840137734768689163\u003e ‘s statement. You can use his approach or you can directly build the light-client infrastructure into the forked C# Nethermind repo [and use their server to power your light-client] (and open pull requests as you go). \n\nWhich ever approach works for you. 👍",
        "created_at": "2021-12-06T14:30:36.572000+00:00",
        "attachments": null
    },
    {
        "author": "uink45",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Thanks Jeremy, I look forward to implementing this approach. 🙂",
        "created_at": "2021-12-06T20:47:32.085000+00:00",
        "attachments": null
    }
]