[
    {
        "author": "rubo2",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "i agree. although we hit that problem, it's easier and more practical to document it than pulling ssz to el. and it sticks to the general design",
        "created_at": "2022-11-29T00:18:33.958000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003cetan_status\u003e howso more practical?\n\nshould smart contracts / other applications use hex proofs or ssz proofs for verifying tx / withdrawals?\n\nCL has difficulty providing proofs of either kind as it lacks tx index and may have split block storage, so if answer is SSZ the EL would likely need to compute proofs\n\nif answer is hex proof, do we want to allow recovering EL block header from CL ExecutionPayloadHeader? doing so could eliminate eth_getBlockByRoot request in EL light client, and could eliminate fetching block header step when EL is driven by CL light client\n\nif we want that, should we just include the two hex roots into the ExecutionPayloadHeader (in addition to the existing SSZ roots)? CL cannot be expected to always having easy way to reproduce the hex trie roots in split block storage case if it tosses tx / withdrawals data. Could request it via eth_getBlockByRoot but that adds load to the same bus that handles validator duties via engine_getPayload / fork choice etc. If we don’t want that, will that be the case in the future as well?",
        "created_at": "2022-11-29T00:41:20.823000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Why do we want the CL to be involved in providing these proofs? isn't the EL the natural place to provide proofs to smart contracts?",
        "created_at": "2022-11-29T01:10:36.065000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003cetan_status\u003e If its an SSZ proof, that would need EL to track the SSZ roots (and SSZ withdrawal objects).\n\nIf its a hex proof, sure EL can do it.",
        "created_at": "2022-11-29T01:17:45.123000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003cetan_status\u003e And CL provides ExecutionPayloadHeader to light client as starting point. That one currently only includes the SSZ roots. So, to verify any hex proofs re tx / withdrawals, need the hex root as well :-) Currently, lc hits the node once more to fetch the EL block header as well if it wants to verify those. its the less important use case though, but still one impacted by this",
        "created_at": "2022-11-29T01:25:05.151000+00:00",
        "attachments": null
    },
    {
        "author": "mynervini",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Is anyone aware of a spec or general purpose description of computing the merkle proof for beacon state fields? or specifically for the light client fields `current_sync_committee`, `next_sync_committee` and `finalized_checkpoint.root`\nI am seeking a reference for the LC full node implementation in teku\nhttps://github.com/ethereum/consensus-specs/blob/dev/specs/altair/light-client/full-node.md#compute_merkle_proof_for_state",
        "created_at": "2022-11-29T11:20:34.911000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Spec: https://github.com/ethereum/consensus-specs/blob/dev/ssz/merkle-proofs.md#merkle-multiproofs\n\nNim impl: https://github.com/status-im/nim-ssz-serialization/blob/639758dbd9a5f3e75a15449ddf80d6fd1cfa585e/ssz_serialization/merkleization.nim#L1404",
        "created_at": "2022-11-29T11:41:30.487000+00:00",
        "attachments": null
    },
    {
        "author": "mynervini",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Exactly what I needed, thanks!",
        "created_at": "2022-11-29T11:50:31.351000+00:00",
        "attachments": null
    }
]