[
    {
        "author": "shresth",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hey \u003c@881905303011086387\u003e \nI see there has been lot of improvement done on the light client front since I last discussed. Are the API to fetch light client update already finalized?  Also I would like to run a RPC over my light client. Do you have rough idea how it would be possible to connect the light client with an execution client?",
        "created_at": "2022-07-02T08:13:49.780000+00:00",
        "attachments": []
    },
    {
        "author": "etan_status",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Both libp2p and REST APIs are still being developed.\n– libp2p: https://github.com/ethereum/consensus-specs/pull/2802 (about 41% merged, I guess this will be in by August)\n– REST: https://github.com/ethereum/beacon-APIs/pull/181\nThose APIs focus on providing access to the latest head and finalized beacon block headers.\nFrom there, by downloading and tracking the latest blocks it is possible to drive an EL using newPayload / forkChoiceUpdated.\nAn API to request proofs for CL data is proposed as part of the beacon APIs (the current proposal uses a non-EF defined merkle proof format though)\nAn API to request end-to-end proofs for EL data is still being worked on (validating RPC proxy that only returns validated data).\n\nNote that due to the nature of the light client sync protocol, there is a delay of at least 1 slot (12 seconds) as the sync committee signatures in a block attest to the previous block. The delay can be cut short by some seconds by listening to sync committee message gossip as well, but that also requires processing more traffic.",
        "created_at": "2022-07-02T14:47:06.468000+00:00",
        "attachments": []
    },
    {
        "author": "etan_status",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Also keep in mind, that the \"run RPC over my light client\" will require the merge to have occurred. Otherwise, the CL does not have an up-to-date link to the EL that can be validated through merkle proof.",
        "created_at": "2022-07-02T14:48:01.501000+00:00",
        "attachments": []
    }
]