[
    {
        "author": "arnetheduck",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "nimbus indeed implements both a full server and client - server is enabled by default, see https://nimbus.guide/el-light-client.html for a simple light client that can drive an execution client",
        "created_at": "2022-10-27T13:20:39.443000+00:00",
        "attachments": null
    },
    {
        "author": "philngo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hey \u003c@563394111214714881\u003e ! Phil here from Lodestar. Incredibly happy to see your work on Kevlar and some of the other guys you're working with to push light clients forward on Ethereum. I'm trying to consolidate a bunch of work and help better coordinate light client contributors as most of the work, people, research and efforts are scattered without a place for all of us to collab. Been working on notion wiki to help people get in and familiar with the ecosystem and what's out there already. I see you guys have set it up all at https://github.com/lightclients/. I had some feedback at Devcon about having a central place for people to showcase their work and it seems to make sense to keep building upon including these types of projects in that repo. We originally setup https://github.com/ethereum-light-clients for this purpose. Does it make sense to just collaborate on putting everything on /lightclients? What else do you envision going into that repo? For example, there's a C# implementation of the light client spec from mycelium here: https://github.com/mycelium-ethereum/Beacon-Chain-Light-Client-Prototype",
        "created_at": "2022-10-27T18:09:18.349000+00:00",
        "attachments": null
    },
    {
        "author": "shresth",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hey \u003c@578356786889752586\u003e that sounds like a very good idea. I will PM you about it to discuss more",
        "created_at": "2022-10-27T18:20:44.826000+00:00",
        "attachments": null
    },
    {
        "author": "80raghavendra",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "A naive question related to light clients. In order to watch for events on Ethereum, say like a certain assets being locked in a contract in case of bridging,  can we just use this light client to monitor such events? \n\nMy thinking here is that we need a full node to executing the blocks, and detecting the events, forming the transaction log Merkle trie. This node acts as a relayer packaging appropriate block where the event has happened to the light clients, which can then verify. Am I correct?",
        "created_at": "2022-10-27T20:40:09.860000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "light clients will have the latest block root via their sync and then can request proofs about arbitrary chain state, including receipts from full node providers",
        "created_at": "2022-10-27T21:18:56.713000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "the light client can ship w/ code to parse the log from the receipt",
        "created_at": "2022-10-27T21:19:13.824000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "and yup, sounds pretty much correct",
        "created_at": "2022-10-27T21:19:31.699000+00:00",
        "attachments": null
    }
]