[
    {
        "author": "dcposch",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "interesting, thanks!\n\n- 1. i meant being able to use the new light client protocol to track real Ethereum state post-merge.\n\n- 2. interesting, thanks for the clarification. my understanding is the sync committee is chosen randomly, so unless an attacker controls a majority of all stake they are unlikely to be able to corrupt a sync committee. is that fair?\n\n- sg, i'll add a source. ~20ms is the web2 state-of-the-art from global CDN providers like cloudflare. https://blog.cloudflare.com/cdn-latency-passive-measurement/ my point is less the exact number, more that it's a lot faster than what you get from connecting to a P2P network.",
        "created_at": "2022-05-31T03:06:02.810000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "@2: Yep, the sync committee is chosen randomly, once per ~day, so an attacker is unlikely to control a supermajority of the sync committee.\n\nThe same security properties apply w.r.t. weak subjectivity period, though -- if the sync process is started from outside the weak subjectivity period, there is no protocol guarantee that you will end up at the correct head. You need to seed the sync process with a sufficiently recent trusted beacon block hash, similar to checkpoint sync for full nodes.",
        "created_at": "2022-05-31T12:58:59.539000+00:00",
        "attachments": null
    },
    {
        "author": "dcposch",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "for sure, needing a recent checkpoint is inherent to PoS, to my understanding. totally reasonable and doesn't add any additional trust assumptions. you already have to trust the client developers + code reviewers (and typically, a lot else besides; the build system, the hosting system for downloading client binaries, etc). you already have to run a recent client version to use the chain safely. each client release can be built with the latest checkpoint.\n\nthere's still room for improvement, but this is already much better than the status quo. most Ethereum users today go thru Infura/Alchemy and trust a specific company to answer queries without any verification.\n\nif i'm understanding correctly, once this new API is implemented, i can point a *light client* to Infura/Alchemy and sync eth2. i still get centralized-API-like reliability and performance, but my trust assumptions are minimized to just the open source client development+release process, plus an honest stake majority.",
        "created_at": "2022-05-31T19:39:17.081000+00:00",
        "attachments": null
    }
]