[
    {
        "author": "samcm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Heya 👋 \u003c@181594452228308992\u003e and I developed Checkpointz, happy to have a chat 🙂",
        "created_at": "2022-11-02T02:24:09.548000+00:00",
        "attachments": []
    },
    {
        "author": "samcm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "We haven't looked in to the sync committee stuff at all though as an FYI",
        "created_at": "2022-11-02T02:24:42.777000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Ideally lightclients aren't booted like this. There should be some heuristic all full beacon nodes follow to allow for LH clients to continue participating in gossip. It should be specced",
        "created_at": "2022-11-02T03:08:20.454000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Maybe a certain max ratio of LC to Full nodes that we are connected to, etc",
        "created_at": "2022-11-02T03:08:56.434000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "You'd typically only be issuing block by range requests while syncing in which case you don't want to be connected to a light client which is useless, but the light client doesn't want to be connected to you either so it works out.\nBlock by hash is a little more ambiguous but you can't really expect a peer to send you a block by hash if it hasn't somehow advertised that it actually has that block.",
        "created_at": "2022-11-02T03:33:41.124000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The most likely reason I'd expect light clients to find it hard to keep peers is that a full node, particularly a validating one, would likely be prioritising peers that are subscribed to attestation subnets. Non-validating nodes don't have that requirement though and would probably be enough to support light clients well. Might take a little bit of rejigging peer prioritisation rules but shouldn't be too bad.",
        "created_at": "2022-11-02T03:35:51.353000+00:00",
        "attachments": []
    },
    {
        "author": "nashatyrev",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Ok, got it! Then may be it makes sense for me to compose some draft proposal on this then share and discuss it with you guys?",
        "created_at": "2022-11-02T11:21:06.980000+00:00",
        "attachments": []
    }
]