[
    {
        "author": "etan_status",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Submitted PR 7/12 for review: https://github.com/ethereum/consensus-specs/pull/2935",
        "created_at": "2022-07-12T05:44:01.317000+00:00",
        "attachments": null
    },
    {
        "author": "shresth",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "1. Hey \u003c@881905303011086387\u003e currently all the benchmarks were done where each light client update was downloaded individually. But you have a valid point and this has also been raised by some other people. I will update my implementation and benchmarks to allow for light client to download the update in batches. Can you elaborate how did you come up with 128 number? \n2. We make a non eclipsing assumption that is 1 out of n nodes that the client connects to is honest. This assumption is also required for light client or even full node to sync successfully. This is a standard assumption in a lot of the literature",
        "created_at": "2022-07-12T05:48:20.279000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "– The 128 is just what's currently specified in https://github.com/ethereum/consensus-specs/pull/2802 -- in practice that's more than enough, given that any sync should start within the weak subjectivity period to ensure ending up at the correct head\n– Yeah, 1 will be honest, but the question is how many you should connect to before considering one honest. With the base light client protocol, the peer discovery order doesn't matter / as soon as any update is obtained with enough participation, it is applied, e.g., it is normally sufficient to just find 1 peer as the response does not need to be crosschecked against others.",
        "created_at": "2022-07-12T05:53:24.087000+00:00",
        "attachments": null
    },
    {
        "author": "shresth",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "- Thanks I will check this\n- For super-light implementation also the order doesn't matter. The honest prover will always win the bisection game in the end. Afaik most of the existing literature use 8 or 12 as the number of nodes which you need to connect to consider 1 honest.",
        "created_at": "2022-07-12T05:58:30.422000+00:00",
        "attachments": null
    }
]