[
    {
        "author": "dapplion",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "To EL devs: `eth_getProof` Accepts as 3rd params arg \n\n\u003e QUANTITY|TAG - integer block number, or the string \"latest\" or \"earliest\", see the default block parameter\n\nCan it accept the root of a block or state in order to be sure you are getting the proof against a specific root that you trust? In case of multiple blocks with the same height it's an issue to know what are you getting the proof for",
        "created_at": "2022-11-14T16:54:54.510000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "you could use `blockHash` to get the block number and use that",
        "created_at": "2022-11-14T17:45:02.549000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "i would expect that API to work against the canonical chain so you don't have that issue",
        "created_at": "2022-11-14T17:45:38.576000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003cetan_status\u003e When you use public endpoint, you don't control what the canonical chain is (with forkchoiceUpdated)",
        "created_at": "2022-11-14T18:01:39.956000+00:00",
        "attachments": null
    },
    {
        "author": "dapplion",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It seems like an obvious value for that parameter to be a root and eliminate the risk you get a re-org between those calls",
        "created_at": "2022-11-14T19:03:50.732000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I think you're looking for: https://github.com/ethereum/EIPs/blob/master/EIPS/eip-1898.md Geth and Besu have at least some support for it.",
        "created_at": "2022-11-14T20:46:56.776000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It does seem like a no-brainer to have to me. I was surprised it wasn't always supported.",
        "created_at": "2022-11-14T20:47:16.034000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003cPhil_ngo\u003e Forwarded from Phil_ngo: Hey all! Wanted to open up a higher level discussion about some of the things we've been thinking of and collaborating on to further push ecosystem-wide light client discussions. Some problems we haven't figured out yet. Was thinking this could be a good place to hash out some lingering spec questions. \n\n1. How do we signal that a peer has \"light node\" capabilities? In ENR or metadata?\n2. Ideas on how we prevent full nodes from downscoring light nodes on p2p?\n3. Browser compatible transports... (websocket, webrtc, webtransport, ?) \n\nAny other lingering questions that I'm missing so far \u003c@688748669268132001\u003e @caymannan ?",
        "created_at": "2022-11-14T22:39:46.473000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003cPhil_ngo\u003e Forwarded from unknown: (1) the list of libp2p req/rsp methods only contains the LC endpoints on supported nodes. but it's only after connecting to it, so the practical implementation is to just give it a try and either it works or downscore peer until finding some that serve the data needed. seems to be a temporary problem as all major CL teams will adopt LC protocol\n\n(2) is this only a concern for a full node that is actively syncing themselves? in that case, downscore is alright because the peer is useless to them.\n\n(3) the http SSE events endpoint supports subscribing to data, in line with other events for beacon-API. if there are other transports for beacon-API, should be a part of that effort to remain consistently compatible. otherwise, probably extending the scope to the entire beacon-API may be useful",
        "created_at": "2022-11-14T22:40:00.629000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003cPhil_ngo\u003e Forwarded from unknown: for (2), light clients that are on p2p just for single-shot syncing are not connected long enough to get descored. for those who stay connected for longer, they participate on 2 gossipsub topics to follow latest finalized / optimistic head. not sure if it s sufficient to farm score on those topics though",
        "created_at": "2022-11-14T22:40:09.903000+00:00",
        "attachments": null
    }
]