[
    {
        "author": "shresth",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hey \u003c@881905303011086387\u003e, can you remind why there is no slashing condition for the sync committee to double sign?",
        "created_at": "2022-08-09T17:30:44.045000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "it reduces protocol complexity",
        "created_at": "2022-08-09T18:53:37.255000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "it could be added but it would need to be clear that it pulls its weight as a feature",
        "created_at": "2022-08-09T18:54:09.539000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "For the current (pre-merge / Altair) use cases, i.e., accelerating the CL sync, the worst that can happen is that you end up syncing to a wrong head, which you'll notice because the beaconcha.in app notifies you when you miss attestations. After the merge, the light client will be usable for more use cases, such as trust-minimized bridges to L2 networks. For those use cases, I agree that security should be improved, but even if there were a slashing, and even if the entire sync committee would be slashed to 0, the slashed amounts still are not comparable to the funds locked in certain L2's. Nevertheless, I agree that it would be in the spirit of the beacon-chain spec to punish malicious behaviour, and the sync committee messages are a bit of a grey-zone because they are actually not relevant at all for the security of the beacon chain itself — however, it is still a service provided by the beacon chain, and introducing a slashing condition could improve security at least somewhat.\n\nFor Capella, I am working on a proposal to introduce a slashing condition when a validator signs beacon blocks with different conflicting finalized `next_sync_committee`, with merkle proofs as evidence. This way, a misconfigured validator who temporarily forks off to a minority chain due to networking issues or out-of-date client will not be affected (same as for attestations and proposals). However, it is not possible for a misconfigured beacon node to ever finalize different `next_sync_committee` (unless it re-syncs from outside weak subjectivity period, and picks a different fork, but that can be covered by slashing protection).",
        "created_at": "2022-08-09T22:24:13.226000+00:00",
        "attachments": null
    },
    {
        "author": "shresth",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Thanks \u003c@881905303011086387\u003e and \u003c@539495253418180618\u003e for clarification",
        "created_at": "2022-08-09T22:36:11.763000+00:00",
        "attachments": null
    }
]