[
    {
        "author": "dapplion",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@!273808422753796097\u003e describes in this post (https://vitalik.ca/general/2021/05/23/scaling.html) a potential attack to the protocol (PoW) where:\n\n- Majority of miners + exchanges + explorers collude\n- Mint a large amount of tokens to an address control by the cartel\n- Disperse the tokens to the broad DeFi ecosystem\n\nA successful attack means having the minted value included in the \"main\" chain in an irrevesible way. Where \"main\" is the chain with most economic value and legitimacy after settling the fork war(s)\n\nGiven that the critical infrastructure is on the malicious fork, the broader community must rally publicly to either (1) force rogue infrastructure providers to switch back, or (2) setup new infrastructure following the right chain. I fail to see how having a large quantity of non-miner user facing nodes help achieve this two objectives.\n\nWould love some feedback to clarify the leverage that independent node runners add to fight this attack vs the default social pressure available to all participants",
        "created_at": "2022-03-22T06:35:54.979000+00:00",
        "attachments": null
    },
    {
        "author": "dapplion",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "To clarify: I'm comparing the capacity to resolve such attack in this two network situations\n\nA) Community runs a very small amount of non-mining nodes, but enough to audit the chain and detect the invalid block immediately\nB) Community runs the vast majority of non-mining nodes in the network, i.e. \u003e 90% the rest is run by rogue infrastructure providers",
        "created_at": "2022-03-22T06:54:34.767000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Many users only use large infrastructure providers because they can't run their own nodes.  If running a node was free (hypothetical extreme to illustrate the paint), there would be no infrastructure providers, only users.",
        "created_at": "2022-03-22T08:12:49.749000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Infura has decision making power because users delegate their decision making to them.  They do this because they can't run their own nodes.",
        "created_at": "2022-03-22T08:13:16.675000+00:00",
        "attachments": null
    },
    {
        "author": "dapplion",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "By users you mean applications and wallets?",
        "created_at": "2022-03-22T09:38:31.283000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "No, regular people who are actually using crypto-currency for things.  i.e., end-users",
        "created_at": "2022-03-22T09:49:54.070000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "IMO, they are the only ones who really matter, people who utilize the financial system we are building to do financial things.",
        "created_at": "2022-03-22T09:50:18.473000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Other builders aren't the target demographic, legacy institutions aren't the target demographic, VCs are not the target demographic.",
        "created_at": "2022-03-22T09:50:51.061000+00:00",
        "attachments": null
    },
    {
        "author": "dapplion",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Agree but I did on overview research on how the most popular dapps consume blockchain data and most of them use custom rpc hosted internally. This include not limited to: Lido, Uniswap, Compound, Axie Infinity, Decentraland, Aave, Lyra, Frax finance, Nexus Mutual, OpenSea, LooksRare, ZapperFi.",
        "created_at": "2022-03-22T09:59:07.780000+00:00",
        "attachments": null
    },
    {
        "author": "dapplion",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "For some of them (like Uniswap for user balances) they connect to the injected web3 instance in the browser. Then you can add a custom RPC to your wallet provider and direct that to your own user ran node. But if the dapp's RPC is an internal URL, you can't use your own infra",
        "created_at": "2022-03-22T10:00:31.490000+00:00",
        "attachments": null
    },
    {
        "author": "dapplion",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I 100% agree with you, I'm just reporting on the current situation. Would love to see a reversal in this trend easing self hosting requirements 👍",
        "created_at": "2022-03-22T10:02:12.025000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Yes, I have complained to many dapps about the inability for users to provide their own JSON-RPC endpoint.",
        "created_at": "2022-03-22T10:07:46.751000+00:00",
        "attachments": null
    }
]