[
    {
        "author": "aeryzk",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hey, I'm Abdullah, working on some stuff that involves using light clients. During the light client update, I would like to also access to the data related to the justified checkpoint so that based on the finality requirements of the protocol, I can have the option to use the justified checkpoint instead of only the attested or the finalized. Would it make sense to include it to the `LightClientUpdate`? \nAlso see the relevant issue: https://github.com/ethereum/consensus-specs/issues/3502",
        "created_at": "2023-11-16T13:45:10.031000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003cetan_status\u003e \u003e \u003cetan_status\u003e  There is ongoing work independent of LC to introduce “Confirmation Rule” at some point. Which would be much better for UX than the justified checkpoint. If you rely on justified cp, while you may lower the wait time for finality from 12 min to 6 min, its not a substantially different UX.\n\nPersonally would recommend waiting for confirmation rule to be ready before extending LC update structures (re @Lightclient_bot: \u003caeryzk\u003e Hey, I'm Abdullah, working on some stuff that involves using light clients. During the light client update, I would like to also access to the data related to the justified checkpoint so that based on the finality requirements of the protocol, I can have the option to use the justified checkpoint instead of only the attested or the finalized. Would it make sense to include it to the `LightClientUpdate`? \nAlso see the relevant issue: https://github.com/ethereum/consensus-specs/issues/3502)",
        "created_at": "2023-11-16T14:14:47.542000+00:00",
        "attachments": null
    },
    {
        "author": "philngo",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hey everyone, regarding LCS#2 at Devconnect:\n\nWe've finalized the speaker list. There was one timing change and one addition to the speakers. All the information can be found here: https://lightclients.eventbrite.com \n\nWe will be located in Event Room: 3B/36 of the co-working space. \n\nThis event was oversubscribed with a turnout larger than we expected. Due to the size of the room, we had to limit the tickets we issued and cannot guarantee access to those without tickets. If you would like to try, please ask the check-in desk throughout the day of the event and we can try to accommodate if there are no-shows.\n\nThose with tickets, please arrive before 9:55am or we will try to fill the extra space with any standby/interested attendees that show up. You will need to provide your ticket/e-mail address which was registered for the event. \n\nFeel free to use this channel to collaborate or coordinate with others during the Light Client Summit as there will be many interested parties around and more space outside of the event room to continue conversations. \n\nFor those who couldn't attend, the livestream will be located here: https://app.streameth.org/devconnect/light_client_summit and will be recorded by StreamETH.",
        "created_at": "2023-11-16T15:14:08.160000+00:00",
        "attachments": null
    }
]