[
    {
        "author": "dapplion",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The random sample on a huge validator set provides a minimal economic security sufficient for wallets and other low TVL features. I would never put funds a bridge _solely_ supported by the altair lightclient, but hybrid models do have value. I don't think making messages slash-able significantly increases the economic security of the feature. So basically:\n- low value consumers (wallets) use altair lc as is\n- high value consumers (bridges) wait for a full consensus zk circuit",
        "created_at": "2023-10-16T17:49:54.986000+00:00",
        "attachments": []
    },
    {
        "author": "dapplion",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "it would be interesting to understand the compute \u0026 data cost that you experienced in your implementation and see if we can come up with optimizations to bring them down to a level that would be acceptable",
        "created_at": "2023-10-16T17:51:43.001000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "One of the issues was computing the LC proof with respect to the parent of the head state, which requires keeping it around. Easy if you've got tree-states, but not so straightforward otherwise.",
        "created_at": "2023-10-16T21:14:38.522000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003cPhil_ngo\u003e \u003e \u003cPhil_ngo\u003e  Hey @JuampiHernandez, tickets have already been released and sold out. Unfortunately due to venue constraints, a limited number of tickets were available. There will however be a recorded livestream for the talks and many of the light client contributors will be around throughout Devconnect and reachable through here. (re @JuampiHernandez: who can I talk with about tickets?)",
        "created_at": "2023-10-16T21:35:43.616000+00:00",
        "attachments": []
    }
]