[
    {
        "author": "radekkapka",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hi \u003c@881905303011086387\u003e , we briefly discussed light client support in Prysm during the Austria interop. After some discussions within the team, we decided that we are not going to build a light client implementation at the moment. However we do want to support light client in our beacon node. Apart from the specs, are there any more useful resources that I can read to get up to speed?",
        "created_at": "2023-02-23T15:46:15.589000+00:00",
        "attachments": []
    },
    {
        "author": "etan_status",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The typical challenges are:\n– You have to think of the capella/deneb stuff as overlays on top of a copy of the altair spec.\n– Your SSZ library needs support to obtain single-branch merkle proof by GeneralizedIndex. uint64 index is sufficient\n– To answer requests, you will have to obtain merkle proof for historic BeaconState. This can be quite challenging, so Lodestar/Nimbus use a caching strategy where we persist those proofs on an ongoing basis so that we don't have to recompute them when requested. That works quite well. Database size discussed here: https://github.com/status-im/nimbus-eth2/blob/stable/beacon_chain/beacon_chain_db_light_client.nim\n– Once you have the proofs, next you need to link it up with block processing, to keep track of the `best_update` per sync committee period. there needs to be a way to mark updates ineligible that are not currently selected by fork choice, but on a reorg it becomes eligible again. this is mostly relevant on sync committee period boundaries.\n– Also keep in mind, that there may be networks where the sync committee period boundary does not align with the fork schedule, so the database should be flexible enough to support that.\n– Once you have the data, there are two network interfaces. libp2p and REST. Both have a push component, and a req/resp component.\n– For libp2p, req/resp follows ForkDigest context from altair: https://github.com/ethereum/consensus-specs/blob/dev/specs/altair/p2p-interface.md#forkdigest-context\n– For libp2p, gossip encodes ForkDigest into the topic: https://github.com/ethereum/consensus-specs/blob/dev/specs/phase0/p2p-interface.md#topics-and-messages\n– For REST, req/resp supports both SSZ and JSON. There is a HTTP header to indicate fork digest: https://github.com/ethereum/beacon-APIs/tree/master/apis/beacon/light_client — on JSON, there is an additional `version` field\n– For REST, HTTP SSE only supports JSON: https://github.com/ethereum/beacon-APIs/blob/master/apis/eventstream/index.yaml#L84",
        "created_at": "2023-02-23T15:59:28.427000+00:00",
        "attachments": []
    },
    {
        "author": "etan_status",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003c@534934855113506836\u003e /\u003c@688748669268132001\u003e re lodestar",
        "created_at": "2023-02-23T16:00:17.142000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "wow, very comprehensive answer",
        "created_at": "2023-02-23T16:08:04.047000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "thank you",
        "created_at": "2023-02-23T16:08:05.040000+00:00",
        "attachments": []
    },
    {
        "author": "etan_status",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "np, if you have any questions, feel free to just put them here. With Prysm serving light client data on libp2p, many of the current peer discovery pain points will just vanish. Grateful that you are looking into it 🙂",
        "created_at": "2023-02-23T16:10:57.738000+00:00",
        "attachments": []
    }
]