[
    {
        "author": "radekkapka",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hi \u003c@881905303011086387\u003e , I am trying to implement the p2p spec in Prysm and there is one thing in the Req/Resp I can't figure out. Looking at the bootstrap spec, it says\n\u003e A ForkDigest-context based on compute_fork_version(compute_epoch_at_slot(bootstrap.header.beacon.slot)) is used to select the fork namespace of the Response type.\n\nI think the most straightforward example is when we are in Deneb and we get a bootstrap request for a block in Capella. Its `attested_header.beacon.slot` will still be in Capella, so we should return a `capella.LightClientBootstrap`. But if the implementation constructs the update from scratch, then since we are already in Deneb we have to execute Deneb's version of `block_to_light_client_header`, which will return a header that only fits `deneb.LightClientBootstrap`.\n\nThis could probably be solved by creating and saving bootstraps as we receive blocks, but this feels very inefficient. Regular updates, which I haven't thought about yet, surely have a similar problem. Finality and optimistic updates don't have this issue because clients will surely cache the last one of each.",
        "created_at": "2024-10-28T15:42:52.927000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I haven't thought what are the implications of changing the spec to base the digest on the current epoch",
        "created_at": "2024-10-28T15:45:11.896000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "In Nimbus, that's what we do -- we create and save bootstraps and updates as we receive blocks. It was not viable to compute data on-demand in interactive scenarios, because for the various branches rooted in `BeaconState` you need the state to be loaded and hot, as in, state root has to be actively recomputed / cached to create the proofs. I have provided an implementation that does that caching in the tests as part of this PR as well: https://github.com/ethereum/consensus-specs/pull/3553 \n\nfor the `current_sync_committee_branch` within the `capella.LightClientBootstrap` you'll need the Capella post-state after applying `attested_header.beacon.slot` (without any extra empty slots applied).",
        "created_at": "2024-10-28T19:35:57.350000+00:00",
        "attachments": null
    }
]