[
    {
        "author": "inspector.butters",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I have a question regarding the light client gossipsub rules. in this part of the spec, it says:\n\n\u003e For full nodes, the following validations MUST additionally pass before forwarding the finality_update on the network.\n\u003e \n\u003e [IGNORE] The received finality_update matches the locally computed one exactly (as defined in create_light_client_finality_update)\n\nthis is the same for optimistic_update. \n\nmy question is that, in the case that the full node has processed the update before receiving it from gossip, then it must have broadcasted it already, and the received update will not be forwarded because it's not newer.\nAND in the case that for some reason the full node has not been able to process the local update, then it has nothing to compare to when receiving it from gossip. \n\nso what does this rule mean? cc. \u003c@881905303011086387\u003e",
        "created_at": "2025-09-20T16:11:35.319000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003cetan_status\u003e the data is sent 4s into the slot so the local data is expected to be available.\n\nonly validators in the sync committee initially send data. this rule is for every full node and ensures that only expected data is propagated further",
        "created_at": "2025-09-20T16:14:07.335000+00:00",
        "attachments": null
    },
    {
        "author": "inspector.butters",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "ah interesting. I missed the \"only validators in the sync committee initially send data\" part. \nand if we don't have the locally computed update (due to unexpected behavior), we just ignore the received message?",
        "created_at": "2025-09-20T16:26:14.151000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003cetan_status\u003e yep",
        "created_at": "2025-09-20T21:01:57.110000+00:00",
        "attachments": null
    },
    {
        "author": "inspector.butters",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "thank you",
        "created_at": "2025-09-20T22:07:05.711000+00:00",
        "attachments": null
    }
]