[
    {
        "author": "radekkapka",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "1. For https://ethereum.github.io/beacon-APIs/?urls.primaryName=dev#/Beacon/getLightClientOptimisticUpdate, if the incoming block is in fork `B` and the attested header's block is in fork `A`, what should be in the `version` field?\n2. For https://ethereum.github.io/beacon-APIs/?urls.primaryName=dev#/Beacon/getLightClientFinalityUpdate, if the incoming block is in fork `C`, the attested header's block is in fork `B` and the finalized header's block is in fork `A`, what should be in the `version` field?",
        "created_at": "2025-06-20T10:26:01.019000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "My answers:\n1. `B`\n2. `C`",
        "created_at": "2025-06-20T10:26:33.625000+00:00",
        "attachments": null
    },
    {
        "author": "dirkjaeckel",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I hope this is the right channel for my questions. If not, please point me to a more appropriate place.\n\nI am trying to develop an Android wallet that doesn't need an RPC backend, but is still able to receive the necessary data in a permissionless and verifiable way (trustless). \n\nWhat minimal data does a wallet need?\n- past transactions that affect the accounts balance for ETH and ERC-20 token\n- The ETH balance of a given account\n- The nonce for the account (to create transactions)\n- The balance for ERC-20 contracts\n- A way to submit transactions to the network\n- Am I missing something?\n\nI was planning to use Trueblocks for the past transactions and the Portal Network for transaction data and the balance and the nonce. But with the recent changes to the Portal Network scope, that seems not to be an option anymore. \n\nWhat currently available features in the EL and CL can I use alternatively?\nTrueblocks gives me pairs of block number and index of relevant transactions. But not the block data itself. \n\nI should be able to get these blocks from EL nodes. But how can I verify they are correct? As I understand it, I can get the block hashes of recent blocks via sync committees. What else if anything can I get via sync committees?\n\nIs there any way to get the ETH balance in a verifiable way? \nIs there any way to get the ERC-20 balance for a certain account?\nIs there any way to get the current nonce?\n\nI am happy to integrate a devp2p client and a libp2p client to participate in the EL and CL networks. \n\nIf I can't get everything right now. What future development would help me and when might they be available?\nFor example: Would the \"Pureeth Meta\" proposal help me significantly? https://eips.ethereum.org/EIPS/eip-7919\nWhat about the Verge? Would that allow me to get the data I need (permissionless and trustless)?",
        "created_at": "2025-06-20T13:59:53.768000+00:00",
        "attachments": null
    },
    {
        "author": "dirkjaeckel",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "What advice can you give me to proceed without the Portal network? As I understand the recent development, the future history network will not provide verifiable block data. The assumption is that a Portal Network client is not stand alone but part of an EL full node. A full node can verify the correctness of the blocks it receives via Portal (As I understand it). \n\nAre there any developments outside Ethereum that might help me?",
        "created_at": "2025-06-20T14:00:27.836000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "1. A, it's always based on attested header slot\n2. B, it's always based on attested header slot. if finalized header is earlier, have to convert it to fit into the datatype (then as part of validation recover original type for hashing)",
        "created_at": "2025-06-20T14:04:30.402000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "there are two problems mixed here: a source to obtain the data from, and verifiability. note that once you have verifiability, you can use anonymizing networks to access the RPCs to protect privacy.\n\neth_getProof gives you account balance, account nonce, code, and storage slots.\nyou can use it to fetch any state and then simulate eth_call by running a local EVM and filling in missing pieces with eth_getProof.\nthat's what the products such as a16z/helios are doing.\n\nPureth Meta helps with the missing pieces that live outside the state trie, mostly for eth_getLogs, and for transaction / receipt access.\nVerge affects state, you can already get all the state with eth_getProof.\n\n\"past transactions that affect the accounts balance for ETH\"  – this information is not recorded anywhere today, you have to do check the balance after each individual transaction, or run the debug trace on every single transaction to accurately follow ETH transfers. pureth would make it available",
        "created_at": "2025-06-20T14:09:24.551000+00:00",
        "attachments": null
    },
    {
        "author": "dirkjaeckel",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "What RPC node can I use permissionless that provide eth_getProofs? Meaning without an API key?",
        "created_at": "2025-06-20T14:21:12.760000+00:00",
        "attachments": null
    },
    {
        "author": "dirkjaeckel",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I get the transaction coordinates (block number and index) from Trueblocks data. Admittedly I cannot verify the completeness. I was hoping to mitigate that by comparing it to the balance.",
        "created_at": "2025-06-20T14:23:19.453000+00:00",
        "attachments": null
    },
    {
        "author": "dirkjaeckel",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Apparently there are RPC providers with getProof and a limited free tier. Maybe I can find a way to use that.",
        "created_at": "2025-06-20T14:37:15.185000+00:00",
        "attachments": null
    },
    {
        "author": "dirkjaeckel",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Thank you. I will look into that.",
        "created_at": "2025-06-20T14:37:34.441000+00:00",
        "attachments": null
    },
    {
        "author": "inspector.butters",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "could you please explain more about why it's always based on the attested header slot?",
        "created_at": "2025-06-20T17:01:25.694000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "the data being signed by the sync committee _is_ the attested header, so that is the exact data type that the signature pertains to",
        "created_at": "2025-06-20T17:29:03.861000+00:00",
        "attachments": null
    },
    {
        "author": "inspector.butters",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "thank you",
        "created_at": "2025-06-20T20:53:20.320000+00:00",
        "attachments": null
    }
]