[
    {
        "author": "__flcl",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "What's wrong with such idea: given state root of a block, account, storage cell (or balance) and its value, we can try to generate a proof for every cell (that it is in trie with such root and account, and has certain value) using a ZK VM that includes just merkle trie calculations, and host it as historical data, without need in intermediate trie nodes in a light clients network? And allow to retrieve any cell (or balance) and verify it locally?",
        "created_at": "2025-11-26T12:27:24.128000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Practically, getting people to serve heavyweight RPC endpoints for free is the hard part.  For situations where you have some paid/centralized data provider, you can still be censored (this happens in the real world).",
        "created_at": "2025-11-26T13:14:28.710000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Separately, while ZK proofs would be smaller on the wire than ZK proofs of the same thing and maybe similar resources to verify, the resources it takes the server to generate them are still orders of magnitude bigger I believe so it is unclear this would be a net win in the real world.",
        "created_at": "2025-11-26T13:15:21.551000+00:00",
        "attachments": null
    },
    {
        "author": "__flcl",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "When generated they are just stored and easily retrievable, with no processing needed. Generation may be heavy, but 1. it seems like proof calculation steps can be shared among proofs for different cells 2. proofs can be generated in such way that 1-5% of them are created by a specific node and then shared using a Kademilia based storage among full nodes and nodes similar to portal network nodes",
        "created_at": "2025-11-26T13:20:48.102000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "The idea is that the network would maintain an always-up-to-date proof for every storage slot?  How much space would that take up?",
        "created_at": "2025-11-26T13:21:56.589000+00:00",
        "attachments": null
    },
    {
        "author": "__flcl",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Good questions. I think such proofs will be more compact than witness for sure, but still will take lot of space, which partially solved by storing in KAD. And I'm not sure whether we even need all the history or just the tip. Let me calculate the potential requirements. Can it remove need in verkle and trie transition? Can it be historical state storage with no expiry?",
        "created_at": "2025-11-26T13:26:55.158000+00:00",
        "attachments": null
    },
    {
        "author": "__flcl",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e always-up-to-date proof for every storage slot\nyes and balance probably",
        "created_at": "2025-11-26T13:29:15.792000+00:00",
        "attachments": null
    },
    {
        "author": "__flcl",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It will be just 2TB for all the state, confirming",
        "created_at": "2025-11-26T15:37:40.724000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "What would the disk growth look like per 32 byte slot?",
        "created_at": "2025-11-26T17:53:24.104000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "And what would be the worst case disk growth if someone spammed SSTOREs?",
        "created_at": "2025-11-26T17:53:44.751000+00:00",
        "attachments": null
    },
    {
        "author": "__flcl",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "I guess something like 32? proof + 32 slot value + 48? slot path = 112b",
        "created_at": "2025-11-26T18:11:19.708000+00:00",
        "attachments": null
    }
]