[
    {
        "author": "mratsim",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@!203220829473996800\u003e \u003c@!555483069038198827\u003e I'm interested in implementing Polynomial Commitments (https://github.com/mratsim/constantine/issues/112)\n\nNot sure if this is the proper channel but I think it needs a little animation anyway.\n\nDo you have a minimal testcase that can be used as a Kate Proof-of-Concept?",
        "created_at": "2021-01-20T12:37:33.644000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@!570268431522201601\u003e Generally I followed the python code, and implemented the same test cases to run through them step-by-step to compare computations, input sizes, etc. to make sure I didn't get anything different. It's primarily just a lot of data transforms, and although the python code is readable, it didn't translate straightforward to idiomatic Go, so that took some time. The crypto itself is not too bad after that.\nTheory:\n- https://dankradfeist.de/ethereum/2020/06/16/kate-polynomial-commitments.html\n- FK20: https://github.com/khovratovich/Kate/blob/master/Kate_amortized.pdf\nYou can find the python code by Dankrad here:\n- https://github.com/ethereum/research/tree/master/polynomial_reconstruction\n- https://github.com/ethereum/research/tree/master/kzg_data_availability\nAnd Go code (with tests and benchmarks): https://github.com/protolambda/go-kate",
        "created_at": "2021-01-20T13:12:12.483000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also, my go-kate version has build options to switch between Herumi and Kilic BLS. The former is generally faster for G1 work, but the latter for F_r work (all those FFTs!). Herumi uses CGO (syscall overhead due to go-routine safety) and Kilic uses Go assembly (no syscall overhead). Depending on your BLS base, you may want to try different things. And I couldn't get BLST into the mix yet, but maybe you can in Nim.",
        "created_at": "2021-01-20T13:15:14.977000+00:00",
        "attachments": null
    },
    {
        "author": "mratsim",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'll just use my own written from scratch backend for now to understand more.\nIf we choose to go ahead with it, I'll implement Kate on top of BLST (and maybe Milagro/Miracl).",
        "created_at": "2021-01-20T13:16:47.614000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Cross-layer",
        "parent": "",
        "content": "And Go-kate implements both the legacy and new data-recovery approach. The one where it uses the zero-polynomial multiplication tree is the better newer one, original by Dankrad.",
        "created_at": "2021-01-20T13:17:00.529000+00:00",
        "attachments": null
    },
    {
        "author": "mratsim",
        "category": "Cross-layer",
        "parent": "",
        "content": "AFAIK my written from scratch backend is slightly faster than BLST in all cases but slower than Herumi's.",
        "created_at": "2021-01-20T13:17:50.592000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also supporting Geth-uint256 and native Go bignums. Using light wrappers around everything really helps, I suggest you do the same if you want to compare different options",
        "created_at": "2021-01-20T13:17:54.550000+00:00",
        "attachments": null
    },
    {
        "author": "mratsim",
        "category": "Cross-layer",
        "parent": "",
        "content": "MCL is faster than BLST for curve operations but slower for pairings though I didn't test the recent changes he introduced in December.",
        "created_at": "2021-01-20T13:18:31.149000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Cross-layer",
        "parent": "",
        "content": "Good luck, let me know if you get stuck somewhere, some of it is just very new and can be confusing",
        "created_at": "2021-01-20T13:19:53.520000+00:00",
        "attachments": null
    },
    {
        "author": "mratsim",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks. Implementing crypto is a perpetual state of confusion anyway :p",
        "created_at": "2021-01-20T13:27:25.219000+00:00",
        "attachments": null
    }
]