[
    {
        "author": ".vbuterin",
        "category": "Cross-layer",
        "parent": "",
        "content": "The protocol is the same as it always is: each participant takes the previous set of points `(X[1] ... X[n], X2)`, sets `Y[i] = X[i] * s**i` and `Y2 = X2 * s`, and publishes that along with `G2 * s` as a proof. Verify by taking a random linear combination of `Y[2....n]` and that same combination of `X[1...n-1]` and pairing-checking that the two are a factor of `s` apart (without knowing `s`, you use a pairing with `G2 * s`)",
        "created_at": "2021-05-31T10:53:08.463000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "understood,  and I want to claim  that `1 of the N` security is as strong as the `entropy` of the `s` the participant chooses, (lets say N-1, colluded and they launched a brute force attach on the last, and if the participant's entropy is not good enough, easy to reconstruct the final `s`). so the final security of the model is the entropy  added by honest participants (with the max limit of `32 bytes`), also limited by `1 by N`, whatever is lower (security)",
        "created_at": "2021-05-31T16:00:25.292000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "what i really want to imply is that, it should put a lower bound on `N` the number of expected honest participants, to lets say get `32` bytes entropy given at any given time each `s`  will only add limited entropy",
        "created_at": "2021-05-31T16:03:35.166000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "or mix in a high entropy `beacon` with very low co-entropy with the participants.",
        "created_at": "2021-05-31T16:04:15.038000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "so thats why wanted to know the exact protocol, along with the reason that wanted to see if i could contribute to as one of the implementations for the setup",
        "created_at": "2021-05-31T16:05:55.706000+00:00",
        "attachments": null
    },
    {
        "author": "peter.davies",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think you need some perspective on what we are actually doing here. We are asking participants to generate a private ECDSA key `s`, publish the public keys of `[s, s^2, s^3, ..., s^n]`, and then discard the private key `s`. We then perform BLS signature aggregation to create an aggregated public key (the aggregation is actually considerably more complicated but conceptually the same).\nWe have a mathematical proof that this is secure relying that:\na) Elliptic Curve Cryptography is not busted. (Technically the security assumption is slightly weaker than the one needed for ECDSA, but we can be confident that all ECC will rapidly ditched by everyone if it is broken).\nb) At least one of the participants is honest (i.e generates a truly random private key `s` randomly and then discards it).",
        "created_at": "2021-05-31T19:16:10.224000+00:00",
        "attachments": null
    },
    {
        "author": "peter.davies",
        "category": "Cross-layer",
        "parent": "",
        "content": "Your objection seems to be that you believe that honest people are incapable of generating random cryptographic keys, in which case mass large scale hacking of Ethereum wallets is possible and all of cryptography is broken.",
        "created_at": "2021-05-31T19:18:50.704000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Cross-layer",
        "parent": "",
        "content": "Right, generating 32 bytes of entropy is pretty trivial, and you only need 1 of N participants to keep their `s` secret for the above scheme to work",
        "created_at": "2021-05-31T19:19:19.110000+00:00",
        "attachments": null
    },
    {
        "author": "peter.davies",
        "category": "Cross-layer",
        "parent": "",
        "content": "Of course the fun part of this is if you distrust everyone else in entire world, you can participate in the protocol and the resulting secret is just as secure as your own private keys.",
        "created_at": "2021-05-31T19:23:38.176000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "I understand this fine but thanks for explaining anyway. I actually don't have any objection, and neither do I believe that \"honest people are *incapable* ...\" And if possible wil surely love to participate in the setup protocol.",
        "created_at": "2021-05-31T20:44:30.545000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "True entropy claim doesn't mean much since `32` bytes entropy is handy but if the number was non trivial, entropy claim would be relevant.",
        "created_at": "2021-05-31T20:46:37.341000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "But yes it doesn't translate into anything for `32` bytes",
        "created_at": "2021-05-31T20:47:40.552000+00:00",
        "attachments": null
    }
]