[
    {
        "author": "jsign",
        "category": "Cross-layer",
        "parent": "",
        "content": "(warn: i'm not an expert, so i might be corrected)\nI think his point is that you should use that proof of equivalence trick to avoid doing inefficient calculations.\n\nYou have the `KZG_Commitment` and your `SNARKFriendly_Commitment`:\nYou need to prove that both commitments commit to the same polynomial first. You do that by generating that random point `hash(KZG_Commitment, SNARKFriendly_Commitment)`, and then showing that both commitments opening result in the same value. To do that, you do the KZG opening in the SC using a new precompile that will be available (so, no SNARK magic here). And, you do the same opening for `SNARKFriendly_Commitment` in your proof.\n\nSo.. after that you can claim that both `KZG_Commitment` and `SNARKFriendly_Commitment` are for the same polynomial. Now you can simply use your `SNARKFriendly_Commitment` in your SNARK proof to do whatever you want (no need to use KZG).\nSince both are equivalent, then anything you prove to be true in the SNARK related to the polynomial is true for the KZG polynomial (because you proved they're the same polynomial).\n\nThis way you never had to do KZG verifications in SNARKs.",
        "created_at": "2022-12-11T16:46:24.006000+00:00",
        "attachments": null
    },
    {
        "author": "nibnalin",
        "category": "Cross-layer",
        "parent": "",
        "content": "ah i see, sounds like generating the `SNARKfriendly_commitment` would be O(degree) extra work (either hashes or group operations, both rather expensive ops) for the prover — i was hoping he had a more efficient idea",
        "created_at": "2022-12-11T16:54:26.750000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Cross-layer",
        "parent": "",
        "content": "The way I think about is that if you're someone using SNARKs for your application (e.g: zkEVMs), you have the freedom to use whatever polynomial commitment scheme and curves you want. So I see the `SNARKFriendly_Commitment` not really as a cost, but actually as freedom to make your own choices. This idea of proving equivalance simply decouples what was decided at the CL for blobs commitments, with what you want to use in your SNARK.",
        "created_at": "2022-12-11T17:05:14.151000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Cross-layer",
        "parent": "",
        "content": "So I guess is maybe a tradeoff of making an extra proof of equivalence check (which yes, has a cost), but in return you can do your SNARK in other schemes or PCs you want.",
        "created_at": "2022-12-11T17:06:49.569000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also, if in the future KZG is changed to another PC, probably you can use the same idea without breaking your snark (that much?).",
        "created_at": "2022-12-11T17:08:28.479000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@329886426676199448\u003e , https://notes.ethereum.org/@vbuterin/proto_danksharding_faq#How-exactly-do-ZK-rollups-work-with-the-KZG-commitment-efficiently",
        "created_at": "2022-12-11T17:10:17.696000+00:00",
        "attachments": null
    },
    {
        "author": "nibnalin",
        "category": "Cross-layer",
        "parent": "",
        "content": "gotcha, this is very helpful, thanks!",
        "created_at": "2022-12-11T17:14:42.392000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "Note that KZGCommitments do not require a pairing to be implemented in the snark for you to verify the opening, you would only need to verify the contents of the pairings are correct and then kick the actual pairings operation outside of the snark to the kzg verifier",
        "created_at": "2022-12-11T22:39:39.677000+00:00",
        "attachments": null
    }
]