[
    {
        "author": "mratsim",
        "category": "Cross-layer",
        "parent": "",
        "content": "THe issue with this is that we need precise offsets for parallel loading and this can only be done after parsing the schemas.",
        "created_at": "2023-08-15T09:36:26.676000+00:00",
        "attachments": null
    },
    {
        "author": "mratsim",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e A carry-on point from the previous one, most elliptic curves have a \"standard\" serialization strategy, do we have reason to not use it?\n\nThey don't, only BLS12-381 as a standard serialization strategy, BN254 for example does not.\n\n\u003e Montgomery representation\n\nThe advantage here is being able to memory-map the trusted setup file and so using zero memory even with a large file.",
        "created_at": "2023-08-15T09:38:44.280000+00:00",
        "attachments": null
    },
    {
        "author": "mratsim",
        "category": "Cross-layer",
        "parent": "",
        "content": "very nice points, thanks",
        "created_at": "2023-08-15T09:38:57.961000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e BN254 for example does not.\n\nThats not been my experience -- all bn254 libraries that I've interacted with use the same serialization strategy with respects to the curve model\n\n\u003e even with a large file.\n\nThe files are not that large for us though right? Not refuting the benefits, just questioning if we need to break the abstraction here due to performance not being good",
        "created_at": "2023-08-15T16:38:10.107000+00:00",
        "attachments": null
    },
    {
        "author": "mratsim",
        "category": "Cross-layer",
        "parent": "",
        "content": "Do you have a spec of BN254 serialization? I'm curious in particular of their compressed encoding and specifying the sign of the y coordinate.",
        "created_at": "2023-08-15T17:38:11.726000+00:00",
        "attachments": null
    },
    {
        "author": "mratsim",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes in Ethereum KZG specific case, files are small.\n\nBut there are needs for much larger trusted setups (zkEVMs).",
        "created_at": "2023-08-15T17:39:35.027000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "It was definitely omitted from the paper \u003chttps://eprint.iacr.org/2010/354.pdf\u003e Either the proof of concept defined it or perhaps Zcash defined the \"standard\", I have not looked into the history tbh. Though I'd be surprised to find that most implementations of bn254 do not agree on a serialization format, even if its not explicitly written down somewhere",
        "created_at": "2023-08-15T17:52:29.577000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e But there are needs for much larger trusted setups (zkEVMs).\nMy understanding is that ZkEVMs are ran on quite beefy machines so perhaps this is not a concern for them? \n\nI can see the want for a canonical trusted setup format instead of everyone using an ad-hoc version, I'm just a stickler for breaking abstractions especially in the name of performance 😅",
        "created_at": "2023-08-15T18:00:20.304000+00:00",
        "attachments": null
    },
    {
        "author": "mratsim",
        "category": "Cross-layer",
        "parent": "",
        "content": "AFAIK, they don't need to interop.\n\nThe one used in the EVM only need to parse big-endian EVM inputs.\n\nBut I'm not aware of any over the wire interop, though I didn't check blockchains besides Zcash and Ethereum. Maybe something is available in Cosmos or Polkadot.",
        "created_at": "2023-08-15T18:03:51.700000+00:00",
        "attachments": null
    },
    {
        "author": "mratsim",
        "category": "Cross-layer",
        "parent": "",
        "content": "I agree on the careful breaking abstraction, but Montgomery representation, with little-endian 64-bit limbs is what everyone does internally so ¯\\_(ツ)_/¯.\n\nAnd for the big-endian folks (MIPS is still alive? s390x?) they need conversion anyway.",
        "created_at": "2023-08-15T18:07:44.616000+00:00",
        "attachments": null
    }
]