[
    {
        "author": "mratsim",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think it would be helpful to have a paragraph or a blog post that disambiguate:\n- `verify_kzg_proof_batch`: https://github.com/ethereum/consensus-specs/blob/v1.3.0/specs/deneb/polynomial-commitments.md?plain=1#L394\n- `verify_kzg_multiproof`: https://github.com/ethereum/consensus-specs/blob/v1.3.0/specs/_features/sharding/polynomial-commitments.md?plain=1#L365\n\nI assume the first one is related to Batch Opening in KZG10 paper https://www.iacr.org/archive/asiacrypt2010/6477178/6477178.pdf\nbut somehow Plonk https://eprint.iacr.org/2019/953.pdf mentions an efficient batch opening without refering to the one in the KZG10 paper so there are 2 different batch openings?\n\nThe last one is explained in https://dankradfeist.de/ethereum/2021/06/18/pcs-multiproofs.html\nbut it only mentions Verkle Trees for combining intermediate proofs.\nAFAIK we aren't in a verkle tree scenario in the sharding spec (or maybe we are?)",
        "created_at": "2023-05-07T20:16:58.017000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "image.png",
                "content": "851e8658e35b2b6b449c9325bc65afdb96598b5ed03ecd82179fa5135e8f9fa8"
            },
            {
                "type": "image/png",
                "origin_name": "image.png",
                "content": "f5e5511ea08ea7508b1ef9708375b3b27e0d3db5bd08e7070d7fa0f046c174d4"
            }
        ]
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think the sharding documentation has not received as much scrutiny as the 4844 docs, so things there will probably change a lot.\n\nSo there is batch verification and batch opening, I usually refer to batch opening as aggregation, but it differs from person to person. I will just call it batch opening.\n\nBatch verification will take N KZG proofs and instead of verifying each proof N times which will cost N pairings. It takes a random linear combination of all of the proofs and verified the combined proof using “1” pairing.\n\nBatch opening has quite a few variations depending on what you are doing. In the plonk paper, we are batching polynomials which have been evaluated at the same point. This is why the denominator is still a linear polynomial. \n\nThe KZG paper seems to be using the same batch opening strategy as halo2 where you are batching over different openings, so the denominator’s degree increases the more evaluation points you want to batch. In particular, it is \\prod{x-i} where i is an evaluation point",
        "created_at": "2023-05-07T21:47:12.771000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "Plonk also uses batch verification also because there are two opening proofs (for standard plonk)\n\nVerkle tries use a slightly different batch opening algorithm though",
        "created_at": "2023-05-07T21:48:33.425000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Cross-layer",
        "parent": "",
        "content": "(I haven’t read the sharding docs in detail btw, to answer any questions about it with 100% confidence)",
        "created_at": "2023-05-07T21:49:35.337000+00:00",
        "attachments": null
    }
]