[
    {
        "author": "nishant0",
        "category": "Cross-layer",
        "parent": "",
        "content": "For both the go-kzg and c-kzg libraries is there any plan to allow different sizes of blobs in them ? The reason I am asking is because blob sizes are hardcoded to the values in the mainnet config( 131072 ), however the minimal config has it at 128 bytes. Due to this reason testing 4844 with the minimal config would be impossible, so I was wondering if there is a way around this in either go/c kzg.",
        "created_at": "2023-09-11T16:06:14.949000+00:00",
        "attachments": null
    },
    {
        "author": "pawandhananjay",
        "category": "Cross-layer",
        "parent": "",
        "content": "in ckzg, you can set the FIELD_ELEMENTS_PER_BLOB value in the Makefile. So setting it to 4 would indirectly set the BYTES_PER_BLOB to be 128. There seem to be go options for setting it https://github.com/ethereum/c-kzg-4844/tree/main/bindings/go#minimal",
        "created_at": "2023-09-11T18:30:45.279000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ty, using ckzg with the flag will make building for minimal testing messy but i can give it a try. Would like something similar with go-kzg as that is what we appear to be using primarily",
        "created_at": "2023-09-11T20:55:12.101000+00:00",
        "attachments": null
    },
    {
        "author": "pawandhananjay",
        "category": "Cross-layer",
        "parent": "",
        "content": "we had the same issue. To get around it, we are importing 2 separate libraries in lighthouse, one with mainnet params and one with minimal params. It's messy but kinda works. \nThere's some talk about changing ckzg to work with runtime values for FIELD_ELEMENTS_PER_BLOB https://github.com/ethereum/c-kzg-4844/pull/352",
        "created_at": "2023-09-11T21:18:33.134000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ty, i hope we have that in soon. Some runtime toggle would make testing much easier",
        "created_at": "2023-09-11T21:23:53.020000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I've raised this issue a long ago on the TG channel (cc \u003c@592004585506340885\u003e ). Most of our testing is on minimal configs on e2e. It'd be nice to have this on go-kzg as well, any hope of this?",
        "created_at": "2023-09-11T22:35:21.346000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah I'm pushing to get that runtime toggle PR merged. It will allow both presets to be used without any extra build flags. The blob size will be determined by the trusted setup. If this is something that you'd want, I suggest making a comment on that PR.",
        "created_at": "2023-09-11T23:52:09.828000+00:00",
        "attachments": null
    }
]