[
    {
        "author": "chaserxy",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "thanks for the heads up! unfortunately that's no good for this use case. the project itself is a decentralized network, so the dev team running Ethereum full node servers and all other nodes relying on those defeats the purpose. looking forward to portal clients though!",
        "created_at": "2021-04-25T17:13:53.872000+00:00",
        "attachments": []
    },
    {
        "author": "chaserxy",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!202397237962211328\u003e I may be mis-assessing the usability of LES above, correct me if that's the case.",
        "created_at": "2021-04-25T17:15:24.507000+00:00",
        "attachments": []
    },
    {
        "author": "zsfelfoldi",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "there are ongoing efforts to improve the situation 🙂 I'd say it's often pretty good, some other times it's indeed hard to find servers. There is already an API in place that allows you to run your own light server full node and prioritize your own clients there. If you do that then you can have many totally reliable light nodes while running a single full node. If you don't want to run your own full node then you clients will depend on the public service supply that currently consists of some altruistic nodes giving away free service. An in-protocol incentive system is coming soon and will hopefully improve the server availability. Improved topologies (somewhat similar to Piper's gossip network plans) are also planned and are related to the incentivization efforts.",
        "created_at": "2021-04-25T22:08:19.082000+00:00",
        "attachments": []
    },
    {
        "author": "zsfelfoldi",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Functionality-wise geth-light can provide more or less the same API as full nodes, as long as there are working server connections.",
        "created_at": "2021-04-25T22:10:27.020000+00:00",
        "attachments": []
    }
]