[
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Some problem areas that need to be explored:\n\n1. How can we do transaction gossip without local state (probably with proofs for account nonce and balance)\n2. How can we distribute updated trie data (this is the data ingress problem)\n3. How can we distribute proofs for garbage collectable trie data (exclusion proofs?)\n4. What does gossip look like if we do it over a DHT vs LibP2P\n\nFor transaction gossip: If we do gossip over LibP2P is there a network topology that is in some way optimal so that transactions cluster around the statefull nodes at the center and flow in from the edges where nodes are less stateful...  Ideally the lightest nodes on the network shouldn't be required to store and process the full pool of transactions because they probably can't... is there a way for us to signal this with something like a radius metric so that nodes could tighten their radius.... causing them to receive fewer transactions... but also pushing them further out to the edge of the network where their transactions might take longer to reach the miners at the center....",
        "created_at": "2021-02-04T16:44:23.828000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "RE: tx gossip. What if instead of gossiping txs through the network a node that has some txs it wants mined somehow signals that it has txs available, and the miners would then reach out and grab the txs in response to the signal?  Speaking in very hand-wavy terms since I'm not that familiar with the concepts, but what if each \"batch\" of txs I want mined was content addressable and something like IPFS pubsub was used to distribute those batch addresses; miners would subscribe to the stream of available tx content addresses then request the actual batch content when they need more txs.  In this case a batch could be a single tx or multiple txs (e.g. a relayer with good connectivity might somehow have an incentive to take multiple single txs and repackage them as a larger batch for the miners to consume).",
        "created_at": "2021-02-04T23:56:30.165000+00:00",
        "attachments": null
    }
]