[
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!755590043632140352\u003e Heads up, I'm updating our Teku nodes.  Includes a bunch more optimisations but mostly for block import, not creation so not sure it will help reduce delays on producing the first block, though it may reduce delays in validating and rebroadcasting gossip which could help.",
        "created_at": "2020-12-13T21:47:04.251000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "It's version `v20.12.0+27-gdf6e433`",
        "created_at": "2020-12-13T21:50:06.779000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Thanks \u003c@340345049063882753\u003e  for keeping me posted. My mind is elsewhere these days, but I'm grabbing everything. The graffiti is very useful, perhaps in a few days I can give you numbers (if any) that differentiate your different commits. I have enough points for two different commits already",
        "created_at": "2020-12-13T21:59:32.360000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "No pressure to do anything if you've got other stuff going on. I can get a lot of stats on how our nodes are going - particularly with attestation performance and will try and find a good way to capture block timings via metrics as well.",
        "created_at": "2020-12-13T22:04:02.867000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Unfortunately most of the histogram type data that comes through prometheus has a pretty low level of accuracy so its not easy to get good data out of it without burning a lot of disk space.",
        "created_at": "2020-12-13T22:04:51.783000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yeah Prometheus is not the right thing to use, perhaps Influxdb is better in that you can push info to it with the right timestamp. I'm just using a straightforward approach which is grab the stream of blocks and use the timestamp of the log. I can patch the node to log before the block is synced, but \u003c@!476250636548308992\u003e benchmarked it at just a few miliseconds difference so it's not worth it.",
        "created_at": "2020-12-13T22:11:54.350000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "We have HdrHistogram internally already and export bits of that data to Prometheus to give a basic view but I'm very tempted to add an API endpoint to just get the raw histogram data. Then its perfectly accurate and HdrHistogram is reasonably popular so a bunch of tools can work with its data well.",
        "created_at": "2020-12-13T22:13:40.702000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "In any case in my last benchmark Teku outperforms every client by orders of magnitude on block delay. Slot zero is still a problem and I've been told you teams are discussing about this but the very little I've seen seems to be focused on caching and precomputing while it's not clear to me that p2p issues have been ruled out. What I mean to say is that it's not clear to me is this is something that you can solve on your own client by yourself",
        "created_at": "2020-12-13T22:58:11.680000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yeah the numbers are surprising to me and I can't entirely explain it.  The latest changes should help propagation of blocks so will be interesting to see if there's any benefit from that, but as you say I'm not sure if Teku nodes themselves are going to be enough to make a difference.",
        "created_at": "2020-12-13T23:08:22.466000+00:00",
        "attachments": []
    }
]