[
    {
        "author": "wemeetagain",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The `/eth/v1/events` endpoint has a bunch of topics to subscribe to: head, block, attestation, voluntary_exit, finalized_checkpoint, chain_reorg\n\nIs there any use to adding clock events? eg: clock_slot or clock_epoch? These can be ofc calculated, but having an event may be nice",
        "created_at": "2020-09-30T20:06:53.986000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "What would be the benefit of this over local clock events? Seems that this would introduce latency and couple the validator client clock to the beacon node clock for no benefit.",
        "created_at": "2020-09-30T20:18:41.220000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "clock disparity _might_ be useful to identify but you could get this from the assignments that were being sent your way compared to local clock (assuming BN and VC are in a config where clock can be different)",
        "created_at": "2020-09-30T20:32:09.892000+00:00",
        "attachments": []
    },
    {
        "author": "wemeetagain",
        "category": "Consensus Layer",
        "parent": "",
        "content": "right, if validator clock is ahead of beacon node, and it gets to an epoch before the beacon node, it will not be able to get that epoch's duties",
        "created_at": "2020-09-30T20:40:32.067000+00:00",
        "attachments": []
    },
    {
        "author": "wemeetagain",
        "category": "Consensus Layer",
        "parent": "",
        "content": "its also just creates some flexibility for downstream consumers",
        "created_at": "2020-09-30T20:41:15.206000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The `head` event has an `epoch_transition` flag in it, to flag when an epoch transition occurs (and hence when it is safe to pull the duties).\n\nIf the beacon node sent a \"start of epoch\" clock tick then fetching duties immediately would, in general, not provide the correct result because the node may not have completed the epoch transition.",
        "created_at": "2020-09-30T20:43:52.582000+00:00",
        "attachments": []
    },
    {
        "author": "wemeetagain",
        "category": "Consensus Layer",
        "parent": "",
        "content": "for sure, head and reorg events could require refetching the duties",
        "created_at": "2020-09-30T20:44:51.147000+00:00",
        "attachments": []
    },
    {
        "author": "mpetrunic",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e The `head` event has an `epoch_transition` flag in it, to flag when an epoch transition occurs (and hence when it is safe to pull the duties).\n\u003e \n\u003e If the beacon node sent a \"start of epoch\" clock tick then fetching duties immediately would, in general, not provide the correct result because the node may not have completed the epoch transition. \n\u003c@144468805697929216\u003e if first slot of epoch is a skip slot we would miss attestation? 😄",
        "created_at": "2020-09-30T20:45:18.184000+00:00",
        "attachments": []
    },
    {
        "author": "mpetrunic",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Oh it's for one epoch ahead, ignore comment",
        "created_at": "2020-09-30T20:45:55.415000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Well there could be an entire epoch of skips :/",
        "created_at": "2020-09-30T20:46:32.767000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "There is, however, usually a gap between start of epoch and beacon node having procesed the previous epoch.  Perhaps we do need a separate event for the latter, not sure, but not convinced the former gives us much.",
        "created_at": "2020-09-30T20:47:33.646000+00:00",
        "attachments": []
    },
    {
        "author": "wemeetagain",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I guess the underlying thought behind exposing the beacon node's clock is that right now, an API consumer, not necessarily a validator, will need to roll their own clock, and thus have to deal with clock disparity, if they want to query the beacon node based on time. Exposing the clock thru the API gives consumers additional options that can simplify things.\nIt's the difference between \"when I get to the next epoch, request X state\" and \"when the node gets to the next epoch, request X state\".",
        "created_at": "2020-09-30T21:06:44.311000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "You'd have to define \"gets to the next epoch\" more closely.  If you mean \"has updated its state from the previous epoch\", then I agree (and that's where the epoch transition for the head event came in).  If it's just \"beacon node clock has hit x\" then I don't see the value, because of the time lag in carrying out the end of epoch processing.",
        "created_at": "2020-09-30T21:14:59.539000+00:00",
        "attachments": []
    },
    {
        "author": "wemeetagain",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Definitely agree that checkpoint events are valuable too. I'm more arguing that the clock is a unique piece of the beacon node's state, a \"raw material\" that could/should be available for API consumers.",
        "created_at": "2020-09-30T21:43:40.313000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I just don't see what a validator client would _do_ when given the information that \"the\" beacon node thinks it is the start of a new slot, as opposed to when a block or epoch had been processed.",
        "created_at": "2020-09-30T21:45:28.400000+00:00",
        "attachments": []
    },
    {
        "author": "wemeetagain",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I wasn't thinking about the API as _just_ for the validator, but more like a standardized way of exposing useful or unique views of the beacon node's internal state.",
        "created_at": "2020-09-30T21:49:46.119000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I can't think of much else that is clock-sensitive, though.",
        "created_at": "2020-09-30T21:51:17.569000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "My main concern is that I wouldn't want the event to be used as some form of side-channel for process-level clock synchronization, because it's not a sane way to do so (compared to just running ntp on the servers, for example).   Secondary concern is that I don't want to overload implementors with adding more events than necessary.  If there is a use case for doing something when the beacon node thinks that a new slot is starting then fair enough, but I can't think of one.",
        "created_at": "2020-09-30T21:54:51.034000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Teku’s current validator uses “timing” events from the beacon node to trigger various functions. That includes a slot event which indicates the beacon node is now able to answer requests up to that slot (eg create a block for that slot or calculate attestation duties up to one epoch ahead of that slot), attestation due events (one third of the way through the slot and guaranteed to have finished updating fork choice) and aggregate due (this one is purely time based so could easily be dropped). \n\nIt’s possible to rejuvenate things so these aren’t needed but the events have certainly made life a lot easier.",
        "created_at": "2020-09-30T22:38:58.852000+00:00",
        "attachments": []
    }
]