[
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "also, regarding eventStream, it would be helpful to have a 'bye' message, like `event: 'bye', id: -1` to direct the clients to hang up when the server is shutting down... otherwise they will keep trying to reconnect, which might be ok sometimes, but might be messy? I've ended up putting it in to test with so my script can know to hangup...",
        "created_at": "2020-09-24T03:18:24.054000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "After some consideration, I think that any limit is going to cause users a problem somewhere down the line.  And if we end up with different limits for different clients, it would be even more confusing for them.  As such, I think that we should move the attester duties request to be a `POST`.  \u003c@!545555441518772225\u003e I don't think you weren't a fan of this back when we were discussing it, what do you think?",
        "created_at": "2020-09-24T06:11:48.560000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Regarding a`bye` message on the event stream: I'm a little more wary of that one.  Say, for example, a user was upgrading their beacon node.  If they did so in an orderly fashion then the validator client would receive this `bye` message and not reconnect, even though the upgraded beacon node would be back up and running a few seconds later.  I don't think this should be expected behaviour.\n\nI think that it makes sense for the decision to try to talk to a beacon node or not to be that of the validator client, which would make a `bye` message extraneous.",
        "created_at": "2020-09-24T06:14:56.129000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "just that theres a redirect but no hangup in the protocol that i could find, and 'some' pages suggested a bye message, ultimately you'd only being DOS'ing yourself i guess if you take advantage of that by registering a stack of clients 🙂",
        "created_at": "2020-09-24T06:56:34.507000+00:00",
        "attachments": null
    },
    {
        "author": "mpetrunic",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e After some consideration, I think that any limit is going to cause users a problem somewhere down the line.  And if we end up with different limits for different clients, it would be even more confusing for them.  As such, I think that we should move the attester duties request to be a `POST`.  \u003c@!545555441518772225\u003e I don't think you weren't a fan of this back when we were discussing it, what do you think?\n\u003c@!144468805697929216\u003e I was against it for couple of reasons:\n- we violate REST convention of using POST request to read resources instead of creating\n- we should encourage more beacon nodes or, at least, more validator clients than just enabling users to easily connect 1k validators to single beacon node (if something goes wrong all 1k would stop working)\n- we encourage wrong usage of api, if you would like to known attestation duties of all (or a lot of) validators, it's better to use https://ethereum.github.io/eth2.0-APIs/#/Beacon/getEpochCommittees because of how does endpoints are implemented (we should probably add that note to validator duties endpoints)\n\nIf we wanna support huge amount of validators for running test cases, it probably makes more sense to enable GET body with some flag. Thats just my 2c 🙂",
        "created_at": "2020-09-24T07:44:43.488000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I agree with the first point, but don't see a sensible alternative given the use case.  There's convention, then there is usability.  I don't like the idea of us sacrificing usability because of the convention.\n\nThe second is definitely _not_ something I agree with; it's not our job to decide arbitrary limits in an attempt to enforce some sort of nebulous best practice based on a single view of how the BN\u003c-\u003eVC interaction may occur.\n\nThe third point I'm ambivalent on.  Any API can be misused, but at current we're failing to allow it to be used for its expected purpose.  A note in the docs to say \"if you want all duties use this other endpoint instead\" seems enough to cover this concern.\n\nEnabling a body for `GET` feels worse than changing the method to `POST`, to me.  At least with `POST` we know that we are fixing the underlying problem of not being able to obtain the data.  With a `GET` body the HTTP spec used to say that bodies should be ignored entirely (and is not a bit more ambiguous) but I worry we'd end up with the same problem as we have now, worrying that something out there will obey the spec in an aggressive fashion and drop the body.\n\nUltimately I want something that will work for the primary use case of talking from the valdiator client to the beacon node, even if there are proxies and other stuff in the way.  A `POST` request will manage this: not perfectly in terms of secondary features (caching _etc._) but it does the job.  `GET` doesn't manage that, which is why I think we should change the endpoint.",
        "created_at": "2020-09-24T08:07:38.776000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "It's a very common use case to switch to using a post when you need to supply too much data for a url, so i'm not sure we strictly 'violate' any conventions... I think it'd be more 'weird' to pass a body in a get request... that would be super odd...\nAre we settled on using a `POST`? I'll scrap my PR if we are...",
        "created_at": "2020-09-24T20:26:25.904000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "could just keep the body super simple, `{\"index\": [\"1\",\"2\"]}`",
        "created_at": "2020-09-24T20:30:51.107000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I'll be away next week, so i've raised an issue on the api to track anyway, https://github.com/ethereum/eth2.0-APIs/issues/92 \u003c@!144468805697929216\u003e",
        "created_at": "2020-09-24T20:46:09.024000+00:00",
        "attachments": null
    }
]