[
    {
        "author": "paulhauner",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Several weeks ago I did some work on \"validator status\" before I had read prior works by \u003c@!203220829473996800\u003e and \u003c@!144468805697929216\u003e. Back then I produced a definition, some diagrams and an implementation. Since then, I've read Jim's article (https://www.attestant.io/posts/understanding-the-validator-lifecycle/) and Proto's doc linked in the API spec (https://hackmd.io/ofFJ5gOmQpu1jjHilHbdQQ)) and updated all those resources I made originally with lessons learned from those good sirs.\n\nI've collected these resources into a \"proposal\" to change the eth2.0-API `status` field on `beacon/states/{state_id}/validators`:\n\nValidator Status Proposal: https://hackmd.io/bQxMDRt1RbS1TLno8K4NPg\n\nIncluded in that link is an implemenation which converts a `Validator` into a \"status\" in \u003e40 lines. It's currently in Rust but I'm happy to convert to Python if there's interest.\n\nI'm making this proposal for the following reasons:\n\n1. I think including more information in the validator status response is going to provide significantly better UX.\n2. Having a reference implemenation will be useful and save time for implementers.\n3. I noticed that the current API definition includes \"exited_slashed\" and \"exited\" which are conflicting (the former is a member of the later group). This gives me the feeling that this endpoint is deserving of some attention and perhaps not already widely used.",
        "created_at": "2020-09-07T01:33:37.549000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The only issue I can see is that once funds become withdrawable it's not possible to tell if the validator was slashed or not.  I'd probably add either a `slashed: boolean` to withdrawable and withdrawn states or possibly a more generic `exit_reason: (voluntary | slashed)`",
        "created_at": "2020-09-07T01:47:39.001000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003c@!361447803194441738\u003e Great stuff.  The addition of the transition epoch is a good idea; there are various implementations out there but having this in the spec and returned as part of the API will avoid users coding it incorrectly and resulting in inaccurate information.\n\nThere are a couple of items worth noting in terms of where we went to with \u003c@!203220829473996800\u003e's doc (which is the more up-to-date information and should be looked at in preference to my article):\n  - the states were broken in to \"state_substate\" to try to make it clear the groups in which the states sat.  This in general allowed the substate to be used exclusively as the one-word identifier for the validator (initialized, queud, ongoing, _etc._ (although 'slashed' appears twice; think we were going to rename the first one to 'slashing')).  I'm not sure if this is still possible with the extended definitions, but it's something worth considering when looking at the naming\n  - similarly, we tried to keep the tenses the same in each substate so the 'active' states related to things going on rather than things that had happened\n\nThese may or may not be worth considering.\n\nAs for your doc, a few things:\n  - the 'waiting_for_finality' states seems a bit odd.  Wouldn't there in theory be such a state before _every_ transition?  Or is there something special about eth1 deposits that make this different (I haven't looked at the inclusion of eth1 deposits in detail so I may be missing something here)\n  - it is possible for a validator to leave the 'active' state if its balance falls below 16 Ether.  Here, it is neither slashed nor undergone a voluntary exit.  Perhaps change 'active_awaiting_voluntary_exit' to 'active_exiting'\n  - some of the JSON states are (I think) incorrect.  I added some notes to the doc\n\nAs we all know, naming stuff is hard.  I'm fine with the general flow, but finding suitable names for each state can be tricky.",
        "created_at": "2020-09-07T07:52:15.290000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "On an unrelated note, I was playing around with the API over the weekend and think that we have a bit of a hole.  At current, we use the state root as a primary identifier in a lot of the endpoints, but we have no way of going from a state root to a slot or block root.  I'm wondering if we either change `/v1/beacon/states/{stateId}/root` to be more generic in terms of what it returns (state root, block root, slot) or add some more endpoints.  Any thoughts? \u003c@!545555441518772225\u003e in particular.",
        "created_at": "2020-09-07T07:55:11.466000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "with the `/eth/v1/node/peers` endpoints, teku keeps a lot of its network stuff separate from discovery, and its actually non trivial to get the ENR when in the context of the rest of the network details. For now we're going to go with not providing the ENR in that response object, but the rest we can work with... hopefully this isn't going to cause too many problems for anyone.",
        "created_at": "2020-09-07T21:52:14.517000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "It's probably worth making the enr field explicitly optional anyway - if you connect to a static peer via multiaddr you can't create a valid ENR for that peer because you can't sign it so it's impossible to include one.",
        "created_at": "2020-09-07T22:04:18.892000+00:00",
        "attachments": []
    }
]