[
    {
        "author": "paulhauner",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Here's the PR \u003c@!363800010518822915\u003e  is linking from 🙂 https://github.com/sigp/lighthouse/pull/1468",
        "created_at": "2020-09-09T01:34:28.055000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus Layer",
        "parent": "",
        "content": "On a separate note: I'm planning to reject any call to `validator/duties/proposer/{epoch}` where `epoch` is not the current epoch. It makes it simpler to cache the proposers. We don't have a reliable look-ahead for proposers and I can't see a reason where it's useful for a VC to have the previous epoch duties (unless there is clock disparity, which i think should be addressed first).\n\nThis aludes to a larger decision about making the `validator/` endpoints optimized to the specific use case of validator clients (instead of historic data lookup). \n\nInterested to hear thoughts on these decisions, if any 🙂",
        "created_at": "2020-09-09T01:37:27.069000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e making validator endpoints optimized to specific use case\n\nThis makes  sense to me in general. Other than duty fetching are there additional restrictions you see worth adding?",
        "created_at": "2020-09-09T01:52:02.143000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e Other than duty fetching are there additional restrictions you see worth adding?\nNothing I can think about, apart from restrictions on fetching states for future slots (avoiding lots of slot skipping)",
        "created_at": "2020-09-09T02:00:43.239000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I get the impression from the API docs that clients are somewhat free to reject requests as they see fit",
        "created_at": "2020-09-09T02:01:06.818000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Also, separate topic, I recall someone saying that Infura has some compliance tests for the standard API?",
        "created_at": "2020-09-09T02:50:43.186000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e \n\u003e Also, separate topic, I recall someone saying that Infura has some compliance tests for the standard API?\n\u003e \u003c@!361447803194441738\u003e https://github.com/INFURA/eth2-comply its a starting point, i think the intent is PRs come in to add to the suite of tests etc",
        "created_at": "2020-09-09T03:20:48.865000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "looks like the paths are still /v1",
        "created_at": "2020-09-09T03:22:28.507000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e ...I can't see a reason where it's useful for a VC to have the previous epoch duties...\n\n\u003c@!361447803194441738\u003e For a VC, no, but for historical data collection (explorers, data analysis) it is useful to have this information.\n\nFor example, I have been writing a tool to gather historical info around proposals and attestations to see how well validators are performing (are they proposing when they should?  How often do they provide the correct chain head?).  Not being able to fetch proposals (or data in general) for historical epochs would make this type of analysis much harder.\n\nI agree that anything that the API (and underlying architecture) should be optimised for the requirements of the VC, but I'd be sad if fetching historic data went from \"slow\" to \"no\".",
        "created_at": "2020-09-09T06:08:52.195000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Couldn't we just use a separate namespace for all historical data ? that way clients are free on whether to support them or not",
        "created_at": "2020-09-09T06:11:32.203000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003c@144468805697929216\u003e couldn't you get the duties data from the committees endpoint? just in a different format",
        "created_at": "2020-09-09T06:11:46.948000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I'm not saying the whole API shouldn't do historical, just the stuff that's already purpose-built for the VC (the `/validator` endpoints)",
        "created_at": "2020-09-09T06:13:14.290000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Oh you can't get proposers from any other endpoint actually.",
        "created_at": "2020-09-09T06:14:01.275000+00:00",
        "attachments": null
    },
    {
        "author": "mpetrunic",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e I get the impression from the API docs that clients are somewhat free to reject requests as they see fit\n\u003c@!361447803194441738\u003e Idea was to specify agreed rejections and invalid requests. I didn't wanna add those since I don't know everyones limitation on data avability or implementation complexity.",
        "created_at": "2020-09-09T06:14:18.996000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e \u003c@!361447803194441738\u003e Idea was to specify agreed rejections and invalid requests. I didn't wanna add those since I don't know everyones limitation on data avability or implementation complexity.\n\u003c@!545555441518772225\u003e So we should only ever reject with the reasons specified in the OpenAPI doc?",
        "created_at": "2020-09-09T06:16:57.097000+00:00",
        "attachments": null
    },
    {
        "author": "mpetrunic",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I was trying to say, if you encouter something that is difficult to implement or something, let's add that rejection in spec so spec ends up being minimal stuff that everyone has",
        "created_at": "2020-09-09T06:18:36.467000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003c@144468805697929216\u003e if there are things (like proposer indices) that aren't going to be provided anywhere else in the app I guess we can just have a fork in our logic: fast path for current epoch, slow path for anything else",
        "created_at": "2020-09-09T06:25:50.341000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003c@!361447803194441738\u003e Yeah, although I agree with \u003c@!476250636548308992\u003e's idea, I think that a better implementation would be to have the same external facing API and branches in the code depending on where the data is held internally.\n\nThat, and the 'data not available' return code or whatever, also seems to fit nicely when nodes have different data retention policies (where it may just be computationally infeasible to bother fetching specific historical data given the dataset available).",
        "created_at": "2020-09-09T06:35:11.420000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "'data not available' is probably an important point.  Teku has a PRUNE mode where we store no finalized states so we can't regenerate anything before the latest finalized checkpoint.",
        "created_at": "2020-09-09T08:19:51.468000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Question on the `validator_balances` endpoint I mentioned yesterday.  I'm writing up the PR for it and am now wondering if including effective balance is a stupid idea.\n\nThe whole point of the separate endpoint is to make fetching the data lightweight for a set of x validators over y epochs, relative to fetching the validator struct.  But if I include effective balance would that force the clients to reconstruct it internally, or is that the sort of data that is kept around anyway?\n\nI'm currently thinking that just returning an array of `(index,balance)` tuples for a given epoch, rather than `(index,balance,effective_balance)` is a smarter thing to do.  If the user really cares about effective balance they can either query the `/validators` endpoint or work it out themselves from the balance.\n\nI'll push the PR out without effective balance, unless anyone can think of a good reason to include it.",
        "created_at": "2020-09-09T08:24:46.644000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003c@!361447803194441738\u003e eth2-comply has been updated with a bunch of the `/eth/v1` endpoints 🙂 tests are just json, so should be extendable if we want to add things",
        "created_at": "2020-09-09T22:46:33.424000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "when fetching duties, teku currently has scenarios where it can return 410 (gone), 404(not found) when an epoch is not available... The standard api doesn't have an equivalent other than returning a generic 400 with a descriptive message, is that the intent?",
        "created_at": "2020-09-09T23:36:26.896000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "one common scenario is when we're not storing finalized data to disk we can't recover finalized states, so we were returning gone...",
        "created_at": "2020-09-09T23:37:26.019000+00:00",
        "attachments": null
    }
]