[
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "https://github.com/ethereum/eth2.0-APIs/pull/96 is still hanging around and causing some trouble.  I've been investigating \u003c@!361447803194441738\u003e 's alternative https://github.com/ethereum/eth2.0-APIs/issues/116 and found it to work pretty well (it invalidates a little more often than it should in my current implementation but that just needs some better handling of a corner case when requests for duties are in-flight when a new head update is received).\n\nUnfortunately, the alternative probably needs to be a backwards incompatible change to the APIs to get attester and proposer duties. It needs to add an extra field which would cause `data` to become an object instead of an array with the array of duties then being a property inside that object.\n\nI'm really keen to get these standard APIs stabilised and stop breaking things but one of these two changes is needed to ensure that validators can accurately calculate duties without repeatedly polling.\n\nI'm in favour of Paul's alternative as its a much simpler solution all round.  Options I see to apply it are:\n1. Just make the breaking change now.  Moving `data` to an object instead of array gives us much better flexibility in the future anyway.\n2. Introduce a `v2` version of the get duties APIs which include the target root\n3. Put the additional target root field in as a property of each duty (ie redundant repetition).  Validator clients will need special handling for the case where there are no duties returned which is a bit awkward.\n\nWhether head and chain_reorg and combined into a single state event is then a separate question, but it wouldn't need the extra requirement around being published to indicate an empty slot which is challenging for clients to implement.",
        "created_at": "2020-11-16T22:32:50.819000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Any thoughts? I don't want to overly rush, but we're pushing all our users to the standard API now so would be nice if they had a stable landing place.",
        "created_at": "2020-11-16T22:33:43.090000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I'm more than happy to go with Paul's solution, regarding the ability to detect duty changes.  Regarding the options you've given, 1) is going to be the best one for us to do, even if it gives (very) short-term pain.",
        "created_at": "2020-11-16T22:35:53.410000+00:00",
        "attachments": []
    }
]