[
    {
        "author": "Deleted User",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Hi :)\nI have a couple of questions regarding the API:\n- currently the VC could get the validator duties for proposals and attestations once per epoch because there are such REST endpoints: `/v1/validator/duties/proposer/{epoch}` and `/v1/validator/duties/attester/{epoch}`. However because of fork choice changes the shuffling could change at any point (correct?) - how should clients handle that in the pull model - by continuously polling for this information on every slot?\n- how will the API be tested - any plans? One option I can think of is to make identical queries to different implementations of beacon nodes at the same time in a stable testnet which finalizes and there are no forks - that wouldn't necessarily mean that the results are correct but at least that clients behave similarly, which means there is high probability (but no guarantee) of them being correct as well..?\n- will notes from hackmd (such as https://hackmd.io/ofFJ5gOmQpu1jjHilHbdQQ ) end up in the API spec repo? IMHO they should if the repo should be considered complete",
        "created_at": "2020-06-22T15:40:02.485000+00:00",
        "attachments": null
    },
    {
        "author": "raulj",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Hi \u003c@456226577798135808\u003e in the Prysm implementation of eth2, we listen to a server side stream for the duties information",
        "created_at": "2020-06-22T15:40:40.799000+00:00",
        "attachments": null
    },
    {
        "author": "raulj",
        "category": "Consensus Layer",
        "parent": "",
        "content": "the validator never polls",
        "created_at": "2020-06-22T15:40:44.805000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Consensus Layer",
        "parent": "",
        "content": "we plan on supporting that as well, but the polling is part of the spec - lets suppose that a Nimbus VC wants to talk to a BN from a different implementation which doesn't support the streaming/push API - that's the case I'm thinking of right now",
        "created_at": "2020-06-22T15:42:03.648000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "There is an eventstream as part of the API that would let you know of changes like this",
        "created_at": "2020-06-22T15:48:01.056000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Consensus Layer",
        "parent": "",
        "content": "if that is now considered part of the official spec and not just optional (nice to have) - then I wouldn't worry about the polling case indeed 🙂",
        "created_at": "2020-06-22T15:50:03.028000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Still being worked on, but it's pretty clear that it's going to be needed for situations like the one you outline",
        "created_at": "2020-06-22T15:50:26.915000+00:00",
        "attachments": null
    }
]