[
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "`/eth/v1/validator/duties/proposer/{epoch}`  we don't currently have validator index in the response, and it should probably be there.... might potentially have multiple entries in the list for the same pubkey too, not sure if thats going to cause any confusion...",
        "created_at": "2020-09-15T01:28:48.436000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah, standardizing behaviour in the situations where we don't return data would be good.",
        "created_at": "2020-09-15T05:57:40.860000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Regarding proposer duties, I'm ambivalent on sending validator index as well as public key.  It will generally be redundant information for any actual validator, and most validators clients will have some sort of pubkey-\u003eindex table internally, but can be useful for the one-off lookups.",
        "created_at": "2020-09-15T06:01:06.805000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "It seems strange to me that attestation duties are looked up by validator index and include pubkey and index, but proposer duties don't include index at all.  So I'd say include both pubkey and index in the proposer duties for consistency but if we're going to only include one, I'd include the validator index so duties consistently identify validators by index.",
        "created_at": "2020-09-15T06:02:48.055000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "To be fair, they're only looked up by index because indices are shorter and there was concern about the length of the URL.  But yes, the pubkey/index thing is starting to feel like an inconsistency.\n\nI raised https://github.com/ethereum/eth2.0-APIs/pull/86 to add validator index to proposer duties.",
        "created_at": "2020-09-15T06:35:08.868000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah I did prefer always referring to validators by their public key but I can understand the trade off.",
        "created_at": "2020-09-15T06:48:15.071000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Check on the POST for `aggregate_and_proofs`: the name and schema suggest that we're accepting multiple aggregates in the same call, but the descriptive text talks in the singular.  I think we want to go with multiple aggregates in the call; if anyone disagrees please shout today otherwise I'll raise a PR to change the text tomorrow.",
        "created_at": "2020-09-15T09:49:32.628000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "And continuing on this theme: the body for the `aggregate_and_proofs` call looks like:\n\n```\n{\n  \"data\": [\n    {\n      aggregate_and_proof\n    },\n    {\n      aggregate_and_proof\n    },\n    ...\n  ]\n}\n```\n\n_i.e._ there is a \"data\" object that wraps the request body proper.  Although we do this for responses, I don't see a reason to do this for requests.  We don't do this anywhere else, as far as I can see.  So I suggest this changes to:\n\n```\n[\n{\n  aggregate_and_proof\n}.\n{\n  aggregate_and_proof\n}.\n...\n]\n```\n\n_i.e._ a simple array.  Again, please yell if anyone disagrees.",
        "created_at": "2020-09-15T09:55:45.689000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Hello,\n\nI am a Prysm developer implementing voluntary exits in our client. We had some discussion on providing feedback to the user after submitting a voluntary exit. The current spec for the `/eth/v1/beacon/pool/voluntary_exits` endpoint does not return anything other than a `200 OK` status code. Here is the relevant part of our design document, explaining what info we would like to have:\n\n\u003e `lowest_place_in_queue`: the lowest possible place in the exit queue of the validator submitting the voluntary exit\n\u003e `earliest_exit_epoch`: the earliest possible epoch at which the validator will be exited, based on the validator registry and the validator churn at the time of the exit proposal\n\u003e These values will be used to display meaningful feedback to the user. Because they only consider exits that have already been included in a block, disregarding the ones who are pending inclusion, they represent the best case scenario - when the exit is included into a block prior to any other pending or future exits. This is because there is no guarantee when the exit will be included into a block. As a result, the exit might happen at a slightly later time.",
        "created_at": "2020-09-15T12:01:09.893000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I already spoke with \u003c@!144468805697929216\u003e about this on our Discord. Jim had one idea:\n\n\u003e Alternatively, one area that we haven't fleshed out yet is the idea of a more advanced \"reporting\" section, that returns information that is derived from the chain state.  An example of this would be participation rate.  The idea of the reporting endpoints is that it is optional (due to the additional workload required) but can provide more useful information to end users.  It's possible that this information would fit here (it also has the benefit that you can fetch it whenever you want, so you could keep track of the information as it changes, for example when the exit is actually included in a block).\n\nWe were also thinking about adding a link to a block explorer where the user can track their exit as part of the user feedback. The block explorer's developers could certainly use the derived chain state to update exit information on their side. I think it all fits together nicely.",
        "created_at": "2020-09-15T12:01:11.799000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Please let me know what you think about this change/proposal so that we amend our design doc and plan future work. Thanks!",
        "created_at": "2020-09-15T12:02:44.281000+00:00",
        "attachments": null
    }
]