[
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e https://github.com/ethereum/eth2.0-APIs/pull/96\n\u003c@!144468805697929216\u003e that's a lot closer to what we do internally for the events, so I think it's a good change, but I might just let \u003c@!340345049063882753\u003e know the events he's just started consuming are on borrowed time 🙂",
        "created_at": "2020-10-11T18:10:23.073000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I'm finding the 'block' and 'attestation' events a little confusing, in that we have something similar, but only for blocks or attestations that have actually been successfully imported, nothing for events that come via api that may not be imported. \nI'm curious about the intent of having event streams for every block and attestation that arrives, even if they're not validated?",
        "created_at": "2020-10-11T18:14:59.485000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Rationale is for explorers and analytics, that may want to see non-canonical data. Also for allowing this data to flow through even if the local node's state does not allow it to validate the block/attestation at the time it is received.",
        "created_at": "2020-10-11T18:34:40.177000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "hrm ok, I'll have to circle back and figure it out. I avoided just doing imported blocks just in case, so there's no rework at least 🙂",
        "created_at": "2020-10-11T18:35:58.682000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Left some comments on the state PR. Generally like the idea of combining the events.  It will just mean a small simplification of the code we've now got to handle this standard events API.",
        "created_at": "2020-10-11T20:10:07.901000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "One thing to note for notifications of blocks and attestations received, is that you won't be able to query them from any other APIs because they haven't been imported. The attestation event looks like it has useful information, but the block event only has the block root and slot which may not be very useful.  That said, I'm not sure I'd want to publish the full block information via events.",
        "created_at": "2020-10-11T20:12:22.997000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah, sending the entire block would be potentially problematic.  Once the state PR has settled down I'll see if I can write up additional information for each of the other events, to provide information like this (no guarantee the block will be imported, even if it is it won't be imported immediately, _etc_.)\n\nThanks for taking a look at the PR, will keep that bit of the conversation on the PR.",
        "created_at": "2020-10-11T20:18:52.562000+00:00",
        "attachments": null
    }
]