[
    {
        "author": "sproul",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003c@!340345049063882753\u003e Thinking about compatibility moving forward, it sounds like we might headed for incompatibility on Prater \u0026 mainnet (where the fork epoch is not yet set). Would you be open to enabling the v2 APIs unconditionally in future Teku releases? Alternatively, I'm happy to take the pragmatic approach of making Lighthouse switch between v1 and v2 at the fork, but that seems like a bit of a hack, seeing as having the v2 API enabled on the BN seems harmless",
        "created_at": "2021-08-19T00:30:42.654000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "heh. So hard to be clear here. 🙂\n\nSo the beacon node always exposes the v2 APIs regardless of whether Altair is scheduled.  We just need to Infura to update their load balancer rules to expose them basically. There was a delay in that getting done but it should be \"tonight\" (US timezone I think) so hopefully before the fork happens on Pyrmont, and that should enable it for all networks.\nThe Teku validator client will use v2 APIs if Altair is scheduled for that network and v1 otherwise.",
        "created_at": "2021-08-19T00:41:09.798000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Which means that I'd expect Teku and Lighthouse to be compatible with each other already, and we just need the APIs exposed by Infura to fix compatibility with both Teku on Pyrmont and Lighthouse 1.5-rcX builds.",
        "created_at": "2021-08-19T00:42:56.143000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Ah, perfect ☺️",
        "created_at": "2021-08-19T00:43:31.245000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Thanks",
        "created_at": "2021-08-19T00:43:34.049000+00:00",
        "attachments": []
    }
]