[
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Is there any way to obtain the state root after end-of-epoch processing has taken place, but before the first block of the new epoch has been processed?",
        "created_at": "2021-05-27T12:29:15.357000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I have to double check to be sure, but couldn't you just do a `ProcessSlots()` on the state ?",
        "created_at": "2021-05-27T12:33:57.318000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Does processing slots process the end of epoch at the correct time (i.e. as soon as the last block of the epoch has been processed) and make it available somewhere?",
        "created_at": "2021-05-27T12:36:22.067000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "ah no, it would be triggered at slot 0 for the next epoch",
        "created_at": "2021-05-27T12:37:12.405000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "My basic problem is that I'm after the balance of each validator at the beginning of an epoch, and it seems there is no way to obtain it.  This seems to extend to everything else that takes a state ID.\n\nPerhaps a new API call is needed, that will provide the state root for a given epoch but before any blocks have been processed.  Not sure what the internal impact on clients would be, though.",
        "created_at": "2021-05-27T12:51:53.666000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I’m not sure we’d necessarily index the state root if it would ordinarily be skipped over. Teku’s precaching probably makes it available for non finalised epochs but I think it would be dropped for finalised ones as it’s a fork that never happened.",
        "created_at": "2021-05-27T21:03:04.393000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "What I suspect you want is to be able to identify a state by block root and slot. If that was supported as a form of stateId you could then query for the data you want using existing apis",
        "created_at": "2021-05-27T21:04:38.227000+00:00",
        "attachments": []
    }
]