[
    {
        "author": "sproul",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think Lighthouse will have to break backwards-compatibility (and forwards-compatibility) on the `/eth/v1/config/spec` API.\n\nWe will return a union of the supported presets (phase0 and Altair), and the config. The necessity of the breakage in both directions is:\n\n1. If a new VC queries an old BN, then the old BN will be lacking fields. It will lack `PRESET_BASE`, as well as all the Altair related config items like `INACTIVITY_SCORE_BIAS`, which are not separated from the phase0 keys in the config (and would be annoying to _not_ support).\n2. If an old (Lighthouse) VC queries a new BN, then the lack of `CONFIG_NAME` will cause the old VC to error.\n\nWe will announce this clearly in our release notes, and warn users relying on Teku/Infura that compatibility will lapse.\n\nDoes this sound like a reasonable solution?",
        "created_at": "2021-06-02T07:30:43.849000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Are we dropping `CONFIG_NAME` from the spec information?  It is by far the easiest way to know which network the node is operating with.",
        "created_at": "2021-06-02T08:57:03.529000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e Are we dropping CONFIG_NAME from the spec information?\nYes. It was removed from the config, as a separate earlier Altair change from the preset-config separation, since it was super unreliable (IMHO). For some clients it had to be \"mainnet\" for testnets, to detect the base types that the config then would also repeat, and could be used for completely different networks.",
        "created_at": "2021-06-02T11:13:55.439000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Consensus Layer",
        "parent": "",
        "content": "`PRESET_BASE` and presets make the purpose more explicit, less error prone: don't repeat anything in the config that is already frozen in the base, and preset-bases are clearly not network names",
        "created_at": "2021-06-02T11:15:45.976000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Config is an endpoint that's very loosely defined, just dictates 'key-value mapping of the spec variables', with no details...\nDo we need to re-think that?  Should it be returning something like an array of supported specs?\nSoon we'll have altair and phase0 well defined and you won't be able to get the altair details until it ticks over?",
        "created_at": "2021-06-02T21:11:33.297000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "hmm, glad you mentioned this.  We were planning a release today and it has lost the `CONFIG_NAME` field because that disappeared a little while back.  Sounds like that will break Lighthouse compatibility with Infura again.\nAnd it sounds like we should ensure we add `PRESET_BASE` which is currently being excluded from the config endpoint.\n\nWe have manually re-added the config items that are now constants (eg all the domain values) to try and preserve compatibility but `CONFIG_NAME` slipped through unnoticed...",
        "created_at": "2021-06-02T22:24:36.061000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003c@!340345049063882753\u003e If the aim is to remove `CONFIG_NAME` I was thinking we could just tear the band-aid off. Although it also wouldn't be too hard to just shim this one field on the BN (I'll look into doing that for us and see if it fixes compat).\n\nI haven't taken the approach of preserving constants, etc that we previously served. \nIt would be interesting to hear from API consumers (\u003c@!144468805697929216\u003e ?) whether the fields of the config + presets are sufficient for their needs",
        "created_at": "2021-06-02T23:44:58.825000+00:00",
        "attachments": []
    }
]