[
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Coming back to this, there are a couple of comments outstanding on the doc at https://hackmd.io/@QYHAVYiHRg65pdI_CEm7Eg/syncommitteeapi any chance you could take a look?  If we can square these off I'll raise a PR on the eth2-apis repo",
        "created_at": "2021-04-14T22:14:26.759000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "For the record, we're rapidly reaching the point in Teku where we'll need to implement this functionality.  Will be able to give some decent feedback on how well the proposed API fits with the reality of our particular implementations within the next week I suspect.",
        "created_at": "2021-04-14T22:27:16.563000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Hopefully sooner but I've had a lot of unexpected things pop up the last few days.",
        "created_at": "2021-04-14T22:27:38.313000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Cool.  The idea is to have something in place so the various clients can build to the same spec, but if we need to change the spec we can do so (much as happened with the eth2 API as we were working on it).",
        "created_at": "2021-04-14T22:37:07.810000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah I looked it over but my brain doesn't really grasp concept like this until I try to implement them anyway.  We may need to tweak the Teku API again if needed but that's fine - we'll mark them experimental until the Altair work is finalised anyway so no backward compatibility concerns.",
        "created_at": "2021-04-14T22:39:11.461000+00:00",
        "attachments": []
    }
]