[
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Can anyone think of changes they may need before we do this?  From my point of view (vouch and chaind) everything seems to be present and correct.",
        "created_at": "2021-08-03T07:08:07.993000+00:00",
        "attachments": null
    },
    {
        "author": "mpetrunic",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Do we wanna release v2 or v2.0.0.  ? In case of former we can still add changes and release more often. We could also add field/endpoint so client can return api version it's supporting?",
        "created_at": "2021-08-03T07:10:06.226000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I implemented the state/sync_committees endpoint today and was wondering about the naming of the “validator_aggregates” field. It seems a bit odd, maybe we could call it “subcommittees” or something else? I vaguely recall seeing some talk of scrapping it too, it seems a bit redundant",
        "created_at": "2021-08-03T11:51:10.821000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "There was a discussion around if it was always going to be linear subsets of the committee, or if it could in future be a more random subset.  If the former then scrapping it makes sense.  We could always go with dropping it for now and reinstating it if it can no longer be trivially derived.",
        "created_at": "2021-08-03T11:54:00.588000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "(The discussion faded away without any firm conclusion, if I remember correctly).",
        "created_at": "2021-08-03T11:54:18.625000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "it was trivial to implement, and in the proposed api, so i ended up just implementing it to expedite getting the api's done...\nwe've still got it marked experimental in case anything gets renamed, so if there's strong sentiment lets just put up a PR on the api...",
        "created_at": "2021-08-03T20:56:17.225000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "we're about to remove all the experimental flags... if this really needs to be done, we'd like it done very soon...",
        "created_at": "2021-08-03T21:39:11.121000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Given that it does not need to be done and from what I hear it has been implemented in most clients I don't see a compelling reason to remove it.",
        "created_at": "2021-08-03T22:00:09.237000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "ok, that sounds fair - I'll cleanup our api's ahead of the release in a few days",
        "created_at": "2021-08-03T22:28:39.903000+00:00",
        "attachments": null
    }
]