[
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I copied the dependent root info from attester duties but it might not be valid by the sounds of it, would be good to get some discussions going about whether it's needed, and what it should be if it is...",
        "created_at": "2021-04-22T04:02:13.664000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "https://github.com/ethereum/eth2.0-APIs/pull/134/files#r618058580 provides some context.  The two key points being that the correct dependent root is actually prior to what you can get from `get_block_root_at_slot` so getting the right value would require getting an older state.  And the head event doesn't currently contain the latest dependent root to compare with and tell if you need to invalidate the calculated duties.",
        "created_at": "2021-04-22T04:05:44.600000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Given `dependentRoot` only exists so the validator client knows when to invalidate duties, and sync committees have a 512 epoch look ahead (2 * 256 epoch sync committee periods), I'm not sure that invalidating duties is something we really need to worry about too much.",
        "created_at": "2021-04-22T04:07:29.764000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "And if we do worry about re-orgs just using the `depth` field from reorg events would be plenty (only invalidate if `depth` is greater than 8192 slots).",
        "created_at": "2021-04-22T04:09:15.078000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Although to take that approach, validator clients would need to wait until a significant time into the current sync committee period before checking if they are part of the next sync committee period.  If you do that as soon as you can, then even filling an empty slot in the last slot of the epoch before a new sync period could result in the next sync committee changing and you'd start performing duties incorrectly in 256 epochs time.  But if you only look at sync committees a few epochs ahead that won't be a problem.",
        "created_at": "2021-04-22T04:12:36.229000+00:00",
        "attachments": null
    }
]