[
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Without a design in that direction, hobbyists will not have access to MEV markets. That said, without L1 support, designs are looking for \"least bad\" design rather than optimal",
        "created_at": "2021-11-17T18:28:59.494000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "That said, I would argue that it never should have been `produceBlock` and that `produceBlockHeader` makes sense regardless",
        "created_at": "2021-11-17T18:29:16.320000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "additionally, any design (even supported by L1) that has builder proposer separation requires signing of a header without of the contents known apriori",
        "created_at": "2021-11-17T18:29:43.267000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Given that the merge states that a block's execution payload must be valid, how would a validator client be able to verify this without the full block content?",
        "created_at": "2021-11-17T18:33:32.417000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "(And this isn't the place, but I would say that I'm strongly opposed to \"trusted relay\" being considered the least bad solution, and don't buy the line that you have to have trusted relays for small players to be able to benefit from MEV.)",
        "created_at": "2021-11-17T18:34:47.879000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "in PBS designs, a validator cannot apriori know the commitment that they are making, but (in a good design) the fault is attributable to the economic actor (relay) who created the fault. Thus all future proposers would reject execution payload proposals from that relay, going to other relays that have good reputaito or just dipping into local mempool",
        "created_at": "2021-11-17T18:39:55.325000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "and note that any PoC on execution will almost certainly only be for attestations due to PBS designs",
        "created_at": "2021-11-17T18:40:08.723000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "If you have anything that works in this market design, EF, flashbots, and others are incredibly open ears. The fundamental issue is with MEV theft and policing. This is an almost intractable problem with ~10 entities today in PoW whereas with hobbyists in the beacon chain, we easily get to 1000 entities",
        "created_at": "2021-11-17T18:41:20.895000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "That said, I wish flashbots would disclose the problem statement -- MEV theft policing as being intractable -- a bit more clearly because without that context, designs like MEV-Boost are hard to evaluate",
        "created_at": "2021-11-17T18:41:57.434000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I just sanity checked -- https://ethresear.ch/t/mev-boost-merge-ready-flashbots-architecture/11177 does *not* provide the motivation on why the current market design does not scale and thus why even explore such solutions today",
        "created_at": "2021-11-17T18:45:57.264000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "This assumes that there is significant choice in the market, which I'm not convinced about.  If we consider the trusted relay with two relays with 49% and 51% of the validator share, respectively, then it makes sense for all searchers to send their bundles to the 51% relay as that has a higher chance of having their bundle included earlier.  Given this, you would expect very strong network effects and a very small number of relays (1 plus a few odds and ends).",
        "created_at": "2021-11-17T19:05:21.661000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I don't care about MEV theft.  It's a risk that should be dealt with by searchers on their own terms.  With a particular bundle they can send it to the earliest block proposer, or the most trustworthy (in their eyes), or anything inbetween.  The searcher can then deal with the outcome and act accordingly.  The protocol does not care whatsoever about the outcome, and nor should it.\n\nAs for the actors: I would far rather that actors had some protocol-level skin in the game.  There is literally no way of punishing relays outside of \"don't send them future transactions\",  which is very weak compared to punishments available for misbehaving validators.  And there's no way of knowing if a large relay is skimming off a few % of the transactions sent to it, due to the nature of MEV and there being multiple searchers.\n\nI could go on with various other objections, but handing over a critical feature of the network a handful of (shady) organizations seems like complete madness to me.",
        "created_at": "2021-11-17T19:11:35.099000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "(And this really isn't the right place for this, but I'd love to have the conversation elsewhere.)",
        "created_at": "2021-11-17T19:11:58.006000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e I don't care about MEV theft.  It's a risk that should be dealt with by searchers on their own terms.  \nYet if the best we can do is only provide MEV to the top 10 pools, the centralization pressures after the merge are massive. And there is zero evidence of a system that will be able to provide MEV markets to the masses",
        "created_at": "2021-11-17T20:36:15.256000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Searchers can simultaneously send to multiple relays. If one of them steals or reveals, they can stop",
        "created_at": "2021-11-17T20:37:02.988000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "anyway, agreed. not the right forum",
        "created_at": "2021-11-17T20:37:08.414000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "can take it bakc to the ethresearch post",
        "created_at": "2021-11-17T20:37:32.231000+00:00",
        "attachments": null
    }
]