[
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Paul did some work on this, and has a design up at https://github.com/sigp/lighthouse/issues/2715  if anyone has thoughts on this please weigh in, otherwise we should get up a PR soon so everyone can see how it works with the testnets.",
        "created_at": "2021-11-08T18:48:51.086000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I'm still pretty nervous about the beacon node led approach rather than the vc driving it.  It feels like we're really blurring the lines of responsibility - now the beacon node really has to know which validators are running against it and is actually trigger part of duties for them automatically. I think it works just feels dirty.",
        "created_at": "2021-11-08T21:39:08.689000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Does the `/validator/potential_beacon_proposers` call not square the circle?  It's broadly speaking similar to the existing subscriptions calls, where the VC informs the BN about the validators under its control that may (or may not) have upcoming proposals.  Keeps the VC in control at a high level, and allows the BN to get on with the details.",
        "created_at": "2021-11-08T22:01:43.977000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "It works, but that's the bit that feels dirty to me - now the BN is also tracking which validators it runs so that it can start performing duties. Admittedly that had already bled in a bunch with the way subscriptions had to work. I'm not strongly against it if everyone else is keen to go that way though.",
        "created_at": "2021-11-08T22:05:02.859000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "It does, but only short-term.  Which feels about as close to a compromise as we can get.",
        "created_at": "2021-11-08T22:05:48.707000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "(A subscription is also not a requirement to propose; I could tell three different beacon nodes to prepare, but only fetch the block from one.)",
        "created_at": "2021-11-08T22:06:23.976000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah I think those kinds of details are going to be the key pain point - if you're using load balanced beacon nodes you want to always send `/validator/potential_beacon_proposers` to all nodes behind the load balancer and then distribute the other requests.  Previously you'd just configure all nodes to subscribe all subnets and they could then be completely oblivious to which validators they were used for.",
        "created_at": "2021-11-08T22:07:30.491000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "But I think that's also pretty true for the vc driven model because the prepare has to go to the same node as the get.",
        "created_at": "2021-11-08T22:08:06.578000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "That's a little easier to configure as you can use sticky sessions.",
        "created_at": "2021-11-08T22:08:27.821000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "There isn't a subscribe all subnets for sync committees (as far as I'm aware) so I think that model has already fallen by the wayside.",
        "created_at": "2021-11-08T22:08:30.417000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Teku subscribes to all attestation and sync committee subnets when told to subscribe all.",
        "created_at": "2021-11-08T22:08:50.910000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Ah, that's cool.  Wonder if the other nodes do the same thing",
        "created_at": "2021-11-08T22:09:06.834000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think as long as we're short-term it's kind of like a long-range  `prepare` call so still feels like it's VC-initiated.  Not totally clean, I agree, but not horrible.",
        "created_at": "2021-11-08T22:11:08.622000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I'm unclear how short term this is to be honest since block production is always going to want to get as much of a headstart as possible.  But I don't think vc-initiated is dramatically cleaner anyway so doing what's simplest and seeing what the future brings is probably the right approach.",
        "created_at": "2021-11-08T22:14:38.324000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Sorry by short term I mean the duration of the \"subscription\".  If the VC reported to the BN just once the list of all validators for which it was responsible, and the BN worked to that list for the duration of the lifetime of the BN (which I would call long term, and was the original proposal), that wouldn't allow much flexibility (and would require the VC to be aware as/when the BN restarted and so lost the list).  With the current proposal, a VC can report all validators periodically, or just those that it needs to when it obtains new duties, or whatever, so the onus is more on the VC to keep the BN up to date and that seems like a safer way to go.",
        "created_at": "2021-11-08T22:20:47.708000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "ah yeah I see you what you mean now.",
        "created_at": "2021-11-08T22:22:32.083000+00:00",
        "attachments": []
    }
]