[
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "ok thats fantastic, thanks for the update 🙂",
        "created_at": "2021-03-23T00:16:27.409000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Having thought about it some more, I wonder if we should avoid settling on the \"consolidated\" chain spec approach, because that isn't how configs are encoded in the specs repo: https://github.com/ethereum/eth2.0-specs/tree/v1.1.0-alpha.2/configs/mainnet\n\nWe'd likely need different types for the consolidated spec \u0026 each of the phase0/altair/phase1/future specs. Is Teku's current handling of configs straight-forward with the consolidated format, and do you have a preference regarding consolidated vs broken up?",
        "created_at": "2021-03-23T05:57:05.296000+00:00",
        "attachments": []
    },
    {
        "author": "mpetrunic",
        "category": "Consensus Layer",
        "parent": "",
        "content": "We could add hard fork name as id to spec config endpoint. I imagine users checking upcomming forks endpoint",
        "created_at": "2021-03-23T08:31:25.887000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "As an API consumer I'd rather have a consolidated endpoint to fetch the entire spec.  There could be an optional parameter for the spec only for the given fork (e.g `?fork=altair`) but not sure it would be of much use.",
        "created_at": "2021-03-23T08:38:59.464000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The config name field should be purely cosmetic, and the config should only ever get extended in a chain, changing it would technically break that assumption. Will discuss with spec folks and see if it can be resolved before Altair specs release",
        "created_at": "2021-03-23T09:53:44.664000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Personally I like the idea of a consolidated spec config approach. Merging the yaml docs may help there. A single immutable simple key-value store is all that it should be",
        "created_at": "2021-03-23T09:57:05.348000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Merging the YAML in the specs repo might be nice from a simplicity PoV, but we can also get by with an agreement to not redefine fields between the different files so that their union is well defined",
        "created_at": "2021-03-23T12:21:55.192000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Aren't any updated values versioned with the hardfork name, so that each value is unique?",
        "created_at": "2021-03-23T12:42:32.271000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Consensus Layer",
        "parent": "",
        "content": "yes, but there's this weird exception right now, the `CONFIG_NAME` variable is duplicated between all configs (and might be different for unknown reasons)",
        "created_at": "2021-03-23T12:51:31.622000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Why does `CONFIG_NAME` need to be in `altair.yml`?",
        "created_at": "2021-03-23T13:02:50.658000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Legacy choice, I think it can be removed. My intention was always to have unique variables, simple key-value, yaml compatible, and ability to consolidate into a single namespace easily (for compatibility with env vars)",
        "created_at": "2021-03-23T13:08:24.652000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "All seems perfectly reasonable",
        "created_at": "2021-03-23T13:08:51.463000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "we were discussing the general design principle of Postel's Law - https://devopedia.org/postel-s-law - re. the config api... It kind of leads to a follow-on here:\nDo we need to point to this kind of principle of api design as guidance on being permissive?  We think it's probably at least worth adhering to, but would it be worthwhile having an 'api' guidance of some kind to state that you're strict on what you accept (fields you need should be there, and correctly formed), and permissive of it not being the only content (extra fields ignored)?",
        "created_at": "2021-03-23T21:55:29.385000+00:00",
        "attachments": []
    }
]