[
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "i'd like to be able to keep the consistent 'interface' for query etc, but change the underlying response in the data field depending on the version string. what im not sure of is if we can define it like that in openapi or in the spec yaml etc.\ni think it gets messy doing things like v1 is used until this epoch, v2 to that epoch etc, and it also gets messy having optional fields that clients need to know the boundary epochs to understand which optional fields shouldn't be optional at a given state, so i was trying to think of alternatives...",
        "created_at": "2021-03-12T01:06:00.858000+00:00",
        "attachments": null
    },
    {
        "author": "mpetrunic",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I agree with Paul to have same interface for all blocks. I think we can spec that in openapi via \"oneOf\" keyword",
        "created_at": "2021-03-12T05:54:10.852000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Ah, gotcha.  Yeah the v2 endpoint being able to return all blocks makes sense.  Outside of the OpenAPI representation, what would we use for version?  We seem to already be in to one of the hard problems, with our versions being 'phase0' and 'Altair'.  Would using fork version  make sense, perhaps?  Simple numerical increments individual for each data type?",
        "created_at": "2021-03-12T07:31:40.537000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "yeh anything, fork version, any string representation",
        "created_at": "2021-03-12T07:35:13.844000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "ideally it would be something helpful, 'phase0', 'altair' wouldn't be terrible names, or just from '1', '2', really not important what the actual identifier string is as long as we're consistent",
        "created_at": "2021-03-12T07:45:05.093000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "i'd definitely suggest string so it can be anything, just to be flexible",
        "created_at": "2021-03-12T07:45:46.772000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I like using the fork name. There a SPEC_NAME constant or something like that in the actual beacon chain spec so using the same name as that would make sense.",
        "created_at": "2021-03-12T08:33:22.499000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I don't see a SPEC_NAME anywhere, there is a CONFIG_NAME but that's mainnet/pyrmont/whatever.  Sounds like 'phase0', 'altair' would work.\n\nRegarding versioning in the metadata: I took a quick look through the APIs to see which endpoints return arrays, and from that which could potentially return arrays with multiple versions in them.  I'm going on the assumption that the change will take place at an epoch boundary, so anything that returns arrays of information related to a single epoch shouldn't have an issue.  I'm also assuming that the upgrade is hard _i.e._ a block from phase 0 wouldn't be accepted once we cross the epoch threshold for altair.\n\nThe eth/v1/beacon/pool/* endpoints are a potential concern, where for example attestations for the last block of phase0 could sit alongside attestations for the first epoch of altair.  But that looks like the only place where there could be a problem from my admittedly quick look through the endpoints.",
        "created_at": "2021-03-12T09:31:00.306000+00:00",
        "attachments": null
    },
    {
        "author": "mpetrunic",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Maybe for arrays we can include more complex metadata like array of versions with same length as data array?",
        "created_at": "2021-03-12T09:44:44.025000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "That could work.  By default there would be a \"version\" key with a single value, but if there were multiple versions of data returned it would be a \"versions\" key with an array of values.\n\nMost of the time we'd expect the former, with the latter for the special cases.",
        "created_at": "2021-03-12T09:59:15.241000+00:00",
        "attachments": null
    }
]