[
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Does lighthouse care what the CONFIG_NAME is set to? We could potentially just set it to \"unknown\" for example.",
        "created_at": "2021-06-03T00:04:29.087000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Old Lighthouse does, it expects an existing testnet name, minimal, or mainnet (full list here: https://github.com/sigp/lighthouse/blob/3a24ca5f14c6e6d6612fd43eca82aa0c1e6aba16/consensus/types/src/chain_spec.rs#L593-L608)\n\nThat behaviour was quite naughty, and was part of what \u003c@!203220829473996800\u003e wanted to get rid of. But I think we could be backwards compat (with old Lighthouse) by setting `CONFIG_NAME=PRESET_BASE`",
        "created_at": "2021-06-03T00:11:13.160000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "That's a pretty good idea actually. I might scrap the release for today and get that change in. There isn't anything urgent to get out so won't hurt for it to go out next week instead.  With `CONFIG_NAME` still in the response there, Teku's spec endpoint will remain fully backwards compatible (assuming you ignore unknown fields) and we can remove the extra constants and `CONFIG_NAME` in a later release when people have had time to upgrade.",
        "created_at": "2021-06-03T01:05:03.638000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003c@!144468805697929216\u003e raised the issue of the root path - https://github.com/status-im/nimbus-eth2/issues/2491 - in the spec, `/api` is used, and in general, it seems natural that consumers should support any root url, path included, but at the same time, it was raised as an issue that nimbus did not use the root path for the REST api which other clients do - in particular, serving `/metrics`, `/api` etc is quite natural because it allows a single port to handle all kinds of webby interfaces - thoughts on this?",
        "created_at": "2021-06-03T08:24:33.720000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I thought the `/eth` was added to be a reasonably unique namespace, so `/api/eth` seems redundant.  But personally I wouldn't have prescribed any particular prefix and just assumed a path might be part of the base URL.\nWhich is to say, I don't think it really matters if the base URL nimbus exposes is `http://foo/` or `http://foo/api`, but I'd suggest documenting the base URL for your REST API as `http://foo/api` then (which I suspect you naturally would anyway).",
        "created_at": "2021-06-03T09:29:41.304000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "yes - this is not so much about nimbus itself, rather making a call on whether having support for non-root URL:s for the API is a feature, and resolving the discrepancy where the documentation uses `/api` while implementations don't - the difference lies in how users later configure their rest source: as just a a `server:port` with \"standard\" paths or a URL - coming to agreement on this between clients will help the ecosystem in general",
        "created_at": "2021-06-03T09:32:33.898000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "`/eth` is fine in my book as well, but clearly the additional `/api` in the upstream docs is causing some confusion at least",
        "created_at": "2021-06-03T09:34:43.630000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah I think it's standard to specify a base URL as an actual URL.  Otherwise you can't select between https and http.",
        "created_at": "2021-06-03T09:35:20.813000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I hadn't seen the `/api` prefix before to be honest.",
        "created_at": "2021-06-03T09:35:31.872000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "we saw it and were surprised that noone else had 🙂",
        "created_at": "2021-06-03T09:36:07.233000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "To be fair Paul Harris has done most of our API stuff, not me. 🙂",
        "created_at": "2021-06-03T09:37:34.671000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "As mentioned in the issue, I wouldn't make it a spec requirement for the endpoints to be available at a specific path, but as the other clients used the / endpoint it made sense for nimbus to consider doing the same.\n\nI would also note that there could be different requirements for different features (_e.g._ metrics and API), so having the same controls (listen host, firewall rules, CORS hosts) for all of the features could be problematic.",
        "created_at": "2021-06-03T11:11:14.425000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I've never seen `/api`, i mustn't pay much attention 🙂\nin theory specifying a different root url should allow you to have `/eth/v1` as non root, but i think in practice most people will expose from the root path... the reason I wouldn't want to lock it in is because someone always finds an exception to why they want the api on a different route, and really that's just the web i guess...",
        "created_at": "2021-06-03T21:23:13.854000+00:00",
        "attachments": null
    }
]