[
    {
        "author": "mpetrunic",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Im curious about that ugly stuff 😅",
        "created_at": "2021-03-20T05:34:57.542000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The slot number for both state and blocks is in the same position for phase 0 and Altair so we can just read it then use that to work out how to decide the rest. Given how simple it is to extract the slot from the SSZ the overhead is negligible.",
        "created_at": "2021-03-20T06:00:33.172000+00:00",
        "attachments": []
    },
    {
        "author": "protolambda",
        "category": "Consensus Layer",
        "parent": "",
        "content": "In the req-resp I added something less hacky, to just read the forkdigest before the chunk payload, in case of the block related methods. Maybe it makes sense to do something similar in the API, and add a forkdigest field where applicable",
        "created_at": "2021-03-20T13:48:05.041000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah I like having the fork identified in the rpc responses though I’d kind of hope we keep the ability to parse blocks and states purely from their SSZ by not moving that slot field around and I struggle to see why we’d need to break that in the future. Even so in terms of apis it’s better to be clear. \n\nThe fork digest probably would may have been what I’d pick - I’d have thought just the fork version would be enough as the genesis validators are irrelevant for parsing that data and so then you’d have a constant which is a lot simpler to handle. \n\n\u003c@680234424037670912\u003e ‘s suggestion for the rest api is essentially to have a version field but I don’t think it’s been decided exactly what goes into it yet. Name of fork is likely since it’s human friendly but fork version would also work. Fork digest is an option but very human unfriendly.",
        "created_at": "2021-03-20T20:14:47.953000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "We could migrate tekus dB format to record the version as well but that’s a pain and either required storing more data or doing additional lookups or both. Since the version is already recorded in the SSZ and simple to access that’s what we’re using for now.",
        "created_at": "2021-03-20T20:16:34.227000+00:00",
        "attachments": []
    }
]