[
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "this is how we store all states in Nimbus and we use `(root-of-last-block-in-previous-epoch, slot-0-of-epoch)` to find them in the database",
        "created_at": "2021-05-31T12:29:52.433000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "basically, all internal operations in nimbus start from these \"slot states\", for many reasons - storing the state with the block applied is problematic for a number of reasons - for example if the block is orphaned",
        "created_at": "2021-05-31T12:32:44.891000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "`(root-of-last-block-in-previous-epoch, slot-0-of-epoch)` is used to guard against all slots being empty in an epoch and we use the block root instead of the hash tree root of the state because a) computing the state root is expensive and b) it's not used anywhere else in the protocol so it's messy as far as tooling goes to use a different state root than everyone else",
        "created_at": "2021-05-31T12:35:08.441000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\"expensive\" is relative here - ie since that root isn't used elsewhere, we never \"need\" to compute it and thus don't - we just keep invalidating caches until there's a real need - only the root with the block applied is computed (to verify the state root in the block)",
        "created_at": "2021-05-31T12:37:25.722000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003c@!449019668296892420\u003e thanks.  Do you store the state root itself, or allow it to be queried and used in the API calls?  And if not, what do you consider the impact of having an API call to do this would be?\n\n(I recognize that having this functionality would be additional work for everyone, and am attempting to gauge the amount of work it may be for both generating the state root and using it in queries).",
        "created_at": "2021-05-31T13:25:18.364000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "we don't support it right now - my inclination would be that it should be requested by dependent root + epoch (there's precedent, the situation is the same as with attestation duties)",
        "created_at": "2021-05-31T16:34:20.251000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "we've considered something akin to `root:slot` as a canonical encoding for these kinds of requests - it turns out this is a very convenient way to uniquely identify a chain and point in time",
        "created_at": "2021-05-31T16:36:03.292000+00:00",
        "attachments": []
    }
]