[
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "A beacon node is responsibile for making a beacon block, imo\nand part of that is the execution payload",
        "created_at": "2021-11-09T00:03:37.568000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "by increasing the parties a VC has to talk to and the components it has to assemble, that is greatly increasing the security surface *and* then begins to require more application specific logic in the VC",
        "created_at": "2021-11-09T00:04:28.196000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "additionally, in an builder-separated market (a seeming inevitability, there needs to be made a decision about which party migh actually construct and release the EL payload",
        "created_at": "2021-11-09T00:05:00.971000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "which may require p2p networking, rational decision making (do I go to p2p/builder or do I use my mempool), and more",
        "created_at": "2021-11-09T00:05:32.015000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I see the BN as the brain of the protocol and the VC as a thin signing entity that keeps itself safe.\n\nTo minimize complexity and security risks, I really think that a VC should limit communications to the \"brain\" and keep it at that",
        "created_at": "2021-11-09T00:06:05.636000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "even at the cost of  complexity in the brain",
        "created_at": "2021-11-09T00:06:25.969000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "okay -- we have a separate validator-apis repo now (as discussed on the previous call)\n\nwho wants to generally get it setup with CI, swagger build, etc...\nhttps://github.com/ethereum/validator-APIs",
        "created_at": "2021-11-09T00:08:13.420000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I agree the VC shouldn't talk directly to the execution engine, the question is really just about how the scheduling of the call is done - currently scheduling is the VC's responsibility and now the BN gets a bit of that.\nIn terms of security it's the signer that's the thin signing entity that you want to keep safe, the VC responsibility is just scheduling duties.  If it weren't for things like Vouch I'd be tempted to just fold the VC back into the BN (with external signer).\n\nBut I tend to live in a world where external signers were always a part of the design whereas it's a more recently added concept for a number of other clients so that likely affects the base world view a bit.",
        "created_at": "2021-11-09T00:43:10.137000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I’ll give it a shot, I imagine I can crib a lot of stuff from beacon-APIs. Maybe \u003c@688748669268132001\u003e would be a good co-maintainer as well?",
        "created_at": "2021-11-09T11:10:19.614000+00:00",
        "attachments": null
    }
]