[
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I am sorry that I am late to the party but I just came across this post of Paul Hauner https://github.com/sigp/lighthouse/issues/2715#issuecomment-945215426 explaining the benefits of BN driving vs VC driving for the endpoint implemented in https://github.com/ethereum/beacon-APIs/pull/178. My undestanding is that the \"unnecessary complexity to beacon nodes\" mentioned by Jim or the wastefulness mentioned by Paul is simply that in the situation where a single validator client is driven by many beacon nodes, then these many will have to keep information that could be driven by a single client. I agree that that scenario, of many beacon nodes for a single client is prejudiced by a design where the beacon node persists the database of fee recipient addresses. However, shifting the burden to the validator client forces the client to push this address at regular intervals. At prysm we decided that most users will not be running multiple beacon nodes, so we will be persisting the map in the beacon node database, this way it will persist across restarts. This is compliant with 178, but this adds an additional constraint to client diversity: a prysm validator client could not work with other beacon nodes (it doesn't currently anyway for different reasons) because other beacon nodes will not guarantee the persistance of the recipient fee. This design decision will have to be revisited when prysm's validator client implements the standard API.\ncc. \u003c@!144468805697929216\u003e",
        "created_at": "2022-03-10T17:12:10.376000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Does the prysm beacon node still work with `prepare_beacon_proposer` as per the spec _i.e._ passing the fee recipient provided to the execution client?",
        "created_at": "2022-03-10T17:34:21.372000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "yes everything will be the same, just that the validator client will not be pushing periodically",
        "created_at": "2022-03-10T17:34:52.424000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "so we will be following the spec",
        "created_at": "2022-03-10T17:35:37.443000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Another design decision of that same API endpoint was to choose validator index instead of validator pubkey. I can think of a few instances where a user may want to set its fee recipient even before making a deposit. This can be handled internally by the validator client by pushing the recipient only when the index is known but still it requires an engineering effort that may be avoided by using the pubkey instead of the index to start with",
        "created_at": "2022-03-10T17:39:40.841000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I would disagree that you're following the spec if you're not calling the prepare api periodically.  And I'm not sure why you would deviate from that and break compatibility. By all means store the config in the beacon node, but I don't see a reason why the VC wouldn't do the refresh anyway. It's one simple call per epoch so not exactly a performance issue.",
        "created_at": "2022-03-10T21:15:17.793000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Lighthouse does it per slot, if Teku does it per Epoch I suppose, where is it specified that the validator client **has** to periodically push?",
        "created_at": "2022-03-10T21:22:19.305000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "the API says it is expected",
        "created_at": "2022-03-10T21:23:40.307000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "From the API description:\n\u003e The information\n\u003e      supplied for each validator index will persist through the epoch in which\n\u003e      the call is submitted and for a further two epochs after that, or until the\n\u003e      beacon node restarts.  It is expected that validator clients will send this\n\u003e      information periodically, for example each epoch, to ensure beacon nodes have\n\u003e      correct and timely fee recipient information.\n\nAnd you said yourself that not sending it would mean that Prysm won't be compatible with other beacon nodes.",
        "created_at": "2022-03-10T21:26:43.012000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "it isn't now, surely when we fix the standard RPC API this design decision will have to be revisited. But at this stage it is hard to justify pushing periodically when its not needed.",
        "created_at": "2022-03-10T21:28:16.231000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "But it is needed. The beacon node doesn't hold onto that information forever, so if you don't refresh the information within a couple of epochs the beacon node will drop the info and assume the validator client no longer needs it to prepare those blocks.",
        "created_at": "2022-03-10T21:29:24.867000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Or at least the beacon node doesn't have to and some implementations don't.",
        "created_at": "2022-03-10T21:30:06.354000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I understand, but the current prysm validator client can't work with other beacon nodes for different harder to fix reasons now. Pushing periodically is a one liner vs changing the whole gRPC",
        "created_at": "2022-03-10T21:30:14.693000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Right, so prysm just isn't using the standard api at all right?",
        "created_at": "2022-03-10T21:30:56.045000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "for the vc",
        "created_at": "2022-03-10T21:31:00.807000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "the VC of prysm uses the older grpc API that predates any attempt to standardize this. It is hard to fix that, the beacon node supports the standard API right now, but the VC  doesn't yet",
        "created_at": "2022-03-10T21:31:50.191000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Right ok. Sorry I knew that but lost track of it.  In that case yes, your BN is compliant with the spec by storing the data as it's not required to forget it, and your vc isn't compliant because well it's not even trying yet. 🙂",
        "created_at": "2022-03-10T21:33:25.855000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I wish I was aware of that discussion in the LightHouse repo, in fact when read that thread, I see a very nice description by Paul there where the options are either preserving the map in the beacon node and don't worry about complicated logic in the validator client, vs preserving the same info  in the validator client and periodically push via an API call. So this benefits those who run several beacon nodes in that they don't need to store the same info multiple times, but penalizes those that have one beacon node and need to submit possibly multiple calls periodically. I guess now it's late but I would have been vocal against this design",
        "created_at": "2022-03-10T21:37:46.702000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I'd probably still back this design. I think it's trivial for a call to be made periodically but quite problematic to expose an API that permanently shoves info into the beacon node with no way to remove it again. One bad call and all of a sudden your beacon node will forever prepare blocks for a validator you don't actually run.",
        "created_at": "2022-03-10T21:39:15.162000+00:00",
        "attachments": []
    }
]