[
    {
        "author": "metachris_",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Not currently. I think this would need to be implemented on both mev-boost and the relay/builder. We can do that pretty easily though, but should probably be enshrined somewhere (https://github.com/ethereum/builder-specs).\n\nWould code 415 be more suitable? 🤔  https://developer.mozilla.org/en-US/docs/Web/HTTP/Status/415",
        "created_at": "2022-05-19T07:56:43.850000+00:00",
        "attachments": []
    },
    {
        "author": "metachris_",
        "category": "Consensus Layer",
        "parent": "",
        "content": "This builder API definition is basically only guaranteed until the relay anyway. The communication between relay and builder probably won't use much of that API, is still in flux and I don't think that's the primary concern here (need to be designed anyway, no matter if the registrations arrive at the relay as array or single items). For instance, builders will probably stream latest blocks to the relay, and the relay verifies the block, calculates the value and prepares the BuilderBid response. \n\nThe question here is how the validator registrations will be forwarded up until the relay, where I think an array would be nice, because in some cases it drastically reduces the number of calls a CL/mev-boost node has to do towards the relays (imagine 500 validators on a node with 5 relays. it would regularly burst 2.5k requests rather than only 5).",
        "created_at": "2022-05-19T08:01:13.415000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah, I'm cool with array 👍",
        "created_at": "2022-05-19T12:15:22.037000+00:00",
        "attachments": []
    },
    {
        "author": "metachris_",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Could you leave a comment on https://github.com/ethereum/builder-specs/pull/10 for reference and context later? 🙏",
        "created_at": "2022-05-19T13:36:51.740000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Ultimately i dont mind if we respond with 406 or 415... but it'd be nice if i send an SSZ encoded block to a server with `application/octet-stream` ...\nSo i guess specifically,\nAs a client, i send an SSZ block to `/eth/v1/beacon/blocks` or blinded_blocks, and set `Content-Type` to `application/octet-stream`\nMy hope is the content-type is looked at so that the server can understand i'm sending non json data, and respond with (406 or 415) to let me know so that i can resubmit as json if required...\nThen the obvious thing is if Im getting that response from the server i stop trying ssz 🙂",
        "created_at": "2022-05-19T22:24:49.062000+00:00",
        "attachments": []
    }
]