[
    {
        "author": "metachris_",
        "category": "Consensus Layer",
        "parent": "",
        "content": "if you want to push supporting it, a good place to start might be a PR implementing this behavior in mergemock relay `getPayload` handler: https://github.com/protolambda/mergemock/blob/master/relay.go#L278 (maybe a better start would be an issue in the builder-spec repository)",
        "created_at": "2022-05-20T08:43:31.100000+00:00",
        "attachments": null
    },
    {
        "author": "metachris_",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I wonder what's the win here, if you already need to implement sending the payload as JSON as a fallback (which extends the getPayload duration by another roundtrip)?",
        "created_at": "2022-05-20T11:21:45.549000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "SSZ is more compact and faster to parse than JSON so supporting it as an option was a request (particularly for Vouch which talks to a bunch of beacon nodes so little bits add up). For most requests we can request ssz or json in the Accept header so it falls back automatically - for posts we have to try ssz and then get a 415 to tell us we need to switch to JSON.  Once we get one 415 response we'd remember that and always use JSON though so we don't incur an additional request on every post.",
        "created_at": "2022-05-20T21:52:27.225000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Consensus Layer",
        "parent": "",
        "content": "+1 on SSZ support, and 415 sounds like the right status code",
        "created_at": "2022-05-20T22:13:48.910000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "just reducing retrys is the win for me, in terms of why i want the responses.... ssz encoding is magnitudes faster and more compact",
        "created_at": "2022-05-20T22:15:32.221000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Just as background, it was brought up during that devconnect that it'd improve life if blocks could be created / submitted in SSZ format rather than json to improve life for \u003c@144468805697929216\u003e doing block comparisons etc to determine the best block to sign... aside from that use-case, its also a great win for VC's because they can reduce encoding/decoding, so we've implemented SSZ support on the BN side (also added to spec) and I was looking at the best response to use when not supported so that I can implement that in our VC and add it to the block apis as a documented response type.  It sounds like I'll raise a PR to add 415 as the type.",
        "created_at": "2022-05-20T22:34:06.953000+00:00",
        "attachments": null
    }
]