[
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "When there's non canonical blocks some clients can return all of them fairly easily... teku can't query based on parent root, so it's not really a scenario we would see very often... \nI guess real-world, when there's a late block, at slot N+1, slot N+2 has a parent N, and so does N+1, so querying N as the parent would conceivably return both N+1 and N+2, and the finalized flag would indicate what made it on chain...\nI think in practice it'd be rare for most clients to keep non-canonical blocks around, and you'd likely just get 1 block back in that scenario...\nand in non-finalized where it's potentially quite useful, you'd probably get both blocks back and both would be marked non-final.",
        "created_at": "2022-12-15T20:51:51.848000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The `finalized` flag is in the metadata section so there's only ever one of them that has to apply to all returned headers.  For `slot` that works fine - either the requested slot is from the finalized section of chain or it's not and that applies to all headers.  For `parentRoot` it doesn't work since you might have one child block that's finalized and one from a later slot that isn't.",
        "created_at": "2022-12-15T20:55:45.246000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "`parentRoot` has never made any sense to me though and I have no idea why anyone would be maintaining an index of blockRoot -\u003e all children just for this API. Teku's never implemented it and no one has ever mentioned it.",
        "created_at": "2022-12-15T20:56:10.380000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I'd kind of like to just remove it from the standard API but to be useful it would have to be done as a break of backwards compatibility - no point adding a new V2 without it and having to support the V1 still.",
        "created_at": "2022-12-15T20:57:01.743000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "i think 'finalized' was added to a bunch of endpoints and the others were probably clearer...",
        "created_at": "2022-12-15T21:00:27.228000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "thanks \u003c@340345049063882753\u003e makes sense",
        "created_at": "2022-12-15T21:00:58.641000+00:00",
        "attachments": null
    }
]