[
    {
        "author": "stefanbratanov",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Hi, wanted to ask opinions of others what behaviour makes most sense for the `/eth/v1/node/syncing` endpoint to return when the EL is offline post merge? In Teku, we will have `is_syncing` and `is_optimistic` to false in that case, but from a VC perspective that will mean a remote BN is ready for requests, when in reality it isn't.",
        "created_at": "2022-09-08T11:11:03.118000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "As a user of geth, the main complication of IPC for me was user permission, I don't want to have anything ran by geth being exposed outside, but I do need to expose some of my beacon to the internet. So I run them with different users. In fact I run them with random users. Setting IPC to work was notoriously difficult because of the latency until the socket was established and then change the ownership. So http ends up being easier to handle.",
        "created_at": "2022-09-08T19:35:20.873000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "We should probably start reviewing this in view of pulled tips \u003c@425572898787426305\u003e \u003c@361447803194441738\u003e",
        "created_at": "2022-09-08T19:38:56.410000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "At least we should provide a checkpoint endpoint that directly gives the justified and finalized checkpoints in store.",
        "created_at": "2022-09-08T19:39:56.794000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yes, I understand - I'm on board with the idea. Also, heard today from  \u003c@425274498732916736\u003e about problem with user-perms on the jwt-file -- I'll make a PR to fix so all users can read it. Wasn't aware of the problem until today.",
        "created_at": "2022-09-08T19:45:28.302000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah worth having new APIs to get the checkpoints from the store.  In terms of what's required for the checkpoint API the finalized checkpoint from the state is probably best, but I suspect both would work out - just might delay finding peers until the pulled finalized is actually included in a state.",
        "created_at": "2022-09-08T21:02:26.735000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Having the state is misleading cause it can go backwards",
        "created_at": "2022-09-08T21:31:09.109000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "True but checkpoint sync just needs a state that is guaranteed to be finalized and on the epoch boundary (ie the block root that would be used in a finalized checkpoint). The state you start from has to be seen as finalized by all nodes or you'll have trouble finding peers so it seems safer to me to use the checkpoint from the state which we know is on chain vs from the store which may be unrealised.",
        "created_at": "2022-09-08T21:56:46.381000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "There's no requirement for this api to always provide the very latest finalized state at all - just something within the weak subjectivity period and more recent is better.",
        "created_at": "2022-09-08T21:57:19.997000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Ah apologies, I didn't get which checkpoint you were referring to. Yeah I have no take on the checkpoint used for checkpoint sync",
        "created_at": "2022-09-08T22:09:52.670000+00:00",
        "attachments": null
    }
]