[
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Just saw this now, trying to understand here what is the purpose of the `execution_block_height: uint64` field if we already have the finalized eth1data object in there ?",
        "created_at": "2022-08-08T01:25:42.841000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "It’s not strictly necessary because we have the block hash but it would make life a lot easier in teku as all our logic is currently block number based and it’s cheap to record.",
        "created_at": "2022-08-08T01:27:29.552000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Gotcha, in that case maybe we can flatten this into:\n```py\nclass DepositTreeSnapshot:\n    finalized: List[Hash32, DEPOSIT_CONTRACT_DEPTH]\n    deposit_root: Root\n    deposit_count: uint64\n    execution_block_hash: Hash32\n    execution_block_height: uint64\n```\nThat way all the information we need is just there. Unless you see an advantage to having it separately in an eth1data container",
        "created_at": "2022-08-08T01:31:25.155000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I originally voted for a flat structure mostly just to avoid extra boiler plate code a new SSZ type would incur but if we use a nested Eth1Data class then I’m entirely ambivalent on whether it’s nested or not.",
        "created_at": "2022-08-08T01:52:50.563000+00:00",
        "attachments": []
    },
    {
        "author": "ethdreamer",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah devs seem split on whether or not to have the nested structure. Another thing about the nested structure is that it's a nod to the fact that the deposit snapshots evolve with increments of `Eth1Data`.\n\nAn `Eth1Data` tags a version of the deposit tree and a snapshot is just a wrapper around it with one extra piece of information (the `finalized` array), but we add in the `execution_block_height`, making it 2 pieces of information, because it's more convenient.\n\nThe newly syncing consensus node will need the `execution_block_height` and the only way to get it from the block hash is by querying the EE, but since you're newly syncing the EE probably is too (especially post merge). So it's more convenient to include the block height too so that you can just initialize your tree with the snapshot and proceed normally instead of having to keep the snapshot around until the EE caught up and then initialize your data structures.",
        "created_at": "2022-08-08T07:04:01.005000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "If we are already initializing a new data structure here(snapshot) , i dont see too much benefit in encapsulating it in an eth1 data container here since we are adding an extra field(execution_block_hash) to basically refer to that same information. Having it all flattened in the same struct makes it clearer.",
        "created_at": "2022-08-08T07:28:13.638000+00:00",
        "attachments": []
    }
]