[
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "it's not so much about hostname security, but rather binding the socket to 127.0.0.1 by default and requiring an explicit configuration option for anything wider than that - there is simply no way anybody can connect to such a socket from outside - users that copy-paste configuration to \"make it work\" won't care what the option says exactly, so the only one's that benefit from JWT are those that care - and they will already _not_ have bound their server to anything but localhost - one thing to consider which would significantly simplify setup for single-machine users would be to get rid of jwt for locally bound sockets",
        "created_at": "2022-09-01T04:56:31.685000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "that's making the assumption that everything on the box is trusted... I'd rather not make that assumption...",
        "created_at": "2022-09-01T05:10:19.410000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "is it really that significant a simplification? It's common access to 1 file... I could potentially see the argument to allow users to choose to disable it I guess, but I wouldn't have thought 1 file would be a 'significantly more complicated' thing...",
        "created_at": "2022-09-01T05:13:01.421000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "It is a challenge for non-technical users, as instead of a 2 step process with setting the beacon client and execution client. You now have an interactive step where you need to \n- Generate the jwt secret\n- Provide the path to the beacon client\n- Provide the path to the execution client\n\nUsers cant just copy and paste commands to run them, and have to go through this additional step which causes a lot of confusion. Because a few things can happen, wrong path provided, potential permissions issues , etc. Currently the connection between the beacon and validator is not secured and isn't mandated to be. Users are given the choice on whether they want to secure it, or if it is all on the same machine , leave it unsecured.",
        "created_at": "2022-09-01T05:21:29.116000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think in terms of BN-\u003eVC, there's not really a lot that need to be behind a token, any privileged op is done by signing, so things are pretty safe...\nCL-\u003eEL is the complicated setup, I'm sure I'd probably be one of the 'copy/paste' users to get things going, so I do get it that it's a complicated thing to configure when it's all new etc...\nI'm not 100% sure the history of using JWT for EL-\u003eCL, but presumably it's doing some pretty privileged things that you don't want random things to access...\nIt's never a super simple line to cross between UX and security, I'm not sure there's a single answer that'd make everyone happy to be honest",
        "created_at": "2022-09-01T05:34:41.363000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "a naive viewpoint would say 'obviously JWT was needed, so it should be on by default...' but i haven't challenged the assumption of whether it's needed...",
        "created_at": "2022-09-01T05:35:56.587000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "so i guess if a random process accesses the api, what happens is a question to ask... can someone do bad things that would cause issues?",
        "created_at": "2022-09-01T05:46:30.751000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e I think in terms of BN-\u003eVC, there's not really a lot that need to be behind a token, any privileged op is done by signing, so things are pretty safe...\nIf the BN feeds you a wrong attestation data to sign ( different source/target checkpoint) or potentially a block building on a fork rather than the canonical chain that would be an issue as there is no way for the validator to verify the correctness of the data , rather it just signs it. \n\n\u003e It's never a super simple line to cross between UX and security, I'm not sure there's a single answer that'd make everyone happy to be honest\nTrue, but I would rather the user make this choice than it being mandated by the spec. I fall into the camp of not needing JWT unless the EL and CL are on different machines otherwise its just another UX hurdle to climb",
        "created_at": "2022-09-01T05:47:15.432000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The engine api ? Yes, in that case it could potentially perform a FCU to some non-canonical execution block and confuse the EL",
        "created_at": "2022-09-01T05:48:08.861000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "and if you're feeding the CL rubbish payloads then they'll be producing bad blocks... so it does sound kinda bad",
        "created_at": "2022-09-01T05:49:27.861000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "same way tit works for the VC and BN , no ?",
        "created_at": "2022-09-01T05:49:59.744000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "*it",
        "created_at": "2022-09-01T05:50:01.850000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "if you feed the VC bad blocks it will also be an issue",
        "created_at": "2022-09-01T05:50:19.362000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "mm... so VC would get the block and sign rubbish, i guess, true",
        "created_at": "2022-09-01T05:50:21.623000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "both cases effectively would result in outage",
        "created_at": "2022-09-01T05:50:40.974000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "inactivity",
        "created_at": "2022-09-01T05:50:49.200000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "no firewall needed - all clients default to exposing the EL interface on 127.0.0.1 - they have to go out of their way to open it to the internet (by providing an option)",
        "created_at": "2022-09-01T05:51:04.392000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "the separate port already deals with the fact that users might want to be exposing the \"normal\" json-rpc interface to a wider audience, so again, the jwt file is just an annoying copy-paste hurdle at that point",
        "created_at": "2022-09-01T05:52:49.380000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "the _only_ technical difference I can think of is that a file is protected by filesystem permissions whereas a socket is not",
        "created_at": "2022-09-01T05:53:34.426000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "If you are running in Docker, for example, you have to expose wider.  Or if you are running CL on a different host from EL.  Or if you are a user and don't really understand what you are doing and you expose engine API port and JSON-RPC port (most likely failure mode).",
        "created_at": "2022-09-01T05:53:49.035000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The JWT token protects the user from shooting themself in the foot as it now requires them to fail on multiple accounts at the same time, rather than just one failure compromising their setup.",
        "created_at": "2022-09-01T05:54:12.760000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "different host is out of scope, as is docker - we're talking about the case where the authrpc socket _is_ bound to localhost",
        "created_at": "2022-09-01T05:54:25.819000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Are you arguing that if the client is bound to `127.0.0.1` then (and only then) would it operate without a JWT token?",
        "created_at": "2022-09-01T05:54:56.841000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "yes",
        "created_at": "2022-09-01T05:55:03.790000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "You still have the baked in assumption that everything on localhost that can make an outbound connection is trusted.",
        "created_at": "2022-09-01T05:55:22.974000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "this is the easier way to achieve \"no-config-startup\" than what was discussed in the call (namely standard locations for jwt secrets)",
        "created_at": "2022-09-01T05:55:56.707000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Given that on most OSs by default outbound connections are not blocked, a low-privileged application running on the host would be able to connect to an unauthenticated engine API bound to 127.0.0.1.",
        "created_at": "2022-09-01T05:56:02.714000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The current suggested specification for writing the token at least writes it to a semi-protected location (only accessible by the current user).  While not ideal, at least a process running on the host as a different user can't read the token.",
        "created_at": "2022-09-01T05:57:21.093000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "You still can get pwned by a process running as the same user, but I'm not sure how we can protect against that while also providing a \"simplified connection\".",
        "created_at": "2022-09-01T05:57:57.926000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "well, yes - as pointed out, the filesystem security is about the only difference - but that's pretty weak compared to the risk that _misconfiguration_ poses for non-technical users - ie a tin-foil hat option with poor UX has worse security outcomes often than a known failure mode .. creating a file in a well-known magic location is .. very weak",
        "created_at": "2022-09-01T06:28:46.331000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "What sort of failure modes are you imagining occurring due to user's needing to deal with the JWT?",
        "created_at": "2022-09-01T07:18:01.255000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "users giving up and moving to custodial services and/or opcost due to downtime",
        "created_at": "2022-09-01T07:23:21.493000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The merge is a few days off, if someone is going to give up and move things, that's already happened... so if thats the only worry that horse has left the stable...",
        "created_at": "2022-09-01T07:27:13.734000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I hope people will keep staking after the merge too (and / or running local nodes for sending transactions and checking their balance)",
        "created_at": "2022-09-01T07:35:30.445000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "what outcome are you hoping for? merge is about 5 days off... are you saying something needs to change prior to that?",
        "created_at": "2022-09-01T07:37:15.619000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "we discussed the matter on the last dev call (and in https://github.com/ethereum/execution-apis/pull/297) - it seems we're going out of our way to work around the UX fail that jwt secrets are, and it's worth stepping back and asking whether they are useful at all",
        "created_at": "2022-09-01T07:38:41.141000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "the merge is one thing, but we have to live on with the incessant support requests for a long time after that",
        "created_at": "2022-09-01T07:39:09.860000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I haven't seen anything i would call incessant, but im not against changing it, just questioning the timing, i'm not sure why we're only talking about it now if it's been causing issues",
        "created_at": "2022-09-01T07:40:58.846000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The proposed feature is, IIUC, really only meant to make it easier to setup testnets quickly/easily.  Is your argument here that we should make it easier to setup *mainnet* clients?",
        "created_at": "2022-09-01T07:41:29.509000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I don't see the distinction (neither in previous discussions, the linked issue, nor why it should make a difference)",
        "created_at": "2022-09-01T07:43:34.467000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "much in line with Micah's comment on the ticket, my preference would be security by default which would mean people would maybe have a flag to disable the JWT but it's not 'off' by default... and that half-defeats the purpose if it's to improve UX, because they'd need to find yet another flag",
        "created_at": "2022-09-01T07:44:00.917000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "It was the argument made on the call I believe (or maybe it was in the discussion thread).  There was a desire to make it dead simple to throw up a testnet setup where both clients are on the same host, run by the same user (e.g., two terminal windows).",
        "created_at": "2022-09-01T07:44:49.871000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I don't think the authors are arguing that there is a need to make it *simpler* to setup mainnet clients (though maybe they are also hoping for that as a side effect).",
        "created_at": "2022-09-01T07:45:24.850000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "This isn't to say the argument can't be made, I just was trying to get clarity on what *you* are arguing for is all.",
        "created_at": "2022-09-01T07:46:18.199000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "it's only now that we can assess the non-developer impact (because it's only now that users are actually upgrading) - and it's causing problems for them, in a way that adds little to no security, for _most_ setups - most of them have a dedicated machine running both an EL and a CL and _nothing else_ - the validator keys are on that same machine, so they're being kept clean as general hygiene - the EL-CL link is just one of many things where there is risk (the vc-bn link being the other obvious candidate)",
        "created_at": "2022-09-01T07:47:41.984000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "one initial reason for going with jwt was that there was a risk that the ordinary json-rpc interface (that users use for their wallet) would be exposed - this has been solved by having a dedicated engine interface that does just engine and nothing else",
        "created_at": "2022-09-01T07:48:39.920000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "My expectation/hope is that there are *far* more people running Ethereum client pairs than just stakers.  Perhaps the difference of opinion here is the demographic each of us are targeting?",
        "created_at": "2022-09-01T07:48:42.355000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "For example, I don't run staking on my desktop (which is definitely not a high security machine), but I do run a local client (soon client pair).",
        "created_at": "2022-09-01T07:49:25.647000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "IMO especially for non-technical users, we want to be secure by default and not expect them to do their research",
        "created_at": "2022-09-01T07:49:25.799000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\"secure\" in this case means \"copypaste this random option to make it work\" - it's the \"secure\" part in that, that I'm questioning: so far, \"rougue processes running as a different user\" is the key threat",
        "created_at": "2022-09-01T07:50:27.680000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "i think that's overselling it to be honest... its an option pointing to a jwt file that was probably generated by a client... im not sure you can say 'randomly copy paste to make it work'",
        "created_at": "2022-09-01T07:51:10.431000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "all-in-all, I'm not completely against being able to disable it if it's causing issues and its only to localhost.. if it is causing issues, then it's a shame we've only identified it this late in the game, as we've basically completely missed the target date for having something people could consume if it's as bad as you're indicating...",
        "created_at": "2022-09-01T07:53:20.981000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think long term, the ideal solution is a launcher that creates a JWT in memory, and passes it to both clients it launches as subpresses via environment variable.",
        "created_at": "2022-09-01T07:56:09.710000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Completely hidden from the user, and about as secure as I think we can get.",
        "created_at": "2022-09-01T07:56:36.113000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "a launcher is yet another unwelcome part that introduces complexity and failure modes in setup - in this case, the aim is to remove complexity, not hide it behind a curtain 🙂 I imagine that for non-validator use cases, EL:s will soon start integrating their own consensus engines (perhaps base on light clients, since these now make sense - we have one that is a step away from becoming a C library you simply plug into your build)",
        "created_at": "2022-09-01T08:02:51.290000+00:00",
        "attachments": []
    },
    {
        "author": "parithosh",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I remember the prysm team had brought up allowing string secrets to be passed as a flag, letting the client convert it into a jwt token while allowing the user to have a memorable and easy to configure secret without extra steps. \n\nWould that approach address some of the complexity arguments? (At the risk of shifting complexity into clients, but that's more testable anyway)",
        "created_at": "2022-09-01T08:04:39.378000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think for different demographics, a launcher may be better or worse.  For Joe Six Pack, being able to \"double click\" a thing and have it take care of the rest is pretty important.  Running *anything* from a CLI is absolutely out of the question, and you can forget any kind of configuration requirements.  For this user, a launcher is a big win.  Especially if the launcher automatically downloads a client for you (ideally picking a minority client) so you just have to download/install a single digit MBs launcher binary/installer and it will do everything else in the background and give you a little desktop notification when it is ready to be used.",
        "created_at": "2022-09-01T08:06:59.478000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "For a more advanced user, I agree that a launcher adds a layer of abstraction that makes it harder to debug issues.",
        "created_at": "2022-09-01T08:07:20.364000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "We should totally call the launcher joe six pack…",
        "created_at": "2022-09-01T08:12:25.838000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "fwiw, that \"launcher\" these days is called docker (or dockercompose or whatever it is), and the end result is that launchers today (ie dappnode that bundle el and cl) hardcode a dummy jwtsecret just to make things work out-of-the-box - it doesn't provide any security in this case, just additional failure modes",
        "created_at": "2022-09-01T09:00:55.385000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I don't see anything in the ticket that limits it to testnets, but above all, it's an odd distinction to make to begin with - we're saying we're not fine inflicting a little damage on a few developers (even if they have to do it a thousand times, they're familiar and can script it), but we're fine inflicting a hundredfold damage (because users have to read and understand what the bother that stands in their way is) on thousands of users",
        "created_at": "2022-09-01T09:04:05.511000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "string secrets in flags can readily be seen in `ps` so they add no security at all typically",
        "created_at": "2022-09-01T09:05:42.912000+00:00",
        "attachments": []
    },
    {
        "author": "parithosh",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yes, but it cannot be done from outside localhost(typically). So it'll provide a simple way to avoid users from shooting themselves in the foot if they expose the engine api by mistake.",
        "created_at": "2022-09-01T09:54:44.328000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "but then we have to ask again: what are we protecting against really? is it reasonable to expect that the amount of security gained offsets the complexity it introduces (compared to the security gained by keeping the rpc connection on a separate port and bound to localhost only by default)? since the flag does not help localhost users, why is it there _for_ localhost users?",
        "created_at": "2022-09-01T10:04:00.315000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "From my understanding, the original concern went along the lines of \"lots of users accidentally expose their execution JSON-RPC port to the outside world, and it is a known security issue.  The potential of stakers of exposing their engine JSON-RPC port is similar, and has a higher impact, so provide some additional security in that situation.\"\n\nI would also say that regardless of if it is ultimately a good or bad idea, it's here now and attempting to remove it will likely cause more problems than it solves.",
        "created_at": "2022-09-01T11:09:59.047000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "this was back before we had a separate port for it, more or less - changing it is backwards compatible (it does no harm to remove the requirement, to existing setups) - but it does make life easier when teaching users",
        "created_at": "2022-09-01T11:25:30.221000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I suspect it will confuse users, when there are lots of guides talking about it but it suddenly becomes optional.  Many users who have already configured their servers will come back with new questions.  I don't see it being a net positive in the time prior to the merge.",
        "created_at": "2022-09-01T12:10:43.261000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah, baking in a well known secret is a bad idea, I agree.  I don't think docker-compose is the same as a launcher at all.  I don't expect Joe Six Pack to have Docker installed or have any idea what it is, how to use it, how to interact with it, etc.",
        "created_at": "2022-09-01T12:11:45.978000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I don't think a separate port solves the problem of users exposing their engine API port to the world on accident.  A user may just see the internet say \"here are the ports that Geth listens on\" and open all of them thinking they are all needed.",
        "created_at": "2022-09-01T12:14:06.217000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think the argument in favor of a shared secret when the engine API is bound to 127.0.0.1 is incredibly strong.\nI think the argument in favor of a shared secret when the engine API is bound to any other interface is much weaker (but I still think it is there).",
        "created_at": "2022-09-01T12:15:10.058000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I don't necessarily think we need to change it now - but we are discussing ways to improve the UX over time (for example on the dev calls) - simplifying the experience is valuable after the merge also (for example by taking into account the lessons learned here about jwtsecret being a stumbling block for many would-be home stakers and users in general)",
        "created_at": "2022-09-01T13:16:25.331000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "so just to clarify, when a socket is bound to 127.0.0.1, it is not open to the world - you can't access it from outside any more than you can access a file on the filesystem - in order to open it to the world, you have to provide a special magic flag to the execution client, which then binds to either a real interface or all interfaces and thus opening up the socket to the world - this takes an explicit user action - in fact, _because_ users now have to copy-paste arbitrary flags they don't understand (jwtsecret) from guides, it's also an opportunity for unscrupolous guide authors to sneak in other flags such as those opening the authrpc to the internet - putting up arbitrary obstacles between a user and their goal is rarely a good security investment - it's a double-edged sword at best",
        "created_at": "2022-09-01T13:20:23.369000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "TL;DR: I don't think trusting everything on 127.0.0.1 is safe in all contexts, and filesystem access is *more restricted* than localhost network access in some contexts.\n\nLet's take Windows UWP apps (their new API, usually used by apps on the Microsoft Store) as an example scenario.  They are reasonably well sandboxed with explicit permission grants (similar to mobile apps) with restricted access to the filesystem unless they explicitly ask for it and the user grants it.  However, I don't believe this sandboxing puts the app on a different network from the rest of the OS, so such an app can connect to 127.0.0.1.  A user may install Windows Store Apps pretty freely, relying on the OS sandboxing to protect them and this would be a generally reasonable strategy.  However, if we open up a server that listens on 127.0.0.1 then a malicious app that is otherwise well sandboxed can now interface with that server.",
        "created_at": "2022-09-01T14:01:01.334000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "https://social.msdn.microsoft.com/Forums/en-US/9499448d-89d8-4675-ba70-0af9f4506ba1/connecting-to-localhost-from-windows-store-app?forum=winappswithcsharp",
        "created_at": "2022-09-01T14:31:45.264000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Ooh, good find, I didn't know that!",
        "created_at": "2022-09-01T14:36:24.206000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "in general, I do agree that filesystems are more secure than a socket localhost - this is indisputable - the question here is whether they are meaningfully more secure to outweigh the other risks (user error, copy-paste sickness, giving up altogether, etc) and whether jwt helps in any other situation - _specially_ in the context of providing a default location for the file (which presupposes that the same user is used for EL and BN which means that it's likely to be a regular user with a home directory and not an isolated service user which means that it's likely _other random processes_ are running as that user which means that the security argument for filesystems is .. void)",
        "created_at": "2022-09-01T14:40:02.074000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "cc \u003c@211091239112671234\u003e that was part of the initial discussions",
        "created_at": "2022-09-01T14:42:59.601000+00:00",
        "attachments": []
    },
    {
        "author": "holiman",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Lot of discussion here, maybe I missed something. But. We are protecting clumsy users. Users who mash up random parameters from the internet. We want to hinder them from exposing the engine api on the internet. \n\nNot protecting against evil processes or other users on the same os.",
        "created_at": "2022-09-01T14:46:31.856000+00:00",
        "attachments": []
    },
    {
        "author": "holiman",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Sockets bound to 127 are not often used, because if you run docker you want to expose it. So you bind to 0.0.. . And then it's up to your docker skills if you properly segment that network or not",
        "created_at": "2022-09-01T14:49:25.035000+00:00",
        "attachments": []
    },
    {
        "author": "holiman",
        "category": "Consensus Layer",
        "parent": "",
        "content": "And docker can bypass the linux firewall too : https://nitter.net/mhswende/status/1488228101523968009#m. \n\nAll in all, lots of footguns setting up privileged api access.",
        "created_at": "2022-09-01T14:52:41.955000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I believe the primary argument that \u003c@449019668296892420\u003e is making is that if the client binds the engine API to 127.0.0.1 (and nothing else), then the engine API should be entirely open (no JWT required).",
        "created_at": "2022-09-01T16:14:10.237000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "If you bind to something else (such as in the docker scenario), then you would still need a JWT.",
        "created_at": "2022-09-01T16:14:27.538000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The goal is to have a special case for people running locally (no docker, no other infrastructure, just double-click the icon), they would just have to double-click both clients and that is it.  Everything would work out of the box with no additional setup/configuration.",
        "created_at": "2022-09-01T16:15:31.858000+00:00",
        "attachments": []
    },
    {
        "author": "holiman",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Anytime you can do that, couldn't you use ipc sockets aswell?",
        "created_at": "2022-09-01T16:16:07.685000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "If you are using docker or running across hosts, then you would bind to something other than 127.0.0.1 (i.e., not the default) and then we would still require the JWT to protect from the foot guns you described.",
        "created_at": "2022-09-01T16:16:09.309000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Not all clients support IPC.",
        "created_at": "2022-09-01T16:16:16.594000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "And if you \"double click\", you won't listen on IPC presumably as I think it is off by default (though maybe some clients have it on by default)?",
        "created_at": "2022-09-01T16:16:32.311000+00:00",
        "attachments": []
    },
    {
        "author": "holiman",
        "category": "Consensus Layer",
        "parent": "",
        "content": "But... It's basically zero setup as is. Just tell both to use /foo/bar/gazonk",
        "created_at": "2022-09-01T16:17:32.168000+00:00",
        "attachments": []
    },
    {
        "author": "holiman",
        "category": "Consensus Layer",
        "parent": "",
        "content": "First one creates it",
        "created_at": "2022-09-01T16:17:39.167000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\"Tell them to...\" is setup.",
        "created_at": "2022-09-01T16:17:44.399000+00:00",
        "attachments": []
    },
    {
        "author": "holiman",
        "category": "Consensus Layer",
        "parent": "",
        "content": "If both are spec compliant",
        "created_at": "2022-09-01T16:17:49.095000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "We are talking about people who just double-click on a binary with zero configuration.  The goal is to make it so that \"just works\".",
        "created_at": "2022-09-01T16:18:05.067000+00:00",
        "attachments": []
    },
    {
        "author": "holiman",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah, you need to tell them to start, for example",
        "created_at": "2022-09-01T16:18:12.859000+00:00",
        "attachments": []
    },
    {
        "author": "holiman",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Ah ok.I get it",
        "created_at": "2022-09-01T16:18:58.600000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Right, but double click the geth icon on your desktop is notably different from \"open a command prompt, navigate to geth install directory, type `./geth --jwt-path /foo/bar/gazonk`.",
        "created_at": "2022-09-01T16:19:10.731000+00:00",
        "attachments": []
    },
    {
        "author": "holiman",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Is jwt the only blocker?",
        "created_at": "2022-09-01T16:20:13.728000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The option proposed by lightclient was to have a \"standard\" location on disk that the token was written to so clients could go look for it there.  \u003c@449019668296892420\u003e counterproposed that we should just make 127.0.0.1 binding not require authentication.",
        "created_at": "2022-09-01T16:20:14.816000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I believe so?  I think most clients default to `mainnet` config which has reasonable defaults for everything, so the *only* parameter you need to supply is the JWT token path.",
        "created_at": "2022-09-01T16:20:37.315000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Would be good to get a clear answer from other clients on this to confirm/deny my claim here, but I *think* that is largely the case?",
        "created_at": "2022-09-01T16:21:03.106000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "presently yes, for nimbus",
        "created_at": "2022-09-01T16:24:01.595000+00:00",
        "attachments": []
    },
    {
        "author": "holiman",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah it all makes sense to me.",
        "created_at": "2022-09-01T16:26:14.957000+00:00",
        "attachments": []
    },
    {
        "author": "holiman",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I don't think I would oppose unauth 127.0.0.1",
        "created_at": "2022-09-01T17:00:53.063000+00:00",
        "attachments": []
    }
]