[
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "i think rather than that i'd probably just let a range be specified in keys, like `?id=1,2,3`, `?id=1-1000,2000-3000`, or could have a separate query parameter if that made it easier for ppl...\nIt does kind of sound like there could be more specialized apis. eg. if ppl were querying the list to see slashed validators, then i'd potentially prefer to just have an api that lists some details about slashed validators...\nTo me the `/eth/v1/beacon/states/{state_id}/validators` endpoint should almost live in debug along with the raw state and when specific things are needed they could be addressed properly, but that horse has probably bolted I guess.\nOr even if it just had the summary, and not the actual validator details, and you could fetch the individual validator if you wanted that extra data...",
        "created_at": "2022-07-07T07:02:16.398000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think that's a very niche case.\n\nDo we have specific requirements here from people who are struggling with the existing API?",
        "created_at": "2022-07-07T07:46:42.581000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The idea was to make it as simple as possible. We as teku team aren't directly in contact with them, but I think you're right: asking for their use cases could give us insights to enhance in a useful direction (and address some bad habits too). Going to try to make it happen",
        "created_at": "2022-07-07T08:32:18.681000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think the key issue is that the current API returns about 300Mb of JSON and requires loading the majority of the state to service.  It's a pretty expensive query to respond to. We've also had some users ask about paging (because handling 300Mb of JSON often needs some special care to ensure it doesn't blow out to a huge amount of memory when parsed), but mostly it's just a really expensive thing for the server in processing and bandwidth costs.",
        "created_at": "2022-07-07T09:40:02.295000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "So the requirement is to have a limit on the size of the data returned?  Would adding the ability to return the data as SSZ address this?\n\n(Regarding loading the state, wouldn't that be required anyway even if it was just a single validator being requested, or are there optimizations internally that make this a much cheaper operation?)",
        "created_at": "2022-07-07T09:51:28.821000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "There are optimisations such that loading a single validator only requires loading that validator (plus some merkle tree nodes leading to it which makes it really fast and lightweight).  I'm not sure how much adding optional features like SSZ is going to help because people may still wind up requesting JSON all the time. But certainly we'd need a more lightweight option on offer and then have a conversation about whether to keep supporting the full JSON output for all validators. At some point just the bandwidth usage probably becomes untenable. That isn't actually my call though.",
        "created_at": "2022-07-07T09:54:49.531000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "We have certainly had some requests for paging from users of the API as well so it's worth understanding what drives that and the use cases so we can make sure to solve for it. Maybe that becomes the more lightweight option, or maybe we need something else.",
        "created_at": "2022-07-07T09:55:43.118000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think there's also more work to be done on our side to fully understand what is costing so much in terms of serving the requests and what we could do about it. Certainly for handling a few requests it's totally fine but when you start getting a bunch of requests for various different finalized states all at one it seems to become a lot more problematic.",
        "created_at": "2022-07-07T09:57:29.930000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "My main worry with pagination/filtering is that it ends up with users (and beacon nodes) in a worse situation than where they are now, by not understanding they they aren't doing the Right Thing (which in turn can be based upon the specific beacon node implementation).  Knowing the specific requirements will give us more of a chance of working out the best way forward, as tbenr mentioned.",
        "created_at": "2022-07-07T10:01:36.253000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah I don't think pagination is going to be the answer if these requests are coming from something like chaind and it's going to walk through every page anyway. It *maybe* helps a little by spreading the load more but will likely wind up increasing the total load which is suboptimal.",
        "created_at": "2022-07-07T10:04:23.633000+00:00",
        "attachments": null
    }
]