[
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "it looks like https://github.com/ethereum/beacon-APIs/pull/271 is stable now, I can't really review it currently (holidays) - if another maintainer can cast an eye over it?",
        "created_at": "2022-12-16T22:00:16.771000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Structure and content seems good.  I had a few thoughts on it:\n  - not sure of the \"eip4844\" moniker, but if it's accepted that this is a placeholder until the hard fork in which this lands is decided and has a proper name, then fair enough\n  - there are a fair few magic numbers in there, but as long as people are comfortable with them I guess it's okay (they're generally constants from the spec, but not sure if any would be different in a minimal config from the mainnet one)",
        "created_at": "2022-12-16T23:01:45.138000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "And on a more general point (this applies to capella as well), but it seems that thanks to the consensus spec ordering we're going to end up with some oddities in the API spec.  In particular, we have a `BeaconBlockBodyCommon` that no longer holds all of the common entries between `BeaconBlockBody` and `BlindedBeaconBlockBody`, but instead just holds the first howevermany items before the `ExecutionPayload`/`ExecutionPayloadHeader`, and then the following items (at current just `BLSToExecutionChanges`, but I'd imagine it may also grow over time).\n\nMay just be one of those things that we accept and move on, as it would take a change in the consensus spec to move the field around and so upset the SSZ encodings.  But if anyone feels strongly enough about it to tackle it, probably one of those \"sooner the better\" items (note that this has already happened on the execution payload side, where `excess_data_gas` is in the common section because it was inserted above the fields that differentiate the payload from the payload header).",
        "created_at": "2022-12-16T23:04:40.405000+00:00",
        "attachments": null
    }
]