[
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003c@340345049063882753\u003e thanks a lot for the feedback on https://github.com/ethereum/beacon-APIs/pull/226, It looks like I have addressed all of your comments. Sorry for being slow on that",
        "created_at": "2022-09-07T12:00:28.679000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "A related question. Is `/eth/v1/beacon/states/finalized` call equal to `/eth/v1/beacon/states/{get_block_by_root(finalized_checkpoint.root).state_root}`?",
        "created_at": "2022-09-07T12:28:52.129000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Was looking through the beacon-apis, and this particular endpoint confused me:\nhttps://ethereum.github.io/beacon-APIs/#/ValidatorRequiredApi/publishBlindedBlock\n\nHow is this supposed to work ? You cant publish blinded blocks as you need a full bellatrix block with all the transactions in it in order for it to be a valid gossip object. How is the beacon node supposed to find the list of transactions ?\n\u003e Instructs the beacon node to use the components of the SignedBlindedBeaconBlock to construct and publish a SignedBeaconBlock by swapping out the transactions_root for the corresponding full list of transactions. \n\nIs it expected the beacon node has this list out of band ? Trying to understand the rationale for this endpoint",
        "created_at": "2022-09-07T13:09:00.423000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I guess this endpoint is for integration with builder-api (mev-boost)",
        "created_at": "2022-09-07T13:10:23.221000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "This is twinned with https://ethereum.github.io/beacon-APIs/#/ValidatorRequiredApi/produceBlindedBlock, which provides a blinded block.  If a beacon node is asked for a blinded block then it can do so either by fetching the execution payload header from an MEV relay, or by fetching a full execution payload from an execution node and retaining the execution payload and returning the header.",
        "created_at": "2022-09-07T13:12:14.581000+00:00",
        "attachments": null
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Gotcha, so if the beacon node gets the `publishBlindedBlock` request and isn't connected to a relay, then the correct thing would be to just return an error correct ? As without the tx list, it can't really do anything.",
        "created_at": "2022-09-07T13:14:51.722000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Well in that situation the beacon node will have the tx list from the execution node, so it could hold that list in preparation for receiving the signed beacon block header and reassembling the block.  But I'm not sure if it _should_ do that or not.",
        "created_at": "2022-09-07T13:21:57.816000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Consensus Layer",
        "parent": "",
        "content": "the `{Blinded,}` distinction exists to signal if the validator wishes to use the local or remote pathways for block building -- you could use the blinded pathway for local building but i don't think it is a good idea so we can keep separate concerns separate (so less surface for bugs, etc)",
        "created_at": "2022-09-07T17:50:21.706000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yes it should be.",
        "created_at": "2022-09-07T21:35:48.809000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I'd disagree with this. It would be really nice to move the VC over to always using blinded blocks (or even just block headers) rather than having to round trip a whole bunch of block data through the VC for no reason.  If you're not an external builder and are using multiple beacon nodes it may make sense to still use full blocks (so you can publish to a node that didn't create the block) but that seems like more of the exception than the rule.",
        "created_at": "2022-09-07T21:38:34.710000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "It's a pretty big exception, though, so I'd hate to see fetching blinded blocks become the primary method of doing things.  Even with a single beacon node it makes the interaction stateful, whereas with full blocks it remains stateless and so (for example) resilient to the beacon node crashing and restarting.",
        "created_at": "2022-09-07T21:41:43.570000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah it definitely has downsides. I wouldn't want to drop support for the unblinded block endpoints but since we have to support the blinded versions to make external builders work it would be nice if they worked all the time - especially since they have to work with the local EL anyway in case the external builder isn't available and the beacon node falls back to the local EL.",
        "created_at": "2022-09-07T21:45:41.446000+00:00",
        "attachments": null
    }
]