[
    {
        "author": "metachris_",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Makes sense, and thanks for the context 👍 The best next step would probably be to add the SSZ version as possible `getPayload` request payload to the builder spec.",
        "created_at": "2022-05-21T07:27:12.221000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Looking back a bit, there was an original discussion about whether the beacon API should use a native binary format, or use a native JSON format.\n\nThe benefits of the binary format were: size of data on the wire, CPU required for the codec.  The benefits of the JSON format were: human readability, standard tooling, ability to use middleware (caching, load balancers _etc._).  In retrospect, we were possibly talking at cross purposes because on one side we were talking about format and the other protocol.  If we have a REST service as per the current beacon API but allow the payload to be SSZ-encoded we gain a lot of benefits from both sides.\n\nI'm not suggesting that the API should be SSZ-first, because the human readability is great feature and becoming more commonly used to allow individual stakers to write their own health check systems, for example.  But if SSZ became an option for all endpoints, making it a first-class encoding option, it could help especially as some responses (validators, beacon block) become larger.\n\nOf course, this dumps more work on the already overburdened shoulders of the client devs.  At some stage I'll do some analysis to understand how much work this may be to get to various stages of compatibility with this idea, at which point it can be kicked around seriously to decide which bits of it should be mandatory and which optional.",
        "created_at": "2022-05-21T07:38:05.439000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I agree with the sentiment, and the scope also... there's definite wins to have the 'validator required' supporting SSZ, initially i've mostly concentrated on the block creation process because its a very obvious improvement, and helps us map out the usage i guess...",
        "created_at": "2022-05-21T22:04:57.419000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "in terms of builder, i think anything it's doing should probably support SSZ if at all possible. Your calls are very time dependent and this will definitely help improve your outcomes...\nJust make sure it can fallback to json for your own sanity maybe... and using headers correctly (allow multiple types in Accept headers, setting Content header on POST) will help a lot... I guess the reason for chasing down the 415 was to make sure appropriate responses can be set on POST because on GET the consumer has the capability to request an alternative but on POST its not able to recover if SSZ is sent and can't be read by the server.",
        "created_at": "2022-05-21T22:12:49.066000+00:00",
        "attachments": []
    }
]