[
    {
        "author": "__kasey__",
        "category": "Consensus Layer",
        "parent": "",
        "content": "haven't thought it through but off the top of my head I guess the main hangup to treating a static web server as a beacon node api for the purposes of just GET requests would be content type negotiation. so if you could say \"we only deal in ssz\", that could work.",
        "created_at": "2022-06-29T01:35:37.711000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Static web servers can do content negotiation fine, though it is configuration that's really unnecessary.  Supporting retrieval of the state as JSON isn't a great idea given the size - in SSZ it's about 50Mb, but it's about something crazy like 300Mb of JSON even without pretty printing.",
        "created_at": "2022-06-29T01:38:24.550000+00:00",
        "attachments": []
    },
    {
        "author": "__kasey__",
        "category": "Consensus Layer",
        "parent": "",
        "content": "i meant they can't automatically serve json from an ssz source",
        "created_at": "2022-06-29T01:39:04.157000+00:00",
        "attachments": []
    },
    {
        "author": "__kasey__",
        "category": "Consensus Layer",
        "parent": "",
        "content": "esp with the extra packaging in our json responses",
        "created_at": "2022-06-29T01:39:23.701000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah but I think that's fine.  Serving it as JSON is just crazy. We don't want the REST API or anything like it really, we just want to get the initial state.",
        "created_at": "2022-06-29T01:39:44.139000+00:00",
        "attachments": []
    },
    {
        "author": "__kasey__",
        "category": "Consensus Layer",
        "parent": "",
        "content": "right that's what i meant re set the constraint that you only serve ssz, i think that'd be fine",
        "created_at": "2022-06-29T01:40:04.293000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think one of the key things here is to move to thinking about the URL you'd provide to checkpoint sync as being just a plain URL, not the root of some API, but just a URL straight to the single resource you need. That doesn't really work if you need to get multiple resources but it's another part of the simplicity you get when you have a single file.  We'd likely recommend people use a standard path that's nice and simple, but that can just be convention (thus making it simple to point to things in github or aws buckets or whatever).",
        "created_at": "2022-06-29T01:44:04.516000+00:00",
        "attachments": []
    },
    {
        "author": "__kasey__",
        "category": "Consensus Layer",
        "parent": "",
        "content": "what is the background for bundling the deposit merkle tree snapshot with checkpoint sync state and/or root?",
        "created_at": "2022-06-29T01:50:24.173000+00:00",
        "attachments": []
    },
    {
        "author": "__kasey__",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I don't think we have a problem with the current approach of pointing at the base url and getting block and state from the same place, so defining a convention for bundling those in tar is not appealing.",
        "created_at": "2022-06-29T01:51:26.984000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I'm not sure about bundling the deposit merkle tree snapshot, but with EIP4444 we eventually won't be able to rebuild the whole merkle tree from log events since the EL will prune them. So to get started we'll wind up needing a merkle tree snapshot of some from, from some source. Seems like it makes sense to pull it down with the initial state since the two need to be in sync anyway.",
        "created_at": "2022-06-29T02:28:02.625000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The problem with is is that it requires the beacon REST API to be provided, but the REST API isn't designed to be served as public endpoints. So if that's the only source of initial state, there's going to be exceedingly few state providers.  If we simplify what it takes to provide the state, it becomes far more likely that other infrastructure providers would do so (eg block explorers). \nSo it's not about making it easier for client teams, it's about client teams making it easier for state providers. Otherwise we're likely to be stuck with Infura as the only provider and we've got a major point of centralisation.",
        "created_at": "2022-06-29T02:30:48.728000+00:00",
        "attachments": []
    }
]