[
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "So I think it'd be bad if we end up in a stage in which removing support for some forks add code complexity in the current fork. I very much like the idea to just remove code, but if I need to start adding conditional checks and keep the code otherwise that's the worst possible combination",
        "created_at": "2023-10-27T01:49:52.522000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "agree on \"if I need to start adding conditional checks and keep the code otherwise that's the worst possible combination\", but also see the value in removing older code.\n\nNimbus simply does not support web3signer earlier than Bellatrix, nor Builder earlier than Capella anymore, and it does this by removing code, only having remaining `if`/`case` statements where it's sort of incidentally required by Nim's type system (comprehensive enum coverage etc).\n\nBut for example, various block proposal beacon APIs still allow proposing phase0/altair blocks, and, why? There's some weirdness there in the blinded block stuff too, because there aren't \"blinded\" phase0/altair blocks, so the early forks are treated specially by the API, in calls added/only used after the forks themselves were obsolete, for the same of supporting all forks. Truly unfortunate",
        "created_at": "2023-10-27T06:07:25.387000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "the blinded APIs should simply have not supported phase0/altair to start with, ever",
        "created_at": "2023-10-27T06:07:41.184000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Agreed, it wouldn't need to be conditional in the code, just a case of removing the older fork-related code from the next client release after the future fork goes live.",
        "created_at": "2023-10-27T07:03:14.085000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "one concern here is, and this isn't yet a concern because through Deneb one can still run unmerged, from what I can tell, is there a reason to keep support for older forks for that reason. but at this point, even if one wants for whatever purpose to run an \"Ethereum\" network without an EL/payloads/etc, can still use current forks, which work better regardless than phase0/altair",
        "created_at": "2023-10-27T07:27:34.929000+00:00",
        "attachments": []
    }
]