[
    {
        "author": "jimmygchen",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Thanks for the comments \u003c@680234424037670912\u003e , I'm new to the key management API spec, so keen to hear any feedback and happy to make changes to make it consistent!",
        "created_at": "2023-03-24T00:07:50.805000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I'm just not sure how we make it so its non trivial to stuff up...I'd be interested in peoples opinions.. the only thing i can think of is an optional query parameter that you have to explicitly set to \"yes\" or \"true\" or whatever, and if thats not set the exit wont process.. so 'trying it' wont exit you unless you set that param",
        "created_at": "2023-03-24T00:27:12.263000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "so if you run `/voluntary_exit` it'll report that it needs confirmation, but if you run `/voluntary_exit?confirm=yes` then it'd actually process - programatically you can just do it easily, and if you're playing with the swagger-ui you'd have to explicitly click the 'confirm' to let it run...",
        "created_at": "2023-03-24T00:30:49.985000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": ".. input from \u003c@144468805697929216\u003e \u003c@884836500037066862\u003e \u003c@602753420033785856\u003e \u003c@654267572107083777\u003e \u003c@308223150725005322\u003e \u003c@688748669268132001\u003e and anyone else that might feel inclined to offer an opinion on reducing the chances of someone running this api on their validator accidentally?",
        "created_at": "2023-03-24T00:32:56.179000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus Layer",
        "parent": "",
        "content": "yeah I think some sort of explicit opt-in is important, we were chatting about this internally as well",
        "created_at": "2023-03-24T00:33:31.546000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "sorry for the near-channel slap 🙂",
        "created_at": "2023-03-24T00:33:50.759000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus Layer",
        "parent": "",
        "content": "the highest barrier would be a CLI flag required to enable it, but that's also moving us further towards config hell",
        "created_at": "2023-03-24T00:34:15.920000+00:00",
        "attachments": []
    },
    {
        "author": "sproul",
        "category": "Consensus Layer",
        "parent": "",
        "content": "query parameter is probably a good middle ground",
        "created_at": "2023-03-24T00:34:37.003000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "i'd be happy with it being enabled by default, but at a min having an optional query param",
        "created_at": "2023-03-24T00:34:41.951000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "but also, if ppl want it off by default and to cli, they could - i just think we've got so many already i'd probably live with the param",
        "created_at": "2023-03-24T00:35:04.258000+00:00",
        "attachments": []
    },
    {
        "author": "jameshe5018",
        "category": "Consensus Layer",
        "parent": "",
        "content": "we are already fighting config hell lol was discussing internally on the issue , somehting to look at in the near future",
        "created_at": "2023-03-24T00:42:00.705000+00:00",
        "attachments": []
    },
    {
        "author": "jameshe5018",
        "category": "Consensus Layer",
        "parent": "",
        "content": "also agree with some kind of explicit opt in",
        "created_at": "2023-03-24T00:48:54.989000+00:00",
        "attachments": []
    },
    {
        "author": "jimmygchen",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I've created a PR for this, thanks for the inputs so far! 🙏  \nhttps://github.com/ethereum/keymanager-APIs/pull/58",
        "created_at": "2023-03-24T04:33:55.699000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Can't say that I'm a fan of having a flag on the API for confirmation, it is a POST after all so you'd expect it to change things when sending and this sort of thinking can expand to many other operations relatively easily as they all have some variety of impact.  It's likely to end up encoded in all of the methods that call the API (especially as there is no non-error path without the flag) so will just be sent with every request regardless.\n\nBut I'm not really involved with the keymanager API, so fee free to ignore.",
        "created_at": "2023-03-24T08:25:37.190000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "sure, my first instinct reading this is that \"ideally additional security on the clients (such as command flags).\" is something that we'd probably try to avoid if feasible, and (switch voices here to my own views, which are a bit more opinionated) I'm quite wary of a proposal which has as a submarine of sorts, oh, and it needs a bunch of new config to just not be unsafe but to look better, it won't be too specific about what",
        "created_at": "2023-03-24T09:04:50.698000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "if this goes in to the spec and it really is that unsafe without a command-line flag, I guess, well, okay.",
        "created_at": "2023-03-24T09:05:59.057000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "it seems like this at least wouldn't need additional BN state? just, no confirm=yes ==\u003e error, confirm=yes =\u003e do operation?",
        "created_at": "2023-03-24T09:09:33.859000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "it'll need to query epoch to fill that in if its not supplied, but should be fairly simple.. i think the auth relates to the existing keymanager auth that already is present.. that was my understanding anyway..",
        "created_at": "2023-03-24T09:20:06.232000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "its likely VC's are listening on eventStream and know the epoch already, so that could be an option",
        "created_at": "2023-03-24T09:20:55.619000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I don't really see the purpose of the confirmation query parameter. In CLI apps we usually issue a warning *after* the user initiates an operation, and confirming is a second step. The warning is there to allow the user to back out from the operation. The semantics of an API query parameter are different. We only have a single step, so you either go through with the operation when including the query param or you don't when not including it - the param doesn't add any value. I don't ever see a reason for anyone to invoke the endpoint without the query parameter because it will just fail (which, again, doesn't work that way in a CLI app). In my opinion it is redundant.",
        "created_at": "2023-03-24T11:41:40.522000+00:00",
        "attachments": []
    }
]