[
    {
        "author": "radekkapka",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Hello! In Prysm we store states indexed by block root, which means there is no easy way to use https://ethereum.github.io/beacon-APIs/?urls.primaryName=dev#/Debug/getStateV2 when providing a state root. What we do is support only the last `SLOTS_PER_HISTORICAL_ROOT` states because we can find the associated block root and then get the resulting state by that block root. We have had several requests from users to allow arbitrary roots, which will require a new index in the DB, but we are hesitant to implement this.\n\n\u003e Yes, rather than add in another bucket to our db schema, it would be preferable to figure out if there is a better solution here. If you add in state roots for each block, the bucket becomes pretty big( 6 million keys). There is a cost to having this as part of block processing as it becomes slower for having to do a db write\n\nAs an alternative, the endpoint could allow passing block roots in addition to state roots. So the parameter would become `state_or_block_id` described as `State or block identifier. Can be one of: \"head\" (canonical head in node's view), \"genesis\", \"finalized\", \"justified\", \u003cslot\u003e, \u003chex encoded stateRoot with 0x prefix\u003e, \u003chex encoded blockRoot with 0x prefix\u003e.` I am interested in knowing if anyone would support this change.",
        "created_at": "2023-06-29T10:53:45.811000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Consensus Layer",
        "parent": "",
        "content": "By the way, the description of `block_id` doesn't include \"justified\".\n\u003e Block identifier. Can be one of: \"head\" (canonical head in node's view), \"genesis\", \"finalized\", \u003cslot\u003e, \u003chex encoded blockRoot with 0x prefix\u003e.",
        "created_at": "2023-06-29T10:54:36.542000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Is this an omission or was there a reason?",
        "created_at": "2023-06-29T10:55:20.542000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "How would a beacon node know if a root was a state root or block root?",
        "created_at": "2023-06-29T11:56:27.594000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Consensus Layer",
        "parent": "",
        "content": "we would have to assume it was a state/block root first, and if it's unknown then try the other one",
        "created_at": "2023-06-29T11:57:35.780000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "That's a pretty ugly change, and would possibly require everyone else to add in another index to their nodes to be able to provide states by block root.",
        "created_at": "2023-06-29T11:59:44.310000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Consensus Layer",
        "parent": "",
        "content": "so you expect it's only Prysm with the block_root -\u003e state mapping?",
        "created_at": "2023-06-29T12:05:14.492000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I don't know for sure, but haven't heard of issues elsewhere.",
        "created_at": "2023-06-29T12:19:29.042000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Teku had to add the block_root-\u003estate_root mapping just for these APIs.  I really wish blockRoot had been used instead of stateRoot but I think the ship has sailed on that.  As an API user being able to supply either a block root or state root would still be nice.  Nodes can already look up a state root for any block root by, in the worst case, loading the block.",
        "created_at": "2023-06-29T19:14:35.046000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "We could easily just do a debug endpoint that takes it, or can take either, i'd prefer its defined as to which one you're trying to use so that we can lookup faster",
        "created_at": "2023-06-29T23:54:17.360000+00:00",
        "attachments": []
    }
]