[
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "It seems like a relay problem it's not clear that the beacon API should be providing specific support for.\n\nBut sure, on the harmless side.",
        "created_at": "2023-05-06T10:52:27.946000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "If the relays want to lock down any/all possibilities of \"rogue proposers\" because that's their business model, alright, great, it's their business. But I've not yet been convinced by a lot of these, do-this-beacon-API-change for not-actually-an-Ethereum-entity proposals.",
        "created_at": "2023-05-06T10:53:37.322000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I dont mind adding a way to specify what check to perform, it just can't be on v1. if there's any specific objections to the actual fact it exists, that's a whole other discussion i guess 🙂",
        "created_at": "2023-05-06T21:00:08.197000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "If it's not going to be fully suported that'd be an important thing, it couldnt really be in 'validator required' in that case...",
        "created_at": "2023-05-06T21:00:42.736000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yeah, I sort of don't have much issue with the specific method of doing this -- I agree with the basic idea that, probably, it needs a new version of the call. But this at least 3rd or fourth API change, desired CL behavior change, et cetera solely to protect relays' interests. It's sort of one of the reasons I sometimes don't comment on these too much, because while I'm skeptical, it's not really some question of what the best way to do it is, but whether it should be done at all, and it becomes a virtual fait accompli at some point.",
        "created_at": "2023-05-06T21:05:44.695000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think it's at least worth having an intentional disposition on things which no one other than relays/builders have asked for",
        "created_at": "2023-05-06T21:06:11.358000+00:00",
        "attachments": []
    }
]