[
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "More broadly, this doesn't require proving knowledge of the private key, which is partly why it's so risky. I'm not sure if this is doable while still being useful for the Siren UI. It's structured, in that way, quite differently than most of these APIs, where part of the \"confirmation\" is exactly the signature.",
        "created_at": "2023-03-26T10:10:06.201000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The whole point is the validator client running the keymanager api has the key, so we're just identifying the key we're exiting...\nWe're basically initiating an exit on a loaded, active key\nThat's my reading of it anyway",
        "created_at": "2023-03-26T19:29:41.599000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "Consensus Layer",
        "parent": "",
        "content": "^ Yep, that's the intention",
        "created_at": "2023-03-26T22:56:56.507000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think that's valid point, although I still think the explicit opt-in would be valuable, not sure if there's any better way of doing this",
        "created_at": "2023-03-26T23:01:23.194000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "Consensus Layer",
        "parent": "",
        "content": "another alternative is to make the endpoint return a `SignedVoluntaryObject` and let the user send it to the Beacon API, making it a two step process. This would prevent a simple curl from triggering an irreversible operation.",
        "created_at": "2023-03-26T23:06:48.242000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "That sounds like a good plan and would make the api more flexible - you could use it for preparing an exit message ahead of time which can be useful for various reasons.",
        "created_at": "2023-03-26T23:09:45.888000+00:00",
        "attachments": null
    },
    {
        "author": "jimmygchen",
        "category": "Consensus Layer",
        "parent": "",
        "content": "That's interesting, didn't think of that use case, but seems useful! The only extra work with this is user / client may have to do extra checks, like making sure the BN matches the same network, which the VC already does, but I guess that work is quite minimal. The safety and flexibility seems to outweigh the cons to me.",
        "created_at": "2023-03-26T23:17:16.305000+00:00",
        "attachments": null
    }
]