[
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003c@144468805697929216\u003e question related to the discussion around `shouldOverrideBuilder` flag. I am curious whether Vouch is getting and using a `blockValue` anyhow?",
        "created_at": "2023-07-03T13:19:46.647000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Nope, it isn't exposed as far via the beacon node API as I'm aware so not something we can access.",
        "created_at": "2023-07-03T13:20:17.334000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "How would a proposal sequence look like from Vouch perspective if `shouldOverrideBuilder` was a method not a flag?",
        "created_at": "2023-07-03T13:26:25.640000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Well ideally there would be up-to-date information available via an API call to the beacon node, something that included if the beacon node will take execution payloads from relays and (ideally) if not, why not (currently the options seem to be that the beacon node has initiated its circuit breaker, or that the execution layer has spotted what it believes to be censorship).  If Vouch knows in advance then it could go straight to fetching unblinded blocks from the beacon node API.\n\n(Although this is somewhat off-topic from the original question, which was an attempt to understand why this flag was considered giving validators more control; I think that whomever said it mis-spoke, as there doesn't seem to be anything in the proposal that provides greater control to validators.)",
        "created_at": "2023-07-03T13:56:03.319000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think that by validators one meant not a VC but rather proposers. And probably it was related to an idea to have JSON-RPC APIs that would provide an information required for CL to decide on censorship on its own instead of blindly relying on a flag received from EL. The thing is that these approaches can be combine, while data required to implement some heuristics are quite complicated to be exposed by EL",
        "created_at": "2023-07-03T14:05:02.474000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e If Vouch knows in advance then it could go straight to fetching unblinded blocks from the beacon node API.\n\nBtw, why do Vouch need to fetch unblinded blocks? Also, handling the situation when circuit breaker gets enabled is quite similar to `shouldOverrideBuilder` flag is `true` and BN has a deal to it; which makes me think that Vouch would still have to handle it if `shouldOverrideBuilder` was a method.",
        "created_at": "2023-07-03T14:08:50.243000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "The problem with a beacon node creating its own blinded block is that Vouch has no access to the payload.  Taking a simple situation where you have two beacon nodes A and B, and you ask them for blinded blocks: if the beacon nodes decide to use their own local EL to build the execution payload then Vouch cannot use the information provided to select a best block, and even if it could that wouldn't be enough to be able to send the signed proposal to both A and B (as it doesn't have the payload).",
        "created_at": "2023-07-03T14:13:47.972000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "A thought, a BN could return full block when local payload is used and blinded block when it is not in the response to the same API",
        "created_at": "2023-07-03T14:40:58.418000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "From my perspective, VC can't make a decision on which payload to use (locally built or an external one), this decision making process is happening on BN side. There could also be a race condition when VC requested a flag and a flag has changed since that time and BN switches to local payload while VC thinks it will return an external one.\n\nIt makes me think that `shouldOverrideBuilder` as a method won't be a game changer and there should be an update to the beacon API to surface to VC which payload source has been used to create a block.",
        "created_at": "2023-07-03T14:45:03.296000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think there was a discussion on a `v3` of the `blocks` request that would do this (and supply reasoning), and yes that would be very useful.",
        "created_at": "2023-07-03T14:49:57.450000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Depends on if you consider the beacon node (and execution layer) as advisory or defining.  Ultimately it's the validator's stake that is involved, so I don't think that the BN should be deciding what the valdiator should or shouldn't do, but a number of client teams disagree with this and it's their codebase, so...\n\nI'll see if I can find wherever the conversation about a unified `blocks` endpoint went to and follow on from there.",
        "created_at": "2023-07-03T14:52:12.585000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "EL is advisory in this case, but BN is defining. I think that we should rather provide an information about decision making to VC through the API, as BN remains an ultimate decision maker which payload to use disregarding whether the flag is introduced or not; and whether this flag is used by particular implementation or not.",
        "created_at": "2023-07-03T14:59:14.607000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Discussion was at https://github.com/ethereum/beacon-APIs/issues/309 but it seems to have died a death.  Is there any appetite to continue the discussion and come to some sort of conslusion so that an updated API can be proposed?",
        "created_at": "2023-07-03T15:04:11.899000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I'll check on this thread tomorrow (signing off for today)",
        "created_at": "2023-07-03T15:30:22.345000+00:00",
        "attachments": null
    }
]