[
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "ok, so whatever happens (or not) with a new or modified endpoint, barring that, broadening-not-replacing this means that this apparently slightly bolted-on index in Prysm and Teku, as I understand it, still has to be there?",
        "created_at": "2023-07-06T06:08:29.759000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "as in, I don't see what'd be gained by this move yet",
        "created_at": "2023-07-06T06:08:40.069000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "people keep discussing ever-finer details of syntax, but the motivation still eludes me",
        "created_at": "2023-07-06T06:13:55.669000+00:00",
        "attachments": []
    },
    {
        "author": "nishant0",
        "category": "Consensus Layer",
        "parent": "",
        "content": "We do support state root lookups currently, however it will only work for the last 8192 slots(as of the moment). \n\nAllowing states to be retrieved either by block root , would allow us to to retrieve any historical state in all clients without requiring any api specific indexing, it is also a lot more intuitive for downstream users of the api to be able to request full states this way. Rather than looking up the block at slot X and then retrieve the state root from it to request the full state, you could just provide the block root directly.",
        "created_at": "2023-07-06T06:18:35.157000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "to me, i'd be happy with just looking up by state root or slot, but I only use this endpoint for very specific things. I'm not sure who is the stakeholder that wants block_root here.",
        "created_at": "2023-07-06T06:35:01.390000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e Rather than looking up the block at slot X and then retrieve the state root from it to request the full state, you could just provide the block root directly.\n\nBut if you know the slot in the first place, you can request the state by slot. No need to fetch any roots. I think the thing to answer here might be: How is it possible that someone has the state root available but they don't know the slot? If such a use case does not exist in practice, then we probably should abandon the `v3` pursuit.",
        "created_at": "2023-07-06T13:09:10.012000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I admit that I did not ask users what prevents them from passing the slot number. I will do so in the future.",
        "created_at": "2023-07-06T13:10:12.793000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Slot can only return canonical states. Things like block explorers typically want to retrieve non canonical state data too. Teku and I think some other clients have an option to keep non canonical data even after it is finalised and could be discarded for this purpose. Very useful when investigating issues too. \nSo you need some way of requesting by root - typically you have the block root because that’s what everyone uses but it’s not difficult to convert that to the state root.",
        "created_at": "2023-07-06T21:47:50.049000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "If you don’t support storing finalised non canonical data then only being able to access relatively recent states by root makes sense and is probably quite a reasonable trade off. I’d want to be able to request any non finalized state by root though - not just canonical ones.",
        "created_at": "2023-07-06T21:48:58.754000+00:00",
        "attachments": []
    }
]