[
    {
        "author": "0xunclebill",
        "category": "Consensus Layer",
        "parent": "",
        "content": "another block v3 endpoint question(s):\n\nI'm pretty close to finishing the block v3 endpoint impl in lighthouse. I'm a bit confused on when to return a blinded or unblinded block. \n\nFrom the spec:\n\n\u003e The returned block may be blinded or unblinded, depending on the current state of the network as decided by the execution and beacon nodes.\n\nWhat does it mean by the state of the network? How would the state of the network indicate wether this endpoint needs to return either a blinded or unblinded block?\n\nAlso from the spec:\n\n\u003e The beacon node must return an unblinded block if it obtains the execution payload from its paired execution node. It must only return a blinded block if it obtains the execution payload header from an MEV relay.\n\nWhere in the execution payload header does it indicate wether the execution payload came from the paired exec node vs a MEV relay?",
        "created_at": "2023-08-10T11:15:02.194000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e What does it mean by the state of the network? How would the state of the network indicate wether this endpoint needs to return either a blinded or unblinded block?\nAn example might be checking whether your node is connected to a builder/relayer. If yes, return a blinded builder block; if no, an unblined local block. Also this may depend whether a builder block has higher value than a local block\n\n\u003e Where in the execution payload header does it indicate wether the execution payload came from the paired exec node vs a MEV relay? \nThere is no such information in the payload header. You will probably have to look through the code to find a place where it's determined whether the builder/relay should be used. But you will probably get a payload header from a builder and a full payload from the local node, so this could already be an indication where it came from",
        "created_at": "2023-08-10T17:06:14.794000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Mind you I don't know the internals of Lighthouse, it's just speculation 🙂",
        "created_at": "2023-08-10T17:08:06.991000+00:00",
        "attachments": []
    },
    {
        "author": "0xunclebill",
        "category": "Consensus Layer",
        "parent": "",
        "content": "got it, thanks for the additional info",
        "created_at": "2023-08-10T18:49:07.348000+00:00",
        "attachments": []
    }
]