[
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Do I understand correctly that when VC asks for unblinded block it make BN to return a block with a local payload while blinded one can come from either local EL or a relay?",
        "created_at": "2023-07-04T16:10:59.129000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "So, we can actually add payload meta information (source and value) to the response and make BN return full payload if available. I am not sure if an information about relay should be included, this is because relays aren't staying forever in the protocol while source and value are going to remain in some form or can easily be stubbed",
        "created_at": "2023-07-04T16:23:24.259000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yes.",
        "created_at": "2023-07-04T18:30:07.729000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I don't think it necessary, although some may find it useful. Happy for it to not be part of the response.",
        "created_at": "2023-07-04T18:31:08.602000+00:00",
        "attachments": []
    },
    {
        "author": "radekkapka",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003c@144468805697929216\u003e \u003c@340345049063882753\u003e \u003c@449019668296892420\u003e would you be willing to support an `/eth/v3/debug/beacon/states` endpoint with `blockId`, `stateId` and `slot` query parameters? `slot` would only have an effect when `blockId` is also provided. If there is initial interest, I can open a PR and we can move the discussion there.",
        "created_at": "2023-07-04T18:40:39.561000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "hmm, then i don't quite understand what that thread was about. I thought we want this information to allow VC understand where the payload is coming from and react accordingly. Or that thread is about VC to decide which payload to use?",
        "created_at": "2023-07-04T18:49:28.491000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Well we have two things.\n\nFirst, we have a situation where a request for blinded blocks can return a block with an execution payload header based on a local execution payload.  This is bad for something like Vouch, which can't work without a path to the execution payload it can provide to all beacon nodes so it's a wasted call.\n\nSecond, we have a non-optimal loop where a fetch of a blinded block that uses a local execution payload isn't notified in advance or controllable, so we end up then going back and fetching the unblinded block after the fact.\n\nThe key part of your comment above is \"make BN return full payload if available\", which is what we can't do at the moment.  Hence the idea of a unified API call that returns the unblinded block if possible, and if not the blinded block, and either way provides execution value information.",
        "created_at": "2023-07-04T19:38:51.651000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Consensus Layer",
        "parent": "",
        "content": "It's relatively easy for me to say \"yes\" to that as I won't be coding it, but I don't have any objections to it in principle.",
        "created_at": "2023-07-04T19:40:45.175000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Adrian can't really agree to it any more but i can :)we should just make sure the query parameters are consistently named but makes sense... Also if we go that way could potentially 'not support' specific parameters if any teams needed to do that (though it'd make the query a little less useful for consumers)",
        "created_at": "2023-07-04T22:09:19.201000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I suspect you’ll get a lot of confusion if slot only works with block root. And potentially a lot of confusion about what it means if both block root and state root are supplied. \nWorth considering if it’s better to just have two apis - one to get by state root and one by block root. Not entirely sure what the best way of fitting the block root \u0026 slot option in is.",
        "created_at": "2023-07-04T22:51:01.449000+00:00",
        "attachments": []
    }
]