[
    {
        "author": "jimmygchen",
        "category": "Consensus Layer",
        "parent": "",
        "content": "There were quite a few discussions on this previously (including similar changes on the builder api) and there were some pushbacks against bumping version for a fork update / data type update with no other change in API behaviour. I'm curious what issues are you facing? There's also a recent `builder-spec` PR merge (https://github.com/ethereum/builder-specs/pull/61) that contains this type of change... if things need to change, I guess it's not too late?",
        "created_at": "2023-05-30T01:53:31.673000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "possibly i guess... the SSZ offset changes for slot and it does make it fairly messy, but i think we're at the tail end of the mess... i just don't want to have that all done again in future if we can avoid it",
        "created_at": "2023-05-30T02:52:16.339000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "i guess since most ppl have done it it's more disruptive to change this time round, but we need to keep in mind these kinds of changes...",
        "created_at": "2023-05-30T02:53:44.104000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "adding the new 'blockContents' is very different to the existing block structures which could be easily decoded without headers. now we *have* to use headers, because the slot offset isn't consistent.\nIf it was a new endpoint, blockContents could probably be decoded cleanly without hacks and it could have been a nice point to deprecate a bunch of old code we'd never use again... so ultimately we shouldnt be affraid of new endpoints on hardforks if it makes the implementation cleaner",
        "created_at": "2023-05-30T02:56:05.704000+00:00",
        "attachments": []
    },
    {
        "author": "jimmygchen",
        "category": "Consensus Layer",
        "parent": "",
        "content": "We have a `Eth-Consensus-Version` header, but not sure if it's helpful given its optional :/\n```yaml\n  parameters:\n    - in: header\n      schema:\n        $ref: '../../../beacon-node-oapi.yaml#/components/schemas/ConsensusVersion'\n      required: false\n      name: Eth-Consensus-Version\n      description: \"Version of the block being submitted, if using SSZ encoding.\"\n```",
        "created_at": "2023-05-30T03:49:50.662000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "it has to be optional because it was retrofitted, but it also will be basically required as of deneb, its basically a breaking change thats been done in many ways",
        "created_at": "2023-05-30T03:51:09.140000+00:00",
        "attachments": []
    },
    {
        "author": "jimmygchen",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Got it, thanks for explaining! I think I understand your point now why it's an incompatible change even though there's little change in the endpoint behaviour for previous forks. We can always add a `slot` field to `BlockContents` I guess.. 🙈 ..jk\n\nSo to sum it up (for my own benefit), for existing endpoints that supports SSZ, we should probably bump the version if it's changing the entire top level structure. For the `builder-spec` endpoint, it's probably less of an issue because it doesn't support ssz, but something to keep in mind. Some of the endpoints there have `version` as a top level field, which helps.\n\nFor new endpoints / endpoint versions that contains fork versioned data and supporting SSZ, we should probably aim to:\n- have the version or slot at fixed offsets / top level;\n- OR have a mandatory version header, so we don't always need to bump versions for data type updates.\n\nKind of relevant to the engine api versioning issue here: https://github.com/ethereum/execution-apis/issues/376",
        "created_at": "2023-05-30T04:59:40.286000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think that's probably a fair summary until i realise i was completely wrong about something 😄\nSeriously though, yeh some kind of reliable way to determine the version of ssz for those endpoints is pretty important, and version fields can help or fixed position, but depending on the way people have dealt with this in the past it's potentially problematic.\nIdentifying breaking changes is the part that's hard. We caught it for the recent change on blocks, which is a good start... I didn't see how incompatible some of the new block contents related changes were until some PRs got raised in teku and i realised how messy it's becoming... I'm sure I merged the beacon-apis change, just wish I'd spotted and spoken up on the problems stemming from an incompatible change like that.\nIt's possible that it's mostly the model we're using that's causing this issue, so unless others are also feeling the pain, I see no reason to change it after everyone has built it out, but if it's a general problem for several clients we could investigate options... I just figured it's at least worth noting the potential problems with a change like that so that reviewers (myself included) keep it in mind.",
        "created_at": "2023-05-30T06:34:20.620000+00:00",
        "attachments": []
    }
]