[
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "well, yes, so that's what I'm suggesting: root+slot - it covers all possible cases and it's efficient for the linear part - I would prefer us not going down the route of forcing an index like that in all clients, or worse, ending up with poor cross-client compat.. a block+slot can also be efficiently implemented from linear storage of finalized parts of the chain: a blockroot alone requires building an index designed for the purpose",
        "created_at": "2023-07-01T07:29:21.914000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Hmm not really sure how block root alone requires an additional index given you can already load any block by root. You can use an extra index to optimise if you want but it isn’t strictly necessary. \nThat said I quite like blockRoot + slot. I tried to replace state root with that way back. 🙂",
        "created_at": "2023-07-01T07:39:17.414000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "this is assuming you keep a block root index to begin with, which again has no other uses .. that's the thing about the finalized section: it offers the possibility to use linear storage throughout - the slot then serves as an anchor to find things",
        "created_at": "2023-07-01T07:41:44.201000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "But how do you serve responses to the block api which allows you to request the block by root?",
        "created_at": "2023-07-01T07:45:15.135000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "That’s what I mean by you must already have a block root index.",
        "created_at": "2023-07-01T07:45:27.857000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Besides block root + slot still requires you to look up the block by root since the slot may be from a later slot than when the block was published.",
        "created_at": "2023-07-01T07:46:02.718000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "poorly, ie that index is limited in depth and takes time to build.. if working from a slot, you need to constrain the search horizon anyway so the time to find the block is effectively limited..\n\nie it's true that you could ask for todays slot with the genesis root, but clients would not reasonably be able to serve such states anyway -  so a block+slot interface would necessarily have to have a \"gap limit\"",
        "created_at": "2023-07-01T07:48:37.115000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "for example, we can serve data from era files by slot (which are essentially linear dumps of blocks) without first building an index - a p2p client only needs a block root index for the non-finalized portion of the chain (the network protocol was specifically designed like this recognising that deep history requests should not be made by root - I wish the api had had the same foresight)",
        "created_at": "2023-07-01T07:51:03.817000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "so the p2p protocol is split this way and it allows implementing a correct and efficient client - the beacon api, not so much, if you compare it with core p2p requirements: lookups by block root? require special index - lookups by state root? require special index etc",
        "created_at": "2023-07-01T07:53:31.124000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Consensus Layer",
        "parent": "",
        "content": "That’s a pretty normal thing for an api. The point is to make the api useful to callers not to make users suffer for the client’s storage layout. There’s certainly trade offs to be made but not being able to look up blocks by block root seems like taking it too far.",
        "created_at": "2023-07-01T08:13:24.732000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I find it reasonable though to begin something that actually aligns with the underlying function of the protocol it seeks to expose - this is not a \"client storage layout\" question, as if it were a design tradeoff - it's about expressing an orthogonal, minimal and complete API as a starting point - once you've done that, it becomes much easier to discuss additions based on merit, because in each case, they are no longer necessary to solve a problem, merely convenient and it becomes a case of identifying where complexity should live",
        "created_at": "2023-07-01T08:49:09.674000+00:00",
        "attachments": null
    }
]