[
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003c@543900561460822016\u003e \u003c@654267572107083777\u003e I wanted to understand a little more about the API change and possible future interactions with SSZ. I'm a little confused about the complexity here. My understanding was that the EL already serializes these requests with a prefix and it would be easy for them to just push them as they are to the engine API and let the CL handle them as they wish. This is indeed very easy for us to implement. But this entails: \n- the CL needs to add the same enum as the EL leaking this EL construct to the CL. \n- ignore some fields/bytes from the request when deserializing. \n\nWhile these are very simple to do it seems that the alternative is even simpler on both sides: \n- the EL adds a new subtree of requests and inside it adds one extra subtree for each kind. The EL only needs to read the first byte and use it as an index in the subtrees. \n\nThis seems not to leak anything and it's the exact same complexity as we would have to implement",
        "created_at": "2024-08-22T20:59:54.886000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Without the new  construct of ignoring bytes to deserialize",
        "created_at": "2024-08-22T21:01:14.330000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Consensus Layer",
        "parent": "",
        "content": "we would need to implement this subtree concept which kinda defeats the purpose of the requests concept in the first place, which is having the same merkleization scheme for txs / receipts / requests and to not extend the block more than necessary",
        "created_at": "2024-08-22T21:11:12.127000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Consensus Layer",
        "parent": "",
        "content": "idk what you mean by “ignoring bytes” my proposal is for the CL to read json objects",
        "created_at": "2024-08-22T21:12:53.193000+00:00",
        "attachments": null
    }
]