[
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "hey all, just looking at permissions on beacon-apis and on 'keymanager-apis' repo, theres a setting that basically requires approval for all outside collaborators before running workflows...\nBasically the implication is 'dont assume external PRs are safe to run' - i guess as an extension people should read the PR prior to clicking the approve and run button on a PR.\nThis was bought to my attention as a potential issue on the repos by \u003c@586161934425128960\u003e , and just looping people in in-case theres other things we should be thinking about in this area?\nMy initial thought is we set this initial change, but I'm curious if there's other considerations...",
        "created_at": "2024-05-02T09:40:47.624000+00:00",
        "attachments": []
    },
    {
        "author": "parithosh",
        "category": "Consensus Layer",
        "parent": "",
        "content": "We've set the similar rules for the consensus-specs and the main reason is to prevent abuse or to restrict the blast radius in case someone gets their hands on some CI tokens. If you get your hands on a CI token and it has write permissions, that's when things could get messy. So the current ruleset is \"require approval for all outside collaborators\" and \"read only for workflow permissions\". In combination with using ephemeral runners, it should be a robust CI setup.\n\nIf you wanna step it up a notch, you can also restrict which actions can be used, e.g: allow only actions defined within the ethereum org to be used. but then you gotta maintain said action.",
        "created_at": "2024-05-02T10:09:05.096000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "i'd be very happy to take that guidance, I really don't know what the best settings are, so maybe we run with this...",
        "created_at": "2024-05-02T10:10:17.287000+00:00",
        "attachments": []
    },
    {
        "author": "parithosh",
        "category": "Consensus Layer",
        "parent": "",
        "content": "awesome 🙂\nI can also let you know if changes are made to one of the other repos and we can make sure they all have similar security levels",
        "created_at": "2024-05-02T10:11:28.219000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "that'd be great actually, generally I'm really not looking at the 'admin' side of github!",
        "created_at": "2024-05-02T10:12:07.469000+00:00",
        "attachments": []
    },
    {
        "author": "nflaig",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\"read only for workflow permissions\" this for sure breaks release automation, or how do you approach this?",
        "created_at": "2024-05-02T10:12:41.170000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I'm going to call it a night, i'll catch up in the AM 🙂",
        "created_at": "2024-05-02T10:13:23.589000+00:00",
        "attachments": []
    },
    {
        "author": "parithosh",
        "category": "Consensus Layer",
        "parent": "",
        "content": "ah releases are manual in consensus-specs, so we don't have that issue. I can see if there's some different scoping we can use, but yeah if you need to do releases then the token would have write permissions😅",
        "created_at": "2024-05-02T10:15:54.681000+00:00",
        "attachments": []
    },
    {
        "author": "nflaig",
        "category": "Consensus Layer",
        "parent": "",
        "content": "You can set permissions per workflow, but this is rather to prevent a malicious action from doing damage. We tried setting the token to readonly on Lodestar repo and it broke the CI in many different ways there",
        "created_at": "2024-05-02T10:18:11.386000+00:00",
        "attachments": []
    },
    {
        "author": "parithosh",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Yup, reading the same right now 😄\n\nhttps://docs.github.com/en/actions/security-guides/automatic-token-authentication#modifying-the-permissions-for-the-github_token\nSeems like we can scope it to write/read and add a setup job to disable write on all non-release related jobs. \n\ncc \u003c@199253896399421440\u003e for some visibility as well 🙂",
        "created_at": "2024-05-02T10:19:15.151000+00:00",
        "attachments": []
    }
]