[
    {
        "author": "nc1234",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Just curious, if I am calling [getAggregatedAttestationV2](https://github.com/ethereum/beacon-APIs/blob/af8e5e7c0fe590f111121971608066a4614ed7bd/apis/validator/aggregate_attestation.v2.yaml#L2) from pre-electra, what should I put for `committee_index`? Since the committee index is already encoded in `attestation_data_root`, will I need to explicitly extract the index and pass it in?",
        "created_at": "2024-08-01T12:33:44.847000+00:00",
        "attachments": null
    },
    {
        "author": "mehdi.aouadi",
        "category": "Consensus Layer",
        "parent": "",
        "content": "That's how I see it, with v2 you should pass the index (set in the attestation data pre Electra)",
        "created_at": "2024-08-01T15:55:11.383000+00:00",
        "attachments": null
    },
    {
        "author": "mehdi.aouadi",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I'm wondering how the `Eth-Consensus-Version` should be interpreted for the Electra attestations APIs. Should it be set according to the current milestone (any milestone from Phase0 to Electra) or to the data type (Phase0 or Electra only, for now)? Examples: In the first case, for a Deneb attestation, the header will be set to Deneb and in the second case, for a Deneb attestation is will be set to Phase0.",
        "created_at": "2024-08-01T16:01:17.444000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Should be former. BN should do the conversion work eg. Deneb or before -\u003e phase0 Attestation, Electra or after -\u003e electra Attestation. Don't think validator should possess the knowledge of fork differences",
        "created_at": "2024-08-01T16:28:01.726000+00:00",
        "attachments": null
    },
    {
        "author": "mehdi.aouadi",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I'm confused here, the former option sets the header to whatever fork the data comes from (i.e. slot in Deneb -\u003e return attestation phase0 container and set the consensus version header to Deneb or the corresponding fork if different which could be any milestone). IMU your example falls into the latter option (i.e. slot in Deneb or before -\u003e return attestation phase0 container and set the consensus version header to phase0, slot in or after Electra, return attestation electra container and set the consensus version header to Electra)",
        "created_at": "2024-08-01T18:43:07.283000+00:00",
        "attachments": null
    },
    {
        "author": "nflaig",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e (i.e. slot in Deneb -\u003e return attestation phase0 container and set the consensus version header to Deneb or the corresponding fork if different which could be any milestone).\nimo that's how it should be and as I understood NC, consensus version header should not be aware of how many different fork types exist for a specific container. The underlying implementation needs to pick the correct ssz container and be aware of it on both sides vc and bn, that's how it's implemented in Lodestar anyways, e.g. deneb fork is mapped to phase0.Attestation container (same as all pre-electra forks)",
        "created_at": "2024-08-01T19:37:07.078000+00:00",
        "attachments": null
    },
    {
        "author": "mehdi.aouadi",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Clear! We implemented it that way in Teku. Wanted to make sure we’re on the same page 🙏",
        "created_at": "2024-08-01T20:54:22.688000+00:00",
        "attachments": null
    }
]