[
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "it is ~1200 deposits at the 30M gas block but i don't think it is reachable practically.\nWith 1200 deposits, 16 withdrawals and 1 consolidation we have 226Kb of data, 452Kb of hex encoded strings",
        "created_at": "2024-10-04T03:22:46.681000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I don't have really strong views on this, but I'm not that convinced it's worth the extra hashing and coordination between CL and EL to avoid transferring 450KiB (in both directions in block production case)",
        "created_at": "2024-10-04T04:25:10.489000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "One potential structural concern is that any time there a sidecar structure, it introduces potential ordering/race conditions in data availability/integrity/legitimacy across components. It's fairly muted here, granted",
        "created_at": "2024-10-04T04:27:51.293000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "So sidecar per se is fine, but sidecar along with same getPayload/newPayload minimizes this, i.e. they show up at the same time, not potentially before/after/etc",
        "created_at": "2024-10-04T04:28:57.971000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "This is CPU bound, the JSON hex string conversion is several orders of magnitude higher than the hashing of microseconds. This is unreasonable on both sides, both the EL not wanting to do the silly htr (cc \u003c@194432762315407360\u003e ) and the CL calling a complication to compute four sha256 hashes. I lend myself to write the PRs in all CL clients if you're short of people, but sending potentially all the block in requests is the worst possible outcome for an API",
        "created_at": "2024-10-04T10:39:11.165000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "hex parsing can be into the GB/s range: https://lemire.me/blog/2019/04/17/parsing-short-hexadecimal-strings-efficiently/ https://lemire.me/blog/2023/07/27/decoding-base16-sequences-quickly/",
        "created_at": "2024-10-04T10:43:35.164000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Even that is still millisecond orders for these max, the two extracopies minimum of the strings and the Io overhead for no reason. I think a reasonable question one should ask is: if I had written both client and server, would I chose to send the whole data?",
        "created_at": "2024-10-04T10:51:22.777000+00:00",
        "attachments": []
    },
    {
        "author": "m.kalinin",
        "category": "Consensus Layer",
        "parent": "",
        "content": "EL will compute the commitment anyway -- so from this perspective it is good to send raw data -- the commitment algo is encapsualted in EL. I think we can start with full data, and then if we see the need we can switch to hash in the next API version",
        "created_at": "2024-10-04T18:29:22.045000+00:00",
        "attachments": []
    }
]