[
    {
        "author": "nflaig",
        "category": "Consensus Layer",
        "parent": "",
        "content": "do we wanna aim to get a release out before the testnet forks? iirc the CL spec release for deneb was just before the mainnet fork\n\nif we get everything for Electra merged this week we can either refer to latest beta CL spec or just use the proper release reference and have the links not work for 2-3 weeks which seems fine?",
        "created_at": "2025-02-10T11:39:37.370000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think it'd be good, and personally I'm not as tied to must-not-be-beta-URLs referenced. if nothing else, maybe they can be fixed after? so commit to the changes clearly before electra is final, then make final version after it is",
        "created_at": "2025-02-10T12:15:35.574000+00:00",
        "attachments": null
    },
    {
        "author": "nflaig",
        "category": "Consensus Layer",
        "parent": "",
        "content": "yeah we can use beta links, I doubt that containers will change at this point which was the main argument for updating the links, just to double check and make sure we don't reference some outdated spec version but it looks good to me, can put up a PR for that",
        "created_at": "2025-02-10T12:28:17.804000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "it's a pretty usual industry approach -- creating \"draft\" standards/specs too",
        "created_at": "2025-02-10T12:30:13.646000+00:00",
        "attachments": null
    },
    {
        "author": "tersec",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I bet a lot more people have consulted some draft of C11 than C11-proper",
        "created_at": "2025-02-10T12:30:37.224000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think we just hold off until we get a spec release, which probably wont be until after testnets succeed",
        "created_at": "2025-02-10T19:45:35.552000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "we could use beta links if everyones happy with that and clean it up later, if ppl would prefer a spec release...",
        "created_at": "2025-02-10T19:46:16.930000+00:00",
        "attachments": null
    },
    {
        "author": "nflaig",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I don't mind the beta links as long as we reference an up to date spec which should be the case at this point, if we get the remaining PRs merged I think should be good to cut a release soonish",
        "created_at": "2025-02-10T20:43:00.249000+00:00",
        "attachments": null
    }
]