[
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "there was an attempt to start writing tests on the beacon-api but it never got very far... that would be easiest - we (teku) have a unit test for whats expected on mainnet, and we manually verify what we expect, but we do things like accept that the bpo data is currently pushed in mainnet config. im not sure what kind of nightmare it'd be to verify all the teams are doing the config consistently...\n\nis it config/spec specifically? did we want like a kurtosis test case or something?",
        "created_at": "2025-07-12T00:17:30.715000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "Consensus Layer",
        "parent": "",
        "content": "I think config/spec would be the most valuable to start with, but ideally all mandatory beacon api should be tested some way",
        "created_at": "2025-07-12T13:52:40.123000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Wonder if we could just have a scheduled cron job that runs with all clients latest branches and verifies all the beacon api calls",
        "created_at": "2025-07-12T13:53:21.596000+00:00",
        "attachments": null
    },
    {
        "author": "barnabasbusa",
        "category": "Consensus Layer",
        "parent": "",
        "content": "or ideally it should be ran by the client’s gh action",
        "created_at": "2025-07-12T13:53:56.428000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "If it’s structure it’s probably fairly easy… config/spec could be more of a static check but a lot of required endpoints are duty production and that’s a little more complicated without client changes… most of it is validator flow so we’d know if duties fail I guess",
        "created_at": "2025-07-12T21:25:14.687000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Consensus Layer",
        "parent": "",
        "content": "A lot of the validator required are now mostly ssz so json on those is likely limited value, can see config/spec being a constant thing to look at, esp with things like BPO",
        "created_at": "2025-07-12T21:37:38.010000+00:00",
        "attachments": null
    }
]