[
    {
        "author": "tbenr",
        "category": "Consensus Layer",
        "parent": "",
        "content": "yes, our new pool is still WIP but we will most probably lend on a version that drops single attestations if we have received an aggregate that covers them (we don't pre aggregate). And we use our aggregating strategy to respond to that API, so the most natural behaviour for us will be:\n\n- (committeeIndex present in param): aggregate aggregates (1 committee only aggregates) and single attestations for the given committee\n- (committeeIndex NOT present in param): aggregate all aggregates together (cross committee). No single attestations are considered in this case (We may also consider single attestations in theory but the way the new implementation is going, it would be less straightforward for us but doable).",
        "created_at": "2025-04-11T13:54:14.847000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Today we had a discussion in Prysm about supporting SSZ for all our endpoints, or at least all that the VC uses. I know that Lodestar does have it already (not sure if for each and every endpoint or just for VC-related ones) and I am afraid that our implementations will be slightly different, requiring to change things if/when SSZ support catches up in the Beacon API spec.\n\nI think we should revisit https://github.com/ethereum/beacon-APIs/issues/250 and start moving in this direction.\n\ncc \u003c@833706406699073536\u003e",
        "created_at": "2025-04-11T15:44:17.865000+00:00",
        "attachments": null
    },
    {
        "author": "radekkapka",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003c@449019668296892420\u003e wanted to see https://github.com/ethereum/consensus-specs/pull/3506 merged first and it has been merged quite a while ago, so there is nothing stopping us now (hopefully).",
        "created_at": "2025-04-11T15:46:23.636000+00:00",
        "attachments": null
    },
    {
        "author": "nflaig",
        "category": "Consensus Layer",
        "parent": "",
        "content": "That's great to hear that more clients are in favor of full ssz beacon-api, I would agree that focus should be on validator apis first as those are more time sensitive.\n\nLodestar supports ssz on all endpoints for request bodies and responses, however there are a few exceptions which technically cannot support ssz, a example is https://ethereum.github.io/beacon-APIs/#/Node/getPeers, this requires arbitrary strings to be returned and there is no canonical json mapping, similar there are no enums in ssz yet.\n\nRegarding the issue #250, all behavior described there as been added to the spec a while ago, for example https://github.com/ethereum/beacon-APIs/pull/457. So this already describes how clients / servers should behave and if all do this will allow us to add ssz to existing endpoints in a backward compatible manner. From my testing it seems that most / all clients follow this at this point, only Nimbus doesn't return proper 415 status code which is a blocker for this.\n\nSo I guess I am curious what you would like to see so we can close #250, a next step would be to explicitly document it on each endpoint, ie. to clarify what ssz container should be used, status codes, etc. to be more explicit about it.",
        "created_at": "2025-04-11T15:52:30.858000+00:00",
        "attachments": null
    },
    {
        "author": "nflaig",
        "category": "Consensus Layer",
        "parent": "",
        "content": "\u003e  I am afraid that our implementations will be slightly different, requiring to change things if/when SSZ support catches up in the Beacon API spec.\nthis was a big issue for us as well, it was expensive to add ssz support as it required extra logic / boilerplate but we did a major refactor and now it requires more code (1 line more) to not support ssz, so I guess this would be the ideal world for all clients, then sszification of the api is a given",
        "created_at": "2025-04-11T15:56:34.641000+00:00",
        "attachments": null
    },
    {
        "author": "inspector.butters",
        "category": "Consensus Layer",
        "parent": "",
        "content": "yes it would be great to add this for every endpoint to the beacon-apis repository. currently only a handful have this there. maybe we can start with the validator endpoints and then move to the other ones?",
        "created_at": "2025-04-11T22:47:46.250000+00:00",
        "attachments": null
    },
    {
        "author": "inspector.butters",
        "category": "Consensus Layer",
        "parent": "",
        "content": "then we should also think about a standardized way between VCs and BNs to communicate if they should use JSON or SSZ. (maybe once? or per endpoint?)",
        "created_at": "2025-04-11T22:57:31.136000+00:00",
        "attachments": null
    },
    {
        "author": "nflaig",
        "category": "Consensus Layer",
        "parent": "",
        "content": "yeah I would say should start with those as a) they all can support ssz due to how those are typed and b) it's easier to get all teams on board as those are perf sensitive apis",
        "created_at": "2025-04-11T23:19:38.076000+00:00",
        "attachments": null
    },
    {
        "author": "nflaig",
        "category": "Consensus Layer",
        "parent": "",
        "content": "content type negotiation is already part of HTTP spec(s), but I clarified the expected behavior here https://github.com/ethereum/beacon-APIs/blob/master/beacon-node-oapi.yaml#L8-L17, or do you mean something else, maybe more details? eg. it doesn't say anything about what to do if server sends a 415 for example on the spec but Lodestar will retry the request using JSON and cache that the beacon node doesn't support ssz for that route",
        "created_at": "2025-04-11T23:20:20.864000+00:00",
        "attachments": null
    },
    {
        "author": "inspector.butters",
        "category": "Consensus Layer",
        "parent": "",
        "content": "yes this is exactly what I meant. makes sense to cache it per route 👍",
        "created_at": "2025-04-11T23:23:53.630000+00:00",
        "attachments": null
    },
    {
        "author": "nflaig",
        "category": "Consensus Layer",
        "parent": "",
        "content": "Teku does same, not sure about others",
        "created_at": "2025-04-11T23:24:23.515000+00:00",
        "attachments": null
    }
]