[
  {
    "author": "serenita_io",
    "category": "Consensus Layer",
    "parent": "",
    "content": "Good catch, the engine API returns an array of `ClientVersionV1` so let's mirror that behavior on the Beacon API too.\nNico made the adjustment and it's now merged into the PR - https://github.com/ethereum/beacon-APIs/pull/568/changes/347792ab4a06e37f2fe76bf9889de22412191306 .\n\nOne thing to consider is whether we should rename the field to `execution_clients` since the return value is an array...",
    "created_at": "2026-02-10T12:02:29.690000+00:00",
    "attachments": []
  },
  {
    "author": "nflaig",
    "category": "Consensus Layer",
    "parent": "",
    "content": "> One thing to consider is whether we should rename the field to execution_clients since the return value is an array...\n`engine_getClientVersionV1` method is singular too while returning an array, so I am fine with keeping it singular and just make type an array",
    "created_at": "2026-02-10T12:06:04.194000+00:00",
    "attachments": []
  },
  {
    "author": "nflaig",
    "category": "Consensus Layer",
    "parent": "",
    "content": "the description clarifies why it's an array",
    "created_at": "2026-02-10T12:06:51.508000+00:00",
    "attachments": []
  },
  {
    "author": "nflaig",
    "category": "Consensus Layer",
    "parent": "",
    "content": "<@993802539856314398> ^^ regarding the discussion about aligning with spec, I think we just need to conclude whether we wanna support returning multiple ELs or not, I can already say that lodestar will always only return 1 value from the api since we don't track multiple internally",
    "created_at": "2026-02-10T14:17:58.460000+00:00",
    "attachments": []
  },
  {
    "author": "jameshe5018",
    "category": "Consensus Layer",
    "parent": "",
    "content": "<@586161934425128960> so i assumed we wanted to broadcast the datacolumns when we publish payload envelope, but the data column sidecar also includes the signed block header\n```\nsidecar := &ethpb.DataColumnSidecar{\n            Index:                        idx,\n            Column:                       cells[idx],\n            KzgCommitments:               info.kzgCommitments,\n            KzgProofs:                    proofs[idx],\n            SignedBlockHeader:            info.signedBlockHeader,\n            KzgCommitmentsInclusionProof: info.kzgInclusionProof,\n        }\n```\n\nstill trying to figure what's the best way to tackle this",
    "created_at": "2026-02-10T15:33:50.758000+00:00",
    "attachments": []
  },
  {
    "author": "nflaig",
    "category": "Consensus Layer",
    "parent": "",
    "content": "that's the fulu type, gloas only has a reference to the beacon block via it's root",
    "created_at": "2026-02-10T15:34:58.011000+00:00",
    "attachments": []
  },
  {
    "author": "jameshe5018",
    "category": "Consensus Layer",
    "parent": "",
    "content": "oops missed that thanks",
    "created_at": "2026-02-10T15:35:25.699000+00:00",
    "attachments": []
  },
  {
    "author": "mehdi.aouadi",
    "category": "Consensus Layer",
    "parent": "",
    "content": "I'm worried the API contract might be messy if it's advertising a list but always returning a single value. I guess the EL multiplexer use case is rare but shoudn't break the API if used. That's why I suggested a \"hybrid\" solution which might fit all use cases. Not a strong opinion though, just trying to make the API contract abstract and clear enough",
    "created_at": "2026-02-10T16:42:34.500000+00:00",
    "attachments": []
  },
  {
    "author": "nflaig",
    "category": "Consensus Layer",
    "parent": "",
    "content": "to me the engine api design is just bad, if a multiplexer is used it should just return the version of the multiplexer, I haven't seen a practical use case why you would need multiple versions because in case of the graffiti I don't think any client puts in multiple EL versions? And generally running multiple ELs via multiplexer is not a usual node setup, I believe it's mostly useful for RPC providers to have a single beacon node coordinate multiple ELs\n\nmaybe we just don't support that on the beacon-api as it's not practical and be fine with deviating from the engine api format, ie. revert back to return a single value. I am fine either way",
    "created_at": "2026-02-10T16:54:09.132000+00:00",
    "attachments": []
  },
  {
    "author": "mehdi.aouadi",
    "category": "Consensus Layer",
    "parent": "",
    "content": "The multiplexer use case isn't standard unfortunately and it's passing some ambiguity to the end user of this API (otherwise we could have a way to determine which is the primary EL from a multiplexer). If the BN is blind, we could use a deterministic approach if we get back to the single value contract: If many ELs, consider the first one as primary for example",
    "created_at": "2026-02-10T17:13:53.068000+00:00",
    "attachments": []
  }
]