[
    {
        "author": "norswap",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm trying to understand the scheme at https://dankradfeist.de/ethereum/cryptography/2021/06/18/pcs-multiproofs.html\nIs it correct to say that the scheme can only be applied with EC curves whose finite field has order `p` such that `p-1 % 256 == 0` ? (where 256 is the project width for Verkle tree)\n\nThe reasoning being that the scheme relies on having 256 roots of unity available which is only possible in the above case: if `p - 1` and 256 are not coprime, then the only Nth root of unity (here N = 256) is 1, at least according to https://crypto.stackexchange.com/questions/63614",
        "created_at": "2021-10-11T23:10:02.307000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Didn't read the scheme, but the SE post is misleading to say the least. There's a leap from `n` and `q-1` being coprime to `n` divides `q-1`. In general in a finite field of `q` element, there are `gcd(n, q-1)`  n-th roots of unity.  Now  the finite field has order `q = p^k` for `p` prime and `k` some positive integer number. If `p` is not the prime 2, then certainly you will have at least two 256-roots of unity  in F_q since q-1 is even. Your scheme though seems to require that you have 256 distinct roots of unity (I am assuming d=256 in the example you have in mind). And this can only happen indeed if 256 divides q-1.",
        "created_at": "2021-10-11T23:31:34.805000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "~~Edit: a browse of the scheme and is not clear to me that you need 256 distinct roots of unity, it seems to use that you have one w which is a 256 root of unity. which is weaker.~~ He does seem to imply that w^0, ... w^{d-1} are distinct, so you really want to have 256 dividing q-1.",
        "created_at": "2021-10-11T23:39:32.356000+00:00",
        "attachments": null
    }
]