[
    {
        "author": "kingnigus2900",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@273808422753796097\u003e",
        "created_at": "2021-06-26T15:06:30.205000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "what up",
        "created_at": "2021-06-26T15:06:36.540000+00:00",
        "attachments": null
    },
    {
        "author": "kingnigus2900",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Worried about quantum thing",
        "created_at": "2021-06-26T15:07:12.827000+00:00",
        "attachments": null
    },
    {
        "author": "kingnigus2900",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@814220334760853533\u003e",
        "created_at": "2021-06-26T15:08:02.819000+00:00",
        "attachments": null
    },
    {
        "author": "nicolas.alhaddad",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Quantum computers in theory help you solve prime factorization and discrete log faster than on a classical computer (asymptomatically faster). Most asymetric crypto (includes digital signatures used in blockchain) and key exchange nowadays depend on those two problems being hard to solve.  However, the state of the art quantum computers can't even compete with the processor on your phone and it will probably stay that way for the near future.\nAlso, if quantum computers were able to solve prime factorization and discrete log efficiently tomorrow you should also be worried about the current traditional financial system also collapsing (even ssh would break, making all the servers in the world vulnerable). \nWhat i meant was not only blockchains would suffer but also everything else. So to be consistent, you should also be worried about your bank, your stock exchange, your messages, your government's confidential documents...\n\nWhat quantum computers won't probably do is: break hash functions, break symmetric crypto (although it might lower the bits of security by half.)\n\n\nThat being said we already have quantum resistant crypto. And a Nist standard is already on the way. I expect it won't be hard to switch digital signature algorithms in a blockchain (Bitcoin is adding Schnorr signatures, I think ethereum are adding BLS signatures)",
        "created_at": "2021-06-26T15:53:47.817000+00:00",
        "attachments": null
    }
]