[
    {
        "author": "dstreit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hey \u003c@!814220334760853533\u003e , thanks for taking a look! Although this approach would result in shares with \"valid mnemonic words\", the shares would not be valid BIP-39 mnemonics.\n\nBIP-39 mnemonics have two components: entropy and a checksum (which is the first few characters of the SHA256 of the entropy). And, to make it more complicated, the divide between the two components is not between words. For example, a 12 word mnemonic has 132 bits total (11 x 12), including 128 bits of entropy and 4 bits of checksum.\n\nSo, this feels like it gets pretty dirty. We'd need to extract out the entropy bits from the generated shares, calculate the checksum and then create a different mnemonic, with the valid checksum. And then, we'd repeat this dance going the other direction.\n\nInstead, if we convert the mnemonic to bytes of entropy _before_ sharing, apply Shamir’s to those bytes, and then convert the resulting shares to BIP-39 mnemonics (ie using the shares as the entropy bytes, calculating the checksum, and converting to words), I believe we get a valid BIP-39 with less hassle than applying Shamir’s to the words directly. And, that would imply using GF(256) instead of GF(2048).\n\nThere is still a bit of a dance, from mnemonic to bytes, but it seems more straight forward to me. What do you think?",
        "created_at": "2021-04-04T23:30:08.116000+00:00",
        "attachments": null
    },
    {
        "author": "dstreit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Just realizing that I'm replying to you in both venues 🤦 . Happy to use either",
        "created_at": "2021-04-04T23:36:57.041000+00:00",
        "attachments": null
    },
    {
        "author": "nicolas.alhaddad",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!788428437441347584\u003e I don't think you really need \"valid BIP-39 mnemonics\" as shares.  Having shares as words is good enough for humans to read and write on a piece of paper?",
        "created_at": "2021-04-04T23:39:31.413000+00:00",
        "attachments": null
    },
    {
        "author": "dstreit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Welp, that may be true. My rationale was, if one share gets stolen, I want it to _look_ like it is the thing. If the mnemonics aren't valid, it might hint that it is one of a larger scheme?\n\nBut it is a good point. Am I over-engineering this? Is it fine to use arbitrary mnemonic for shares? Or, is there added value in the shares being standard BIP-39s, indistinguishable from any other?",
        "created_at": "2021-04-04T23:41:37.626000+00:00",
        "attachments": null
    },
    {
        "author": "nicolas.alhaddad",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!788428437441347584\u003e well if you really want that you can always do the cut and choose method. You can keep changing the random coefficients until you find the shares that have the special format you like (but you might be compromising the security of shamir secret sharing).",
        "created_at": "2021-04-04T23:43:37.717000+00:00",
        "attachments": null
    },
    {
        "author": "dstreit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That sounds pretty expensive...\n\nWhat's the issue with converting to bytes before applying Shamir's? Still seems simpler than trying to brute force discover a set of valid BIP-39 mnemonics, no?",
        "created_at": "2021-04-04T23:50:59.171000+00:00",
        "attachments": null
    }
]