[
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm curious why is `t\u003e0` in your comment? I would have thought the points `(1,1,0)` and `(1,-1,0)` to be the same",
        "created_at": "2021-10-08T02:10:48.530000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Oh that should say more than or less than 0",
        "created_at": "2021-10-08T09:35:26.150000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "AKA \"different than\"  😆",
        "created_at": "2021-10-08T09:56:33.103000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yep! Im not sure why I was trying to write “\u003e 0 or \u003c 0”, instead of just writing != 0 . Thanks for spotting 😄",
        "created_at": "2021-10-08T10:11:31.710000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "more importantly, something that strikes me as surprising from your comment though, is that most (if not all) mathematical software that I know will represent points internally in a normalized manner. So for example if you were in homogeneous coordinates and wanted to represent the point `(x:y:z)` in the patch where `x != 0` then you would either consider the unique representation with `x=1` if you are over a field, or divide by the gcd if you are over a domain. Something similar is adopted for Jacobian coordinates. So I would have expected the same to hold here, so that it would be a non-issue to compare two different representations of the same point. But I haven't read a single line of this code nor the PR, just pointing that storing points in a non-normalized way is non kosher. At the very least Sage, Singular and Macaulay 2 do this, specifically for elliptic curves as well.",
        "created_at": "2021-10-08T10:19:32.672000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My understanding was that points represented using projective co-ordinates should not be considered to be normalised. For example, here is an equals function on projective co-ordinates in code I've recently looked at: https://github.com/zkcrypto/bls12_381/blob/main/src/g1.rs#L465",
        "created_at": "2021-10-08T10:55:01.674000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Maybe it is the case in mathematical software that they are always normalised (?) I've not used enough of them to say",
        "created_at": "2021-10-08T10:57:18.110000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Here is also the (batch) normalise method in that repo: \u003chttps://github.com/zkcrypto/bls12_381/blob/main/src/g1.rs#L769\u003e I think we want to avoid frequently normalising in code because the main driving point for using Projective instead of  Affine co-ordinates is that you can avoid field inversions when doing point arithmetics, which are expensive",
        "created_at": "2021-10-08T11:01:06.859000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Here's the constructor that ultimately gets called in Sage when you construct a point in an elliptic curve, it doesn't matter what coordinate system you use. I highlighted the line with the normalization\nhttps://github.com/sagemath/sage/blob/develop/src/sage/schemes/projective/projective_point.py#L1002\nThis holds actually for any projective scheme. And Sage is built upon other software that actually handles the computations, so those have also normalized internal representations. But these are mostly symbolic math software. I am not acquainted (at all) with cryptographic libraries, so as you point the norm may be different than in the math community",
        "created_at": "2021-10-08T11:35:30.898000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "To be clear, does it also normalise after each operation? \n\nIn the library I linked, I think it’s also the same ; you can only construct a projective point from an affine point, but it’s not guaranteed that it stays normalised after each operation",
        "created_at": "2021-10-08T11:51:59.783000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah, that's the internal representation of the point, but the normalization depends on the base ring so you'll have to track the corresponding class",
        "created_at": "2021-10-08T11:57:37.688000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You could argue the same for points on the affine line: all libraries I know would store rational points by coprime pairs even though it's not necessary in principle",
        "created_at": "2021-10-08T12:01:19.619000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My library just stores Jacobian points as `{ x, y, z }`, and Affine points as `{ x, y }`... is that wrong?",
        "created_at": "2021-10-08T13:28:17.702000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is correct to me!",
        "created_at": "2021-10-08T14:04:02.652000+00:00",
        "attachments": null
    }
]