[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Can anyone here give me a brief summary of how BLS is used in ETH2?",
        "created_at": "2021-02-05T03:22:02.686000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I have put together a short document that briefly outlines what I believe is the core BLS conflict, and also proposes a risk mitigation strategy for Ethereum core developers.  I would love to get feedback/thoughts on it, and I'm especially interested in hearing from \u003c@!211091239112671234\u003e: https://notes.ethereum.org/@GW1ZUbNKR5iRjjKYx6_dJQ/Skxf3tNcg_",
        "created_at": "2021-02-05T03:50:01.553000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "left some comments",
        "created_at": "2021-02-05T09:50:03.183000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Question for the BLS and PoS experts in the house (perhaps \u003c@619357961923330051\u003e is or knows the right people):\n\nWhen proof of stake launches (ETH2), my understanding is that it will be using BLS under the hood as part of the consensus engine.  I presume that anonymous participants in the system are able to generate arbitrary signatures which are validated by clients, and data is recovered from the signature (e.g., public key recovery).  Is this correct?\n\nFollow-up to that, if one were to introduce a BLS precompile, would it have the *exact* same surface area for attacks, meaning that it would also accept signatures as inputs and be able to validate them and/or recover public keys from them?  Would it also include any *additional* surface area that is not present in the consensus code such as the ability to generate a signature from data and private key or something?",
        "created_at": "2021-02-05T10:03:47.680000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Note that BLS signatures don't have data recovery _i.e._ you can't fetch public key(s) from the signature.",
        "created_at": "2021-02-05T10:18:05.538000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "BTW regarding the doc: may it make sense to have a two-stage approach, where the first stage includes the codebase and uses it for merge-related consensus-type functionality, but does not expose the functionality to the EVM?  Then once the ETH1 devs are happy with the libraries and cryptography behind it they can then move to having a precompile?\n\n(Not sure if this is possible, probably depends on if BLS is required in the EVM from the first step of the merge)",
        "created_at": "2021-02-05T10:20:23.045000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Whether this makes sense or not depends on the answer to the above question I think.",
        "created_at": "2021-02-05T10:24:58.126000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If the surface area for precompile and consensus are the same, then we gain nothing by releasing consensus only first and precompile maybe later.  However, f the surface area is the same we gain quite a bit (IMO) of risk mitigation by releasing a precompile *first*, and consensus later.",
        "created_at": "2021-02-05T10:26:17.014000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If the surface area is different, then I agree with Holiman that the calculus is quite different.",
        "created_at": "2021-02-05T10:26:54.143000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Interesting, this is valuable to know, thanks!  So with BLS can you only sign and validate?  Are there any other interesting BLS operations one can do?",
        "created_at": "2021-02-05T10:27:26.629000+00:00",
        "attachments": null
    },
    {
        "author": "jgm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Aggregation is the big one.  You can aggregate keys and signatures.",
        "created_at": "2021-02-05T11:34:42.828000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminion",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We are also planning to use BLS operations for data availability checks in sharding. This is implemented via polynomial commitments. Yeah, I know this sounds like greek. Think of polynomial commitments as being a replacement for Merkle trees for proving things about data.",
        "created_at": "2021-02-05T12:23:06.295000+00:00",
        "attachments": null
    },
    {
        "author": "benjaminion",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(This is BLS12-381 operations, not BLS signature operations, which is a different BLS trio. Eth2 BLS signature operations happen to use BLS12-381 operations, but that's a coincidence 🙂)",
        "created_at": "2021-02-05T12:25:38.575000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What would be the smallest surface area required of a BLS library that provides all PoS functionality required for The Merge?",
        "created_at": "2021-02-05T12:33:03.222000+00:00",
        "attachments": null
    },
    {
        "author": "mratsim",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "faster batch forgery identification paper by Bernstein gives references to most techniques: https://eprint.iacr.org/2012/549",
        "created_at": "2021-02-05T14:35:34.022000+00:00",
        "attachments": null
    },
    {
        "author": "mratsim",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It's possible that Eth1 clients only need pairing for verification since they aren't expected to sign anything. In that case you would only need pairing + deserialization of signature (G2) and public key (G1) and hash-to-curve to map a message to an elliptic curve point",
        "created_at": "2021-02-05T14:37:46.714000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "No signature validation?  Or is that what \"pairing\" is (excuse my naivety)?",
        "created_at": "2021-02-05T14:38:57.694000+00:00",
        "attachments": null
    },
    {
        "author": "mratsim",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And as a bonus which can accelerate operation at least 128x you might want elliptic curve addition on G1 to aggregate multiple validators public keys. (up to 128 attestations in a block).",
        "created_at": "2021-02-05T14:39:01.138000+00:00",
        "attachments": null
    },
    {
        "author": "mratsim",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yes pairing is the primitive to implement verification",
        "created_at": "2021-02-05T14:39:12.964000+00:00",
        "attachments": null
    },
    {
        "author": "mratsim",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "AFAIK the kilic BLS PR added everything to Geth",
        "created_at": "2021-02-05T14:41:15.751000+00:00",
        "attachments": null
    },
    {
        "author": "mratsim",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Actually not only the batch forgery paper, here you go: https://github.com/mratsim/constantine/issues/35",
        "created_at": "2021-02-05T14:42:51.815000+00:00",
        "attachments": null
    }
]