[
    {
        "author": "paperliss",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm working on a project that is going to need a payment scaling solution. It involves 3rd parties collecting payment recites off-chain and then posting them in batches on-chain. I have yet to find great libraries for using STARK's in a blockchain context. Is there a good resource someone could point me to for this? Or should I be looking into plasma instead?",
        "created_at": "2022-09-13T04:27:36.990000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I recommend looking into some of the ZK Rollups that are under development.  While none of them are (IMO) worthy of being called L2s yet (as they all are permissioned/trusted), the underlying tech behind them is quite sound.",
        "created_at": "2022-09-13T10:04:01.796000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Some search terms: StarkWare, Cairo, Aztec, Circom, zkSync",
        "created_at": "2022-09-13T10:04:57.640000+00:00",
        "attachments": null
    },
    {
        "author": "lapdo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hey everyone, I have recently started writing my MSc thesis on the Quantum Threat and Ethereum, but currently i am still writing my research proposal. I will be analysing the current cryptography methods that are used in Eth and see how one would be able to make the network quantum-safe by integrating the appropriate post-quantum cryptography methods (e.g. the four finalists announced by NIST and potential other ones that are relevant). After this, i will look at technological barriers for implementation (compatibility, trade-offs etc.), while also looking into organisational obstacles (soft/hard fork). Is there anyone in here that can give me some advice/guidance on this particular topic. Thank you very much!!",
        "created_at": "2022-09-13T13:54:54.114000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Please don't cross-post.",
        "created_at": "2022-09-13T15:22:37.468000+00:00",
        "attachments": null
    },
    {
        "author": "lapdo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I am sorry, I just don’t know which specific server to post this.",
        "created_at": "2022-09-13T16:29:37.580000+00:00",
        "attachments": null
    },
    {
        "author": "lapdo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I initially presumed to post in here, but after searching ctrl f, I found that the topic of post quantum cryptography was mentioned in multiple servers, hence my action.",
        "created_at": "2022-09-13T16:30:38.432000+00:00",
        "attachments": null
    }
]