[
    {
        "author": "gottfriedherold",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Regarding efficient square root computations modulo p (with hardwired p, as is usually the case), where p - 1 = 2^n * m, i.e. binary representation of p ends with n-1 0s, followed by a 1.\n\nThere are various algorithms for that. Some algorithms do not depend on the value of n at all, whereas some do. Those that do not depend on n at all have a runtime of O(log p), but with a larger constant hidden in the O that the algorithms that depend on n.\nThe other algorithms basically split the square root computation into a part that only depends on m with complexity O(log m) and a 2-adic part\nTonelli-Shanks has a complexity of O(log m) + O(n^2).\nBernstein's improvement essentially improves the constant in the O(n^2) part at the expense of lookup-tables.\nThe Sarkar algorithm that you cite has O(log m) + O(n^3/2), again with potential improvements to the constant in the O(n^3/2)-part using lookup-tables.\n\nFor Bandersnatch, we have n = 32. The constants in the big-O are more important than the asymptotics here.\n\n While Naive Tonelli-Shanks is kind-of-bad for this case (the quadratic part dominates the running time), Bernstein's improvement to Tonelli-Shanks is enough to make the quadratic part no longer dominating.\nConcretely, the non-2-adic part requires 298 field ops, whereas the 2-adic part requires 34 field ops in my implementation for Bandersnatch (assuming I did not mess up the benchmarking).\n\nSarkar's algorithm would only slightly modify the 2-adic part. There is just no room for significant improvements here. Also note that the \"plain\" Sarkar algorithm without lookups is actually not competitive here.\nSarkar has made a Sage implementation public (as part of zcash) that I just tried out. If (that's a big if) I understand its benchmarking outputs correctly, running for n=32 gives a cost of 80 field ops (with the same lookup table size).\nSo it's actually *worse* than Tonelli-Shanks here. Sarkar's algorithm only starts to shine for larger values of n.",
        "created_at": "2023-05-24T15:32:17.166000+00:00",
        "attachments": null
    },
    {
        "author": "jsign",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thank you very much for the detailed explanation 🙏 \n\n\u003e Concretely, the non-2-adic part requires 298 field ops, whereas the 2-adic part requires 34 field ops in my implementation for Bandersnatch (assuming I did not mess up the benchmarking).\nI did that counting a while ago too (https://hackmd.io/1UTMmZqMRTOwPYTtql7Gdw#Detailed-comparison) and my results where 265 and 34 respectively. So, ~looks that's the case.",
        "created_at": "2023-05-24T16:31:50.050000+00:00",
        "attachments": null
    }
]