[
    {
        "author": "nicksaferesearch",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hey, sorry if this is not the correct channel for this question, but I had a question about EVM's `secp256k1::ecrecover` implementation.\n\nIt looks like Ethereum signature recovery only accepts recovery IDs (`v - 27`) of 0 or 1 (so, the yPairity bit of the recovery ID) but does no accept 2 or 3 in order to indicate that the `Rx` coordinate is greater than the curve order `N` (i.e. the signature's `r` value is `r = Rx - N`).\n\nAFAIU the chance of this happening is extremely small (~0.000000000000000000000000000000000000373% assuming uniform distribution of `Rx`). _\"It is almost impossible and the added complexity of handling this case isn't worth it\"_ is a valid reason to not allow `v` values of `29` and `30` of course, but was curious if the explicit rational for disallowing is documented anywhere? (I had originally thought it was something that was just inherited from Bitcoin from a long time ago, but it _looks_ like Bitcoin does support this, at least this wiki page seems to suggest it: https://en.bitcoin.it/wiki/Message_signing#Detailed_specification_of_the_message_signature).",
        "created_at": "2025-08-04T09:57:57.690000+00:00",
        "attachments": null
    },
    {
        "author": "daniellehrner",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It's defined in the yellow paper: https://ethereum.github.io/yellowpaper/paper.pdf\n\nAppendix E: Precompiled contracts (page 22), formula 212 specifically seems what yoou are looking for",
        "created_at": "2025-08-04T11:24:17.957000+00:00",
        "attachments": null
    },
    {
        "author": "nicksaferesearch",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Sorry if it wasn't clear - I am aware that the EVM is specified to only allow values `27` and `28` for `v` (i.e. only encode yParity). In fact, appendix F which describes the `ECDSARECOVER` function goes into some more detail as well:\n\n\u003e The recovery identifier is a 1 byte value specifying the parity and finiteness of the coordinates of the curve point for which `r` is the x-value; this value is in the range of [0, 3], however we declare the upper two possibilities, representing infinite values, invalid\n\nMy question was more _why_ was it chosen to be specified like this (as in, why did the specification for the precompile and `ECDSARECOVER` not say \"v can be any of `27`, `28`, `29` or `30`\" and \"this value is in the range [0, 3]\" respectively), and whether or not the rationale behind that decision is documented anywhere.\n\nI'm also not trying to change the behaviour or anything - I'm just curious 😛.",
        "created_at": "2025-08-04T12:17:43.023000+00:00",
        "attachments": null
    }
]