[
    {
        "author": "cperezz.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What's the point? Only CALLDATA size optimization I assume? Or simply that since we don't do MSM within EVM you actually won't feel the difference in perf?",
        "created_at": "2025-03-16T06:41:37.184000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My thinking is the following:\n\nFor precompiles and the evm in general, it’s important that the functions are deterministic wrt the state. So given a block and some state, I should always get the same output. \n\nFor elliptic curve precompiles, this means that they cannot/shouldn’t return projective/jacobian points because those have multiple representations. Or more precisely they should always return a canonical representation as the output.\nCurrently this is the affine representation/when z=1\n\nThis means that all point addition precompiles for bn254 for example will always have an inversion, which defeats one of the main purposes of jacobian/projective coordinates, if that is not amortized over multiple point additions.\n\nI would then try to do the addition in affine coordinates and do the inversion to compute the gradient/slope\n\nFor scalar mul with an unknown base, I think there are enough point additions to justify mixed addition with Jacobian points that amortise the cost of the inversion at the end",
        "created_at": "2025-03-16T11:36:27.792000+00:00",
        "attachments": null
    },
    {
        "author": "cperezz.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That's fair. Indeed what I thought that we won't amortize the cost.\nI agree then yup! Affine definitely is the less overcomplicated solution.\n\nAs for uniqueness/reproducibility, I don't think that matters as you should always reduce prior to return the result. That would solve it. But that means we eat up the inversion we were saving.",
        "created_at": "2025-03-16T12:53:41.303000+00:00",
        "attachments": null
    }
]