[
    {
        "author": "kipit",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Intuitively, this seems to be the best / easiest solution to implement. Why is it not the case \u003c@!364458974906548225\u003e ?",
        "created_at": "2021-07-15T10:26:01.056000+00:00",
        "attachments": []
    },
    {
        "author": "deme1744",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I actually assumed that this was the way to go, and for now, have implemented findnodes/nodes portal message types, by just using the base routing table of discv5 (This is in fluffy). \nIt would indeed require some additional info in the ENR, and eventually might make use of the topic advertisement system when this gets added in discv5.\nHaving 6 additional routing tables seems...ugh. But perhaps it will be needed to find useful nodes quick enough..?",
        "created_at": "2021-07-15T13:02:53.951000+00:00",
        "attachments": []
    },
    {
        "author": "jacobkaufmann",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Even if you have a single routing table, you will have to maintain some per-sub-protocol information on the nodes in that table to track which sub-protocol(s) each node participates in, correct? I don't know that there's any way to get around logically maintaining a routing table for each sub-protocol",
        "created_at": "2021-07-15T13:08:05.209000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Combining routing tables isn't viable. Explanation in a bit when I have a minute to write it down.",
        "created_at": "2021-07-15T13:09:00.029000+00:00",
        "attachments": []
    },
    {
        "author": "deme1744",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "You'd have that data in the ENRs. But yeah, you'd need some additional information probably stored per node per sub-protocol, like radius and such. Data that comes from the sub protocols basically.",
        "created_at": "2021-07-15T13:09:24.939000+00:00",
        "attachments": []
    },
    {
        "author": "jacobkaufmann",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yeah, but even if that data is in the ENR, my thought is that you would want some structure on top of that so that you don't have to filter the routing table each time based on ENR information, so effectively you have separate routing tables",
        "created_at": "2021-07-15T13:13:15.450000+00:00",
        "attachments": []
    },
    {
        "author": "deme1744",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Sure, you could do that. But be aware, that not all the nodes you contact will come from the routing table. A lookup will start from the routing table, but might eventually lead to a node that you will not store in the routing table.",
        "created_at": "2021-07-15T13:14:13.004000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Primary reason is that there is limited space on each routing table bucket and you would end up in a degenerate state where a bucket is full but also has no entries for a given sub-protocol.",
        "created_at": "2021-07-15T13:14:28.851000+00:00",
        "attachments": []
    },
    {
        "author": "deme1744",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Sure, but that is why we have lookups, no?",
        "created_at": "2021-07-15T13:14:50.581000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "No, we have lookups to be able to quickly and effectively navigate the network without requiring individual nodes to have full information.",
        "created_at": "2021-07-15T13:16:19.611000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "And this makes that worse/less effective",
        "created_at": "2021-07-15T13:16:33.110000+00:00",
        "attachments": []
    },
    {
        "author": "deme1744",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yeah, it will add delay, no doubt. But you could still do a first initial lookup, to get more nodes near that ID, and then do the data lookup on those.",
        "created_at": "2021-07-15T13:19:22.416000+00:00",
        "attachments": []
    },
    {
        "author": "deme1744",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I personally wouldn't really dismiss it as not viable, without further testing/looking into this.",
        "created_at": "2021-07-15T13:21:29.221000+00:00",
        "attachments": []
    },
    {
        "author": "ogenev",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Overlay network makes total sense to me, I thought that this was the plan from the beginning, didn't expected 6 PING/PONG specifications, one for every sub-protocol 🙂",
        "created_at": "2021-07-15T13:33:26.300000+00:00",
        "attachments": []
    },
    {
        "author": "ogenev",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "is this limit 16 node entries?",
        "created_at": "2021-07-15T14:03:51.320000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yes, 16 tends to be the reasonable limit.",
        "created_at": "2021-07-15T14:12:07.270000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "So this delay translates directly into increasing then total number of round trips necessary for network lookups which translates directly into user facing performance, and my expectation would be that it would be in the 5-20% range in terms of how much additional overhead would be incurred by this.  Assuming this is correct (which it may not be), that means incurring a 5-20% performance penalty for saving ~10kb of memory and a small amount of management overhead for the additional routing tables.  You also incur some additional maintenance cost by having a non-homogenous routing table for which you have to filter every lookup.",
        "created_at": "2021-07-15T14:16:24.790000+00:00",
        "attachments": []
    },
    {
        "author": "deme1744",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yeah, that all makes sense. I'm just a bit conservative when adding complexity for performance improvement that is perhaps not required (I was also wondering if there are security implications, but probably not, considering the amount of nodes on the different networks will be similar). Anyway, I get that in portal the amount of lookups is very important as it is directly related to the UX, and that this might already be an issue without this additional delay.\nLooking at it a bit more, I guess there is also a complexity added by going the single DHT route, the overhead you talk off, additional filtering on findContent (like the enrs you return there in case of no content), and the fact that you'd need still some table per sub-protocol with subprotocol specific data anyway. And the different DHTs allows you to abstract the whole thing even from discv5 (not that this is such a good reason, but ok). So it seems justified ... I think 🙂",
        "created_at": "2021-07-15T15:26:31.549000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Lots of quick replies by myself this morning on my phone between dropping kids at school and morning gym workout.  I appreciate the push back.  I get stuff wrong all the time and I'm always happy to defend my ideas and have them scrutinized.",
        "created_at": "2021-07-15T15:28:51.665000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm not 100% sure that a client implementation couldn't find a clean API using some kind of merged routing table.",
        "created_at": "2021-07-15T15:29:32.552000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "If you had a single routing table, how would you guarantee you kept a even single node for a given subprotocol? Couldn't you lose all information about the portal network?",
        "created_at": "2021-07-15T15:31:13.091000+00:00",
        "attachments": []
    },
    {
        "author": "deme1744",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Well, you might not indeed. But the Global DHT should have them somewhere ;). But sure, this is the delay we talk about, to get those nodes, each time again, for each piece of data you need.",
        "created_at": "2021-07-15T15:32:44.350000+00:00",
        "attachments": []
    },
    {
        "author": "deme1744",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Because if you could not guarantee even that, then how would you bootstrap your specific routing tables, starting from the discv5 routing table?",
        "created_at": "2021-07-15T15:33:34.792000+00:00",
        "attachments": []
    }
]