[
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Just stumbled across this repository: https://github.com/InsideTheSim/ethmerge.com-content\n\nThere's some sort of build process that turns that into this: https://ethmerge.com/",
        "created_at": "2021-05-13T20:35:33.608000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Specifically, I like the way the FAQ stuff is organized there.  Easy for people to come and tweak language and improve explanations.  Those of you who are part of one of the portal client development teams, it may be worth starting an \"implementers\" guide sometime soon as you figure things out....  Similarly, there is probably room for a general FAQ about the portal network and any of the topics contained within.",
        "created_at": "2021-05-13T20:37:54.346000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "(And kudos to \u003c@456226577798135808\u003e and \u003c@!439193900096290816\u003e for getting the content written up for the high level network requirements",
        "created_at": "2021-05-13T20:38:33.174000+00:00",
        "attachments": []
    },
    {
        "author": "vorot93",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@364458974906548225\u003e what are the exact problems that prevent state network from seeding flat state?",
        "created_at": "2021-05-13T20:51:39.438000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Loosely stated requirements of the network are that the state data is A) a node can determine *where* in the network they need to look for a piece of state and B) that each node can decide how much state they need to store.\n\nThis requires some scheme under which the state data is \"spread\" across all the nodes in the network in a balanced manner.  If we ignore contract storage (which is the problem data I'll explain in a moment), then the account trie is naturally balanced.  We could then spread out the \"flat\" state data across all the nodes in the network.  Each node would be ultimately responsible for the trie data that is *closest* to them using some sort of simple distance metric based on the trie path where the data is in the trie.  Each node would store a contiguous section of the trie (leaf data and the proof for those leaves) and probably some state diffs so that they could serve data across multiple recent state roots.  Nodes that want to store a very small amount of data would only store a few leaves.  Nodes that wish to store a **lot** of data would store a wider swath of the trie.\n\nThis all works great for the account trie.  But once you add in the contract storage tries, things go sideways.  I don't know that this problem is unsolveable, but I haven't found a way to solve it after a lot of searching.  I'm not aware of any scheme for spreading the data out in the network that allows for the data to be evenly spread out across all of the nodes while also preserving the requirement (A) that someone searching for the data can figure out which nodes in the network are supposed to have it.  The trie stops being balanced when you add on the contract storage under the current storage layout.",
        "created_at": "2021-05-13T22:12:00.145000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Happy to clarify any part of this.",
        "created_at": "2021-05-13T22:12:28.778000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Isn't there a proposal to get rid of the nested structure for contract storage and turn Ethereum state into a simple key-value store?",
        "created_at": "2021-05-13T22:31:05.049000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "yes",
        "created_at": "2021-05-13T22:31:14.060000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Well, the structure that I am proposing is a structure that can be interpreted in two different ways",
        "created_at": "2021-05-13T22:31:33.052000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "One interpretation is it's a trie-of-commitments (so the second layer is just a single commitment, not a trie)",
        "created_at": "2021-05-13T22:31:49.896000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The other interpretation is that it's a key/value trie, but where extension nodes go up to 31 bytes and the 32nd byte is always a branch node",
        "created_at": "2021-05-13T22:32:11.450000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think \u003c@364458974906548225\u003e has indicated previously that they are trying to design the state network around current Ethereum, rather than potential future Ethereum.  I wonder if this is a big enough issue to alter that course?",
        "created_at": "2021-05-13T22:33:23.581000+00:00",
        "attachments": []
    },
    {
        "author": "jason.carver",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This is about Verkle tries? It seems unlikely that any state refactor would hit mainnet before mid-late 2022. I'd like to see the state network launched before that, so I'm not convinced it's worth redirecting the current effort.",
        "created_at": "2021-05-13T22:47:41.761000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "yeah you're not going to fix state unevenness before verkle trees imo",
        "created_at": "2021-05-13T22:50:37.757000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "So if there's a way to launch something that doesn't depend on state being uniform but has weaker functionality at the beginning, I could see that being a decent path",
        "created_at": "2021-05-13T22:51:14.778000+00:00",
        "attachments": []
    }
]