[
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "We've had a really good week of on-site in-person discussions.  Most everything has been centered on state network, though we did walk through designs for the other networks.  Next steps are going to be getting everything we figured out written down clearly and then walking through it with those of you that are interested.",
        "created_at": "2021-08-20T15:02:02.255000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There's really only two major highlights, 1) we both figured out that the O(1) storage layout for state results in an inability to get exclusion proofs for most contract storage.  The solution we've figured out is to actually model the network in both ways, allowing data to be retrieved either as O(1) direct access to leaf data, or to use GetNodeData style trie walking as a fallback for exclusion proofs.  2) adding support back into the network for GetNodeData style retrieval is going to be part of the new gossip procedure that we've got worked out.",
        "created_at": "2021-08-20T15:05:58.911000+00:00",
        "attachments": null
    },
    {
        "author": "thiago_crowdtainer",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "i am a little worried about this: by leaving mobile/browser as a an after-thought, portal network risks putting itself in a spot where it is neither a super light client (think smartphone mobile apps) and also doesn't act as \"the replacement for infura\", since it falls more into the buckets of \"full nodes\", albeit with a sort of distributed database. Meaning, if portal network nodes need to be online most of the time and have low churn, I might as well put it into a computer with 100GB or more of storage and a 24//7 good internet connection. In which case it is mostly back to the current situation except eth clients are now more inclusive because the \"hardware barrier\" is lower (thus helping decentralization) for eth clients. Of course this also helps on the long-term sustainability front which is greatly alleviated; But, this big issue remains on what to do with clients that need to quickly (within a few  seconds) know what the tip of the chain is, read data and send transactions with those tricky rpc calls, but is otherwise most of the time offline and can't contribute resources at all to the network. The current hope seems to be that there will be so many portal network nodes (since it is cheaper to run an eth client with portal network for its database then otherwise), that enough such  nodes would be willing to altruistically serve mobile and browser users.",
        "created_at": "2021-08-20T19:14:57.916000+00:00",
        "attachments": null
    },
    {
        "author": "thiago_crowdtainer",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This could also work but seems to have the same risks as with what we’ve seen with the old server/client model in geth where full nodes simply don't want to serve these \"leechy\" users",
        "created_at": "2021-08-20T19:20:22.890000+00:00",
        "attachments": null
    },
    {
        "author": "thiago_crowdtainer",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm not saying the current portal network design isn't good, but just something I wish people would think more about",
        "created_at": "2021-08-20T19:21:37.721000+00:00",
        "attachments": null
    },
    {
        "author": "thiago_crowdtainer",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "however, if stateless paradigm gives enough \"cryptographic confidence\" for light clients to be safe interacting with all their needed apis (including the hard to achieve rpc calls), then it might not be a huge problem to have the \"infura model\"; My knowledge is not good enough to tell whether this statement is true or not though, maybe someone can correct me.",
        "created_at": "2021-08-20T19:25:35.033000+00:00",
        "attachments": null
    },
    {
        "author": "thiago_crowdtainer",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "looking forward to the write-ups!",
        "created_at": "2021-08-20T19:26:40.867000+00:00",
        "attachments": null
    }
]