[
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "implementers call..... NOW!!!! 🤓    https://us02web.zoom.us/j/82763999854?pwd=Uy9sR1ZxeUJhc0crckFKanV5VERCdz09",
        "created_at": "2021-08-31T14:59:26.347000+00:00",
        "attachments": []
    },
    {
        "author": "jacobkaufmann",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "What are the implications (if any) of the new state network design (with both GetNodeData and O(1) leaf) with respect to the load balancing issue Jason brought up the other week, where the holders of e.g. the Uniswap contract are going to be disproportionately hammered with requests and state updates\n\nIt's not obvious to me how the changes would affect that issue at all. The pre-existing `POKE` mechanism appears to be responsible for alleviating the issue, but IIRC this mechanism was around at the time of the original discussion and might be insufficient for dealing with mega-popular contracts",
        "created_at": "2021-08-31T16:08:50.056000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "New design that duplicates storage will in theory provide \"some\" alleviation since the nodes holding the block state root node are no longer the single global entry point into the state. But there are still going to be hot spots (like the uniswap contact) and those hot spots will exist on static locations meaning a node that ends up responsible for a popular account or popular piece of state is going to continually be on that position of responsibility under the O(1) storage model,even as the account or storage value changes....so there may be \"undesirable\" posts of the keyspace which experience ongoing high load.",
        "created_at": "2021-08-31T20:22:32.415000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This is something I expect us to have to mitigate but my preference would be to only do said mitigation once the problem can be observed and measured, otherwise we may not be able to make how effective or solution actually is",
        "created_at": "2021-08-31T20:23:55.791000+00:00",
        "attachments": []
    }
]