[
    {
        "author": "jacobkaufmann",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Here's my first draft of a basic chain history specification: https://hackmd.io/ctTNH9xsSu2ci9DeGidUsQ?view\n\nAll feedback welcome and appreciated. I figure it's better to get feedback early so that we can agree on some basic structures and begin to implement them.\n\nI'm not sure whether `radius` values should be part of the ENR. This appears to be the only sub-protocol specific node information to communicate. In my experience, flexible key-value structures like the ENR are easy to abuse and can make implementations less straightforward, so my preference is to keep it external to ENR and keep ENR minimal",
        "created_at": "2021-07-19T13:50:20.709000+00:00",
        "attachments": []
    },
    {
        "author": "konrads1315",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "just fyi \u003c@!694014391288332358\u003e  I got some nice answers from Piper about chain history network in this github thread - https://github.com/ethereum/stateless-ethereum-specs/issues/66 (maybe there will be something useful there for this new spec)",
        "created_at": "2021-07-19T14:10:00.161000+00:00",
        "attachments": []
    },
    {
        "author": "jacobkaufmann",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Nice, thanks for sharing!",
        "created_at": "2021-07-19T14:17:00.419000+00:00",
        "attachments": []
    },
    {
        "author": "mike.ferris",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!694014391288332358\u003e re: radius in the ENR, vs in the PING/PONG (which is the only current alternative as far as I can tell), this doc points out that checking node liveness (or checking radius) via Ping everytime a node is added to the table is a DoS vector: https://github.com/ethereum/devp2p/blob/master/discv5/discv5-theory.md#table-maintenance-in-practice, so we can't guarantee that we'll immediately have a radius after we get a NODES message",
        "created_at": "2021-07-19T14:55:04.953000+00:00",
        "attachments": []
    },
    {
        "author": "mike.ferris",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "so ENR might be the best way. I do agree about abuse/bloat (is there precedent for what should and shouldn't be added to the ENR?), but I wonder what you mean by make implementations less straight forward. Once you've got the ENRs it seems pretty trivial to extra key/value pairs.",
        "created_at": "2021-07-19T14:56:04.280000+00:00",
        "attachments": []
    },
    {
        "author": "mike.ferris",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "or if we want to leave them out of the ENR, we could just add them to the NODES message: `Container(total: uint8, enrs: List[Bytes, 32], radii: List[Bytes, 32])`",
        "created_at": "2021-07-19T15:00:08.006000+00:00",
        "attachments": []
    },
    {
        "author": "jacobkaufmann",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Thanks for taking a look. The bloat is my main worry in adding stuff to the ENR. And by less straightforward, I mean that if we begin to add more protocol-specific things to the ENR, the logic to interpret the ENR could become messy as opposed to representing that information in a separate structure(s) that's easier to reason about/more explicit.\n\nAbout the node checks via `PING`. I think that's a good point that we may want to include radius information in the `NODES` response.\n\nCan you leave those comments on the doc? Might be better to track the discussion there",
        "created_at": "2021-07-19T15:49:59.194000+00:00",
        "attachments": []
    },
    {
        "author": "mike.ferris",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Will do. Thanks for making this doc btw.",
        "created_at": "2021-07-19T15:50:45.148000+00:00",
        "attachments": []
    },
    {
        "author": "mike.ferris",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "another point against using the ENRs is that the radius updates quickly after hitting the storage limit, and each ENR update requires publishing it to a bunch of peers who don't necessarily care",
        "created_at": "2021-07-19T16:02:46.278000+00:00",
        "attachments": []
    },
    {
        "author": "jacobkaufmann",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Right. Putting dynamic information in the ENR would add overhead for a node and its neighbors in each sub-protocol or overlay network it participates in (assuming it uses the same ENR for all)",
        "created_at": "2021-07-19T16:21:41.856000+00:00",
        "attachments": []
    }
]