[
    {
        "author": "mike.ferris",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!364458974906548225\u003e Very clear document, thank you! I have two related questions:\n- could the accumulator root eventually be added to the block header? Or is there a reason that would never happen? \n- did the Alexandria POC ever implement any accumulator functionality? It doesn't seem to, based off searching \"accumulator\" etc in what I think is the most recent version:  https://github.com/ethereum/ddht/tree/master/ddht/v5_1/alexandria",
        "created_at": "2021-07-08T00:09:04.997000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "1: there is nothing keeping it out of the block header other than the overhead of getting it through the eip process and implemented in the clients. We should try to make this happen in the next hard fork but it might be a hard sell.\n\n2: yes, it was implemented. Probably in a branch on my  fork of the ddht/Alexandria python code. I'm on my phone so I can't dig it up right now. I'll try to remember to give it for you.",
        "created_at": "2021-07-08T01:41:46.729000+00:00",
        "attachments": []
    },
    {
        "author": "mike.ferris",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "great, thanks! I'll remind you on the CDAP call tomorrow. Random question: why do a lot of your commits to the ddht and alexandria repos only have the commit message \"d\"?",
        "created_at": "2021-07-08T02:44:27.324000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "We don't need no stinking commit messages 🤣",
        "created_at": "2021-07-08T02:45:55.318000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!843971820994822184\u003e here's the accumulator: https://github.com/pipermerriam/ddht/blob/0d943f564d6102aabf7d5fd499251b002c7401ee/ddht/tools/exfiltration.py",
        "created_at": "2021-07-08T04:01:28.581000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "so the commit message \"d\".  is short for \"dirty\" which is me committing work that doesn't fall into a clean commit.  When I'm in \"figure it out\" mode, I pile these up, and once I've got things worked out, I rebase them all away into well contained logical commits....  except that alexandria and ddht were proof-of-concepts and I was working \"fast and loose\" to just hammer out the functionality that I was experimenting with, so that later step of rebasing and cleaning up stopped happening, and even the code review stopped happening....",
        "created_at": "2021-07-08T04:03:40.612000+00:00",
        "attachments": []
    },
    {
        "author": "mike.ferris",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Myself, \u003c@!403199329520713728\u003e, \u003c@!556982778684637185\u003e, and \u003c@!690224518383534174\u003e (all CDAP) are planning on working on Trin's chain history network implementation, and likely the transaction gossip implementation afterwards or concurrently (depending on the prior work's momentum). If that steps on anyone's toes, or if you'd like to join us definitely let us know!",
        "created_at": "2021-07-08T15:30:42.986000+00:00",
        "attachments": []
    }
]