[
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I have a note on my calendar that there is something stateless happening soon.  Is my calendar telling me the truth?",
        "created_at": "2021-02-23T15:48:35.905000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yes, in 1 minute there's a call!",
        "created_at": "2021-02-23T15:59:51.027000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "IIRC it's to discuss the various state rent/stateless/regenesis proposals that have popped up over the past few weeks",
        "created_at": "2021-02-23T16:00:06.079000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Verkle Tries!",
        "created_at": "2021-02-23T16:00:51.625000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "public stateless call is going long,  will move into our \"network research call\" here in a few minutes once the public call concludes",
        "created_at": "2021-02-23T17:02:55.083000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Oh, I missed that one",
        "created_at": "2021-02-23T17:03:46.076000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "(it is being recorded, poke robert/joseph after the call and they should be able to give you the recording link)",
        "created_at": "2021-02-23T17:04:14.110000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "ok, thank you",
        "created_at": "2021-02-23T17:04:21.763000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "network research call happening in 5 minutes: https://us02web.zoom.us/j/82318873396?pwd=K0hoeFhkRk9OWHFJeXl5S1RnanBoQT09",
        "created_at": "2021-02-23T17:06:14.453000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!425615769280315392\u003e to expand on the idea of having benevolent nodes regularly \"Walk\" the full state and gossip it into the network.  There might be value in our previous merry-go-round ideas.  Define an `EPOCH` size.  Use `block.hash` at the epoch boundary to pick a location in the trie to start enumerating the state from...  Walk outwards from that location for the duration of the epoch... rinse-repeat.\n\nThis gives us effectively two types of gossip messages.\n\n1. new trie data that was produced in a recent block.  Can we easily validate that data is \"new\" to the trie?  Validation of this seems to require looking into the previous state root and walking the trie to the location of the new node to see that it wasn't there on the prior state root.... If validation requires requesting data from the network, that probably opens us up to some form of amplification attacks...  which might mean that these type of *ingress* proofs would need to provide both an exclusion proof against the previous state root, and an inclusion proof against the new state root.... which is kind of ugly....  \n2. merry-go-round messages.  Validation of these messages would be something like A) is it against the state root for the most recent epoch boundary block and B) is the proven data close-enough to the `block.hash` (what does close enough mean?)",
        "created_at": "2021-02-23T20:06:13.997000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The merry-go-round concept is in-effective against enumerating large contract storages... so that is unsolved if implemented naively.",
        "created_at": "2021-02-23T20:07:35.885000+00:00",
        "attachments": []
    },
    {
        "author": "jason.carver",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!364458974906548225\u003e Hm, setting aside the MgR, let's revisit this idea that nodes always rebroadcast valid received data. That seems like a problematic amplification vector for network traffic. Maybe:\n1. only rebroadcast data if it's not locally stored\n2. a date on every key for the last time it was broadcast, and a non-rebroadcast window since the date\n3. something probabilistic, only rebroadcast to \u003c1 peer on average if the data is already present\n\nFor reference, this reason for bringing up the full-state scan was to make the LRU version of garbage collection work. In that context, we already had to track the data for #2 above anyway, so it seemed like the natural choice. Maybe things change with deletion proofs, though I'm not sure quite how, yet. We still seem to have to solve the traffic amplification.",
        "created_at": "2021-02-23T21:50:55.982000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Has the DHT poke strategy been completely explored and eliminated as an alternative to gossiping?\n\nInstead of a variable radius, have a fixed radius. More powerful machines would advertise multiple nodeids and radii (not sure this would work in practice, but could work something out with announcements instead.)\n\nAs you search for a particular piece of state, record a list of the peers you searched on the way to your target.\n\nOnce you find your target data, POKE it back to each of the nodes you searched on the way there.",
        "created_at": "2021-02-23T22:03:24.965000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!689161464829050960\u003e I've considered it but I haven't written anything down for it.  I think this can be done without needing to use a fixed radius as you would learn about the advertised radius of each node as you navigate towards the content and then you POKE it back at the nodes you asked along the way who's radius contains the requested content.",
        "created_at": "2021-02-23T23:48:31.649000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "this has the really beneficial property of automatically replicating/spreading content that is being actively requested",
        "created_at": "2021-02-23T23:49:10.414000+00:00",
        "attachments": []
    }
]