[
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@364458974906548225\u003e I would like to push back a little bit on your claim that a stateless client today wouldn't be valuable on its own.  I tentatively argue that if we were to build a stateless client of the form we have been talking about, people would still need infrastructure providers like Infura but they would no longer need to *trust* those infrastructure providers.  A user could run a small stateless client (potentially even in their browser) and point that at some infrastructure as a service provider like Infura for data access.  They would not need to trust that the data from this provider is accurate because as a stateless client they would be able to validate all proofs provided by that infrastructure provider.",
        "created_at": "2021-02-03T03:57:10.658000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "As an example, if someone wants to do an `eth_call`, the stateless client would ask the backing infrastructure provider for a proof of the `eth_call`, but that proof could be fully validated by the stateless client in-memory.",
        "created_at": "2021-02-03T03:57:49.487000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "While this seems like a minor thing, it has potential to allow people to use completely untrusted infrastructure providers. We could potentially create a network of infrastructure providers (maybe even discoverable via P2P network in the light clients) that stateless clients can connect to.",
        "created_at": "2021-02-03T03:58:48.264000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This to me feels like a big win over the status quo, even if we never are able to achieve a fully stateless world like you are imagining.",
        "created_at": "2021-02-03T03:59:27.208000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Perhaps I'm missing something about the levels of trust required for a stateless client, or my analysis of the utility of an IaaS backed stateless client is incorrect?",
        "created_at": "2021-02-03T04:00:11.695000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e please correct me if I'm mis-understanding\n\nyour argument doesn't seem to be that a stateless client would be useful on it's own (without the extra JSON-RPC functionality).  but rather that we could make a useful stateless client that used block witnesses in combination with a centralized provider to fulfill the rest of the client functionality.",
        "created_at": "2021-02-03T14:42:06.655000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I suppose that is a reasonable interpretation, and you and I are just drawing lines in different places (but the specific placement of the lines doesn't actually matter).",
        "created_at": "2021-02-03T14:43:20.407000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Fell free to re-interpret my above as a proposal for a potentially easy path to useful statelessness.  🙂",
        "created_at": "2021-02-03T14:43:45.506000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I believe such a design would be simpler than some of the designs you have proposed, and thus let us get *something* out the door sooner while we work on a better long term solution (fully decentralized).",
        "created_at": "2021-02-03T14:44:41.558000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "My goals are: trustless and censorship resistant.  I actually don't care much about decentralized, other than that is *often* a good solution to achieving trustless and censorship resistant.",
        "created_at": "2021-02-03T14:45:05.157000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I believe we can greatly improve trustlessness and censorship resistance by building what I proposed above, and I don't think it requires solving any new hard problems beyond what we have been talking about regarding stateless Ethereum.",
        "created_at": "2021-02-03T14:45:33.093000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Certainly a lot of engineering still, but mostly just \"integration work\" rather than \"research work\" (beyond the stateless stuff itself of course).",
        "created_at": "2021-02-03T14:46:49.511000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I appreciate these perspectives (still getting my kids ready for school, I'll get you a real response a bit later once my day formally starts)",
        "created_at": "2021-02-03T14:50:41.180000+00:00",
        "attachments": null
    },
    {
        "author": "0xraino",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@364458974906548225\u003e be like: \"wait, so I maybe I don't need to pull all my hair out?\"",
        "created_at": "2021-02-03T14:54:20.584000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Heh, I think Piper still needs to pull all their hair out so we can get something better than the intermediate solution I proposed above.  😛",
        "created_at": "2021-02-03T14:55:35.317000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "🧑‍🦲",
        "created_at": "2021-02-03T14:55:41.597000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The intermediate solution above is actually a nice way to prototype the real thing so I like the idea.  I just am not moved to displace the larger solution with it.",
        "created_at": "2021-02-03T14:59:46.527000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I am not either.  🙂",
        "created_at": "2021-02-03T15:00:44.325000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "However, I think if we are unable to solve the harder problem of fully functioning light clients, it would still be worth it to build stateless even if it only got us the intermediate solution.",
        "created_at": "2021-02-03T15:01:27.908000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Basically, I agree with your sentiment that we shouldn't build out a stateless solution that isn't actually useful by anyone.  I only argue that I think this intermediate solution is \"good enough\" to be useful to a lot of people (compared to status quo) and thus it is worth pushing forward on stateless without waiting to fully solve the stuff you are working on.",
        "created_at": "2021-02-03T15:02:21.052000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "(just to write it out, not to argue as it seems we're not in any real disagreement)\nThe larger solution:\n\n- fixes the un-enforceable assumption that all clients have the chain history via the chain history network, allowing existing clients to clear out almost 200GB of HDD footprint.\n- fixes the un-enforceable assumption that all clients hold the full state, allowing things like stateless clients and UX improvements like beam sync\n- gives us actually light clients\n- makes building full clients easier\n- gives current clients more options for how they build their client functionality.  The client landscape might finally look meaningfully different afterwards\n- gives us infrastructure that is well suited to support regenesis or other mechanisms that sweep active state into an official \"cold\" status.\n \nI don't think doing this actually slows down any of the current stateless efforts.  It doesn't de-prioritize anything on the existing roadmap or suggest we slow down work on reducing witness sizes or enshrining witnesses in the protocol.",
        "created_at": "2021-02-03T15:10:09.576000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Was there a recording of this call?",
        "created_at": "2021-02-03T15:20:17.645000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "No, but call notes available on request (publicly editable so not sharing link in this channel right now)",
        "created_at": "2021-02-03T15:31:05.070000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!301186049323958275\u003e I'm moving this to \u003c#688075293562503241\u003e because it's more applicable there",
        "created_at": "2021-02-03T18:04:19.875000+00:00",
        "attachments": null
    }
]