[
    {
        "author": "samwilsn",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Totally forgot to reply to this ^^;;\n\nIf you walk the global DHT for nodes closer to your target, there's no guarantee that the closer you get, the more likely you'll find a node which speaks your subprotocol, right? So essentially you lose all the nice properties a DHT gives you, and you'll end up just randomly walking the entire network until you happen across a node that is close and speaks the subprotocol.",
        "created_at": "2021-07-16T17:25:37.107000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e.\u003e",
        "created_at": "2021-07-16T17:26:45.848000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c.\u003c",
        "created_at": "2021-07-16T17:26:47.382000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think.",
        "created_at": "2021-07-16T17:26:49.470000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!689161464829050960\u003e my mental model lines up with your thinking",
        "created_at": "2021-07-16T17:52:40.536000+00:00",
        "attachments": []
    },
    {
        "author": "mike.ferris",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!364458974906548225\u003e kind of bikeshedding here, but why call them \"overlay\" network and \"content\" network when they both seem to be overlay networks? If i'm understanding correctly they could instead be called \"routing-overlay\" and \"content-overlay\"",
        "created_at": "2021-07-16T17:59:23.481000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "The distinction may not be necessary but I **do think** that it is necessary.  Things like state and history are both going to use both.  I'm not sure about transaction gossip.  I don't think that the \"content\" network will actually be the right tool for transaction gossip.  If that is true, then bundling them together means that tx gossip network doesn't end up using the \"content\" parts.\n\nThe reason I am not sure tx gossip will use the \"content\" network stuff is that data in that network doesn't \"live\" anywhere specific.  You don't go find a transaction the way you find a piece of state data or history.  Instead the transactions \"flow\" around the network freely but ephemerally and you as a node passively discover, receive, and propagate the transactions around the network.  For this we do still need something like uTP since transactions can exceed the UDP packet size, but we don't need FINDCONTENT/FOUNDCONTENT.",
        "created_at": "2021-07-16T18:05:11.785000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "our functionality graph looks something like:\n\n- overlay stands on its own\n- uTP stands on its own\n- content stands on top of overlay \u0026 uTP\n- maybe a generic gossip protocol that stands on overlay and uTP (but I'm doubtful that this abstraction makes senses because tx gossip and header gossip both work very differently so doing them custom seems more appropriate)",
        "created_at": "2021-07-16T18:06:39.518000+00:00",
        "attachments": []
    },
    {
        "author": "deme1744",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Right, good point regarding the walking towards a target. Makes sense that this property is not necessarily upheld indeed. I guess the point I was rather trying to make was towards the guarantee in the original question.",
        "created_at": "2021-07-16T21:21:56.642000+00:00",
        "attachments": []
    },
    {
        "author": "samwilsn",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Right that makes sense. I guess my train of thought was that if you keep at least one subprotocol node you have an entry point to start from.",
        "created_at": "2021-07-16T21:23:08.003000+00:00",
        "attachments": []
    },
    {
        "author": "deme1744",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yeah, in practice not really be an issue, there will be sufficient nodes. But even if it is, random target searches should lead you to them eventually.",
        "created_at": "2021-07-16T21:24:09.644000+00:00",
        "attachments": []
    },
    {
        "author": "deme1744",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "And then when you can swap to the specific DHT they are on, your are settled, and don't have the issues of the common DHT",
        "created_at": "2021-07-16T21:24:37.708000+00:00",
        "attachments": []
    }
]