[
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "We're starting to try and disprove the approach that I'm going to start referring to as the \"GetNodeData DHT\".  A DHT that simply stores all trie nodes by their hash.  We have a few open questions that we are going to try and get concrete answers for:\n\n1. At expected latencies and number of networking round trips required to retrieve trie data, how much time do we expect it to take to do gas estimation for transactions.  Basically, is the network going to be fast enough.\n2. Understanding cold state.  The simplest network design simply has cold state being discarded from the network when the network is \"full\".  How much of the state is cold after 1k/10k/100k/1M blocks?  How often do transactions touch cold state?  If the network loses cold state occasionally how much impact will it have?  How difficult will it be to detect and then patch up missing parts of the state?\n3. Coming up with hard numbers on data ingress.  How many trie nodes per second does the network have to ingest to stay up-to-date with the latest state?\n\nThese should inform whether this approach is viable.",
        "created_at": "2021-01-08T21:08:58.880000+00:00",
        "attachments": []
    },
    {
        "author": "dryajov",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I agree that this is a good thing to try out, the assumption (confirmed by some early experiments) has been that this wont scale, but it just might 🙂 👍",
        "created_at": "2021-01-08T21:11:47.138000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yeah, the latency numbers for doing gas estimations are the first priority because they are the primary place where performance is going to make or break this approach.",
        "created_at": "2021-01-08T21:24:36.397000+00:00",
        "attachments": []
    }
]