[
    {
        "author": "konrads1315",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Hey everyone I have few questions about new distance function in state network,\nmaybe someone already grokked those already  🙂 \n1. The doc states, that we will be able to retrive leaf data with O(1) complexity,\nI wonder how is it possible i.e we won't have full view of the network, so if leaf\nis on node which is not in our routing table, then we will need to localize node which holds this leaf in the network, which has higher complexity. Or maybe it is just a shortcut for saying\nthat \"if we have node which holds data in routing table then lookup is O(1), otherwise we it is \nlookup complexity + O(1)\"\n2. the doc states also that this new function will be `determining proximity between a node and content`\nso should proximity between nodes be still defined as xor ? (my guess is not, as whole routing table will be organised by this new distance function but I am not sure there)\n3. what is the lookup complexity for this new function ? As I understand for xor it is\nO(log(n)), because with each lookup step it reduces number of possible \nnodes by 2 (nodes are organised in binary tree structure), but when I think about this new\nfunction I somehow do not see it. My guess the worst case is O(n/2), when node_id and content_id\nare on the opposite parts of the key space, but this maybe just me missing something.",
        "created_at": "2021-08-11T09:34:46.312000+00:00",
        "attachments": []
    },
    {
        "author": "konrads1315",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Also one question about https://notes.ethereum.org/8LbisMwtR4yK64SBosb_2g?view#B---Sub-Protocol-Messages, should `ping/pong/find_node/nodes/find_content/content` messages be defined as in https://notes.ethereum.org/tPzmxQD_S3S3uvtpUSA0-g (with subprotococol ids) or like in current chain history and state networks specs (without subprotocol id) ?",
        "created_at": "2021-08-11T09:43:21.108000+00:00",
        "attachments": []
    },
    {
        "author": "konrads1315",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "one another, more organisational question, I remember at some point, there was someone from cdap program working on uTP implementation for fluffy  ? Is this still the case ?",
        "created_at": "2021-08-11T13:18:33.810000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "For question 1 about O(1) complexity: the document ignores the network traversal.  Previous model was O(log(log(N)) network traversals **and** data retrievals.  This new model is 1 network traversal + 1 data retrieval for each piece of state.\n\nFor question 2 about where the new distance function should be applied.  Yes, it needs to be applied to both `distance(node_id_a, node_id_b)` and `distance(node_id, content_id)`\n\nFor questions 3: it should still be O(log2(N)) aka, a binary search.  The main difference between these two distance functions is that xor guarantees that there is exactly one node that is *closest* to a piece of content.  The new distance function can actually have two nodes have the same distance.  This property isn't important to our network design so losing it doesn't effect us.",
        "created_at": "2021-08-11T15:33:46.158000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'll get sub-protocol id's added.  This would be in conjunction with getting the main spec updated to contain OFFER/ACCEPT/STORE.",
        "created_at": "2021-08-11T15:34:54.502000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!240180844130598912\u003e... was that Austin who was going to be looking into doing this?",
        "created_at": "2021-08-11T15:36:18.082000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "He was but I don't think is going to end up actually doing it, but who knows",
        "created_at": "2021-08-11T15:43:53.903000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "As far as I am aware he hasn't really started more then 10 lines, but that could have changed in the last week and I am unaware of it",
        "created_at": "2021-08-11T15:44:47.968000+00:00",
        "attachments": []
    }
]