[
    {
        "author": "guilhermesalgado9479",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "An update on where I'm at with the ddht-performance work:\n- Implemented a basic GetContent/Content, which simply looks up the content for the given key and responds with it. Using a FileSystemContentStorage with a set of 10k items\n- Initially used the existing APIs that keep track of responses, but that seemed to add too much overhead on the node generating traffic, causing timeouts and other issues\n- Changed to using fire-and-forget APIs, with bursts of 1k requests and 1s sleep, then the serving node was handling approximately half of the total requests, but the remaining seem to have been silently dropped somewhere because as soon as I stopped the traffic-generating node, the serving node became idle\n- With bursts of 100 requests and sleeping 1s, no requests were being dropped\n- With bursts of 100 requests and sleeping 0.2s, again I started seeing a lot of requests dropped",
        "created_at": "2021-01-20T15:20:39.587000+00:00",
        "attachments": []
    },
    {
        "author": "guilhermesalgado9479",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!364458974906548225\u003e whenever you have time it'd be great to have a call to talk about next steps",
        "created_at": "2021-01-20T15:22:10.087000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!482518216019542016\u003e sure, just getting started with my day at the office.",
        "created_at": "2021-01-20T17:28:58.943000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "still available for a call or do you want to schedule it for another time?",
        "created_at": "2021-01-20T17:29:18.691000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "digging up the 1/2/3 list from higher up in the chat:\n\n1. At expected latencies and number of networking round trips required to retrieve trie data, how much time do we expect it to take to do gas estimation for transactions.  Basically, is the network going to be fast enough.\n2. Understanding cold state.  The simplest network design simply has cold state being discarded from the network when the network is \"full\".  How much of the state is cold after 1k/10k/100k/1M blocks?  How often do transactions touch cold state?  If the network loses cold state occasionally how much impact will it have?  How difficult will it be to detect and then patch up missing parts of the state?\n3. Coming up with hard numbers on data ingress.  How many trie nodes per second does the network have to ingest to stay up-to-date with the latest state?",
        "created_at": "2021-01-20T17:29:53.039000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "To test 3: we need a scheme for how we'd push data into the network after each block.  We'll need DOS protection.  We can assume clients have the block header and thus, the state root.  I think that we need to:\n\n- 3.A: Sketch out how the data will flow into the network in a manner that a node with the block header can verify the data against the state root before storing it.\n- 3.B: Figure out how to produce this data (modified geth/nethermind/etc?) and pipe it into the network\n- 3.C: Setup a testnet and actually do this at a small-ish scale",
        "created_at": "2021-01-20T17:33:58.607000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "One piece of this is establishing a gossip mechanism for the DHT.  So going out and finding established methods of doing gossip in DHT networks needs to be done as well.",
        "created_at": "2021-01-20T17:35:19.657000+00:00",
        "attachments": []
    },
    {
        "author": "guilhermesalgado9479",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!364458974906548225\u003e can we do it tomorrow before the stand-up?  I'm a bit confused, though, as before you'd said the goal of this was to \"[...] measure how many messages per second nodes can send and receive and use that as a baseline for expected network performance and latency\", so that is why I was playing with these bursts of requests",
        "created_at": "2021-01-20T18:10:30.369000+00:00",
        "attachments": []
    }
]