[
    {
        "author": "jason.carver",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I just wrote up a tiny guide for launching `trin` and `ddht` to talk to each other. Obviously it's rough around the edges, but the base discv5 layer correctly generates a session now.\nhttps://gist.github.com/carver/f3c26d9adb28ea2b4e5d5bbe42b4f4b7",
        "created_at": "2021-05-20T01:17:37.581000+00:00",
        "attachments": []
    },
    {
        "author": "deme1744",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This is the uTP spec I've been looking at: https://www.bittorrent.org/beps/bep_0029.html",
        "created_at": "2021-05-20T06:54:34.079000+00:00",
        "attachments": []
    },
    {
        "author": "deme1744",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Regarding the discussion about over which base protocol to run this uTP (or any other stream based protocol that we decide to use): I was initially also thinking of, at least for now, having this separated from the discv5 spec. Just wasn't to sure about this as it would require that muxing capability as already mentioned above, and that would probably require a bit more changes to the implementations (In the Nim one for sure, some architectural changes are needed to properly split that off. Although one can of course just add that within the discv5 layer for now). And we would have to think about how to distinguish the two protocols without trying to decrypt too much. Hence why I asked about the original discussion regarding adding a sort of stream packet to discv5.\n\nAnyhow, for now it could be separated, and not included in the spec. But we might end up doing something similar though. E.g. some parts would perhaps be reused. Like the header encryption, in case for example you would want to hide away the session id that else you would put in front of the payload to be able to distinguish packets without decrypting them. I think that the obfuscation properties would be nice to have.\n\nIn the end, both solutions can/will be similar, it is mostly a matter of wanting it in the discv5 spec or not (and part of discv5 code or not). The other option of sending the stream over the talkreq message feels a bit too much like a hack though, but it would do for now.",
        "created_at": "2021-05-20T07:28:31.309000+00:00",
        "attachments": []
    },
    {
        "author": "deme1744",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Note regarding efficiency. uTP can throttle down packet size to 150 bytes in case of congestion (see spec linked above).",
        "created_at": "2021-05-20T07:37:04.319000+00:00",
        "attachments": []
    }
]