[
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "State network implementers call in 10 hours 30 minutes (if I got my time math right...)",
        "created_at": "2021-05-18T04:30:43.434000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Call now: https://us02web.zoom.us/j/82763999854?pwd=Uy9sR1ZxeUJhc0crckFKanV5VERCdz09",
        "created_at": "2021-05-18T15:05:19.732000+00:00",
        "attachments": null
    },
    {
        "author": "lukaszrozmej",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!439193900096290816\u003e feel free to contact me on any internal Nethermind knowledge, we are very extensible but its hard to know what to do as its complicated and not well documented. Also if something crucial turns out not extensible I can always make it extensible. Also would like to hear what exactly you are doing.",
        "created_at": "2021-05-18T15:30:05.870000+00:00",
        "attachments": null
    },
    {
        "author": "jason.carver",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e The recipient must respond with a TALKRESP message containing the response to the request.\nHm, the discv5 spec seems to disallow dropping the `TALKRESP`. Obviously it can be dropped (because it's UDP), but it would be very reasonable for generic discv5 clients to retry the `TALKREQ` if the response is not received. I took a brief look at uTP, but won't get a chance to deep dive until later. At first glance, it seems we need to send an `ACK` anyway, so maybe that's a natural way to use the `TALKRESP`? Or we could even use the response as a base layer ack, even if it's basically empty, that mostly is ignored by the Portal subprotocol. At least that would allow discv5 implementations to easily understand how to use our subprotocol.",
        "created_at": "2021-05-18T21:44:54.334000+00:00",
        "attachments": null
    }
]