[
    {
        "author": "astarinmymind",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "can you be more specific? what exactly does prototyping eg chain history entail?",
        "created_at": "2021-07-02T01:47:28.242000+00:00",
        "attachments": null
    },
    {
        "author": "jiekai9348",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "https://github.com/ethereum/stateless-ethereum-specs/blob/master/portal-network.md#chain-history-headers-blocks-and-receipts",
        "created_at": "2021-07-02T03:50:19.488000+00:00",
        "attachments": null
    },
    {
        "author": "jacobkaufmann",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Is there an available kanban board or other project tracking resource that I can get read-only access to? I've done my best to collate various issues, posts and dev updates to get a picture of the state of development for various components, but it's incomplete/imperfect. This type of thing would be very helpful in evaluating various apprenticeship project candidates\n\nIf above is unavailable, is there a recording from the last weekly call? Thanks",
        "created_at": "2021-07-02T14:37:10.555000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Call notes can be found here: https://notes.ethereum.org/kva0bUSARI-I2VLx4eb6mw",
        "created_at": "2021-07-02T14:44:40.438000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There's no project tracking in place.  It'll be up to the Trin/Fluffy teams on whether they want to do something like that.  My expectations is that each team will (and currently is) maintain their own issue tracking, and that the specification for each network will serve as the development target.  That isn't to say that there isn't some additional resources that could help with onboarding new people to the project, but currently the weekly implementers call is our primary coordination point.  Teams are currently only working on the state network parts.",
        "created_at": "2021-07-02T14:46:57.889000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "what information are you looking for?  Can you provide some more context?",
        "created_at": "2021-07-02T14:48:30.555000+00:00",
        "attachments": null
    },
    {
        "author": "jacobkaufmann",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "There are a lot of various components that make up the portal network, and it would be helpful to have a view into what components are in what stage of development. For example, the double-batched merkle log accumulator, the Alexandria DHT, network bridges, or any one of the various subnetworks (tx, state, history). For each component, where are we in development? Is the spec complete, or is a proof of concept still underway? If under active development, what stage are we at, and what is the progression for the remainder of development?\n\nLike I said, I have been able to map this out to a decent extent for most of the components, but hopefully that gives you some more context. I could also provide an example if above is unclear",
        "created_at": "2021-07-02T14:58:00.985000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Thanks. This helps me understand better. Likely won't happen til next week but I think the main portal network document can be updated to contain this information pretty easily",
        "created_at": "2021-07-02T15:10:29.320000+00:00",
        "attachments": null
    },
    {
        "author": "astarinmymind",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!364458974906548225\u003e you use eth2 context/infrastructure a lot, but could you define it more specifically? are you referring to the ability to get cheap consensus nodes?",
        "created_at": "2021-07-02T16:39:05.408000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "Screen_Shot_2021-07-02_at_9.36.26_AM.png",
                "content": "a2df0e49a74698a124e3674f53fe9dd81a10a6d3dc21f321c5ca7f7c87ef2f12"
            }
        ]
    },
    {
        "author": "kolbyml",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Just a quick question uTP would be used on any request if the data being sent surpasses the max packet size of 1280 bytes correct? I see it mentioned on message 8 Request Proofs specifically,  but from the discv-5 doc I am under the impression it would be used for any message which exceeds the limit.\nI just want some confirmation if my impression was correct or not.",
        "created_at": "2021-07-02T16:45:58.961000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I'm referring to the loosely discussed plans for sharding where validators need to jump between shards quickly and perform block validation (via stateless execution) on different shards.  A stateless client that does that is useful for protocol infrastructure since it would allow validators to do that job without having to maintain the state for each shard.  This is what I mean by \"infrastructure\".",
        "created_at": "2021-07-02T16:51:33.036000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Roughly speaking yes.  More precisely, or maybe just different words for the same thing... uTP would be used for any data transmission between nodes that either 1: exceeds the UDP packet size or 2: is better modeled as a stream of data (which also likely would exceed the UDP packet size).",
        "created_at": "2021-07-02T16:52:53.260000+00:00",
        "attachments": null
    }
]