[
    {
        "author": "jacobkaufmann",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "So I've been working on header validation for the history network in trin, and while initially I was just going to use Infura to validate some header by hash, I decided to look into validating the PoW seal. Turns out this is more complicated than I thought b/c ethash.\n\nFrom what I understand a client needs (at minimum) the ethash cache. The ethash cache is a function of the seed and the sequence of preceding block headers. From the spec of LES, it seems that the client is not validating the PoW but instead ensuring that a block header's number/hash/difficulty matches what it receives from the server's canonical hash trie.\n\nThere is a JSON RPC `eth_getWork` that returns the PoW hash, the seed hash, and the difficulty target, so it appears to me that we would need to be able to know the seed for PoW validation and to serve the seed as a part of history",
        "created_at": "2021-08-27T21:30:43.616000+00:00",
        "attachments": null
    },
    {
        "author": "jacobkaufmann",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "To me it seems that this was overlooked in my own research and discussions for the history network spec, but maybe this is not an issue for some reason unknown to me?",
        "created_at": "2021-08-27T21:33:03.097000+00:00",
        "attachments": null
    },
    {
        "author": "newweiv",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "hmm. the way i understand the goal of the portal net is it lies between the 2 extremes of a full node vs. a light client which relies on infura. so it stores a moderate amount of data, and overall uses more resource than a super light client, but way less than a full node, allowing it function as wallet w/o relying on LES or infura node. with one goal of the portal net being to try to allow \"wallet\" like clients w/o relying on infura, i was trying to think of what devices do people currently use as wallets, usually a mobile app or browser extension like metamask, and those end up being leechy. the portalnet is supposed to be self scalable like bittorrent, so every node that joins contributes some of their resources. but i'm not sure, how long does a node need to be \"online\" in order to be useful? would me just logging onto metamask to send a txn which might take 1 minute contribute \"enough\" resources? i think \u003c@!843971820994822184\u003e was looking into running a daemon/service as part of the portal client app which would be interesting",
        "created_at": "2021-08-27T21:57:38.048000+00:00",
        "attachments": null
    },
    {
        "author": "newweiv",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "and ig the other main goal of the portal net is to allow stateless clients to have json-rpc api functionality. but this still raises question of why run a portal net client, unless you're really gungho on privacy and security. but i also suppose to have a fully functioning client that also serves api, you could run a stateless + portal client combo",
        "created_at": "2021-08-27T21:59:20.342000+00:00",
        "attachments": null
    },
    {
        "author": "jason.carver",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yeah, almost every different portal network relies on having a header oracle. I wouldn't get too hung up on PoW verification, since PoW will only be around for less than a year. I think it's fairly plausible that we end up offering a CLI switch to use either a beacon client or Infura, as a source of headers. So Infura pre-merge (without validation) isn't a terrible start, we'll get around to the preferred solution (running a beacon client) sometime after the merge.",
        "created_at": "2021-08-27T22:07:46.541000+00:00",
        "attachments": null
    },
    {
        "author": "jacobkaufmann",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Wish I would've asked sooner on that one. And to confirm, a portal client would simultaneously run a beacon client, and beacon clients are able to verify pre-merge PoW blocks? My Eth2 knowledge is somewhat limited here, and it's unclear to me whether you're suggesting that the node running the portal client is also running the beacon client",
        "created_at": "2021-08-27T22:16:28.751000+00:00",
        "attachments": null
    },
    {
        "author": "jason.carver",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e beacon clients are able to verify pre-merge PoW blocks\nWell, they'll have to do something near the merge to understand PoW. I'm not filled in on the details (if they're even decided), but it's a transitory issue that only matters for less than a year. After the merge block gets finalized, then we can hardcode the header at that block and derive all the history from that without any PoW validation.",
        "created_at": "2021-08-27T22:23:03.326000+00:00",
        "attachments": null
    },
    {
        "author": "jason.carver",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Yeah, I'm suggesting that users could decide to run a beacon node alongside the portal client to serve the header chain (which is the core of all the rest of the data: state, block bodies, etc). Or if they want to reduce the local load, they could just use Infura.",
        "created_at": "2021-08-27T22:24:35.648000+00:00",
        "attachments": null
    },
    {
        "author": "jason.carver",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e Wish I would've asked sooner on that one. \nlol, story of every software dev's life. X)",
        "created_at": "2021-08-27T22:26:05.254000+00:00",
        "attachments": null
    }
]