[
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003c@!439193900096290816\u003e https://geth.ethereum.org/docs/rpc/ns-debug#debug_dumpblock",
        "created_at": "2021-08-25T14:31:40.851000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "That gets us an access list",
        "created_at": "2021-08-25T14:32:37.160000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "and `eth_getProof` seems to get us 99.99...% of the necessary proof data (likely missing the extension node case that Jason has identified)",
        "created_at": "2021-08-25T14:33:09.416000+00:00",
        "attachments": []
    },
    {
        "author": "jason.carver",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e Retrieves the state that corresponds to the block number and returns a list of accounts (including storage and code).\nHm, that definition still isn't clear to me whether it's pre-state or post-state data. Still valuable to know about, either way!",
        "created_at": "2021-08-25T19:13:53.395000+00:00",
        "attachments": []
    },
    {
        "author": "nick.ghita",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "once my geth node fully syncs, i can test it out to see",
        "created_at": "2021-08-25T19:21:15.262000+00:00",
        "attachments": []
    },
    {
        "author": "jason.carver",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Unfortunately, empty lookups happen quite a bit, and the cost of a naive approach can be meaningfully slow in a big contract. Typically, the data seeker doesn't *know* that the data is missing, so they've probably already asked many peers and received empty responses, before they even try looking it up using GND style approach.\n\nI remember two optimizations for empty lookups that we've discussed: a protocol-level one, and a client-level one.\n- at protocol, we could have a peer store 2-3 levels of the trie rooted at a given intermediate node. 2-3x fewer content requests is meaningful\n- at client level, run both approaches in parellel when getting contract storage (ie~ run GetNodeData \u0026 direct-to-leaf in parallel), rather than wait for a bunch of empty responses to decide that the data must be missing.",
        "created_at": "2021-08-25T19:25:51.527000+00:00",
        "attachments": []
    },
    {
        "author": "jason.carver",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "FYI, I am asking the EF to do the access management steps necessary for me to move the `trin` repo (https://github.com/carver/trin) over. Obviously that will mean updating your github urls to .../ethereum/trin , and it should also mean that the Windows CI build starts passing again. Everything else should stay the same (including: who has merge access).\nI'm not sure how long it will take, but I'm guessing... 2-10 days? IDK, bureaucracy has a huge stddev, and I don't have many data points.",
        "created_at": "2021-08-25T19:43:13.298000+00:00",
        "attachments": []
    }
]