[
    {
        "author": "mike.ferris",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "CDAP Sync: https://us05web.zoom.us/j/89070762836?pwd=aDRYZ1B5QTFid01MNXEvaGFOU2hwdz09",
        "created_at": "2021-09-13T15:30:11.067000+00:00",
        "attachments": null
    },
    {
        "author": "newweiv",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I was referencing this post here (last paragraph): https://github.com/ethereum/stateless-ethereum-specs/issues/72#issuecomment-910862301 in the meeting. it seems we can use either content-key or content-id as the primary key into the database. since we now have many-to-one mapping of content-key to id, then the content-id isn't a uuid anymore and thus maybe is not a good primary key, unless we add some other data to it. so i was wondering what's the pros \u0026 cons of just using the `content-key` as the pk instead, since that is still universally unique \u003c@!843971820994822184\u003e. I suppose one thing may be the id is going to be a nice, constant 256 bits, but the key is more variable, which may make it not optimal?",
        "created_at": "2021-09-13T16:00:44.246000+00:00",
        "attachments": null
    },
    {
        "author": "mike.ferris",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "we can't use the content-key as the primary key because we *want* multiple primary keys to map to the same piece of data (instead of storing every tx twice).  each piece of data stored in the DB on disk should have exactly one way of indexing to it, so content-key wouldn't work unless we store the same transaction under both the transaction content-key and within the block referenced by the block body content-key.",
        "created_at": "2021-09-13T17:19:19.695000+00:00",
        "attachments": null
    },
    {
        "author": "mike.ferris",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Oh, I think I now get what you're saying \u003c@!755612893046636585\u003e : if we are changing incoming `content-key`s for individual transactions to look like the `content-key` for the corresponding block body, why not just use the `content-key` as the primary key in the database? Yes I think the only reason is that we need primary keys to have a constant number of bits",
        "created_at": "2021-09-13T20:05:53.352000+00:00",
        "attachments": null
    },
    {
        "author": "mike.ferris",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "`content-id` is still a uuid as far as data objects stored in the DB on disk are concerned.",
        "created_at": "2021-09-13T20:08:15.389000+00:00",
        "attachments": null
    },
    {
        "author": "mike.ferris",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "i think it's useful to think of the `content-key` for an individual transaction as a virtual key because there's the translation/redirection that happens only in that case.",
        "created_at": "2021-09-13T20:10:06.579000+00:00",
        "attachments": null
    }
]