[
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "wait, why would anything after PAYGAS be limited?",
        "created_at": "2020-08-20T01:53:24.875000+00:00",
        "attachments": []
    },
    {
        "author": "will7466",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I just mean contract writers would likely avoid calls to external contracts addressed by calldata to limit gas spent for the tx if the user is in charge of the gas limit and without gas observability.",
        "created_at": "2020-08-20T05:05:18.148000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "To give an example: Say we have an AA contract with multiple users with in-contract balances. The contract wants to charge a user internally for an AA transaction. In our MVP, the user sets the gas limit (for the full tx, not the validation) and the contract the gas price. As there currently is no observability of the (transaction) gas limit from inside the EVM (and with the discussions around removing observability of remaining gas as well), the contract would not be able to charge the user with the exact \"gas limit * gas price\". As Will mentioned, some workarounds might include the AA contract limiting external calls to have guaranteed upper bounds on gas consumption - although that obviously also goes against the idea of \"contracts should not understand gas\".",
        "created_at": "2020-08-20T11:36:48.154000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "So this is not connected to validation itself, but to the use case of AA contracts internally charging users for txs, which we would expect to be a common design element for AA.",
        "created_at": "2020-08-20T11:38:07.228000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "This is similar to the issues meta-transactions would have regarding the potential removal of gas observability. I am not sure if there is an ideal solution, ideally you would want to keep gas observability for use cases that are similar to \"the user sets the overall gas limit of a transaction\", but remove it for \"the contract has a hard coded gas amount to send with a sub-call to allow for two `SSTORE` and one `LOG`\"...",
        "created_at": "2020-08-20T11:45:20.883000+00:00",
        "attachments": []
    }
]