[
    {
        "author": "ansgar.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Ah, interesting. So an airdrop contract with a merkle root of eligible accounts, that would pay for users to claim their airdrop if they can provide a corresponding inclusion proof? That's a nice example of the \"dapps paying for eligible user interactions\" pattern AA would enable natively...",
        "created_at": "2020-10-26T12:47:26.698000+00:00",
        "attachments": []
    },
    {
        "author": "zkfloof",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Was UNI distribution a merkle tree airdrop?",
        "created_at": "2020-10-26T15:56:14.928000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "yes",
        "created_at": "2020-10-26T15:56:27.472000+00:00",
        "attachments": []
    },
    {
        "author": "3esmit.stateofus.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Status want's to implement support for their own wallet contracts. Account abstraction is something that could improve a lot what we can do right now. \nWhat are the current blockers preventing account abstraction? Maybe we can have a testnet implement an experimental fork for start experimenting some possible implementations? \n\nhttps://eips.ethereum.org/EIPS/eip-2474. 2474 would enable account abstraction be developed at EVM level,  because it allows contract calls to be included directly by the block creator, without a signed transaction, however this coinbase calls wold basically just lack msg.sender and gasPrice would be zero, so the contract could have it's own signing methods using multisig, ecrecover or even zk-proofs, transferring the duties of gas relayers directly to block creators. As a protocol change should be simple, and block creators would need to be able to estimate USD gains of executing certain coinbase calls.",
        "created_at": "2020-10-26T20:58:35.771000+00:00",
        "attachments": []
    }
]