[
    {
        "author": "ansgar.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e https://ethresear.ch/t/adding-cross-transaction-bls-signature-aggregation-to-ethereum/7844\nOh, interesting! That would indeed fit in really well with account abstraction.",
        "created_at": "2020-08-16T10:03:17.932000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "One improvement to AA that we discussed internally was to split the validation phase for AA txs into three parts:\npure computation, state reads, state writes\nwith `PAYGAS` after the state reads part, but the special state writes part also irreversible by failing txs (e.g. for nonce updates).\nthe `EXPECT_BLS_SIGNATURE` would fit in well with the pure computation part, so nodes would only have to execute it once for an incoming tx (and then do the aggregate `expected_signatures` check for the tx at the end of the pure part) and then not have to run it again while the tx is pending and the state of the underlying AA contract changes.",
        "created_at": "2020-08-16T10:09:08.154000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "interesting!",
        "created_at": "2020-08-16T10:10:14.302000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e BTW should we have a call at some point to discuss progress?\nI think that would be really helpful! We are currently writing up all our ideas around AA and aiming at publishing those in the first week of September. Might make sense to have a call e.g. a week before to walk through those ideas? At this point it has basically just been the four of us discussing them internally over and over, would be great to get external feedback...",
        "created_at": "2020-08-16T10:11:36.962000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think at this point we are reasonably confident that AA would indeed be feasible, with the only (slight) technical concern being around transaction propagation efficiency. And of course the general risk that with all the recent focus on network stability and the 1559 and statelessness changes on the horizon, people might be sceptical about the additional rather substantial change that would be AA (even in its minimal form).",
        "created_at": "2020-08-16T10:18:45.520000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "yeah, that's fair",
        "created_at": "2020-08-16T10:23:02.642000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I think the important thing is to make sure there are as few interdependencies between AA and these other things as possible",
        "created_at": "2020-08-16T10:23:41.316000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "eg. one challenge would be, if AA comes before 1559, then 1559 changes the way gasprice works, which in turn changes what PAYGAS needs to do",
        "created_at": "2020-08-16T10:24:44.918000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "and what inputs is needs to take in",
        "created_at": "2020-08-16T10:24:51.645000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "1559 requires tx senders to set both a tip and a total gasprice cap",
        "created_at": "2020-08-16T10:25:17.012000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "yes, that is a good example. Also I would expect 1559 to come before AA anyway, that way AA could use a 1559-compatible `PAYGAS` version from the beginning",
        "created_at": "2020-08-16T10:26:17.811000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "a potential interdependence with eth1x might be around the topic of gas observability. AA probably needs access to it, at least before `PAYGAS`, as it either has to set its own gas limit or decide if it wants to pay for a tx with a user set one (where the gas limit chosen by the user would obviously also be important to know for the decision)",
        "created_at": "2020-08-16T10:29:30.055000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "hmm, not sure I see this",
        "created_at": "2020-08-16T11:04:18.817000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "I guess it's network layer miners that would set the max amount of gas they are willing to execute before they expect a PAYGAS",
        "created_at": "2020-08-16T11:04:44.212000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "and that cap would be changeable if the in-protocol gas costs change",
        "created_at": "2020-08-16T11:04:59.142000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "although..... we do need massive gas cost increases to SLOAD asap then",
        "created_at": "2020-08-16T11:05:26.949000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "Oh, I think I worded that poorly. I agree, the validation gas limit should purely be a client config parameter (although it would make sense to have a network-wide default). I was thinking about the \"normal\" gas limit, basically: If an AA contract wants to decide whether to pay for a tx, it should be able to understand the relation between gas price and maximum total transaction cost it would have to pay, so presumably needs to know (or set) the overall transaction gas limit. This seems to go against the general trend of not letting contracts access gas related information.",
        "created_at": "2020-08-16T11:28:07.874000+00:00",
        "attachments": []
    },
    {
        "author": "ansgar.eth",
        "category": "Channel Graveyard",
        "parent": "",
        "content": "\u003e although..... we do need massive gas cost increases to SLOAD asap then\nI assume you mean because of the state-dependent validation step that has to be re-executed every time the contract state changes? We are expecting to have a separate (also client-side) gas limit for that, per default considerably lower (say 10x) than the one for the pure part.",
        "created_at": "2020-08-16T11:33:42.878000+00:00",
        "attachments": []
    }
]