[
    {
        "author": "etan_status",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "You cannot assume that every single block has a `LightClientUpdate` for it, there are blocks with 0 sync participation, and even those that have a sync aggregate cannot be trusted if it lacks any meaningful participation. Regarding \"not go missing\", you can only request canonical data from peers, so orphaned updates will not be provided after they are gone",
        "created_at": "2025-03-28T02:58:28.595000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "yes, the sync committee only signs the canonical head. if there is a deeper reorg you will see lots of blocks without any lightclientupdate for them. you receive the head only (and even that is based effort as it is based on a meaningful sync participation). you have to use parent_root or block_roots / state_roots or historical_roots / historical_sumaries to obtain ancestors",
        "created_at": "2025-03-28T02:59:44.697000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "I don't think tx/withdrawal root matters at all, for the issue you are discussing. you cannot reliably get a LightClientUpdate for every block, it just isn't produced",
        "created_at": "2025-03-28T03:00:35.898000+00:00",
        "attachments": null
    },
    {
        "author": "milos88",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "\u003c@881905303011086387\u003e any recommended reading on how all this works? Potentially, something that is easier to digest and not the spec itself",
        "created_at": "2025-03-28T09:25:04.452000+00:00",
        "attachments": null
    },
    {
        "author": "etan_status",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "\"all this\" is a bit broad 🙂",
        "created_at": "2025-03-28T11:55:17.601000+00:00",
        "attachments": null
    },
    {
        "author": "milos88",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "how light clients work, what information is available and under what conditions, how reogrs are handled, etc.\nFor example, can a light client eventually know every block header (or at least block_hash) that is part of the canonical chain (without some other source of information)?",
        "created_at": "2025-03-28T12:00:21.893000+00:00",
        "attachments": null
    }
]