[
    {
        "author": "matkt0",
        "category": "Execution Layer",
        "parent": "",
        "content": "We have a question regarding the GetTrieNodes method. In implementing snapsync as a client, I started from my interpretation which seems to work but I would like to have a confirmation for the snapsync implementation as a server.\n\nWhen you say \"Partial paths (\u003c32 bytes) should be compact encoded per the Ethereum wire protocol, full paths should be plain binary encoded.\"\n\nWhen we receive trie node requests, we can have in the list of elements just a path which means that we will look for this element in the account trie but we can also have several elements and the first element will be the account path and then the path of the slots that we look for in the storage trie of the account.",
        "created_at": "2023-09-25T15:46:36.672000+00:00",
        "attachments": []
    },
    {
        "author": "matkt0",
        "category": "Execution Layer",
        "parent": "",
        "content": "In the first case (case where we receive a path for the account trie). If the path is complete and we are therefore looking for an account whose leaf is really at the bottom of the tree. **So we should not compact encode the path but looking at the code it seems that we are always waiting for compact encoded pat**h https://github.com/ethereum/go-ethereum/blob/c3742a9ae0822e220868a04c62ecb93305e9ed57/eth/protocols/snap/handler.go#L513 \n\nI'm also not sure to understand \"plain binary encoded\"\n\nIn the second case when we receive an accountPath then slots. I want to say that the accountPath is necessarily the accountHash ? and then it's necessarily slot paths compacted or not https://github.com/ethereum/go-ethereum/blob/c3742a9ae0822e220868a04c62ecb93305e9ed57/eth/protocols/snap/handler.go#L527\n\n\n\nAm I right?",
        "created_at": "2023-09-25T15:46:38.419000+00:00",
        "attachments": []
    },
    {
        "author": "suburbandad_",
        "category": "Execution Layer",
        "parent": "",
        "content": "Similarly, should we handle/expect that account slots for this message type might be full paths rather than partial paths?",
        "created_at": "2023-09-25T15:58:57.794000+00:00",
        "attachments": []
    }
]