[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What is the technique that allows relayers to fail transactions?",
        "created_at": "2020-06-10T01:37:21.099000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Most revolve around front running or withholding meta-tx, e.g. Uniswap trade where relayer causes txs to exceed their slippage limit, wait until a tx expires (if it has a deadline), etc.",
        "created_at": "2020-06-10T02:50:18.527000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I see.  I'm in camp (B) as well then.  If the transaction fails, the relayer should be the one to pay (not receiving compensation).",
        "created_at": "2020-06-10T03:31:40.401000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It is up to the relayer to time the transaction such that it *doesn't* fail.",
        "created_at": "2020-06-10T03:31:55.646000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think there my be a falacy at play here that there is a definitive/measurable/obsurvable \"fail\" for the transaction. Correct me if I'm missing something.\n\n- sender specifies txn parameters which are invariant\n    - txn will execute with `G` total available gas, sent to address `T`, at gas price `P` with value `V`\n- relayer must only decide if they are willing to pay `G * P` for gas costs (this includes them ensuring things like proper reimbursement)\n   - relayer cannot modifie gas limit, gas price, target address, value, etc.\n\nRelayer *can* in theory control things like *when* it is sent, front running, etc, but these are no different than non-relayed transactions since these subtle manipulations can already be done today by miners.\n\nI think option C is the only viable path and I think we have a clear-ish path towards implementing it.",
        "created_at": "2020-06-10T15:34:43.635000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "No, relayer can totally choose they own G",
        "created_at": "2020-06-10T15:35:41.829000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Sorry, forgot to include context: \u003c@456226577798135808\u003e I'm not speaking about current meta-transactions, I'm thinking about this in the context of extending the layer-0 transaction protocol to allow for separate gas payer.",
        "created_at": "2020-06-10T15:36:26.661000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "because it is the relayer who is signing the actual ethereum tx that gets into the block",
        "created_at": "2020-06-10T15:36:26.827000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ah, that thing, sorry 🙂",
        "created_at": "2020-06-10T15:36:42.618000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I am tuning off and rolling my eyes then 🙂",
        "created_at": "2020-06-10T15:37:06.870000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e I am tuning off and rolling my eyes then 🙂\n\u003c@456226577798135808\u003e because you don't think it is viable?  or because it's outside of the area of what you're focused on right now?  or option 3?",
        "created_at": "2020-06-10T15:37:58.489000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "because it is outside of the area I'm focus on right now, I currently view it as one of \"going into the weeds\" things. I am still convinced that we can solve our particular issue for Stateless Ethereum without native meta-transactions.",
        "created_at": "2020-06-10T15:39:43.951000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "but I do not assume that all discussions on this server are about Stateless Ethereum",
        "created_at": "2020-06-10T15:40:02.623000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "so please go on",
        "created_at": "2020-06-10T15:40:12.207000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "👍  I'm  chasing meta-transactions to try and unlock UNGAS as an option which inturn unlocks easier witness repricing and the three things are a chain of dependencies, and witness gas pricing is likely one of the last things we have to do for stateless.... and currently these three things feel more manageable than any of the other approaches that I'm seeing.",
        "created_at": "2020-06-10T15:41:53.851000+00:00",
        "attachments": []
    },
    {
        "author": "rimeissner",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I find this interesting, but I don't see it viable if the relayer can be played ... the trade off of saying \"the relayer charges more to cover their losses\" is kind of wird. If there is a way to drain/ dos relayer someone will do it. Very interesting on for this is the discussion in the \u003c#700028534114222171\u003e channel as this is a major focus for them.",
        "created_at": "2020-06-10T15:47:52.893000+00:00",
        "attachments": []
    },
    {
        "author": "rimeissner",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "in genreal I like C, but if at all B is probably more realistic to get out in some form as it is simpler",
        "created_at": "2020-06-10T15:49:13.037000+00:00",
        "attachments": []
    },
    {
        "author": "rimeissner",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "just speaking out of experience when thinking about the how we want to evolve the safe contracts",
        "created_at": "2020-06-10T15:49:47.609000+00:00",
        "attachments": []
    },
    {
        "author": "rimeissner",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "also in general, how are the \u003c#718596092828057631\u003e and \u003c#700028534114222171\u003e topics related? are they pushed indepentently? or is there a common effort?",
        "created_at": "2020-06-10T15:51:08.921000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think the two are at least in principle unrelated",
        "created_at": "2020-06-10T15:54:20.735000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Agreed. I have been reviewing the protocol meta-txs proposals to understand where there might be overlap / conflict with AA. For example, like rich transactions / batched transactions, AA gives us a lot of flexibility to design atomic multi-txs. I view this as more of a free byproduct of AA, because AA is much more about designing a framework which abstracts the concept of a valid (will pay gas) tx. Additionally, I think proposals which make tx validation harder (e.g. tying together signer and relayer nonces) is something AA must monitor closely, because it could seriously degrade the performance of AA validation.",
        "created_at": "2020-06-10T16:13:38.895000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@364458974906548225\u003e Is there a reason we can't have gas amount be chosen by the relayer instead of the sender?",
        "created_at": "2020-06-10T17:16:59.479000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The relayer only gets paid if the transaction succeeds, so it seems the relayer is strongly incentivized to set a gas amount appropriately.",
        "created_at": "2020-06-10T17:17:22.507000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I am operating under the assumption that relayers are pretty knowledgeable about the transactions they are relaying, so they should be able to appropriately estimate gas even for transactions with variable gas costs (just as easily as the dapp they are relaying for can).",
        "created_at": "2020-06-10T17:18:31.688000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The one caveat would be transactions that can use variable amount of gas (e.g., loop until gas runs out).  I think such contracts would be better off taking in number of iterations as a parameter instead, which would protect them from relayers short-gassing them.",
        "created_at": "2020-06-10T17:20:02.312000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!364458974906548225\u003e \n\u003e - sender specifies txn parameters which are invariant\n\u003e     - txn will execute with G total available gas, sent to address T, at gas price P with value V\n\u003e - relayer must only decide if they are willing to pay G * P for gas costs (this includes them ensuring things like proper reimbursement)\n\u003e    - relayer cannot modifie gas limit, gas price, target address, value, etc.\n\nI'm not sure I understand how this addresses the case of a failing transaction. When a transaction fails, the gas still has to be paid and the transaction isn't executed. In the scheme you describe, does the relayer get reimbursed for the failed transaction or are they covering that loss? We can't have both relayer and signer not pay if the transaction fails, one of the two party has to lose.",
        "created_at": "2020-06-10T19:15:00.157000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e Relayer can in theory control things like when it is sent, front running, etc, but these are no different than non-relayed transactions since these subtle manipulations can already be done today by miners.\n\nThat's a fair point. though many relayers services are currently centralized and don't use a P2P system, so I would argue the risk of censorship or manipulation is higher than with miners",
        "created_at": "2020-06-10T19:24:45.845000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I still think B) will provide the best UX as it creates a significant incentives for Relayers to ensure that all the txs they relay don't fail  and they take on the risk of front-running and such, instead of all users taking that risk.",
        "created_at": "2020-06-10T19:27:39.808000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "With a native protocol for sponsoring transactions, I believe users could sign a tx for a particular nonce and vary the relayer address, then distribute the txs to different relayers, and then the first to get their sponsored tx accepted gets paid while the rest are simply not included on chain. In this case, censorship doesn't seem like a major concern",
        "created_at": "2020-06-10T19:28:02.427000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Indeed, shouldn't be hard to build, but now relayers will race to execute the transactoins which will increase the # of transactions going on chain.",
        "created_at": "2020-06-10T19:29:02.219000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It would increase the # of txs being validated by miners, but since the replay protection is based only on the user's nonce, only 1 relay tx would actually be propagated as part of a mined block",
        "created_at": "2020-06-10T19:29:55.810000+00:00",
        "attachments": []
    },
    {
        "author": "phabc",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, that should be manageable",
        "created_at": "2020-06-10T19:30:35.157000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e I'm not sure I understand how this addresses the case of a failing transaction. When a transaction fails, the gas still has to be paid and the transaction isn't executed. In the scheme you describe, does the relayer get reimbursed for the failed transaction or are they covering that loss? We can't have both relayer and signer not pay if the transaction fails, one of the two party has to lose.\n\u003c@!278762485497069569\u003e under the very loose proposed scheme of separating gas-payer / txn-sender, my current thinking is this: \n\n1) It enables meta transactions but isn't specifically for them, only an in-protocol tool to allow new use cases that are not currently easy or possible\n2) If someone chooses to use this mechanism for meta-transactions there will likely need to be some smart contract logic to do things like ensuring that the relayer gets paid.\n    - in the event that the transaction does OOG and do a full reversion, then the relayer would be the one who \"loses\" since they would not be reimbursed.\n\nI realized this isn't exactly situation C as described above, but I believe it provides a tool that still allows someone to build a specific relay system such that the relayer can achieve C when combined with additional smart contract logic and careful analysis of the transactions they are relaying.",
        "created_at": "2020-06-10T21:35:48.557000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'll also say that it is becoming obvious to me that we need a concrete specification to discuss because right now we are debating some amorphous undefined new set of protocol features.  With a real spec, we can then start to hammer in on what can and cannot be done, after which this discussion of what properties it has and what guarantees can be provided will be much more fruitful",
        "created_at": "2020-06-10T21:37:43.838000+00:00",
        "attachments": []
    }
]