[
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!278762485497069569\u003e \u003c@!543900561460822016\u003e just pinging you about this channel's existence",
        "created_at": "2020-06-05T22:46:08.040000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Given some of my new thinking about meta transactions, I'm getting more and more keen on 1) looking at pushing forward with UNGAS as the approach to [1] \"future proofing\" our ability to change the gas schedule, and thus, allowing us to more easily account for witness costs in gas and 2) maintain support for meta-txns via an alternate mechanism allowing layer 0 separation between gas payer, and txn sender.\n\n- [1]: future proof against `CALL` type operations that rely on a fixed amount of gas, explicitely not about the case where a function becomes uncallable due to gas price increases and the gas limit being too small.",
        "created_at": "2020-06-05T22:49:57.430000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It will be interesting to explore both 1) altering the actual txn format in a backwards compatible way to allow for separate gas-payer/sender at layer-0 vs 2) an opcode/precompile that allows this at ?layer-1?  (not sure if those \"layer\" semantics are correct).",
        "created_at": "2020-06-05T22:53:37.068000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As for batching...  It seems like you should be able to accomplish this without formal support for it by just having them sign multiple messages with increasing nonces.....  My intuition after thinking about this for only a few minutes is that you may be able to achieve the same guarantees but that it would require more *checking stuff* to be sure each one in the batch doesn't invalidate the next one somehow.... so it would by no means be as powerful as truly atomic batches...  and atomic batches are useful outside of the meta-txn context so.... \n\nBut I'm probably unikely to champion the batch stuff because it isn't on the critical path for stateless, while preserving meta-txns ends up on our critical path if we ruin them with UNGAS as part of stateless.",
        "created_at": "2020-06-05T22:57:25.998000+00:00",
        "attachments": []
    }
]