[
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!636680106630316033\u003e yes, if you're able to run that analysis I think it would be very valuable data to have.",
        "created_at": "2020-06-18T00:00:42.630000+00:00",
        "attachments": []
    },
    {
        "author": "_drinkcoffee",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "OK. Once I have got the Code Merklization talk and associated data done, I will aim to do that analysis - probably next Wednesday / Thursday",
        "created_at": "2020-06-18T00:37:35.709000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Should we try to support batching of transactions from multiple users?  This feels like something that has potential to be exploited by relayers so I wonder if we should only support batches from a single signer?",
        "created_at": "2020-06-18T04:16:11.848000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "2711 is turning into basically Transaction v2, which I don't think is unreasonable.  It supports batch transactions, expiring transactions, and sponsored transactions (and any combination of those).",
        "created_at": "2020-06-18T05:23:54.513000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I have included support for batch transactions in 2711, along with expiring transactions.  However, I did **not** include support for making return value of previous transactions available to subsequent transactions.  My current thinking is that we could generalize the `RETURNDATA*` changes \u003c@543900561460822016\u003e proposed in 2733 such that they apply to any transaction type that does matching, not limited to 2711 style batches.",
        "created_at": "2020-06-18T06:30:21.233000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "How would you feel \u003c@543900561460822016\u003e about adapting 2733 such that it doesn't define a new transaction type, but instead just defines what `RETURNDATASIZE` and `RETURNDATACOPY` do when a transaction is part of a batch of any kind?",
        "created_at": "2020-06-18T06:31:05.324000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "1. Curious if you've come up with any hypothetical attacks for a package with txs from multiple users that a relayer might be able to execute. My main concern with allow txs from multiple users is that cost for validation would increase linearly with the number of different sigs to verify. Which I generally hope to avoid. There are probably some tricks we can do to make it better though.\n2. With 2711 becoming tx v2, is there a concern that by no longer being a minimal addition it will be much harder to gain support?\n3. I'm happy to adapt 2733, that makes sense if we don't go down the path of recursive txs",
        "created_at": "2020-06-18T15:49:56.228000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Re: attacks.  It depends on exactly how it is implemented, but in theory it allows relayers to execute guaranteed sandwich attacks.  This isn't huge, since sandwich attacks are already possible by miners, but it is one example.",
        "created_at": "2020-06-18T15:52:13.540000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e With 2711 becoming tx v2, is there a concern that by no longer being a minimal addition it will be much harder to gain support?\nPossibly, though I would like to wait and see if anyone pushes back against transaction v2 strategy first because given the options currently available, it is my favorite.  🙂",
        "created_at": "2020-06-18T15:53:03.296000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Random thought. Can we model this new approach to transactions such that all formats can have a set of reduction rules applied to them which would map them down to some base format that we can reason about more simply. Then each new format can be more easily reasoned about by reducing it to the base format, and if the reduction rules are deterministic then we only have to reason about the base format when evaluating most security issues. Base format would be something like\n\nsender, nonce, gas payer, value, gas limit, gas price, data",
        "created_at": "2020-06-18T19:14:08.596000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That seems like a reasonable way to think about it. Then we would need to define a strict grammar which allows for certain fields to be defined at higher levels of the tx",
        "created_at": "2020-06-18T19:17:01.488000+00:00",
        "attachments": []
    }
]