[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@689161464829050960\u003e I think the attack being discussed basically boils down to \"someone who can control the contract deployment contract can compromise the contract\".",
        "created_at": "2021-06-17T09:02:02.372000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Am I incorrect (haven't thought about it deeply) that the same attack exists without multiple chains involved?",
        "created_at": "2021-06-17T09:03:17.372000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Deploy an invoker in a way that allows you to redeploy it, then once you have collected a bunch of signatures you redeploy a malicious invoker of the same address?",
        "created_at": "2021-06-17T09:03:52.394000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I guess the difference is that the invoker in the same-chain scenario would need a self-destruct mechanism, while in the cross-chain attack you don't need a self-destruct mechanism.",
        "created_at": "2021-06-17T09:05:04.757000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So I suppose that particular vector becomes a bit easier to integrate in the multi-chain scenario.",
        "created_at": "2021-06-17T09:05:28.592000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think it's mainly about the multi-chain scenario. Be able to redeploy an invoker is non-starter IMO. To me, that is a fully insecure invoker. But doing a multi-chain deployment is a little more sneaky because the mainnet deployment can look normal (except when you really dig into the deployment tx) and then they could deploy a different invoker to the same address on another chain",
        "created_at": "2021-06-17T14:57:23.253000+00:00",
        "attachments": null
    }
]