[
    {
        "author": "ricmoo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Continuing from the ADC. My only concern is the non-revocability. My current least-worst idea for a nonce system, is to use the account storage of the EOA is used to store a mapping keccak256(0x0000…3074, invoker) to nonce. Only if that nonce matches what was signed with the auth payload is the auth still valid. I am nee to thinking about this, so I may very well be out of the loop of previous ideas that have come up.",
        "created_at": "2021-06-25T15:08:27.200000+00:00",
        "attachments": []
    },
    {
        "author": "ricmoo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(EIP-2803 could be used to tweak nonces, or a new EIP-2718 transaction type could be used for set-storage)",
        "created_at": "2021-06-25T15:14:17.131000+00:00",
        "attachments": []
    },
    {
        "author": "axic3354",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If you have \"rich transactions\" and new transaction types (sponsored transactions) then you do not even need 3074. 3074 is supposed to replace all these.",
        "created_at": "2021-06-25T18:19:05.846000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Eh, I think that is a subset of 3074.",
        "created_at": "2021-06-25T18:32:26.285000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "3074 adds a primitive that people can do a wide variety of things with, including rich transactions and sponsored transactions.",
        "created_at": "2021-06-25T18:32:59.279000+00:00",
        "attachments": []
    },
    {
        "author": "axic3354",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Didn't I said that as a response to \u003c@!358385024573243393\u003e ? 🙂 Specifically to the proposal of having nonces at the account which can be changed via rich transactions or a new transaction type. If one needs to introduce new transaction types, then we're almost at the point of adding sponsored transactions.",
        "created_at": "2021-06-25T18:33:34.955000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e you do not even need 3074\nI was referring to that.",
        "created_at": "2021-06-25T18:36:46.547000+00:00",
        "attachments": []
    },
    {
        "author": "axic3354",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "However I kind of disagree on \"replacing rich transactions\" part. It only replaces it through steps: an instruction interpreter has to be provided (there are many such projects) and 3074 provides the authentication part. One can argue this is suboptimal compared to exposing the native EVM.",
        "created_at": "2021-06-25T18:38:25.195000+00:00",
        "attachments": []
    },
    {
        "author": "ricmoo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There is overlap. But a set-storage tx type is much lower surface area if preferred, if an account storage method for account abstraction was plausible. 50% thinking out loud, and just thinking of places we can access with changing as little as possible. Since the initial value of every slot is 0, signing an eip-3074 nonce of zero enables it, with the option of disabling it by changing the nonce and signing a new auth. You could also switch between two auths.",
        "created_at": "2021-06-25T20:09:02.373000+00:00",
        "attachments": []
    },
    {
        "author": "ricmoo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(signing a new auth to replace the old; allowing you to change permissions, not just add new permissions)",
        "created_at": "2021-06-25T20:11:04.519000+00:00",
        "attachments": []
    },
    {
        "author": "ricmoo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "3074 enables a lot of new features. 2803 enables a lot of new features. I want them both. 🙂",
        "created_at": "2021-06-25T20:12:07.470000+00:00",
        "attachments": []
    },
    {
        "author": "axic3354",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I was wondering about a blocklist/accesslist based on your nonce idea, i.e. one could add a target invoker to the blocklist (`state[EOA].storage[keccak256('3074blocklist' || invoker)] = 1`).\n\nIt is not great:\n1. `AUTH` now needs to load another account\n2. Wasting storage space on blocking out invokers\n3. Similarly to the nonce problem, there needs to be some means to edit this (and also means likely EOAs need eth to manipulate it)",
        "created_at": "2021-06-25T20:39:00.626000+00:00",
        "attachments": []
    },
    {
        "author": "axic3354",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And regarding the nonce idea, doesn't that has the prequisite of the commitment to have a known structure? Many people argued for that, but the authors seem to be on the opposite side of less structure is better.",
        "created_at": "2021-06-25T20:39:56.310000+00:00",
        "attachments": []
    },
    {
        "author": "ricmoo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I’ve been thinking of putting together a BIP-32-43-44 inspired purpose field for building slot structures. Something that won’t collide with any existing hash (mainly solidity mappings), but this is actually fairly simple.",
        "created_at": "2021-06-25T20:47:24.444000+00:00",
        "attachments": []
    },
    {
        "author": "ricmoo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "For this, or otherwise, having an abstract way to “choose a slot” based on application is useful.",
        "created_at": "2021-06-25T20:47:54.588000+00:00",
        "attachments": []
    },
    {
        "author": "ricmoo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So, that I am less concerned with. An extra account+storageAccess is a concern, but it would be super deterministic to select the relevant accessList entry.",
        "created_at": "2021-06-25T20:48:50.252000+00:00",
        "attachments": []
    },
    {
        "author": "ricmoo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And a storage access is still cheaper than the 21k for a tx, which I think a lot of cool things we can do with 3074 would allow us to rollup/mitigate.",
        "created_at": "2021-06-25T20:49:46.812000+00:00",
        "attachments": []
    },
    {
        "author": "ricmoo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But this idea is only a few hours old in my head. I think as I mull it over more issues will come to mind. 🙂",
        "created_at": "2021-06-25T20:50:55.599000+00:00",
        "attachments": []
    },
    {
        "author": "axic3354",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Interesting. Why would you need a purpose registry? As long as you have a unique prefix plus your payload hashed together, then it is unlikely to collide?",
        "created_at": "2021-06-25T20:57:01.756000+00:00",
        "attachments": []
    },
    {
        "author": "ricmoo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Not so much a registry. Just a “this is the standard way to hash stuff to claim a slot for a specific purpose so that you don’t collide with others”. Like EIP-191, how there is a prefix 0x19 but then the version byte to indicate the application/purpose, so that can define how the rest is used.",
        "created_at": "2021-06-25T21:28:19.365000+00:00",
        "attachments": []
    },
    {
        "author": "ricmoo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But that way every EIP under the sun can use the same EOA (or non-EOA) account storage for whatever purpose they happen to need it for, and there is a specific place for each value that won’t step on others toes. Like the purpose field in BIP-43. BIP-44 uses \"44\" as its BIP-43 purpose field, which he means nothing else ever conflicts with it. 🙂",
        "created_at": "2021-06-25T21:31:35.971000+00:00",
        "attachments": []
    },
    {
        "author": "ricmoo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Basically it’s the way we choose the “unique prefix”.",
        "created_at": "2021-06-25T21:33:27.364000+00:00",
        "attachments": []
    },
    {
        "author": "ricmoo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I’m thinking 3-bytes encoding if the purpose eip number and then 32 bytes for the purpose field (which would normally be the EIP number, like 3074), then the hash of the payload. This will always be 67 bytes, so it will never collide with a Solidity mapping.",
        "created_at": "2021-06-25T21:35:17.100000+00:00",
        "attachments": []
    },
    {
        "author": "ricmoo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But that’s orthogonal. I love the idea of eip-3074, and I think if we can make a generic way to revoke/enable arbitrary access, it will be safer and also quell anyone’s apprehensions. 🙂",
        "created_at": "2021-06-25T21:36:44.040000+00:00",
        "attachments": []
    },
    {
        "author": "ricmoo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And the EOA account storage seems like a good candidate.",
        "created_at": "2021-06-25T21:37:10.031000+00:00",
        "attachments": []
    }
]