[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I have a hypothetical design (in my head) for a blockchain like this.",
        "created_at": "2022-09-13T09:57:07.969000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You need to change the state model though.",
        "created_at": "2022-09-13T09:57:13.377000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And things get complicated, but not impossible, with publicly shared state (like AMMs).",
        "created_at": "2022-09-13T09:57:27.468000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "For personal state, one can just have a \"root\" as their state and their personal state can be stored entirely off-chain.  One can then imagine tools (like tokens) being able to write to section of the user's personal state according to well defined rules.",
        "created_at": "2022-09-13T09:58:23.031000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The token rules don't need to be available off-chain, only the root that allows proof verification, and the user's state (like their token balance) also doesn't have to be on-chain anywhere as the user could keep that private.",
        "created_at": "2022-09-13T09:59:00.798000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "For public state (like AMM liquidity pools) you would still need some mechanism for publicly shared storage.  However, I think you can clear a *lot* of state off-chain with this model.",
        "created_at": "2022-09-13T09:59:54.006000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Your L1 needs to be a generalized proof verifier (like StarkWare's generalized proof verifier).",
        "created_at": "2022-09-13T10:00:12.876000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "When two people want to do something (like send a balance from A to B) you would only need to verify a proof of a well known ZK program that subtracts the balance from one user and adds to the other user.  This can be done with recursive proofs such that neither user needs to know the other user's balance.  They each independently prove that they adjusted their balance correctly, then the recursive proof proves that they both did this and on-chain that single recursive proof is what is validated.",
        "created_at": "2022-09-13T10:01:27.487000+00:00",
        "attachments": []
    },
    {
        "author": "lapdo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hey everyone, I have recently started writing my MSc thesis on the Quantum Threat and Ethereum, but currently i am still writing my research proposal. I will be analysing the current cryptography methods that are used in Eth and see how one would be able to make the network quantum-safe by integrating the appropriate post-quantum cryptography methods (e.g. the four finalists announced by NIST and potential other ones that are relevant). After this, i will look at technological barriers for implementation (compatibility, trade-offs etc.), while also looking into organisational obstacles (soft/hard fork). Is there anyone in here that can give me some advice/guidance on this particular topic. Thank you very much!!",
        "created_at": "2022-09-13T14:22:33.327000+00:00",
        "attachments": []
    }
]