[
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hey all, I integrating the latest devnet-4 changes to 7702. There is one thing I noticed:\n\nThis PR https://github.com/ethereum/EIPs/pull/8845  changes tx-validity by simply constraining the variables to a fixed byte size (this is fine). However, it removes the check on `\"s\": unsigned 256-bit integer and value less or equal than \"secp256k1n/2\", specified in [EIP-2](./eip-2.md).`, which (if we want to keep this) should likely be moved to a runtime check (i.e. when trying to run this in the EVM, thus costs gas in case if this condition is violated).\n\nAm I correct that this is removed, because trying to \"flip\" the signature here would change the entire message, so that would also require signing a different txhash from the EOA which sends this tx? So flipping the signature here is practically not possible, unless you let an EOA sign a completely new message? \n\n( CC \u003c@543900561460822016\u003e )",
        "created_at": "2024-10-10T02:12:31.384000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i can add it back in as a runtime check",
        "created_at": "2024-10-10T02:31:26.650000+00:00",
        "attachments": []
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes I'm actually not sure here, for txs in general this s check makes sense, because if you thus sign a tx you now essentially sign two txs (the one you signed, and the \"flipped\" one), but for these authority lists you would have to sign it again. So I'm not really sure if it is necessary (although the check of course is super simple)",
        "created_at": "2024-10-10T02:33:29.999000+00:00",
        "attachments": []
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "No strong opinion but just wanted to raise the point that the check itself got removed 🙂",
        "created_at": "2024-10-10T02:33:56.669000+00:00",
        "attachments": []
    },
    {
        "author": "daniellehrner",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If a delegation points to a precompile we return empty code. But what about the gas costs for resolution? Do we still follow EIP-2929 and charge `WARM_STORAGE_READ_COST` in that case?",
        "created_at": "2024-10-10T08:11:37.019000+00:00",
        "attachments": []
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think you are thinking about this from a different perspective. (And maybe the text in the EIP could be made even more explicit to avoid this). There is not a check that the delegated address is in the \"precompile addresses\". The behavior what should happen is this: if you perform an operation like CALL / EXTCODE* on a delegated account, then read the code from the delegation and run the opcode in that context. Since precompiles have no evm code, it thus runs nothing. However, some clients (at least EthereumJS) assumed that the precompile code should be ran. The text regarding those precompiles should be interpreted as such.",
        "created_at": "2024-10-10T08:15:21.165000+00:00",
        "attachments": []
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(So, in the situation of a delegation to a precompile it would behave exactly the same as if you would point it to an account with no code, such as a non-delegated EOA)",
        "created_at": "2024-10-10T08:15:53.559000+00:00",
        "attachments": []
    },
    {
        "author": "daniellehrner",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Makes sense, I just wanted to double check.",
        "created_at": "2024-10-10T08:16:17.385000+00:00",
        "attachments": []
    },
    {
        "author": "daniellehrner",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Another things about gas costs. The EIP says:\n\u003e Additionally, if a transaction's `destination` has a delegation designation, add the target of the delegation to `accessed_addresses`.\n\nWhich makes sense, but shouldn't we also charge for the resolution in this case? Right now it seems we don't.",
        "created_at": "2024-10-10T08:17:20.859000+00:00",
        "attachments": []
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You mean extra costs if you call into a delegated account to load the code? I see where you are coming from, but I would argue that this is part of the 21k upfront cost of a tx. Note that the gas cost for this could be comparable to a cold EXTCODECOPY, which is 2600 gas, slightly less than 1/8 of the 21k upfront costs",
        "created_at": "2024-10-10T08:30:37.523000+00:00",
        "attachments": []
    },
    {
        "author": "daniellehrner",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, exactly. It's an extra cost that we don't have for non-delegated accounts. In the latest spec it's even possible to remove the the delegation completely, so it wouldn't affect accounts that try out delegating code but afterwards remove it.\n\nIf we want to encourage accounts to use delegation and don't charge this fee to make it a bit cheaper, it's fine for me. I just wanted to make sure that this is a conscious choice and not something that is missing in the specs.",
        "created_at": "2024-10-10T11:10:07.426000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "fix is out https://github.com/ethereum/EIPs/pull/8950",
        "created_at": "2024-10-10T14:22:19.476000+00:00",
        "attachments": []
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Will check",
        "created_at": "2024-10-10T14:31:22.231000+00:00",
        "attachments": []
    },
    {
        "author": "jochembrouwer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Approved 🙂",
        "created_at": "2024-10-10T14:34:31.769000+00:00",
        "attachments": []
    }
]