[
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "would banning ORIGIN cause less damage, or making ORIGIN a clone of msg.sender?",
        "created_at": "2024-02-24T00:06:33.821000+00:00",
        "attachments": null
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The idea was to ban it first to make sure no further reliance on it occurs, then clone once we're sure it's not being relied on.",
        "created_at": "2024-02-24T01:42:36.189000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "right but wouldn't that break more existing applications?",
        "created_at": "2024-02-24T01:55:48.284000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And if the opcode is banned, then why not just keep it banned?",
        "created_at": "2024-02-24T01:56:06.319000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e Revert smart contract deployment if contains?\n\noooh I see, this type of ban",
        "created_at": "2024-02-24T01:57:00.596000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That's not something that's been suggested before",
        "created_at": "2024-02-24T01:57:06.583000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think the main challenge with this is that there might be applications where usage of the application requires regularly creating new contracts",
        "created_at": "2024-02-24T01:57:23.179000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "ORIGIN has been a painpoint for AA for many years.  We can't revert deployment of contracts that have it, as pointed above.  Making it a msg.sender alias is one option for explicitly killing it.  Another is to just eliminate its bad use cases (which probably amount to ~100% anyway), by letting contracts become tx.origin via any of the AA or delegation proposals.  RIP-7560 as well as EIP-3074 can do this, or EIP-7377 could be modified not to manipulate tx.origin, having the same result.  The `require(tx.origin==msg.sender)` pattern becomes useless.",
        "created_at": "2024-02-24T04:27:53.282000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yeah I think the whole \"it's been anti-recommended since 2016\" thing is a pretty good reason to be ok with killing it",
        "created_at": "2024-02-24T06:04:09.075000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Converting `tx.origin` to `msg.sender` would break stuff.  That stuff is \"already broken\", but this would break it in a new way that could be more dangerous than the current brokenness.",
        "created_at": "2024-02-24T06:17:34.612000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think breaking existing contracts is a really bad idea.  Removing tx.origin seems like a great use case for contract versioning.  Newly versioned contracts can't use `tx.origin` opcode, but old versions can.  All new EVM features only get added to new contract versions (like transient storage) to encourage people to migrate to the new version.",
        "created_at": "2024-02-24T06:19:23.124000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Or, as is always my suggestion, we ossify Ethereum and build a new blockchain that doesn't have a decade of baggage.  😬",
        "created_at": "2024-02-24T06:19:42.767000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What would \"build a new blockchain\" even look like? Like, say that the consensus layer is the only thing that's L1, turn the existing execution layer into a ZK-rollup, and give the consensyus layer a feature where other people can also put up their own ZK-rollups (eg. by providing their own verification key)?",
        "created_at": "2024-02-24T06:28:23.772000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think Ethereum has enough historical baggage that there would be some big wins with a new blockchain.  Address space extension comes to mind since I spent a lot of time trying to make that work.",
        "created_at": "2024-02-24T06:33:03.595000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That being said, if Ethereum ossified and all of the core devs just went and built *real* L2s I would not be unhappy in the slightest.",
        "created_at": "2024-02-24T06:33:23.566000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Base layer privacy, ZK Provable chain, AA from the start, privatized data storage, are all things that would be incredibly hard to add to Ethereum now.  some you could just punt to L2s, but only if those L2s are truly censorship resistant (you can't punt privacy to L2s if the L2 can be censored and force you back to L1 where you have no privacy).",
        "created_at": "2024-02-24T06:35:04.846000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "State rent is another one that really should be on the base layer but would be very hard to add retroactively.  State expiry with proofs for bringing it back is a very interesting solution to the problem, but IMO it ends up being a huge hack (high technical debt) if done without address space extension, and ASE is hard to add.",
        "created_at": "2024-02-24T06:38:37.551000+00:00",
        "attachments": null
    },
    {
        "author": "arik_g",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "One of the main concerns to add here is that while L2s are mostly separate codebase - they are  trying to be EVM compatible. EVM compatibility has a lot of business value because of tooling integration - trying to get all the systems/vendors in the ecosystem to accept something new is very hard so there is a strong incentive of alignment with what is considered EVM compatible.\n\nIf Ethereum is helping L2s adopt new features by still giving those features the stamp of approval of EVM compatibility and not breaking change vs Ethereum itself - it's helpful because for the vendor it's clear that supporting this is \"legit\" and will be used by many alternatives.\nSo I think RIPs can be helpful in these kinds of improvements as part of the roadmap.",
        "created_at": "2024-02-24T06:40:25.165000+00:00",
        "attachments": null
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Agree. My plan was sort of an \"ease into it\" measure, but yes if people are going to ignore compiler warnings and yolo contracts with bad patterns, that's mostly on them. Seems dumb to let that \"misbehavior\" stand in the way of fixing something universally understood to need fixing (and real AA progress). Is there really anything out there employing tx.origin that can't be solved with social/wallet warnings and contract migration? Maybe we float this as a simple, standalone EIP to gauge the reaction?",
        "created_at": "2024-02-24T10:53:18.224000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yeah I'd support that",
        "created_at": "2024-02-24T12:07:31.458000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I doubt anyone would *lose money* from tx.origin being remapped to msg.sender",
        "created_at": "2024-02-24T12:07:46.744000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "A few people would be able to use smart contract wrappers to cheat royalties?",
        "created_at": "2024-02-24T12:08:13.680000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There are contracts out there that hold assets from multiple people and the only thing preventing robbing them are origin checks.",
        "created_at": "2024-02-24T12:16:18.642000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The ones that relied purely on origin checks *only* to protect against sequencing and conditional attacks have already been drained, but there are some that had more complex protections that break if you can call the contract from deep inside a call tree.",
        "created_at": "2024-02-24T12:17:42.670000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "For example, if you have `require(msg.sender == tx.origin)` you don't need a reentrancy guard.  If `tx.origin` always equals `msg.sender`, then such a contract is now susceptible to reentrancy exploits.",
        "created_at": "2024-02-24T12:18:54.498000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This pattern is flagged by every auditor out there, and plastered all over docs, tutorials, etc.  None the less, people do stupid things when they are allowed, even when you tell them not to.",
        "created_at": "2024-02-24T12:19:30.768000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "",
        "created_at": "2024-02-24T12:19:51.368000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "workflow.png",
                "content": "f86dab9771588f4011ee1044871271f40b33a9d75b8297bce191bb8556ba7b65"
            }
        ]
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@301186049323958275\u003e do you have any real examples you could share?",
        "created_at": "2024-02-24T12:31:51.181000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Unfortunately no.  I gave up on trying to stop people from using `tx.origin` years ago when I stopped doing auditing work, and I don't remember who listened and who didn't.  😖",
        "created_at": "2024-02-24T12:32:30.158000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The \"good\" stuff on Ethereum doesn't use `tx.origin` checks, but core devs shouldn't be opinionated about which uses of Ethereum are \"good\" and which are \"bad\" and they shouldn't pick winners by deprecating opcodes only used by \"bad\" stuff.",
        "created_at": "2024-02-24T12:33:34.035000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Can probably do some analysis of on-chain contracts and find all of the ones that use tx.origin and read through them.",
        "created_at": "2024-02-24T12:34:30.498000+00:00",
        "attachments": null
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm happy to draw up an EIP for making tx.origin a clone of msg.sender... do we favor the 2 stage approach (ban first, clone later) or the single-step ripping off of the band-aid?",
        "created_at": "2024-02-24T12:34:43.203000+00:00",
        "attachments": null
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Didn't dedaub do this already?",
        "created_at": "2024-02-24T12:38:15.671000+00:00",
        "attachments": null
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As part of 3074 analysis?",
        "created_at": "2024-02-24T12:38:30.852000+00:00",
        "attachments": null
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "https://dedaub.com/blog/eip-3074-impact",
        "created_at": "2024-02-24T12:39:26.060000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm not a fan of them limiting to \"contracts interacted with over the past months\".  I have a cold storage contract wallet (custom, not a Gnosis SAFE) that hasn't been touched for a long time, because it is a cold wallet and touching it is hard/complicated.",
        "created_at": "2024-02-24T12:44:29.164000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Something I disagree pretty strongly with this analysis is that they seem to care about likely percentage of impacted contracts.  I care about whether the number is 0 or \u003e0.  If \u003e0, then that is a hard stop for me as core devs should never be making changes that causes someone to lose money, even if it is just one person.",
        "created_at": "2024-02-24T12:51:10.504000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The authors also (likely for the sake of time and sanity) trust the comments in source code.  Where a comment says \"this is for X\" they assume that the check doesn't *also* protect against reentrancy to some extent.  They do a reasonably good job of trying to do some validation that this is the case, but as someone who has had to find reentrancy bugs, anything short of a deep audit of the functionality can very easily miss obscure edge cases that are enabled when a reentrancy check is missing.",
        "created_at": "2024-02-24T12:53:56.101000+00:00",
        "attachments": null
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Unless we can point to a clear-cut example where someone does lose money, then I think the right course of action is to publish the EIP and see if that brings anyone out of the woodwork who can point to an example.",
        "created_at": "2024-02-24T12:56:09.336000+00:00",
        "attachments": null
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And if the answer is still \"all clear\" or \"not all clear but we can live with it or work around it\" then we can make the fix",
        "created_at": "2024-02-24T12:57:04.141000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This position is why I argue so strongly for ossification.  A good financial system is one where I can put my money in it and I do not have to closely follow its change control process to make sure my money doesn't suddenly disappear.",
        "created_at": "2024-02-24T12:57:13.052000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We should not be expecting every single person who has ever written a contract (and all of the downstream people who use those contracts) to follow Ethereum core dev process closely enough to notice when something they wrote 5 years ago is suddenly going to break.",
        "created_at": "2024-02-24T12:57:56.418000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I eagerly await the day I can move my money out of Ethereum to some other ossified chain with sufficient features so I can stop following along so closely.  😆",
        "created_at": "2024-02-24T12:58:28.017000+00:00",
        "attachments": null
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Agree but the combination of warning against tx.origin for 7 years plus our inability to point to any concrete examples where it's a problem to get rid of it plus the strong community desire to make real progress towards account abstraction...",
        "created_at": "2024-02-24T13:00:16.058000+00:00",
        "attachments": null
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And I think \"build a new blockchain\" is *slightly* out of scope for this discussion 😂",
        "created_at": "2024-02-24T13:00:44.290000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't think the solution to that set of problems is to YOLO and hope we don't accidentally wipe anyone out.  The solution *is* to ossify, or at least to be *incredibly* careful when making such changes and thoroughly audit all 1000 contracts that are using the opcode you are proposing to change.",
        "created_at": "2024-02-24T13:01:29.516000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I know I have basically lost the ossification fight and Ethereum will never ossify, but even if we can't fully ossify, maybe we can still at least avoid rugging opcodes on the regular.",
        "created_at": "2024-02-24T13:02:17.843000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "To be clear, I hate tx.origin and historically I was one of the most outspoken opponents of anyone using it.  Same for self-destruct (to a lesser degree).  None the less, I think not changing the rules out from under people is more important than being feature rich.",
        "created_at": "2024-02-24T13:03:07.456000+00:00",
        "attachments": null
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah I was going to say... wasn't this aliasing of origin to sender your idea originally?",
        "created_at": "2024-02-24T13:03:39.617000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e I have made many mistakes in life.  All when I was younger.\n\u003e   -- man with bowtie, probably",
        "created_at": "2024-02-24T13:03:59.572000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As I get older, I have learned to appreciate the value of stability more and more.  When people can rely on something, they can build on top of it confidently.  If the foundation has problems, but they are well known, they can be worked around and accounted for.  When the foundation is constantly changing, you cannot be confident in the things you build on top.",
        "created_at": "2024-02-24T13:05:49.419000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "More directly on topic, it appears multiple contracts were determined to be affected by the change in tx.origin semantics, but they are hand waved away as \"things that can/will have to change to adapt to the new semantics\".",
        "created_at": "2024-02-24T13:08:45.921000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e However, since the contracts already have access lists for contract callers, they can adapt relatively easily.\n\n\u003e [...] has a likely reentrancy vulnerability under EIP-3074. However, GSN is a transaction relayer. It will certainly need to change to adapt to stay relevant",
        "created_at": "2024-02-24T13:09:27.947000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So we do have concrete examples of affected contracts, but the authors believe that those contracts can just mutate/change to deal with it.  Even if we accept that these contracts either can adapt, or are already broken (e.g., GSN I think broke already with 1559) it serves as a case study that this change *can* break contracts and since we have not done an exhaustive audit I don't think it is safe to assume that no one will be affected.",
        "created_at": "2024-02-24T13:11:15.152000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Done reading.  I also disagree with the author's conclusion.  They acknowledge that it is likely the case that a flashloan attack may be more devastating with a tx.origin change, but such an attack is theoretically possible today.  The problem is that there are often thresholds across which an attack goes from unprofitable to profitable.  For example, if you only have $1M that you can get in a multi-block loan, an attack may be non-profitable but if you could get $100M in a flashloan the attack is profitable.  You also must factor in the risk of failure such as block reorgs.  No one will give you a $100M flash loan to steal $100K because the risk of a block reorg stealing the $100M exceeds the 0.1% profit of such an attack (EV-).  However, with flashloan attacks there is no possibility for a malicious reorg, and thus the risk goes to epsilon.  This is part of why you can even get a $100M flashloan on-chain, because there is no risk for the lender, only profit.",
        "created_at": "2024-02-24T13:17:57.076000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "To evaluate whether new flashloan attacks would be introduced, one would have to fully audit/analyze the full DeFi lego stack to try to see if there are any attacks mitigated by tx.origin checks, even though such protection is currently not foolproof, but maybe is \"good enough\" at the moment.",
        "created_at": "2024-02-24T13:18:54.520000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "For 1) you can definitely have an authorized master key which is rotatable and store your EOA key is ultra cold storage (or burn it if you must). So key rotation is sort of possible with 3074.\n\nFor 2) I don’t really know what timeline we’re looking at, but considering how many things on chain (and in the world) use ECDSA i don’t see why it is a reason to block EOA improvements. There should probably be a much clearer vision for what to do in the scenario so people are aware what we plan to do when that becomes an issue.\n\nObviously smart contract wallets and true AA is where we’d like to go, but again, it’s not clear that will be a reality on mainnet. As I’ve said in other places, I (and others) do not think 7560 has a chance to be enshrined on mainnet in its current form. I think our best bet for native AA is on mainnet is something similar to 2938.",
        "created_at": "2024-02-24T17:16:32.270000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e As I’ve said in other places, I (and others) do not think 7560 has a chance to be enshrined on mainnet in its current form. I think our best bet for native AA is on mainnet is something similar to 2938. \n\nWe're not discussing RIP-7560 and EIP-2938 here at the moment, since they're not currently considered for L1.  But I think 2938 has an even lower chance, considering that it is vulnerable to builder DoS vectors that are mitigated by 7560 and 4337 but would be hard to mitigate in 2938 (or any similar proposal that doesn't mandate separation of validation and execution) without making validation much more restrictive than 4337.\n\nI do acknowledge that as a geth team member you have de facto veto power at the moment and will use it to block certain RIPs, as you recently demonstrated, but that's just one manifestation of the problem with current client distribution.  Something the ecosystem will have to correct, but is out of scope for the current discussion.",
        "created_at": "2024-02-24T18:34:51.511000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Is this approach consistent with supporting 3074, which will certainly break the assumptions of some existing contracts?  I don't think any of them is a good enough reason against 3074 or other new EIPs, but if we don't want to break people's assumptions, how can we do something like 3074?",
        "created_at": "2024-02-24T18:37:04.636000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My strongest wish is for Ethereum to ossify.  If it doesn't ossify, I want to at least curb the changes in a positive direction.  This conversation has made me appreciate the risks of the tx.origin change more though, and it does put me a bit more uncertain on 3074.",
        "created_at": "2024-02-24T18:42:54.952000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Seems we're switching roles on this one, as I find myself in the 3074 camp 🤣  I don't think protecting improper use of tx.origin is a sufficient reason to prevent an EIP.\n\nThe biggest example in the report is GSN.  As a GSN dev I can say with confidence that any such problem should be dealt with on the GSN side, not at the network level.",
        "created_at": "2024-02-24T18:47:27.795000+00:00",
        "attachments": null
    }
]