[
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Indeed, I'm not in favor of this opcode.  EOF removes code introspection and I don't think we should add it back.  From AA standpoint the rationale is that code checks are often used to discriminate between EOA and AA, preventing smart contract accounts from calling certain contracts.  As long as this is common, AA remains a 2nd class citizen on Ethereum.  AA is a part of the Ethereum roadmap so I don't think we should add opcodes that preclude it.  If I understand correctly the rationale for this opcode is to support standards that perform callbacks when the caller is a contract.  If that's the use case then maybe it could be fixed in the standards instead.  E.g. call a different function when callback is expected, or call `supportsInterface(\u003ccallback\u003e)` in a `try/catch` block to check if the account is a contract that supports that callback.  Checking for code rather than a specific interface seems like a layering violation.",
        "created_at": "2024-09-14T19:28:13.869000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If there's a trick that 721 could use to divine a contract is an account or not outside of code size length, what is to preclude contracts from discriminating between AA and EOA that way?  Alternately, they could call the AA with a well known AA function (like authorize) and discriminate based on the presence of that.",
        "created_at": "2024-09-14T22:13:50.447000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The presence or absence of HASCODE I don't see changing the ability of contracts to detect they are being called by an AA and behaving differently, perhaps it's more difficult as you have to update your detection libs when new AAs drop.",
        "created_at": "2024-09-14T22:14:57.790000+00:00",
        "attachments": null
    }
]