[
    {
        "author": "arik_g",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Joining this conversation at a bit of a delay, but hopefully not too late to provide some wallet angle on this.\nThe batch transaction capability is very important, but additional capabilities that are important and seem to receive less attention in this conversation are\n1. gasless/sponsored transactions - which was a main driver in EIP-3074\n2. multi user transactions - which is very useful not just for wallet providers but also for different companies offering B2C services.\n\nI know both of these things were mentioned, but definitely think they are top level capabilities for us.\n\nregarding the risk - while I understand the concerns with EIP-3074, it's important to remember that in a lot of situations wallets can provide a level of protection like allowing only specific invokers etc and we already have mutliple layers of protection that are additional to the blockchain level. \n\nA bottom line in the discussion of tradeoffs here from our side: A good wallet provider can solve some of the security concerns in EIP-3074, but it can't complete the functionality missing in EIP-5806.",
        "created_at": "2024-02-21T15:51:46.976000+00:00",
        "attachments": []
    },
    {
        "author": "arik_g",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Also in the conversation of doing something vs waiting for AA, we should remember that the timeline is not between now and the day that AA is enshrined, it's also until people and companies trust it enough to use it. improving EOA accounts with these capabilities starts the clock on AA adoption in many ways, because companies start using a smart wallet capabilities and it normalizes smart contract wallets as trustworthy in the process on the road towards full AA adoption and not just full AA deployment. It's the difference between deploying the feature and actually getting the impact - I think this brings us faster to the actual goal of impact.",
        "created_at": "2024-02-21T16:03:57.111000+00:00",
        "attachments": []
    }
]