[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Why do you think that batching is the \"most desired use case\"?",
        "created_at": "2024-02-18T04:41:51.560000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The big win of 3074 IMO is that it can essentially convert an EOA into a contract wallet of sorts.",
        "created_at": "2024-02-18T04:42:36.226000+00:00",
        "attachments": []
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "At least that's the indication I've seen on Twitter and other media, and the feedback from wallet devs.",
        "created_at": "2024-02-18T19:13:12.215000+00:00",
        "attachments": []
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "IMO it doesn't convert the EOA to a contract.  It lets you authorize a contract (or any number of contracts) to run in the context of the EOA, but it doesn't revoke the key, so the \"contract\" may still make arbitrary calls using an ECDSA key.  E.g. if you authorize a Gnosis Safe invoker and require 2/3 signers, the original ECDSA key can bypass it.  And in that sense, 5806 is similar.  It lets you execute any contract in the context of your EOA, while still keeping it an EOA.  The only difference is that in 5806 you explicitly sign an instruction to execute that contract (once), and in 3074 you authorize the contract to run in your EOA at any time in the future, any number of times.",
        "created_at": "2024-02-18T19:19:11.844000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "3074 is a more broad primitive that provides more opportunities for novel use cases than 5806, which is more constrained.",
        "created_at": "2024-02-18T19:20:56.232000+00:00",
        "attachments": []
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, that's intentional.  It attempts to preserve the principle of least surprise, not turn the EOA to a hybrid EOA+contract.",
        "created_at": "2024-02-18T19:22:12.675000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think that is the crux of this disagreement.  Should we build a narrowly targeted tool that solves one or more well defined problems, or should we build a new primitive that can solve a larger set of problems but comes with a larger attack surface to go with it.",
        "created_at": "2024-02-18T19:22:26.304000+00:00",
        "attachments": []
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Right.  That's the crux of it.  IMO we can get most of the benefits with much less footgun, and in parallel move the ecosystem to smart contract accounts where they get the full benefit without the footguns.",
        "created_at": "2024-02-18T19:23:42.907000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It is not clear we'll ever get real account abstraction.  People have been trying to solve it for almost a decade now.",
        "created_at": "2024-02-18T19:24:23.778000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think it is solvable, but maybe not on Ethereum.",
        "created_at": "2024-02-18T19:24:40.145000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So I don't think we should treat AA like it is a thing that will definitely happen.",
        "created_at": "2024-02-18T19:25:07.812000+00:00",
        "attachments": []
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "With 3074 you can get some benefits that 5806 doesn't offer, but they'll still be inferior to an actual AA.  For example, consider social recovery.  5806 can't do it.  3074 can semi-do it.  You can have an invoker that transfers your assets, but you can't use it to regain access to the account and rotate the key.  With full AA, you get real social recovery",
        "created_at": "2024-02-18T19:25:09.799000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I agree that full AA would be good to have.",
        "created_at": "2024-02-18T19:25:53.144000+00:00",
        "attachments": []
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think real AA is attainable.  Even erc-4337 with all the inefficiencies coming from not being a part of the protocol, gained enough tranction to have ~3M accounts (https://www.bundlebear.com/overview/all) and quite a lot of daily UserOps.  With a protocol level solution like RIP-7560 we could take it all the way.",
        "created_at": "2024-02-18T19:27:09.052000+00:00",
        "attachments": []
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "but this is not to say that we should wait for full AA and not support EOA features like batching in the meantime.  I do support solving the immediate use cases.  I just think that 5806 is a safer way to do it while we figure out full AA.",
        "created_at": "2024-02-18T19:28:14.443000+00:00",
        "attachments": []
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And of course there's the decentralization / censorship-resistance angle.  With 3074 you can solve some use cases, but UX will only make sense when using a relay, and it's going to be a centralized relay due to inability to mitigate DoS vectors.  We'll get users accostumed to UX that is only attainable via centralization.  IMO we should offer the same functionality in a way that considers censorship resistance from the start.  So 5806 offers batching and delegation without requiring a relay, because the EOA is still the one performing the transaction.  With 3074, assuning you're not going to sign twice for each transaction, you're likely going to use a centralized relay to send batches.",
        "created_at": "2024-02-18T19:31:45.622000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e but UX will only make sense when using a relay, and it's going to be a centralized relay due to inability to mitigate DoS vectors\n\nI don’t think this is true at all. You can certainly build a 3074 invoker that looks like the entry point contract. I also don’t see why you can expand 3074 to support user ops from an EOA. It might even be possible today w some trickery",
        "created_at": "2024-02-18T23:56:21.691000+00:00",
        "attachments": []
    }
]