[
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The problem that I have with a lot of this \"let's empower EOAs instead\" discourse is that in the long term, **it is indisputable that we have to dump EOAs**, for two reasons:\n\n1. **Key rotation**. In the \"trad cryptography world\", expiring old keys is considered standard practice and if you don't do it you're considered unserious\n\nhttps://www.piiano.com/blog/key-rotation\n\nhttps://www.quora.com/Why-is-it-important-to-frequently-update-your-cryptographic-keys\n\nAnd any kind of bolt-on to an EOA (3074 or MPC) that preserves the EOA part inherently does not expire keys - if a person or group of people had the power to access the EOA in the past, they have that power today.\n\n2. **Quantum computers**. Eventually, N years down the line, ECDSA will be broken and we have to switch to something else.\n\nAnd so the question by which I think any short term proposal should be evaluated is: **are they forward-compatible with a sensible vision that actually satisfies these two objectives?**\n\n\"Every account has a piece of validation code, which validates incoming txs, and approves an op to execute\" is a clearly sensible vision that solves both of the above problems, as well as a lot more (eg. secp256r1 support, multisigs, daylimits...) in a very elegant and general purpose way that ensures that, once implemented, we never have a reason to touch this whole part of the EVM again (satisfying \u003c@301186049323958275\u003e's ossification goal). EOAs-as-they-stand-today cannot be ossified, because they satisfy neither of the above goals, but general-purpose validation code obviously can.\n\nAnd so ideally what we should all be working together on over the next 1-3 years is, a roadmap by which we give users incrementally better functionality, in a way that neatly brings us to such a long term vision in stages.",
        "created_at": "2024-02-23T02:36:46.393000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If one holds a hard premise that AA **WILL** happen, then any of the current proposals are stopgaps and are probably not worth the added client complexity to implement.",
        "created_at": "2024-02-23T05:00:07.167000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "While I agree with you that AA is critical, I am not convinced that means it will happen.  Removing the supply limit on Bitcoin is critical for its security, yet it probably will never happen.  Being critical for long term health doesn't necessarily correlate with what will actually happen in the future.  I'm OK with this because I'm not a one-chain maximalist.  I'm OK with Ethereum being super useful for a while, and eventually being replaced by something else in the future.",
        "created_at": "2024-02-23T05:01:18.073000+00:00",
        "attachments": []
    },
    {
        "author": "arik_g",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If we assume that AA must happen eventually, and it will be the right option for users to choose anyway, we should not feel the need to keep EOAs weaker to force a transition. And improving EOAs with smart contract capabilities actually makes sense because it drives the ecosystem to slowly adopt smarter accounts in their operation on the road towards full smart account abstraction alongside the ecosystem building that is happening in ERC-4337.\n\nSince a lot of EOA accounts will not want to voluntarily move their assets to a different address we will likely only see full AA adoption with something like EIP-7377. The idea of an EOA account to do a EIP-7377 transaction and promote to a smart contract is much more reasonable if the EOA is already leveraging one or more trusted Invoker contracts at that point for a long period of time instead of having to do it from scratch on a regular current EOA setup. Building the AA approach on an entirely separate path from EOAs and never letting the two technologies meet will likely cause the entire process to be much longer. So I would think that EIP-3074 brings us close to full AA.\n\nAlso - I can say comfortably that today, the tradeoff between EOAs and sponsored/batched transactions is a meaningful pain point for a lot of different products - so once the option exists to combine them - it will be adopted and so the transition will accelerate as mentioned above.",
        "created_at": "2024-02-23T08:52:02.539000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yeah I totally support EIP-7377",
        "created_at": "2024-02-23T10:27:48.833000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I fully agree that it's bad for EOAs and AA to be separate tracks; they should be improving in lockstep, and ideally in the mid stage an EOA just becomes equivalent to an AA wallet but where the validation part of the code is an ECDSA verifier",
        "created_at": "2024-02-23T10:30:46.779000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think what I would like to see is, what is a clear roadmap that has the parts that you want in the short and medium term, and that goes to the right destination in the long term, where the parts feel like they are on a path to the destination",
        "created_at": "2024-02-23T10:32:34.101000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The current 4337 roadmap has basically had that for a while now: (i) do 4337, (ii) 7560 on L2s, (iii) 7560 on L1, (iv) EIP-7377, and then everything is a contract",
        "created_at": "2024-02-23T10:33:19.036000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Are there other paths for (i), (ii), (iii) that are not being explored?",
        "created_at": "2024-02-23T10:33:43.187000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "eg. one possible way to think about this might be: in addition to (i) account verification logic, 4337 is also handling (ii) run-evm-code-from-account, (iii) paymasters. And so a mid-term EOA strategy would be to give (ii) to (iii) to EOAs, in such a way that the code written for EOAs would be _exactly the same as_ the code written for 4337 accounts, so that we can be working on one ecosystem for (ii) and (iii), and then in the meantime whoever needs different account verification logic can make a smart contract wallet and use it",
        "created_at": "2024-02-23T10:35:49.081000+00:00",
        "attachments": []
    },
    {
        "author": "ahmedalbalaghi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "One other aspect that is likley to encourage a shift is if a use case is too strong a use case to get people to use smart accounts. Problem is that use case is hard to come by. \n\nIn what you're suggesting how would smart accounts themselves be seen as first class citizens if you decide to give more power to EOAs? Why would wallets want to change after that?",
        "created_at": "2024-02-23T11:55:20.173000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Use cases of the \"change the verification code\" part of AA (aka, what \"AA\" was up until ~3 years ago) that I have noticed are particularly compelling include:\n\n* Keys inside TPMs\n* Multisigs\n* Multisigs where each individual key is inside a TPM 😃 \n* Cold / hot permissions separation\n\nSo those use cases exist. But I think the broader idea is, as AA infrastructure gets better, the cost of switching over goes down, and at some point years down the line we can just force-convert EOAs into smart contracts which implement equivalent logic.",
        "created_at": "2024-02-23T12:38:32.461000+00:00",
        "attachments": []
    },
    {
        "author": "ahmedalbalaghi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Sorry, I have to ask, what's a TPM 😅",
        "created_at": "2024-02-23T12:56:31.394000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "~~Transactions per Minute~~ Trusted Platform Module",
        "created_at": "2024-02-23T13:03:27.803000+00:00",
        "attachments": []
    },
    {
        "author": "ahmedalbalaghi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks for the list - I still feel this use cases wont compel people to switch over or get dapps to build with Smart accounts in mind. \nAs for multisig, its easy to use a Safe which is a standard.\n\nOne use case which is interesting, allowing users to use funds from same address across different chains. Be it a batch send or batch swap, allows users to move all the eth spread across their l2s. Simple things like this would be great, however, still needs users to have smart account across different chains. \n\nIm trying to think more around what are the low hanging experiences/UX needs of existing users that would make them want to switch",
        "created_at": "2024-02-23T13:10:21.122000+00:00",
        "attachments": []
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We need to think about *future* users, not just current users.  We are often biased towards ourselves and the existing community but most future users are not current users.  Let's ask ourselves why, and focus on addressing that.\n\nSome random examples:\n\nMost people won't be able to manage keys.  Therefore:\n- Using devices rather than keys, not having to know what a seed phrase is. (requires secp256r1, key rotation).\n- Account recovery via simple web2 methods. E.g. zkEmail to prove ownership of a gmail address and an outlook address (2/2).\n- Authorize specific operations to 3rd parties.  E.g. recurring payments.\n\nNot all users will have ETH (or the native coin of whatever chains they use),.  Therefore:\n- Pay gas with ERC-20, \n- Pay gas with fiat.\n- Watch ads, transact for free.\n\nSome people may not even know/care what chain they're using.  Therefore:\n- Cross-layer keystores.  Manage your credentials in one place, transact everywhere.\n- Chain abstraction. Transact across multiple chains, pay gas on your home chain.\n\nPrivacy. In the trad finance world people don't expect everyone to see their every transaction.  Therefore:\n- Privacy preserving paymasters.  Ability to transact from multiple accounts without linking them.\n- Ability to prove ownership of private accounts voluntarily, for KYC purposes.\n\nIn the corporate world, accounts have different spending policies for different people. There's seldom one person with \"superuser\" power. Therefore:\n- Different roles in the account, different spending policies. E.g. Payroll can pay salaries once a month to a list of addresses approved by a controller. Controller can't spend but can veto payments. Legal can't move funds but can vote with tokens. Board can replace signers.\n\nI'm sure we can come up with many more, once we think about the gaps between the blockchain and the trad world.",
        "created_at": "2024-02-23T14:41:48.425000+00:00",
        "attachments": []
    },
    {
        "author": "ahmedalbalaghi",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks \u003c@727296082484265073\u003e for the comments. \n\nDefinitely agree we should focus on future users. One thing that we've seen time and again right now is that new users are generally hard to come by even for a web2 app. \n\nMaybe my question should be more towards the application side to get web2 users into web3, which will naturally utilise the above. \n\nHowever, its clear (at least for past couple of cycles) that what existing users do has always set a precedent for what future users will do. So even getting ourselves/our industry to dogfood smart accounts is going to be important.\nHence why use cases to get existing users to move to a smart account and get them to stick to it will get more dapps/ecosystem to support smart accounts from the get go. Privacy is always a interesting use case but any builder here probably has to be careful.\n\nI'm sure we can come up with many more, once we think about the gaps between the blockchain and the trad world. \u003c\u003c 100% agreed and this is where probably we need to find more and more dapp teams that can build these use cases with AA in mind",
        "created_at": "2024-02-23T18:21:23.279000+00:00",
        "attachments": []
    },
    {
        "author": "arik_g",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I like the way you see to parallel progression on (ii) and (iii) on EOAs - that is a good direction. \n\nI am somewhat concerned that “exactly the same code” might be a restriction that is too heavy on this approach for the following reasons:\n1. These are different technologies and so trying to solve for both with the same codebase will likely require a bunch of “if EOA then” making the solution that addresses both use cases cumbersome.\n2. AA is a new technology that is still shifting a lot, so it will force a lot of changes on a more solid/stable technology of EOA. This might mean EOAs can’t really adopt the new capabilities because they will be hard to stabilize.\nWhich could eventually cause all the short-mid term solutions to only become viable in the long run - which missed on the goal of providing these capabilities earlier on the road to the full solution rather than at the same timeframe.\n\nMy gut feeling is that the same code base between the two technologies is not going to be on the lowest level of the protocol initially but rather on the slightly higher level of the smart contract or even smart contract modules. So it might be that the lower levels are different but the modules that provide the actual capability mature together. It will be up to the developer ecosystem to iron this out, but market powers should drive everyone towards the better solutions that are also future proof for full AA.",
        "created_at": "2024-02-23T19:48:16.367000+00:00",
        "attachments": []
    },
    {
        "author": "arik_g",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I would also like to split (ii) and (iii) slightly differently and say that paymasters include 2 separate but related capabilities: a sponsored transaction by the sender and a sponsored transaction by a 3rd-party paymaster. Although technically the second capability includes also the first one - there is a lot of value in the first capability by itself as an intermediate step. Especially before there is a solid orchestration framework around the Entry point, basically a separating  sponsoring from decentralized sponsoring.\n\nIf I had to rank the order of introduced capabilities it would probably be: \n1. sponsored transactions \n2. run evm code from account (incl. batch transactions)\n3/4. secp256r1 and other signature validation\n3/4. paymaster (decentralized sponsoring) \n\nThis is basically why I like 3074 - it advances the top 2 most urgent needs imho. Even the “single nonce” version mentioned above would be useful if it’s not price prohibitive but it's possibly better to leave that decision to the user/wallet.",
        "created_at": "2024-02-23T19:48:20.787000+00:00",
        "attachments": []
    },
    {
        "author": "arik_g",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The example flows yoav mentioned make a lot of sense - we can definitely add more to the list.\nI think a common things for new users comnig in is that they initially have no wallet and no Eth and someone (app/dapp) is usually there to help them onboard and we want to make sure that someone has all the capabilities they need to make the user's life easy in the first steps - being able to start operating without doing hard things without having to take control/ownership of the user's account.",
        "created_at": "2024-02-23T19:57:48.471000+00:00",
        "attachments": []
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Many of these EIPs (7377, 3074) have awkward carve-outs for how to deal with tx.origin, a tech debt relic that has been advised against since mid-2016, complained about by Solidity for nearly as long, and really shouldn't be used for a variety of reasons...\nFor the purpose of greasing the wheels of a strong AA solution down the road, does it make sense and is it feasible to phase tx.origin out completely like so:\n1. EIP-X: Ban usage of ORIGIN as of Pectra. (Revert smart contract deployment if contains?)\n(in the interim: social campaign to warn devs and users away from contracts that use tx.origin, wallet warnings, etc)\n2. (months or years later, if deemed safe) EIP-X+1: Retroactively alias ORIGIN to SENDER, eliminating it entirely.\nI'm not nearly knowledgeable enough to understand all the externalities of doing something like this. Looking for initial feedback. Is it even helpful to do this? Is it feasible? Is it worth the effort?",
        "created_at": "2024-02-23T20:51:52.020000+00:00",
        "attachments": []
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "ORIGIN still gets use, more than REVERT, BASEFEE, GASPRICE, COINBASE, BLOCKHASH.  It's not like it would be banning a curiosity like CALLCODE.",
        "created_at": "2024-02-23T22:37:49.453000+00:00",
        "attachments": []
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It could have an escape hatch such as if a contract is in the access list of the transaction it behaves as normal.  And I wouldn't revert, I would have it return a well-known and easily recognizable bogus address like 0xFFFF....FFFF",
        "created_at": "2024-02-23T22:39:32.221000+00:00",
        "attachments": []
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It definitely still gets use. The question is whether it gets *legitimate* use. We've been advising against \"if(tx.origin == msg.sender)\" for many years now but people still do it. Hence, banning it outright.",
        "created_at": "2024-02-23T22:48:22.191000+00:00",
        "attachments": []
    }
]