[
    {
        "author": "julrach",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "gm all! after spending a ton of work on 7702, we wanted to put together a writeup that nails down what needs to be done in order to rubber stamp the spec up to this point. we took into consideration all of the open threads being discussed and boiled things down to this.\n\nhttps://hackmd.io/@otim/BkUQJ5RdA\n\nwe hope that this helps us all realign on 7702's mission and bring us closer to the \"rubber stamp-ening\"!",
        "created_at": "2024-07-25T01:16:47.077000+00:00",
        "attachments": null
    },
    {
        "author": ".vshvsh",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "[EIP-7702] The Rubber Stamp-ening - Hack...",
        "created_at": "2024-07-25T14:39:56.429000+00:00",
        "attachments": null
    },
    {
        "author": "ankitchiplunkar",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "hey \u003c@543900561460822016\u003e \u003c@552133098075193354\u003e , I have been talking to several wallet teams and they are backing the proposed changes in this doc. https://hackmd.io/@S9AwbucvTS6GYodLz-G1SQ/S102UtTwA\n\nGiven that the latest change is still fresh (is 2 weeks old). I think it would be beneficial to schedule a breakout session between the wallet and client teams to understand why these teams prefer to make different trade-offs with the EIP\n\nTeams who support the above proposal are: Argent, Chainsafe, Fireblocks, Metamask, OneBalance, Rabby, Safe, Trustwallet, Walletconnect, Zerion, 4337 team",
        "created_at": "2024-07-25T17:15:34.191000+00:00",
        "attachments": null
    },
    {
        "author": "ankitchiplunkar",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Note, wallet teams want 7702 in Pectra. But they want emphasize that these changes will be very very nice to have and increase the UX feature set.",
        "created_at": "2024-07-25T17:15:58.863000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As I've said again and again, this change is not safe due to the fact that once an account is migrated fully to a smart contract wallet, the EOA private key can still spend funds using permit and potentially other mechanisms. Not to mention, the account may still be an EOA on other chains. It's not reasonable to ask that users understand that despite upgrading their account, their private key is still toxic",
        "created_at": "2024-07-25T17:18:51.030000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Continuing to push this is only harming our ability to ship any EOA improvement in Prague",
        "created_at": "2024-07-25T17:20:25.633000+00:00",
        "attachments": null
    },
    {
        "author": "drortirosh.",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Unfortunately, the alternative is to have a new hybrid account, with an unpredictable security model, as it can be used both as 7702 authority as an EOA.",
        "created_at": "2024-07-25T17:48:44.108000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What is unpredictable about the security model ?",
        "created_at": "2024-07-25T17:49:05.270000+00:00",
        "attachments": null
    },
    {
        "author": "drortirosh.",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There was one DoS attack we described that may fill the mempool with a huge # of txs, all invalidating each other, and thus very hard to build a block (had to validate and drop most of them). Under such an attack, only large block builders can succeed (eg MEV searchers)",
        "created_at": "2024-07-25T17:50:59.622000+00:00",
        "attachments": null
    },
    {
        "author": "drortirosh.",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, it is possible to mitigate (partially) this attack, bit were not sure if that's the only possible one",
        "created_at": "2024-07-25T17:51:26.525000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It's perfectly predictable, you can see by looking at the account code if it has delegated via 7702. Unless you have another attack, the original DoS issue already has a several solutions",
        "created_at": "2024-07-25T17:53:09.722000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But this is orthogonal to CODERESET, which is itself unsafe and wouldn't be suitable to deal with the DoS in the first place",
        "created_at": "2024-07-25T17:53:36.577000+00:00",
        "attachments": null
    },
    {
        "author": "ankitchiplunkar",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Agree that with any migration scheme the EOA private key if leaked can be used to withdraw funds, all EOA migration proposals will have this issue  (https://discord.com/channels/595666850260713488/718596092828057631/1264205801858400366):\n1. with the current 7702 proposal if EOA key leaks all user assets are at risk\n2. with the proposed change if EOA key leaks assets which have permit or accounts on chains which have not migrated will be at risk (which is a smaller surface area)\n\nIf the issue is educating the user about EOAs private key toxicity then it can also be done at the wallet level. Making  the EOA private key a root user comes at the cost of new mempool DOS issues or sacrificing features such as granular onchain permissions and cross-chain locks.",
        "created_at": "2024-07-25T18:33:24.738000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "you already said this last week",
        "created_at": "2024-07-25T18:35:06.154000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm not sure how to say it more clearly - it's not reasonable to expect users to understand that their private key is still toxic after migrating their account",
        "created_at": "2024-07-25T18:35:57.430000+00:00",
        "attachments": null
    },
    {
        "author": "pedrouid",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@543900561460822016\u003e would you say that you don’t believe the new proposal is solving the problem completely because of the private key can still be used with permit??\n\nBut wouldn’t you agree that reduces the surface that the private key can be used??",
        "created_at": "2024-07-25T19:46:33.802000+00:00",
        "attachments": null
    },
    {
        "author": ".vshvsh",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't think current 7702 is more safe though, in a sense it won't lead to less exploits/scams. It doesn't change wallet security model, true, but that's not the same as more safe. I think on balance it will lead to worse user security than CODERESET or similar \"full migration with limited fallback\".",
        "created_at": "2024-07-25T19:47:04.546000+00:00",
        "attachments": null
    },
    {
        "author": ".vshvsh",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "all advanced security features of SCA are locked behind limiting the private keys power",
        "created_at": "2024-07-25T19:47:35.333000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The private key can replace the implementation so there is no confusion about how much power the private key has",
        "created_at": "2024-07-25T19:47:43.751000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "7702 isn't meant to migrate users away from private keys - it's to help bootstrap the smart contract wallet ecosystem so more dapps will support contract wallets as an interface",
        "created_at": "2024-07-25T19:48:16.055000+00:00",
        "attachments": null
    },
    {
        "author": "pedrouid",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But both the existing or the new proposal are not migrating users completely away from private keys",
        "created_at": "2024-07-25T19:49:14.399000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "CODERESET allows users to completely migrate to a smart contract wallet without a way to revert",
        "created_at": "2024-07-25T19:49:38.804000+00:00",
        "attachments": null
    },
    {
        "author": ".vshvsh",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "to put it different \"you private key continues to be full admin\" is easier to understand than \"there's a weird edge case with some tokens and maybe something else\" but not necessarily more secure",
        "created_at": "2024-07-25T19:50:06.970000+00:00",
        "attachments": null
    },
    {
        "author": "pedrouid",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It’s allowing them to migrate completely but also to revert it",
        "created_at": "2024-07-25T19:50:15.594000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "only if their wallet implements the revert functionality",
        "created_at": "2024-07-25T19:50:29.609000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "correct",
        "created_at": "2024-07-25T19:50:46.303000+00:00",
        "attachments": null
    },
    {
        "author": "pedrouid",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But the ability to revert wouldn’t be siloed for each wallet",
        "created_at": "2024-07-25T19:52:19.669000+00:00",
        "attachments": null
    },
    {
        "author": "pedrouid",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "A use can still migrate between wallets and call CODERESET",
        "created_at": "2024-07-25T19:52:38.424000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I didn't say they couldn't. But they *can* migrate fully to a smart contract w/o ability to revert if the contract they delegate to does not use `CODERESET`",
        "created_at": "2024-07-25T19:53:23.569000+00:00",
        "attachments": null
    },
    {
        "author": "pedrouid",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Well the new proposal had 3 parts actually",
        "created_at": "2024-07-25T19:54:07.264000+00:00",
        "attachments": null
    },
    {
        "author": "pedrouid",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "One of them was to bring back the initCode approach",
        "created_at": "2024-07-25T19:54:20.121000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it doesn't really matter once the code is set",
        "created_at": "2024-07-25T19:56:23.575000+00:00",
        "attachments": null
    },
    {
        "author": "rimeissner",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Imo it would be helpful to outline the dos vector clearly in the doc to make sure that everyone has the same understanding (or link a resource where this is explained). It currently just says: \"DoS vectors were mentioned in the past\".",
        "created_at": "2024-07-25T22:42:09.556000+00:00",
        "attachments": null
    },
    {
        "author": "rimeissner",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Only if the smart contract supports the codereset opcode or delegatecall, right? If I write a smart account that supports neither then this would be a permanent migration. Or am I misunderstanding something?",
        "created_at": "2024-07-25T22:44:29.561000+00:00",
        "attachments": null
    },
    {
        "author": "rimeissner",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Would love to see initCode. There have been previous discussion where the outcome was not to support it (Yoav was one of the people that voiced concerns). Would be helpful to summarize these discussions and say what changed.",
        "created_at": "2024-07-25T22:47:05.860000+00:00",
        "attachments": null
    },
    {
        "author": "rimeissner",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Personally I would also be interested in why the different teams would like to see these changes. For some teams this is already clear (4337 - DoS considerations for Bundlers, Safe - initCode makes it easier to initialize a 7702 account, OneBalance - full control to smart account to make them credible). But for other teams it is not as clear (at least for me). Would love to hear that from MM, FB, Trust, Zerion, and others, as this would make it easier to understand what this would concretely enable for these teams (and also if these use cases are impossible with the current 7702, like credible accounts)",
        "created_at": "2024-07-25T22:56:14.693000+00:00",
        "attachments": null
    }
]