[
    {
        "author": "gregthegreek",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "just heard about the breakout meeting, really excited!",
        "created_at": "2024-02-22T14:50:37.909000+00:00",
        "attachments": null
    },
    {
        "author": "gregthegreek",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Is there a list of major concerns from ACD regarding any of the proposals? \u003c@403707149043105803\u003e seems you have some.",
        "created_at": "2024-02-22T14:51:42.603000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My concerns are not new - https://ethereum-magicians.org/t/a-case-for-a-simpler-alternative-to-eip-3074/6493/2 - and the recent nonce change is insufficient to address these, it is a half measure when a full measure was called for.  There was also concern on an ACD call a few meetings ago about the safety of invokers in general by a different voice on the call, saying the model needed more time to be analyzed by security researchers.",
        "created_at": "2024-02-22T14:54:20.055000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i'm just curious, if 3074 auth msg is only valid for the nexts nonce for the EOA would that be sufficient for you \u003c@403707149043105803\u003e ?",
        "created_at": "2024-02-22T14:57:02.010000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes.  That is one of the full measures I called for.",
        "created_at": "2024-02-22T14:57:31.090000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "but is that on it's own enough?",
        "created_at": "2024-02-22T14:57:43.347000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That brings the \"blast radius\" in line with existing mechanisms",
        "created_at": "2024-02-22T14:58:08.797000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I can't speak for others, but the eternal authorizations was always my tripping point.",
        "created_at": "2024-02-22T14:58:38.671000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "is it okay for you if the nonce isn't incremented during 3074 use, so it can be reused if it is relayed on chain by someone else? imo this is still the same security model because anything you can do w multiple txs you can do in a single operation",
        "created_at": "2024-02-22T14:59:36.731000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "just need to send 1 tx from eoa to revoke",
        "created_at": "2024-02-22T14:59:50.698000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That is fine because revocation is a single transaction.",
        "created_at": "2024-02-22T14:59:53.373000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Also, it's important to note that the current spec has ChainID as a requirement.  I think that is also as critical as the invoker address, and chain+invoker should be considered the invoker identity being authorized.  It cuts out a lot of attack vectors.",
        "created_at": "2024-02-22T15:17:18.689000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think the root of the problem should be addressed/resolved, rather than trying to horse trade around it.\n\u003e Is the EVM the appropriate layer to be protecting users, or should the EVM instead be powerful and it is up to wallets/language (Solidity) to protect the user?",
        "created_at": "2024-02-22T15:22:35.558000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Coming to rough consensus on this will address not just this disagreement, but many future disagreements as well.",
        "created_at": "2024-02-22T15:23:40.435000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "agree with you here, was just trying to confirm if i understood his concern correctly",
        "created_at": "2024-02-22T15:59:07.766000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think that's the core issue, it appears to me there are many who think the answer is a solid no, and that EOAs should always be EOAs. Since their answer is no they don't participate in discussions about how to change it because all they have to add is \"no, not that change\" because categorically that's the answer.  They don't want to be a Negative-Nancy in design discussions, so they wait for the final proposal to drop their \"no.\"  I don't think they are being entirely unreasonable either.",
        "created_at": "2024-02-22T16:17:49.505000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In essence \"EOAs are ossified, if you need new features invent new addresses types or use mechanisms like Smart Contract Accounts\"",
        "created_at": "2024-02-22T16:19:13.131000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm not that absolute about it, but those people exist.",
        "created_at": "2024-02-22T16:19:35.366000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm certainly a huge fan of ossification!  If that is on the table then I'm in the \"hard no\" camp.  😄  However, if Ethereum is going to continue to make changes despite all of my efforts to stop it, then I would at least like those changes to be things I think are useful/valuable, which includes 3074.",
        "created_at": "2024-02-22T16:31:13.218000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Right.  That's the main issue.\n\nMy sense is that we should take some responsibility for user safety if we want a real chance to bring the mythical next-billion-users.  The blockchain is notorious for how easy it is to get scammed, lose keys, or otherwise lose your money.  Ask almost anyone outside our community, they're afraid of it.  Self custody is a core value, and it comes with these risks.  We can't fully mitigate it without compromising on values like self custody, credible neutrality,  censorship resistance, etc, but we should at least help it where we can.\n\nHaving said that, I can totally relate to the other approach - making the protocol as powerful as it can be (without compromising said values), and just telling everyone \"caveat emptor\".  I'm just not sure it'll result in mainstream adoption.",
        "created_at": "2024-02-22T18:08:13.457000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What's funny is that in some SEAL conversations I've been on the other side of that argument, opposing proposals to add mechanisms to protect users by introducing protocol level censorship methods to deal with stolen funds.  Interesting to see the difference in perspective between this group and that of DeFi projects and wallets.  Personally I draw the line at censorship resistance and credible neutrality.  Everyone has a different line.",
        "created_at": "2024-02-22T18:08:50.529000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't think we should just make the protocol powerful and say caveat emptor, I think we should make the protocol powerful and build security in layers on top of it.  I would love to see significantly more effort devoted to improving the wallet \u003c-\u003e dapp and wallet \u003c-\u003e contract communication protocols and making them *far* more robust and harder for users to shoot themselves in the foot.",
        "created_at": "2024-02-22T19:11:13.292000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The amount of effort put into improving user security at the wallet layer is absolutely dwarfed by the amount of effort put into the core protocol.  I don't think that means we should move end-user security concerns to the core protocol, but rather we should try to put more effort into the wallet layer.",
        "created_at": "2024-02-22T19:11:14.275000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Tl;DR: We *should* care a lot about end-user security.  We should just put that effort into the wallet layer rather than the protocol layer.",
        "created_at": "2024-02-22T19:11:49.875000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I definitely agree on investing more in wallet security and we're seeing a lot of improvements lately, on things like better simulation.  The protocol will also help, e.g. EOF can make simulation more reliable.  But for things like key rotation, either they bite the bullet and implement a smart account, or the protocol will have to do it for them.  EOA can only take us so far.",
        "created_at": "2024-02-22T20:53:49.488000+00:00",
        "attachments": null
    }
]