[
    {
        "author": "drortirosh",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The rules apply only to nodes that participate in the mempool: they protect the node and the mempool from malicious transactions.\nThey are not relevant to the consensus.",
        "created_at": "2024-02-29T04:28:57.962000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "of course, this is always true for mempool rules.. but also pretty much all nodes run the current mempool rules, so does 7560 also insist all nodes run 7562?",
        "created_at": "2024-02-29T07:18:18.544000+00:00",
        "attachments": null
    },
    {
        "author": "arik_g",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We had some conversations in the team around how it might be possible to make EIP-3074 and ERC-4337 work better together and solve some of the problems raised yesterday - it's very last minute but still thought that it might be useful to send here.\nGiven the rush to showcase this before the meeting - there is definitely a chance that we are missing something important (but I hope we are not), we would have definitely taken more time to review this in any other circumstances.\nhttps://hackmd.io/ChB8t4lvR6q13suW0e_5RQ?view",
        "created_at": "2024-02-29T13:22:13.193000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As I briefly mentioned in the call, I think we would actually want the opposite direction! ie. if the AUTH opcode gets called with the `authority` being a smart contract wallet, that should expect and verify a smart contract signature.\n\nThe idea being that if the invoker workflow exists, it should be available to both EOAs and SCAs, so that we don't have separate ecosystems of EOA functionality and SCA functionality.\n\n(probably reasonable to add this one in a fork soon after 3074)",
        "created_at": "2024-02-29T14:49:20.892000+00:00",
        "attachments": null
    },
    {
        "author": "arik_g",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That could be a good improvement for EIP-3074 to make sure SCA are not excluded from this new flow. \n\nWe were trying to focus on a different concern that Yoav had that an EOA would require a centralized relayer to use 3074 capabilities - our proposal would allow all EOAs to leverage the relayer decentralization capabilities of 4337.",
        "created_at": "2024-02-29T15:13:53.838000+00:00",
        "attachments": null
    }
]