[
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Sorry I missed this.\n\n\u003e IMO, it's absolutely not the case that AA is held back by contracts attempting to discriminate against accounts with code...\n\u003e \n\u003e can you provide examples of code in the wild to support the idea that HASCODE will hold AA back?\n\nI don't have a comprehensive list but AA wallet devs complain about it a lot and showed me such projects before.  A quick search for modifiers like `noContractAllowed` and other common variations yields many results. Here's one: https://etherscan.io/address/0xc21D353FF4ee73C572425697f4F5aaD2109fe35b#code (many functions protected by `noContractAllowed` which is implemented like this: `require(!address(msg.sender).isContract() \u0026\u0026 msg.sender == tx.origin, \"Sorry we do not accept contract!\");`, and `isContract` is `assembly { size := extcodesize(account) }`.  If you want more examples we can ask AA wallets to make a list.\n\n\u003e the main obstacle for AA adoption is the assumption that accounts can produce ECDSA signatures, and the lack of adoption of ERC-1271 (and ERC-6492!)\n\nThe input we got from AA wallets is that the two biggest obstacles are code checks (extcodesize, tx.origin) and ERC-1271 support.  The latter has been improving a lot since https://eip1271.io/ started shaming projects into supporting it.  The \"red list\" used to be much longer than the green. Now it's much shorter. But code checks remain a problem.\n\n\u003e the only things i can think of have been NFT drops that try to prevent accounts from claiming more than one token or whatever\n\nI think the real reason many NFT projects do this is not to prevent double-claiming but to prevent wrapping as a way to bypass royalties.  You can transfer ownership of a contract that owns an NFT but you can't do it with an EOA because the original owner will still have the key.  That's a practice we should discourage, as it goes against any form of AA.  Key rotation is a core feature.",
        "created_at": "2024-10-24T13:58:41.586000+00:00",
        "attachments": []
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "thanks \u003c@727296082484265073\u003e i'll take a look at this example and look for similar ones",
        "created_at": "2024-10-24T18:11:49.709000+00:00",
        "attachments": []
    }
]