[
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "OK, Thanks for trying.  If there's a good enough internet connection on the flight I'll try to join, but most likely I'll only join ACD the next day.  I hope it'll also be recorded.",
        "created_at": "2024-02-27T02:10:57.334000+00:00",
        "attachments": []
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't remember all the details of 2938 right now, but IIRC making it a special contract type with the AA_PREFIX and preventing calls to it from anything other than an AA transaction is the only way to prevent tx1's post-PAYGAS code from invalidating tx2.  But doesn't it also break many of the AA use cases that are already widely used, which do require calls to the account from other contracts? Recurring payments, intents \u0026 COW swaps, verifying erc-1271 signatures, etc.  In addition, the restrictive pre-PAYGAS rules make it impossible to develop modular accounts (I think most 4337 accounts are modular now), or any other use case that requires accessing other contracts and other contracts' storage.  I'm not even sure how use cases like gas payment with ERC-20 tokens could work, since it'll be impossible to call a paymaster to precharge the ERC-20 tokens and pay the gas.  Separating validation from execution results in better UX by enabling all these use cases.",
        "created_at": "2024-02-27T02:28:22.440000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "and the other thing that separated validation is good for is aggregation, which I continue to think is a long-term necessity",
        "created_at": "2024-02-27T03:13:01.873000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The notion of a smart contract wallet having a \"home\" on one chain, and then proving its status every time it needs to make a tx on another chain, is a really attractive workflow in the long term when we can actually get the tech done to do this, but that really heavily depends on SNARKs and recursive SNARKs, and then post-QC on recursive STARKs, so ultimately that whole vision can only work if we do proof recursion for aggregation off-chain",
        "created_at": "2024-02-27T03:15:04.548000+00:00",
        "attachments": []
    },
    {
        "author": "zengjiajun",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hi Tim. I can invite some of our devs to come and give feedback. Which zoom link should we use? I couldn’t find it through chat history.",
        "created_at": "2024-02-27T13:35:28.733000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Here is all the info for tomorrow's call: \n\n**Agenda:** https://github.com/ethereum/pm/issues/962\n**Stream:** https://youtube.com/live/FfEZdTFAz4E\n**Zoom:** https://ethereumfoundation.zoom.us/j/86591733022?pwd=mndmHYkxBbibTYHjaNZAXEgXG1RPaM.1\n**Cal invite:** https://calendar.google.com/calendar/event?action=TEMPLATE\u0026tmeid=M2xoMGtiZHVzczg3czRoMGltYWIyOWc1Z2ogY191cGFvZm9uZzhtZ3JtcmtlZ243aWM3aGs1c0Bn\u0026tmsrc=c_upaofong8mgrmrkegn7ic7hk5s%40group.calendar.google.com",
        "created_at": "2024-02-27T16:37:05.518000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "what are SNARKs/recursive SNARKs missing in order to make this a reality?",
        "created_at": "2024-02-27T17:04:41.316000+00:00",
        "attachments": []
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Agreed that it makes sense to do the proof recursion off-chain, given the \"home\" chain is not able to verify SNARKs *extremely* cheaply",
        "created_at": "2024-02-27T17:07:19.931000+00:00",
        "attachments": []
    }
]