[
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Indeed I wasn't talking about 721 but about contracts that try to prevent calls from contracts,   Why is `supportsInterface` not an option for 721?  The contract has to call `onERC721Received` when available, but also support EOA that doesn't have it.  The contract could distinguish between three cases:\n1. EOA - the call to `onERC721Received` does not revert but also doesn't return the required magic (or anything else).\n2. Contract that has `onERC721Received` - returns the magic.\n3. Contract that doesn't have `onERC721Received` and doesn't have a non-reverting fallback() - reverts.\n\nThe one case it doesn't identify is contracts with a non-reverting fallback() which doesn't return anything.  But if the contract supports ERC-165 (supportsInterface), it could be identified as well.  If it doesn't then indeed it is indistinguishable from EOA, but how common is this problem?",
        "created_at": "2024-09-17T00:22:23.010000+00:00",
        "attachments": []
    },
    {
        "author": "pdobacz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Right, thank you for spelling this out. \"Not an option\" was too strong, ERC-165 just doesn't solve for all edge cases. Also one would need to upgrade ERC-721 to something new, or treat it with some leeway (substituting the code.size \u003e 0 check for the ERC-165 check). \n\n\u003e how common is this problem?\nIf EIP-7761 gains momentum, this will need to be investigated, good point.\n\nThanks for all the answers, I'll distill them into Rationale sections in 7761 at one point.\n\nEDIT: ERC-721 from OpenZeppelin seems to support ERC-165, so it would cover the I guess most common error case of sending something to the token address.",
        "created_at": "2024-09-17T12:48:55.224000+00:00",
        "attachments": []
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "IMO, it's absolutely *not* the case that AA is held back by contracts attempting to discriminate against accounts with code...\n\nthe main obstacle for AA adoption is the assumption that accounts can produce ECDSA signatures, and the lack of adoption of ERC-1271 (and ERC-6492!)\n\nin this sense, i would even say that HASCODE is an _enabler_ for AA, in particular for the migration of EOAs. because it provides a way to override the assumption that an account's ECDSA signatures are legitimate. i.e., a contract can implement the logic that if the account has code then only its ERC-1271 signatures should be considered authentic",
        "created_at": "2024-09-17T14:23:17.757000+00:00",
        "attachments": []
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@727296082484265073\u003e can you provide examples of code in the wild to support the idea that HASCODE will hold AA back?\n\nthe only things i can think of have been NFT drops that try to prevent accounts from claiming more than one token or whatever\n\nwe have been saying that this is a terrible idea for years. extensive notes explaining that this check is gameable have been in openzeppelin's documentation since 2019, and we were explaining it to people even before that\n\nthese people do not care, and if they don't have HASCODE in EOF, they will either:\na) not use EOF\nb) use EOF and implement some other deranged check like requiring an ECDSA signature to prove an account is an EOA\n\nso i really don't think this is a good motivation to block the addition of an opcode with legitimate use cases, which only provides an extremely limited form of code introspection (if it does at all, i would argue it doesn't) that otherwise doesn't seem to conflict with EOF's objectives",
        "created_at": "2024-09-17T14:37:22.871000+00:00",
        "attachments": []
    },
    {
        "author": "frangio_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Right, thank you for spelling this out",
        "created_at": "2024-09-17T14:44:00.692000+00:00",
        "attachments": []
    }
]