[
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I’m was sort of responding to this messages from Vitalik where he is explicitly saying that the road map for accounts on ethereum is 7560 on L1 https://discord.com/channels/595666850260713488/718596092828057631/1210534850612957214\n\nThe issue is i don’t think ACD agrees this is a viable path. So I don’t think it should be used as evidence that “EOA and AA innovations are going down separate tracks”",
        "created_at": "2024-02-25T00:01:37.094000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e Obviously smart contract wallets and true AA is where we’d like to go, but again, it’s not clear that will be a reality on mainnet",
        "created_at": "2024-02-25T00:26:14.139000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "OK this feels incredibly defeatist and I am honestly very disappointed to hear it from you.",
        "created_at": "2024-02-25T00:26:25.762000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The biggest risk that has been worrying me more and more about ethereum for the last few years now is, the risk that people get into the mindset that \"big changes are very hard\", and so not worth doing, and then that alone turns into a self-fulfilling prophecy, and weaknesses of the current protocol get stuck forever, and ten years from now ethereum has to bow its head in shame and say \"yeah, we _sort of_ have basic security features like key rotation, if every single user makes sure to first create their EOAs inside a magic trusted box, and then if they do that they have to add invokers and to actually make transactions they would need to use 4337-like methods anyway and not benefit from in-protocol inclusion lists\"",
        "created_at": "2024-02-25T00:30:32.743000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And so the most important thing is to have a strong collective agreement that a couple of really important changes, that we know are long-term necessary, are actually possible and we are actually doing them.",
        "created_at": "2024-02-25T00:31:41.324000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There's a lot of room to adjust the roadmap in the long term; I actually don't see the difference between 2938 and 7560 as being that large, and if there is a hybrid path there that still ensures the key goal that accounts on L1 can have (i) arbitrary validation code, (ii) be able to batch, (iii) be able to benefit from in-protocol inclusion lists and (iv) support paymasters, then I think we should work together to find that path! I'm not attached to details of 7560 personally",
        "created_at": "2024-02-25T00:33:20.078000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We've succeeded on replacing the entire consensus engine mid-flight, we're succeeding on adding blobs, we have shadow testnets of replacing the ethereum state tree mid-flight (!!!), I think we can afford ourselves some ambition! 😊",
        "created_at": "2024-02-25T00:36:49.582000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Definitely agree with the sentiment, but I think in a way the AA conversation is harder than either the merge or verkle because:\n\n1. Neither of these two affects end users much \n2. Client devs have a better understanding of the tradeoffs of those vs. the subtleties of various AA proposals\n3. POS and Statelessness feel like “must haves” for L1 to survive long term, while you can imagine AA never being live in L1 and “things being fine”. Or, at least, there is far less perceived urgency.\n\nNot saying this to imply solving AA is impossible, but the hard parts are very different from other large protocol changes: it’s a mostly social process, not technical. Closer to changing the issuance curve than The Merge 😛 \n\nGiven that,  I think the most valuable way to spend this week’s call is probably to try and align on what we want long term + what is possible in the next fork, and ideally reduce the number of proposals all client teams need to think through. \n\nIf we could get to, say, 2 with very clear tradeoffs that we’re happy with client teams making a call on, that’d be a great outcome. If we end with 4 different proposals that map to different future roadmaps with low consensus among them, the likely outcome is no AA EIP in Pectra",
        "created_at": "2024-02-25T21:38:05.358000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Agree that would make sense! I would put more emphasis on \"long term vision\" than \"next fork\" (if that gets pushed back to the call after then that's fine), because I feel like long term vision doesn't get talked about enough and being more aligned on that is key to being able to come up with concrete proposals at all stages in the future.",
        "created_at": "2024-02-25T23:53:06.933000+00:00",
        "attachments": null
    }
]