[
    {
        "author": "shifuda",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "regarding 3074, I have some confusion if nonce checking is handled at protocol level (as part of AUTH opcode execution) or it is something delegated to the invoker contract. I was under the impression that it is upto the invoker contract, until I read the section **In-Protocol Revocation** which says \"For this reason, AUTH requires the nonce in the message to be equal to the signer’s current nonce. This way, a single tx from the EOA will cause the nonce to increase, invalidating all outstanding authorizations.\" which only makes sense if AUTH checks the nonce (otherwise malicious invoker contract might bypass the nonce check and there's no revocation).",
        "created_at": "2024-04-25T05:26:33.064000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There are multiple types of replay protection. 3074 does not directly modify the user's nonce, so it's possible to replay the same AUTH sig multiple times for the same account (so long as they don't originate a tx, bumping their nonce). This is useful because it can allow an EOA to delegate control to their account to a more ephemeral hot key. E.g. imagine you want to allow the hot wallet on your phone to spend 50 DAI a day. You can do that with a single AUTH message. The nonce was added to AUTH message to allow users to revoke all outstanding AUTH messages for the current nonce. The thought is maybe you AUTH some insecure invokers in the beginning and there is no way to unAUTH or maybe an invoker you use becomes compromised. As I've stated, I'm against the change.\n\nBeyond this, the invoker still needs replay protection as part of the commit to ensure the internal messages are not replayed. From the phone hot wallet example, although the AUTH has delegated 50 DAI spending allowance to the phone, you still don't want those individual messages replayed.",
        "created_at": "2024-04-25T12:58:07.284000+00:00",
        "attachments": null
    },
    {
        "author": "thogard",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hey - I tried to scroll through to see if this question was answered but didn’t see it addressed recently.\n\nI highlighted the portion that makes me hesitant.  \n\nI’m not convinced that the network impact of invalidating an unminable (queued because tx nonce \u003e account nonce) transaction is equivalent to invalidating a minable transaction (bc 3074).\n\nIn the first situation, the only thing that can make a tx with nonce n+1 invalid is a tx with nonce n from the same account. \n\nIn the second situation, any tx from any account could potentially invalidate another tx from another account. I think this could be particularly problematic during reorgs.",
        "created_at": "2024-04-25T22:14:14.198000+00:00",
        "attachments": [
            {
                "type": "image/jpeg",
                "origin_name": "IMG_1763.png",
                "content": "423cd13c5d15ebc329d161ebe6e0fe487c95cd97d22893e0cdb912721fb81186"
            }
        ]
    },
    {
        "author": "thogard",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Importantly, 3074 dramatically decreases the cost of spam. A bot looking to clog up the p2p stack - a pvp strategy we see often on polygon, solana, and other L2s - could spam txs from multiple EOAs to the same contract and have whichever one lands first invalidate the others by using 3074 to transfer the funds from the other EOAs to the contract. \n\nIt would be very similar to 4337’s  eth_sendRawTransactionConditional, which I opposed for the same reason (you can see my post and a longer explanation of how it could be abused here: https://forum.polygon.technology/t/pip-15-adding-support-for-eip-4337-bundled-transactions/12679/2 )",
        "created_at": "2024-04-25T22:21:06.156000+00:00",
        "attachments": null
    },
    {
        "author": "thogard",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I went through geth and it looks like there are only two times the balance check is done; upon receipt and during actual block construction. An infinite number of txs could potentially be invalidated in flight each time a tx is added to the block.  This seems like it would have the potential to drastically slow down validators not connected to MEV boost.",
        "created_at": "2024-04-25T22:32:13.176000+00:00",
        "attachments": null
    },
    {
        "author": "thogard",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(Especially because most of the invalidated txs from spam bots will have a high gas price)",
        "created_at": "2024-04-25T22:42:53.943000+00:00",
        "attachments": null
    }
]