[
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e For example, consider social recovery.  5806 can't do it.  3074 can semi-do it.  You can have an invoker that transfers your assets, but you can't use it to regain access to the account and rotate the key.  With full AA, you get real social recovery\n\nWhat is “real” social recovery? You can definitely have an invoker which allows you to delegate full control of your EOA account to another signer. That can be gated by the recovery mechanism of your choice. They only difference is you can’t revoke the EOA key. But i think if you’re concerned about stolen keys instead of lost, you should just migrate (or maybe upgrade via 5003)",
        "created_at": "2024-02-19T00:00:28.052000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, you could implement 4337 accounts on top of 3074 and it would even be quite efficient.  https://notes.ethereum.org/@yoav/eip-3074-erc-4337-synergy\nHowever, is that the way you see people using 3074 when they want batching, or will they just use a centralized relay?  Users are like water, they'll take the path of least resistance.  We should make the path of least resistance as safe and decentralized as possible.",
        "created_at": "2024-02-19T01:12:52.787000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "By real social recovery I mean being able to regain access to the account while revoking the lost/stolen key.  A basic feature that any smart contract account can offer, but an EOA can't.  You could make it not-EOA using 5003, but then you're no longer using 3074 or any EOA feature, and you need a separate EOA to use the account (or use something like 4337 to access it).\nSocial recovery minus key revocation, is something we can also do with MPC or even SSS. No need for a consensus change.  But I think key revocation is important.",
        "created_at": "2024-02-19T01:17:44.260000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "However, I think we're deviating from the current discussion.  We're not talking about enshrining 4337 in Prague.  We're talking about enshrining 3074 or 5806.  The point I was trying to make is that 5806 gives users most of the benefits with few of the risks/footguns.  It doesn't give full social recovery but neither does 3074.  Either way we'll still need something like 5003 to migrate accounts in order to do key rotation.",
        "created_at": "2024-02-19T01:21:13.111000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If we implemented 3074 at the ethereum client level, and then some reputable group (maybe even the core devs) designed, tested, built, and deployed a specific invoker that was constrained to just the features of 5806, would that not be functionally the same as just enshrining 5806 at the client layer with the exception that someone in the future could use 3074 to do *additional* things later?",
        "created_at": "2024-02-19T09:49:44.204000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "For the vast majority of users, one could imagine just telling them \"use this specific invoker only, never use any third party invokers\".",
        "created_at": "2024-02-19T09:50:11.540000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And wallets could, similarly, limit invokers to only that one core-dev-authored invoker.",
        "created_at": "2024-02-19T09:50:31.341000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, if we limited it to only an invoker that behaves like 5806, it would be *almost* equivalent to 5806, just more expensive due to having two signatures and a commit in each transaction.",
        "created_at": "2024-02-19T12:34:17.219000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, assuming the protocol or the wallet prevents them from using any other invoker, so they can't be tricked into signing an auth that will come back to bite them.",
        "created_at": "2024-02-19T12:36:14.843000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The problem with doing it at the wallet level is that it'll de-facto limit innovation to the big wallets.  Suppose a popular wallet writes a couple of invokers, and a less popular one writes others.  Which ones will dapp developers make calls to?  Isn't it likely that they'll favor invokers used by the most popular wallet and ignore any other (since other invokers won't be usable by most users)?",
        "created_at": "2024-02-19T12:38:21.245000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "IIUC, the dapps wouldn't have anything to do with the invokers.",
        "created_at": "2024-02-19T13:14:43.477000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Wallet A could use Invoker A and wallet B could use invoker B and the dapp would still just interact like normal without any changes from what they do today.",
        "created_at": "2024-02-19T13:15:05.194000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "For example, when the dapp connects the wallet will return an address.  The provided address may have an invoker approved for it, but the dapp would have no knowledge of this.  When the dapp submits a transaction the wallet *may* choose to not publish the transaction immediately and instead queue it up for batching (for example), or *may* choose to have the gas paid for by some fee payment network rather than the user directly.  The dapp would not be aware of any of this unless they inspected the chain after the transaction was mined.",
        "created_at": "2024-02-19T13:17:12.721000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I thought the primary reason for both 3074 and 5806 is UX improvement.  If the dapp is not aware of it, will it really improve its UX?  The use case that 3074 advocates have been talking about on twitter is batching, e.g. approve+transferFrom.  If the dapp doesn't know that the EOA is capable of batching through an invoker, won't it send two transactions separately, one for approve and then one for transferFrom?  I thought the way it's supposed to work, is that the dapp will be aware of it and send a transaction that uses batching.  And batching is just one example.  Dapps may improve their UX in different ways by being able to run code in the account.  They can only do so if they're aware of the code that can run in the account.  How is it going to work otherwise?",
        "created_at": "2024-02-19T16:19:24.042000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There can (and should) be a method like `wallet_submitBatch` that apps can call against the connected wallet.  This would sign and submit transactions as a bundle/group, using whatever mechanism makes sense for the particular wallet.  If it is a contract wallet that may look different from an EOA which may look different from something else.",
        "created_at": "2024-02-19T16:20:50.612000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Generally speaking, 3074 invokers should **NOT** be added by random dapps.  It is an incredibly trusted operation, on the order of giving away your private key.  Only wallets should be instantiating invokers generally.",
        "created_at": "2024-02-19T16:21:40.845000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I agree that we definitely need a `wallet_submitBatch` that is implementation-agnostic.  But batching is one UX improvement.  Are we going to add an RPC for each new UX improvement when one or more invoker enables it?",
        "created_at": "2024-02-19T16:23:12.826000+00:00",
        "attachments": null
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\"EIP-2938 defines a very mature alternative approach to Account Abstraction. However, it does not translate well to the architecture of ERC-4337 that is being used in production without any protocol changes. Therefore, the implementation of EIP-2938 will not benefit as much from the production experience gained by using ERC-4337 and from maintaining backward compatibility with it.\"\nI am definitely not as educated on this entire subject as others here but, philosophically, this seems like incorrect thinking.",
        "created_at": "2024-02-19T16:24:07.463000+00:00",
        "attachments": null
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If we're gonna enshrine AA in the protocol, make it as optimal as it can be without regards to some ERC consensus (4337) that very few used.",
        "created_at": "2024-02-19T16:25:29.608000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, that's a part of my concern.  It's a pretty massive footgun so I wonder if we can't get most of the benefits without something that powerful.  And if the way to mitigate it is for wallet devs to whitelist their invokers, I think it's going to limit some use cases since we're not goint to add an RPC for every new functionality.",
        "created_at": "2024-02-19T16:25:54.095000+00:00",
        "attachments": null
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Seems like redesigning the foundation of a huge construction project just because you slept in a tent on the construction site a few times.",
        "created_at": "2024-02-19T16:25:56.156000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We *definitely* shouldn't be exposing invoker additions to dapps.  It is nearly like giving dapps private keys.",
        "created_at": "2024-02-19T16:27:20.861000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "3074 gives *wallets* the ability to give enhanced features to their users.  Some of these things may require new JSON-RPC methods that dapps can use to communicate additional information to wallets (like `wallet_batchSubmit`), and some enhancements will be entirely transparent to the dapp layer.",
        "created_at": "2024-02-19T16:28:39.658000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "3074 is just a foundational enabling technology, and the idea is to leave it to the wallet layer to figure out how best to deploy and leverage that technology.",
        "created_at": "2024-02-19T16:29:01.101000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Even if we went with 5806, there would still need to be a mechanism for dapps to communicate the desire to batch to the wallet.  In that case, it would require a whole new transaction type which requires even more broad support to function correctly.",
        "created_at": "2024-02-19T16:30:09.373000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "1. By \"very few\" you refer to the ~3M deployed accounts and ~11M transactions?  I think it's a pretty good indication that we're in the right direction.\n2. EIP-2938 was great but its validation restrictions were far harder to deal with, than 4337.  E.g. no access to 3rd party storage.  Therefore building a 4337 account is easier than 2938.\n3. There were network-level DoS vectors not mitigated by it, which are mitigated by 4337 and 7560.\n4. Not sure about the relevance of this comparison right now, since we're not talking about enshrining either 2938 or 7560 at the moment.  The discussion is about adding capabilities to EOA via 3074 or 5806.",
        "created_at": "2024-02-19T16:32:09.563000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Aside from batching (for which 5806 offers better UX), what other UX improvements do you see 3074 bringing to dapps?",
        "created_at": "2024-02-19T16:34:49.139000+00:00",
        "attachments": null
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My point is simply \"go big or go home\". Whatever is chosen if anything should solve the problem thoroughly, elegantly and finally. Half-measures just create more tech debt down the road. I'm not in a position to advocate for/against any one solution over any other. Just making a philosophical point counter to the principle of least astonishment.\nAnyway, I'll hush now.",
        "created_at": "2024-02-19T16:36:37.010000+00:00",
        "attachments": null
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "BTW, what's the EIP that proposed smart contract drop-ins for every EOA? The wholesale conversion to smart contracts only?",
        "created_at": "2024-02-19T16:37:58.955000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Recovery from loss is a pretty big one.",
        "created_at": "2024-02-19T16:38:52.026000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Until recently I was of the same opinion - that we need to have one solution for everything.  But seeing the growing demand for EOA batching, and the need to eliminate the unsafe use of ERC-20 approvals, convinced me that we may need an intermediate solution for EOAs until we have full AA.  Would it make sense to shelve it for now until we figure out full AA?",
        "created_at": "2024-02-19T16:39:04.864000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\"Spenders\" is another.  This is something that wallets may expose to dapps with something like `wallet_requestSpendingOf(token, amount)`.  This would give a particular contract the ability to \"spend freely\" within some well defined constraints, without having to give up your private key.",
        "created_at": "2024-02-19T16:40:22.647000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You mean \"assumed code\"?  We've been discussing it but I don't think we have an EIP for it yet.  There are EIPs for adding code to the account, e.g. 5003, or SETCODE. or EIP-7377 migration transaction",
        "created_at": "2024-02-19T16:40:49.200000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Very similar to approve, but with programmable constraints applied by the wallet.  An invoker, for example, may give contracts a way to spend that is constrained by time, or require sign-off by an independent (but automated) third party.",
        "created_at": "2024-02-19T16:41:40.637000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I pretty much agree with everything Micah is saying here. And yes I think we will need new RPCs for any wallet functions we expect dapps to interact with for exactly the reason we don’t want to enshrine an invoker vs smart contract wallet, etc",
        "created_at": "2024-02-19T16:42:17.728000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "but we can't do full account recovery with 3074.  We can regain access in order to move the assets if the key is lost, but we can't revoke a stolen key.  Wouldn't it be better to have a complete solution, such as using keystores?",
        "created_at": "2024-02-19T16:42:19.490000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If your key is stolen, you should already consider your funds gone. If you have time to transition the key, you have time to migrate the assets. Migration is worse in UX terms, sure, but it’s a weird line to draw in the sand “3074 can’t do full account recovery”",
        "created_at": "2024-02-19T16:43:35.390000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Couldn't we implement that with approvals, for anything except native eth?",
        "created_at": "2024-02-19T16:44:23.369000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You are correct, AA is superior but may never come.  3074 is about as close as we can get to AA without *actually* solving the problem of AA.",
        "created_at": "2024-02-19T16:44:30.168000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If 3074 really adds a lot of use cases, will we have an explosion of new `wallet_` RPCs to support all of them in a non-invoker-specific way?",
        "created_at": "2024-02-19T16:45:30.326000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The idea is that the wallet (something you trust much more than a dapp) would apply the constraints.  I you trust the dapp, then approve-all works fine today.",
        "created_at": "2024-02-19T16:45:34.690000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "we should already have this for smart contract wallets",
        "created_at": "2024-02-19T16:45:46.104000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it’s really unrelated to 3074",
        "created_at": "2024-02-19T16:46:01.706000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There are some hypothetical things that will require new `wallet_*` methods to be useful.  Others can be entirely wallet side.",
        "created_at": "2024-02-19T16:46:06.272000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "exactly, eg social recovery probably has direct wallet integration so no need for standard rpc",
        "created_at": "2024-02-19T16:46:34.689000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As lightclient said though, many of these are necessary regardless of *how* we achieve them.  `wallet_batchSubmit` is a method that should be standardized today, even without 3074 or 5806.",
        "created_at": "2024-02-19T16:47:30.140000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(you can do batch submissions via builder relays already, but dapps don't have a way of communicating such desire to the wallet at the moment)",
        "created_at": "2024-02-19T16:48:08.214000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, your *current* funds are gone if not locked somewhere.  But once you rotate the key, the account is safe again.  Sometimes you can't change the address because you're locked into some protocol.  E.g. the withdrawal address of your validators.  If your withdrawal account's key was stolen, no funds are stolen yet because the validators are still active.  But as soon as they exit, your funds are gone.  Whereas if you could rotate the key, you'd be safe.  How do you see 3074 solving that?",
        "created_at": "2024-02-19T16:48:14.701000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It doesn't.  But neither do contract wallets.",
        "created_at": "2024-02-19T16:48:50.439000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "5003",
        "created_at": "2024-02-19T16:48:52.023000+00:00",
        "attachments": null
    },
    {
        "author": "fivedogit",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Are you saying you think true AA is technically unsolvable or unsolvable due to tech debt, expectations, social reasons?",
        "created_at": "2024-02-19T16:48:55.839000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Unless your contract wallet has a mechanism for hostile takeover of the account from the primary signer.",
        "created_at": "2024-02-19T16:49:11.315000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "A bit of all of the above.  It has been a while, but IIRC account abstraction requires address space extension, which is *incredibly* hard to do on a live chain like Ethereum.",
        "created_at": "2024-02-19T16:49:52.179000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(I may be misremembering though)",
        "created_at": "2024-02-19T16:49:56.993000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "if you’re using 3074 you should bury your hardware wallet with the pk in the backyard and use a delegated signer day to day",
        "created_at": "2024-02-19T16:50:00.091000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I meant the specific \"spender\" use case you described.  If you authorize a contract to spend up to a certain amount based on its logic, does it matter if it's done through an AUTH or through an approval?  Either way it'll only spend your funds according to its logic",
        "created_at": "2024-02-19T16:50:00.403000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My wallet (whom I trust) would provide protections that the dapp (whom I don't trust) may not provide.",
        "created_at": "2024-02-19T16:50:27.283000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "e.g., \"Allow this contract to spend my USDC for the next hour\".  If the contract in question is upgradable behind a timelock, my wallet protects me from upgrades robbing me.",
        "created_at": "2024-02-19T16:50:58.398000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(just as an example)",
        "created_at": "2024-02-19T16:51:48.886000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Not necessarily.  Different dapps may bring their own code to improve their UX.  For example, an ERC-6900 account could let dapps add plugins with very limited permission (e.g. interact only with the dapp's contract).  No need for an RPC because the dapp knows the plugin is installed in the user's account.",
        "created_at": "2024-02-19T16:52:00.582000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If you do this, you’re enshrining integration with a specific wallet. The wallet endpoints should be standardized so any wallet which understand the feature can benefit from the integration",
        "created_at": "2024-02-19T16:53:20.763000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Agreed, social recovery is completely in the wallet and has nothing to do with dapps.  I'm just not sure how to implement it with 3074.  E.g. replace my stolen keys before exiting my validator.",
        "created_at": "2024-02-19T16:53:22.678000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Why not?  Sure they do.  Suppose your withdrawal account is a Gnosis Safe.  What stops you from replacing your signer before exiting your validator?",
        "created_at": "2024-02-19T16:55:06.434000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "3074 isn’t better on every axis than smart contract wallets, we all agree on this. You’re focusing a lot on this point, but the fact is that key loss in a benign manner is still common and 3074 makes EOAs much better",
        "created_at": "2024-02-19T16:55:11.757000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "which stops being an EOA and using 3074 altogether, just switching to a smart account.",
        "created_at": "2024-02-19T16:55:36.639000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That's what social recovery is for.  Your social group helps you revoke your old key and add a new one, before exiting your validator.  Your funds remain safe.",
        "created_at": "2024-02-19T16:56:32.104000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "this is ultimately what we want people to be able to do",
        "created_at": "2024-02-19T16:56:51.038000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Why would it require address space extension?",
        "created_at": "2024-02-19T16:57:03.175000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It depends on how you have your SAFE setup I suppose.  If you have it so the owner cannot change social recovery options, then you could recover the address.  As I said above though, I agree that contract accounts are superior.",
        "created_at": "2024-02-19T16:57:14.982000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Unfortunately I don't remember, and I may be misremembering.",
        "created_at": "2024-02-19T16:57:24.889000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don’t think AA requires ASE",
        "created_at": "2024-02-19T16:57:31.864000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Who signs the EOA transaction then?  Always a relay?",
        "created_at": "2024-02-19T16:57:43.637000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It has been a long time since I looked into AA, but when I did I remember it being not as trivial of a problem as people like to think.",
        "created_at": "2024-02-19T16:57:44.584000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You sign it with your own key you delegated to?",
        "created_at": "2024-02-19T16:58:04.930000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "just like you do with smart contract wallets and delegating different signers with different access controls",
        "created_at": "2024-02-19T16:58:23.422000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it isn’t different",
        "created_at": "2024-02-19T16:58:26.627000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If you *lose* your private key and it has an invoker setup, then the invoker can interact as that address via whatever mechanism you configured.",
        "created_at": "2024-02-19T16:58:49.773000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I didn't mean that the dapp does this.  Think about it like an invoker, except that it doesn't use 3074 but an approval.  You approve this immutable contract and it handles this for you, just like an invoker would.",
        "created_at": "2024-02-19T16:59:15.530000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Stolen private key is not a problem that 3074 solves.  You need contract wallets for that.",
        "created_at": "2024-02-19T16:59:22.417000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It has to do with whom you trust.  Ideally, we want users to trust their wallet, but *not* have to trust the dapp they are interacting with.",
        "created_at": "2024-02-19T17:00:00.352000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ideally, you can browse the web like today with Firefox or Brave and be confident that no website you go to can screw you because your browser is protecting you.  We want wallets to be similar, where they are protecting you from malicious apps so you can browse freely without fear of losing all of your assets.",
        "created_at": "2024-02-19T17:00:49.773000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Which specific wallet?  Any wallet that supports ERC-6900 would let you add the plugin, and then the dapp just calls the method added by the plugin.  It doesn't enshrine integration with anything other than the ERC itself.",
        "created_at": "2024-02-19T17:00:50.674000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "then it’s just an interface and 3074 can also support 6900",
        "created_at": "2024-02-19T17:01:56.278000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Both 3074 and 5806 make the EOA better without making it as good as a smart account.  That's fine.  I'm just saying that the use cases that 3074 supports and 5806 doesn't, seem incomplete (e.g. social recovery).",
        "created_at": "2024-02-19T17:02:41.680000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i disagree, but that’s okay",
        "created_at": "2024-02-19T17:03:25.148000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "While I also want every EOA user to switch to a smart account, I don't think converting an EOA is the optimal approach.  It has unmitigated risks: https://notes.ethereum.org/@yoav/erc-4337-vs-eip-3074-false-dichotomy#Caveat-EOA-migration-considered-harmful",
        "created_at": "2024-02-19T17:03:58.451000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I definitely agree on that, after working on AA full time for over 3 years 😉",
        "created_at": "2024-02-19T17:05:14.929000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "but ultimately someone has to send a transaction and pay for the gas.  If you bury your HW wallet in your back yard and only sign with a key known to the invoker, someone has to sign the transaction itself with a funded EOA.  If it's not you, then it's somebody else.\nAll smart contract wallets have the same problem.  That's part of what 4337 solves.",
        "created_at": "2024-02-19T17:07:23.970000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Right.  It just can't revoke the old key.  But I guess we discussed this use case enough 🙂",
        "created_at": "2024-02-19T17:08:59.927000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "3074 is not trying to solve this. You have done a lot of great work to sovle this problem and there is no reason for 3074 users to not use your technique for decentralized op inclusion.",
        "created_at": "2024-02-19T17:10:24.321000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I agree.  The contract is *not* the dapp.  It's an invoker.  Just not necessarily a 3074 invoker.  An invoker that uses an approval to spend your funds according to certain logic.  It's exactly like a 3074 invoker",
        "created_at": "2024-02-19T17:10:52.307000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, 6900 uses 4337 and we already agreed that 4337 could use 3074.  But you couldn't use something like 6900 plugins directly since it's a like delegatecall - no way to limit what the plugin can do.  In ERC-6900 there's no delegatecall.  The account has callbacks protected by permissions.  Harder to do with 3074",
        "created_at": "2024-02-19T17:12:53.407000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "why is it harder with 3074?",
        "created_at": "2024-02-19T17:13:31.146000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Except it cannot interact with other apps on your behalf.  If it actually holds your assets, then it is just a contract wallet (which is great and more people should use them).",
        "created_at": "2024-02-19T17:13:59.849000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That's fine.  I'm just trying to see the list of benefits that 3074 brings and 5806 doesn't, to better understand if it's worth the extra risk.  If we can get 80% of the benefit without the added risk, are the additional 20% worth it?",
        "created_at": "2024-02-19T17:14:25.540000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i dont think solo tx batch is 80% of the value",
        "created_at": "2024-02-19T17:15:22.295000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You can't just write invokers that operate as these plugins.  You'd need an invoker that is actually the ERC-6900 account, which calls plugins.  It's possible, but it just means running 4337+6900 on top of 3074.  That's a fine use case for 3074.",
        "created_at": "2024-02-19T17:16:24.843000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "5806 is not solo tx batch.  It's a delegatecall.  It just runs once rather than forever.",
        "created_at": "2024-02-19T17:17:44.833000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it is solo in the sense that you cannot batch with many other users",
        "created_at": "2024-02-19T17:18:09.420000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "why can you not write an invoker which operates the plugin? because it relies on 4337?",
        "created_at": "2024-02-19T17:18:32.130000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Right.  It preserves the principle of one call == one user",
        "created_at": "2024-02-19T17:19:05.003000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "we already have invalidated that principle with 4337",
        "created_at": "2024-02-19T17:19:39.250000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I didn't say you can't write an invoker that acts as your account and operates the plugins.  I wrote that the invoker itself can't be the plugin, so you need the extra layer that acts as your OS.",
        "created_at": "2024-02-19T17:20:00.505000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We invalidated the principle of one-tx == one-user.  We didn't invalidate one-call == one-user.  But anyway I agree with you that any use case requiring calls from multiple users is not supported by 5806 and can be supported by 3074.  That's the category I mean with the 20%.",
        "created_at": "2024-02-19T17:21:37.102000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "how does 3074 invalidate one-call == one-user but 4337 doesn't?",
        "created_at": "2024-02-19T17:22:43.088000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yeah i agree with that, but i don't see the point of the distinction. how is it \"harder\" like you claim?",
        "created_at": "2024-02-19T17:25:00.232000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The call comes from the user's account.  Someone else's call can't come from the user's account.  With 3074 the invoker can make calls on behalf of multiple users.  That's a feature, not a bug, and it enables some cool use cases.  But also comes with a set of caveats.",
        "created_at": "2024-02-19T17:25:05.619000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "the call doesn't \"come from\" the invoker, the CALLER is explicitly set as the EOA",
        "created_at": "2024-02-19T17:25:50.977000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It's harder in the sense that you can't do it with just 3074, allowing dapps to install their own limited-permission plugins to improve their UX.  You can do it with ERC-6900, whether you do it with or without 3074.",
        "created_at": "2024-02-19T17:26:12.423000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I mean that the logic is the invoker's.  The same invoker can make multiple calls, switching to a different EOA each time.  Which, as I said, is actually a feature.",
        "created_at": "2024-02-19T17:27:06.941000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "why is that different from many people delegate calling the same wallet code?",
        "created_at": "2024-02-19T17:27:27.120000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "basically i don't see point of the distiction you're making of one-call == one-user",
        "created_at": "2024-02-19T17:28:01.859000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It just happens in the same call.  But what are you trying to point out here?  I already agreed that this is one family of use cases that 3074 can do and 5806 can't.",
        "created_at": "2024-02-19T17:28:37.107000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You are making claims like \"it is harder to do 6900 with 3074\" and \"3074 invalidates this principle X\". Your voice has a lot of credibility and when you make statements like this people accept them, because you are very smart and have done a lot of good work in the space of account abstraction. But these statements paint 3074 in a bad light without reason. Specifically here, I am asking why are you making this statement \"3074 invalidates the principle of one-call == one-user\". \n\nAs I've stated, from the EVM perspective it is not possible to be aware of this. Yes, it does allow a single contract to make multiple calls as different apparent users. But what is the cost of adding this behavior? When you say something breaks a principle, it implies the principle is there for a reason. I would like to know what you feel the reason is. I personally don't see a technical concern with allowing a contract to invoke other accounts. Maybe you have concerns with the replayability it provides, but I think we can both agree that if the contract behaved like 5806 it would not be an issue.",
        "created_at": "2024-02-19T17:34:54.638000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e you making this statement \"3074 invalidates the principle of one-call == one-user\".\n\nFollow that part of the thread, see the context.  I did not say it as a downside but as a plus of 3074 compared to 5806.  You pointed out that 5806 is solo in that sense, and I acknowledged that it preserves this principle from regular transactions, which 3074 does not - and that's a strength of 3074 compared to 5806.  Here:\n\nYoav: 5806 is not solo tx batch.  It's a delegatecall.  It just runs once rather than forever.\n\nMatt: it is solo in the sense that you cannot batch with many other users\n\nYoav: Right.  It preserves the principle of one call == one user\n\nMatt: we already have invalidated that principle with 4337\n\n...\n\nYoav: It just happens in the same call.  But what are you trying to point out here?  I already agreed that this is one family of use cases that 3074 can do and 5806 can't.\n\n\u003e But these statements paint 3074 in a bad light without reason\n\nThis statement was actually painting 3074 in a better light - see above.  I acknowledged that this is one class of 3074 use cases that we wouldn't be able to get with 5806 because it presernves the same principle as current transactions.  I don't see it as justifying the extra risk, but this statement was actually pro-3074.",
        "created_at": "2024-02-19T17:44:12.994000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "TL;DR: you explained what you meant by \"solo\" and I agreed that this is a 5806 limitation",
        "created_at": "2024-02-19T17:44:51.181000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Okay I misunderstood then. The connotation I associate with \"preserve\" is that it is an attribute which should be protected",
        "created_at": "2024-02-19T17:45:52.295000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Maybe \"preserve\" is not the right word if it has that connotation.  English is not my first language so I may be missing some nuance here.",
        "created_at": "2024-02-19T17:46:44.293000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "sure, text communication is very lossy",
        "created_at": "2024-02-19T17:47:01.198000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Equally I'd say that EOA preserves the principle of one ECDSA key == one user, but that's not a good thing.  Hence we want AA.  So maybe I should use a different word for it.",
        "created_at": "2024-02-19T17:47:27.444000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Maybe \"perpetuates\" 🙂",
        "created_at": "2024-02-19T17:48:12.622000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yeah i think that communicates it more clearly as a negative attribute",
        "created_at": "2024-02-19T17:48:48.835000+00:00",
        "attachments": null
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If I understand correctly, the three options on the table are:\n1. Enshrine EIP-3074\n2. Enshrine EIP-5806\n3. Do nothing for now.\n\nThere's strong user demand to do *something* (primarily batching, from what I heard from users and devs), so a comparison may help us pick between 1 and 2, to avoid the default 3.\n\nSince we're comparing 3074 and 5806 here and would like to enshrine one of them rather than waiting for full AA, I think it'll be useful to look at their pros and cons.\n\nI wrote some points about the pros of 5806 above, e.g. the principle of least astonishment, cheaper batching, less risk and no lasting effect on the account.  The pros of 3074 would be use cases that 5806 can't support, such as combining calls from multiple users or recovering from a lost (but not stolen) key.\n\nA list of such use cases and how 3074 supports them, would make the comparison more concrete.  It'll be easier for ACD to weigh the pros and cons when looking at a list and assessing how much user demand we have for them, and whether 3074 is the right way to provide them.\n\nFor the sake of this comparison, let's avoid features that require a smart account and cannot be supported by neither 3074 nor 5806, and stick to ones that one EIP has and the other doesn't.",
        "created_at": "2024-02-19T18:33:53.573000+00:00",
        "attachments": null
    }
]