[
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "7562 is an ERC that protects the mempool (for both 4337 and 7560). It is not a part of the consensus.  Only validation/execution separation is mandatory.  You can implement a 7560 account that is not compatible with 7562 and blocks can still include its transactions.  The builder just needs to figure out a different way to protect itself against DoS in that case.  We shouldn't enshrine the 7562 rules, and if someone comes up with a different set of rules that also enables a DoS resistant mempool, this new mempool can use 7560 transactions and live alongside the 7562 based mempool.  But of course nodes that want to participate in the 7562 based mempool do need to implement the rules.\n\nIn fact I'm pretty sure we'll see 7560 accounts that don't conform to 7562, as part of intent systems.  Intent validation is hard to do within the rules.  7560 is meant to serve such use cases as well.",
        "created_at": "2024-03-01T06:28:33.159000+00:00",
        "attachments": []
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Unless we are going to have a small short list of how a transaction is going to be initiated (right now it is just ECDSA checks against 4 tx types) we will need to have \"on-chain\" authorization, where the auth is encoded in EVM or some similar VM code.  I see the market asking for more kinds of auth types faster than the core devs are able to ship within our current forking mechanism.  7560 is directionally correct in that regard.  Clients can always provide equivalent code in their client's language to do well known and frequently used auths.",
        "created_at": "2024-03-01T16:07:33.483000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah that makes sense. The main thing is there needs to be a super minimal mempool spec for all core clients to implement which supports the basic functions a censored account needs (otherwise will be hard to fill the IL)",
        "created_at": "2024-03-01T16:36:52.429000+00:00",
        "attachments": []
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Right. That's the core focus of 7560 (and 4337).  Abstracting transaction validation (without introducing DoS vectors, which turned out to be a deep rabbit hole that we spent 3 years exploring).",
        "created_at": "2024-03-01T17:18:22.349000+00:00",
        "attachments": []
    },
    {
        "author": "yoavw",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes.  IL with AA is still an unsolved problem.  We can't just add IL and say we're done.  Combining AA+IL introduces more DoS vectors that we'll need to address.  AA validation cost is higher by definition, and IL filling is currently altruistic.  Low power nodes have no incentive to increase their capacity to handle the extra load of IL+AA.  We have a lot to figure out around that.",
        "created_at": "2024-03-01T17:22:49.881000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "updated 3074 with \"auth valid iff nonce matches account's current nonce\"",
        "created_at": "2024-03-01T17:41:46.473000+00:00",
        "attachments": []
    }
]