[
    {
        "author": "yorickdowne",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Probably fits best here.\n\nI chatted with the Nethermind team during Devcon, re timeline for pre merge history expiry. 6-10 months was floated.\n\nI have looked at my Besu node, and while that's not very scientific, this is the disk size growth (state and history both) I see there: Roughly 8.8 GiB a week.\n\nAt its current size (this is a \"generous\" 1.9TB Samsung DC drive), I'd be down to 100 GiB free (\"operator gets nervous\" levels) in July 2025. Latest August 2025. A 2TB drive (not as generous) may add 30 GiB, so maybe another 3.5 weeks. Same general timeline.\n\nGeth is very similar.\n\nThat means 6-10 months for history expiry is cutting it close. At 10 months we're in September and most home stakers will likely have upgraded. 6 months gets us into May; that would be cutting it close but still in time.\n\nNethermind uses less space to begin with though, so if I'm assuming the same general growth on a freshly pruned DB, a Nethermind node may have 9 months before it has no gap between pruning runs (assuming auto prune runs at 350 GiB free), and more if Path lands by then.\n\nIf we want to enable home stakers to choose any client combo and have them fit into 2TB drives, then history expiry by May 2025 would be amazing.",
        "created_at": "2024-11-14T06:15:02.982000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e At its current size (this is a \"generous\" 1.9TB Samsung DC drive), I'd be down to 100 GiB free (\"operator gets nervous\" levels) in July 2025. Latest August 2025. A 2TB drive (not as generous) may add 30 GiB, so maybe another 3.5 weeks. Same general timeline.\n\nDoes this \"operator\" use the host for anything other than a single Ethereum client?  100GiB is all that is left for OS and all other software?",
        "created_at": "2024-11-14T06:42:08.606000+00:00",
        "attachments": []
    },
    {
        "author": "yorickdowne",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That’s from a running node, so it’d be an Ethereum node with OS etc, 100 GiB free after CL, EL, host OS, \u0026c.\n\nHence “unscientific” … I just looked at one of my Ethereum full nodes",
        "created_at": "2024-11-14T09:45:34.777000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Not a multipurpose host though, just OS + Ethereum clients plus a bit of overhead for infrastructure (docker or whatever other tools you are using).  Definitely not a \"personal (multi-purpose) computer\" at that point.  😄",
        "created_at": "2024-11-14T10:05:06.288000+00:00",
        "attachments": []
    },
    {
        "author": "yorickdowne",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Absolutely, dedicated to just being an Ethereum node",
        "created_at": "2024-11-14T10:32:15.997000+00:00",
        "attachments": []
    }
]