[
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Might help if you were to distinguish which statements are being made as \"you\" the individual and what things are meant to represent the Erigon team's views. I have generally been assuming you are speaking for Erigon....",
        "created_at": "2024-12-13T15:11:00.469000+00:00",
        "attachments": []
    },
    {
        "author": "funnygiulio",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "me",
        "created_at": "2024-12-13T16:02:04.299000+00:00",
        "attachments": []
    },
    {
        "author": "funnygiulio",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "this is a \"me\" thing",
        "created_at": "2024-12-13T16:02:30.183000+00:00",
        "attachments": []
    },
    {
        "author": "funnygiulio",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "this is 80% what erigon will do",
        "created_at": "2024-12-13T16:02:51.244000+00:00",
        "attachments": []
    },
    {
        "author": "funnygiulio",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "not finalized yet cc \u003c@364458974906548225\u003e - I like your suggestion because it (at least) helps us doing the necessary dev work and testing it",
        "created_at": "2024-12-13T16:02:57.390000+00:00",
        "attachments": []
    },
    {
        "author": "funnygiulio",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "btw - I feel the context here is a bit different - If you remember I said this same thing in Bangkok during our discussion (specific to 4444s) aka. that the best way to push it is let people do it. I have re-read the chat and have realised that it might be linked to my previous statement. I thought it was a question on its own 😅 (and still not sure if it is not) so I just gave the same answer of back then",
        "created_at": "2024-12-13T16:15:21.226000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think answering a few of these questions about specifics is the path to \"letting people do it\" and I'm in full agreement, that letting clients move forward is the fastest path to getting 4444s activated. I think having relatively clear answers on the protocol specifics is the thing that unblocks clients from moving forward. Things like whether the \"eth\" protocol number is being bumped (i think it should be) and like whether 7801 is gonna be fully isolated (looks like it will be). And last one here is the activation criteria for this stuff moving from experimental to on-by-default... which i still need opinions on.",
        "created_at": "2024-12-13T17:53:53.028000+00:00",
        "attachments": []
    },
    {
        "author": "funnygiulio",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "will just leave mine (not erigon's): may 1st +/- 2 weeks you can drop it and that is the only condition. I think if it is fine if some clients do not want to have a way to keep history",
        "created_at": "2024-12-13T18:25:10.555000+00:00",
        "attachments": []
    }
]