[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Storing your own data is exactly what makes it decentralized.  If you want it, you have the ability to store it yourself however you want or outsource to whatever third party you want.  There is no entity or group that is compelled to store your data for you.",
        "created_at": "2024-02-16T02:56:50.736000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That being said, I do think there is value in a P2P data marketplace.  I just don't agree with your reasoning presented here.",
        "created_at": "2024-02-16T02:57:23.905000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Transaction/receipt history encoded in a ZKProvable way would be rad.  That way you could ask anyone for a bit of history and validate it is authentic.  This would allow anyone to be a data provider and accept payment for history on a P2P data marketplace without needing to build trusted relationships.",
        "created_at": "2024-02-16T02:59:00.377000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Have you heard of the Portal Network? Portal has a sub-network being built which will store all Ethereum mainnet history. All of the data will be validatable. Validating pre-merge blocks (the first 15,537,392 blocks) only requires the light client to store a 60.7 kB list of merkle roots.\n\nThe lightclients don't rely on full nodes for data instead each node stores the data closest to them. Light clients opt into how much storage they want to contribute to the network.",
        "created_at": "2024-02-16T03:25:11.594000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The Portal Network is a project with the initial goal of bringing a distributed Execution layer light clients into reality.",
        "created_at": "2024-02-16T03:27:50.020000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In short the Portal Network's is a collection of p2p networks with the goal of making an execution layer light client. Another way to phase it is  `Globally Available Highly Accessible Massively Cooperative Archive Node`. An execution layer archival node, not a consensus layer archival node at least yet",
        "created_at": "2024-02-16T03:31:03.583000+00:00",
        "attachments": []
    },
    {
        "author": "peersky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Im advocating for user experience as well. One of features why people need DLT is to have record available on a decentralized database, hence why storing own data is essential, it’s also essential to have someone else store it too.\nAlso from same ux standpoint it’s obvious that developer life should not become more complex because our need to query somehow in a different manner. From this I conclude that dApp developer ux would mostly benefit if such data availability is solved by having right rpc endpoint.\n\nCombining these together I conclude that if such history would ever become a thing, there will be rpc providers billing old data differently and abstracting client should from any burden this might create. This will create market and which are going to define end users costs to run history heavy apps on Ethereum, in a similar way as gas defines usage costs.\nIn fact it’s already the case.\n\nIn my view the solution lies in ability nodes negotiate data exchange conditions and payments in an automated manner.\n\nOnce done its already  each nodes individual thing to select and negotiate with its users which blocks, transactions etc it keeps.\n\n\nSimplest retention conditions would be then something like “deleting all data that didn’t generate profit margin X for past N month”\n\nWhile ZKPs are valuable and indeed can create additional trust in such processes.",
        "created_at": "2024-02-16T22:34:43.032000+00:00",
        "attachments": []
    },
    {
        "author": "peersky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I haven’t heard of this, it sounds very interesting, id like to learn more.\nIt sounds somewhat similar to swarm, is it?",
        "created_at": "2024-02-16T22:41:03.948000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What is swarm?",
        "created_at": "2024-02-16T22:41:28.820000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Here are some places to learn more\nPortal FAQ: \u003chttps://notes.ethereum.org/@Kolby-ML/HJ-9D5aYp\u003e\nPortal Website: \u003chttps://www.ethportal.net/\u003e\nPortal Blog: \u003chttps://blog.ethportal.net/\u003e",
        "created_at": "2024-02-16T22:43:00.296000+00:00",
        "attachments": []
    },
    {
        "author": "peersky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Its decentralized storage which also uses “nearest” node definitions to cluster  stored data, they also link data retention to payment processing trough Ethereum",
        "created_at": "2024-02-16T22:43:20.608000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Portal is not a generic storage network like IPFS (and I am assuming swarm?) Portal, IPFS, swarm all appear to use DHT tech but designed for different applications.\n\nPortal is meant to store Ethereum mainnet data and only that. So we aren't a generic storage solution. We also are unique in that we take a validation first approach in our network (meaning everything being stored should be validatable that it is from the ethereum mainnet). Because of our constraints on what can be stored this gives us some advantages compared to just trying to store all of ethereum on IPFS.",
        "created_at": "2024-02-16T22:47:05.998000+00:00",
        "attachments": []
    },
    {
        "author": "peersky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Do under portal network you also review the financial/incentives for data retention?  That’s another big thing beyond the validity proofs imo",
        "created_at": "2024-02-16T22:53:01.356000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003chttps://notes.ethereum.org/@Kolby-ML/HJ-9D5aYp#Do-you-assume-nodes-will-store-the-data-altruistically\u003e",
        "created_at": "2024-02-16T22:54:42.923000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If you had the option to share 1GB or less of storage or pay money what would most people choose?",
        "created_at": "2024-02-16T22:56:00.961000+00:00",
        "attachments": []
    },
    {
        "author": "peersky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ofc sharing, but only if there is push to “pay otherwise”",
        "created_at": "2024-02-16T22:57:31.888000+00:00",
        "attachments": []
    },
    {
        "author": "peersky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "the correct answer is obviously depends cost A vs B",
        "created_at": "2024-02-16T22:59:04.806000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If we look at the world wide web. We can see the majority of users refuse to even want to pay for things. We already give websites storage in the terms of our browsers cache. If Portal can run in the background while using minimal(non noticeable computer resources) while only using 1GB of storage or less I doubt most people would even think about paying",
        "created_at": "2024-02-16T23:02:57.916000+00:00",
        "attachments": []
    },
    {
        "author": "peersky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think in more formal manners. There is some kind of market established. Chips cost money, traffic costs, intrinsic value of Ethereum block data adds to this.\n\nIf you tell someone paying vs supplying memory, I think it can be expanded in to “earning or paying”. Then If you tell that supply of your gigabytes brings profits - there will be a line of those willing to supply",
        "created_at": "2024-02-16T23:08:35.416000+00:00",
        "attachments": []
    },
    {
        "author": "peersky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I might need a week to go trough portal documentation and posts though to catch up before I can properly discuss it 🙂",
        "created_at": "2024-02-16T23:12:08.567000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think I will write a blog post on why we choose to have no financial incentives and the advantages that entails for us.",
        "created_at": "2024-02-16T23:19:41.903000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As this is a problem asked by many and we should have something refined we can refer to instead of just going over higher level points when the topic comes up.",
        "created_at": "2024-02-16T23:23:32.728000+00:00",
        "attachments": []
    }
]