[
    {
        "author": "nick.ghita",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Tbh, I'm ok with moving ahead with the un-finalized version. If it changes, then we can implement those changes if that happens. For right now, the priority is getting the data into the portal network, and this seems like the best path",
        "created_at": "2024-01-25T15:14:17.597000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "if reth and erigon don't value support for it, that's fine - for era, most people won't ever actually interact with the data. we really only need a handful of ppl generating / verify the era files. otherwise serving is simple and doesn't require verification",
        "created_at": "2024-01-25T15:37:26.809000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "another reason i guess why checksum of data would be helpful - ppl could verify integrity w/o processing the receipts",
        "created_at": "2024-01-25T15:38:04.221000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Can you point me towards an example?  Our receipts are more or less served by upstream geth so I'd be surprised if we have a bug not affecting upstream as well.",
        "created_at": "2024-01-25T17:26:15.984000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I could be wrong I will double check today",
        "created_at": "2024-01-25T17:27:39.970000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks!  The receipts are obviously missing the `status` field but I just spot checked some and don't see any obvious issues, but I'm also wasn't involved w/ Ethereum back then so don't know 100% what I'd be looking for 🙂",
        "created_at": "2024-01-25T17:29:42.340000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Regardless, this does make a strong case for getting era1 working in a couple clients asap, the sooner we get import/export working and being periodically used in clients the better since it'll expose issues w/ support for some of the earliest block formats.",
        "created_at": "2024-01-25T17:32:51.165000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yep you seem to be right. We forgot 1 line in our json deseralization code it looks like.",
        "created_at": "2024-01-25T18:51:20.430000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ok, cool, glad to hear it.  Thanks for mentioning it though, now I'm nerd sniped into making sure I understand pre-EIP-658 receipts. 🙂  In doing so I found this nice simple \"test case\" pre-Byzantium block w/ a single  tx in it: https://etherscan.io/block/2284956\n\nI made sure that I can successfully recompute the RLP for the above tx json payload (pulled from our mainnet JSONRPC endpoint) here: https://github.com/INFURA/go-ethlibs/pull/63\nand dusted off super simple receipt trie verification code for single item tries I wrote awhile back: https://replit.com/@ryanleeschneider/TrieTest\n\nSo everything looks good to me, and as a bonus I added pre-Byzantium support to go-ethlibs.",
        "created_at": "2024-01-25T19:15:38.992000+00:00",
        "attachments": null
    }
]