[
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I am generating era1 files for portal. We plan to host them so I will provide a link after they're generated.",
        "created_at": "2024-01-30T03:22:44.157000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "so we are okay with the current format? no need for further changes?",
        "created_at": "2024-01-30T13:25:39.174000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think we are good 2) Isn’t really an issue, era1 is a validate-able format. Multiple clients being able to generate it doesn’t add additional value as it is all the same. If only one client needs to generate it. Then I don’t think 1) is a concern. Cause everyone will use the same snappy library for creating the original era1 files. I can’t think of a reason to regenerate the files once it is done once",
        "created_at": "2024-01-30T15:42:36.476000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think the current format seems like a great start, of course we might find issues as more clients implement import and export.  As discussed on your PR we still need to what to do from the merge up to the current weak subjectivity period but that shouldn't really block the era1 work.",
        "created_at": "2024-01-30T17:56:18.212000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Question RE: 2) I'm curious how the clients that don't include the state root in pre-byzantium receipts actually handle serving devp2p `GetReceipts` requests for those.",
        "created_at": "2024-01-30T19:58:47.440000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "pre-byzantium receipts require's access to intermediate state roots I think. So only archival geth nodes can generate them tmk. Not exactly an answer to your question. Just thought it was interesting barely any nodes can even provide them.",
        "created_at": "2024-01-30T21:31:41.415000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Syncing an archival geth node to 4.37m blocks is only like 300GB. Which is not to bad to generate era1 files for those blocks which is nice",
        "created_at": "2024-01-30T21:34:24.563000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "not sure what you're referring to here. geth always verifies the receipt state root pre-byzantium archive mode or not. nobody really generates receipts anymore though, we just download them over the network and ensure the header chain is contiguous",
        "created_at": "2024-01-30T22:33:39.875000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "lightclient are you referring to what Ryan or I said? I am not commenting on if geth verifies it or not. Just was commenting on needing to run a geth archive node to generate pre-byzantium era1 files (as it requires generating pre-byzantium roots). At least when I have tried to call my geth non-archival full node running through eth-docker ``eth_getTransactionReceipt`` it would return None for pre-byzantium receipts. I believe post-byzantium can be generated without a geth archival node tho.",
        "created_at": "2024-01-30T23:12:35.791000+00:00",
        "attachments": null
    },
    {
        "author": "ryanleeschneider",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Make sure you configure your node with `--history.transactions 0` otherwise txs older than a year aren't indexed and thus can't be queried by hash, you shouldn't need an archive node.",
        "created_at": "2024-01-30T23:18:35.223000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Oh that is good to know. Thank you!",
        "created_at": "2024-01-30T23:22:17.232000+00:00",
        "attachments": null
    }
]