[
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Here's the current summary of things that I'm currently planning to present in the next Execution layer call to update on 4444s rollout plan.\n\n- https://eips.ethereum.org/EIPS/eip-7639 will proceed as-is\n- https://eips.ethereum.org/EIPS/eip-7801 has been updated to make the protocol fully isolated from the `eth` protocol\n- Nethermind and Erigon are proceeding with 7801\n- Geth, Nethermind, Besu, Nimbus, EthereumJS are proceeding with Portal\n\n\u003c@543900561460822016\u003e has stated that using a specific date (May 1st 2025) is an undesirable activation mechanic.  I think the main reason behind this was that many users don't update other than at fork boundaries.  The two obvious options seem to be:\n\n- Keep the May 1st 2025 activation date for 7639\n- Bundle 7639 into pecra and have it activate with Pectra\n- \u003cother suggestions here\u003e\n\nWho's got an opinion on this?",
        "created_at": "2024-12-10T17:23:59.546000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "+1 coativate with pectra or pectra + 1 rather than some arbitrary date - that said, probably doesn't matter _too_ much - our plan roughly is to provide emulate eth/68 support of deep history via portal anyway until it's clear things have settled - adding the cutoff is almost _more_ work than just serving it like that, but we'll see how it pans out.\n+1 keep 7801 entirely separate from `eth` (version numbers are not a good mechanism for optional features)\n\n\none more point that I think we should have ready _before_ that date:\n* fork https://github.com/eth-clients/checkpoint-sync-endpoints as `history-endpoints` where we can keep a directory of community servers serving era(1) files - this is on my eternal todo list and a low hanging  fruit that I'm happy to provide help with should someone want to beat me to it",
        "created_at": "2024-12-10T21:37:11.206000+00:00",
        "attachments": []
    }
]