[
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e  5 months ago to be synced from the consensus client, allowing it to validate ethereum blocks without needing access to the eth1 devp2p network (it's still needed for mempool and/or older history / state). 5 months is the cutoff time for honest CL:s for how long they store blocks.\nI think this is very valuable for a EIP-4444's/Portal world as it makes the EL less reliant on devp2p.\n\n\u003e one use case for this that is available in nimbus-eth1 now is to import the entire block history from era1/era files - together with this top-up, this allows \"syncing\" a client without it ever touching any network. it's pretty neat.\n\u003chttps://github.com/ethereum/trin/tree/master/trin-execution\u003e\n\nThis is exactly what I am implementing for Trin Execution. In 5 days we will have executed to LATEST - (8 to 32)k blocks using era/era1 files.",
        "created_at": "2024-10-01T13:19:13.180000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I am implementing the engine api/blockchain tree right now, so hopefully soon we can keep up with the head of the chain",
        "created_at": "2024-10-01T13:19:55.236000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@449019668296892420\u003e one this to note is https://discord.com/channels/595666850260713488/1285636135770521633 this proposal might invalidate this method of syncing? so maybe that is something which should be discussed. I am not 100% sure so it would be nice to have an extra pair of eyes read it",
        "created_at": "2024-10-01T13:21:08.969000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Our goal with `Trin Execution` is to fully switch from `devp2p` to `Portal Network's`, which should enable a more flexible client's to be built instead of the following the rigidity of `devp2p`",
        "created_at": "2024-10-01T13:22:56.576000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yeah, that's sort of what's happening in nimbus as well (it's part of the reason we started working on portal to begin with)",
        "created_at": "2024-10-01T14:41:48.645000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "one thing that stands in the way of that is actually that portal does not host the cl part of blocks which is a bit of a bummer",
        "created_at": "2024-10-01T14:42:10.906000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "that would be helped by the above proposal, but oh boy that's a lot of moving parts and complexity that we're introducing where any one missing part will sink the whole, more or less",
        "created_at": "2024-10-01T14:45:44.512000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Why would that be needed if you need to run a CL client anyways?",
        "created_at": "2024-10-01T14:53:40.586000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "5 months is still a lot of data",
        "created_at": "2024-10-01T14:54:43.717000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "With Portal you would only need to get the last 8192 blocks from the CL, the rest can be retrieved from the Portal History Network. (If you are running portal without a CL for latest history you would use the Portal Beacon Network, which is just a consensus light client network*)",
        "created_at": "2024-10-01T14:56:42.444000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You could look up the last 8192 blocks from Portal*, but you would need to run some CL client still",
        "created_at": "2024-10-01T14:57:23.542000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So I think it would just be easier for a EL to get them from the CL client",
        "created_at": "2024-10-01T14:57:38.946000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "well, the point is more that if you want to recreate the CL part _also_ (for example to recreate cl archival)",
        "created_at": "2024-10-01T14:57:46.273000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Would that usecase even be useful for an EL client?",
        "created_at": "2024-10-01T14:59:17.120000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Or just helpful for people wanting lighter CL archival access?",
        "created_at": "2024-10-01T14:59:44.569000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If you don't mind me asking what are the use cases for an archival CL node? (I haven't done much research into the CL yet other then some basic understanding)",
        "created_at": "2024-10-01T15:01:59.984000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "lighter client overall, fwiw - ie the sum of el and cl",
        "created_at": "2024-10-01T15:02:02.990000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "historical balances of validators is the most obvious one, as well as being able to recreate the consensus state, just like on the el side",
        "created_at": "2024-10-01T15:04:46.172000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it's just like on the el side - if you're satisfied with what's in the state, you don't need blocks really (so by extension, you don't need portal in its present shape) - a snapshot of the state will do",
        "created_at": "2024-10-01T15:05:55.979000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "on the cl side, we happen to have developed a crappy out-of-band method for copying the state from one client to another, made possible by its (relatively) small size, and we keep hoping that nobody will notice how easy it is to mitm this process - on the el side, this is snap sync more or less which isn't as easy because of the size of the state and it can't be mitm'd because the el outsourced security to the cl - but as an el, once you have a state, you scarcely need the blocks.. \n\nif you're running a validator for example, you don't need them at all _except_ to serve the common good",
        "created_at": "2024-10-01T15:09:35.721000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hosting CL state on portal would be a very manageable undertaking, it would just need someone to specify the use cases and access patterns.  Data sizes are really easy to manage.  I will be surprised if we don't do this in the next 2 years.",
        "created_at": "2024-10-01T15:32:16.949000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Could you explain what you mean by `you don't need portal in its present shape`. By the same logic you could say you don't need devp2p then too no?",
        "created_at": "2024-10-01T15:39:49.205000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "state is trivial (it's fairly small) - it's the block history we want to get rid of",
        "created_at": "2024-10-01T15:47:52.041000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "indeed - or rather, you need devp2p for the mempool, but not for block history - that's the point I made above: by syncing the el from the cl, you don't need the eth/68 (or portal or whatever) network for block history and your el can be fully offline",
        "created_at": "2024-10-01T15:49:22.515000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "the world as it exists today is that 90% of blocks are not built by the el so you can run an el juts for validation purposes without it ever connecting to devp2p and it works just fine - what you end up not having is a backup strategy in case your mev provider goes down",
        "created_at": "2024-10-01T15:50:29.777000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "the cl state provides mainly two things:\n* validator registry - their balances, pubkeys, withdrawal addresses and so on (grows with validator count, majority of data is here)\n* some random metadata like 8k historical hashes and some bookkeeping for randomness - this is constant-sized\n\nfor a cl to operate, it de facto needs the whole state all the time, but this is mostly fine, ie last I checked it hovered around 200mb of data..\n\ntechnically we don't need metadata about exited validators but there's no way to get rid of it in the current version of the spec",
        "created_at": "2024-10-01T15:52:43.013000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The historical summaries proofs are part of the data that I'm aware of that we care about the most.",
        "created_at": "2024-10-01T16:06:34.052000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Portal will adopt some kind of transaction gossip or mempool network. I heard it would be useful for stateless verkle clients",
        "created_at": "2024-10-01T16:33:14.651000+00:00",
        "attachments": []
    }
]