[
    {
        "author": "peersky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I will argue that then it could not be called ledger book technology. The whole ledger definition is implying need to store history of records, and decentralized implies there are proofs of consensus for such records history.\n\nI agree with your second point that we don’t necessarily need full history but rather a starting point. However this starting point is dependent on user’s requirements and should not be a property of a system. \nIn a similar manner as in tax laws there are requirements for data retention, however there also will be archives acting as institutions that store most important data indefinitely, and btw, charge for data retrieval from their records.\n\nThat said, I see that successful model inevitably it will gravitate towards marketplace, just because we want to use DLT as ledger book for records and because we do need to retain some of data for longer periods.\n\nSame applies to the Logs: if users want to use it, this just means that it has good UX and DX. That’s great !\nWouldn’t it be wiser to improve protocol it’s stored and retained , while keeping experience which users already like and willing to pay gas for in the place?\n\nAgain, im advocating for good dx / ux.\nFrom this standpoint the data retention should he property user owns and pays for accordingly. \nI totally feel your point that from consensus engine side this might not make sense, and optimization there certainly will be useful, however in such case the solution to store data should be provided with in quality not least than current to those users that rely on this functionality.",
        "created_at": "2024-02-18T12:41:54.139000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The current state for any blockchain is `genesis + [...blocks] =\u003e current_state`.  Genesis is generally \"the initial block \u0026 state that ships with your client\", but many clients allow you to swap in a different genesis block.  This would not fundamentally change with 4844.  All that changes is that `genesis` for some people will be a recent block/state rather than an ancient block/state.",
        "created_at": "2024-02-18T12:46:05.842000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As far as the UX goes for accessing old data (outside of the weak subjectivity window), I agree that a marketplace for this sort of thing would be valuable.  I would argue that this marketplace should not be baked into clients though and rather should be built by other people separate from the clients.",
        "created_at": "2024-02-18T12:46:54.322000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Nethermind had a project they were working on a while back that was essentially this, but they dropped it for some reason.",
        "created_at": "2024-02-18T12:47:17.673000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "With payment channels and provable state one could imagine a data marketplace that is trustless and decentralized, and I definitely encourage people to build such things!",
        "created_at": "2024-02-18T12:47:48.016000+00:00",
        "attachments": null
    },
    {
        "author": "peersky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My initial comments are for eip4444, which denies p2p data exchange for older then HISTORY_PRUNE_EPOCHS. Im not sure how this is relevant to 4844. In my understanding this shouldn’t be relevant blob. SHOULD NOT -\u003e MAY wording there would make provision for such marketplacing",
        "created_at": "2024-02-18T13:36:17.401000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Sorry, I meant 4444.  I hate the names of these.  😖",
        "created_at": "2024-02-18T13:43:38.837000+00:00",
        "attachments": null
    },
    {
        "author": "peersky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So if 4444 would specify instead of SHOULD NOT a MAY condition it would put less assumptions on the nodes, which could separately negotiate archive data availability.",
        "created_at": "2024-02-18T16:01:20.181000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The thing is why do you need a fullnode if all past data is frozen?",
        "created_at": "2024-02-18T16:25:09.939000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It would be good to get an item added to the rationale for SHOULD NOT rather than MAY NOT.  Maybe something \u003c@543900561460822016\u003e could add (one of the authors)?",
        "created_at": "2024-02-18T17:16:06.283000+00:00",
        "attachments": null
    },
    {
        "author": "peersky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Sorry I didn’t catch the question, can you formulate further ?",
        "created_at": "2024-02-18T17:20:53.410000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In terms of expired history. I am not sure how a heavy archival node would be a better solution than just accessing a history archive file solution like Era1. All the history will be stored in files which contain 8192 block chunks. So an indexer/cdn over these files would just out perform an archival node. These files containing what will be expired history already exist.",
        "created_at": "2024-02-18T17:32:16.965000+00:00",
        "attachments": null
    },
    {
        "author": "peersky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It would be better if all these complexities outlined are abstracted away already on dApp developer level. Same rpc, same request for historic block retrieval",
        "created_at": "2024-02-18T18:45:19.998000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I am of the belief that most dapps should not be requesting data from history.",
        "created_at": "2024-02-18T18:46:55.410000+00:00",
        "attachments": null
    },
    {
        "author": "peersky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "However it would indicate that nodes may drop some of the data (behave not like an archive nodes) and hence can be selective",
        "created_at": "2024-02-18T18:47:04.471000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There are some advanced applications that benefit from archive nodes and history access, like block explorers, but those should be the exceptions, not the rule.",
        "created_at": "2024-02-18T18:47:18.295000+00:00",
        "attachments": null
    },
    {
        "author": "peersky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I believe dapps should decide for themselves what they want to do.. \n\nWhile the network must be as supportive as possible. To support any use case of the DLT.\n\nWhy would you even need to remove functionality from ethereum, which will lead for it to lose competitiveness, if instead could solve same problem in alternative way?",
        "created_at": "2024-02-18T18:58:01.724000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Having every node in he network store a fully copy of history is very far from free.  The core clients should be focusing their complexity and operating costs on coming to consensus reliably, and leave more advanced features (like history storage) to other apps/services/networks built on top of them.",
        "created_at": "2024-02-18T19:05:44.843000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There are a ton of features that would be good to add to Ethereum if hey had no cost, but they all do and those costs must be weighed against the benefit they provide and whether or not an external service built on top of Ethereum could accomplish the same goal.",
        "created_at": "2024-02-18T19:06:44.462000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As an example, the indexes created by true blocks would be extremely useful to have in all clients, but it isn't required for consensus and it *can* be built separately.",
        "created_at": "2024-02-18T19:11:29.867000+00:00",
        "attachments": null
    },
    {
        "author": "peersky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I m not saying every node should store full state, my point is that they may store more than consensus needs. If you want to encapsulate stuff it does make sense, however from user perspective should be clear way to get any data for any period they want to with solely querying their node/p2p network. \nSwarm architecture seems for me something that would be well fitted to accomplish such goal (earning from own storage, sharing bandwidth ensuring redundant data availability), im a bit surprised its not being discussed, maybe im missing something?",
        "created_at": "2024-02-18T23:08:30.154000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Just to be clear history and state are different things. 4444's is a proposal for history expiry, not state. Even with 4444's fullnodes will store more block history then consensus needs.\n\n\u003e however from user perspective should be clear way to get any data for any period they want to with solely querying their node/p2p network. \nThere will be through bittorrent (for block history) or the Portal Networks (for block history, state, and beacon light client data...)\nIn terms of Portal we are building 3 networks out currently.\n- History: stores historical data block headers, bodies, and receipts\n- Beacon: a portal network which is basically just a beacon light client this data is needed to validate post merge data\n- State: We just started building and is a WIP with the plan to provide full archival state access.",
        "created_at": "2024-02-18T23:28:25.324000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Before 4444's is \"activated\" the user experience of getting data from these alternative providers will have to be sufficient. Of course it will be up to the individual clients themselves on what kind of experience they want to support and provide. One of the main points is whatever solution Ethereum clients go with the user experience would be a major priority and a concern. So being able to easily find a p2p provider should be very easy/friendly, without the need to explore the world.",
        "created_at": "2024-02-18T23:29:11.810000+00:00",
        "attachments": null
    }
]