[
    {
        "author": "milos88",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e if you jump straight to starting clients by default not having history, you will have a bootstrapping issue because there will be very few nodes who actually update immediately for the new release\n\nI would say this depends on the actual implementation. Clients that use Portal Network don't necessarily relly on other execution clients being part of the network (since there are other portal network clients already on the network that serve the data). My understanding is that reth will go with some centralized solution as the first step, so it shouldn't have bootsrapping issue.\n\nOf course, we should make sure that there is an agreement between teams on this and make sure that everybody is ready when changes are activated.",
        "created_at": "2024-11-26T02:43:51.597000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "this really has nothing to do with portal",
        "created_at": "2024-11-26T12:20:42.775000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Can you elaborate on what bootstrapping issue you are thinking about? It's it simply about having the new wire protocol live on the network so that when a client comes online there are other clients with the compatible new protocol already live and ready to accept connections?",
        "created_at": "2024-11-26T15:56:32.926000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yes",
        "created_at": "2024-11-26T17:22:45.203000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This makes sense. Seems clients could activate the new wire protocol anytime between now and then as long as they retained the old one until the agreed upon drop date.",
        "created_at": "2024-11-26T18:32:55.045000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yep exactly",
        "created_at": "2024-11-26T20:31:36.458000+00:00",
        "attachments": []
    }
]