[
    {
        "author": "smartprogrammer",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "i personally dont have any preference on bumping the version. it makes no big difference imo. i am a bit leaning towards bumping the version to indicate not serving history because i dont like the fact that without it we will get empty responses from nodes when trying to get history from nodes that dont have it.",
        "created_at": "2024-12-19T14:39:27.789000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Proposed ENR solution seems like it should only be considered if there's a client team that is asking for it",
        "created_at": "2024-12-19T14:39:33.394000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The argument for version bump of the `eth` protocol version is captured here: https://notes.ethereum.org/M41Oj3WyRVSC36Rr0c-Tjg",
        "created_at": "2024-12-19T14:40:08.922000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@194432762315407360\u003e let us know if you think we should not serve eth/69 and eth/70 in parallel with pectra. My thought was that it makes a nicer transition while people are upgrading their clients, they don't accidentally connect to clients who do not intend to serve data. I think we can also just do it within eth/69 and either make empty response or disconnect from the client if they make a request for history that is out of bounds what is being served",
        "created_at": "2024-12-19T14:40:24.714000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Rolling out bumped version of `eth` protocol that DOES NOT serve history can be done quickly, without actually dropping the underlying data and in my opinion, should be tested and rolled out in conjunction with pectra",
        "created_at": "2024-12-19T14:41:45.351000+00:00",
        "attachments": null
    },
    {
        "author": "draganrakita",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Bumping `eth` version makes sense",
        "created_at": "2024-12-19T14:42:35.851000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Actual drop of the data can be done later/closer to the May 1st 2025 date.  This plan gives each client team their own agency to implement this on their own timelines as well as a forcing function to ensure that each client team removes their client's need for history by the drop date, thus allowing everyone to drop this data.",
        "created_at": "2024-12-19T14:44:07.814000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it's OK for me to bump the version if you guys want",
        "created_at": "2024-12-19T14:44:36.516000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm not strongly against it",
        "created_at": "2024-12-19T14:44:50.652000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "just wanted to voice my concern that I find it a bit pointless",
        "created_at": "2024-12-19T14:45:02.454000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "on a related note, we should figure out the eth/69 rollout",
        "created_at": "2024-12-19T14:45:28.058000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'll work on that in Jan 2025, update the spec etc.",
        "created_at": "2024-12-19T14:45:45.146000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "there were some left-over concerns with eth/69, which we have been discussing internally in go-ethereum, and that's why it hasn't been shipped yet",
        "created_at": "2024-12-19T14:48:18.306000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "in particular, it introduces a weird non-standard encoding for typed receipts that is unnecessary",
        "created_at": "2024-12-19T14:48:44.345000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "so I raised the proposal internally to decouple eth protocol receipts encoding from the consensus encoding",
        "created_at": "2024-12-19T14:49:34.766000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "the encoding of typed receipts for tree hashing is stupid and expensive for no good reason, so I'm happy for the opportunity to remove that on the wire protocol",
        "created_at": "2024-12-19T14:50:24.111000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it feels like it's time to bring back EL networking call",
        "created_at": "2024-12-19T14:50:44.402000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "we haven't really been doing these calls because there was always so little to discuss, but history expiry seems like a very good reason to bring it back",
        "created_at": "2024-12-19T14:51:33.150000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It's on Mondays at 1630 UTC, it's called the Portal Network Implementers call \u003c:crazycry:932693133546889216\u003e",
        "created_at": "2024-12-19T14:51:52.770000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(my comment from acd): the eth/70 protocol feels pretty unnecessary - clients just stop responding and that's the end of the story - anyone trying to sync will deal with them as with any other peer that is not giving you data: move on to another peer",
        "created_at": "2024-12-19T14:54:30.874000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "there is literally no difference in action I have to take if I want to download deep history - \"client doesn't have eth/70\" or \"client didn't give me the data\"  are practically equivalent as far as decision points go",
        "created_at": "2024-12-19T14:56:33.158000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "eventually, nobody will even try - the quality of serving / getting deep history goes down _proportionally_ with upgraded clients that use a different mechanism - eth/70 (and discovery flags) in that sense is a solution looking for a problem",
        "created_at": "2024-12-19T14:58:19.352000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "we've done this rollout on the CL side this way already - it worked pretty fine - initially everyone was serving from genesis - nowadays history is limited to 5 months with some random archive nodes here and there",
        "created_at": "2024-12-19T15:00:56.878000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\"find archive peers\" is not the bottleneck regardless, if you want to download full history from network - whether it takes 10s or 1 minute doesn't materially matter",
        "created_at": "2024-12-19T15:02:54.684000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Right now, we don't disconnect from a peer if they respond with an empty response. So I think we can make these changes for eth/69, but it will mean there is a bit of additional traffic around the transition. The new protocol allows us to know at the point of the handshake that we don't need continue with the connection if there is a mismatch between history expectation. The impact of this pretty marginal though",
        "created_at": "2024-12-19T15:07:04.942000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think eth/70 makes sense but I would not make it a \"must\" not to serve history",
        "created_at": "2024-12-19T15:13:35.728000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Just a difference in expectation",
        "created_at": "2024-12-19T15:13:47.275000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I agree that `eth/70` isn't strictly necessary.  I still think that it's worth doing and that it should be done for these reasons.\n\n- The new protocol version gives clients a clear and well defined behavior on how to respond to queries from other clients for deep history.  A client requesting data over `eth/70` that it should not is clearly mis-behaving where-as without the version bump it leaves ambiguity.\n- The bump serves as a way to make history unavailable without actually dropping it, allowing for a smoother and phased rollout of 4444s and an easier client implementation.  This allows for the data to become \"unavailable\" on the network via `eth/70`, and still be available via `eth/69` for those that haven't upgraded yet.\n- The bump allows us to monitor the rollout of which clients support this new functionality and which clients don't.\n\nI think these benefits make it worth doing the bump.  If anyone wants to argue strongly against it, I think the thing that you need to do is make a case that the work to bump is sufficiently high that it cancels out these benefits.",
        "created_at": "2024-12-19T15:42:44.640000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "well, if a peer is not sending you data, it doesn't really matter to you for which reason it is not sending you data - the point   about treating them equally equips consumers with the mechanism to deal future \"shortenings\" of the served history",
        "created_at": "2024-12-19T15:42:58.650000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e  work to bump\nit's always work to bump, because of maintenance, parallel support and extra logic to check for conditions that ultimately don't seem to matter - neither for the producer of data nor for the consumer..\n\nI feel like it's an odd approach to say \"let's do extra work that we can't quite motivate because nobody argued strongly against it\". even those in favour of this addition agree that the benefits are marginal at best . same thing for \"monitoring\" - it's provided as argument as if monitoring had some intrinsic value in and of it self - what specific problem does \"monitoring\" address?\n\nclients *must* already be equipped with a mechanism to deal with peers that don't serve data or else they can't deal with malicious peers - it feels like we can just recycle this mechanism and end up with both a more simple specification, _more_ resilient consumers and future-proofing at the same time, without the extra suggested work",
        "created_at": "2024-12-19T15:52:05.977000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e  A client requesting data over eth/70 that it should not is clearly mis-behaving where-as without the version bump it leaves ambiguity.\nthis is broadly fine in my view - it would be a problem if it repeatedly kept asking for the same range for example ,at which point it would get rate-limited and that would be pretty much the end of the story (this is how it's dealt with in the CL world - a rate-limited peer slowly loses score and eventually is pushed out and in the meantime doesn't cost more than a few hundred bytes which is negligible) - this again relies on a basic protection that we already all implement (hopefully) that turns \"asking for history\" into essentially a non-problem, even if done for deep history",
        "created_at": "2024-12-19T15:56:37.959000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e The bump serves as a way to make history unavailable without actually dropping it\nI'm not sure how a new protocol helps here? By \"rolling out\", presumably we mean \"stop asking for deep history\" - this can be done over eth/69 as well, since the agent in this case is the consumer, not the producer",
        "created_at": "2024-12-19T16:00:01.960000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Since we are modifying the ETH/69 proposal anyway, how about this:",
        "created_at": "2024-12-19T16:56:25.523000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We introduce a Status element with the lower bound of history serving, like Ahmad proposed some time earlier?",
        "created_at": "2024-12-19T16:57:13.495000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "AFAIK we have the following changes queued up for v69 so far:\n\n- remove TD in status\n- remove bloom filter in receipts",
        "created_at": "2024-12-19T16:58:13.410000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Previous change of removing NewBlock, etc. will be reverted from the EIP",
        "created_at": "2024-12-19T16:58:37.176000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So we could just add something else in status",
        "created_at": "2024-12-19T16:58:57.188000+00:00",
        "attachments": null
    },
    {
        "author": ".fjl",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If me manage to roll out 69 before Prague activates, everyone will have this protocol version after the fork",
        "created_at": "2024-12-19T16:59:40.954000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I've created another document that drills deeper into the different cases for bumping or not bumping: https://notes.ethereum.org/JdRsfhU5Qz27THubjkstcA\n\nMy hope is that I've explicitely documented the vast majority of the use cases and consequences of the different courses of action.  The TLDR of why I am still in favor of bumping the protocol version is that it serves as a forcing function for moving 4444s forward, where-as not-bumping more easily allows for inaction to continue to stall this process.  I believe that if we want 4444s to move forward that choosing to bump the protocol version is the best way to make sure we get the outcome we want.\n\n- Reth is in favor of bumping.\n- Geth's formal opinion is unclear.  Lightclient is in favor (strongly?).  Felix is \"not strongly against it\"\n- Arntheduck seems to be opposed.  Is this the formal opinion of the Nimbus team or just your own.  Strongly opposed or just voicing a descenting opinion?\n- Erigon has previously acquiesed to bumping\n- Besu's opinion?\n- Nethermind is unopinionated\n\nIs this summary correct?  Can we get another round of teams weighing in on how they feel about which way we should decide.  Making a decision on this feels like it should be done asap so that we can get a clear direction on how clients are implementing support for this so that development can start.",
        "created_at": "2024-12-19T18:29:03.269000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Erigon is fine with bumping if the \"MUST not serve p2p data\" becomes \"SHOULD not serve p2p data\"",
        "created_at": "2024-12-19T21:22:25.895000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Overall mostly unopinionated and leaning towards no",
        "created_at": "2024-12-19T21:23:07.015000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My thought is that the wording would be \"SHOULD not serve and MUST not request\", which still allows for non-standard use of the protocol if both clients have somehow negotiated something, but otherwise sets up clean paths for standard/default behavior.",
        "created_at": "2024-12-19T23:43:56.297000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "agree. could not have said better myself",
        "created_at": "2024-12-19T23:44:47.072000+00:00",
        "attachments": null
    },
    {
        "author": "funnygiulio",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "still think it is mostly unnecessary tho but this makes it a bit better",
        "created_at": "2024-12-19T23:45:32.947000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "thought a bit more about this, I am indeed opposed (more so after reading the hackmd), not only on the grounds of the benefits being weak compared to the added complexity, but also on more technical grounds: after 70 will come 71  with feature X and 70 leaves no good option for clients wanting to serve history (via 69) _and_ wanting feature X - what do we do then? even versions support history and odd versions do no? eth versions is the wrong mechanism for this kind of optionality.\n\nI understand the forcing effect - I think it is unnecessary and indeed problematic, because it forces us into a corner instead of just enabling a step forwards. I have no doubt our users will take this step without forcing it.\n\nI would be more in favour of the other option: way for clients to respond \"don't have history before X, go away\" to BlockBodies requests (via a structured error code, in whatever eth version they support), alternatively putting that info in some status - this is an overall better mechanism that exhibits many of the same advantages as a new eth version does (from the hackmd), without the problems (we can still deterministically detect misbehaving history-askers for example).\n\nThe more radical option that I _actually_ would want to see is that any kind of history / block syncing moves out into its own subprotocol entirely - we're not too far from a future in which the el doesn't need the history part at all _really_ (since it can be synced from the CL history mostly) so if we're shuffling things around, we might as well prepare for a future in which the txpool  (the remaining reason why we still need devp2p at all) is separate from history at the protocol level .\n\nthis is not (yet) a formal nimbus opinion, we will be discussing it shortly",
        "created_at": "2024-12-19T23:46:29.874000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(nor is it a strong opinion really, ie nimbus will not block progress over a silly thing like this - it's just .. wrong 😉)",
        "created_at": "2024-12-19T23:47:40.113000+00:00",
        "attachments": null
    }
]