[
    {
        "author": "parithosh",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I wrote an approach of history expiry for premerge data that some teams might be interested in exploring, it relies on using torrents as a source for the data. The main advantage is that it's a robust mechanism that's existed for years. \n\nhttps://ethresear.ch/t/torrents-and-eip-4444/19788",
        "created_at": "2024-06-12T10:08:03.880000+00:00",
        "attachments": null
    },
    {
        "author": "matt.nelson",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think for an archive use-case this is more attractive. From the Besu side we would be looking to supplement only the full node use-case, i.e. proxy requests for history of old blocks for our peers, maybe. So with agreement to drop the same history, the proof of stake full node likely wouldnt care about this information. RPC near-head, maybe, but we would likely still store the information without pruning either way. So if you're hovering near the 1 year boundary, then it becomes more akin to the archive use-case. We didn't get far in the discussion of where the line between portal \u003c\u003e archive nodes sit and how the use-cases would be complimentary, so cannot make a point here.",
        "created_at": "2024-06-12T19:00:38.998000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What about the usecase where you get a rpc request to fetch a particular transaction that is older than a year?",
        "created_at": "2024-06-12T20:51:54.343000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Agreed that if it’s near head, then it’s the same pre and post 4444",
        "created_at": "2024-06-12T20:52:19.146000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The full node usecase to me consists of two things ( correct me if I’m wrong):\n\n- requests for old blocks from other nodes \n- rpc requests for particular information about old blocks like a tx from years ago\n\nFor the first one you can proxy that request to portal, for the second you currently cannot since portal only gives you historical blocks (currently) and not granular access to historical transactions. \n\nWe were wondering if this is an issue",
        "created_at": "2024-06-12T20:57:17.693000+00:00",
        "attachments": null
    },
    {
        "author": "kevaundray",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There’s a mitigation above for it (requires full node to maintain an index from tx to block)\n\nSo given a tx hash, full node looks in their index to see what block it belongs to, queries portal for that block, then extracts the tx they are interested in",
        "created_at": "2024-06-12T20:59:56.845000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It would be fairly easy to look up a block body, but add support to only request an individual transaction",
        "created_at": "2024-06-12T21:12:18.768000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But another thing what would likely need to be considered is how do you know the data is real",
        "created_at": "2024-06-12T21:13:40.347000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "How anchor/prove this data (it is possible but what would be the associated costs)",
        "created_at": "2024-06-12T21:14:10.380000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Would the costs of providing granular transaction access be less then just requesting the block body when all is verified for validity not sure",
        "created_at": "2024-06-12T21:18:00.146000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I wonder what the time/performance difference would be compared requesting a block body for a transaction and just being able to query for the transaction directly",
        "created_at": "2024-06-12T21:24:37.081000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You would still need to request the block header then I assume include a merkle proof with every transaction",
        "created_at": "2024-06-12T21:26:07.025000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think the play would be to request a block and specify a transaction",
        "created_at": "2024-06-12T21:33:57.817000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If that was done a proof would need to be included which would be a merkle proof of the merkle patricia trie constructed for the block headers transaction root and I assume the transaction would be 220 bytes",
        "created_at": "2024-06-12T21:34:58.130000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So stats on the sizes of those proofs in the transaction root trie would need to be done",
        "created_at": "2024-06-12T21:41:29.700000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This proof would need to be constructed on the fly so a trie of maybe 15000 leafs, I wonder how quick it would be to get a proof from that",
        "created_at": "2024-06-12T21:43:55.329000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Worth noting that Portal has plans for efficient bulk retrieval from the network.  If this functionality is of high value to any teams that were integrating with portal we could probably deliver them in a shorter time line.",
        "created_at": "2024-06-12T22:04:47.370000+00:00",
        "attachments": null
    }
]