[
    {
        "author": "peersky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If there are no restriction, that implies that I can join portal network with light node without contributing memory/storage/traffic yet receive data from peer exchange? That sounds sketchy for me \n\nSome of Swarm concerns you have are over my level of competence in that protocol, it seems for me that they've done work in same direction and it's shame to see if there any missed opportunities to help each other elaborating same technology. Ive communicated this discussion to Victor Tron and invited some of them to join the channel if they would like to discuss that. \n\nMeanwhile I left comment for eip4444 suggesting change wording towards \"may not\" \nhttps://ethereum-magicians.org/t/eip-4444-bound-historical-data-in-execution-clients/7450/36\n\nI could not find a PR to make diff suggestion, but still. \n\nIf I have a chance I'll try to hop on one of the calls you have on Portal network to listen and catch up. There are few reasons why I'm interested - 1st being that my background is in electronics engineering and I'd like to be on top of what happens with light nodes to see clearly point when Im able to run full consensus participants in IoT/small devices as there are vast opportunities there (and frankly, I have no idea how can you get there without building financial model for such m2m data exchange, but im thrilled to see someone getting it right).",
        "created_at": "2024-02-22T17:57:56.446000+00:00",
        "attachments": null
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e If there are no restriction, that implies that I can join X with Y node without contributing memory/storage/traffic yet receive data from peer exchange? That sounds sketchy for me \nYou can do this on all major blockchains to some degree bitcoin, ethereum, etc. To some degree you have to make an assumption that there are honest nodes. I am not sure of any name brand blockchains which do properly enforce `contributing memory/storage/traffic` there could be peer scoring but I am not sure that could eliminate the issue\n\n\u003e Meanwhile I left comment for eip4444 suggesting change wording towards \"may not\" \u003chttps://ethereum-magicians.org/t/eip-4444-bound-historical-data-in-execution-clients/7450/36\u003e\nI think I/(people who work on portal) should probably be more aware/involved in discussions on `ethereum-magicians.org` and just what is happening there in general thank you for the wake up call in that regard 🫡 \n\n\u003e If I have a chance I'll try to hop on one of the calls you have on Portal network to listen and catch up. \n(posting this just in case) here a calendar with a link to those Portal Network Implementer's calls \u003chttps://calendar.google.com/calendar/u/1?cid=Y191cGFvZm9uZzhtZ3JtcmtlZ243aWM3aGs1c0Bncm91cC5jYWxlbmRhci5nb29nbGUuY29t\u003e\n\nI want to make/see Ethereum accessible on IoT/small devices too :D and yeah there are a ton of opportunities there, but it is definitely a hard collection problem.",
        "created_at": "2024-02-22T18:56:09.534000+00:00",
        "attachments": null
    }
]