[
    {
        "author": "peersky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I took look on Portal Network documentation. Generally it seems for me very similar to what ethSwarm is building - Kademlia DHT, splitting data in to chunks etc. The biggest difference that they are taking financially generalized approach reliant on Eth L1 consensus to settle that, while in your case it's based on assumption of intrinsic value of storing data, and given the amount of work done in the book of swarm https://papers.ethswarm.org/p/book-of-swarm/ I assume there are many aspects/boundry cases that might be not considered, or at least I did not find them on the portal docs. \n \nFor instance, If I understand correct, this implies that Portal network would be very restrictive on the access to it by someone not taking part of data retention and exchange routine. (sharing your storage is required as a commitment to the network). Thinking of this I can imagine the maximum extracted value for such clients could be limit/throttle their outbound traffic to reduce own operational costs, or even drop out storage once they get what they need from the network and leave it. Was this considered?",
        "created_at": "2024-02-20T18:22:08.150000+00:00",
        "attachments": []
    },
    {
        "author": "peersky",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Found this https://ethresear.ch/t/trustless-access-to-ethereum-state-with-swarm/17350",
        "created_at": "2024-02-20T18:35:45.777000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e For instance, If I understand correct, this implies that Portal network would be very restrictive on the access to it by someone not taking part of data retention and exchange routine. (sharing your storage is required as a commitment to the network). \nWe don't check or have any restrictions\n\u003e Thinking of this I can imagine the maximum extracted value for such clients could be limit/throttle their outbound traffic to reduce own operational costs, or even drop out storage once they get what they need from the network and leave it. Was this considered?\nWhat is the cost to participate as a fullnode in Swarm vs Portal. From what I can see swarm is forecasting requirements 8-16x higher then our targets.\n\nSwarm from the looks of it will also has higher overhead to request data not even considering the overhead incurred by there incentive scheme.\n\nSwarm chunks data in `4 kilobyte` chunks assuming you want to get a receipt at block 15600000 ~148,884/4096=36.348 requests to their network. This is assuming you don't use `Erasure Coding` which they have configurable so it could add overhead as well.\n\nIn Portal's model you can just request the specific Execution layer data you need. You may need multiple pieces in terms of state, but that state won't be arbitrarily broken up into 4kb chunks which incurs overhead.\n\nSomething I don't see them talking about is the concept where data is flushed off the network as new data is added. Nodes store the `closest` data to themselves. A simple example is if you have a network which can store 1 piece of data and a new piece of data is submitted which is closer. The node will evict the old piece. Lets say you have a network with 500 nodes with a collective storage capacity of 4mb. if you have 4mb of unique content assuming an even distribution you would have 1 copy of each piece of content on the network. If you submit 1 more piece of content something is likely to be replaced or it won't be stored",
        "created_at": "2024-02-20T19:16:27.279000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is why in IP:FS there are services to republish data for this exact problem",
        "created_at": "2024-02-20T19:18:39.101000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In a generic distributed storage network like IP:FS and swarm data getting flushed off the network is a major concern",
        "created_at": "2024-02-20T19:19:08.610000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I see Swarm allows users to use `Erasure Coding`, but would that not increase the latency of accessing the data and how much storage it takes to store the data on the network etc.",
        "created_at": "2024-02-20T19:20:12.134000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So these are trade offs they choose to make for redundancy, at the cost of usability of their service.",
        "created_at": "2024-02-20T19:20:44.696000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Portal on the other hand isn't a generic distributed storage network and because of that any network storage capacity over the current requirement to store all the history or the state ends up just being replicas of the data.",
        "created_at": "2024-02-20T19:21:59.521000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Our storage requirement to store the base data no replicas grows with the Ethereum chain",
        "created_at": "2024-02-20T19:23:07.361000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "On the other hand with swarm there requirement to store 1 replica of the data grows as users submit more data.",
        "created_at": "2024-02-20T19:23:42.078000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Since swarm is a generic storage network they wouldn't only store ethereum mainnet data. So to get base redundancy from the network requires potential way more storage.",
        "created_at": "2024-02-20T19:26:42.684000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If you want to use `Erasure Coding` to get redundancy well that is a trade off with real replications on the network of the chunks and would increase the cost to access the data",
        "created_at": "2024-02-20T19:27:26.248000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Swarm requires more everything to provide the same products portal could. Why is this? Well both projects have different goals and are optimized for different usecases.",
        "created_at": "2024-02-20T19:31:44.804000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "For Swarm providing Ethereum State access is an after thought and was most likely posted to ethreasearch for marketing purposes. Any DHT can store Ethereum history and state, the question is, is the solution efficient enough it makes sense to use. Portal could be optimized a lot more then it already is, but in this area a purpose built solution vs a general solution makes a world of difference in terms of the cost to provide/access this data",
        "created_at": "2024-02-20T19:33:57.264000+00:00",
        "attachments": []
    }
]