[
    {
        "author": "deme1744",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Maybe I am misinterpreting some of the discussions here, but I notice era files often being mentioned in the same context as \"solution to individual block/receipts history requests for nodes with history pruning\".\n\nIn my opinion, this is not what era files are meant to deliver, and while you can use it for that, it would not be very efficient.\n\nEra is a storage format, not a means of distribution. Era files can be accessed over HTTP endpoints (and there is this initiative https://ethresear.ch/t/torrents-and-eip-4444/19788).\nI see it as standardized and portable way of backup of the chain history. It can be used to quickly download and sync the chain from (full sync, Nimbus supports this). Or can be used when you want a full node (with history) pruning, but where the pruned part can be (re)covered still with stored era files (afaik geth supports this now in their ancient dir). \n\nFor this latter use case separation of receipts is not really useful. For syncing over era files it would help on the download bandwidth used. Whether that is worth providing two versions of era files (with and without receipts) somewhere, I don't know.\n\nNow for individual block/receipts requests, solutions such as Portal (or something on devp2p/ethxx) will be required.\nYou can of course build something in your client that requests the full era file over HTTP for individual block/receipts access and then deletes it again. But it wouldn't be efficient nor will it be a very decentralized solution.\n\nFor your home staker use case, you would indeed need to be able to import those receipts from EraE files in case you don't want to store the full EraE files with bodies included, or have full receipts separation in era. Or we get Portal history network deployed and even more disk space would be saved.",
        "created_at": "2025-07-26T15:24:56.107000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Portal history network would be amazing. Yes I see Era as a way to sync a full node (when p2p no longer carries history), but not an ideal way to query history",
        "created_at": "2025-07-26T16:19:45.874000+00:00",
        "attachments": null
    }
]