[
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "what is the reasoning behind including receipts in era files? why not just include the pure history of headers+bodies?",
        "created_at": "2025-07-06T01:18:40.414000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You need historic state to regenerate receipts, and receipts are the most commonly needed piece of history.",
        "created_at": "2025-07-06T04:46:18.772000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "history vs receipts seem like separate concerns\n\nif someone wants to replay history for syncing/validation purposes they should only download the pure history of headers+bodies\n\nif someone wants to process the receipts we should accommodate this with parquet archives. parquet files are naturally compressed + queryable + compatible with many data tools. they the industry standard form factor for this type of usecase\n\nincluding the receipts would also add significant bandwidth+complexity costs to era's distribution",
        "created_at": "2025-07-06T05:38:35.309000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I would not be opposed separating the two.  However, receipts should not be a \"second class\" concern that the core devs ignore and \"leave up to the community\".  Receipt history should be a first class system that is fully supported natively by all clients, and on similar timelines with header/body history.",
        "created_at": "2025-07-06T06:06:32.470000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In other words, I wouldn't support dropping receipts from era files until *after* a fully specced out and implemented alternative system for receipt history was available.",
        "created_at": "2025-07-06T06:07:28.650000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it seems like your usecase would be best served by an archive node. you can configure the archive node to prune everything except old receipts, if that's what you wish\n\ntacking the receipt functionality into the era format and into the history preservation mechanism feels like scope creep. this will make the system less efficient and provide less functionality than either a parquet archive or an archive node. it will also make the system more complex than it needs to be",
        "created_at": "2025-07-06T16:41:09.744000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What you have described here isn't an archive node, it is a full node.  Archive node stores all historic state.",
        "created_at": "2025-07-06T17:08:05.247000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Full node, historically, meant all block bodies, all block headers, all receipts, head state.  I'm not sure what the proper nomenclature is with history expiry, but I would assume \"full node\" would now refer to all bodies/headers/receipts since the history deletion date (and current state).",
        "created_at": "2025-07-06T17:11:50.871000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "no I meant archive node because the whole point of this channel is removing this type of data from the full node. archive nodes will maintain this functionality",
        "created_at": "2025-07-06T17:42:36.420000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I thought this channel was related to EIP-4444 and the extra-protocol mechanisms for distributing and fetching the \"expired\" data?  And I thought the ERA files were that extra-protocol mechanism?",
        "created_at": "2025-07-06T17:44:46.654000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "lets not split hairs about the purpose of this channel\n\nthe era format is still not finalized. there are still decisions to be made about how these datasets will be distributed\n\nI'm here to learn about why receipts are included in ERA. I'm also here to advocate for removing them, because afaict 1) they will make the history recovery system worse and 2) they are better served by other mechanisms like archive nodes and parquet archives\n\nbut I also have limited context on the design of ERA...if I'm missing some reasoning about why receipts should be in ERA, I'd love to hear it",
        "created_at": "2025-07-06T17:51:48.998000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ancient receipt history need to be distributed and available to users, ideally over P2P networks for censorship resistance and resilience.  As I understand it, ERA is the chosen format for distribution of ancient history.  There is likely value in splitting headers, bodies, and receipts into separate packages so someone can fetch only one or two of the three.  There also may be value in choosing alternative file formats for any one of them.\n\nWhat I'm arguing against is just kicking receipts out entirely and leaving it up to users to figure out how to get them, or relegating their storage and availability to centralized entities (e.g., archive node RPC providers).  We have seen in the past that when clients don't ship something, it doesn't magically get built by third parties unless there is profit in doing so (e.g., MEV extraction).",
        "created_at": "2025-07-06T18:04:14.841000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e What I'm arguing against is just kicking receipts out entirely and leaving it up to users to figure out how to get them, or relegating their storage and availability to centralized entities (e.g., archive node RPC providers)\narchive nodes solve this. there is nothing new that users need to figure out. just run an archive node if you need this data and don't want to trust any third parties. prune non-receipt data if you want to reduce storage space req's. this usecase already has a robust high lindy solution. creating a redundant solution is an inefficient use of the extremely limited resource that is dev time\n\nevery bit of extra complexity added to ERA will also delay its implementation + increase the surface area for bugs. meanwhile history is growing bigger and bigger, which you often also raise concerns about",
        "created_at": "2025-07-06T18:16:49.998000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "One does not simply \"run an archive node\".  (reference: \u003chttps://knowyourmeme.com/memes/one-does-not-simply-walk-into-mordor\u003e)",
        "created_at": "2025-07-06T18:21:11.995000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Though, it sounds like you aren't actually referring to an archive node.  I think what you are suggesting is that users who want receipts should re-execute all of history from genesis, building receipts along the way, and configuring their client to drop everything *except* receipts and current head as they do so?",
        "created_at": "2025-07-06T18:22:24.753000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is certainly lighter weight than running an actual archive node, but it is still a quite heavy weight operation.  Re-executing all of history takes a non-trivial amount of time, and you have to download all blocks and bodies to do so (which in this scenario we are throwing away immediately after execution).",
        "created_at": "2025-07-06T18:23:24.852000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I believe even with the strategy you are proposing, the user would need to first fetch all blocks and all bodies via ERA files, and then drop them as they execute, so the disk space requirements would be that of a full node with full history, so they wouldn't benefit much from history expiry with regards to hardware requirements, since they still need a disk big enough to hold all headers/bodies until *after* they have regenerated all receipts.",
        "created_at": "2025-07-06T18:24:58.276000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yes that is what I'm advocating. running an archive node is a lot easier than it used to be. ppl also run archive nodes with many different pruning configurations\n\nand yes, rsync'ing the history takes some time, but that's ok given this is a relatively niche operation compared to what the average user will be doing. those that need the extra data can do the extra steps (which again, are much easier than they used to be)",
        "created_at": "2025-07-06T18:31:53.445000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I really don't like calling what you are referring to an archive node.  \"Archive Node\" has very specific meaning, which is all state history.  An archive node can execute a transaction from any block in history.  What you are describing cannot do this, so it is not an archive node by the historic and I believe common definition of archive node and I think calling that an archive node is going to cause a lot of confusion.  \"Full Node\" historically referred to something close to what you are describing, a node that has all history but only head state.  There may also be value in coming up with a name to differentiate nodes that store all history vs only recent history.",
        "created_at": "2025-07-06T18:36:13.620000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e this is a relatively niche operation compared to what the average user will be doing\nMost apps on Ethereum have a hard dependency on receipt history.  Very few have a hard dependency on header/body history.  I would argue that receipt history is the second most important thing for regular users after head state.  I don't think we should be calling it a \"niche\" use case.",
        "created_at": "2025-07-06T18:37:45.572000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That being said, I have personally advocated in the past for dropping receipt history and discouraging apps using receipts for long-term storage, so I'm not against moving in that direction.  However, given the current state of affairs on Ethereum I don't think we can just drop support for people who want receipt history, or suddenly require them to re-execute all of history in order to run a node that serves these needed receipts.",
        "created_at": "2025-07-06T18:39:00.304000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\"archive node\" and \"full node\" have taken on much more complex meanings than they had a few years ago. there are now a large variety of storage configuration options that ppl use. and the terms are only going to grow more blurry as nodes continue differentiating. regardless, arguing about terminology is not very useful here",
        "created_at": "2025-07-06T19:24:12.832000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "no, I'm not saying that use of receipts in apps is niche, I'm saying that ppl running full nodes themselves for financial purposes (such as yourself) are niche. most ppl running nodes are either validators or archive nodes",
        "created_at": "2025-07-06T19:24:40.846000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yea, minimal disruption to existing workflows seems like the strongest point in favor of including receipts in ERA. still I would question why shouldn't archive nodes become the officially recommended way to handle this usecase instead. it's already implemented and it works very well",
        "created_at": "2025-07-06T19:26:44.063000+00:00",
        "attachments": null
    }
]