[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Terminology is very important so we can have productive discussions.  Archive node means something specific and you are using it to mean something different from everyone else, which is going to be confusing for anyone reading this conversation   if you think it isn't important, then stop calling it an archive node.",
        "created_at": "2025-07-07T01:47:26.626000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ah, it sounds like we are back to the same disagreement as previously.  You don't think end users being able to operate Ethereum on their computers is important and it is fine if everyone has to interface with the network through centralized providers, while I think allowing end users to access Ethereum sovereignly is one of the most important things.",
        "created_at": "2025-07-07T01:50:01.474000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it seems that you're arguing in bad faith. I didn't say any of those things. I said the usecase was niche, which is true in the literal sense of being unusual",
        "created_at": "2025-07-07T01:53:11.260000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That was my original interpretation of your statement of \"niche\".  You clarified, which leads me to my new interpretation of our disagreement.",
        "created_at": "2025-07-07T01:58:39.593000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If you think that users *should* be able to interface with Ethereum locally without buying hardware for it, then we can discuss the merits of whether removing receipts helps or hurts that.  If you don't think that users *should* be able to interface with Ethereum locally without buying new hardware then the useful place to engage in debate is around what the purpose of Ethereum is and why we are building it.",
        "created_at": "2025-07-07T02:01:37.354000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "argument with micah",
        "created_at": "2025-07-07T02:16:17.139000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "apologies for harming the SNR of this channel",
        "created_at": "2025-07-07T02:16:34.079000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I would like to return to the topic of: why are receipts included era files? why not just include the pure history of headers+bodies?\n\nwould love to hear from \u003c@543900561460822016\u003e  or other ppl who are designing the standard",
        "created_at": "2025-07-07T02:16:53.936000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The above conversation is on topic, it sounds like you just don't like the answer?",
        "created_at": "2025-07-07T02:20:57.633000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It's a fair point \u003c@716119813675548694\u003e. If we make receipts optional would that resolve your issue? The format should be able to easily handle optional values. It's then simply a matter of serving both forms of the data",
        "created_at": "2025-07-07T21:34:36.862000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My take on why receipts should be in the era file is that they are what are gossiped between nodes when getting a \"full block\" - except for the state root all other values are provable from the provided data, and removing receipts would leave a hole for calculating the \"receipts root.\" \n\nIf we make receipts optional why can we not, by the same logic, make block bodies optional?",
        "created_at": "2025-07-07T21:53:15.645000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "yea making the receipts optional would fix the bandwidth problem I was talking about\n\ntwo other concerns:\n- how much will receipts increase the implementation time? particularly the time to reach a robust reliable solution\n- how much will receipts increase the complexity? especially if they become optional and now nodes need to manage edge cases and bookkeeping who has receipts vs who doesn't\n\nmy main fear is that it ends up taking a lot of dev time to implement something that already has good solutions (receipts in archive nodes and in parquet file archives)\n\nbut if receipts add minimal complexity and add minimal dev time to ERA it seems fine to include them (preferably optional)",
        "created_at": "2025-07-07T22:32:38.229000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I was viewing this new ERA protocol purely as a history recovery mechanism. making the bodies optional seems like growing the scope to something more like a portal network 2.0, where it's being used to distribute a variety of datasets. I think this should be discouraged since there are already dataset distribution mechanisms with most/all of the properties we need, and we shouldnt allocate precious dev time + protocol complexity to reinvent the wheel",
        "created_at": "2025-07-07T22:36:02.627000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "How can you regenerate the receipts without state?  That works great for the erigon history model, but not the triedb model the other clients have. Removing the receipts is akin to discarding them for geth/neth/besu",
        "created_at": "2025-07-07T22:37:41.482000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That depends on what \"optional\" means then.",
        "created_at": "2025-07-07T22:38:33.945000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "you're right that it would require an archive node. so reth, erigon, and now geth (with their more efficient archive node impl)",
        "created_at": "2025-07-07T22:38:53.117000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "what youre saying is a decent argument in favor of keeping them. I would just question whether this is what we should view as the default for a full node, vs just recommending archive nodes for ppl that need historical data. at least for a validator node the receipts might not be useful data, especially for the cost of hundreds of GB's",
        "created_at": "2025-07-07T22:40:51.793000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Scanning log topics is a very common use case for full nodes. I don't think it should be moved to an archive-node only state.",
        "created_at": "2025-07-07T22:41:32.111000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think what we need is a new category of node that is lighter than a full node, but not a full light client. But I don't think there will be enough need for that until some form of stateless ships.",
        "created_at": "2025-07-07T22:43:37.980000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "ok that makes sense. I think maintaining receipt functionality in full nodes is fine as long as clients have the ability to prune this data if they choose\n\na scenario to avoid is validators bumping up against storage space limits due to receipt data they do not ever need. already today some ppl raise concerns about validator storage req's growing too big. so I think making this a common config for validators should not be something that waits until statelessness, whose timeline is probably years out\n\nalso in the recommended hardware specs for validators, complete historical receipts should not count toward the storage space limit, because they should be optional data not necessary for validation",
        "created_at": "2025-07-07T22:49:16.471000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What you describe is basically how history expiry started. Besu added an option to not syncing the pre-beacon blocks (with a hard-coded block hash to ensure correctness).",
        "created_at": "2025-07-07T22:51:21.554000+00:00",
        "attachments": null
    }
]