[
    {
        "author": "yorickdowne",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So from a home staker perspective: The use case is being able to run SSV, Stakewise vault with NodeSet, RocketPool, “others” that for better or worse \u003c:harold:1019414542075297892\u003e use receipts\n\nYes I want them all off receipts. Not sure how fast that happens.\n\nAbout 50% of home users have 2TB disks still, if an informal xitter poll is anything to go by.\n\nSo the tension is: Yes, the LST protocols need to solve this by coming off receipts. In the meanwhile, they haven’t - and some maybe won’t - and so is there a way to have cake and eat, too? Set some space aside for receipts in a queryable file format, but still be able to expire history",
        "created_at": "2025-07-08T08:25:24.044000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Parquet file actually sounds grand, but delaying anything for it does not.\n\nSo maybe receipts as an optional component in EraE files, so full nodes can grab receipts (and only those) if desired - that’d be an option clients can offer for a “node with history expiry but full receipts”.\n\nWhether it’s then still worth the effort to specify parquet files is a good question. Once receipts are optional in EraE it may tbh easier to leave everything else to client teams: If they want to grab just the receipts from EraE and store them in parquet, they can.",
        "created_at": "2025-07-08T08:29:43.436000+00:00",
        "attachments": null
    },
    {
        "author": "yorickdowne",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "TL;DR: Home validator operators need receipts presently if they operate for an LST (which allows them to stake with less than 32 ETH and is a way to get involved with Ethereum without a large capital outlay). Allowing some way for such operators to stay on 2TB disk, run expired nodes, and still have receipts, will help them.",
        "created_at": "2025-07-08T08:31:42.909000+00:00",
        "attachments": null
    },
    {
        "author": "notnotstorm",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "makes sense. I see now that the path of least resistance is just including the receipts\n\nmaking them optional seems like a nice touch for improving bandwidth and enabling validator configurations that have reduced storage capacity",
        "created_at": "2025-07-08T16:53:41.966000+00:00",
        "attachments": null
    }
]