[
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "problem I see is that the numbers are honestly ridiculous! on mainnet it is (in theory) safe to do it on Pectra + 4 weeks, and we could agree on this right now, except from the fact that Sepolia it's going to be May 1st and mainnet Pectra is going to be Apr 30. We really need to test this before on Sepolia. cc \u003c@539495253418180618\u003e \n\nIf you guys don't agree kinda urgently to drop from Sepolia in the coming weeks (at the very least one client so that we test all CLs against that client) then we need to agree on a longer timeline for mainnet.",
        "created_at": "2025-03-28T01:39:46.506000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It should be reasonable to do testing against the first client that is ready by just having them have a mode to manually drop history so that the testing can happen without causing all of those clients to drop automatically.  Should allow the CL testing to start happening ahead of the the May 1st date",
        "created_at": "2025-03-28T04:04:14.069000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Any volunteers on the EL side that are willing to ship a release with this functionality so that we can fast track some of the initial CL testing",
        "created_at": "2025-03-28T04:05:22.026000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Nethermind was eager to do this, not sure if they're already testing this",
        "created_at": "2025-03-28T04:08:03.112000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "timing wise this circles back to the discussion yesterday\n\ni understand having a stake in the ground for mainnet (i.e. the 4 weeks number), but that should come w/ the understanding that it is all conditional on sepolia working well post-expiry",
        "created_at": "2025-03-28T17:35:55.734000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@364458974906548225\u003e the meta-eip would be very helpful\n\nAnd also a document around what kind of testing/milestones we want to meet on sepolia before moving to mainnet would help this be a success",
        "created_at": "2025-03-28T17:37:19.955000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "e.g. i wouldn't want to expire history on mainnet until ~every validator on sepolia has dropped history, we confirm nothing breaks, and ideally that we can still retrieve history in whatever way",
        "created_at": "2025-03-28T17:37:54.649000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "so something like a \"History expiry readiness checklist\" (not sure if this exists already) would help everyone build confidence for mainnet",
        "created_at": "2025-03-28T17:38:22.397000+00:00",
        "attachments": null
    }
]