[
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Does the following write-up seem right? Assume slot auction and IL committee release time is 11s. Analyze from the perspective of IL committee members, next slot proposers, next slot builders, and attesters.\n\nAt `n` 11s: \n- IL committee releases IL.\n- Builder of `n+1` has 1s to update bid.\n- Attesters of `n+1` have 4s to verify IL.\n\nAt `n+1` 0s:\n- Proposer of `n+1` releases block commits to a winning bid.\n- Attesters of `n+1` have 3s to verify block.\n\nAt `n+1` 6s:\n- Builder releases a payload and IL_agg.\n- IL committee of `n+2` has 5s to verify the payload and release IL for `n+2`.\n- Attesters of `n+2` have 9s to verify payload and IL_agg for `n+2`.\n\nAt `n+2` 11s:\n- IL committee releases IL.\n- Builder of `n+2` has 1s to update bid.\n- Attesters of `n+2` have 4s to verify IL.",
        "created_at": "2024-07-04T01:31:22.366000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "at `n` 11s, why do attesters of `n+1` have 4s to verify IL (assuming IL == local ILs)? As in, what do they have to verify?\n\none of the properties of FOCIL is that attesters should only have to verify that the payload satisfies IL_agg entries at the time of block validation.",
        "created_at": "2024-07-04T11:34:56.381000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "attesters of n+1 do not have to verify IL, other than that this is exactly the same as mine with x=1. I still don't like the compromise that it's made with x\u003e0 and the risks that it brings builders that would need to gather all ILs before deciding if they need to bid, these are two global network trips:\n1- ILs need to go out, propagate over the network and reach the builder. \n2- The Builder needs to get **all or most ILs** to decide because the aggregate quality is what matters. \n3- Builder's bid needs to propagate and reach the proposer before the start of the slot. \n\nAll this in less than `x`. And the larger the `x` the less time we are giving validators on the IL committee to execute the previous payload.",
        "created_at": "2024-07-04T13:12:31.980000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks. I mixed up with forward inclusion list. Agree attestes of n+1 do not have to verify indivitual IL other than IL aggregate. Only the attesters of n+2 need to \"lock\" onto the IL",
        "created_at": "2024-07-04T13:21:21.363000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah I think we've identified that trade-off. Then it's a matter of whether it's worth giving up 1-2 sec of payload validation time to (meaningfully) improve the network's CR properties. Imo it definitely is ofc. About one of your previous comment, I don't think it's possible to demand more from the protocol (add a committee CR gagdet) without giving up anything at all, in the exact same amount of time. I agree ePBS design is compatible w/ EIP 7547 out of the box, but that's because only one party is responsible for making the IL and that's exactly why the design is weaker when it comes to CR.",
        "created_at": "2024-07-04T13:22:09.316000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Maybe it's worth looking at this from the perspective of three actors:\n1. Powerful builders (titan, rsync, beaver): assume they are well-peered with the IL committee and very capable of making last-minute changes to their bids.\n2. Small builders: this hurts them the most and is a centralization factor, as they are less capable of peering well and more under time constraints.\n3. Validators that still self-build: this doesn't matter much. They can just make a bid of zero value and have 6 seconds to figure out how to build the block.",
        "created_at": "2024-07-04T13:28:22.432000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes! Asked some builders to get their thoughts on timing, waiting for answers there",
        "created_at": "2024-07-04T13:29:23.304000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "one note is that \"small\" builders are already struggling (if not giving up) for reasons that have nothing to do with peering, mainly having to subsidize blocks to get marketshare",
        "created_at": "2024-07-04T13:30:20.126000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "do you mind elaborate on the \"subsidize block\"  problem? is this because relayer requires builders to have certain market share?",
        "created_at": "2024-07-04T13:33:15.672000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "epbs removes relayer for example",
        "created_at": "2024-07-04T13:33:21.843000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "ofc, but no it's on the searchers' side, they'll only send valuable order flow to builders that have a large enough block market share",
        "created_at": "2024-07-04T13:34:22.238000+00:00",
        "attachments": null
    }
]