[
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Here is a note detailing why I believe FOCIL will not be taken over by profit-seeking out-of-protocol middleware like preconfirmations: https://mirror.xyz/julianma.eth/Gnd8N1IsoHuGHRisp6nCldlt72ZacoXUA-O76qQN3mc",
        "created_at": "2024-10-06T09:25:22.879000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e These two observations imply that all validators and more sophisticated agents can create inclusion lists equally well. Therefore, there is no reason for a validator to outsource its inclusion list construction duties to a more sophisticated party.\nI dispute this point in two different levels: first  sophistication to prepare an inclusion list is irrelevant if validators get zero in-protocol. Of course if ILs were worth something and the would-be-payers would be able to reach IL members then yes, validators would not be motivated to outsource, but that's not the point being raised. Such a direct-to-IL-member market does require forking clients and a more invasive change. What we are arguing is that validators will outsource because they can simply run a IL-Boost.\n\nSecond, the statement itself is false: sophistication to create a block (or an IL) does not have to do with speed or latency or harware, it is mostly about having the transactions to create the block (or IL). In this case, the preconfers will be definitely more sophisticated as they will have the transactions that won't even be able to make to an IL on the public mempool",
        "created_at": "2024-10-06T10:17:43.788000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e The statement that no sophistication is necessary implies that if an IL-Boost were created, it would facilitate the fair exchange between an IL committee member and a preconf demander, not between an IL committee member and a relay/builder (if these preconfs were valuable which they shouldnt be). There is no need for a sophisticated intermediary. This can be done in the same way as the IL-Boost that you imagine and does not require invasive changes. So even if preconfs were valuable, then the sellers of the preconfs can still be decentralized.",
        "created_at": "2024-10-06T10:52:43.948000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e I address private order flow in the post as well.",
        "created_at": "2024-10-06T10:55:09.578000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "It does: how will the transaction sender contact the IL member directly to send the transaction? The whole point is that I don't want my transaction to be in the mempool, I want to get a fast preconfirmation that it will be included in the next block",
        "created_at": "2024-10-06T11:02:47.146000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I can contact someone like Flashbots, but I cannot contact someone like Potuz's home",
        "created_at": "2024-10-06T11:03:02.884000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "and Potuz can simply hook to flashbots by running a middleware without touching his validator at all",
        "created_at": "2024-10-06T11:03:23.900000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm starting to see FOCIL as a poor man's version of MCP, where there's one first-class proposer and `N` second-class proposers. \n- The first-class proposer has the final reordering power.\n- The first-class proposer’s transactions have priority over second-class proposers if the block is full.\n\nI think there will still be a pre-confirmation market for 3 reasons: 1. Middleware is easy to implement 2. If there's extra APY, people will pursue it 3. There's \u003e0 demand for pre-confirmation transactions willing to risk that their transactions may be reordered or denied if the block is full...",
        "created_at": "2024-10-06T14:07:31.436000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I do agree max block size adds an interesting angle to these designs. In this respect, MCP is better than FOCIL, as things are  symmetrical",
        "created_at": "2024-10-06T14:08:00.347000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "- About MCP, I still haven't really seen a design specifying how it could work in practice so it's difficult to comment, but I'm curious to know what you meant by \"things are symmetrical\"?\n\n- Yes, there are `n`  IL committee members and one proposer, and the proposer has the last look, reordering power and can stuff its block which is one of the main reason why it's unlikely IL committee members will be used for preconfs or valuable MEV txns imo  \n\n- About the three reasons: 1. Middleware is easy to implement I agree, but adoption is still not a given. 2. I agree, and that's why I think proposers opting into preconf middleware is likely because they're the ones that can sell valuable guarantees on both inclusion and state preconfs. 3. I don't agree, I still don't see why you wouldn't just use the mempool if you are ok with you txn being reordered or not included",
        "created_at": "2024-10-06T14:20:21.621000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "For 3, because using the mempool alone doesn't give you the pre-confirmation receipt, you need a third party to provide that. In this case, the pre-conf buyer -\u003e IL committee -\u003e middleware -\u003e pre-conf gateway. Then, the gateway or the committee returns the receipt to the buyer. The receipt claims that unless the block is full, the buyer's transaction is guaranteed to be included in the block",
        "created_at": "2024-10-06T14:26:05.423000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "right right I was just going back to: you can use the mempool (with no receipt or green tick but I mean at this point if you're not sure to be included you could just ask the wallet to send you a receipt optimistically as well) OR you can get a receipt from the proposer, which is much more valuable because you then know for sure you'll get included \n\nthe weird middle option (IL committee gives a receipt without strict inclusion guarantees) doesn't have value to me, but it's ok to disagree on that",
        "created_at": "2024-10-06T14:30:22.818000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "Just one more thought about FOCIL not being as good as MCP: I think it might be a bit unfair to compare a realistic design we are working on, vs an idealised protocol in which multiple magically simultaneously release their blocks in parallel chains, without conflict, with an ordering rule no one can take advantage and that solves MEV altogether. In that case yes, of course the latter idealised protocol is better but we just don’t know how to make it work in practice",
        "created_at": "2024-10-06T14:32:03.834000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e The only way there is positive profit to get from selling your inclusion list construction rights as a committee member is if there is no honest committee member and the proposer charges a monopoly price. Collusion is required, otherwise the price of such a ‘preconfirmation’ is 0 and there is no incentive for a committee member to engage with such a market. We do not see any collusion middleware on Ethereum today",
        "created_at": "2024-10-06T14:33:24.335000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I completely agree with this. I guess that was my way of saying MCP also enables easy selling pre-confirmation but without the final proposer's say, and I'm not arguing whether that's a good or bad quality",
        "created_at": "2024-10-06T14:38:49.535000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don’t understand this one. The way I see it, there are two types of parties: one that provides the pre-conf receipt and one that doesn’t. Here, we assume the proposer doesn’t provide the pre-conf receipt, and `x / n` IL committee members do. As a based rollup, I go to `x` for the pre-conf service, aiming to get the cheapest pricing.",
        "created_at": "2024-10-06T14:42:54.110000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e So first of all, you can get the same inclusion guarantees from sending your transaction in the public mempool as you can get from setting up a preconfirmation scheme with x/n IL committee members, so there is no reason one would want to set up such a preconfirmation scheme. If you were to set up such a preconf scheme, then the competition amongst the committee members would push the price of such a preconfirmation to zero, meaning there is no profit to be gained from participating in the preconf scheme.",
        "created_at": "2024-10-06T14:47:11.106000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "But the mempool can't offer the same guarantee: unless the block is full, if my paid transaction to the pre-confirmation gateway isn't included in the next slot, someone gets slashed (using the receipt as proof). I think this is where we disagree—whether there will be demand for such a market. I believe there will be",
        "created_at": "2024-10-06T14:51:19.426000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e I agree this is where we disagree 🙂 Why I say the mempool offers the same inclusion guarantees is that any valid transaction should be included anyway by the proposer or by the IL committee members (who are there specifically for this single task!). The proposers block is already invalid if it does not comply with the local inclusion lists. Applying slashing is unnecessary, how does it benefit a user in your eyes?",
        "created_at": "2024-10-06T14:54:47.815000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Don't have a strong intuition on what type of new product may emerge, but we can speak from first-hand experience that users do love fast response times and confirmations (eg L2s). I think, in this case, the most valuable use case is a based rollup using this to pre-confirm their batches. Today, not all proposers opt in for pre-confirmation, but adding an IL committee to the mix would be useful for them",
        "created_at": "2024-10-06T15:02:08.776000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e I agree that fast response times are great but the IL committee does not generate guarantees that are meaningfully different from the mempool, except for censored transactions of course",
        "created_at": "2024-10-06T15:19:55.357000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Our disagreement probably comes down to whether a probabilistic inclusion guarantee is useful, where unless the block is full, my transaction can get pre-confirmed a few seconds before the slot starts, signaling a high chance of inclusion",
        "created_at": "2024-10-06T15:30:26.360000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e I largely agree, but I think the following nuance is important. I think our disagreement comes down to whether a user may want a guarantee that the local IL member gets penalized if it does not uphold its promise to include the user in the local inclusion list instead of just using the 1 of N honesty assumption of FOCIL that at least one IL committee member will include the user’s transaction. I don’t see how this additional penalty would benefit the user.",
        "created_at": "2024-10-06T16:14:10.153000+00:00",
        "attachments": []
    }
]