[
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "I agree with Potuz that in block auction `N`, `IL` can only be included in `N+2` if we send `IL` at the `0s` mark. It's really the best we can do. However, I still think in slot auction, we can perform \"spot\" FOCIL. So, if we want to maintain the property that the builder knows what it bid for (whether it's block or slot), what if we move `IL` to the `11s` mark? What's the reason why the `IL` committee needs the same amount of time as the proposer to send a block?\n\nExample:\n- `N` at `6s`: builder reveals\n- `N` at `11s`: IL committee sends ILs\n- `N+1` at `0s`: builder sends bids\n- `N+1` at `0s`: proposer sends a block that commits to a builder_id\n- `N+1` at `3s`: attester verifies `N`'s payload\n- `N+1` at `6s`: builder releases payload and IL aggregates for `N+1`\n- `N+2` at `3s`: attester verifies `N+1`'s payload and IL aggregate",
        "created_at": "2024-07-01T03:52:36.643000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I bet TG is seeing two bulleted lists because you have a newline in (2), and it is auto-numbering them as bulleted lists rather than using the numbers you supplied (markdown style).",
        "created_at": "2024-07-01T05:06:03.367000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Moving IL to the 11s mark reduces the time of validation from 6s to 5s. And it makes it impossible to send bids over P2P if you want to participate in that slot but aren't sure if you can include the txs. There's always a trade-off is you put the IL committee before 0s",
        "created_at": "2024-07-01T06:10:46.512000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Agreed that forward FOCIL with m = 1 == 7547!",
        "created_at": "2024-07-01T06:29:09.115000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Was thinking more about the builder problem. This is a more fundamental problem, e.g., in APS designs, you would be purchasing the proposing rights not knowing what the IL will be at the time you have to make your proposal. But as owner of the proposing rights, you can always decide to sell the building rights, e.g., running mev-boost JIT to source a block from a builder. This is true of slot auctions too. It's not great for you as a proposer latency-wise perhaps, but you could make the argument that it's on you if you're unhappy having to include something you dislike.",
        "created_at": "2024-07-01T06:29:21.752000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Naive question but what does longer execution buy us? If we get x% longer time to execute, would we increase the gas limit by x% too? I think maybe not still, because of state growth, though I agree that relaxing any constraint always has positive side-effects. I think it would be useful to quantify the benefits of longer execution, so they can be weighed against eg short-term censorship resistance guarantees, which indeed you may need to \"pay for with time\", but imo it's not up to us to decide whether that's worth it, the question should be opened up.",
        "created_at": "2024-07-01T06:35:01.335000+00:00",
        "attachments": null
    },
    {
        "author": "kboom_ro",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hi, I'm following the thread with interest, have a question",
        "created_at": "2024-07-01T07:44:43.932000+00:00",
        "attachments": null
    },
    {
        "author": "kboom_ro",
        "category": "Cross-layer",
        "parent": "",
        "content": "is this related to adding the AA bundle in the block?",
        "created_at": "2024-07-01T07:45:05.571000+00:00",
        "attachments": null
    },
    {
        "author": "kboom_ro",
        "category": "Cross-layer",
        "parent": "",
        "content": "or just to allow the time for block producer to analise IL global topic and decide if they can include the payload or skip bidding this slot (buidler safety )?",
        "created_at": "2024-07-01T07:52:10.794000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "why is that? In principle, you could argue if the builder is not ready to include transactions and uphold censorship resistant properties of the network it shouldn't be a builder/participate at all in the first place? (assuming slot auctions here)",
        "created_at": "2024-07-01T08:54:52.377000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's not only about censoring. You can design the mempool so that a vast majority of the network has txs, but you can't require that every single person has them. The builder may be simply unable to build. Censoring is also, like it or not, part of the design. Institutions may want to opt on following the rules of the jurisdiction they are located. And I am counting on some institutions to submit P2P bids to set the floor of the auction. But this can't happen if they don't know in advance that they will be able to build. \u003c@486501030046203915\u003e reselling doesn't work in the current design cause it has to be the builder who signs the payload. If you have an in-protocol mechanism of reselling that will solve it, but I'm not aware of any way to do this",
        "created_at": "2024-07-01T10:12:28.167000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@725415098331430932\u003e above I'm thinking on the IL aggregate consisting only of the addresses a-la 7547. If you broadcast the full txs then you can remove the argument about not having them, but that also adds yet more latency to block propagation",
        "created_at": "2024-07-01T10:17:41.414000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "I agree you can't make sure the builder has seen all txns, in FOCIL we account for this with a parameter delta, allowing some leeway to handle cases where the builder is honest but can't include ***all*** transactions specific by the IL agg, simply because he missed/didn't see some of them\n\nAbout censoring being part of the design, I think I fundamentally disagree and we shouldn't design for institutions being able to opt in or out according to their jurisdiction. We should design so institutions make sure they can uphold CR properties, if they can't and are not willing to move for example, for me that's on them. \n\nAbout broadcasting full txns, I don't think that's viable for a couple of reasons, agree we should try to make it with with aggregates/summaries",
        "created_at": "2024-07-01T10:46:05.392000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm not saying builders should opt out of including the txs, but they should definitely be able to opt out from bidding altogether without knowing exactly what the constraints of the block they are supposed to build are.",
        "created_at": "2024-07-01T10:49:38.533000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "sure sure, yeah I understood but I still disagree 🙂",
        "created_at": "2024-07-01T10:50:22.760000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's opinionated for sure but more of a feature than a bug imo, it might help ensuring most builders participating on the network are fundamentally ok with including all transactions without exceptions",
        "created_at": "2024-07-01T10:52:09.728000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e reselling doesn't work in the current design cause it has to be the builder who signs the payload\nYes, reselling doesn't work in block auctions, but in any case in block auctions you *need* the builder to know the contents of the IL in order to create their payload and place their bid. So that's a no-go either ways to have the auction before the IL is known.\n\nFor slot auctions, you can have execution proposers sell their building rights, such that the builder knows the contents of the IL when they are building. These are just facts about the constructions.\n\nThe second question is, is it good enough for the *builder* to know the IL, while the *execution proposer* may not know the IL contents? First, it is not a theoretical impossibility, we *can* design slot auctions such that the execution proposer knows the IL before bidding, but the argument is that we *may not want to* because we shave some seconds off the execution budget. So assuming we do not want to shave these seconds off, then we should ask ourselves whether we are fine with the *execution proposers* bidding *before the IL is known*. I think there are arguments for it. First, as \u003c@725415098331430932\u003e points out, this favours execution proposers who are not censoring. Second, if they are censoring, they may still be comfortable delegating construction to a builder.",
        "created_at": "2024-07-01T10:59:44.704000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "We're having a lot of discussions in parallel and this dilutes some arguments:\n\u003e Yes, reselling doesn't work in block auctions,\nIt doesn't in slot auctions either, the builder signs the block no matter what",
        "created_at": "2024-07-01T11:00:55.680000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e Censoring is also, like it or not, part of the design.\nSome people may consider that a bug, I am not super opinionated about it, but I would point out that it's not an inevitability, as evidenced by IL constructions which bind a block producer against their will.",
        "created_at": "2024-07-01T11:01:28.716000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "You can resell off-protocol today, for what you describe you need an in-protocol method of selling, which we do not know how to do",
        "created_at": "2024-07-01T11:01:50.273000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e ask ourselves whether we are fine with the execution proposers bidding before the IL is known\nI do agree that at least this is a contentious question rather than a practical impossibility.",
        "created_at": "2024-07-01T11:03:29.838000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "A slot auction involves execution proposers bidding for the right to propose the execution block, without pre-committing to the contents. The auctioneer is the beacon proposer, who selects a winning execution proposer. This is \"in-protocol\", but can be bypassed by the beacon proposer committing to an execution proposer for a bid value different than what is really reported to the protocol.\n\nAfter winning the slot auction, an execution proposer can *sell* (not re-sell, since it is the first sale) the building rights to a builder, using MEV-Boost for instance. If you want to do this in-protocol, you can add ePBS to the pipeline, but now you have three rounds in the slot (beacon proposer commits, execution proposer commits, builder delivers).",
        "created_at": "2024-07-01T11:05:02.119000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "We do not know how to implement this, that's what I am saying. The only way to do JIT slot auctions that we currently know how to implement is by having ePBS and removing the blockhash from the bid. This still requires the builder to sign the payload and have the builder committed to the CL block.",
        "created_at": "2024-07-01T11:06:32.062000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Any other design needs to be specced out, at least myself I do not know how to do it",
        "created_at": "2024-07-01T11:06:46.849000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "I wouldn't call builder the winner of the slot auction, I would call them execution proposer. I think this is where the confusion arises.",
        "created_at": "2024-07-01T11:07:32.611000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "ok, whatever name you want to call them, we do not know how to implement the execution proposer selling of their rights, the execution proposer needs to sign the block in the only implementation I know it's currently feasible",
        "created_at": "2024-07-01T11:08:13.913000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "any in-protocol mechanism for the execution proposer to deal with a builder requires designing, and it seems like a very hard problem without increasing the slot size",
        "created_at": "2024-07-01T11:08:59.553000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ok, so I claim that we know a mechanism, we're just not keen on using it. It's a bit of a stupid one, so I think more useful as a thought experiment, but basically doing ePBS twice. That's the in-protocol version. Otherwise, it's also possible to do in-protocol slot auctions, and let the execution proposer use MEV-Boost as is for the building rights allocation and the delivery of the payload. I think it's also fair to consider this since from the protocol's perspective, the job is done as soon as an execution proposer is selected, what they do at the back is between them and their conscience 🙂",
        "created_at": "2024-07-01T11:11:35.937000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "(I am not arguing for a different design, I am just trying to prove the claim that you can have slot auctions where the execution proposer doesn't know the IL contents while they bid, without breaking everything as much as you would in block auctions, and potentially not shutting out censoring execution proposers from the auction)",
        "created_at": "2024-07-01T11:13:33.717000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e but basically doing ePBS twice. \nThat's what I meant by:\n\u003e and it seems like a very hard problem without increasing the slot size",
        "created_at": "2024-07-01T11:35:23.227000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "As for using Mev Boost, I'm absolutely fine for that part, and that's what I propose for sure, but still the execution proposer signs the block so it doesn't solve the original problem. I think we have a fundamental problem with FOCIL and ePBS in either slot or block auctions that we do not know how to solve except if you force builders/execution proposers to bid without knowing the constraints of the block. This changes substantially not only the dynamics of the auction but also the market and risks aspects of it and as such it is a substantial change.",
        "created_at": "2024-07-01T11:38:09.623000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "The fundamental problem is indeed that for the IL to be built, you need the IL proposers to have executed block `N`. If you want the IL to be built before the auction starts, then you need to accept that you can't delay execution until after the auction has concluded. So there is an inherent trade-off here.\n\nWhat's interesting is that we know for sure that the people bidding in any auction will have executed block `N` by the time they start bidding, but ofc what we want is for *validators* to not have to execute `N` until as late as possible.",
        "created_at": "2024-07-01T11:45:36.215000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e so it doesn't solve the original problem\nWhat is \"the original problem\" here? That they may want to censor or that they are bidding in the slot auctions possibly without knowing the contents of the IL?",
        "created_at": "2024-07-01T11:46:09.652000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "yes, in that sentence I am referring to that problem. \n\nI think we have settled in the tradeoff here. Assuming it is the builder who reveals the IL aggregate together with the payload. We have exactly 6 seconds until the next proposer in which the IL committee can send their ILs. If they do it  6-x seconds after payload, then \n- The time for execution validation required for all validators has decreased from 6  by x seconds\n- The time for builders that want to bid knowing the contents of the IL consists of x seconds (minus the propagation time minus the validation time of the IL). \nOne increases with x, the other decreases. This does not seem easy to me",
        "created_at": "2024-07-01T12:00:23.236000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thinking still loudly about this: Not knowing what the IL contents are lends itself to a cheap attack against the builder from one single IL committee member: Send transactions that are high paying and are incompatible with one that is very likely to be in the mempool for IL inclusion. The builder will likely have simulated the block with this transaction and bid accordingly, but would have to redo the block and remove this tx if it is forced to include the IL one.",
        "created_at": "2024-07-01T12:12:13.373000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I bet TG is seeing two bulleted lists",
        "created_at": "2024-07-01T12:13:54.708000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Can you give an example of \"incompatible txs\"? You mean a case where the attacker sends a public transaction in the mempool, but then sends another incompatible tx via the IL, e.g., same nonce, so only one of the two can be included?",
        "created_at": "2024-07-01T12:32:45.598000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "At the very basic level it can only be another transaction from the same address and the same nonce, but with Account Abstraction it could be any other transaction that drains the address of this other tx. So if it's included before the IL tx for example the IL tx can't be executed, and if it's included after, then the arbitrage is lost",
        "created_at": "2024-07-01T12:37:43.196000+00:00",
        "attachments": null
    },
    {
        "author": "barnabemonnot",
        "category": "Cross-layer",
        "parent": "",
        "content": "Right but as a user you still would have had to \"allow\" (maybe ex ante) this other tx to drain your funds. If an IL proposer crafts a tx to drain their own funds and create a headache for the builder, I feel like there should be an IL enforcement policy that makes it harmless, but need to think about it more.",
        "created_at": "2024-07-01T12:50:48.277000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "the only way to find this out is at runtime, so this more or less makes it equivalent to the tx invalidation issue of 7547 and forward ILs",
        "created_at": "2024-07-01T13:00:29.185000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "how effective would this attack be? Supposedly builders are dealing with a lot of spam transactions and have developed tools to simulate quite fast? \n\nIt sounds like a long enough time buffer between the moment the builder receives local ILs and the moment it has to release the payload and IL agg would alleviate this concern? or am I missing something?",
        "created_at": "2024-07-01T13:14:11.971000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This seems to be an all or nothing: if the arbitration is the sole source of the bid value, then you lose the full bid value because either you lose the arbitrage or you lose payload validity",
        "created_at": "2024-07-01T13:32:27.892000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "the buffer is not when you need to reveal the payload, but rather the time between seeing the IL and setting the bid value",
        "created_at": "2024-07-01T13:33:09.132000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "ah yes you're right, but assuming we have a long enough buffer between seeing the IL and setting bid values it should be largely mitigated?\n\nYou could also imagine a builder pricing this uncertainty in its bids to play on the safe side and bid a bit lower\n\nI wonder if after these discussions, and by making some assumptions (e.g., it's ok not knowing the IL contents, but we can revisit after if we find other attacks like the one you mentioned), in a slot auction context, we could retry to write timings and what it would look like\n\nmaybe I'm too optimistic but I do think the has a decent chance of working out",
        "created_at": "2024-07-01T13:41:54.949000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sorry, I caught up now. Being in the western timezone isn't great for these conversations. I have two follow-up questions.\n\n\n\u003e Moving IL to the 11s mark reduces the time of validation from 6s to 5s\n\nReducing the time to 5 seconds isn't for everyone; it's only for IL committee members. I don't see why they need to verify IL transactions as they come in. They can just verify the IL aggregate. Attesters can \"track\" first, then \"verify\" later.\n\n\u003e impossible to send bids over P2P if you want to participate in that slot but aren't sure if you can include the txs\n\nYeah, I was worried about this too. I thought 1 second might be enough for p2p, but I'm not sure. There are a lot of trade-offs in place, like committee size and IL size.",
        "created_at": "2024-07-01T13:43:26.280000+00:00",
        "attachments": null
    }
]