[
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Working on a very early draft of the FOCIL Fork Choice spec, one open question is how a block that fails the EVAL function should be treated. I see a few options:\n1. Mark the block as invalid (obviously a bad choice, as the node can easily stall).\n2. Mark the block as not importable (this is similar to the blob sidecar's import rule).\n3. Mark the block as importable but filtered under `get_head`.\n\nThere seem to be some tradeoffs between 2 and 3, and I’ve sort of forgotten the rationales for both options. Do you guys have a rough guess at what would be best for FOCIL here? \u003c@520034910149410861\u003e \u003c@755590043632140352\u003e",
        "created_at": "2024-09-16T15:21:33.834000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "IMO a block that doesn't satisfy the IL should be treated like a block that doesn't satisfy DA",
        "created_at": "2024-09-16T15:43:57.500000+00:00",
        "attachments": null
    },
    {
        "author": "kboom_ro",
        "category": "Cross-layer",
        "parent": "",
        "content": "Could we keep rewards accounting as a nit / functionality, even though  in a first version IL participation would be altruistic (zero rewards)? I'm asking in the perspective of sometime in the future having a light staking tier (à la rainbow-staking) that would participate in CR and we might reconsider the incentivization of that role..",
        "created_at": "2024-09-16T18:06:07.018000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think what you're saying is to have rewards accounting behave as a no-op so later it can maybe be used by other EIPs like rainbow staking. I think we want to avoid feature leaks here. Only add things as needed and scope it under the same EIP. We don't want to bloat the protocol with placeholders...",
        "created_at": "2024-09-16T18:14:18.779000+00:00",
        "attachments": null
    },
    {
        "author": "kboom_ro",
        "category": "Cross-layer",
        "parent": "",
        "content": "Makes sense. Although, in that spirit, rewards like whistleblower are also placeholders that just go to proposers. Would it matter the dimension of the placeholder related bloating, or is just a matter of principle, like avoiding placeholders all together, as good practices ?",
        "created_at": "2024-09-16T18:20:06.613000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is a good question, I don’t have a solid answer except that the whistleblower was there during the phase 0 beacon chain, essentially designing the whole protocol from scratch, which is different from adding a feature on top of something and requiring an EIP or strong rationale. Whoever added the whistleblower line in the Python code probably thought it could be extended to proof of custody later or for something else, but the rationale isn't clear",
        "created_at": "2024-09-16T18:25:38.052000+00:00",
        "attachments": null
    },
    {
        "author": "kboom_ro",
        "category": "Cross-layer",
        "parent": "",
        "content": "I understand ... by now it's tech debt probably. I get your point though about only adding things that are needed and scoping in that direction.",
        "created_at": "2024-09-16T19:14:09.522000+00:00",
        "attachments": null
    },
    {
        "author": "kboom_ro",
        "category": "Cross-layer",
        "parent": "",
        "content": "To conclude my query on IL rewards, from what I read in this channel and in different posts, as part of the research for the EPF project I work on, which is prototyping in-protocol delegations, it seems to me that  if we would ever have light consensus participants, CR would most likely be their prerogative, as it fits well with a role, lighter than FFG participation, but still meaningful to the protocol.\nIn this idea, after Option 1 (altruistic participation) is implemented, splitting the priority fee would be the de facto thing to do if we were to incentivize IL committee members (who might be light participants one day), \u003c@725415098331430932\u003e?",
        "created_at": "2024-09-16T19:31:40.439000+00:00",
        "attachments": null
    }
]