[
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "First 👋🏻",
        "created_at": "2024-02-23T14:42:48.878000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@755590043632140352\u003e What is the \"free data availability\" that you are referring to in your latest response to Unconditional Inclusion Lists?",
        "created_at": "2024-02-23T15:17:21.977000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e We want to prevent censoring even if the builder decides to avoid and miss the block, by making the IL remain in place until eventually one builder includes the censored txs.\nThis is an interesting debate worth having.  There are two options it seems:\n1. Let the builder know in advance that they will have to publish a censored transaction.\n2. Surprise the builder after they have committed to building (and put up whatever bond) that they need to publish a censored transaction.\nFor (1), builders can just choose to not participate when they see they would be forced to include a censored transaction.  For (2), builders have to either not censor or be financially penalized.",
        "created_at": "2024-02-23T15:19:44.689000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "(2) has the potential to completely drive censoring builders out of the ecosystem because they'll go broke if they routinely get penalized for censorship.  However, until that happens you may end up with longer runs of censorship while we beat the censorious builders into submission.",
        "created_at": "2024-02-23T15:20:39.080000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "How ... firm, I guess, are these preferences? I want to avoid turning this too much into a legal/political policy question, as that's largely outside the scope of this Discord server and those specifics should be decoupled from a technical design anyway.\n\nBut for\n\u003e However, until that happens you may end up with longer runs of censorship while we beat the censorious builders into submission.\n\nthat's a very specific goal, and if for `${DELIBERATELY_UNSPECIFIED_HERE}` reasons, builders absolutely just will not stop censoring, whether you agree with those reasons or not, and would rather not exist than not censor, is the preferred outcome here to not have those builders even be a choice?",
        "created_at": "2024-02-23T15:23:30.449000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "If builders choose not to participate and refrain from bidding, the EL fallback already exists, no?",
        "created_at": "2024-02-23T15:24:18.676000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes, that is the preferred outcome.  Drive censorious participants out of the Ethereum ecosystem.  There are lots of blockchains out there that are friendly to censorship, Ethereum and Bitcoin are designed specifically to fight censorship.",
        "created_at": "2024-02-23T15:25:52.538000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ok",
        "created_at": "2024-02-23T15:26:10.537000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "The question I have is which option (1 or 2) is more likely to drive them away entirely?",
        "created_at": "2024-02-23T15:26:40.547000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I suspect 2, but I could see an argument that (1) will be just as effective long term because censorious builders will not be able to compete financially with non-censoring builders who get more opportunities to produce blocks.",
        "created_at": "2024-02-23T15:27:10.955000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "(2) seems more complex and finnicky timewise, no?",
        "created_at": "2024-02-23T15:27:58.707000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "it requires more moving parts to function in a baseline way, while (1) is sort of passive-failure-mode-safe",
        "created_at": "2024-02-23T15:28:40.314000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The IL can have garbage tx, that the proposer includes and at the same time he has a much cheaper tx that gets included in the main body. Then the block has forever a transaction that could not have been executed (say for example because of nonce) and didn't pay gas, but it's there in the nodes forever. That's the free DA issue. I can build a rollup with zero fees over this",
        "created_at": "2024-02-23T15:28:59.023000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Unfortunately, I have a sneaking suspicion that they will still censor their blocks, but they'll publish the IL with censored transactions or the block with censored transactions.  The whole \"block builders must censor but can build on blocks that don't censor\" thing is built on nonsensical legal gymnastics in the first place, and adding another backflip in I don't think will phase them.",
        "created_at": "2024-02-23T15:29:14.081000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ah, I see it.  Thanks!",
        "created_at": "2024-02-23T15:29:42.030000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Next-block IL doesn't have that same problem?",
        "created_at": "2024-02-23T15:29:57.592000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "In the above regards I think the current approach is quite solid",
        "created_at": "2024-02-23T15:30:04.953000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "even this block IL wouldn't have any problem \u003c@301186049323958275\u003e what I am pointing out is that to avoid this problem you never commit actual txs to the block, only their summary. So censoring builders won't have any trouble including these since they aren't committing to a transaction they want to censor.",
        "created_at": "2024-02-23T15:31:16.018000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "In general, I'm sympathetic to this feature; I'm mostly concerned about the technical complexity and increased design coupling this creates, so that's my general metric for evaluating different options. Furthermore, haven't checked (and I should/will) the last 2-3 weeks of progress on this, but at least in the last few months some proposals have included kind of \"advisory\" approaches, which seems like the worst compromise: technical complexity while still relying on some nonexistent social contract to enforce.",
        "created_at": "2024-02-23T15:31:38.707000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "what are you referring to about this \"advisory\"?",
        "created_at": "2024-02-23T15:32:28.182000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "You convinced me the free DA issue is a problem and now you say that it isn't a problem.  Consider me sufficiently confused.  😅",
        "created_at": "2024-02-23T15:32:39.436000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "non-enforced, at least according to one summary of some options (which included a discussion of spilling into next block, etc) about 3 weeks ago",
        "created_at": "2024-02-23T15:33:09.026000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "that was one distinction/category drawn",
        "created_at": "2024-02-23T15:33:17.121000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "and yes, while I think the design for ILs is quite solid and the things that need to be meassured and finished up are very minor issues, I do believe that the technical difficulty of implementing this and testing it will prove them impossible for this year fork, thus I would advocate for more research in ePBS that includes this.",
        "created_at": "2024-02-23T15:33:28.176000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Nah, I think there is quite some consensus about enforced lists, If the discussion goes back to non-enforced vs enforced then at the very least we will be up in arms",
        "created_at": "2024-02-23T15:34:07.174000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e thus I would advocate for more research in ePBS that includes this.\n\nthis as well. Much, though not all to be fair, of the complexity is involved with how to make this interact with the Builder API specifically. So part of my hesitance in more full-throatedly supporting prioritizing this in a builder API context is, how much of this could be resolved in a more simple/elegant way by tying it with ePBS",
        "created_at": "2024-02-23T15:35:02.650000+00:00",
        "attachments": []
    },
    {
        "author": "tersec",
        "category": "Cross-layer",
        "parent": "",
        "content": "ok",
        "created_at": "2024-02-23T15:35:31.096000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The problem of free DA was solved by Vitalik's idea: not sign and commit to transactions, just to their list of addresses. What I pointed in your ethresear.ch post is that you wanted to force the builder to broadcast censored ILs, but that will never happen, cause the IL that gets broadcast with the block is not the full list of txs, just the list of addresses. The txs go in a sidecar signed by the proposer, not the builder.",
        "created_at": "2024-02-23T15:36:35.907000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "The idea being that the transaction bodies are not stored in the network long term, they are transient, just long enough to come to consensus, and then discarded?",
        "created_at": "2024-02-23T15:37:57.887000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Definitely, ILs are an integral part of any serious ePBS proposal, and in particular these ones are completely compatible as of today, with ePBS. If we are admitting that this goes into next year, then I would advocate for ePBS instead of this",
        "created_at": "2024-02-23T15:38:17.057000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "So any non-included IL transactions aren't required to validate history, instead only required as part of the consensus algorithm for deciding in the moment whether to attest to a slot or not?",
        "created_at": "2024-02-23T15:38:41.845000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes and no, if the proposer so decides, he can broadcast different txs and then they will be discarded. But the main idea is simply that even if the proposer only sends one set of valid txs, they are not committed anywhere, so you cannot rely on their DA, unless they have actually been included and therefore paid gas already. But yes you are right, these txs, those that are invalid or those that aren't included because some other tx got included with the same nonce, will be dropped",
        "created_at": "2024-02-23T15:39:54.927000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "exactly yes: attesters must attest that they saw at least one valid IL",
        "created_at": "2024-02-23T15:40:18.315000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "but they don't say which txs they saw",
        "created_at": "2024-02-23T15:40:24.590000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "What is the penalty for claiming that you never saw the inclusion list?",
        "created_at": "2024-02-23T15:41:22.602000+00:00",
        "attachments": []
    },
    {
        "author": "mikeneuder",
        "category": "Cross-layer",
        "parent": "",
        "content": "the block is not valid in the fork-choice view without an accompanying IL",
        "created_at": "2024-02-23T15:43:34.689000+00:00",
        "attachments": []
    },
    {
        "author": "mikeneuder",
        "category": "Cross-layer",
        "parent": "",
        "content": "so it would be equivalent to voting for an invalid block",
        "created_at": "2024-02-23T15:43:44.397000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ah, an IL is required even if empty?",
        "created_at": "2024-02-23T15:44:01.590000+00:00",
        "attachments": []
    },
    {
        "author": "mikeneuder",
        "category": "Cross-layer",
        "parent": "",
        "content": "right",
        "created_at": "2024-02-23T15:46:33.677000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "```\n1. The slot n proposer builds an inclusion list published alongside their block.\n2. The transactions in the inclusion list are either:\n    a) included in the slot n execution payload,\n    b) included in the slot n+1 execution payload, or\n    c) appended (in order) to the end of the slot n+1 execution payload.\n3. The validity of the slot n+1 block depends on the existence and satisfaction of a signed inclusion list summary.\n```The IL mentioned in (1) is just the transaction hashes, no transaction preimages published?",
        "created_at": "2024-02-23T15:51:00.788000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Is a little more involved than this",
        "created_at": "2024-02-23T15:53:51.791000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "For slot n:",
        "created_at": "2024-02-23T15:53:56.862000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "the proposer builds a block and broadcast a sidecar with an IL, the IL contains a list of addresses only and a full list of transactions from those addresses, he signs only the list of addresses. \n\nLet's forget about the payload of this block for a minute, validity of the consensus part of this block is subject to having seen at least one such sidecar, such that 1) the transactions addresses actually match up the addresses in the signed list, 2) the transactions are currently valid, they can be executed right now at the beginning of the block in slot n, 3) they have enough funds to pay gas even if this block would increase the base fee by the maximum.",
        "created_at": "2024-02-23T15:56:14.628000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Now for slot n+1",
        "created_at": "2024-02-23T15:56:19.848000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "What do you mean by \"addresses\" here?  Sender addresses?",
        "created_at": "2024-02-23T15:56:56.413000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "the builder of the payload for slot n+1 has seen such a full IL, both transactions and list of addresses. Therefore we now know that those tx are available. The validity of the execution part of the block in n+1 (the payload) is subject to having included all transactions in the IL that weren't already included in the previous block",
        "created_at": "2024-02-23T15:57:36.261000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "yes",
        "created_at": "2024-02-23T15:57:38.846000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Why sender addresses rather than transaction hashes?",
        "created_at": "2024-02-23T15:58:16.900000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "because tx hashes commits to a particular tx and you can use that for DA",
        "created_at": "2024-02-23T15:58:54.788000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "we do not want to commit to transactions",
        "created_at": "2024-02-23T15:59:05.626000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Would the system work just as well if you commit to recipient address?",
        "created_at": "2024-02-23T15:59:31.797000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Why commit at al if you aren't going to commit to something specific?",
        "created_at": "2024-02-23T15:59:42.466000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "No, sender address is what makes the system work, a tx from a given address that was valid now, may not be valid in n+1 only if there was another from the same address already included in the block n",
        "created_at": "2024-02-23T16:00:09.989000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ahh this is an interesting question, there are two approaches",
        "created_at": "2024-02-23T16:00:32.697000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "That feels fragile because we have discussed proposals in the past (and there remain open EIPs) that propose other things that can make a transaction become invalid.  This is further complicated by AA where external changes may cause a transaction to become invalid.",
        "created_at": "2024-02-23T16:01:06.349000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "in the first approach I had for my ePBS PR, there was zero commitment in the beacon block, the proposer is free to send completely disparate list of addresses and txs, and then the builder will include whatever he wants in the next slot as long as it satisfies one of the available ILs",
        "created_at": "2024-02-23T16:01:23.626000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "It feels like we should not *depend* on transactions only being able to become invalid if the signer signs a second transaction.",
        "created_at": "2024-02-23T16:01:41.691000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'll repost here something I just wrote on TG cause we are repeating more or less the same things",
        "created_at": "2024-02-23T16:02:21.803000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "So for those that are new in the channel: The reason we commit to one summary is that otherwise the proposer can extract MEV during his own slot and sell an IL to the next builder to include in his own block. \n\nOn the other hand, this makes a problem that when checking IL availability the attester needs to know that it  has a valid IL for the summary committed in the block. \n\nConversely, if we didn't commit anything, then the summary and IL would go in a sidecar that can be self-checked, and then the builder can choose whatever summary he wants to include in the next block. This is much easier to verify. It has some market advantages in that the proposer can't sell access to his IL, since no one can actually trust him. But has the problem that the proposer can negotiate off-band with the next builder as described above. \n\nThe attack that I am worried now is that validators have received an IL, kept it, and then when the block arrives it comes with a different summary. This forces validators to start requesting ILs from peers and this may lead to re-requesting the block by not importing it on time with a valid IL",
        "created_at": "2024-02-23T16:02:41.633000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "I will never understand why people like to use Telegram.  🤯",
        "created_at": "2024-02-23T16:02:45.518000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I am arguing the same on TG Lol",
        "created_at": "2024-02-23T16:02:58.309000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hypothetically, could a proposer create two transactions from the same address, one that they know will be censored and one that they know won't be censored, and sell the IL with the uncensored transaction in it to censoring builders, while broadcasting the IL with the censored transaction publicly?",
        "created_at": "2024-02-23T16:06:21.409000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "yes",
        "created_at": "2024-02-23T16:07:10.912000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Interesting. What would be the motivation behind this? We assume `cTX` has a higher price than `ucTX`, proposer collects the profit and the builder doesn't get in trouble,  but why would the transaction sender do this",
        "created_at": "2024-02-23T16:30:47.411000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "The proposer can just construct both transactions themselves as a way to essentially run a racket against censorious builders.  This doesn't bother me, I just wanted to make sure I understood.",
        "created_at": "2024-02-23T16:31:42.817000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes. I think the proposer can use this strategy to mess with the builder. Like point 2 you mentioned above. It also doesnt bother me. I think it's a feature, not a bug",
        "created_at": "2024-02-23T16:34:00.368000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "well, if it still allows this sort of markets then it furthers the point that not committing to the beacon block is probably better",
        "created_at": "2024-02-23T17:27:11.682000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "it has less block-splitting issues and is much easier to pipeline IL availability validation",
        "created_at": "2024-02-23T17:27:33.211000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@415109946682769408\u003e can we move \u003c#874767108809031740\u003e to cross-layer as well? Actually there's a few that should be cross-layer",
        "created_at": "2024-02-23T17:29:30.938000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thinking more... I'm more worried about splitting than not committing to the summary. We know what will happen by not committing to the summary, but splitting is a big unknown. Remember, that's what motivated the blob sidecar to include header at the first place",
        "created_at": "2024-02-23T18:49:40.187000+00:00",
        "attachments": []
    }
]