[
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think this is a somewhat unfair complaint in this case. IL research has been public since all the way back in 2021, with most meaningful research outputs being immediately put on ethresearch for discussion. Someone wishing to follow the conversation can almost pick any ethresearch post and find the linked material there. There doesn't need to be a discord channel for people to be informed and/or participate, nor does there need to be (imho) a public history of all discussions, as long as design decisions are sufficiently documented in what is published (which I believe to be the case here)",
        "created_at": "2024-02-27T07:40:56.139000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "The full IL has to be returned to the relay together with the SignedBlindedBeaconBlock, or at least gossiped in advance. Either way, the relay *has to* have a valid IL before releasing the block, or it just cannot guarantee that releasing the block will lead to it becoming canonical",
        "created_at": "2024-02-27T07:56:47.236000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "What is the argument in favor for keeping the discussion private and just publishing results/updates periodically?  That *feels* strictly worse than just having the discussion in public, but maybe I'm missing something.",
        "created_at": "2024-02-27T08:21:32.878000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "If we want to preserve the fact that the mev-boost commitment from the proposer can only be reneged through a slashable fault, we should couple IL and beacon block as p2p objects, otherwise this attack is possible:\n- proposer correctly returns a valid signed blinded beacon block and a valid matching IL to the relay, which gossips both\n- meanwhile, the proposer has separately gossiped a different *invalid* IL. Most validators see that first (since they don't check validity for propagation) and don't accept/forward the valid IL gossiped by the relay. Once their EL fails to validate it, they conclude there's no valid IL and do not vote for the block. \n\nIt does not lead to same-slot unbundling, and it's not an attack that makes much sense for the proposer tbh, but still worse than the status quo, where to do this you actually have to do block equivocation and get slashed",
        "created_at": "2024-02-27T08:25:32.327000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't find it strictly better to force people to work in a noisy discord channel, particularly at research stages where only a few people are actively involved. Should we be recording and publishing every call with 2 people too? \nAs far as ILs specifically, there has never been even a telegram channel for it for the longest time, just sporadic work done mostly by individuals. There has been a telegram channel for the EIP just as of October, which maybe could have been a discord channel since the beginning (even then, Mike has published multiple updates and talked about them on ACD, and we have had a breakout call for it). Other than that, I don't think there is any ground to claim that IL research has been done in secret. People that wish to participate should not be required to read years of message history, but they should be expected to read a few ethresearch posts or other relevant resources that are easily available, and I don't see anything wrong with that",
        "created_at": "2024-02-27T08:45:18.628000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Of all the things you can claim about the Ethereum research ecosystem, saying that research is not done in public seems quite the reach tbh",
        "created_at": "2024-02-27T08:47:18.315000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The relay can easily protect himself from this by listening for ILs even if he has one. If he sees a signed one that is invalid he just doesn't reveal",
        "created_at": "2024-02-27T09:01:11.985000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "the proposer can time the release of the invalid IL to make it hard for the relay to see it before it releases. It's not much of an attack and not easy but possible",
        "created_at": "2024-02-27T09:03:38.605000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't think that's possible since the relay can immediately gossip the IL and still not assemble the block. If he hasn't seen another IL in say 200ms then he knows his IL is the first one. But yeah adding another delay sucks, but I thought relays already do this for equivocations anyway",
        "created_at": "2024-02-27T09:07:03.368000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "ah that's a good point. You also wouldn't actually need the extra delay in the good case where the proposer just gossips the IL in advance",
        "created_at": "2024-02-27T09:12:53.239000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The thing that is worrying me most currently is committing the summary to the block. It seems that the proposer can easily get clients to re-request blocks or ILs over RPC and cause a hard split in the head view (instead of just an LMD one). The main advantage was that the proposer couldn't sell an IL to the next builder, but it seems it can if he wants to enable censoring builders. To me this opens a can of worms cause if we don't commit then there's no argument for not being top of n+1 enforced.",
        "created_at": "2024-02-27T09:19:04.544000+00:00",
        "attachments": []
    },
    {
        "author": "mariusvanderwijden",
        "category": "Cross-layer",
        "parent": "",
        "content": "For anyone wanting to prototype ILs, I implemented two basic functions in geth `engine_setLocalAccounts` and `engine_getLocalTransactions` \nwhich can be used to construct ILs by the local EL. \n\nNote: this does not include any logic for validating Inclusion Lists or Proofs etc.\nhttps://github.com/ethereum/go-ethereum/pull/29102",
        "created_at": "2024-02-27T16:35:26.708000+00:00",
        "attachments": []
    },
    {
        "author": "mariusvanderwijden",
        "category": "Cross-layer",
        "parent": "",
        "content": "I am aware that this was proposed way earlier, \nI just think that none of the drawbacks outweigh the benefits (no hard fork necessary, easy to implement, builders can opt-out, censoring builders will loose market-share, no benefit of multiple proposals in a row, no free data availability)",
        "created_at": "2024-02-27T16:40:54.001000+00:00",
        "attachments": []
    },
    {
        "author": "mariusvanderwijden",
        "category": "Cross-layer",
        "parent": "",
        "content": "I just don't see the benefit of EIP-7547 over a simple design since:\n- Validators can opt out of the scheme (by not including ILs)\n- Block-producers/Relays can opt out of it  (by not bidding on blocks, which will result in the rational choice for validators to not use it)\n- Producers that produce multiple blocks in a row can include high-paying or valuable transactions in the IL and low paying transactions for the next producer\n- The EIP requires extensive changes to the EL and CL consensus and P2P\n- The transactions are \"tagged on\" which means they do not act to the gas limit, which allows validators that control the list to reap outsized rewards\n\nEssentially from my point of view we're adding a bunch of new mechanisms that might or might not work, since the equillibrium is to just not use the mechanism, but the mechanism itself requires significant changes to both EL and CL",
        "created_at": "2024-02-27T16:52:04.067000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Block producers/relays can opt-out, but the people they are engaged with aren't the ones who generate the IL so their opting out doesn't apply pressure to those producers who use it.",
        "created_at": "2024-02-27T17:01:51.346000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "If I'm an annoying altruistic anti-censorship solo staker, I can generate an inclusion list and force whoever comes after me has to include censored transactions.  Block producers/relays not bidding on the next guy's block makes me happy and want to validate harder.",
        "created_at": "2024-02-27T17:03:04.550000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's a double-edged sword, an entity running validators and got assigned for slots `n` and `n+2` could also take advantage of this to increase profitability for `n+2` block by filtering builder options of `n+1` and take it for `n+2`. But again, some of us would argue this is a feature, not a bug",
        "created_at": "2024-02-27T17:16:03.138000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "https://ethresear.ch/t/inclusion-list-eip-7547-end-to-end-workflow/18810\n\nSorry to change the topic. I posted some diagrams for the currently committed version. Im more leanings towards the non-committed version due to the splitting attack mentioned above. How likely would we see the `n` proposer and `n+1` builder colluding? We are talking about non-client software here. The support is really hard both practically and technically imo",
        "created_at": "2024-02-27T17:29:17.400000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@520034910149410861\u003e what's the latest to avoid the need for the previous block in the EL, are you still keeping the list of addresses in the EL state?",
        "created_at": "2024-02-27T17:33:41.449000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "So there's a contract that keeps them, are we keeping only the last block right?",
        "created_at": "2024-02-27T17:34:19.804000+00:00",
        "attachments": []
    },
    {
        "author": "rjected",
        "category": "Cross-layer",
        "parent": "",
        "content": "why does this seem like it would require extensive changes to the EL? I can see the CL/CL p2p side, but the EL side seems simple and isolated to the engine",
        "created_at": "2024-02-27T19:14:33.789000+00:00",
        "attachments": []
    }
]