[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think you're not reading the case about not sending the tx to the mempool, there's no need to have collusion, this is about having some signed receipt, that may still be reversible",
        "created_at": "2024-10-07T13:19:34.675000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e Could you explain what the value is of such a receipt for a user if there were no collusion between committee members? Because if there is no collusion, then there should be at least one IL committee member or the proposer that includes the transaction so it is not clear what the proposer gains with such a receipt",
        "created_at": "2024-10-07T13:27:20.919000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "the user does not want to send their transaction in public",
        "created_at": "2024-10-07T14:01:13.326000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e Users typically do not send their transactions in public because they are MEV-related and they want to prevent things like sandwiching.\n\nSending a transaction in private to an inclusion list committee member does not provide these services that users who send private transaction want. Transactions are made public after they are included in an inclusion list so they can, for example, still be sandwiched.",
        "created_at": "2024-10-07T14:04:16.883000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "you are not sending the tx to an inclusion committee member, you are sending it to a centralized preconfer, who will buy the rights from the IL members,",
        "created_at": "2024-10-07T14:14:32.453000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "this market makes sense only if the centralized preconfer is also the block builder, which in Ethereum L1 is highly likely to happen since there's only 2 builders",
        "created_at": "2024-10-07T14:15:08.406000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e Then still the transaction becomes public as soon as the IL is broadcasted (re @InclusionList_bot: \u003cpotuz\u003e you are not sending the tx to an inclusion committee member, you are sending it to a centralized preconfer, who will buy the rights from the IL members,)",
        "created_at": "2024-10-07T14:16:10.968000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "that is fine, because by the time the tx is public you have a commitment for inclusion which is what you wanted",
        "created_at": "2024-10-07T14:16:44.502000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "sending it in the public mempool makes the transaction public before you get this commitment",
        "created_at": "2024-10-07T14:16:59.190000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e If the block builder is already a preconfer, then obtaining a preconf from the IL committee member additionally has no value. I think this illustrates that preconfs from just IL committee members has no value (re @InclusionList_bot: \u003cpotuz\u003e this market makes sense only if the centralized preconfer is also the block builder, which in Ethereum L1 is highly likely to happen since there's only 2 builders)",
        "created_at": "2024-10-07T14:17:22.980000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e Can you give an example of a tx that wants to be private before getting a guarantee of conditional inclusion but is fine with being public after obtaining the guarantee?",
        "created_at": "2024-10-07T14:18:20.860000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "no I can't, I don't trade, But I see the usage of all these layers of preconfirmation promisses on L2",
        "created_at": "2024-10-07T14:36:05.103000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e Whether an IL design will be crowded out by external markets like preconfirmations is an important question. As argued in the post, I believe FOCIL is not susceptible to these types of markets. We do not have an example of how FOCIL would be crowded out so I think we should move forward with FOCIL since other designs seem far more susceptible to crowding out (EIP-7547 and BRAID as well). I am also in contact with builders in the preconfirmation space and up until now, I have not heard anyone of them making a point that FOCIL would be captured by preconfirmation markets. I will be in contact with them more and will update you 🙂 (re @InclusionList_bot: \u003cjulianma_\u003e Here is a note detailing why I believe FOCIL will not be taken over by profit-seeking out-of-protocol middleware like preconfirmations: https://mirror.xyz/julianma.eth/Gnd8N1IsoHuGHRisp6nCldlt72ZacoXUA-O76qQN3mc)",
        "created_at": "2024-10-07T14:40:20.574000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "talking to searchers / pre-conf providers / pre conf buysers will be very useful",
        "created_at": "2024-10-07T14:41:53.338000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e Yes agree that this is important. Happy to do more of that and if others hear anything interesting, please keep us up to date as well 🙂",
        "created_at": "2024-10-07T14:43:10.951000+00:00",
        "attachments": null
    }
]