[
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "I have a question if I may ask: how do we prevent FOCIL from being abused by the pre-confirmation market? It seems like any IL committee member could just sell pre-confirmations for the next slot's block, which feels like a dystopian outcome to me",
        "created_at": "2024-10-01T21:09:30.686000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjustindrake\u003e To prevent IL-boost for inclusion preconfs the cleanest is to not guarantee inclusion of transactions in the ILs whenever the block is full. (re @InclusionList_bot: \u003cterence0083\u003e I have a question if I may ask: how do we prevent FOCIL from being abused by the pre-confirmation market? It seems like any IL committee member could just sell pre-confirmations for the next slot's block, which feels like a dystopian outcome to me)",
        "created_at": "2024-10-01T21:14:56.180000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "2. Delta of 0 is only possible because the attesters freeze their views before the proposer does, explicitly so that local ILs don't cause split views.",
        "created_at": "2024-10-01T22:08:01.333000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "I agree the conditional (for inclusion preconfs), as well of the \"anywhere-in-block\" (for state preconfs) IL properties make them unsuitable for preconfs, and those properties are what we currently have in mind for FOCIL",
        "created_at": "2024-10-01T22:15:30.019000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "- How does \"anywhere-in-block\" make it unsuitable for preconf? The specific type of preconf I'm thinking of is just plain simple inclusion without any execution conditions\n- I get that the block proposer can just stuff the block and doesn’t need to include the preconf transaction, but the block proposer may not care to pay the cost for this\n- My concern lies around IL committee members becoming preconf members at the end of the day and taking off-chain payments. This is beneficial for preconf-based applications, as it allows the use of IL committee members instead of relying on a single monopoly proposer per slot",
        "created_at": "2024-10-01T22:24:15.475000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think this thread more or less starting here says that we have to design inclusion lists assuming that 100% of validators will sell inclusion \nhttps://x.com/potuz_eth/status/1841241269323841603?s=19",
        "created_at": "2024-10-01T23:09:23.413000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't know about you, but this number disheartened me, I naively assumed that we had about 9% of vanilla validators",
        "created_at": "2024-10-01T23:10:13.346000+00:00",
        "attachments": null
    }
]