[
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "From what I’ve seen I’d say not very far, since most recent designs have focused on regular public mempool transactions inclusion and the underlying mechanism itself. But definitely interested in thinking more about what a blob-friendly, FOCIL like design would look like for example. Intuitively it seems like most of the ideas that apply to regular transactions could be re-used/adapted so it works for blobs as well, but the bandwidth constraints might be difficult do deal with.",
        "created_at": "2024-07-06T09:27:02.120000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cnero_eth\u003e Why couldn't blob txs already be part part of the focil design?\nAs I understood it, one doesn't need every IL committee member to propagate the full txs alongside the IL, right?",
        "created_at": "2024-07-06T10:36:57.570000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I am very afraid of all the designs for ILs and the runtime check required for IL satisfaction. This applies just as much as in 7547 with the tx invalidation issue as with Focil since a tx can be invalidated in the current slot by other txs in the IL. In 7547 the attesters can make certain that the IL is executable at the tob but this is not the case in focil so that the IL aggregate can contain txs that themselves invalidate some. When checking for IL satisfaction, this adds a runtime overhead to the EL. Blob txs add an extra difficulty that the DA may not be available at all and I don't think we are even remotely close to solve this issue as opposed to \u003c@792404665068158998\u003e and \u003c@725415098331430932\u003e above. I honestly think the txs invalidation issue is more subtle and serious than what most are thinking",
        "created_at": "2024-07-06T11:09:48.173000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "for the record I said \"I’d say not very far\" as in, not far along when it comes to having blob-friendly designs figured out 🙂",
        "created_at": "2024-07-06T11:16:56.471000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I really think the tx invalidation issue is serious enough without the DA issue. But more importantly: forward ILs therefore have the exact same overhead to validate since validators will have to anyway run these checks for the same IL txs. This tells me that if we're willing to accept this overhead, then we should go with forward ILs instead of same slot (focil or not) because they don't have the timing tradeoffs",
        "created_at": "2024-07-06T11:21:25.199000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cnero_eth\u003e I missed where I said some issue is solved. \nAs I understood FOCIL, there is no case in which two txs - where one invalidates the other - MUST be included (thus, invalid block). If one tx invalidates another tx than the balance of the account used in the 2nd txs must have changed which would mean the entry would be satisfied. (re @InclusionList_bot: \u003cpotuz\u003e I am very afraid of all the designs for ILs and the runtime check required for IL satisfaction. This applies just as much as in 7547 with the tx invalidation issue as with Focil since a tx can be invalidated in the current slot by other txs in the IL. In 7547 the attesters can make certain that the IL is executable at the tob but this is not the case in focil so that the IL aggregate can contain txs that themselves invalidate some. When checking for IL satisfaction, this adds a runtime overhead to the EL. Blob txs add an extra difficulty that the DA may not be available at all and I don't think we are even remotely close to solve this issue as opposed to @nero_eth and \u003c@725415098331430932\u003e above. I honestly think the txs invalidation issue is more subtle and serious than what most are thinking)",
        "created_at": "2024-07-06T11:21:47.993000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cnero_eth\u003e Entry A: (A, 21k)\nEntry B: (B, 21k)\n\nTx A touches Account B and empties it.\n\nIf the next proposer includes tx A, then both enties are satisfied.",
        "created_at": "2024-07-06T11:24:10.309000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "When we say tx invalidation issue on focil, are we referring to same slot focil or next slot focil or both?",
        "created_at": "2024-07-06T11:24:23.851000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "But that's the point, that you cannot know this statically, you need to check for this at runtime. This is the problem of tx invalidation that we had in 7547 and that I claim that focil doesn't solve. So if we're faced with this problem anyway then we may as well use forward ILs that don't suffer from removing time from payload validation",
        "created_at": "2024-07-06T11:28:35.594000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Both have the same issue",
        "created_at": "2024-07-06T11:32:29.768000+00:00",
        "attachments": []
    }
]