[
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Wrote down the current FOCIL design and the open questions here: https://hackmd.io/@ttsao/simple-focil\n\nFeedback welcome",
        "created_at": "2024-09-23T02:49:40.279000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "Here's a simple idea for dealing with local IL equivocation: Attesters need to stop caching/adding local ILs after the cutoff, but they can still monitor the topic to check whether any IL committee member double signed before they attest (slot n+1, t=4s)\n\n`Let’s x be the cutoff time, at which attesters don’t accept anymore local ILs, but they keep monitoring the subnet to check if more than 1 local IL was sent by the same IL committee member.\n\nIL committee member A sends two local ILs right at x trying to split the attesters’ views (so some see an IL_1, and others see IL_2) \u2028\u2028The proposer has 2 more seconds than attesters to get local ILs and produce an IL aggregate. So the proposer will definitely see both IL_1 and IL_2. \n\nThe proposer will have seen both IL_1 and IL_2, and we can make a rule that he shouldn’t include either of them in its IL_aggregate because an IL committee double signed. \n\nNow let’s remember that attesters actually vote for the block during slot n+1 (before or at 4sec), so by that time if they keep monitoring local ILs (without adding them) they will all have seen both IL_1 and IL_2 as well, and shouldn’t include them in their local IL_agg.\n\nEven if by mistake, the proposer includes one of the 2 local ILs, he’ll have include more ILs than attesters, which still makes the IL aggregate valid.`",
        "created_at": "2024-09-23T06:59:17.831000+00:00",
        "attachments": []
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Having a delay between IL propagation and payload evaluation to deal with IL equivocation looks valid.",
        "created_at": "2024-09-23T07:35:43.543000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "re: equivocation, there’s a simply solution that generally works (didn’t read through the whole discussion, sorry if already brought up): if you see evidence of equivocation, you ignore all of the equivocating messages. So if an IL committee members sends multiple ILs, the only thing we care about ensuring is that everyone receives two of them and ignores anything from that member",
        "created_at": "2024-09-23T08:34:27.425000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ah yeah this exactly",
        "created_at": "2024-09-23T08:35:00.410000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "Let’s now think about the invalidation issue between 2 ILs.\u2028\u2028Say every seen IL is valid against the head state, so the proposer includes the union of IL transactions in its payload. This means txns don’t invalidate each other within the same IL.\n\nBut what if txn_A in IL_A invalidates txn_B in IL_B. I guess the first thing to check is if changing the ordering of txn_A and txn_B solves it (in which case it should be ordered so no txn is invalid). If ordering txns doesn’t solve the invalidation issue, then one or both txn_A and txn_B could just be ignored and not be included in the payload. \u2028What we could do is add a specific field in the IL_aggregate, so that the proposer can explicitly add txn hashes of txns it excluded because of invalidation edge cases?",
        "created_at": "2024-09-23T09:37:58.574000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think the idea makes sense but we should ensure that the attesters do not have to check too many cases before. Asking attesters to check whether a transaction could be appended to the execution payload, for example, is quite easy. On the other extreme, you could ask attesters to check whether a transaction could have been added at any point in the execution payload which would require more computation. Txs that have been ignored because of invalidation can be referenced but no txn hashes should be included because of free DA",
        "created_at": "2024-09-23T10:18:56.667000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "yes txn hash doesn't work (more like a summary for those txns) \n\nand I agree we should keep the attesters' load as low as possible, maybe just excluding txns that are invalidating each other in any order would work well enough",
        "created_at": "2024-09-23T10:40:00.219000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "This does worry me a bit. I think IL gossipsub will be more sensitive to DOS than people think. Even if we allow an additional IL rule based on equivocation for the network p2p rule, we still shouldn't allow forwarding more than one seen IL per validator index. I think this is fine, but I want to double check here",
        "created_at": "2024-09-23T14:01:30.048000+00:00",
        "attachments": []
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think we should allow forwarding exactly two per validator, so that knowledge of equivocation spreads by default but the max bandwidth is still at most 2x",
        "created_at": "2024-09-23T14:03:20.006000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'll update the FOCIL consensus spec to reflect the latest discussions above",
        "created_at": "2024-09-23T15:30:09.237000+00:00",
        "attachments": []
    }
]