[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@981249983196041218\u003e I better bring that dicussion here. When I talk about the runtime overhead of ILs I am referring to the following. \n- If the IL were for the next slot, not this one, then the IL can be proposed later. Conversely, if the IL is for the current slot, it has to be proposed earlier. \n- The IL proposer needs to have the latest execution payload already synced and validated. \n\nThese two are in contention for the current slot, the IL proposer needs time to validate the payload, and the rest of the network needs time to receive and validate the IL. \n\nThe above is without caring for 7702. Comes in play 7702:\n\n- The IL proposer needs to simulate the transactions in order to know they are valid.  Transactions in the IL can be invalidated by other txs in the IL, there is no static way of knowing that txs are actually includable. \n\nThis adds time to that tradeoff above.",
        "created_at": "2024-08-09T15:20:34.311000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks for bringing the discussion here. I think we should explore the design space if the IL committee members in FOCIL do not have the latest execution payload synced and validated and just choose transactions based on some rule that will statistically lead to transactions that we want to have in the aggregate IL. \n\n(FOCIL specific) When the attesters check that the execution payload satisfies the aggregate inclusion list, attesters must check whether transactions were valid or not because a block producer could exclude transactions from the aggregate IL because the rest of the execution payload invalidated them. This means the attesters must do an invalidation step regardless of what happened before.\n\nThis also means that the aggregate IL could contain invalid transactions, which is fine because the aggregate IL contains a summary of a tx and not the full tx, so there is no free DA. \n\nThen, we could consider what happens if we allow transactions in local ILs for which there was no check whether they were valid given the previous execution payload.",
        "created_at": "2024-08-09T17:03:49.937000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Obviously, there is a trade-off here, and it would be better if the IL committee members had the latest execution payload validated, keeping all other factors constant.",
        "created_at": "2024-08-09T17:05:07.671000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "What is there in an IL? if the IL does not commit to a specific transaction that may work, otherwise you may leak free DA.",
        "created_at": "2024-08-09T17:39:07.017000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "At any rate, it is absolutely true that if you allow the IL to include invalid txs right from the start, and this does not present a free DA problem, I think there aren't many concerns with tradeoffs. There may be an issue that attackers may trick the mempool into trying to include transactions that are high paying but that are not includable, for example I can send two very highpaying transactions, that one invalidates the other, one pays gas, the other one doesn't and I manage to take a spot in an IL to prevent a censored transaction to enter.",
        "created_at": "2024-08-09T17:41:11.121000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "Local ILs contain full transactions but local ILs never go on-chain. Aggregate ILs contain (from_address, gas_limit, bitlist) for each tx where the bitlist represents which local IL committee members committed to this transaction",
        "created_at": "2024-08-09T17:59:00.049000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "This attack does not seem very different to me whether you allow invalid txs in the IL or not because the IL transactions can always be invalidated by the execution payload (unless you have spot ILs and force them to be ToB, but that seems bad). \n\nIf only valid txs were allowed in the IL, the attacker could send a high-paying tx through the IL and include a tx that invalidates it in the execution payload.",
        "created_at": "2024-08-09T18:00:42.210000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "that requries a collusion from the IL sender and the builder of the next block which presumably can be a vanilla builder. But yeah, I do agree that this attack is mild even in the worst case",
        "created_at": "2024-08-09T18:05:51.345000+00:00",
        "attachments": []
    }
]