[
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "I have some questions, probably coming from my lack of understanding:\n\n1) If there is no IL summaries included in a beacon block and no IL_agg broadcast, how does a block builder know what the ILs are? Should all builders keep listening on IL_local broadcast?\n\n2) Would it be worth to not include IL summary to IL to save a little bit of network bandwidth? An attester can derive a set of IL summary from the union of transaction and the summaries will be used for only once when validating block to handle the AA issue anyway.",
        "created_at": "2024-09-21T08:09:54.059000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "3) Previously, FOCIL addressed concerns around IL equivocation in EIP-7547 by including IL aggregate in a block, making IL equivocation would result in a block equivocation. How do we handle the IL equivocation concerns without having IL aggregate in a block?",
        "created_at": "2024-09-21T09:01:56.746000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "1) Builders should listen to the IL local broadcast. Today, we have a beacon API send point to stream payload attributes. You could also imagine a similar streaming endpoint for proposers to communicate their IL view to the builder, which the builder must include.\n\n2) I think I agree that you need one of the two. I'm actually leaning more towards the design where the IL local broadcast should just be a summary, and the transactions should be in the local mempool, which the CL could retrieve locally. This design was first proposed by Peter, and I think he's onto something very interesting. Such a design would make blob inclusion lists easier. I'll do more thinking around this approach over the weekend.\n\n3) It's worth noting that even IL aggregation in the block doesn't prevent IL equivocation. One could send conflicting IL transactions from the same address. IL equivocation is currently prevented at the p2p layer, where we only forward one IL transaction per validator index. As for whether this weakens consensus in any way, my answer is probably yes, but we need a deeper study.",
        "created_at": "2024-09-21T14:24:41.127000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "1) Agree with \u003c@363800010518822915\u003e, using p2p to broadcast the IL_agg seems pointless, a beacon API endpoint could work fine\n2) The exact details are still being worked on, feels like there are different potential approaches to this (ones leaning towards letting go of summaries/aggregates and just validating txns), ones going in the opposite direction like the one Terence mentioned. I think the whole invalidation topic is quite tricky to get right, and having more people proposing designs and ideas is good! \n3) \u003c@845691100072509460\u003e: That's a good point, we could imagine keeping a sort of minimal IL aggregate in the block to keep track of what the proposer constructed and handle IL equivocation, bu without having as much added block validity coming from adding the IL agg.\n\u003c@363800010518822915\u003e I don't think I understood your point, to me having an IL agg in the block does prevent IL equivocation by turning it into block equivocation",
        "created_at": "2024-09-21T20:46:50.565000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "My point for 3 was mostly without the IL committee signature in the summary, proposer could just manipulate the data however to its favor so it’s a bit useless",
        "created_at": "2024-09-21T21:10:55.662000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "proposers sending the IL to the builder is not compatible with ePBS and seems also a latency problem even for Mev Boost, I'd advise you against it",
        "created_at": "2024-09-21T21:11:17.887000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes, this definitely should not be a requirement step for epbs. Builders listening to the IL gossip is more than good enough",
        "created_at": "2024-09-21T21:12:41.604000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Even for Mev Boost it's a bad one, by the time the proposer contacts the relay, the builder already has the block",
        "created_at": "2024-09-21T21:13:34.985000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Oh no, for mev boost, I’m talking about this as a beacon api streaming end point, not a builder api end point. Today we have beacon api end point to stream builder new head and withdrawals info. This is similar to stream builder about IL aggregate info. It’s an optional end point",
        "created_at": "2024-09-21T21:16:54.527000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "ahh ok, so it´s not the proposer but just a beacon api endpoint. Got it, but in that case just the same standard endpoint that the local proposer would use should work for the builder",
        "created_at": "2024-09-21T21:28:09.147000+00:00",
        "attachments": null
    }
]