[
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "1) So, we will be adding a new beacon API as a streaming endpoint for builders to fetch IL_agg. It sounds good but how do we guarantee that a proposer will respond with a correct IL_agg? Hoping the proposer to be honest seems fragile and it seems the same issue with your concern for point 3.\n\n2) In the high-level, broadcasting summaries of transaction and fetching necessary transactions locally on demand looks similar to how recent consensus algorithms work and indeed interesting. Do you have a link to Peter's design? I'd like to learn more about it.\n\n3) I don't think p2p layer forwarding one IL per attester can prevent equivocation. An attacker can send two different ILs to two different nodes, causing two different views unless there is some reconcile mechanism.\n\nOverall, the approach that ~~attesters~~ IL committee broadcast their local ILs and a proposer uses it directly based on the honest majority assumption seems naive to me. Currently, there are multiple IL proposers but single IL_agg propser.. We definitely need a deeper study.",
        "created_at": "2024-09-22T03:23:04.813000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't really understand the conclusion, how is relying on attesters' majority assumption fragile? If a proposer isn't honest and doesn't respond with a correct IL_agg, well then his IL_agg will be invalid and so will his block so he wouldn't get rewards. \nAbout mempool consensus ideas, one major issue is getting consensus in the first place, which wouldn't give us (by definition) the nice 1/n property that's strictly better for CR",
        "created_at": "2024-09-22T06:36:40.752000+00:00",
        "attachments": null
    },
    {
        "author": "kboom_ro",
        "category": "Cross-layer",
        "parent": "",
        "content": "Interesting point 2) about CL retrieving local mempool. That would pretty much make the *IL_agg* the actual CL block wouldn't it? (Leaving blobs aside). I think V had mentioned this in a 2023 post",
        "created_at": "2024-09-22T07:15:05.729000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "In the worst case scenario, the delta of Eval function would be 33.3%. Let's assume one third of IL committee are malicious and all local ILs are distinctive. The malicious members can send all different ILs to all attesters and the proposer (i.e., IL_1, IL_2, IL_3, ...), resulting in each of attesters and proposer have IL_agg differ by 33.3%.\n\nThe dishonest proposer can put whatever they want up to delta (or slightly less than delta as attesters' IL_aggs could be slightly differ). What I tried to mean by fragile or naive was this. (and I know there was a comment regarding this in the FOCIL ethresearch post.)",
        "created_at": "2024-09-22T07:26:42.769000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "It may be impractical and/or I may missed something. If there is some analysis already thoroughly examined relevant issues, would like to learn more.",
        "created_at": "2024-09-22T07:29:55.109000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ah ok I see where the confusion comes from then, the delta of Eval should never be even remotely close to 33.3%, since we allow more time for proposers (then for attesters, e.g., 1sec more) to collect local ILs. This is how we can get the delta to a very small value, that should even coverge to 0 when we have more certainty about how to set timings exactly",
        "created_at": "2024-09-22T07:56:45.009000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ah ok I see where the confusion comes from then, the delta of Eval should never be even remotely close to 33.3%, since we allow more time for proposers (then for attesters, e.g., 1sec more) to collect local ILs. This is how we can get the delta to a very small value, that should even coverge to 0 when we have more certainty about how to set timings exactly by observing how the network behaves",
        "created_at": "2024-09-22T07:57:40.192000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think what I don't follow here is about IL equivocation. If we don't put IL_agg in a beacon block, how can we prevent IL equivocation? If IL equivocation is possible, every slot where malicious IL committee members ratio is bigger than delta may result in block invalidation even if it's constructed and attested by all honest actors, which can hurt liveness.",
        "created_at": "2024-09-22T08:11:59.474000+00:00",
        "attachments": null
    },
    {
        "author": "kboom_ro",
        "category": "Cross-layer",
        "parent": "",
        "content": "If a block gets invalidated, the next one will be more expensive no? So it's not rational for IL committee members to equivocate repeatedly, especially if they lose rewards.\nWhat reasons are we considering for equivocation? Censoring or an attack?",
        "created_at": "2024-09-22T08:25:01.055000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Okay, with some incentive mechanism that we currently don't have yet, I think now the question is what the benefit of the attack is. Honestly, I don't have a good answer on the spot. It could be a censoring or an attack, didn't have specific purpose of scenario in mind.",
        "created_at": "2024-09-22T08:40:33.953000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "ok, yeah if it's specifically about IL equivocation and having the IL agg in the beacon block or not I think it'd be good to be a bit more specific about the attack you're thinking of. It's also different to \"equivocate\" on local ILs from committee members, and on the IL aggregate from the proposer, which one exactly are you concerned about?",
        "created_at": "2024-09-22T11:21:56.820000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's about IL equivocation by IL committee members as it can corrupt IL_agg up to malicious members ratio. A proposer wouldn't benefit by equivocating IL as its block will be invalidated by attesters. Though a proposer can try to monetize its opportunity to tell builder the IL_agg by manipulating it up to delta, if it's worth it.",
        "created_at": "2024-09-22T12:05:23.248000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "I might be wrong or missed something. Correct me if I'm wrong 🙂",
        "created_at": "2024-09-22T12:10:02.331000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "ok then if it's about local IL equivocation by IL committee members, I really don't see how including the IL agg in the block body or not changes anything? (this only related to IL agg/proposer equivocation) \n\nAbout the local IL equivocation, how would the IL committee members proceed exactly?",
        "created_at": "2024-09-22T12:24:21.736000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "If some IL committee member A equivocated, there exists a validator V who has different local IL sent from A that is not included in the IL agg. (The term \"included\" might not be the case depending on the aggregation algorithm. I'm assuming IL aggregate is simply a group of all local ILs.) Then, V can submit the evidence, which possibly leads to slashing A. There may be no slashing for IL committee at all even in the future but my point is you can prove IL equivocation based on onchain history.\n\nA can equivocate its local IL by sending IL_1 if recipient is the proposer of slot N and IL_2 otherwise. Timing would matter but not impossible imo. Is this impossible due to some specific P2P protocol?",
        "created_at": "2024-09-22T13:23:22.394000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't think slashing is the right approach here. However, I do acknowledge that the current design can stall proposers, which leads me to believe we need the IL committee's signature for the aggregation field after all. \n\nConsider the following setup:\n- The IL committee is just one party.\n- The attester committee consists of two parties.\n- The IL committee sends IL1 to attester1.\n- The IL committee sends IL2 to attester2.\n- IL1 and IL2 invalidate each other.\n\nI believe the property we want is that even if attester2 only sees IL2 but also sees a block satisfying IL1, attester2 will still be able to vote for that block, provided there is a valid IL committee signature for IL1.",
        "created_at": "2024-09-22T14:32:44.530000+00:00",
        "attachments": null
    },
    {
        "author": "kboom_ro",
        "category": "Cross-layer",
        "parent": "",
        "content": "It seems the IL committee's signature over  the IL aggregate is important, for attesters to properly run `Eval`",
        "created_at": "2024-09-22T14:43:59.535000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think what we need is a deterministic and converging mechanism for attesters. IL aggregate signed by each IL committee members could be one solution.",
        "created_at": "2024-09-22T14:54:19.852000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "In the original proposal, the IL committee signs each IL, but the problem is that we won’t be able to aggregate that signature across different summaries. This will only work if the IL committee signs each summary, but I’m not sure what the performance penalty is",
        "created_at": "2024-09-22T15:01:49.173000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Another point to consider is how distinctive the summaries are. In the worst case, all of the summaries are unique, making signing each summary ineffective.",
        "created_at": "2024-09-22T15:13:44.517000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "I also thought about pipelining aggregation but it would also bring other implications including 1 slot delay.",
        "created_at": "2024-09-22T15:13:54.443000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Regarding IL aggregation, what if a proposer aggregates and let IL committee to sign it back? Timeline wise:\n\nSlot N, t1 (local IL propagation \u0026 aggregation): IL committee broadcasts local IL and a proposer aggregates local ILs\nSlot N, t2 (IL aggregate propagation): a proposer broadcasts an IL aggregate\nSlot N, t3 (signed IL aggregate propagation): IL committee signs the IL aggregate and broadcasts it\nSlot N+1, t4 (block propagation): a proposer broadcasts a block along with the signed IL aggregate\n\nIL aggregate can become a compact format such as:\n\n```\naggregation_bits: BitVector[IL_COMMITTEE_SIZE]\nsummaries: List[InclusionSummary, MAX_TRANSACTIONS_PER_INCLUSION_LIST]\nsignature: BLSSignature\n```\n\nAlso, it can be combined with ePBS, if it makes sense.",
        "created_at": "2024-09-22T17:01:05.669000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "Let’s x be the cutoff time, at which attesters don’t accept anymore local ILs\n\nIL committee member A sends its local IL right at x trying to split the attesters’ views (so some see an IL, and others don’t ). \u2028\u2028The proposer has let’s say 2 more seconds than attesters to get local ILs and produce an IL aggregate. So the proposer will definitely see the local IL sent by A. \u2028\u2028Since the eval function explicitly mentions the IL aggregate is valid as long as it contains the same or more txns than what attesters see, both attesters that have seen the local IL and those who haven’t will consider the IL aggregate valid.\n\nSo this scenario is not a problem, right?",
        "created_at": "2024-09-22T17:04:13.788000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "In this specific scenario, I think it's okay even if IL committee plays timing games since the proposer's IL aggregate is superset of each of attester's IL aggregates.",
        "created_at": "2024-09-22T17:10:19.358000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "ideally we'd want to keep the same slot \"real-time\" CR property",
        "created_at": "2024-09-22T17:13:57.945000+00:00",
        "attachments": null
    }
]