[
    {
        "author": ".paulharris",
        "category": "Cross-layer",
        "parent": "",
        "content": "you'd have to keep gossiped IL around for longer than 1 block for cases like late block reorg (in which case it'd be 2 blocks, not awful) and potentially tracking other chains in case they get votes but it won't be a huge number ...",
        "created_at": "2024-02-26T00:26:00.195000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Cross-layer",
        "parent": "",
        "content": "I know there's a desire to not give free block space, i just wonder if we could do something like store a hash or something that identifies the tx without storing the whole tx with forced inclusion? not sure if that makes life harder...",
        "created_at": "2024-02-26T00:33:38.659000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "You don't need to keep any IL at all except to serve other peers requesting  them. You **only** care that you have already seen a valid one and that's it. Your EL may keep the txs in the mempool cause if you're proposing it will have to honor it. But the CL does not care about the IL after it has validated that it's available",
        "created_at": "2024-02-26T00:35:12.291000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Cross-layer",
        "parent": "",
        "content": "so we're just passing messages and don't care, the EL has to do stuff with the messages...",
        "created_at": "2024-02-26T00:36:05.903000+00:00",
        "attachments": []
    },
    {
        "author": ".paulharris",
        "category": "Cross-layer",
        "parent": "",
        "content": "ugh clearly i've skipped the important bits sorry, will go back to hitting the books after i finish the bug im on",
        "created_at": "2024-02-26T00:37:00.942000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Correct, you get an IL send it to the EL to validate it, and if it tells you that is good you don't need to remember anything except the fact that you have seen a good one",
        "created_at": "2024-02-26T00:37:21.011000+00:00",
        "attachments": []
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "can we also discuss \u003c@360491619402776577\u003e 's proposal here :\n\nmy understanding is it has three flaws which have been pointed out but here is my understanding of them\n\n1. JIT availability of txs to builders: \n\n   - If the getHeader  or newILTxs  call goes out to relays earlier than slot boundary (signed by the proposer of the incoming slot), then builders can pull it from relays and include it in their block if they want. we can also limit the num txs to 16 as well as cumulative gas consumption\n\n2. Builder might actually censor the txs by giving you an invalid payload which the proposer will only figure out when it signs the blindedblock and gives it to builder to reveal its payload : \n\n  - If the builder causes a missed proposal soon enough they/or relay will be blacklisted by proposers\n\n3. Builders might not build optimal blocks:\n\n  - including the txs towards end of block doesn't constraint builder if the IL order is not forced on builder, which anyway is not the intend of the current task. censoring builders not responding with any bid, might be net postive for the ecosystem?\n\nI also understand that this could be incompatible with the ePBS design but I need to dig through that to make that determination for myself. so am keeping myself open ended about that",
        "created_at": "2024-02-26T07:34:31.126000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Same slot ILs have been widely studied, seems like we need to have a better way of indexing the literature and a more centralized way of finding them, something akin to mathscinet, that would prevent these episodes I believe",
        "created_at": "2024-02-26T10:52:40.878000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "The problem I have at the moment is that there are a bunch of proposals from different people on the forums, and it is not always clear which one is the current \"popular\" one, and which are still being advocated for, and which are superseded (in the authors eyes, and/or in the eyes of other readers) by one of the other proposals.",
        "created_at": "2024-02-26T11:18:54.169000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "e.g., if Potuz posts a proposal for X on ethresear.ch, then G11tech posts a proposal for Y on ethresear.ch, it is not clear that Potuz is now an advocate for proposal Y because they are convinced it is better than X.  X still exists with Potuz's name on it and the discussion shows Potuz advocating for X, while Y may not have a single comment by Potuz.",
        "created_at": "2024-02-26T11:19:45.243000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Multiple this problem by 100 different people advocating/commenting on various proposals and it rapidly becomes impossible to tell what is the \"latest thinking by various people and the group as a whole\".",
        "created_at": "2024-02-26T11:20:45.583000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Afaik the current proposal being discussed in ACD is EIP-7547 and the only arguments now are for minor nuances over the design, and not the design itself, that is:\n- should the summary be committed to the block or not\n- should the proposer be allowed to send different summaries or just different txs for the same summary.\n- should the builder decide which summary to include or should the proposer\n\nAll these three are the same choice. When this EIP went up for discussion people started offering very different approaches, Marius' for example is based in his not liking that the proposer for N forces inclusion to the proposer of N+1. \n\nI believe a large part of these problems arise because R\u0026D is carried in closed channels in telegram or in small EF research retreats. This has been always a grudge with Ethereum research: we changed substantially the way withdrawals are handled just a few months before the Capella fork. We complained about sync committee variance just before Altair, etc.",
        "created_at": "2024-02-26T11:30:38.106000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "If the whole IL channel would have been visible here, it wouldn't have deterred discussions since anyway people don't really participate from technical discussions, and it would have been now much easier to point to new proposers of points in the past where those designs were already discussed. This is why I've advocated for an ePBS channel here, hoping to not be the only voice constantly pushing to have that in soon",
        "created_at": "2024-02-26T11:34:22.818000+00:00",
        "attachments": []
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "I understand your pain \u003c@755590043632140352\u003e 😆  but now that we have this channel, can someone posts list of links to go through",
        "created_at": "2024-02-26T12:04:17.040000+00:00",
        "attachments": []
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "yea design space being so large on this has caused this thrashing ... may be the EIP can address/catalog all competing proposals in its `rationale` part",
        "created_at": "2024-02-26T12:06:19.799000+00:00",
        "attachments": []
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "lemme go through the EIP to see if it has answer to the new proposal design's viability (or not)",
        "created_at": "2024-02-26T12:06:53.864000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think this post by \u003c@750824368438771842\u003e does a fairly decent job for the higher level design decisions https://ethresear.ch/t/unconditional-inclusion-lists/18500",
        "created_at": "2024-02-26T12:10:04.498000+00:00",
        "attachments": []
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "have already been through this, may be need to dig through the followup discussion",
        "created_at": "2024-02-26T12:12:50.833000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Some thoughts on builder API with the current design \n\n- With `submitBlindBlock`, what are the disadvantages of not returning the signed inclusion list to the relayer for verification against the block.summary_root? Is it feasible for a proposer to employ the same unbundling strategy against the builder? For instance, the proposer could provide an incorrect summary root to the builder, wait for the builder to gossip the block, and then unbundle it using the correct summary root. This strategy seems impractical within a 4s but might be acceptable if all clients mandatorily reorg late blocks...\n- It is crucial that a client can import more than one IL to prevent the previously mentioned attack. A proposer can create two valid inclusion lists, IL#1 and IL#2, that match the same summary. The proposer broadcasts IL#1 and sends IL#2 along with submitBuildBlock. A consensus node will import IL#1, gossip it, and then import IL#2...\n- Considering all of this, would it be more effective to couple the block directly with its inclusion list as a p2p object? (not consensus object). Still thinking...",
        "created_at": "2024-02-26T14:36:43.336000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "This one is also good to refer to: https://ethresear.ch/t/no-free-lunch-a-new-inclusion-list-design/16389",
        "created_at": "2024-02-26T14:40:08.917000+00:00",
        "attachments": []
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e an incorrect summary root\nyou mean incorrect or alternate? I guess you mean later as builder might not even reveal or gossip block with an incorrect IL and error, if its alternate IL, then builder will gossip it(the IL submitted to builder) first so most likely thats the IL proposer will pickup and include in block (network will see multiple valid ILs)",
        "created_at": "2024-02-26T17:05:34.696000+00:00",
        "attachments": []
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also the logic of alternate ILs but same summary committed in block to thwart censorship might not even work as `from` address is likely to be censored",
        "created_at": "2024-02-26T17:07:22.989000+00:00",
        "attachments": []
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "summary only helps against DA but not against fooling builder, the only way this works is that builder doesn't see summary till it has revealed the block which means one can't commit to in block",
        "created_at": "2024-02-26T17:09:56.722000+00:00",
        "attachments": []
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "if one has to commit to a summary in block, one will need to declare it upfront to the builder, else they will holdout on publishing the block if they don't wanna include a censorring IL",
        "created_at": "2024-02-26T17:11:43.732000+00:00",
        "attachments": []
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "its very likely they can be held responsible for adding  a censoring summary even if its the next proposer who has to include the censoring txs",
        "created_at": "2024-02-26T17:12:34.298000+00:00",
        "attachments": []
    },
    {
        "author": "g11tech",
        "category": "Cross-layer",
        "parent": "",
        "content": "the current summary can help in preconfirming some tx, but not revealing it yet to prevent front running or DOS attack for non-censorship purposes (for e.g. mev sniping)",
        "created_at": "2024-02-26T17:16:57.959000+00:00",
        "attachments": []
    }
]