[
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "I can relate this. I've been having this in mind and still not sure if those properties are enough to prevent preconf market from emerging. What if both IL committee and block proposers participate in some off-the-protocol preconf market following the same rule? Like a bidder request for a transaction inclusion along with where-in-block condition.",
        "created_at": "2024-10-02T02:56:32.952000+00:00",
        "attachments": []
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "My concern is what if off-the-protocol incentive is big enough to distort the protocol design.",
        "created_at": "2024-10-02T02:56:39.841000+00:00",
        "attachments": []
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Might be worth to ask what people in MEV space think about this..",
        "created_at": "2024-10-02T02:56:49.078000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "- Anywhere in block means you have no guarantees IL transactions will end up at a specific position relative to the execution payload (unlike top-of-block or end-of-block) \n\n- The main question we have to answer when thinking about ILs being crowded by preconfs or valuable MEV txns is: Is it better to use ILs as a vehicle to include transactions than just trying to get your transaction in the block via builders, or directly communicating with proposers (\"preconfers\") using a dedicated lane/mechanism? \n\nI think with FOCIL and its current properties the answer is it's less practical to use ILs (via committee members) to include valuable transactions or to guarantee preconf commitments will be honored (or that preconfers will be slashed if not). At the end of the day, if you do want guarantees about your transaction being included or being put in a particular position in a block, you do want to rely on the block producer (proposer or builder), he's the one having the last look, and ultimately has more power to decide what goes in or not and where",
        "created_at": "2024-10-02T06:38:00.736000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cnero_eth\u003e Freezing the view before proposers doesn't solve the issue of publishing my local ILs exactly at the freeze-deadline. \nConservative proposers might want to be safe and still include the stuff of a late IL. If my local IL reaches the proposer later than attesters, the proposer might ignore it (honest behavior) and get reorged. (re @InclusionList_bot: \u003csoispoke\u003e [reply]: 2. Delta of 0 is only possible because the attesters freeze their views before the proposer does, explicitly so that local ILs don't cause split views.)",
        "created_at": "2024-10-02T06:42:53.247000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "Wait, no but it does. The honest proposer behavior is to keep monitoring and caching local ILs ***after*** the freeze deadline. So that even if an IL committee member sends its local IL right at the deadline, the proposer will have extra time to see it and include it. Where did you see the honest proposer behavior was to ignore local ILs if seen after the deadline? Because that's wrong.",
        "created_at": "2024-10-02T06:50:30.767000+00:00",
        "attachments": []
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also the proposer could potentially use an RPC endpoint of the IL committee member to request for the missing IL.",
        "created_at": "2024-10-02T07:51:50.193000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cnero_eth\u003e ahh gotcha! thanks (re @InclusionList_bot: \u003csoispoke\u003e [reply]: Wait, no but it does. The honest proposer behavior is to keep monitoring and caching local ILs ***after*** the freeze deadline. So that even if an IL committee member sends its local IL right at the deadline, the proposer will have extra time to see it and include it. Where did you see the honest proposer behavior was to ignore local ILs if seen after the deadline? Because that's wrong.)",
        "created_at": "2024-10-02T08:06:06.419000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "how would that work?",
        "created_at": "2024-10-02T12:33:16.966000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "it's mentioned in the proposer section in this doc: https://ethresear.ch/t/focil-cl-el-workflow/20526",
        "created_at": "2024-10-02T12:45:04.791000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "why is that relevant for ILs, as in, as a user why would you buy inclusion from IL committee members and not from the proposer in the first place",
        "created_at": "2024-10-02T12:48:33.162000+00:00",
        "attachments": []
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "After t=9s, IL committee freeze their IL views and stop forwarding new ILs. The proposer keeps listening and updating its IL view until t=11s. If there is any missing ILs by t=10s, the proposer can query the IL explicitly to the specific IL committee member. (t=10s is an example here.)",
        "created_at": "2024-10-02T12:48:33.968000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Because the proposer may not offer this service, so now you went from 1 potential seller every 12s to 1+n potential sellers every 12s, and n is the number of committee members, there's no longer a monopoly per slot \nThe type of transaction I'm looking at is just a simple inclusion",
        "created_at": "2024-10-02T13:43:43.223000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "that's an RPC of the peers, not of the committee member as in the message",
        "created_at": "2024-10-02T14:22:35.371000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "If there's any value into being in an IL for any reason, (for example the simple promise that you will be in an IL may be enough for some), then this can be trivially centralized and sold via an IL-Boost middleware, I do not believe this is a banal concern of mine",
        "created_at": "2024-10-02T14:24:27.566000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@725415098331430932\u003e I wrote more about risks about IL opens door to out of protocol market like IL-boost: https://hackmd.io/@ttsao/il-market-risks\ncc \u003c@981249983196041218\u003e as well. Feedback welcome",
        "created_at": "2024-10-02T14:28:24.989000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "what I'm simply saying is that what you can sell as an IL committee member is strictly worst in terms of guarantees than what a proposer can sell\n\nyour example, the simple promise that you will be in a local IL does not mean you'll get included, and you get even less guarantees about being included at a specific position,  so it is kind of worthless",
        "created_at": "2024-10-02T16:47:36.236000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "will read and give feedback but it does feel like we have been circling around these qs for at least two years",
        "created_at": "2024-10-02T16:51:02.878000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "whatever it is, if it has non-zero value and it can be sold,  it will be sold, if we've learned anything from this place is that. And the problem is that as long as this thing is gated by a middleware, it doesn't matter if the mid request is high, it enables constant price censorship by paying enough on the middleware",
        "created_at": "2024-10-02T16:54:26.607000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "With this I agree, the problem is that there may be a tweak in that to do this secondary market you don't need a middleware but an actual fork of clients",
        "created_at": "2024-10-02T16:55:05.621000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "that's not true, if you sell way less valuable things than another actor, why would people try to buy it from you?",
        "created_at": "2024-10-02T16:55:09.879000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Because these are disjoint sets, the proposer has more valuable blockspace and may want to charge more for example",
        "created_at": "2024-10-02T16:55:41.494000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "you are either arguing that IL inclusion has zero value or not",
        "created_at": "2024-10-02T16:55:51.505000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I believe that it has non-zero value",
        "created_at": "2024-10-02T16:55:56.660000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "And if we manage to mod the system in a way that a fork of a client is required, I believe that it's reasonable to expect that at least a percentage of validators will not run forked clients.",
        "created_at": "2024-10-02T16:56:35.921000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah I don't like this framing, people are running mev boost (98% or 99%) because it's (a lot!) more profitable than local building. \n\nI think people will not be willing to pay \"for maybe getting included\", when they can pay for \"getting included\" or \"getting included on some state\". If all you want is to maybe get included then send your transaction to the public mempool, pay the base fees and you have high chances to get included without bribing anyone",
        "created_at": "2024-10-02T16:59:41.842000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Let me put it a different way. Let's say I want to pay to be included and I am willing to risk not being included now cause it's not a time sensitive thing. You're right, I'm better off contacting the proposer. If the proposer does this for free, then perfect. If it does it for x \u003e 0, then it makes sense for an IL provider sell it for 0 \u003cy \u003c x",
        "created_at": "2024-10-02T17:01:18.923000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "what I'm saying is that EIP 1559 already is meant to include your txn if you pay the base fee unless the block is full, I really don't see why anyone would run a middleware for the exact same guarantees",
        "created_at": "2024-10-02T17:01:37.935000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think this is useful for pre confirmation though, that is a the solo proposer may not opt in to the pre confirmation market but 1/n IL committee member might",
        "created_at": "2024-10-02T17:01:52.760000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "not if my transaction is being censored, which is what this is willing to achieve if you are arguing that this won't happen because the network is censor resistant, then we don't need ILs to start with",
        "created_at": "2024-10-02T17:02:26.809000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "the 1/n IL committee can't give you a valuable preconf though, cause he literally can't guarantee he has the power to include your txn",
        "created_at": "2024-10-02T17:02:48.331000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "this is if the 1/n are not all the same two centralized preconfers as we have today 2 builders, all enabled because of the middleware",
        "created_at": "2024-10-02T17:03:36.456000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "this is my whole point, as soon as the market is viable, it becomes a problem",
        "created_at": "2024-10-02T17:03:49.774000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "what's the business model of these centralized preconfers?",
        "created_at": "2024-10-02T17:04:24.577000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "charge to give a preconfirmation",
        "created_at": "2024-10-02T17:04:39.040000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "they sell worthless preconfs that can't give you any guarantees you will be included?",
        "created_at": "2024-10-02T17:04:47.015000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "it's so different than mev-boost",
        "created_at": "2024-10-02T17:05:06.653000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "if every validator is connected to them they have a good chance of being good on their promise and searchers may be willing to pay for that",
        "created_at": "2024-10-02T17:05:10.789000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "if its +EV",
        "created_at": "2024-10-02T17:05:15.695000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "a good chance is just not good enough to make it a business worth running, most builders are literally struggling to be profitable, imagine the same but with selling things no one wants to buy in the first place",
        "created_at": "2024-10-02T17:06:11.508000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Well, it seems that we won't agree here, to me is crystal clear that this has \u003e 0 value, and if it does then it will be sold. You say it won't happen, I don't think we'll be able to agree because we sort of agree on the boundary conditions on the problem, just not on the outcome",
        "created_at": "2024-10-02T17:08:14.097000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "what you're ultimately saying is: there is a set of actors, their transactions are censored, and they are not willing to bribe proposers to get a guarantee their transactions will land, but it's also time-sensitive, and what they will do is bribe IL committee members instead so they can get a chance to be included, without any certainty",
        "created_at": "2024-10-02T17:08:55.045000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "and that set of conditions, is enough for literally an out of protocol market to emerge",
        "created_at": "2024-10-02T17:09:12.356000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "No actually, I am describing a generic situation of selling of some blockspace that is worth \u003e 0. If you want to have a specific situation that worries me it will be preconfirmations, but since I don't want to enter into a tangential discussion of how preconfirmations work, I describe the abstract problem of something that has \u003e 0 value cause that's already uncontestable.",
        "created_at": "2024-10-02T17:10:04.689000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "right, but then you need to be more precise about what are the conditions in which something has \u003e 0 value",
        "created_at": "2024-10-02T17:11:01.791000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "because it certainly does not have \u003e0 value in most cases",
        "created_at": "2024-10-02T17:11:29.294000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't think so, unless you are indeed making the affirmation that this has value = 0.",
        "created_at": "2024-10-02T17:11:30.958000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes I am making the affirmation that it has value = 0 in the vast majority of cases \n\nLiterally the only case I can think when value \u003e 0 about is so niche: I have a time sensitive transaction, it's censored by builders, and the proposer would charge too much or won't include it either. In that specific case I could say ok let me try to bribe an IL committee member so he can include my txn in his local IL.",
        "created_at": "2024-10-02T17:19:48.283000+00:00",
        "attachments": []
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "I really do want to convince you guys it's not an issue, happy to discuss more or jump on a call because at the end of the day if we can't convince you it'd be hard to convince other people",
        "created_at": "2024-10-02T17:20:50.488000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think the question is not about whether inclusion has any value. It is about what the additional value a middleware can offer. IL committee members are there to include your transaction. FOCIL should be designed for transactions pending in the mempool to be included within the next block. Middleware does not provide any additional value here.",
        "created_at": "2024-10-02T17:20:51.681000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's probably my misunderstanding, but I don't know why this type of market won't emerge:\n1. I have a tx that wants to be included for `n+1`.\n2. I know to be included, I have to pay the proposer of `n+1` an estimated tip of `y`.\n3. At `n`, I host an ascending auction with the IL committees, starting from a low reserve value up to `y`, and see if any of the IL committee takes my tx.\n4. If no IL committee takes it, I'm fine paying `y`, and if an IL committee does take it, I'm fine waiting another slot if the block is full (repeat the same auction)\n\nDo we just not see a solid demand for this type of market, or do we suspect an actor would not use this type of market at all?",
        "created_at": "2024-10-02T17:25:36.857000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The middleware enables a centralized server to be contacted by many validators. There are many levels of preconfirmations that different degrees of trust people can act on. Some people will be happy to act on Arbitrum's sequencer's receipt. Others will wait for the transaction to appear on an L2 block, others will wait until the block appears in a batch in L1, and others will wait until this is consumed in L2 upon L1 finality. People are willing to act differently because there's different levels of danger and safety that the transaction will be included and how. \n\nIf I am in a situation in which there are two builders that are making all Ethereum blocks, and I send them a transaction, and they both give me a receipt, I can trust that they will include it in a next block. If they are also the preconfers on which validators are connected and they include it in an IL, I get an onchain receipt, something that was seen by validators. This is the same difference than the receipt from the sequencer (that I hold and no one else saw) vs the L2 block that was seen by everyone and my tx was sequenced.",
        "created_at": "2024-10-02T17:25:38.614000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "they both can be false: the builder can lie because they already filled the block and won't include my tx, and the sequencer can lie and actually equivocate on L2.",
        "created_at": "2024-10-02T17:27:15.206000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "the cost of that lie is higher than the cost of just not doing anything after giving me a receipt, and that's what makes a receipt of an IL inclusion more valuable than the receipt from the builder that it will include my tx",
        "created_at": "2024-10-02T17:27:50.693000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "I still don't see what the value is that this middleware offers in general",
        "created_at": "2024-10-02T17:41:58.372000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The middleware allows validators sell their rights to submit inclusion lists",
        "created_at": "2024-10-02T17:42:35.544000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "It is not clear why IL committee members would be willing to take a lower fee than the proposer if they were to take a fee. Moreover, IL committee members will include your transactions anyway so there is no need to pay them out of band via middleware",
        "created_at": "2024-10-02T17:42:45.266000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "if there's anything \u003e 0 to gain from this validators may choose to use it",
        "created_at": "2024-10-02T17:42:45.663000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "What does the middleware allow the user to buy?",
        "created_at": "2024-10-02T17:43:08.021000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "because a lower fee than the proposer is better than 0 that the protocol gives them",
        "created_at": "2024-10-02T17:43:09.954000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The middleware allows the IL submitter to outsource their IL in exchange for a fee, they get zero for their work from the protocol",
        "created_at": "2024-10-02T17:43:46.191000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The buyer is incentivized if it's a monopoly",
        "created_at": "2024-10-02T17:44:02.490000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "because it gets agency to promise what the next block will have with an onchain receipt",
        "created_at": "2024-10-02T17:44:20.287000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "instead of buyer paying a tip to the proposer, the buyer just pay the IL committee out of protocol with a payment that less than tip and also get fast confirmation on a receipt under contigency that the next block wont be stuffed",
        "created_at": "2024-10-02T17:45:01.102000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "If the proposer does not accept a transaction that pays the base fee and a tip, then the proposer is censoring the tx so the transaction flowing through FOCIL is not bad. IL committee members will include the transaction anyway though. There is no need for the user to pay the IL committee members. Why would a user want to use middleware that increases their costs?",
        "created_at": "2024-10-02T17:49:01.693000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "the user does not use a middleware",
        "created_at": "2024-10-02T17:49:49.602000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "the IL members use the middleware",
        "created_at": "2024-10-02T17:49:56.360000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "they do not propose ILs they outsource it to some entity",
        "created_at": "2024-10-02T17:50:08.209000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "If your point is that all IL committee members and the proposer collude to not include transaction that do not pay a monopoly price, then yes a middleware could make sense. FOCIL relies on an honest minority assumption though. If only 1 IL committee member does not collude and is willing to honestly include transactions, then this collusion does not hold and middleware is not valuable",
        "created_at": "2024-10-02T17:51:47.610000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "no, there is no collusion here at all",
        "created_at": "2024-10-02T17:52:01.036000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "- the IL member is incentivized to sell their rights to propose an IL because they get \u003e 0\n- The users that send transactions to the builders are willing to pay to get a preconfirmation that their tx will be included and they can act on some other exchange knowing that their tx will be included (with a promisse of a different degree) \n- The proposer has nothing to do with this. If the user sends their transaction on the mempool they don't get a guarantee of inclusion and not even a promise.",
        "created_at": "2024-10-02T17:53:47.089000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don’t agree with your premise that they get \u003e 0. FOCIL is designed such that there is overlap between local ILs. If there is an honest IL committee member, it will include a users transaction, meaning the user gets included at no cost. The user is then not incentivized to pay for preconf middleware to get something it gets for free.",
        "created_at": "2024-10-02T17:55:24.892000+00:00",
        "attachments": []
    },
    {
        "author": "julianma_",
        "category": "Cross-layer",
        "parent": "",
        "content": "If all IL committee members are not honest and charge a fee and the proposer is not willing to include your transaction, then users may want to pay but again there is an honesty assumption",
        "created_at": "2024-10-02T17:55:58.686000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "When you send a transaction to the public mempool you do not get the receipt with a promise that you will be put on the IL at all, you don't get anything until you see it in the IL. And yes, in general, all CR algorithms work if there's a percentage of validators that are running vanilla software, which brings us back to the start of the discussion, it seems that that percentage on mainnet is \u003c 2% currently as they are all not running vanilla software. It does seem that we have a fundamental disagreement here",
        "created_at": "2024-10-02T17:58:11.990000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Another question to ask is: fast confirmation/instant receipt is super valuable, but how many transactions are willing to use this, given that the next slot proposer has the power to reorder those transactions at will",
        "created_at": "2024-10-02T18:02:37.285000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The reality of Ethereum today is that there are 1.5 builders making all blocks, they can be the preconfers, they are the sequencers of Ethereum and as such I think my analogy with the Arbitrum's sequencer's receipt is not really far off.",
        "created_at": "2024-10-02T18:04:00.965000+00:00",
        "attachments": []
    }
]