[
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cnero_eth\u003e What is the latest on the fee market mechanism for FOCIL?\nI assume we can do it without having users to pay for getting onto the IL (M_FOCIL in the post; no costs are desirable to not put higher expenses on censored users). Thus rely on altruism (sticky client defaults) for IL committee members to pick random transactions and put them onto their local IL. We lose the incentivation for the committee but it removes the need for a new transaction type.",
        "created_at": "2024-09-13T10:22:27.181000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I dislike having special markets for ILs, inclusion should be based on whatever clients heuristics for detecting censoring. Having a special market for ILs seems more appropriate to overloading them for preconfirmations than for a system to prevent censoring.",
        "created_at": "2024-09-13T10:42:49.457000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cnero_eth\u003e I agree. Tbf, maybe I understood something wrong and the post suggests to forward tx prio fee to IL committee instead of a separate fee for incentivicing the IL committee. Would appreciate if someone can clarify :) (re @InclusionList_bot: \u003cpotuz\u003e [reply]: I dislike having special markets for ILs, inclusion should be based on whatever clients heuristics for detecting censoring. Having a special market for ILs seems more appropriate to overloading them for preconfirmations than for a system to prevent censoring.)",
        "created_at": "2024-09-13T10:47:09.182000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "So the initial idea was: \n- If we want to reward IL committee members, we could just split priority fees between members that include a given transaction. But this becomes weird when there is congestion, because it means a builder might prefer including out-of-IL txns (paying low priority fees) than IL txns (paying higher priority fees but that go to the IL committee members, not the builder). To handle this you either need a weird way of redirecting priority fees to the builder when there is congestion, or you just handle it by adding another fee (that doesn't exist today, e.g., inclusion fee) that always go to the IL committee members, and the priority fee would always go to the builder\n- But it's worth noting we think the first version of FOCIL should be to go with Option 1 in the post, which just relies on altruistic behavior (similar to aggregators), so no rewards for IL committee members",
        "created_at": "2024-09-13T11:09:16.472000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cnero_eth\u003e This makes sense yeah. \nThinking of splitting prio fees, from the builders perspective, prio fees == coinbase_payments. So, one could pay for inclusion through coinbase payments without incentivicing committee members. E.g. searchers will want to use coinbase payments instead of prio fees to achive higher mevboost bids by not sharing parts of the profits with the committee. Not a problem, just an observation.",
        "created_at": "2024-09-13T12:34:35.722000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I also think, fwiw, that relying on altruistic behavior for IL submitters is more than fine",
        "created_at": "2024-09-13T15:59:56.961000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "In the current [spec](https://github.com/terencechain/consensus-specs/pull/2) I'm working on, I have the inclusion list aggregate in the block body to process during state transition, but this is only needed for rewards accounting. If we agree that the reward is not necessary, we should remove the inclusion list aggregate from the body, and we wouldn't need to process it during state transition at all",
        "created_at": "2024-09-13T16:06:20.904000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "sounds good to me if it's only for rewards accounting, I'm also wondering about the bitlist: I think it's still nice to keep in there for accountability/visibility on who included what txns",
        "created_at": "2024-09-13T16:43:24.836000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Another thing to note is that taking the priority fee (execution) and splitting it among the committee (consensus) is very hard. At least I haven't been able to find a clean way to do this. Consensus and execution are interleaved, consensus cannot read the priority fee today, and even if it could, it's still prone to bugs to ensure the execution layer doesn't process the priority fee and give it to the builder. At that point, you probably need a different transaction type...",
        "created_at": "2024-09-13T16:56:51.740000+00:00",
        "attachments": null
    }
]