[
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "\"I sill would prefer an IL design that does not require less time than the protocol without the IL to validate the payload.\"\n\nHere are some thoughts about this:\n\nI'm afraid there is absolutely no way around adding some time to validate the payload. To me, inclusion lists can almost be considered as an additional payload than needs to be merged with the one made by the block producer, according to some rules. In order to do this, not only do you need to validate the payload, but also that the rules to merge the IL and the payload were satisfied. Whoever is responsible of doing this (in the FOCIL case, the attesters which give us the best guarantees imo) will need to \"do more\" than what was originally in the protocol. \n\nNot wanting to add time for IL validation is equivalent to not wanting to add time for the payload validation, it just doesn't really make sense imo. If you ask attesters to do additional work (build and broadcast local ILs, validate IL/payload) then you need to allocate time for that work to be done",
        "created_at": "2024-07-15T08:56:34.944000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't agree with this, I am not requesting that IL validation doesn't take time, I'm requesting that the deadline is not shorter, that is, that validators keep the same total time to do both tasks. I do not see why there's an inherent impossibility for this. Or at the very least I haven't seen a proof of this statement",
        "created_at": "2024-07-15T11:13:45.952000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "For example: forward Focil does not have this extra time, so this in itself proves the above statement to be wrong",
        "created_at": "2024-07-15T11:15:24.813000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "isn't it just because you're asking less from the mechanism (e.g., not \"real-time\" censorship resistance) with the forward property? The more you ask for from the mechanism, the more constraints you have to deal with\n\nif we wanted to only get 1 inclusion list per epoch, then the time constraints would be even lower?",
        "created_at": "2024-07-15T12:53:18.561000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "but if you think \"ok it's not worth trading off validators' time to get real-time censorship resistance\" then it feels closer to a framing that's easier to consider/design around",
        "created_at": "2024-07-15T13:03:41.172000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I am trying to analyze the tradeoff space of all solutions. Given that same-slot FOCIL does not seem to solve the tx invalidation problem that 7547  has but that it effectively has better properties with a committee constructing the IL, I would be leaning to consider next-slot Focil rather than same-slot focil as I consider the extended validation time a better property than the \"include-immediately-this-censored-tx\" rather than the next slot (if that's what \"real-time censorship resistance\" means)",
        "created_at": "2024-07-15T15:15:09.906000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "yes that's exactly what it was referring to, I think we agree then about the trade-off then 🙂 \n\nand I don't have a super strong opinion on whether validation time matters more than real-time CR but at least now we can just list pros and cons for both options",
        "created_at": "2024-07-15T15:19:51.160000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Is there a good example on tx invalidation under same slot assumption? I've been using the following setup\n\nSlot `n` 6s: builder reveals payload\nSlot `n` 10s: IL committee reveals IL\nSlot `n+1` 0s: builder reveals bid\nSlot `n+1` 6s: builder reveals payload that satisfies IL aggregate\nSlot `n+2` 3s: attester verifies payload that satisfies IL aggregate",
        "created_at": "2024-07-15T20:42:55.475000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Transactions from the IL themselves may invalidate other transactions from the IL with conditions that can only be checked by executing them and not statically",
        "created_at": "2024-07-15T20:51:33.005000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "For FOCIL, depending on the setup (e.g., MEV-boost, epbs block auction, or slot auction), we encounter different designs and trade-offs. It seems unwise to concentrate all our efforts on a single setup. While most writeups and prototypes today focus on MEV-boost, I'm personally more interested in epbs for FOCIL.",
        "created_at": "2024-07-15T22:03:07.565000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "In the context of MEV-boost for FOCIL, we need to consider two audiences: builders and local ELs. The involvement of local ELs adds complexity, which I'll explain through the following steps:\n\n- Block `n` arrives at 3s. The CL calls EL with `fcu + prepare_payload` for `n+1`.\n- IL arrives at 6s. The CL prepares IL_Agg and calls EL with `il_agg` (a new engine-API call) for `n+1`. The EL must re-check the payload to ensure it satisfies IL_Agg, as some elements may invalidate the current payload.\n- The interaction becomes quite complex if the head changes after providing the EL with my EL_Agg. The EL must remember these changes. There are additional considerations here.",
        "created_at": "2024-07-15T22:03:25.012000+00:00",
        "attachments": null
    }
]