[
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "I was supposed to share the summary of the discussions but jetlag didn't allow me. Let me share it before next week, sorry for this delay",
        "created_at": "2025-07-03T09:49:40.858000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Is there any serious writing on how does FOCIL look like on 6 seconds slots? Bonus points if there's one with ePBS. I don't care about specific timings but I do care about time distances for latency dominant messages",
        "created_at": "2025-07-03T16:11:08.893000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "this was the only thing written up afaik",
        "created_at": "2025-07-03T16:23:06.501000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "but a general intuition is that FOCIL wouldn't add any latency dominant messages, just ILs over the CL p2p network that have a max size",
        "created_at": "2025-07-03T16:24:09.533000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks I read that one. Was hoping for something more detailed. By latency dominated I precisely mean small messages cause those are irrelevant from a bandwidth perspective and broadcast is dominated by a fixed latency per hop",
        "created_at": "2025-07-03T16:26:04.129000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I got like 4 DMs right after ACD to explain the argument I made for FOCIL in Glamsterdam, and I'd like to understand better the implementation and protocol complexity if I were to rebase it on top of shorter slots or ePBS, so as to have a realistic view and not just \"hopeful\" vibes.  It's hopeful though that Terence tells me that FOCIL becomes easier with ePBS than today but I still don't understand that argument",
        "created_at": "2025-07-03T16:28:50.367000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cfradamt\u003e FOCIL is only sensitive to slot times if we insist that the lists should be made with knowledge of the latest state, which I think is an unreasonable requirement, especially in a world with delayed execution",
        "created_at": "2025-07-03T16:32:12.038000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "With epbs, should we add auditable builder bid and optimistic attestation \u003c@917367578966523934\u003e proposed a while back? I was a fan of that but I'm not sure what the detail changes were. I think it was something like:\n- Add IL bits to builders bid\n- Proposer select bid only if it matches proposer's view of IL\n- Attester freeze view of IL at `n-1` before slot start, and compare bid in beacon block with local view. Optimistic attest if IL bits match overwise vote for previous head\n- Builder's payload must satisfy bid's IL bit list\n- Next slot proposer build on empty of payload fails to satisfy",
        "created_at": "2025-07-03T17:32:35+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sorry, maybe we should bring ^ back to \u003c#874767108809031740\u003e channel",
        "created_at": "2025-07-03T17:33:12.041000+00:00",
        "attachments": null
    }
]