[
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Does the \"one tx per sender\" rule for ILs still exist as decribed here? (I read about IL equivocation in the EIP but nothing about \"1 sender, two txs\")\nhttps://meetfocil.eth.limo/il-flooding-in-focil/#:~:text=If%20we%20were%20to%20consider%20the%20way%20transaction%20invalidation%20works%20today%2C%20this%20would%20not%20be%20an%20attack%20at%20all%2C%20as%20long%20as%20all%20IL%20inclusion%20rules%20follow%20the%20very%20simple%20principle%20of%20only%20including%20no%20more%20than%20one%20transaction%20per%20EOA%3A",
        "created_at": "2025-03-17T07:22:43.797000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "I guess we could have added the \"try appending after execution\" rule to 7547 too. It's a powerful, but dirty hack.",
        "created_at": "2025-03-17T07:25:48.037000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah right, and with block level access list we would at least know that some sender address was touched. We don't know if the balance actually decreased but we know that this EOA was somehow touched during the payload execution and based on that, we could allow the proposer to abstain from including that tx. Assuming delayed execution, attesters, by having the block + their view of ILs, can still (\"optimistically\") attest to the block and verify IL satisfaction but are reorged in case the block access list turned out to be wrong. IL satisfaction then equals to:\n* Check if all transaction are in the block's payload.\n* Check if sender of missing transaction is in the block access list.\n\nWithout delayed execution, the block level access rule would also get rid of the \"append at end of execution\"-rule.",
        "created_at": "2025-03-17T08:05:32.700000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003csoispoke\u003e Yes it does, I think we should add it to the EIP (re @InclusionList_bot: \u003cnero_eth\u003e Does the \"one tx per sender\" rule for ILs still exist as decribed here? (I read about IL equivocation in the EIP but nothing about \"1 sender, two txs\")\nhttps://meetfocil.eth.limo/il-flooding-in-focil/#:~:text=If%20we%20were%20to%20consider%20the%20way%20transaction%20invalidation%20works%20today%2C%20this%20would%20not%20be%20an%20attack%20at%20all%2C%20as%20long%20as%20all%20IL%20inclusion%20rules%20follow%20the%20very%20simple%20principle%20of%20only%20including%20no%20more%20than%20one%20transaction%20per%20EOA%3A)",
        "created_at": "2025-03-17T08:23:28.757000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003csoispoke\u003e I think the downside of being able to exclude a txn by « touching » the address is a really bad one (re @InclusionList_bot: \u003cnero_eth\u003e [reply]: Yeah, I think this is inherent to block access lists + delayed execution.\nIn some sense, block level access list and FOCIL are quite similar on the constrain that both come with new block validity checks after execution that go beyond state transition validity checks.\nAnother noteworthy downside of block level access fix is the fact that simply touching a sender address from an IL can be used to prevent forced inclusion of that entity's transaction. In practice, someone who doesn't want to include anotherone's tx might also not want to \"touch\" that address but ya.. definitly a downside.)",
        "created_at": "2025-03-17T08:25:24.787000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cnero_eth\u003e Touching an address also comes with (small) costs. Compared to the \"validate IL after execution\" rule, this approach feels like a less invasive solution,  more future-compatible, even though it does require block access lists as a prerequisite. On the other hand, touching can be very very cheap and the costs for builders might be too low to \"convince\" them of stopping censoring. Not sure.\nIf we'd do block access lists with values and intermediate values, we could statically tell if an account's balance was drained. (re @soispoke: I think the downside of being able to exclude a txn by « touching » the address is a really bad one)",
        "created_at": "2025-03-17T08:52:09.539000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003csoispoke\u003e Right yeah I meant block access lists without values is an obvious no-go for me, it’s basically giving the option of cheaply circumventing the whole mechanism",
        "created_at": "2025-03-17T09:05:21.636000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003csoispoke\u003e also not 100% sure how it would work with values exactly, but having a specs or a doc for it would be very nice to look at",
        "created_at": "2025-03-17T09:09:47.635000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e \u003c@792404665068158998\u003e could you elaborate a bit on what you mean with the bitlist and the “append at end of execution”-rule are dirty hacks? Is there any conceptual property of Ethereum that it breaks or is it more related to implementation complexity?",
        "created_at": "2025-03-17T10:29:07.962000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e Also responded in the hackmd to the attesters that did everything right but did not get rewarded.\n\nThe attesters who did everything right but did not get rewarded are not a problem, at least from the incentives side. Attesters receive incentives to do everything right. The incentives worked in this case. The point you are alluding to here is that they perhaps do not receive enough yield if they are not rewarded even though they do the right thing. I think there is insufficient support for that though and we could always increase rewards somewhere else. Check out Section 7.3 from this Anders post which talks about it really nicely: https://ethresear.ch/t/rainbow-roles-incentives-abps-focilr-as/21826",
        "created_at": "2025-03-17T10:30:00.556000+00:00",
        "attachments": null
    },
    {
        "author": "cperezz.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Unsure if this is the correct place to ask. But let's go.\n\nAre there any benchmarks on how IL propagation actually affects CL's networking latency? Same for bandwidth for individual participants.\nConsidering specs in https://github.com/ethereum/consensus-specs/blob/e678deb772fe83edd1ea54cb6d2c1e4b1e45cec6/specs/_features/eip7805/p2p-interface.md and a non-neglegible size (as per my understanding, I might be wrong ofc) of ILs, how much do we expect it to impact other protocols within CL that also require message broadcasting and propagation?\n\nThanks!",
        "created_at": "2025-03-17T10:54:19.275000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cfradamt\u003e one important thing here is that IL propagation is meant to happen away from the critical path of the slot (block/blob propagation), (re @InclusionList_bot: \u003ccperezz.eth\u003e Unsure if this is the correct place to ask. But let's go.\n\nAre there any benchmarks on how IL propagation actually affects CL's networking latency? Same for bandwidth for individual participants.\nConsidering specs in https://github.com/ethereum/consensus-specs/blob/e678deb772fe83edd1ea54cb6d2c1e4b1e45cec6/specs/_features/eip7805/p2p-interface.md and a non-neglegible size (as per my understanding, I might be wrong ofc) of ILs, how much do we expect it to impact other protocols within CL that also require message broadcasting and propagation?\n\nThanks!)",
        "created_at": "2025-03-17T10:56:33.394000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "This approach creates a situation where honest attesters might attest to an invalid head, simply because the IL satisfaction check is delayed under delayed execution. As a result, attesters could be incentivized to wait longer (attester timing games), executing the block to verify its IL validity before casting their votes. I don't believe this is concerningly realistic but it does introduce additional complexity.\nCurrently, we only check the validity of a block (and the stf) at the end of the block and don't have to deal with doing anything else at this stage (just computing the state root and comparing header fields). With FOCIL, we have to compute the final state root and then, after doing so, perform more validity checks, namely those I refer to as \"try to append\"-rule.\nI'm not a fork-choice expert, but when you see a block with strong support (for example, 30k attesters voting for it as the head) being force-reorged, that’s what I mean by a \"hack.\"",
        "created_at": "2025-03-17T11:14:34.626000+00:00",
        "attachments": null
    },
    {
        "author": "cperezz.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ye. I agree. But my concern is not IL being affected by latency (it can be executed 3blocks after Tx selection).\n\nIt's more a concern about p2p network consequences of IL distribution and propagation. Not about FOCIL working correctly (which it will AFAIU).\n\nMaybe I missunderstand \n\u003e IL propagation is meant to happen away from the critical path of the slot (block/blob propagation)\nSo please feel free to elaborate more",
        "created_at": "2025-03-17T11:21:18.174000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Since ILs are propagated in a different part of the slot than blocks and blobs, what p2p consequences would you expect?",
        "created_at": "2025-03-17T11:25:27.612000+00:00",
        "attachments": null
    },
    {
        "author": "cperezz.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "When you say different part of the slot, what do you mean? At a different timing? \nAlso, slot as in SSF? Same concept of slot?",
        "created_at": "2025-03-17T12:58:50.566000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah at a different time. Slots as in today's slots, 12s where block propagation only happens in the first 4s",
        "created_at": "2025-03-17T13:00:16.333000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "- I don’t think attesters will even have the option of doing the execution before voting (if execution is truly time/resource consuming, which is the whole reason delayed execution was proposed), they would miss the attestation deadline and the timeliness rewards. \u2028\n- Reorging after the fact isn’t really a hack to me, it’s more just a consequence of doing delayed execution: it involves enforcing rules “after” attesters vote. Wouldn’t it be the exact same thing with block access lists btw, if the header access list against the actual accesses derived during execution after executing all transactions doesn’t match, the block is deemed invalid right? \u2028\u2028If that’s the case, then reorging after attesters have voted has a lot more to do with delayed execution than with FOCIL per se.",
        "created_at": "2025-03-17T13:10:48.229000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "A way to deal with the relationship between block access lists and delayed execution is:\n- the builder pays for each access list entry upfront\n- for any extra entry, they don't get reimbursed\n- for any missing entry (a tx tries to access something not in the list), the tx is skipped (and the builder is not refunded for the inclusion cost as normally in delayed execution)\n\nYou can't invalidate the block, because with delayed execution we want to ensure that the block's validity can be determined (statically) at voting time",
        "created_at": "2025-03-17T13:14:03.842000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "With FOCIL, the issue is that you can't get the builder to pay upfront for anything related to the ILs, so we lose the main tool that we use to make things work with delayed execution",
        "created_at": "2025-03-17T13:15:16.955000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "ah right, ok that makes sense",
        "created_at": "2025-03-17T13:16:27.633000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "you might say it's even more hacky but would there be a way to still reward attesters who have voted for a block, even if it got reorged because it wasn\"t satisfying IL conditions?",
        "created_at": "2025-03-17T13:17:33.219000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Right, we can charge for block-level access lists and create strong incentives that they are correct, and in case they're not, someone (the block builder who's fault it was) pays for it.\nThis was the starting point for why I once suggested to handle ILs the same (pre-charge someone and don't refunds in case of IL violation - instead of reorging).",
        "created_at": "2025-03-17T13:19:13.517000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "right, except this requires charging senders for their full gas limit instead of gas used because it's not always the builder's fault (any progress there? is it even something we can consider?)",
        "created_at": "2025-03-17T13:23:43.065000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "attesters would have certainty that when they voted, the access list cannot invalidate the block anymore (even though it can be wrong). For FOCIL, the problem is, you only get that guarantee after execution. \nWe could do something like pre-charge coinbase and refund in the next slot if the IL was satisfied (and burn if not) but this changes the design by a lot and might have other issues I'm not aware of right now.",
        "created_at": "2025-03-17T13:24:23.357000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't know how you can do that. ILs are specifically not meant to be on chain, so satisfiability cannot be determined during execution",
        "created_at": "2025-03-17T13:26:17.316000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "that's what I mean by this. We just don't have the tool of pre-charging the builder at our disposal when it comes to FOCIL",
        "created_at": "2025-03-17T13:26:55.643000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "No, this shouldn't require charging full gas limit. We'd charge the builder x gas per entry on the access list. If a transaction steps outside the access list - block invalid. At end of execution, builder get cost of all valid access list entries refunded. The funds spent on access lists that weren't used can be burnt.",
        "created_at": "2025-03-17T13:27:41.788000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "If the access list is wrong, it's the builders fault bc the builder must know which storage slots were accessed and which not.",
        "created_at": "2025-03-17T13:28:44.722000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ah, you meant pre-charged ILs + full tx.gas charging. I misunderstood. Yeah. That's correct",
        "created_at": "2025-03-17T13:29:46.894000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "We could charge a fixed amount (e.g. basefee * target) though.",
        "created_at": "2025-03-17T13:30:51.086000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah my q was about progress on whether we could even consider going for full tx.gas charging, if that's even an option or if it involves too many second order effects",
        "created_at": "2025-03-17T13:37:30.202000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't think anyone has been seriously thinking about it :/",
        "created_at": "2025-03-17T13:42:25.470000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "maybe good ROP candidate?",
        "created_at": "2025-03-17T13:42:32.718000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Still catching up, but one thing I'll add is that pre-charging any Coinbase upfront introduces a high degree of implementation complexity. We would either need to introduce another signing scheme to the CL or add another signer to the EL, both of which are non-trivial",
        "created_at": "2025-03-17T13:46:45.892000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "When charging full tx.gas would give us is a very slim execution pipeline. Basically we could do all nonce + balance checks before execution, then execute and handle refunds and gas left after execution, not allowing transaction to interfere with each other (draining balances etc).",
        "created_at": "2025-03-17T13:53:43.814000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Don't know about anything concrete though.",
        "created_at": "2025-03-17T14:18:35.953000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "the whole point of delayed execution is that it enables us to work with payloads that **cannot be executed** before the attestation deadline.  At any rate, the builder/pool timing game will evolve always to produce the block as soon as the attestation deadline as possible, and if attesters do not need to execute, even if they have the payload (which they don't for example in 7732 and I would argue similarly for 7886) then we should expect the block to arrive with this timing information in advance. That is, attesters will not be able to execute the full payload  safely before attesting.",
        "created_at": "2025-03-17T15:32:49.204000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "But as far as I see the issue here appears with 7886-type delayed executions and not 7732 right? because we can always invalidate the payload in the latter, without caring about refunds/precharges, etc.  and there's no free DA leakage. Attesters only attest for the parent payload validity of the IL and the current IL inclusion bits",
        "created_at": "2025-03-17T15:37:46.445000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "7732-style delayed execution doesn't (seem to at least?) need to deal with precharges etc..., that's true. Afaict that doesn't change much about the relationship with FOCIL though? If you don't require the PTC to have executed the block, you still need to do the two-step enforcement thing with IL inclusion bits etc..., just with PTC + next attesting committee rather than attesting committee + next attesting committee",
        "created_at": "2025-03-17T15:39:53.482000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I like the modification that \u003c@917367578966523934\u003e proposed of including the IL bits in the bid so that attesters can actually preemptively signal IL agrees with their forkchoice view",
        "created_at": "2025-03-17T15:44:17.943000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "that way the IL bits can be made part of block validity",
        "created_at": "2025-03-17T15:45:01.074000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Going back to the 7886-style delayed execution + FOCIL, this could be a way to deal with it without the two-step enforcement:\n\n- Charge senders upfront for `tx.gas`, but do refunds after execution (so from the user's perspective, nothing changes, you're not required to estimate your `tx.gas` more precisely than today)\n- Builder adds a `claimed_gas_used` to the header and is charged upfront for it. Compared to 7786, the difference is that it is charged for all gas used and not just for the inclusion costs\n- Require `inclusion_cost \u003c= claimed_gas_used \u003c= gas_limit`\n- If during execution we get to `claimed_gas_used`, revert and skip the current tx and skip the rest of the block.   \n- The builder gets the fees of all non-skipped txs. Basically they don't get refunded the cost of skipped txs (`claimed_gas_used` too low) or the unused gas (`claimed_gas_used` too high)\n- for FOCIL enforcement, use `claimed_gas_used`. If for an IL tx `tx.gas` fits in `block_gas_limit - claimed_gas_used` , sender account has enough to cover`tx.gas` and nonce is sequential, then it is enforced.\n- The builder can't freely \"claim-stuff\" the block by setting `claimed_gas_used` to `block_gas_limit` to prevent IL enforcement, because it doesn't get refunded the unused gas (the cost is the same as actually stuffing the block)",
        "created_at": "2025-03-17T15:45:56.144000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Didn't get to it yet, will take a look",
        "created_at": "2025-03-17T15:46:11.126000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "Is the main downside the fact that builder have to keep a higher ETH balance to pay upfront for all gas used, not just inclusion costs?",
        "created_at": "2025-03-17T17:26:08.458000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sorry I am back. Had a quick look on this, looks like Lodestar is correctly issuing a V5 call in eip7805 fork, but got rejected by Geth. Perhaps it passed in some wrong params, or Geth is misconfigured. Let me take a close look",
        "created_at": "2025-03-17T18:56:19.894000+00:00",
        "attachments": null
    }
]