[
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Right, thanks for the answer! It turned out that I was looking an old version. I've updated Prysm to calculate IL submission and view free deadline relative to `seconds_per_slot`. Anyone wants to try it out could use this [Kurtosis config](https://github.com/jihoonsong/local-devnet-focil/blob/7affa6e599e32d7189c83e295d72b8170293c5cc/kurtosis/kurtosis.config.registry.interop.yaml).",
        "created_at": "2025-04-07T03:35:20.720000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "However, it seems Lodestar often times doesn't produce IL when I set `seconds_per_slot` to 6. cc \u003c@1035747431461167125\u003e",
        "created_at": "2025-04-07T03:36:13.419000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "After the recent update, Dora turns to show blank slot panel like this after few seconds. It's a bit annoying as I have to refresh the page to see the progress. Is this a feature? \u003c@199561711278227457\u003e",
        "created_at": "2025-04-07T03:36:48.328000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "Screenshot_2025-04-07_at_12.28.39_PM.png",
                "content": "d500cdfc7800ea7cecc5c896d1bb0bb5267ddf4a994a3437595c4f97f58eb17c"
            }
        ]
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "Right, we currently hard code ILC to call EL getInclusionList 5s after receiving the block. So there might be a chance it broadcasted too slow. The 5s hack was due to previously lodestar called EL too soon and EL returned empty IL. I’ll see how I should adjust this",
        "created_at": "2025-04-07T04:06:33.539000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "In Prysm, setting it submission deadline - 1 works. i.e., seconds_per_slot * 2 // 3 - 1. Perhaps you might want to try this out? I'll be investigating the geth issue this week btw",
        "created_at": "2025-04-07T04:16:07.104000+00:00",
        "attachments": null
    },
    {
        "author": "0xunclebill",
        "category": "Cross-layer",
        "parent": "",
        "content": "Am I right in understanding that we're treating eip7805_fork as a \"real fork\" with its own fork digest?\n\nI was hoping we'd handle it the same as with the PeerDAS POC where it just had an activation epoch, but isn't actually treated as a distinct fork. \n\nsince we have no beacon block/state changes, it seems like an activation epoch is all we'd really need.",
        "created_at": "2025-04-07T04:19:41.626000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "+1. Just an activation epoch change will be my preference. Keep this minimal",
        "created_at": "2025-04-07T04:24:41.753000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm also the opinion that it's better to be more or less an activation epoch. No metadata change, etc. Relevant discussion: https://discord.com/channels/595666850260713488/1355235673417973770/1356317282720026724. We could talk about this in the upcoming breakout, if that helps.",
        "created_at": "2025-04-07T04:28:34.459000+00:00",
        "attachments": null
    },
    {
        "author": "0xunclebill",
        "category": "Cross-layer",
        "parent": "",
        "content": "ah okay, I missed this discussion. For Lighthouse, if we treat it as an activation epoch it saves us from having to write a ton of boilerplate (or some hacks to enable the transient eip7805 fork). But yeah we can chat more at the upcoming breakout, thanks!",
        "created_at": "2025-04-07T04:33:20.036000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "I was told by \u003c@363800010518822915\u003e  that that holds true for Prysm, too. Yes it would be nice to talk about this in the breakout, thank you!",
        "created_at": "2025-04-07T04:34:45.779000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think eip7805 poc in general is mirroring eip7732 poc. I see in Kurtosis's code, eip7805 and eip7732 are both defined in the same place. And also for now yes, there is no block/state change, but nothing in focil design is set in stone yet. Moving to a activation epoch approach will limit us in exchange for easier implementation for now (which Prysm and Lodestar have already accomplished)",
        "created_at": "2025-04-07T04:39:32.456000+00:00",
        "attachments": null
    },
    {
        "author": "0xunclebill",
        "category": "Cross-layer",
        "parent": "",
        "content": "fair enough. on our end, its about 2k lines of boilerplate to support the eip7805 fork, or alternatively some hacks which i've spent some time trying to get working with no success as of yet. \n\nso yeah i'm a big proponent of the activation epoch  but I may be a bit biased.\n\nfwiw, if the plan is to keep inclusion lists ephemeral and not store them on chain, i think its a relatively safe assumption that the activation epoch is all we'll need.",
        "created_at": "2025-04-07T04:53:43.780000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Not storing IL onchain is to prevent free DA. So I think this wouldn't change unless we find a good reason to store it along with free DA prevention mechanism.",
        "created_at": "2025-04-07T05:01:46.492000+00:00",
        "attachments": null
    },
    {
        "author": "nflaig",
        "category": "Cross-layer",
        "parent": "",
        "content": "Not sure it's a good idea to draw a line based on \"since we have no beacon block/state changes\", there are many other parts that are fork-based, just a few examples\n- new containers use fork as namespace\n- subscribing to new gossip topic\n- calling new engine api method\n- checking new spec constants\n- spec test iterator (curious if you could run spec tests if you do that)\nNow we could hack the code to use `epoch` instead of fork sequence in those places but that gets us further away from the final implementation. I think in Lodestar we could use the same `fork_version` as electra so this might fix interop issues but as general design this doesn't seem ideal just to safe some boilerplate, maybe I am biased as well because in Lodestar, it's just ~200 LoC to add a new fork but it's actually good boilerplate as it keeps a clean separation of new code and doesn't squeeze in FOCIL stuff into electra.\n\nBased on the BPO \"fork\" discussion, this is likely gonna be a big issue for Nimbus so I would probably let them chime in.",
        "created_at": "2025-04-07T07:57:42.820000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "For **FOCIL breakout session #8**, we will have 2 presentations tomorrow at 2pm UTC:\n- \u003c@981249983196041218\u003e on IncluderSelect\n- \u003c@1196861125267030038\u003e on zkFOCIL\n\nagenda: https://github.com/ethereum/pm/issues/1435\nannouncement: https://x.com/soispoke/status/1909235992915063181",
        "created_at": "2025-04-07T13:29:10.843000+00:00",
        "attachments": null
    }
]