[
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "Why would we need `MAX_REQUEST_INCLUSION_LIST` for reqresp response? It is safe to assume one IL committee member has at most one IL to be considered so we can just do `List[SignedInclusionList, IL_COMMITTEE_SIZE]`. Unless there are some future focil design that allows a committee member to have multiple ILs accepted",
        "created_at": "2025-01-10T02:19:03.672000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks for this, on this point: \n\u003e ... They fail on congestion\n\nWhy is that the case? In the scenario you're describing, the builder is incentivized to include the IL even on congestion",
        "created_at": "2025-01-10T11:03:12.577000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cfradamt\u003e If the current builder is the same one who provided the preconf, then they don't need the IL at all because they are in control of blockspace. If it's two different entities, then the one who provided a preconf (that they're trying to ensure works out through the IL) does not have much of a guarantee, because the block could just be full and the IL does nothing. And if the block wasn't full, the only reason why you wouldn't be included without being in an IL is actual censorship",
        "created_at": "2025-01-10T11:26:34.685000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cfradamt\u003e Any IL market is at most a market for not being censored, because that's the only thing ILs actually do in this design",
        "created_at": "2025-01-10T11:27:15.026000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "What I'm thinking is on a double commitment, that for certain IL proposers the builders are committed to include their ILs (they participate in some based roll-up system for example) and for certain block proposers (from the same rollup) they are committed to include their own preconfs. Thus they're incentivized to do both.",
        "created_at": "2025-01-10T20:01:11.707000+00:00",
        "attachments": []
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think it's better to identify the actors as follows:  \n1. Proposer  \n2. IL proposers  \n3. Builders competing in mev-boost  \n4. Builders competing in il-boost  \n\nThen my best argument for a market to exist:  \n- (1) can't be selling IL because then ppl should just buy from the proposer\n- (2) are selling, and preferably 1/n—the more competition, the lower the value  \n- (3) and (4) work best if they are the same player behind the scenes",
        "created_at": "2025-01-10T21:03:25.625000+00:00",
        "attachments": []
    }
]