[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Block building is currently centralized and two gateways produce essentially all blocks. Every single validator is connected to these two entities via a single middleware. Was there ever an answer as to why the following is not a  probable outcome to FOCIL:\n1. I write a middleware like commit boost. All proposers connect to it. \n2. Searchers send bundles to a centralized party that sells bottom of block inclusion. \n3. IL Proposers get their ILs from the middleware. \n4. Proposer gets the block big from the middleware that enforces the right preconf gateway was used for the ILs and it corresponds to the builder of the block. \nCC \u003c@361447803194441738\u003e you've been thinking about preconfs. I'm just skeptical that ILs aren't profitable to sell.",
        "created_at": "2025-01-06T00:53:35.305000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "That's what I remembered. We had a lengthy conversation about the out-of-protocol commit boost market being viable. I think the last discussion ended with Julian releasing this post: https://mirror.xyz/julianma.eth/Gnd8N1IsoHuGHRisp6nCldlt72ZacoXUA-O76qQN3mc. There hasn't been any discussion since then. I haven't really read the post deeply yet, note to self to read it this week...",
        "created_at": "2025-01-06T01:11:23.413000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes I remember that document, my question remains though.",
        "created_at": "2025-01-06T02:10:47.535000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "What are some examples of profitable transactions in end-of-block positioning?",
        "created_at": "2025-01-06T06:12:12.020000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Is there anything that can be done to make it so people don't want to be included?  Could the transactions have 1 block delayed execution to add a disincentive to wanting to get in (later inclusion is almost always worse)?",
        "created_at": "2025-01-06T06:14:14.495000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Could we make it so transactions that are force included have to pay a higher base fee?  I'm not a huge fan of this, but it may be worth a small percentage increase to base fee in order to get stronger guarantees of censorship resistance.",
        "created_at": "2025-01-06T06:16:10.701000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Cross-layer",
        "parent": "",
        "content": "If you have a tx where you want to be sure that it is included in the first \"half\" of the block (measured in gas units) then create a tx with a gas limit which is half of the block gas limit. It can then not be included in the block if more than half of the block gas limit is already spent",
        "created_at": "2025-01-06T06:59:08.223000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Cross-layer",
        "parent": "",
        "content": "Expensive, but interesting.",
        "created_at": "2025-01-06T07:07:06.034000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Cross-layer",
        "parent": "",
        "content": "Note that this does not necessarily consume all gas: sender just has to have enough funds to cover that gas. So if you would have a simple eth transfer, but do not want it to be included in the last half of the block, you thus send the eth transfer with a gas limit of half the block gas limit. But, you still pay for 21000 gas units after the execution (you just have to have enough upfront cost in order for the transaction to be included at that point), you wil not have to pay half the block gas limit for the execution.",
        "created_at": "2025-01-06T07:11:15.909000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e The answer is that there is no known way to profit from such a middleware (that does not sell censorship resistance) and even if there were, that market would not be as centralized as the block building market is.\n\nYour example does not work because searchers need to submit their bundles privately, otherwise they will be frontrun by someone else capturing the opportunity. In FOCIL, ILs become public before being included in the block. In other words, there would be no searcher demand for this product. (re @InclusionList_bot: \u003cpotuz\u003e Block building is currently centralized and two gateways produce essentially all blocks. Every single validator is connected to these two entities via a single middleware. Was there ever an answer as to why the following is not a  probable outcome to FOCIL:\n1. I write a middleware like commit boost. All proposers connect to it. \n2. Searchers send bundles to a centralized party that sells bottom of block inclusion. \n3. IL Proposers get their ILs from the middleware. \n4. Proposer gets the block big from the middleware that enforces the right preconf gateway was used for the ILs and it corresponds to the builder of the block. \nCC @paulhauner you've been thinking about preconfs. I'm just skeptical that ILs aren't profitable to sell.)",
        "created_at": "2025-01-06T08:35:28.560000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e Could you elaborate a bit why the question remains? The post is intended as a rough theoretical argument as to why FOCIL will not suffer from these sorts of out-of-protocol markets. Do you disagree with a specific argument or perhaps think an argument is not convincing enough? (re @InclusionList_bot: \u003cpotuz\u003e Yes I remember that document, my question remains though.)",
        "created_at": "2025-01-06T08:36:36.494000+00:00",
        "attachments": null
    },
    {
        "author": "matthewkeil",
        "category": "Cross-layer",
        "parent": "",
        "content": "Quick Poll for Breakout Room Day.  The original meeting was scheduled for 14:00UTC on Friday and on the call we suggested 14:00 UTC on Wednesday.  The second call is scheduled for Wednesday but I mentioned putting it up to a vote for subsequent meetings.  \n\nhttps://github.com/ethereum/pm/issues/1238\n\nPlease signal your preference via:\n🟢  for Wednesday\n🔴  for Friday",
        "created_at": "2025-01-06T09:37:08.569000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The searcher does send their bundle privately, they only get revealed when the middleware has every piece on place, just like MEV boost. There are several variations, from clients blind signing (requires modification to clients)",
        "created_at": "2025-01-06T09:59:12.179000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also these are bottom of blocks commitments from the builders, not subject to frontrunning, something that is being sold already today",
        "created_at": "2025-01-06T10:00:26.983000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes I disagree with the thesis of that document in a few places. I think I've already argued so here, but I'll get back to you in a couple of days with a more concrete design (overwhelmed now for a few days to catch up with past due work)",
        "created_at": "2025-01-06T10:08:19.540000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "At any rate it'd be nice to hear if not preconf teams directly (there's a conflict of interests) from people that have worked on commit boost for example, that's why my ping to Paul",
        "created_at": "2025-01-06T10:10:36.712000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e Sure the bundle can be private until the IL is released but searchers today care about privacy until their transaction is confirmed in a block. Submitting bundles privately to an IL is like submitting bundles to the public mempool. (re @InclusionList_bot: \u003cpotuz\u003e [reply]: The searcher does send their bundle privately, they only get revealed when the middleware has every piece on place, just like MEV boost. There are several variations, from clients blind signing (requires modification to clients))",
        "created_at": "2025-01-06T10:12:42.646000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e ILs are not commitments though. If a searcher submits a bundle aiming to extract bottom of block MEV, any other searcher, in particular the block builder, can steal the MEV opportunity. This is exactly why searchers require privacy (re @InclusionList_bot: \u003cpotuz\u003e Also these are bottom of blocks commitments from the builders, not subject to frontrunning, something that is being sold already today)",
        "created_at": "2025-01-06T10:14:00.266000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e Sounds good! (re @InclusionList_bot: \u003cpotuz\u003e [reply]: Yes I disagree with the thesis of that document in a few places. I think I've already argued so here, but I'll get back to you in a couple of days with a more concrete design (overwhelmed now for a few days to catch up with past due work))",
        "created_at": "2025-01-06T10:14:08.631000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think this also assumes all IL committee members actually collude, because if only one of them chooses not to use \"IL-boost\" and include transactions from the public mempool directly, then FOCIL works as intended",
        "created_at": "2025-01-06T10:20:15.916000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "In part yes, I'll work the non colluding argument soon, but today over 98% of validators use MEV boost, so it's not out of a hat",
        "created_at": "2025-01-06T10:21:35.313000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ok, looking forward to it! But in fact, it only works if the block producer (proposer or builder) is colluding as well and doesn’t front/backrun bundles in ILs he receives before constructing the full exec payload. And yes more than 90% of validators use MEV-boost, because there is significant value in doing so (which I still don't think is the case for FOCIL, because of its properties =\u003e conditional, unordered, anywhere-in-block and txns made public before the block producer gets the last look)",
        "created_at": "2025-01-06T10:30:33.965000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e MEV-boost doesn’t have a colluding element though. In fact, proposers do not run a software in which they collude to sell blocks to extract multi-slot MEV. (re @InclusionList_bot: \u003cpotuz\u003e [reply]: In part yes, I'll work the non colluding argument soon, but today over 98% of validators use MEV boost, so it's not out of a hat)",
        "created_at": "2025-01-06T10:32:07.641000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "",
        "created_at": "2025-01-06T10:47:00.036000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "Screenshot_2025-01-06_at_10.45.41.png",
                "content": "0cb972e1261b645abcc4d2484160a28bf1a073d97ff3844d2080724404e643d0"
            }
        ]
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is already the case today when they are selling bottom of block, the builder is a trusted entity (or a restaked entity if  they'd follow my design with 7732 in place) in preconf cosntructions",
        "created_at": "2025-01-06T14:07:03.362000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah what I mean is IL-Boost includes MEV-Boost in this doom future, they aren't separate pieces of software",
        "created_at": "2025-01-06T14:08:05.116000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think the  difference here is in potuz's model, searchers and builders all submit to the same gateway. So now imagine you are a pre-conf buyer. (ex: for tx inclusion that is ordering dependent), Today I only can buy it from 1 seller that is the block proposer, in focil I can buy it from 17 sellers. The requirement is they all go through the same gateway",
        "created_at": "2025-01-06T15:03:20.487000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "Screenshot_2025-01-06_at_7.00.20_AM.png",
                "content": "e4925a938bb7f854a539301008172f718b6864cd213b1997b7b524f812736878"
            }
        ]
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes, I mean if all validators decide to not follow the protocol honestly, collude and agree not to include any transactions pending in the public mempool anyways (choosing instead to rely on centralized parties to build ILs for them) then there is not much hope!",
        "created_at": "2025-01-06T15:29:04.322000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't think that's true, for txn inclusion ***that is ordering dependent*** you can only get it from the proposer.\n\nFor inclusion only (ordering agnostic) you could buy it from IL committee members, but then again your txn or bundle will be made public to everyone including the proposer who has a last look/say so he can place your txn anywhere he wants.\n\nTo sum up: \u2028\n- If you want preconfs and ordering guarantees, dealing with the builder directly is much easier (no need to go through IL committee members)\u2028\n- If you want to be included (no ordering guarantees), just submit via the public mempool and honest IL committee members will include your txn in their ILs.\u2028\n- The only case in which it's worth trying to get your txn into an IL rather than through the public mempool is when the proposer is actively censoring this transaction. This will never get you ordering guarantees, but will force the builder to include it in its block.",
        "created_at": "2025-01-06T15:29:14.676000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "ah, sorry for the typo. I do meant ordering indepdent in my original sentence... \nThe only market I'm thinking is the following, but not sure if such market exists, better to have the pre conf team chime in\n- the tx itself is ordering independent\n- the tx sender will like and pay for a fast UX response (ie L2-like UX)\n- proposer of the subsequent slot is not selling pre conf\n- 1/n IL proposer is selling pre conf",
        "created_at": "2025-01-06T15:41:15.954000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "ah yes then I agree, the only thing I would add is: your preconf going through ILs is always going to be \"weaker\" than one given by the proposer because the proposer could always miss its slot (intentionally or not), or fill its block and not include the txn",
        "created_at": "2025-01-06T15:46:39.257000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "Right, it’s weaker than going through the main proposer, but the main proposer is not selling to you, so the second-best option is to go through the IL proposer. I think the auction can be designed so that if the slot is missed, the pre-conf buyer doesn’t have to pay anything, as if the exchange never happened",
        "created_at": "2025-01-06T15:51:01.469000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e The value of a preconf from an IL proposer should be close to zero (unless your transaction would be censored by the block producer), because:\n1) there is very little added value over sending a transaction to the public mempool since transactions from the public mempool should also be included in a block.\n2) There are 16 IL proposers out of which there should be a large number willing to sell such preconfs driving the price to buy such a preconf to zero because of competition (re @InclusionList_bot: \u003cterence0083\u003e [reply]: ah, sorry for the typo. I do meant ordering indepdent in my original sentence... \nThe only market I'm thinking is the following, but not sure if such market exists, better to have the pre conf team chime in\n- the tx itself is ordering independent\n- the tx sender will like and pay for a fast UX response (ie L2-like UX)\n- proposer of the subsequent slot is not selling pre conf\n- 1/n IL proposer is selling pre conf)",
        "created_at": "2025-01-06T15:57:09.417000+00:00",
        "attachments": null
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cjulianzma\u003e Moreover, it is not a market that seems to gravitate towards centralization as there is little sophistication or barriers to entry necessary/to overcome to provide such preconfirmations",
        "created_at": "2025-01-06T15:58:10.747000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm not sure if such a product exists or is profitable, or if I'm just imagining things. Suppose you're an exchange with ~15% of the stake—you could act as an IL proposer ~90% of the time and essentially become a \"poor man's\" version of an L1 sequencer, selling pre-confirmation UX. Even if a transaction doesn't get included, it can still make it through the public mempool. For point 1, the question is whether people would pay for it. My initial thought is that they would, but we need input from the pre-confirmation team. For point 2, I don't have a strong argument—it's beyond my expertise. Hopefully, a competitive market would eliminate it...",
        "created_at": "2025-01-06T16:20:19.524000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "I was thinking we could skip this week and schedule the next FOCIL breakout room for next week if that's alright with people. I would love for people who have been working on it during the holidays to share updates but I wouldn't want to rush them into it. Then we can plan and schedule a more regular cadence for breakout sessions if everyone is onboard. Does this sound good? The alternative would be having a quick breakout session this wednesday.",
        "created_at": "2025-01-06T18:31:18.275000+00:00",
        "attachments": null
    },
    {
        "author": "jacobkaufmann",
        "category": "Cross-layer",
        "parent": "",
        "content": "I would be in favor of moving it to next week",
        "created_at": "2025-01-06T20:26:31.636000+00:00",
        "attachments": null
    }
]