[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I thought this is still an issue for local blocks. Builders do prepare both blocks but the local El still ignores FCU to an old head afaik",
        "created_at": "2025-01-15T00:49:25.256000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Get proposer head is still optional in the spec isn't it? \n\nThe mechanism to deal with reorgs changes with or without EIP-7732 and instead of modifying this one I'd go with enshrining the right reorg mechanism when this solidifies. I haven't touched get_proposer_head either in EIP-7732 in the hopes that we will eventually merge a mechanism that guarantees these reorgs",
        "created_at": "2025-01-15T00:57:34.292000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Cross-layer",
        "parent": "",
        "content": "yes as far as I know nothing has changed here",
        "created_at": "2025-01-15T01:25:21.192000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "For Electra testing, we are on:",
        "created_at": "2025-01-15T03:12:43.536000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "A quick writeup on FOCIL and reorg late block. Does this look right? https://hackmd.io/@ttsao/focil-reorg-late-block cc \u003c@602753420033785856\u003e \u003c@520034910149410861\u003e or are you thinking of something else",
        "created_at": "2025-01-15T03:19:43.455000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ah ok I see your point! Yes I guess users could more easily set priority fees to 0 and get included by IL committee members. If the goal is only to get included, I think that's fine: their transactions are still valid according to the protocol (i.e., as long as they pay the base fee) so in theory they should be included even if they don't tip proposers/builders. \n\nNow imagine users decide to use the priority fees to pay to the IL committee instead, just to get included (do you just pick one? do you split the fees and send across all IL committee members?). The fees should be insignificant, because you could always just send you txn to the public mempool and expect it to be picked up by one of the IL committee members anyway? I agree this is not a perfect design, that's why we're working on a proper transaction fee mechanism for FOCIL (e.g., priority fees could be split across IL committee members that include a txn, or there could be a dedicated \"inclusion fee\", see https://ethresear.ch/t/towards-attester-includer-separation/). We have a grantee from Nethermind research working on this specifically, we have already published a post about ideas in that direction (https://ethresear.ch/) and are planning on spend more time/resourcs figuring this out! \n\nBut we think it's good enough for a first version of FOCIL to rely on altruistic behavior from IL committee members, and most importantly it still prevents MEV transactions (that want to be executed on a particular state) to use FOCIL as a vehicle and crowd ILs.",
        "created_at": "2025-01-15T08:34:41.719000+00:00",
        "attachments": null
    },
    {
        "author": "nflaig",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks for the detailed response 🙏 \n\n\u003e Now imagine users decide to use the priority fees to pay to the IL committee instead\nExactly this what I had in mind but you might be right that it's not a lot of value to be made here because if there is congestion (ie. higher priority fees) then the blocks might be full so IL transactions don't make it in. I agree for now we don't need to worry about addressing this and great to see so much research being done around how ILs could be used for MEV.",
        "created_at": "2025-01-15T08:47:31.420000+00:00",
        "attachments": null
    }
]