[
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "Gonna update Lodestar's focil branch to reflect the latest focil spec change. Is there any outstanding spec change other than adding `inclusion_list.md` as noted [here](https://github.com/ethereum/consensus-specs/pull/4351#pullrequestreview-3023153485) ? I guess execution apis need to be updated too",
        "created_at": "2025-07-17T01:01:46.210000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Have you guys tried some geographically decentralized devnet? It'd be nice to have numbers on propagation time for ILs. More than the say p99 that we typically use, I'm interested in dispersion because of the merge view window",
        "created_at": "2025-07-17T01:33:00.061000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@845691100072509460\u003e Do you wanna rebase focil on top of fulu instead of electra? https://github.com/ethereum/execution-apis/pull/609/commits/1c22e31fb7ffab128e48ba2b0b6da9d469382bbe",
        "created_at": "2025-07-17T01:48:29.053000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "I guess rebasing on top of fulu should be fine, apart from the fork digest change, I don't think any of fulu's change would impact focil interop (ie. peerDAS, BPO fork)",
        "created_at": "2025-07-17T01:49:50.728000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "The CL spec has been merged and the change of adding `inclusion_list.md` is merely a restructuring. But execution-apis has some changes in queue: https://github.com/ethereum/execution-apis/pull/609#issuecomment-3061117213",
        "created_at": "2025-07-17T04:00:10.660000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "We'd like to but as we already have 5+ clients made interop, it would require all of them to change. We postponed that decision until we're in a right momentum, i.e., FOCIL being SFI'd. As this would turn out soon, how about waiting a bit more? Is it going to be a lot of pain for Lodestar if we remain on Electra?",
        "created_at": "2025-07-17T04:02:58.897000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "No we haven't. But we have Docker images and Kurtosis config so it's feasible.",
        "created_at": "2025-07-17T04:04:06.966000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "Not really. Just that our main branch has some fulu changes, and rebasing our focal branch on top of main branch means eip7805 fork is placed between Electra and fulu which is a little awkward but not a big deal",
        "created_at": "2025-07-17T04:23:13.441000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Whether FOCIL make it to Glamsterdam or not, it has to be rebased onto Fulu (or later fork) anyway. ~~I guess some clients go ahead to Fulu and make interop is fine? We could try the Fulu interop between Lodestar and Teku. What do you guys think? \u003c@1035747431461167125\u003e \u003c@993802539856314398\u003e (FYI, Teku also expressed their interest in rebasing onto Fulu.)~~ Once FOCIL gets CFI'd or SFI'd, its spec needs to change to be compatible with other EIPs. I guess it's better to wait until we have that (draft) spec.",
        "created_at": "2025-07-17T04:27:16.713000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Following this [suggestion](https://github.com/ethereum/consensus-specs/pull/4351#pullrequestreview-3023153485), I opened a PR that adds `inclusion-list.md` to EIP-7805 spec: https://github.com/ethereum/consensus-specs/pull/4446\n\nPlease review it when you have some time \u003c@425572898787426305\u003e \u003c@592004585506340885\u003e",
        "created_at": "2025-07-17T06:38:25.646000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Oh interesting, I would have kept those in `fork-choice.md` as it's literally affecting it. Wonder what \u003c@520034910149410861\u003e thinks. \u003c@425572898787426305\u003e what's the rationale for this separation, you mention keeping forkchoice clean but it would be similar to not touch beaconchain.md and add new helpers to separate files per fork.",
        "created_at": "2025-07-17T09:20:07.035000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "The idea is to encapsulate all IL management logic (processing equivocation and storing ILs) into a separate doc focused on ILs (similar to light client stuff). And update FC spec only with the changes that are forkchoice related.",
        "created_at": "2025-07-17T09:26:21.551000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "I am not sure which way is better from the implementation perspective, from the FC spec side it is cleaner to see only relevant changes in it",
        "created_at": "2025-07-17T09:27:08.172000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "Should the IL management logic change in the future the FC spec can remain stable",
        "created_at": "2025-07-17T09:28:19.184000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "The MD files are never seen outside of fork scope, that is, there is no \"global\" `forkchoice.md` file, rather all is anyway piled on the same minimal or mainnet Python file by the build system. Therefore when you look at any of the forkchoice markdown file you are looking at a specific fork and therefore it makes sense to me too see all changes that affect forkchoice there, in the same place, rather than having to find new files to see where they are implemented. \n\nI do like the argument about future changes though",
        "created_at": "2025-07-17T09:32:08.901000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "I am personally not satisfied with the current level of modularity of the spec, it is very low, but that's a different conversation. Moving IL logic that is not related to a FC and pretty well encapsulated in a separate submodule would make a lot of sense to me. Currently we have `state_transition` as a separate module from FC spec perspective that has an interface called by FC handlers. Making IL aside to the `fork_choice.md` and providing a stable interface to interact with the IL part of the system looks similar to me in a way",
        "created_at": "2025-07-17T09:38:02.852000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "If for any reason devs think that putting everything into one file provides a better readability and makes it easier to implement then we may not accept the proposal",
        "created_at": "2025-07-17T09:41:04.920000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Besides `inclusoin-list.md`, what would you do to improve the level of modularity of the spec?",
        "created_at": "2025-07-17T09:45:15.611000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ideally, reward, inactivity leak, FFG subsystems could be separated from the state transition and then called from the main function. I know the complexity (and especially the implementers complexity) might not worth it, but it will make it easier to reason about and introduce changes to these parts of the protocol",
        "created_at": "2025-07-17T09:50:47.976000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Added a description to the PR that explains this modularity approach for better clarity.\n\n\u003e This can be considered as adding another module that is responsible of inclusion list. To represent some of the relationship between the fork-choice module and others in a simple diagram, it would look like this: [Beacon chain] — [Fork-choice] — [Inclusion list].",
        "created_at": "2025-07-17T10:10:09.859000+00:00",
        "attachments": null
    }
]