[
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@363800010518822915\u003e \u003c@845691100072509460\u003e just want to bump this question, if the IL is not satisfied is the block invalid, or it's valid but we return a special status to the CL so it will be reorged? This makes a difference because if it's invalid it would be deleted",
        "created_at": "2025-02-22T10:49:24.986000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "We will reorg it",
        "created_at": "2025-02-22T14:36:57.236000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "cool, I've updated my PR to the EIP to reflect this",
        "created_at": "2025-02-22T15:29:34.127000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also wrote up the IL building algorithm changes: https://github.com/ethereum/EIPs/pull/9396",
        "created_at": "2025-02-22T15:30:36.422000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "I don't think we should specify the IL building algo in the eip, rather let it be a client implemention detail. Somewhat vague, different client implemention be different is a feature not a bug",
        "created_at": "2025-02-22T15:32:57.999000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Wait I'm not following here, is the argument that if a Payload doesn't satisfy the IL it will be included but attesters will signal this, and then the next proposer gets to reorg the block? What happens if the next proposer decides to build on top of this block?",
        "created_at": "2025-02-22T21:14:15.190000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I agree on not specifying it, however, it would be nice to have a list of abstract properties that the algorithm should satisfy. For example, a wanted property would be that an attacker willing to food the pool with high paying tx can not eclipse a censored one. Thus algorithms only based on prio fee won't work",
        "created_at": "2025-02-22T21:18:27.172000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Then the block stays canonical. I dont see how we can reorg it w/o having (block, slot) based fork choice",
        "created_at": "2025-02-22T21:28:54.447000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Right. In our original post, we outlined a few qualities, it may be worth it to specify these in the eip as recommendations on what to look at...\n- Priority fee  \n- How long a transaction has been in the mempool  \n- How many times the transaction has been reorged out of the chain  \n- Size of the transaction",
        "created_at": "2025-02-22T21:29:03.689000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Cc \u003c@520034910149410861\u003e is this the case? So if I propose N blocks in a row I get to miss only the last one? And censor in all of them? That is I can censor in the first N-1 and then the last one will be reorged? If this is the case then I believe this changes substantially the assumptions of those that are analyzing formally the cost of censoring in Ethereum. Cc \u003c@568176519252279324\u003e",
        "created_at": "2025-02-22T21:44:00.336000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes, currently CR is only limited to one slot. This was briefly discussed here with Sproul: https://discord.com/channels/595666850260713488/1210529202458071050/1328662155184050270\nIf we want to fix this, I think we have to move to (block, slot)",
        "created_at": "2025-02-22T21:50:29.146000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I'm not claiming it's a blocker just that if the scheme I mentioned above is correct then this I believe breaks a bunch of assumptions on the formal study of cost of censorship. There are alternatives ways of dealing with it like not importing the block at all if it doesn't satisfy the IL but I understand the complication here is worse. I would like to mention though that in conjunction with 7732 that may become feasible since the block commits to the IL and the Payload becomes rather invalid if it doesn't satisfy it",
        "created_at": "2025-02-22T23:00:24.798000+00:00",
        "attachments": null
    }
]