[
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@586161934425128960\u003e I've checked Geth code to see if there is any problem that makes it returns an empty list right after calling forkchoiceUpdated when it shouldn't. I think it's just because the mempool was literally empty. We were using tx_fuzz to fill the mempool and it sends a batch of transactions [every seconds_per_slot](https://github.com/MariusVanDerWijden/tx-fuzz/blob/master/cmd/livefuzzer/main.go#L110) with [10 milliseconds interval](https://github.com/MariusVanDerWijden/tx-fuzz/blob/master/spammer/basic.go#L50) between each transactions. If the GetInclusionList call right after forkchoiceUpdated happens slightly before this action, Geth has no choice but to return an empty list. I think this is a timing issue because I was seldomly able to see a non-empty list is returned.\n\nSurprisingly, I realized we were not using spamoor. Here is an example [Kurtosis config](https://github.com/jihoonsong/local-devnet-focil/blob/3947dfb5eb94f23e7c45867fa30ae84ee60017b2/kurtosis/kurtosis.config.registry.interop.yaml) that uses spamoor to feed the mempool for most of slots. When I modified Prysm to call GetInclusionList right after it gets response from forkchoiceUpdated and ran it with this config, I could see Geth returns non-empty ILs. Please check it if it works with Lodestar as well and let me know if there is any problem.\n\nSorry for this late answer but I hope it helps 🙂",
        "created_at": "2025-04-18T15:21:01.319000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "I have removed the forced delay call to Geth, and it works fine with the config that uses spamoor👍",
        "created_at": "2025-04-18T22:13:48.291000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "Will post the new image when it's ready",
        "created_at": "2025-04-18T22:14:10.647000+00:00",
        "attachments": null
    }
]