[
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "My argument is to leave it partially specified so clients can make tweaks; the worst case if we don't specify is everyone has similar rules such as ordering by priority fee. I think the throughput of how many txs can be included through the IL is important, and the algorithm I'm proposing improves this a lot. Would be good to discuss this tomo on the breakout cc \u003c@363800010518822915\u003e \u003c@725415098331430932\u003e",
        "created_at": "2025-02-24T11:21:17.723000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "maybe we should consider adding ePBS as a requirement for this EIP and try to get them included together? It seems that having (block, slot) voting and actually invalidating the payload gives much stronger guarantees",
        "created_at": "2025-02-24T11:25:18.574000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "unfortunately I'll have to miss tomorrow's breakout session because I'm traveling, but my current thoughts are:\n- I think mentioning the different properties you can optimize for in the EIP makes sense and is important (especially just making sure everyone just doesn't order by prio fees)\n- I don't think we need to go as far as actually proposing an algorithm that optimizes for one property over the others",
        "created_at": "2025-02-24T11:30:36.519000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "we've discussed this extensively in the past, FOCIL and ePBS are two different EIPs that serve different goals, and should be considered independently",
        "created_at": "2025-02-24T11:31:14.521000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "also I think block slot voting is independent of ePBS",
        "created_at": "2025-02-24T11:34:30.248000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "There are a few of reasons I think it makes sense to propose this algorithm explicitly:\n- Throughput is more important imo than the other factors. Priority fees don't seem super important from IL builder perspective, high priority fee transactions are less likely to be censored anyway. Time spent pending in the mempool would be much less relevant if we had much higher throughput and less txs waiting in the mempool for a long time. As I said these can still be factored in though tweaks by clients anyway\n- The proposal divides up transactions into 16 buckets for each committee member. This assumes some coordination between the members (i.e. running the same base algorithm). If only one client implements this it doesn't really work\n- It needs an engine api change to pass the committee member id to getInclusionList, this is used to assign buckets to members\n\nIf we leave fully unspecified generally we have to assume the worst and can't give any guarantees, for example that a single high priority fee transaction couldn't censor everything",
        "created_at": "2025-02-24T12:15:34.200000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "- Priority fees could for example be used as a way to increase the cost of censorship for a proposer that has a full block and exclude some but not all IL txns\n- Sorting by byte size + time spent in the mempool actually prevents mempool/IL stuffing in itself (see https://meet-focil.vercel.app/il-flooding-in-focil/)\n- I just don't think we need the extra coordination is what I'm saying, this is precisely what shouldn't be rushed or included imo (assigning buckets to members). There is an obvious, inherent tradeoff there and having no (or very few) overlap we also loose the 1 out of n honesty assumption as I already mentioned. Throughput is not more important than this property.",
        "created_at": "2025-02-24T12:44:33.858000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "- I don't fully understand, if the block is full the IL doesn't really matter right?\n- I'll give a read, I'm not really talking about stuffing with invalid transactions though. I'm saying if the de facto size of the IL is ~8kb then we can send a single (valid) 8kb transaction and take up the whole list. The rest can be censored\n- This is why it's important that the buckets are probabilistic. With probabilty `p` a commitee member will chose from a different bucket, we can `p` arbitrarily high. This still satisfies the 1 of n property as if there is 1 honest member there is a chance they could include any tx from the pool. The tradeoff here is between having 16x redundancy for the top few highest scoring transactions or having slightly less redundancy for these txs and much higher overall throughput. For me it makes sense to go somewhere in between, and `p` can be set accordingly",
        "created_at": "2025-02-24T14:35:35.938000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think there are two different ways you can look at the purpose of the IL:\n1. only a few transactions are likely to ever be censored. The IL should provide maximum redundancy for a very small amount of txs that are clearly being censored so score highly\n2. the IL should be as big as possible, so most of the block is built from the IL. This can handle larger numbers of transactions being censored. It can also reduce latency of inclusion as txs are immediately included in the IL instead of waiting for it to be clear that they are being censored.\nI think by tweaking the base algorithm we can get the best of both worlds. By default we aim for a large IL, but if there are a few transactions that are clearly being censored for many slots then a client could override the base algorithm and include these, or at least weight them higher. Of course it is less likely that they would be censored for long if a large number of txs are always in the IL",
        "created_at": "2025-02-24T14:39:36.479000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "- I was talking about \"not entirely full blocks\", that can only include some IL txns\n- \"then we can send a single (valid) 8kb transaction and take up the whole list\"  =\u003e this is stuffing the IL isn't it?\n- we could achieve p without explicitly specifying the algorithm",
        "created_at": "2025-02-24T14:39:58.871000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "the idea is that \"tweaking the algorithm so we can get the best of both worlds\" is subjective, this is why I think clients should be able to make rules based on what they prioritize the most",
        "created_at": "2025-02-24T14:41:12.653000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "If we don't specify then I think we should assume that we will have very high overlap in ILs, and a de facto capacity of around 8kb, maybe slightly higher. As I said before I don't think optimising for throughput will work very well if only one client implemented for example, it requires some coordination and a small spec change",
        "created_at": "2025-02-24T14:43:35.485000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "we agree about the basic properties, what I'm saying is that there is no need to have a common algorithm everyone uses, if you end up \"tweaking the algorithm to get to a given trade off point you're comfortable with\". If you literally need to override the base algorithm to include transactions that have spent a long time pending in the mempool it's not really a base algorithm anymore anyways",
        "created_at": "2025-02-24T14:45:53.777000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "that's not really true, if a good portion of clients considers it's important to optimize for throughput (which might very well be the case) then we won't",
        "created_at": "2025-02-24T14:47:32.486000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "they might come up with other implementations allowing to reach trade off points you (we) haven't thought of yet",
        "created_at": "2025-02-24T14:47:54.824000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "I would say it's not even really an algorithm, more of a rough consensus to roughly divide up responsibility for including different transactions, and an agreement on having some randomness. It leaves the rest up to implementers",
        "created_at": "2025-02-24T14:48:09.250000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "imposing an algorithm is very opinionated, and assumes we all figured it out when I don't think it's the case",
        "created_at": "2025-02-24T14:48:21.517000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah then we agree on specifying important properties clients need to pay attention to without specifying a base algorithm everyone should use",
        "created_at": "2025-02-24T14:49:13.110000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "including throughput",
        "created_at": "2025-02-24T14:49:27.056000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "well yeah but optimising for throughput isn't really about having a good algorithm that we haven't come up with yet. It inherently requires this coordination of who will (approximately) include what that you need to agree on beforehand",
        "created_at": "2025-02-24T14:50:36.561000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "the only thing being 'imposed' is that if you are committee member `a` then you are slightly more likely to include transactions beginning with `a` than other members. there's no algorithm you can come up with that can really do this, it's just something that clients have to use the same rule on for it to work",
        "created_at": "2025-02-24T14:55:10.120000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "calling it an algorithm maybe wasn’t completely accurate but what I’m proposing is: implementations *should not* be fully deterministic. they *may* chose to slightly bias towards certain transactions based on their id. I think this is all that should be specified",
        "created_at": "2025-02-24T15:05:59.163000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ok then we could frame the discussion this way:\n- Would the diversity of client rules be enough to ensure ILs don’t always overlap with each other? \n- If not,  do we need to add an explicit “coordination across client” feature in FOCIL spec so transaction selection is not fully deterministic? \n- If we do, what’s the best way to do it?",
        "created_at": "2025-02-24T15:07:19.302000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah I like this way of framing it more too",
        "created_at": "2025-02-24T15:08:53.290000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "the only thing I'd want is for this to be an open discussion (unfortunately I really can't make it tomorrow) so we can get others' opinions on this",
        "created_at": "2025-02-24T15:09:34.343000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "My suggestion is just passing this id in to the getInclusionList endpoint",
        "created_at": "2025-02-24T15:09:58.316000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "How they want to randomise exactly is another thing that can be left unspecified, I just think purely deterministic is likely to lead to large overlap",
        "created_at": "2025-02-24T15:11:01.447000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "wouldn't it be possible to use something that's already broadcast (rather than introducing an index?)",
        "created_at": "2025-02-24T15:30:12.744000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "The latest prysm focil commit should fix this. I pushed a new commit this morning",
        "created_at": "2025-02-24T15:45:46.536000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "I've updated the docker images for convenience.\n\n```\ncl_type: prysm\ncl_image: jihoonsg/prysm-beacon-chain-focil:efa8cca\nvc_type: prysm\nvc_image: jihoonsg/prysm-validator-focil:efa8cca\n```",
        "created_at": "2025-02-24T16:07:54.419000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "the index can be derived from the validator index. so the lowest validator index maps to `0`, the highest to `f`",
        "created_at": "2025-02-24T16:21:11.272000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "FYI, also rebased Geth on top of the latest master branch and updated Geth image. You can access it as follow:\n\n```\nel_type: geth\nel_image: jihoonsg/geth-focil:d5c724b\n```",
        "created_at": "2025-02-24T16:34:47.263000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "I ran prysm-only testnet with `jihoonsg/geth-focil:d5c724b`\n```\n  electra_fork_epoch: 1\n  fulu_fork_epoch: 2\n  eip7805_fork_epoch: 3\n```\nand it got stuck when transitioning from electra to fulu",
        "created_at": "2025-02-24T23:43:19.559000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "Geth log:\n```\nERROR[02-24|23:34:27.145] Nil finalized block cannot evict old blobs\nINFO [02-24|23:34:31.468] Looking for peers                        peercount=1 tried=0 static=0\nWARN [02-24|23:34:35.011] Served engine_forkchoiceUpdatedV3        conn=172.16.28.14:41910 reqid=414 duration=\"122.75µs\" err=\"Unsupported fork\" errdata=\"{\\\"err\\\":\\\"forkchoiceUpdatedV3 must only be called for cancun payloads\\\"}\"\nWARN [02-24|23:34:39.118] Served engine_forkchoiceUpdatedV3        conn=172.16.28.14:41910 reqid=416 duration=\"41.875µs\" err=\"Unsupported fork\" errdata=\"{\\\"err\\\":\\\"forkchoiceUpdatedV3 must only be called for cancun payloads\\\"}\"\nINFO [02-24|23:34:41.489] Looking for peers                        peercount=1 tried=0 static=0\nINFO [02-24|23:34:51.507] Looking for peers                        peercount=1 tried=0 static=0\nWARN [02-24|23:34:53.004] Served engine_forkchoiceUpdatedV3        conn=172.16.28.14:41910 reqid=419 duration=\"171.792µs\" err=\"Unsupported fork\" errdata=\"{\\\"err\\\":\\\"forkchoiceUpdatedV3 must only be called for cancun payloads\\\"}\"\n```",
        "created_at": "2025-02-24T23:43:41.040000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@845691100072509460\u003e",
        "created_at": "2025-02-24T23:47:49.752000+00:00",
        "attachments": null
    }
]