[
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "https://github.com/ensi321/beacon-APIs/pull/1 . Just added beacon api that are related to  ILC duty.",
        "created_at": "2025-01-14T02:24:31.750000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "For  `produceInclusionLists`, I think we need to pass in `validator_indices` in case vc has multiple validators that are in the same ILC so bn won't generate the same IL for each validator",
        "created_at": "2025-01-14T02:26:17.401000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "Block proposer should inform EL at 11s in the previous slot about the ILs used in the block. How did you handle this in Prysm's implementation? Did you piggyback ~~`produceBlockV3`~~ `publishBlockV2` or have a separate beacon endpoint to pass the IL list info?",
        "created_at": "2025-01-14T02:38:12.571000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Currently we use `engine_updatePayloadWithInclusionListV1`. This is an open implementation though.",
        "created_at": "2025-01-14T02:44:08.325000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "Does vc directly calls engine api to EL? Or does vc call bn and then bn calls EL?",
        "created_at": "2025-01-14T02:46:27.817000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "VC typically doesnt have access to EL, VC calls BN",
        "created_at": "2025-01-14T02:49:18.329000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "I thought about this for a while and I didnt think there's a reason to input validator indices, so for example... but I'm not really the API guy. In prysm grpc api implementation, we are doing\nInput -\u003e `slot`\nOutput -\u003e `(inclusion_list_committee root, inclusion_list_txs)`",
        "created_at": "2025-01-14T02:52:22.359000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "I just have a background routine that triggers at 11s mark. I wrote up something here: https://hackmd.io/@ttsao/focil-implementation-notes#Block-Building",
        "created_at": "2025-01-14T02:54:04.171000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "This makes sense only if IL construction algorithm takes  `validator_indices` into account. If those validators share EL, I think they likely produce same or similar ILs as they have the same view on their public mempool.",
        "created_at": "2025-01-14T02:57:00.042000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think EL should be able to produce multiple non-overlapping (or at least slightly different) ILs at any given instance so local ILC validators in this case won’t sign and broadcast the same IL. Sounds wasteful if they broadcast the same set of IL transactions imo",
        "created_at": "2025-01-14T03:09:58.161000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "It sounds legit but one concern I have is that the protocol should be kept from being too opinionated about the IL construction algorithm. One idea would be providing the IL design guide but maybe requiring all ILs should be different for all local VC is too strict.\n\nDo we have the numbers like how many validators ran by the same machine on average?",
        "created_at": "2025-01-14T04:28:18.663000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Cross-layer",
        "parent": "",
        "content": "I've just started looking at FOCIL and have some questions about how re-orgs are meant to work.\n\nI've seen the spec function `get_attester_head` which results in attesters voting for the parent of a block that is not IL-compliant. My understanding is that we intend for these non-compliant blocks to get reorged out (LMK if this assumption is incorrect). There are two issues I see with this as written:\n\n1. There are no changes to `get_proposer_head`, which is the current mechanism for performing single slot re-orgs of late blocks. Although it's true that reorg-enabled proposers will attack and orphan blocks with insufficient attester weight, at the moment they will only do this for _blocks that they see late_ (after 4s). This means on-time blocks that aren't IL-compliant won't be re-orged by this mechanism. AFAICT there's no other mechanism to re-org them specified currently, so the result is that blocks that aren't IL-compliant just stay in the chain with low attester weight. This screws the attesters (they voted for the wrong head), and doesn't punish the censoring proposer at all. If anything it punishes the proposer at the next slot, who gets less attestation rewards for including all the missed-head attestations.",
        "created_at": "2025-01-14T05:22:13.741000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Cross-layer",
        "parent": "",
        "content": "2. Even if we modify `get_proposer_head` to encourage re-orgs of non-compliant blocks, the current approach with `get_attester_head` is limited to re-orging over a single slot. Take the following scenario: A is on-time and compliant, B is on-time and non-compliant. Attesters in B's slot vote for A, so B is weak. The proposer of the next slot then (maliciously) proposes a new non-compliant block C on top of B. At this point C gets the proposer boost, becomes head, and `get_attester_head` returns B (a non-compliant block!) because it is the parent of C. This suggests to me that we might want to change the definition of `get_head` so that it excludes IL-invalid blocks, _or_ change `get_attester_head` to be applied recursively (so that it keeps returning A), and update `get_proposer_head` to support multi-slot re-orgs.\n\nI'm probably missing something, but interested to hear thoughts on this.",
        "created_at": "2025-01-14T05:22:15.416000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah, for (1), there's definitely a plan to update get_proposer_head. In my Prysm notes above, I mentioned we need to check the following areas: attester (also make sure head vote and FFG vote compliance), sync committee, and proposer. Thanks for the reminder.\n\nFor (2), I don't have a good answer, we probably need forkchoice experts like Francesco or Potuz to weigh in. We should run some fork choice analysis for this type of scenario. I'll add one more complication to your example: in the current spec, the inclusion list is only propagated through gossip (no RPC request/response). So if you're a syncing node using RPC to sync to B, then receive C over gossip, you won't be able to check the inclusion list satisfactorily for B...",
        "created_at": "2025-01-14T05:34:29.263000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks for the speedy reply!\n\nFor us, implementing the `get_attester_head` changes as written is a bit invasive, because we have a cache of the canonical head, and a bunch of stuff derived from that. With `get_attester_head` these caches become more or less useless.\n\nCompared to if we redefine how the head is determined, in which case not much changes at all outside fork choice",
        "created_at": "2025-01-14T05:37:43.009000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Cross-layer",
        "parent": "",
        "content": "cc \u003c@520034910149410861\u003e 🙏",
        "created_at": "2025-01-14T05:51:53.535000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think this applies to Prysm as well. Strongly support having a single function for retrieving the correct head to be used for validator duties....",
        "created_at": "2025-01-14T05:55:53.730000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes, we should modify `get_proposer_head` in the way you suggest, if we decided to not make deeper changes to the fork-choice. And also yes, it is limited to one slot, and if someone controlled two block proposers (really proposer, not builder) in a row they could ignore the ILs in the first slot. If we want to improve on this, I think we should move to (block, slot) fork-choice. I have preferred to leave this question as separate from FOCIL, rather than directly putting it in the FOCIL specs from the beginning, because imo even the weaker enforcement based on proposer-boost reorging (with the modification you mentioned) would be good enough, and these fork-choice changes are meaningful by themselves.",
        "created_at": "2025-01-14T09:49:03.145000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "To be more explicit about the specific point of extending IL compliance over multiple slots, I think it's much cleaner to avoid doing so, and instead having ILs be ephemeral, not something you need to keep track of or sync. And even if we did keep track of them, the issue is that you cannot a posteriori say that B from slot N is not compliant because it doesn't respect some IL from slot N that you have received, because you don't know when the IL first became available. You can only judge B to be compliant or not if you were online at that time. Also, even online validators might disagree about whether a block is compliant or not, because they might have received certain ILs at different times, on either side of the deadline. In that case, there's no way to heal their views so they agree. Instead, we forget about the initial compliance assessment and just go with the votes, so the problem is reduced to the usual one of agreeing on a fork-choice winner",
        "created_at": "2025-01-14T09:54:38.303000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Cross-layer",
        "parent": "",
        "content": "ok cool, one problem with `get_proposer_head` at the moment which we may need to solve, is that we have to guess when we might want to reorg a block, and _suppress_ the fcU call to the EL. This is because EL’s don’t support building on a block that isn’t the tip of a chain (at least the last time I checked, some of them might support it now). I made an issue about this a while ago here: https://github.com/ethereum/execution-apis/issues/313",
        "created_at": "2025-01-14T12:21:58.174000+00:00",
        "attachments": null
    },
    {
        "author": "nflaig",
        "category": "Cross-layer",
        "parent": "",
        "content": "if we just consider solo stakers it's likely below \u003c 10 keys per node, even with hundreds of keys it seems highly unlikely that the same node has to build 2 ILs for the same slot",
        "created_at": "2025-01-14T12:22:04.206000+00:00",
        "attachments": null
    },
    {
        "author": "fradamt",
        "category": "Cross-layer",
        "parent": "",
        "content": "Agree. I don't think it's at all worth worrying about the case of multiple IL proposers on the same machine.",
        "created_at": "2025-01-14T12:38:45.649000+00:00",
        "attachments": null
    },
    {
        "author": "nflaig",
        "category": "Cross-layer",
        "parent": "",
        "content": "maybe can clarify this in the call, but it avoids some complexities on the beacon-api and EL side if we just ignore this edge case",
        "created_at": "2025-01-14T12:40:16.551000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "where is the zoom link for the call?",
        "created_at": "2025-01-14T14:00:24.278000+00:00",
        "attachments": null
    },
    {
        "author": "sibkatya",
        "category": "Cross-layer",
        "parent": "",
        "content": "Google calendar",
        "created_at": "2025-01-14T14:00:37.659000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "https://us02web.zoom.us/j/84332720478?pwd=xtSJe8qQACMD8m8UaPWNahzM8gmaKx.1",
        "created_at": "2025-01-14T14:01:00.621000+00:00",
        "attachments": null
    },
    {
        "author": "matthewkeil",
        "category": "Cross-layer",
        "parent": "",
        "content": "Notes from the FOCIL 2 meeting:\nhttps://github.com/ethereum/pm/issues/1238#issuecomment-2590169551",
        "created_at": "2025-01-14T15:06:28.179000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@363800010518822915\u003e I've rebased the Geth PR to the latest commit on master branch and still got the same error. Do you know which branch it should be based on? Perhaps someone from Geth team could help..?",
        "created_at": "2025-01-14T15:19:13.484000+00:00",
        "attachments": null
    },
    {
        "author": "sibkatya",
        "category": "Cross-layer",
        "parent": "",
        "content": "Here is the metrics issue, feel free to comment on what you would like to monitor and measure. I will build an initial Kurtosis dashboard as well\n\nhttps://github.com/ethereum/beacon-metrics/issues/15",
        "created_at": "2025-01-14T15:36:46.736000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "For Electra testing, we are on:  lightclient/go-ethereum:prague-devnet-5\nIt could be a prysm bug as well. I woudln't rule that out. I'm not sure if latest geth develop support devnet5. What is the error you are seeing?",
        "created_at": "2025-01-14T15:57:24.266000+00:00",
        "attachments": null
    },
    {
        "author": "nflaig",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@725415098331430932\u003e on the topic of IL markets, I was reading [Uncrowdability of FOCIL](https://mirror.xyz/julianma.eth/Gnd8N1IsoHuGHRisp6nCldlt72ZacoXUA-O76qQN3mc) yesterday and one part which I don't see covered is that inclusion lists can be used to get transactions in with 0 priority fee and the difference what the tx sender would have to pay in ETH as priority fee to get it in via mempool (or private order flow) could be payed to the IL committee member, or slightly less so it would be a win-win for both parties.\n\nSince the only goal here would be to get the transaction in cheaper the fact that it is unblinded, has weak inclusion guarantees and ordering wouldn't really matter.",
        "created_at": "2025-01-14T20:45:20.361000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "If there is no congestion and your goal is only to get included, why would you pay priority fees in the first place? You can just submit your txn via the mempool, it’ll get picked up by IL committee members and get included anyways.\n\nIf you want your transaction to be executed on a specific state (e.g., arbitrage) and use priority fees to tip the proposer, then you should then it to the proposer directly, because txns in ILs get revealed publicly before the full block is built (and can be frontrun). Paying IL committee members doesn’t give any ordering or position in the block guarantees.",
        "created_at": "2025-01-14T21:58:08.523000+00:00",
        "attachments": null
    },
    {
        "author": "nflaig",
        "category": "Cross-layer",
        "parent": "",
        "content": "so right now there is no incentive to include a tx without priority fee in their block right? even when looking at this block for example https://etherscan.io/block/21625076 which is -27% gas target each transaction in that block still pays a priority fee. With FOCIL would all those be 0 priority fee then because IL committee members include them from mempool and the proposer is forced to add them?",
        "created_at": "2025-01-14T22:06:52.602000+00:00",
        "attachments": null
    }
]