[
    {
        "author": "ndeto.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hello folks,\n\nI’ve been building FOCIL visualization into my tool, [**txpool-viz**](https://github.com/punkhazardlabs/txpool-viz), and ran into a challenge I’d appreciate your input on:\n\n The logs show inclusion-lists being generated for each slot (after a delay of around 25 blocks) and compared on every new block. However, most blocks are still marked as invalid. When valid inclusion-lists do appear, they only do so for a short period before going back to invalid.\n\nI suspect this might be a performance issue on my end affecting how the kurtosis network behaves locally, but I’d appreciate any feedback before jumping to conclusions. Docker logs for txpool-viz container should help confirm when inclusion-lists start getting broadcasted.\n\nYou can quickly test it using:\n\n```\nkurtosis run --enclave my-testnet github.com/punkhazardlabs/ethereum-package@ndeto/feat/add-txpool-viz --args-file focil_params.yaml\n```\n\nUse this [focil_params.yaml](https://github.com/punkhazardlabs/txpool-viz/blob/9470e554a6aa87b335e6d934489611ece0baa947/focil_params.yaml) config. `txpool-viz` will be one of the services started by Kurtosis, and its web UI will be exposed in the output.\n\nIf you want to test with running nodes. It can also be run as a stand alone tool. Instructions are on the repo [**txpool-viz**](https://github.com/punkhazardlabs/txpool-viz) . I'd also appreciate a couple of devnet beacon urls for testing if it's possible 🙂 \n\nThanks in advance for any insights or tools you can share to help make txpool-viz  reflect EIP-7805 behavior accurately.",
        "created_at": "2025-06-21T19:31:08.876000+00:00",
        "attachments": null
    },
    {
        "author": "ndeto.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "An example of how it looks when producing valid blocks",
        "created_at": "2025-06-21T19:41:11.392000+00:00",
        "attachments": [
            {
                "type": "video/quicktime",
                "origin_name": "FOCIL_-_video.mov",
                "content": "fe1c6e36bc79f9f3ba57e06814648aa206aa03abdd89fbce9477ce9443d3c776"
            }
        ]
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "ILs for slot N is used for the block for slot N+1. So I guess you need to fetch ILs with (blockNumber - 1).String() at here: https://github.com/punkhazardlabs/txpool-viz/blob/main/internal/focil/processor.go#L274",
        "created_at": "2025-06-21T20:03:59.829000+00:00",
        "attachments": null
    },
    {
        "author": "ndeto.eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks for pointing that out. I’ve updated the image for now. That said, the target slot discrepancies I’m seeing are often more than just one block and usually follow a consistent interval. For example, if the target slot is 80 and the transaction ends up in block 78, that same offset appears across other entries. I’ve been cross-checking the mined block numbers in the transactions tab. I suspect there’s more going on beyond the simple offset. Still digging into it. thanks again.",
        "created_at": "2025-06-21T20:22:06.090000+00:00",
        "attachments": null
    }
]