[
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "If focil gets dfi'ed, are you planning to make this engine api feature a mandatory of epbs? Or will it be optional since CR is not really the theme of epbs.",
        "created_at": "2025-11-07T00:43:56.222000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I would make it a mandatory boolean in the structure, like what we have for get_payload, but that both the EL and the CL are not forced to use in any way. ePBS does give some good defaults if the EL puts part of the work done on to prepare the IL into this: the same work can be reused. If you would have put a tx in an IL because it's paying more than enough for the last hour and it wasn't included and could have in this block, return 1. \nThis is far from being a FOCIL replacement so it only makes sense as a desperate measure if FOCIL is not included right away",
        "created_at": "2025-11-07T01:26:06.786000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Summary of breakout #23: https://github.com/ethereum/pm/issues/1793#issuecomment-3501249470\nShorter summary of breakout #23: https://x.com/jih2nn/status/1986713921827618992",
        "created_at": "2025-11-07T08:35:26.745000+00:00",
        "attachments": null
    },
    {
        "author": "blockkshane",
        "category": "Cross-layer",
        "parent": "",
        "content": "hey, yah, all this makes sense. sounds like we'd want this flag if focil doesn't make glamsterdam, as kind of a \"poor man's focil\" as you've said ha\n\na question i have is: are there any concerns with having what sets this flag being unspecified by either CL or EL? the heuristics will be different per EL client, and maybe make it difficult for the CL to reason about? since CL will get different flag status depending upon which EL it hooks up to. i.e. `geth` says true but `reth` says false. or maybe nbd?\n\nalso, can this flag be gamed in anyway? like a malicious EL always setting the flag to true? this seems like a bit of a far fetched assumption though. \n\nor builders could try to avoid the flag being set to `true` based off knowing the heuristics. but even then, probably still better than no flag\n\nor EL targets a builder and sets flag to `true` to penalize them for whatever reason (also seems unlikely)\n\njust worth maybe spending a minute to think about if have other ideas of how can be gamed",
        "created_at": "2025-11-07T17:26:56.693000+00:00",
        "attachments": null
    }
]