[
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "Is there a focil engine API spec drafted somewhere? I think we need an endpoint something like `getILCommitteeDuties` for vc to know they are part of ILC and an endpoint to submit signed IL to bn",
        "created_at": "2025-01-09T04:48:20.330000+00:00",
        "attachments": null
    },
    {
        "author": "terence0083",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think you meant the beacon API spec? \nNo, it hasn't been drafted. In the Prysm implementation, I just overloaded the regular duty endpoint and added the inclusion committee there, along with one to get the unsigned inclusion list and another one to submit the signed inclusion list",
        "created_at": "2025-01-09T04:55:59.613000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yea beacon API. I will draft something up tomorrow or Friday. Should be pretty straightforward",
        "created_at": "2025-01-09T05:00:04.194000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Cross-layer",
        "parent": "",
        "content": "I would argue there is non-zero value in having control of (or getting commitments from) IL committees. However, in my view I think it's very unlikely that the value is high enough for a market to emerge.\n\nJulian's post describes very well a lot of reasons as to why such a market would be of very little value. I'm not sure it's clear that there is *\"no incentive to outsource inclusion list construction to a centralized set of agents\"*. I argue the incentive is non-zero, but more importantly, not significant.\n\nFor example, imagine a profit-maximising builder who also acts as a preconf gateway. The builder is designated preconf signing rights from validators and the builder provides preconf pricing to L2s etc. The builder is pricing preconfs and therefore taking the \"slashing\" risk if they are not included. The builder having control of ILs will increase the probability of their preconfs getting on chain. E.g. the builder has 31 of 32 proposers in an epoch; controlling the ILs of the first 31 proposers increases the likelihood of a builder preconf landing in 32nd, non-builder block. Maybe enough so that it hedges their risks or forms a product itself.\n\nIn this case it might make sense for the builder to say \"give me your IL rights and i'll pay you a flat fee for them\".",
        "created_at": "2025-01-09T23:45:45.402000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Cross-layer",
        "parent": "",
        "content": "So, I think there are pathological scenarios where centralized IL building makes sense. I.e. there is *some* value in centralizing IL building. However, I do not believe the risk is significant enough to do anything about. These are my main reasons:\n\n- IL guarantees are weak (i.e. they fail in congestion)\n- There's no transaction blinding\n- There's significant overhead in building an IL marketplace (modifying clients, mev-boost, modifying builders, etc).\n- There's a strong narrative as to why it's socially unacceptable and I believe validators would not violate it (the reward for violation is very low and they already have non-IL blockspace to play MEV games in)\n\nSo, I am not concerned about ILs turning into a marketplace for preconfs, etc. I don't have a proof, but it's unclear to me that proof is possible here. Any protocol agency is worth *something*.",
        "created_at": "2025-01-09T23:45:51.283000+00:00",
        "attachments": null
    }
]