[
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cfradamt\u003e For FOCIL compatibility with delayed execution, the same trick used here for compatibility with epbs can apply: https://hackmd.io/UX7Vhsv8RTy8I49Uxez3Ng",
        "created_at": "2025-02-12T08:23:14.838000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cfradamt\u003e Basically a block contains a bitfield over the IL committee, 1 if it commits to satisfying an IL tx from that IL proposer and 0 if not. Attesters vote based on the bitfield only (is the bitfield a superset of what I have seen by the deadline?), without execution. In the next slot, only the bitfield ILs are enforced, i.e. everyone checks satisfaction of ILs that have a 1\n\nThe first step ensures that the block commits to satisfying a sufficiently inclusive set of ILs, and the second step ensures that it actually satisfied whatever it committed to satisfying",
        "created_at": "2025-02-12T08:25:08.573000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003csoispoke\u003e What happens when a proposer doesn't commit to an IL because it realizes one of the transactions is invalid (bitfield = 0) when build its payload, but attesters definitely see that IL on time? Since they don't execute transactions they will not vote for the proposer's block. The block won't become canonical, but it's \"unfair\" because the proposer couldn't include all transactions from that IL (one of them was invalid)",
        "created_at": "2025-02-12T09:13:16.286000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003csoispoke\u003e What happens when a proposer doesn't commit to an IL because it realizes one of the transactions is invalid (bitfield = 0) when build its payload, but attesters definitely see that IL on time? Since they don't execute transactions they will not vote for the proposer's block. The block won't become canonical, but it's \"unfair\" because the proposer couldn't include all transactions from that IL (one of them was invalid) (re @fradamt: Basically a block contains a bitfield over the IL committee, 1 if it commits to satisfying an IL tx from that IL proposer and 0 if not. Attesters vote based on the bitfield only (is the bitfield a superset of what I have seen by the deadline?), without execution. In the next slot, only the bitfield ILs are enforced, i.e. everyone checks satisfaction of ILs that have a 1\n\nThe first step ensures that the block commits to satisfying a sufficiently inclusive set of ILs, and the second step ensures that it actually satisfied whatever it committed to satisfying)",
        "created_at": "2025-02-12T09:13:25.323000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cfradamt\u003e the proposer would commit to that IL (bitfield = 1). Committing doesn't mean satisfying, it means that you're taking it into account. If it's not satisfiable, it will be clear to everyone",
        "created_at": "2025-02-12T09:19:27.381000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003csoispoke\u003e Ok so the proposer see an IL, it commits to it regardless of whether IL transactions are valid or not and sets its bitfield to 1. Attesters see it as well, and they vote for the block. What happens during the second step when an IL transaction is invalid (thus making the IL unsatisfiable?) Is the transaction skipped? Is the block reorged?",
        "created_at": "2025-02-12T09:25:14.024000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cfradamt\u003e In the next slot, the proposer executes the previous block (assuming that it got enough votes. If it had a non-inclusive-enough bitfield, it wouldn't get voted and would be reorged, similarly to how FOCIL is supposed to work today), and for each 1 in the bitfield they get the corresponding IL (if there's 0 or \u003e 1 ILs from that committee member, they treat it as a 0, i.e., ignore), check if it is satisfied (same meaning as in FOCIL: all txs are included or not includable), and build on the parent if not. In other words, you build on the parent if either the block didn't get a majority (possibly because the bitfield was not inclusive enough) or if the bitfield isn't satisfied. If the proposer builds on the block, attesters do the same thing to decide how to vote: they check ILs corresponding to the bitfield, and vote for the parent if they have not all been satisfied",
        "created_at": "2025-02-12T09:34:27.154000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cfradamt\u003e Basically both slots have attester enforcement, but in the first slot what is enforced is the bitfield being inclusive enough, and in the second slot what is being enforced is satisfaction of (the ILs corresponding to) the bitfield",
        "created_at": "2025-02-12T09:35:29.028000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003csoispoke\u003e ah I see, nice!",
        "created_at": "2025-02-12T10:13:08.386000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003csoispoke\u003e But now I'm wondering if malicious IL committee members can “force” builders to build on parent blocks by including invalid transaction in their ILs?",
        "created_at": "2025-02-12T10:16:57.496000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003cfradamt\u003e If an IL contains an invalid tx, the bit is going to set to 1 but that tx won't be enforced in the next slot. It doesn't force building on the parent.",
        "created_at": "2025-02-12T10:55:33.354000+00:00",
        "attachments": []
    },
    {
        "author": "bridge-bot",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003csoispoke\u003e Ah ok yeah when you said _\"you build on the parent if either the block didn't get a majority (possibly because the bitfield was not inclusive enough) or if the bitfield isn't satisfied\"_, it specifically means the bitfield was set to 1 but one (or more) IL transaction was not actually included in the payload, not that the IL contained an invalid txn. In the latter case the txn is just not enforced. \n\nMakes sense! (re @fradamt: If an IL contains an invalid tx, the bit is going to set to 1 but that tx won't be enforced in the next slot. It doesn't force building on the parent.)",
        "created_at": "2025-02-12T11:08:42.717000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "```\n[2025-02-12 13:19:11]  ERROR sync: Received nil message on pubsub topic=/eth2/e6d639a2/execution_payload_header/ssz_snappy\n````",
        "created_at": "2025-02-12T13:19:55.415000+00:00",
        "attachments": []
    }
]