[
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "A question about FOCIL and ePBS: can we make the heuristics on the EL such that they only include txs that have been sitting in the mempool long enough but haven't been included when they could have? even just a couple of blocks should be enough to remove the problem of sending the same tx in the IL which has already been committed in the bid. It hinders timely inclusion properties from Focil, but otherwise we expect FOCIL to be bad even in the happy case",
        "created_at": "2025-11-27T16:34:38.001000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Isn't providing timely inclusion the strongest argument for FOCIL to begin with? This would weaken it's effectiveness. I'd rather live with more data being sent around. Esp. since the size of ILs is capped and blobs excluded, it might be fine.",
        "created_at": "2025-11-27T16:48:43.875000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "it's hard to reason about this without know ePBS deadlines, I still think we should do everything we can to get timely inclusion as well",
        "created_at": "2025-11-27T16:50:36.013000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I feel that adding to broadcast something that is bound to be useless in the happy case is a bad design",
        "created_at": "2025-11-27T17:05:18.570000+00:00",
        "attachments": null
    },
    {
        "author": "pellekrab",
        "category": "Cross-layer",
        "parent": "",
        "content": "IL list building isn't defined in the spec on purpose, so this would be up to the EL client teams.",
        "created_at": "2025-11-27T17:06:13.736000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Otoh if we do keep 12 seconds then ILs can be produced after the Payload",
        "created_at": "2025-11-27T17:06:27.415000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes but if the EL includes txs that pay without any censoring filter, they will be included by builders in the same slot and be useless in the next one. If the IL is built after seeing the Payload then it makes sense",
        "created_at": "2025-11-27T17:07:52.911000+00:00",
        "attachments": null
    },
    {
        "author": "pellekrab",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah makes total sense. I would be in favor of a split design where we have IL space set aside for those types of txs, but the majority of the IL being for High fee txs. Also back to Soispoke's point if we are delaying txs by a slot for ePBS then is this even necessary? Also metrics on how many of these tx exist in the wild would be helpful.",
        "created_at": "2025-11-27T17:18:10.857000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Il container today without parent hash is so it doesn't have to be dependent on latest head view. In terms of timeliness requirement I  really think 1-2 slots delay is fine. \n\nI also think we should start testing this today on mainnet and again with epbs like network env to study tx inclusion quality metrics. It can be done with just a sidecar monitoring the mempool and the network",
        "created_at": "2025-11-27T17:43:14.118000+00:00",
        "attachments": null
    }
]