[
    {
        "author": "jacobkaufmann",
        "category": "Cross-layer",
        "parent": "",
        "content": "re-sharing execution-specs PR since it was rebased and no longer contains any non-focil-related changes: https://github.com/ethereum/execution-specs/pull/1214\n\ncurrently the specs attempt to process (i.e. execute) each transaction in the IL, although that is not strictly necessary. i'm not sure whether that is an issue though. we could leave that in the execution-specs and then leave it up to the EL clients to implement the \"shortcut\" (i.e. nonce/balance checks) so long as the behavior is equivalent.\n\nthere is also a branch of execution-spec-tests which can generate test fixtures for focil based on the implementation in execution-specs: https://github.com/ethereum/execution-spec-tests/compare/main...jacobkaufmann:execution-spec-tests:init-eip-7805\n\nfor the test fixtures, see the `tests/osaka/eip7805_focil/test_focil_module.py` file. i'll open a PR against the execution-spec-tests repo once we merge the execution-specs PR above.\n\nit would be great to have an EL w/ a focil implementation attempt to execute the focil fixtures. and recommendations for new fixtures welcome. can open a PR on my fork in the meantime if that facilitates the discussion.",
        "created_at": "2025-05-31T04:30:39.900000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hey! (On mobile) I think that the execution specs should short circuit the tx execution, because otherwise this is a DoS vector which we don't want to accidentally include.\n\nNo hard promises, but I will start on an implementation in EthJS (we also support filling tests with EEST)",
        "created_at": "2025-05-31T07:46:40.551000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Cross-layer",
        "parent": "",
        "content": "I will have to take a look at the EEST tests but technically only engine tests make sense right? Not blockchain or state tests since the IL is not part of tx/block 🤔",
        "created_at": "2025-05-31T07:56:28.877000+00:00",
        "attachments": null
    }
]