[
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "so am I right in saying that if the IL is not satisfied the block should still be treated as valid but this INVALID_INCLUSION_LIST should be returned? this contradicts what the EIP currently says",
        "created_at": "2025-02-21T10:54:00.343000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "One-out-of-N majority assumption, which means as long as 1 IL committee member is honestly building its IL (including all txns including censored ones) the mechanism works as expected. If we have no or little overlap between ILs this doesn’t hold anymore.",
        "created_at": "2025-02-21T11:43:22.825000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think this property needs an important qualification; as long as one proposer is honest then we can get a tx included through the IL *if there is space in the IL*. In situations where there are many more pending transactions than space in the IL this doesn't hold. If all ILs are built with the same deterministic rules then the de facto amount of space is 8kb, not a lot when we think about an L1 with much higher gas limit and being able to handle mass exits while maintaining censorship resistance for example.",
        "created_at": "2025-02-21T13:57:29.524000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "By having *mostly* disjoint ILs we potentially 16x the bandwidth for transactions being included through the IL. What I’m proposing is to split txs in the pool into 16 buckets, and assign one to each committee member. Each time the member selects a tx they pick from their own bucket with high probability, but with some low probability they pick from another bucket. In this way I think the 1 of N property is actually strengthened, even if we land in a bucket with a censoring committee member there is still a good chance we can be included by an honest one, but now there is much more space. This way we fully realise the benefit of having 16 committee members.",
        "created_at": "2025-02-21T13:57:33.718000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah to be clear I’m not arguing the approach you’re suggesting is a bad one, but then it does ignore important dimensions like priority fees or time spent in the mempool which also make sense to take into consideration imo when including some txns over others. That’s why I’m advocating for a diversity of rules",
        "created_at": "2025-02-21T14:06:51+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "My suggestion would be to have this as the recommended approach with some room to tweak, for example a random shuffle which weights some txs slightly higher. My concern is that by leaving it unspecified we will end up with different clients having similar scoring rules and largely overlapping ILs",
        "created_at": "2025-02-21T14:09:16.814000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also even if we do have a diversity of rules I think some nondeterminism is important. Otherwise we could end up with a committee that happens to all be running the same EL with exactly the same scoring function",
        "created_at": "2025-02-21T14:10:46.450000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think I’d rather have a client prioritise “not overlapping”, another one time spent in the mempool, another one priority fees, etc… \n\nThe only pushback against optimizing for non-overlapping ILs is just that it ignores other important dimensions.",
        "created_at": "2025-02-21T14:12:06.036000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "that's a good point, I agree some amount of nondeterminism would be great",
        "created_at": "2025-02-21T14:12:25.480000+00:00",
        "attachments": null
    },
    {
        "author": "marchhill",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think optimising for non-overlapping ILs would work better if all committee members follow largely the same base algorithm I described, and I think this is the most important thing to optimise for. I agree these other things are important but I think we could still have diversity and consider these factors by allowing little tweaks to this base algorithm",
        "created_at": "2025-02-21T14:17:19.456000+00:00",
        "attachments": null
    }
]