[
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003c@1035747431461167125\u003e  I believe now we have the first CL interop between Prysm and Lodestar. The issue was Prysm was missing `DOMAIN_IL_COMMITTEE` preset. So Prysm used `0x00000000` instead of `0x0C000000` as a seed value when shuffling validators for IL committee. After adding the preset, it makes progress well and Lodestar doesn't emit ILC root difference error log which was added few days ago.\n\nKurtosis config: https://github.com/jihoonsong/local-devnet-focil/blob/7affa6e599e32d7189c83e295d72b8170293c5cc/kurtosis/kurtosis.config.registry.interop.yaml\nPrysm code: https://github.com/prysmaticlabs/prysm/pull/15088",
        "created_at": "2025-04-05T11:46:27.494000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "Screenshot_2025-04-05_at_8.33.13_PM.png",
                "content": "348d51efc257b1317ca5fb2a44e9814a3cbfbbb3121d691c60fa10954a057ef3"
            }
        ]
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "I have few things to share.\n\nOne is that we should set `seconds_per_slot: 12` for correct behavior at least for now. (If you set it 6, you can still see the interop works but ILs are empty or become stale.) This is because Prysm uses hard-coded values for IL submission deadline and IL view freeze deadline, which are 8s and 9s respectively. (Haven't checked how Lodestar handles this.) We agreed to make them relative to `seconds_per_slot` but then I think the spec should specify how the relative calculation works?\n\nSecond is that Dora works as expected but it's a bit unstable when you click IL tab. Sometimes it flickers and doesn't show any IL txs, making you click another tab and then re-click IL tab. It's a known issue but has low priority imo. I'll be working on other issues but if you can't stand it anymore, please let me know 🙂",
        "created_at": "2025-04-05T11:47:48.964000+00:00",
        "attachments": null
    },
    {
        "author": "nflaig",
        "category": "Cross-layer",
        "parent": "",
        "content": "Regarding your first question, in Lodestar we have those values as part of config (as per spec) but we cannot derive them from `SECONDS_PER_SLOT` in that case, although you could easily adapt them via config, so let's say you change `SECONDS_PER_SLOT` to 6 then you could separately set `VIEW_FREEZE_DEADLINE` to 5 (based on formula `SECONDS_PER_SLOT * 2 // 3 + 1`), and the fractions of second per slot are already defined in the spec, eg. see [VIEW_FREEZE_DEADLINE](https://github.com/ethereum/consensus-specs/pull/4003/files#diff-26426b9b899404021b0ddbc114d42e93a98ebf34b93b4d2b7c8175180599b6a2R32), also see previous discussion [here](https://github.com/ethereum/consensus-specs/pull/4003#discussion_r1920541508). But yeah, I already hinted at this during the last call, we should \"inline\" the calculation and move those out of the config to not rely on manual config overrides, also this makes it much simpler for chains like Gnosis which already overrides `SECONDS_PER_SLOT` and uses a different value than mainnet config.",
        "created_at": "2025-04-05T15:36:13.037000+00:00",
        "attachments": null
    },
    {
        "author": "nc1234",
        "category": "Cross-layer",
        "parent": "",
        "content": "That’s good news thanks for the hard work🎉",
        "created_at": "2025-04-05T17:34:54.639000+00:00",
        "attachments": null
    }
]