[
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Summary of breakout #8: https://github.com/ethereum/pm/issues/1435#issuecomment-2791712894\nShorter summary of breakout #8: https://x.com/jih2nn/status/1910237451874136348",
        "created_at": "2025-04-10T07:45:27.861000+00:00",
        "attachments": null
    },
    {
        "author": "mehdi.aouadi",
        "category": "Cross-layer",
        "parent": "",
        "content": "Teku joined the interop party and is progressing with Lodestar. You can now use the `ethpandaops/teku:focil` docker image in the kurtosis config\nTeku \u003c\u003e Lodestar interop works well and the chain keeps progressing\nTeku \u003c\u003e Prysm still needs some debugging since the nodes fork away when FOCIL activates (Looks like Prysm looses its Teku peers for some reason).\n**By the way, an issue in Dora has been fixed and we can now set the correct fork `eip7805` in both the `Eth-Consensus-Version` header and the `version` metadata of the eip7805 fork objects. They will be handled correctly**\nFor Lodestar, imu this is not required anymore: https://github.com/ChainSafe/lodestar/pull/7342/files#diff-fa555ece31de8c0c754fb0a6cc6b520d43fc0048dc2d55f54471568223cf686eR147\nPrysm sets `electra` in both and that could be updated so we can have the same responses from all the clients",
        "created_at": "2025-04-10T10:30:04.245000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "Screenshot_2025-04-09_at_17.35.00.png",
                "content": "a82001a57210c3aac5f82af6ce778ae5b3f4ec75e1bb3c78b7f659303fe881f8"
            },
            {
                "type": "text/plain; charset=utf-8",
                "origin_name": "focil-teku-lodestar.yaml",
                "content": "538a8fbae780dff9182d5712276fe0d14c4242507d9d83d7b4937b14243f36b7"
            }
        ]
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "amazing!",
        "created_at": "2025-04-10T10:30:34.830000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "During the breakout #8, we had a discussion about the activation epoch approach versus the custom fork approach. The sentiment leaned toward to the custom fork as most of clients already implemented it albeit it comes with boilerplate code. Also, we wanted to have some input from Nimbus as it seems they had trouble with the activation epoch during BPO.\n\n\u003c@785811170387951616\u003e from Nimbus and I had a chat. I was told that the activation epoch approach is tricker for Nimbus. Since FOCIL doesn't change block and state, Nimbus could just change version and epoch of Fulu fork, which they already have, and then use it for eip7805 fork. This would be 1 line of code for them.\n\n(FYI, Nimbus hasn't started FOCIL and is currently busy with PeerDAS.)\n\nAlthough it's cumbersome to implement custom fork for some clients, given that most of CL clients have already implemented or prefer custom fork, it seems going with the custom fork would be better. I'm sorry that no decision satisfies everyone.\n\nHere is my two cents. I think this is partly coming from path dependency as FOCIL started with eip7805 fork following what ePBS folks did with eip7732 fork, AFAIK. Unfortunately, it seems there is no silver bullet, so it would boil down to trade-offs and reaching a consensus across client teams. In future, we can decide which approach to take after laying out the trade-offs, e.g., whether block and state change, along with the amount of boilerplate depending on client's implementation, etc.\n\nPlease share your thoughts, if any 🙂",
        "created_at": "2025-04-10T12:16:56.857000+00:00",
        "attachments": null
    }
]