[
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "the PTC here only checks the IL bitlist condition is satisfied (would be the same thing if attesters of slot N had to vote on IL bitlist), this is what is sometimes referred to as \"split enforcement\" because the attesters of slot N+1 do the whole validity (nonce and balance) checks",
        "created_at": "2025-07-07T07:56:49.097000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e the PTC here only checks the IL bitlist condition is satisfied\nThis is against the payload or just local view? Because one difference is here PTC should already have the payload vs attesters of slot N (at earlier interval) dont have the payload yet and could only check against local view\nI dont mean execution here, I just mean making sure the IL txs exist in the payload (that's it)",
        "created_at": "2025-07-07T13:15:21.895000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "ah yeah I was only thinking about post execution but a simple \"IL txns inclusion\" view check would actually be quite nice for the PTC to do",
        "created_at": "2025-07-07T13:58:49.975000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "checking that the IL tx exist in the payload is kinda useless isn´t  it? if they are all there you get a plus, but if they aren't? what is the PTC to do? the txs may be out because they were already satisfied correctly, and the PTC can't find this out without executing",
        "created_at": "2025-07-07T14:03:47.014000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "yeah the added confidence boost even if one-sided might be worth doing this quick check? shouldn't be the reason why we use the PTC over attesters but if we do, might as well check this?",
        "created_at": "2025-07-07T14:05:17.855000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "well, the background of my question is driven by implementation. To verify this, I would need to add an execution engine API call, since the CL client alone isn't not enough, we need the EL client for that. I agree it's not very useful, so in this case, it's better to avoid the added implementation complexity",
        "created_at": "2025-07-07T14:07:49.257000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Here is an article about the discussions on the [CL spec PR](https://github.com/ethereum/consensus-specs/pull/4351): https://hackmd.io/@jihoonsong/S1c2dhMrle  Please review it and provide some feedback when you have some time. (Tagging people who were in the call \u003c@425572898787426305\u003e \u003c@592004585506340885\u003e \u003c@993802539856314398\u003e)",
        "created_at": "2025-07-07T14:09:52.179000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Bumping discussion on introducing IL broadcast deadline at 12s to avoid split view by equivocating ILs. This was brought up in the last breakout call cc \u003c@725415098331430932\u003e",
        "created_at": "2025-07-07T14:13:38.711000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think this is a remnant of historical changes. IIRC, it reflects the EIP's IL Committee Members section: `If no block is received by t=7s, they should run get_head and build and release their ILs based on the node’s local head.` Do we want to change both the EIP and engine API?",
        "created_at": "2025-07-07T14:18:12.563000+00:00",
        "attachments": null
    }
]