[
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hey, I've been summarizing some thoughts on \"FOCIL + delayed execution proposals\":\nhttps://hackmd.io/@Nerolation/BJFix4E2kx",
        "created_at": "2025-03-16T11:35:32.187000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think there is a confusion that it requires execution to verify IL constraints. Attesters check any missing IL transaction's validity (nonce and balance) and see if there is enough gas left to include any of them.\n\nThe \"Execution Layer\" section in the EIP is misleading and we have a PR that corrects it. This would affect on the whole document so please take a look: https://github.com/ethereum/EIPs/pull/9381/files",
        "created_at": "2025-03-16T15:43:47.241000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "If a proposer didn't include a transaction (e.g. because another tx drained its balance at the top of block), then the tx must be checked against the state post execution. For those post-execution nonce and balance checks, you first need execution, no way around.",
        "created_at": "2025-03-16T16:01:23.343000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "The fact that it doesn't introduce new data structure seems nice but can attesters still attest to wrong head when the access list is incorrect?",
        "created_at": "2025-03-16T16:22:49.274000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yeah, I think this is inherent to block access lists + delayed execution.\nIn some sense, block level access list and FOCIL are quite similar on the constrain that both come with new block validity checks after execution that go beyond state transition validity checks.\nAnother noteworthy downside of block level access fix is the fact that simply touching a sender address from an IL can be used to prevent forced inclusion of that entity's transaction. In practice, someone who doesn't want to include anotherone's tx might also not want to \"touch\" that address but ya.. definitly a downside.",
        "created_at": "2025-03-16T17:33:44.324000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "Nice. Some thoughts here, I didn’t want to clutter your hackmd, so dropping them below  \n\n- The requirement for attesters to execute all ILs is a bit more nuanced. There are optimizations we should probably list in the EIP as well. You only need to execute an IL transaction if another transaction from the same sender is already in the block. Otherwise, you can quickly check if the block is full or just mark the IL as not satisfied and reorg the block. This is more of a client implementation detail.  \n- As an attester, FOCIL isn't incompatible with EIP-7732 the way it is with delayed execution in EIP-7886. They follow different designs. FOCIL doesn’t make attestation any worse for EIP-7732, but it does give the IL committee and the next slot proposer less time to construct a block compared to today, since the payload is only released at 6s.  \n- With EIP-7886, if I had to choose between a block bitlist or an execution payload access list, I’d definitely go with the access list. It’s much cleaner in terms of design, and it allows the CL to just fetch the payload from the EL with the access list already populated",
        "created_at": "2025-03-16T20:05:45.625000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think your first point is false with 7702",
        "created_at": "2025-03-16T22:45:14.381000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "So a balance can change under a different senders address in 7702? Then I am wrong on that one",
        "created_at": "2025-03-16T22:51:03.470000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "Any address can drain any other address",
        "created_at": "2025-03-16T22:59:49.567000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "There are some prechecks that you can do like checking for addresses with delegate addresses but still you need the state for that",
        "created_at": "2025-03-16T23:01:13.060000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Cross-layer",
        "parent": "",
        "content": "This is what broke 7547",
        "created_at": "2025-03-16T23:01:44.437000+00:00",
        "attachments": null
    },
    {
        "author": "terencechain",
        "category": "Cross-layer",
        "parent": "",
        "content": "hm ya, I guess it's more about the destination address (to) in this example. 7702 makes this very tricky",
        "created_at": "2025-03-16T23:16:24.157000+00:00",
        "attachments": null
    }
]