[
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "hey just to get back to FOCIL with txn hashes:\n\nWe considered this last year https://meetfocil.eth.limo/focil-but-with-transaction-hashes/ but decided it was actually not a good idea because of the following attack vector it opens, described by \u003c@520034910149410861\u003e at the time:\n\nImagine you can now include 256 txn hashes per IL (given a size limit of 8kb). \n\nNow what you could do is send an IL with 256 hashes, but only send each tx to ~1/256 of the nodes right around the deadline. This means each txn is now rare in the mempool, and any txn missed by the builder would cause 1/256 nodes not to vote for its block. And this is just for one IL, for 16 ILs you potentially have 256*16 mempool txns to deal with (instead of just 16 objects, the ILs, to worry about if ILs contain full txns). \n\nAnd if you decide to say: all txns must be available for an IL to be enforced, then it becomes very easy to \"nullify\" a whole honest IL by introducing in it a tx that fails to propagate (e.g. you send it to the EL node of the IL proposer, but simultaneously propagate something conflicting in the mempool). \n\nAnother think to deal with is how to deal with large txs. On the CL that's not a problem because of only propagating the hashes, but on the EL you can still end up requesting something large, e.g. someone could put a bunch of hashes corresponding to 100 KBs txs and force everyone to request them, and in particular making it harder for the builder to succeed (even if nobody is able to get all txs in time, many nodes might have at least one tx that the builder does not and vote against their block).",
        "created_at": "2025-06-27T11:25:36.957000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "Validators would only accept messages that come with signed IL (with hashes) AND matching transactions. You'd check that the transaction hashes match the transaction before accepting the entire message.",
        "created_at": "2025-06-27T11:28:12.917000+00:00",
        "attachments": null
    },
    {
        "author": "nero_eth",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's different from the \"FOCIL, but with transaction hashes\" in the way that it would not replace full tx with tx hashes but take the full tx out of the signed object and enforce the signed object and the full tx are propagated together, as one object. This way, you reduce the proof size for equivocations",
        "created_at": "2025-06-27T11:29:47.439000+00:00",
        "attachments": null
    },
    {
        "author": "soispoke",
        "category": "Cross-layer",
        "parent": "",
        "content": "ah ok it is quite different then it's purely an optimization based on separating objects got it",
        "created_at": "2025-06-27T11:32:36.337000+00:00",
        "attachments": null
    }
]