[
    {
        "author": "jochembrouwer",
        "category": "Cross-layer",
        "parent": "",
        "content": "To check my understanding: am I correct that the IL for slot N (block B) consists of the ILs broadcasted during slot N-1 and slot N-2? I see that those are valid to be broadcasted over the P2P network. But it is unclear to me if the IL \"cache\" would consist also of even older ILs (of older slots?).",
        "created_at": "2025-05-17T00:54:43.123000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Cross-layer",
        "parent": "",
        "content": "I can see how this \"force inclusion\" could help against censorship, but if a large part of block builders actively reject censored transactions this would thus also mean that the ILs (if my assumption that these consists over the ILs broadcasted over the last 2 slots and not taking into account older ones) consisting of this actively censored transaction need to be created for each slot. If large parts of proposers actively censor these, then they will not include those in the IL.\n\nIf those are actively being censored, then block builders could aggressively start to fill blocks in order to ensure that there is not enough gas left for the censored transaction to be added to the block (thus passing the IL inclusion rule)\n\nIf this is not possible (mempool is empty, or it is somehow very hard to choose a subset of the mempool to reach a certain cumulative gas used in the block such that the tx cannot enter) then the actively censoring builders could also inject their own transaction to fill this \"missing\" gas. They will have to burn the `baseFee * gas` (cost of actively censoring - which might be funded from priority fees so this would not yield a net negative cost).\n\nIs it also considered that ILs could be used to \"force-push\" transactions of themselves by pushing txs with 0 priority fee? Especially simple eth transfers have the smallest gas limit necessary, so these would be picked (forcefully) more often than more complex transactions (those who execute code), since it could be that such tx can fit in the block (and thus must do so) and more complex transactions cannot. Especially censored transactions which are complex (high gas limit) might thus still be troubled to get included 🤔",
        "created_at": "2025-05-17T01:00:53.187000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Cross-layer",
        "parent": "",
        "content": "It's also likely that I miss a key point of the EIP, I got the feeling I'm missing something obvious here 😅",
        "created_at": "2025-05-17T01:01:18.283000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Cross-layer",
        "parent": "",
        "content": "Upon reading some more on past research it seems like these points have already been noted, so I'm just \"behind\" on reading the past discussions 🙂 But if anyone has a good pointer or a \"gotcha\" let me know 🙂",
        "created_at": "2025-05-17T04:51:46.037000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e To check my understanding: am I correct that the IL for slot N (block B) consists of the ILs broadcasted during slot N-1 and slot N-2? I see that those are valid to be broadcasted over the P2P network. But it is unclear to me if the IL \"cache\" would consist also of even older ILs (of older slots?).\n\nFOCIL has the `same-slot` property: `With FOCIL running in parallel with the block building process for slot N+1 during slot N, the constraints imposed on block B for slot N+1 can include transactions submitted during slot N.`.\n\nBy design, IL committee members for slot N should broadcast their ILs in slot N-1 (more precisely, before 8 seconds into the slot N-1), and these ILs should be considered when a block for slot N is being built.",
        "created_at": "2025-05-17T14:26:16.434000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "\u003e Is it also considered that ILs could be used to \"force-push\" transactions of themselves by pushing txs with 0 priority fee?\n\nThere was a concern that what if ILs become a vehicle for MEV. We couldn't find a meaningful scenario of such cases and the friction to create a market seems bigger than the benefits of having such market. The intuition is, if you were to ask IL committee members to include your transactions, why don't you just talk to a proposer directly.\n\n\u003e the actively censoring builders could also inject their own transaction to fill this \"missing\" gas.\n\nA censoring builder could ignore ILs by simply missing a slot, or filling a block to the full as you mentioned. EIP-1559 makes it difficult for the latter to sustained.",
        "created_at": "2025-05-17T14:27:14.057000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "FOCIL allows more diverse participants to have a say in the block content, which will give us better censorship resistance.\n\nThere are 16 IL committee members per slot. Assuming there are 6% solo stakers, the chance of having at least one solo staker in each IL committee is roughly 63%. To put it in different ways,\n\n- A solo staker becomes a block proposer by every roughly 17 slots. (1/0.06 ⋍ 16.67)\n- A solo staker becomes an IL committee member by every roughly 2 slots. (1/0.63 ⋍ 1.59)\n- With FOCIL, solo stakers can take part in deciding block content 10.5 times more.\n\nFOCIL makes small operators relatively larger in the censorship resistance service: https://x.com/barnabemonnot/status/1886804038395502666",
        "created_at": "2025-05-17T14:27:33.941000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Also, currently, Ethereum's censorship resistance relies on small operators' altruistim. FOCIL alleviates that burden: https://x.com/adietrichs/status/1892951240524403089",
        "created_at": "2025-05-17T14:27:34.847000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "While FOCIL's main focus is to uphold Ethereum's censorship resistance, its properties could be leveraged for scaling L1. \u003c@486501030046203915\u003e  and many other researchers and developers explored it quite extensively.\n\n- [Decoupling throughput from local building](https://ethresear.ch/t/decoupling-throughput-from-local-building/22004)\n- [Paths to SSF revisited](https://ethresear.ch/t/paths-to-ssf-revisited/22052)\n- [Protocol Research Call 1](https://www.youtube.com/watch?v=m5HFO4DYckQ)",
        "created_at": "2025-05-17T14:27:59.853000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Here are FOCIL website, EIP and specs:\n\nFOCIL website: https://meetfocil.eth.limo/\n\nEIP: https://eips.ethereum.org/EIPS/eip-7805\nConsensus specs: https://ethereum.github.io/consensus-specs/specs/_features/eip7805/beacon-chain/\nExecution APIs: https://github.com/ethereum/execution-apis/pull/609",
        "created_at": "2025-05-17T14:28:11.475000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Sometimes, or many times, reading code is more straightforward. Currently, FOCIL can run a local devent of 3 CLs and 1 EL. Here are their repos and you can also run it by yourself using this [Kurtosis config](https://github.com/jihoonsong/local-devnet-focil/blob/main/kurtosis/kurtosis.config.registry.interop.yaml).\n\nPrysm: https://github.com/OffchainLabs/prysm/pull/14754\nLodestar: https://github.com/ChainSafe/lodestar/tree/focil\nTeku: https://github.com/Consensys/teku/tree/focil\n\nGeth: https://github.com/ethereum/go-ethereum/pull/30914",
        "created_at": "2025-05-17T14:28:26.334000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "FOCIL breakout is also a great source to follow up its progress. Each github issue has its minutes.\n\n#1: https://github.com/ethereum/pm/issues/1220\n#2: https://github.com/ethereum/pm/issues/1238\n#3: https://github.com/ethereum/pm/issues/1266\n#4: https://github.com/ethereum/pm/issues/1291\n#5: https://github.com/ethereum/pm/issues/1325\n#6: https://github.com/ethereum/pm/issues/1363\n#7: https://github.com/ethereum/pm/issues/1408\n#8: https://github.com/ethereum/pm/issues/1435\n#9: https://github.com/ethereum/pm/issues/1493\n#10: https://github.com/ethereum/pm/issues/1523",
        "created_at": "2025-05-17T14:28:54.896000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Cross-layer",
        "parent": "",
        "content": "Hey, great thanks a lot for these responses! I also noticed the FOCIL breakout and will listen in to those 😄 👍  You are also very right regarding reading code instead of the spec. Will do so. Thanks a lot 😊 👍",
        "created_at": "2025-05-17T15:01:09.109000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Cross-layer",
        "parent": "",
        "content": "I have a small suggestion for the EIP, the provided image (in the EIP) shows the timeline for slot `N-1` to slot `N` (in this slot block `B` gets released), but the text describes the process for slot `N` to slot `N+1` (where `B` gets released). The timeline does also not match with the text (IL committee members in text have sec 0-8 to broadcast ILs instead of in pic 0-9)",
        "created_at": "2025-05-17T15:35:41.994000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "diagram_FOCIL.png",
                "content": "70766eb0d540331999a327a5d9465718c89390c86362f638888dffed7646bcb1"
            }
        ]
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "I think you have a point. Maybe we can address this in the upcoming breakout on next Tuesday.\n\nRegarding 0-8 vs 0-9, honest IL committee members should broadcast their ILs before 8 seconds into the slot but ILs can be propagated to validators until 9s. The last 1 second is to help all validators receive all ILs. But yes, I think it would be better if it could deliver two different deadlines.",
        "created_at": "2025-05-17T15:44:58.474000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Cross-layer",
        "parent": "",
        "content": "Ah yes right, I think the text version is \"better\" here so IL committees have a 8s deadline to send their IL and then there is this 1s window for validators between 8s-9s to propagate these ILs. So there is this tiny grace period between 8-9s where validators can still broadcast new ILs added just before this deadline closure of submitting these\n\n~~However this is somewhat confusing for the validators to me~~\n\nNvm its not 🙂 Rubber duck debugged it 😛",
        "created_at": "2025-05-17T15:58:48.091000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Great, please feel free to ask questions, if any!",
        "created_at": "2025-05-17T16:04:22.695000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Cross-layer",
        "parent": "",
        "content": "Yes I will 🙂 One of the major things I've learned in this space is that there is no such thing as stupid questions and that they should just be asked 🙂 Also helps to pinpoint things in the spec which might need clarification 😄",
        "created_at": "2025-05-17T16:07:30.573000+00:00",
        "attachments": null
    },
    {
        "author": "jochembrouwer",
        "category": "Cross-layer",
        "parent": "",
        "content": "Some meta notes: \nThis (see pic) is amazing and should be done everywhere (keep discussions at one or at most two places). Discussions tend to be everywhere for some other research topics.\nThe resources, especially this: https://meetfocil.eth.limo/ are FANTASTIC. I feel like I'm super quickly getting up-to-date with the latest state and the past research done on this topic 😄",
        "created_at": "2025-05-17T17:24:41.173000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "image.png",
                "content": "6553ba80cc65701c8e88ba38c2b241f4ed4043b64492bdf3b66abe439a492a56"
            }
        ]
    },
    {
        "author": "jochembrouwer",
        "category": "Cross-layer",
        "parent": "",
        "content": "I do not understand the final rule here for the EL side. What should this do? Previous rules already checked that T on S is either valid or invalid. And if it is valid, then block B is invalid 🤔",
        "created_at": "2025-05-17T19:24:39.754000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "image.png",
                "content": "44d036880719ffab1daf773dc228d876a7941968fdf6de17651a8e3a2aa86ac6"
            }
        ]
    }
]