[
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "Very well written \u003c@845691100072509460\u003e.\n\nFor IL validation, I'm in favor of `ExecutionEngine.is_inclusion_list_satisfied` without modifying `state_transition` for the reasons you stated.\n\nFor IL placement, I'm slightly in favor of option 3 because I like having an `on_inclusion_list` function as this is consistent with other parts of the spec. Not at all a strong opinion on this.",
        "created_at": "2025-07-08T12:46:05.294000+00:00",
        "attachments": null
    },
    {
        "author": "jih2nn",
        "category": "Cross-layer",
        "parent": "",
        "content": "Thanks for the feedback. Does being consistent with other parts mean modifying the fork choice store via the fork choice handler?",
        "created_at": "2025-07-08T14:25:45.374000+00:00",
        "attachments": null
    },
    {
        "author": "jtraglia",
        "category": "Cross-layer",
        "parent": "",
        "content": "Not sure, but I suppose the answer is yes. But I’m open to whatever makes most sense.",
        "created_at": "2025-07-08T14:53:05.463000+00:00",
        "attachments": null
    },
    {
        "author": "m.kalinin",
        "category": "Cross-layer",
        "parent": "",
        "content": "Great writeup! I would suggest to have a separate `is_inclusion_list_satisfied(store: Store, block_root: Root) -\u003e bool` function, and then inside of this function fetch IL transactions and make a call to ExecutionEngine. I think we should use `EXECUTION_ENGINE` constant as it is done in the `state_transition` rather than passing the engine as a parameter to `on_block` handler.\n\nPersonally, I am in favour of a separate `InclusionListStore` that encapsulates all the logic specific to ILs including `on_inclusion_list` handler. Then `is_inclusion_list_satisfied` function can obtain an instance of `InclusionListStore` via `get_inclusion_list_store()` function that abstracts instantiation of the `InclusionListStore`.\n\nI think with the above design we have `Store` and IL functionality as loosely coupled as possible and at the same time an interface to check ILs in the `on_block` pipeline.\n\nOn the testing side. We could add a new test format to test ILs logic including equivocations and CL clients will have an option to support this new test suite or not, this suite will be based on the `InclusionListStore` and `on_inclusion_list` handler. And also extend fork choice tests with `is_inclusion_list_satisfied` flag which tells the CL client whether a block's IL satisfied our not -- this is to test an impact of IL status on the fork choice separately from the logic of ILs processing.",
        "created_at": "2025-07-08T16:34:45.262000+00:00",
        "attachments": null
    }
]