[
  {
    "author": "saraswat4225",
    "category": "Cross-layer",
    "parent": "",
    "content": "Thanks for the feedback! \nAgreed - CL side should be straightforward since the Engine API plumbing exists. The main challenge is DVT node consensus when mempools diverge.\nOur proposed approach: Leader-based QBFT where one node's IL becomes canonical if 2/3+ can validate it (vs. per-transaction voting which risks undersized ILs). Would be great to get CL implementer input on- Does this endpoint pattern (/eth/v1/validator/inclusion_list) fit Validator API conventions? Timing; IL at 3/4 slot = ~9s window. QBFT adds ~200-500ms. Feasible? Any concerns exposing mempool derived data via Validator API? Looking forward to it",
    "created_at": "2026-01-30T03:06:35.942000+00:00",
    "attachments": null
  },
  {
    "author": "pellekrab",
    "category": "Cross-layer",
    "parent": "",
    "content": "My bad I must have skimmed your papers too quick. Option 1 makes the most sense to me since every DVT setup I have used shares one beacon node for the cluster anyway. It sounds like most of the work is on the Charon side, have you dropped this in the Obol discord server yet?",
    "created_at": "2026-01-30T10:51:52.940000+00:00",
    "attachments": []
  },
  {
    "author": "saraswat4225",
    "category": "Cross-layer",
    "parent": "",
    "content": "Option 1 is simpler but not ideal from a DVT philosophy perspective - the whole point is duties are \"distributed\" across nodes, not delegated to one. Having a single Charon instance generates the IL defeats that.\nshared BN - checked the codebase and it's not enforced, just operational. --beacon-node-endpoints accepts multiple endpoints per instance, so clusters could have separate BNs per node. Whether operators actually do that varies.\nHaven't dropped it in main Obol server yet - first trying to gauge if the problem is legit and if solutions make sense from decentralization/performance standpoint before bringing it to implementers.",
    "created_at": "2026-01-30T15:38:01.965000+00:00",
    "attachments": []
  },
  {
    "author": "pellekrab",
    "category": "Cross-layer",
    "parent": "",
    "content": "This server is more focused on the CL and EL impls and it sounds like DVT solutions you are talking about are code changes for Charon. So I’d recommend contacting the Charon team. If you need I flag down the right people at Obol to get you some better incites.",
    "created_at": "2026-01-30T15:43:44.556000+00:00",
    "attachments": []
  }
]