[
    {
        "author": "hudsonjameson",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003c@456226577798135808\u003e I agree with you and we should be cognizant to not let these breakout sessions turn into tons of calls. What is your ideal formats or mediums for async comms? If it isn't multiple sub-rooms per topic what is it?",
        "created_at": "2020-09-15T05:19:51.694000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I would love to see **more people discussing things in public chat rooms**.  I'm a *huge* fan of the Turbo Geth discord server because it appears *all* of their dev communication is done via their channel so I can listen in casually.  Also, because of this it is really easy to get an answer/feedback from their team because they are very active in Discord.",
        "created_at": "2020-09-15T05:27:28.979000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "For the broader core dev community, I have often struggled to get feedback from them on changes (e.g., 1559, 2718, etc.) outside of a call.  It ***feels* like the ACD calls are the only time that some of the core devs will look** at anything outside whatever it is they are working on for the rest of the week.",
        "created_at": "2020-09-15T05:28:38.518000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Often times right before (when people are prepping) or right after a call where I bring up something that has been open for discussion on Magicians forum/Discord for weeks or months there will be a sudden flurry of questions and answers that all could have been answered at any time in the weeks leading up to the call, which ***implies*** that many people are seeing the issue for the first time at/around the ACD call.",
        "created_at": "2020-09-15T05:30:19.575000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "Unfortunately, this results in **a lot of conversations that could happen outside of the call being forced into the call because it seems to be the only way to get core dev attention** sometimes.",
        "created_at": "2020-09-15T05:30:56.548000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "(note: I have seen this pattern not just for stuff I'm championing, but also stuff others are championing)",
        "created_at": "2020-09-15T05:31:11.414000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I don't have a great solution to this as I definitely don't think us champions have any place telling core devs how to manage their time.  However, I *do* think it would be valuable to get more eyes/feedback on things outside of the calls so the calls can focus on specific issues that need a call for resolution.",
        "created_at": "2020-09-15T05:31:56.304000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003c@!191378736254287874\u003e There is no ideal medium that fits everybody. It is a balancing act, of course. And it is dynamic - we often move from one place to another. Also depends on what priorities of the groups are. For example, we used to do a lot of calls in turbo-geth team to discuss Pull requests before they are merged. It was great for education and I got a lot of positive feedback about that. But it was hard for me, because things moved too slowly. So I had to drop most of them and force communication mostly on Discord. There are things we've gained and thing we've lost. We've gained some development cadence. But people in the team started to be less aware of other people's context. I had to compensate for that by having to be on top of everything, but I prefer this to having calls, because it is asynchronous and fitted better my lifestyle (especially when schools were closed and I could not plan my days in advance)",
        "created_at": "2020-09-15T06:13:11.305000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution Layer",
        "parent": "",
        "content": "For larger dev community like this one, the trade-offs are even harsher",
        "created_at": "2020-09-15T06:13:34.871000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution Layer",
        "parent": "",
        "content": "You can do lots of calls, but things will get annoyingly slow",
        "created_at": "2020-09-15T06:13:59.607000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution Layer",
        "parent": "",
        "content": "You can do a lot of async communication, but it does not mean you can just leave it to its own devices - it requires very active facilitation",
        "created_at": "2020-09-15T06:14:33.647000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution Layer",
        "parent": "",
        "content": "What I have been saying for a long time - core developers as a group are OVERWHELMED with amount of things being proposed and needed to be processed. I have been calling for pauses and moratoriums for ages, but noone seems to be taking me seriously on that, even core developers themselves",
        "created_at": "2020-09-15T06:15:34.178000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution Layer",
        "parent": "",
        "content": "😥",
        "created_at": "2020-09-15T06:15:46.510000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution Layer",
        "parent": "",
        "content": "We've been through this on calls in July, many perhaps think it was useless, but I got tons of valuable information from these",
        "created_at": "2020-09-15T06:17:44.849000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution Layer",
        "parent": "",
        "content": "and it informs my strategies and actions now",
        "created_at": "2020-09-15T06:17:54.316000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution Layer",
        "parent": "",
        "content": "Most of things that are being proposed and discussed are not very important in my opinion. And ACD is being \"too soft\" and \"crowd pleasing\" not to prioritise harder. I would take a more active role in this, but at this moment, it is counterproductive for me to try to do it. Not only I am very busy building turbo-geth and researching eth1 scalability, but also historically I had almost no influence on any decision, so often I feel like Cassandra 🙂 But when I feel that this is changing, I may take a more active role",
        "created_at": "2020-09-15T06:28:08.234000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I suspect everyone feels like Cassandra.  😄",
        "created_at": "2020-09-15T06:29:34.285000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "\"If we don't address the usability issues Ethereum will fail!\"\n\"If we don't address scaling issues Ethereum will fail!\"\n\"If we don't address task prioritization Ethereum will fail!\"\n\"If we don't address attack vectors Ethereum will fail!\"",
        "created_at": "2020-09-15T06:30:11.095000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "If Ethereum fails, we'll all claim to be right.  😉",
        "created_at": "2020-09-15T06:31:08.986000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution Layer",
        "parent": "",
        "content": "Yes, and each of us has to prioritise our own health and sanity (IMO), so we've got to \"pick our fights\" carefully. That is why I just let most of the things I disagree pass by me, hoping that they will be delayed (or never happen), or hoping that we can reverse them later 🙂",
        "created_at": "2020-09-15T07:34:15.153000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003e  I have been calling for pauses and moratoriums for ages, but noone seems to be taking me seriously on that, even core developers themselves [...] And ACD is being \"too soft\" and \"crowd pleasing\" not to prioritise harde\n\nI totally agree with this, but we have different priorities. I personally prioritize 2929 very highly, which I think you don't (?). I don't really care about subroutines, and I'm scared of bls-precompiles (and would personally rather reject them). I see the yolov1 / yolov2 definitions as the best way to drive them forward. I talked to \u003c@!329594653097721856\u003e yesterday; at OE, they don't want to implement anything that isn't already \"definite\" for Berlin. But IMO nothing is definite for Berlin, it's what we make of it. I see the decision process as a spiral between spec\u003c-\u003etest, eventually leading up to well-tested implementations that are ready for mainnet. And the decision to include something becomes \"definite\" when it's eventually slated for a particular blocknumber.",
        "created_at": "2020-09-15T09:02:42.039000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "Execution Layer",
        "parent": "",
        "content": "Maybe we (personally) should be clearer about what we _really_ think about EIPs. Basically rate them on a scale: \" Very much dislike ... Meh ... Very much approve\"",
        "created_at": "2020-09-15T09:04:02.809000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "Execution Layer",
        "parent": "",
        "content": "I think it's problematic that it's so easy to use the  \"disagreement through silence, and hope for it to pass by\"  approach... that's what makes things get accepted as in \"well, nobody seems to object here...\"",
        "created_at": "2020-09-15T09:06:08.191000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "As both an EIP editor and an EIP champion, it would be great to get more clear feedback from core devs on their current sentiment, along with *why* they hold that sentiment.",
        "created_at": "2020-09-15T09:06:09.085000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "Execution Layer",
        "parent": "",
        "content": "And I guess a problem for you as EIP author is that the only ones who will give you feedback on a moderately complicated proposal are the ones who are already in favour of it, those who don't agree with it are less likely to spend X hours diving into it",
        "created_at": "2020-09-15T09:07:39.868000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "I *try* to address that by splitting EIPs up as much as possible into byte sized chunks, but sometimes that isn't possible, and sometimes I fail at it, and sometimes monolithic is necessary for some reason.",
        "created_at": "2020-09-15T09:09:29.150000+00:00",
        "attachments": null
    },
    {
        "author": "holiman",
        "category": "Execution Layer",
        "parent": "",
        "content": "As for \"2718\", I personally just want to have access lists in, and if 2718 is the way to do that, well.... However, it seems like a very large proposal for something which, ostensibly, shouldn't need such large changes",
        "created_at": "2020-09-15T09:10:05.431000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "2718 is because it sure would be nice to not introduce technical debt every time we want to add something like 155 (chain ID) or 2930 (access lists).",
        "created_at": "2020-09-15T09:11:30.760000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution Layer",
        "parent": "",
        "content": "It isn't strictly necessary, but it makes it so we *can* do stuff like 2930 without introducing technical debt that we'll be stuck paying for years.",
        "created_at": "2020-09-15T09:12:01.476000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution Layer",
        "parent": "",
        "content": "\u003c@!211091239112671234\u003e I agree with what you said. I am happy to be clear about my opinions, if that makes a difference. My current take, for example, that we can solve DOS problem without EIP-2929, but I can accept it as a temporary solution, I am afraid though that having this solution will discourage people from solving the problem properly, and insted kick the proverbial can. Everything else which is currently proposed and discussed for Berlin, can wait for indeterminate period of time, because the highest priority was and still is scaling",
        "created_at": "2020-09-15T09:19:08.588000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution Layer",
        "parent": "",
        "content": "I also think that if EIP-2929 is so urgently needed, it needs to be carried on without exemptions",
        "created_at": "2020-09-15T09:20:44.054000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution Layer",
        "parent": "",
        "content": "because then it becomes dead simple",
        "created_at": "2020-09-15T09:20:54.849000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution Layer",
        "parent": "",
        "content": "and can go out in few weeks",
        "created_at": "2020-09-15T09:21:02.328000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution Layer",
        "parent": "",
        "content": "If it is not so urgently needed that we care so much about exemptions, then it does not have to be rushed through, and proper time allocated for its implementation and testing",
        "created_at": "2020-09-15T09:23:33.521000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution Layer",
        "parent": "",
        "content": "priorities are a bit too fluid there at the moment",
        "created_at": "2020-09-15T09:25:18.742000+00:00",
        "attachments": null
    }
]