[
    {
        "author": "timbeiko",
        "category": "Execution Layer",
        "parent": "",
        "content": "My rough view of where 4488 is at after talking with different people:\n\n1. The implementation _is_ somewhat simple: Geth and Nethermind seem to have had one done in \u003c1 day. Obviously needs more for testing, but it's not a big change.",
        "created_at": "2021-12-06T17:09:45.162000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution Layer",
        "parent": "",
        "content": "2. One concern is moving away from our aggressive \"don't raise the gas limit because of state growth\" stance to \"add 4488 and deal with the history growth later\". More charitable, we probably won't hit the history growth limits in 4488 that soon, but it's worth noting the shift in stance.",
        "created_at": "2021-12-06T17:10:57.980000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "Execution Layer",
        "parent": "",
        "content": "3. Another concern is the change to The Roadmap: not only did we agree to focus on The Merge for now, but that also implied not doing everything else that's in the queue, and now 4488 skips ahead.",
        "created_at": "2021-12-06T17:13:54.104000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "My understanding of the \"don't raise the gas limit\" argument was that it usually had more to do with the risk of txs that are super linear in validation time w.r.t. their gas cost? E.g. Broken Metre style attacks",
        "created_at": "2021-12-06T17:14:14.532000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution Layer",
        "parent": "",
        "content": "But also, we are now working towards a way of pruning historical data so I think it's fair to pursue more aggressively proposals which increase that historical data",
        "created_at": "2021-12-06T17:20:27.004000+00:00",
        "attachments": []
    },
    {
        "author": "vorot93",
        "category": "Execution Layer",
        "parent": "",
        "content": "1. If we’re no longer concerned with disk requirements, then gas limit increase should go in first and foremost, because without it Ethereum is no longer viable for most use cases.\n2. A lot of very good EIPs like EOF were shafted due to The Merge. Now we want to backtrack on the roadmap, all thanks to Twitter influencer hype. Very rational decision making, yes.",
        "created_at": "2021-12-06T18:34:30.598000+00:00",
        "attachments": []
    }
]