[
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Personally, I oppose this.  It speeds up jumpdest analysis, but I want to get rid of it.\n \n Why not just encode the pushdata with the high bit always set, so the bytes can't be jumpdests?",
        "created_at": "2021-09-08T23:04:35.888000+00:00",
        "attachments": null
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Would we then have to do 7/8ths decompressions?  Or am I not understanding what you are proposing?  Having to bit shift every byte of a push operation would be a loadstone around performance.  IIRC the Push series is the #1 operation by volume.",
        "created_at": "2021-09-08T23:06:44.262000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Not my expertise (machine code semantics and whatnot), but with EOF and a scheme that does validation of jumps at the time of creation, removing the need for runtime validation, doesn't that get us the \"win\" we've been looking for?  What does this still leave us wanting?  My understanding was that greg's recent proposal got us this far.",
        "created_at": "2021-09-08T23:09:29.114000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Pretty close, depending on how far we go.... (delete detail...) This is a suggestion that is much simpler and can get in much sooner to fix a know DoS problem.",
        "created_at": "2021-09-08T23:12:36.976000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I couldn't find the histogram, but I think most PUSHn are for very small n, and I'd guess that the work of encoding the immediate data into the 256-bit stack slot would be a bigger performance hit than a looping over a few bytes masking and shifting.",
        "created_at": "2021-09-08T23:15:29.884000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Attached are counts for I forget how many thousand blocks at the tail of the chain some months ago.",
        "created_at": "2021-09-08T23:19:23.016000+00:00",
        "attachments": [
            {
                "type": "text/plain; charset=utf-8",
                "origin_name": "opcode_counts_sorted.txt",
                "content": "c90e4154f00b6151fbab6a9d1d6e34b4688c5ebc31975d0683f6ce5231eb1cce"
            }
        ]
    }
]