[
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks a lot for this \u003c@!848181786763984926\u003e !",
        "created_at": "2021-09-21T07:01:55.083000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And thanks a lot for coming in here \u003c@!469936733073702915\u003e",
        "created_at": "2021-09-21T07:02:06.423000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think there's two proposals for neutering selfdestruct:\n\n1. Make it turn the contract into a stub that cannot be accessed anymore (if we want to do this while preserving the code immutability property, we could accomplish this by eg. overloading the nonce)\n2. Make it into just a \"send all ETH\" opcode",
        "created_at": "2021-09-21T07:03:47.032000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I personally have no strong feelings to one of these options over the other!",
        "created_at": "2021-09-21T07:05:16.095000+00:00",
        "attachments": []
    },
    {
        "author": "albusdompeldorius",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "What is your opinion on the proposal where we make selfdestruct just send all ETH, but still allow selfdestructing a contract if it happens in the same transaction as it was created? That solves the issue with pine finance, and you don't need to write anything to the state at all for such contracts.",
        "created_at": "2021-09-21T08:00:14.199000+00:00",
        "attachments": []
    },
    {
        "author": "albusdompeldorius",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I believe there is still an issue with pine finance in both your proposals. Funds can be frozen with proposal 1, or be stolen with proposal 2, but I can do more analysis on the extent of the problem, I.e. how much funds could be at risk. It's possible that you are still safe if you use the front-end, instead of interacting directly with the contract though.",
        "created_at": "2021-09-21T08:10:03.377000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I believe this still leaves us with most of the technical debt that we would like to get rid of.",
        "created_at": "2021-09-21T08:26:27.012000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Though, one could argue that in such cases the contract would never be written to storage at all, so maybe it is acceptable?",
        "created_at": "2021-09-21T08:26:42.436000+00:00",
        "attachments": []
    },
    {
        "author": "albusdompeldorius",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah, that's what I was thinking. You don't have to deal with deleting unbounded state, or having different versions of a contract in the state, since nothing is ever written to state. You get the property that contract code is immutable once it is written to the state. What other technical debt is there that we would like to get rid of? There is of course more implementation complexities with this proposal compared to just neutering selfdestruct, since it creates a corner case, but my suspicion is that this complexity is relatively small compared to the situation today.",
        "created_at": "2021-09-21T08:41:01.825000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In general, the preference is to come up with solutions that delete technical debt without adding any additional debt.  If this is the *only* option then I can be convinced that it is better than the status quo, though I'm skeptical of that because in general existing technical debt has lower cost in this space than new technical debt (since it is a sunk cost).",
        "created_at": "2021-09-21T08:47:37.362000+00:00",
        "attachments": []
    },
    {
        "author": "albusdompeldorius",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Couldn't you argue that this proposal is a strict removing of technical debt since it removes a part of SELFDESTRUCT, namely the part where you are allowed to destroy a contract that existed before the current transaction? The same way that turning selfdestruct into a SEND ALL ETH   opcode is a strict removing of technical debt since it removes most (but not all) of the existing functionality.",
        "created_at": "2021-09-21T08:55:25.837000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Interesting! Though it does add complexity compared to removing it outright",
        "created_at": "2021-09-21T09:55:07.864000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I could be okay with doing something like that as a temporary feature with a 180-day limit if it helps pine people move to a new version",
        "created_at": "2021-09-21T09:55:48.228000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The other reason why it's not perfect is that it still injects a hole into the code immutability invariant, and there's the possibility that there's some attack using that exception against applications that depend on code immutability (not yet sure how this would happen, but exploits are always really surprising so it's good to be careful)",
        "created_at": "2021-09-21T09:58:39.710000+00:00",
        "attachments": []
    },
    {
        "author": "albusdompeldorius",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If we are eventually going to remove the feature anyway, perhaps it isn't worth doing the intermediate step. There is no need for pine users to migrate to a new version, they just need to make sure to use different vault addresses each time after selfdestruct is neutered. This should be (and perhaps already is, \u003c@469936733073702915\u003e ?) enforced by the front-end.",
        "created_at": "2021-09-21T10:38:09.045000+00:00",
        "attachments": []
    },
    {
        "author": "albusdompeldorius",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Also, IIUC, funds lying in vaults at the time of the hard fork are NOT at risk, since it would still be possible to create a contract at the same address  as a contract that selfdestructed before the hard fork.",
        "created_at": "2021-09-21T10:43:14.547000+00:00",
        "attachments": []
    },
    {
        "author": "0age",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Fantastic analysis \u003c@848181786763984926\u003e",
        "created_at": "2021-09-21T10:50:02.408000+00:00",
        "attachments": []
    },
    {
        "author": "0age",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Surprising how few accounts have redeployed contracts",
        "created_at": "2021-09-21T10:50:56.350000+00:00",
        "attachments": []
    },
    {
        "author": "0age",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I really like the proposed solution of “Allow selfdestructing a contract if it was created in the same transaction, and neuter SELFDESTRUCT in all other cases” — enables one-time-use deployments with dynamic execution",
        "created_at": "2021-09-21T10:52:57.234000+00:00",
        "attachments": []
    },
    {
        "author": "0age",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Smart wallets with no code at rest (nothing to hack!) that can perform very flexible logic",
        "created_at": "2021-09-21T10:54:27.175000+00:00",
        "attachments": []
    },
    {
        "author": "0age",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Though if it’s just a temporary measure then I’m not sure even that makes much sense… the uncertainty around the fate of the opcode already deters innovation there, obviously that will be amplified if there’s a ticking clock on it’s lifespan",
        "created_at": "2021-09-21T10:56:19.884000+00:00",
        "attachments": []
    },
    {
        "author": "albusdompeldorius",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I suppose you could probably get the same effect using a combination of CREATE2 and DELEGATECALL.",
        "created_at": "2021-09-21T11:18:48.702000+00:00",
        "attachments": []
    },
    {
        "author": "0age",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You could get something pretty close, but at a much higher gas cost and with _some_ code at rest",
        "created_at": "2021-09-21T11:26:04.256000+00:00",
        "attachments": []
    },
    {
        "author": "agusx1211",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I will double check later today, but unless we have a big bug it's already enforced on the front end",
        "created_at": "2021-09-21T11:26:58.731000+00:00",
        "attachments": []
    },
    {
        "author": "agusx1211",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "for Pine not to break is only important that the contract can be recreated if the initial create was reverted, but afaik this behavior is not going to change because it's not related to selfdestruct at all",
        "created_at": "2021-09-21T11:28:04.639000+00:00",
        "attachments": []
    },
    {
        "author": "albusdompeldorius",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I believe these are real contract creations. For instance, here is an address that have had 9 redeployments: https://gist.github.com/adompeldorius/2acf402c384cbcf96d53f1d401968f3e",
        "created_at": "2021-09-21T11:52:36.548000+00:00",
        "attachments": []
    },
    {
        "author": "albusdompeldorius",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Why much higher? Because of the delegatecall? I'd suspect that would be minimal compared to the cost of creating the contract.",
        "created_at": "2021-09-21T12:02:48.264000+00:00",
        "attachments": []
    },
    {
        "author": "0age",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You still have to deploy the contract you’re delegatecalling into, though!",
        "created_at": "2021-09-21T12:03:41.132000+00:00",
        "attachments": []
    },
    {
        "author": "albusdompeldorius",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah, I meant a minimal increase in cost.",
        "created_at": "2021-09-21T12:06:15.039000+00:00",
        "attachments": []
    },
    {
        "author": "agusx1211",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "oh makes sense, this seems to be an edge case. If the transaction is sent with just enough gas the contract creation succeeds but then the token transfer fails, leaving the contract to self-destruct anyway (but without moving the funds)",
        "created_at": "2021-09-21T21:42:13.156000+00:00",
        "attachments": []
    },
    {
        "author": "agusx1211",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "so it would become risky too do a transaction on that edge case, I could tell the current team maintaining the project to add some big safety margin on the gas limit estimations, but I wonder if this wouldn't be possible with the existing orders using the execute method",
        "created_at": "2021-09-21T21:43:49.182000+00:00",
        "attachments": []
    },
    {
        "author": "agusx1211",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "good find btw",
        "created_at": "2021-09-21T21:43:53.681000+00:00",
        "attachments": []
    }
]