[
    {
        "author": "albusdompeldorius",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hi guys! I'm wondering how I should proceed from the analysis I did here: https://nbviewer.jupyter.org/github/adompeldorius/selfdestruct-analysis/blob/4647fef99e2aa0a2031b997f3166f07dfa68d7cb/analysis.ipynb\n\nAs I wrote in the analysis, there is an issue with the current proposal to neuter the `SELFDESTRUCT` opcode, in that it opens a security risk to uninformed users of the Pine Finance contract. In short, users of this contract send tokens to an predetermined address called a *vault*. Relayers then trigger a function in the PineCore contract to create a new contract at this predetermined address using `CREATE2`, which executes a trade and then self destructs. Under the current behaviour, it is possible for a user to use the same vault several times. If `SELFDESTRUCT` is neutered, however, this would no longer be possible. In fact, if a user then tried to send tokens to a used vault, anyone could steal the tokens in the vault.",
        "created_at": "2021-08-26T12:47:41.141000+00:00",
        "attachments": []
    },
    {
        "author": "albusdompeldorius",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The possible options I see are:\n1) Continue with the current proposal of neutering `SELFDESTRUCT`, but inform Pine Finance so they have time to deploy a new contract that doesn't suffer from the same risks, in addition to informing their users about the risks of the existing contract. There could perhaps be other contracts that will be exposed to the same risk.\n\n2) Come up with a proposal that does not create the security risk above. This can be done by either\n  a) Implement the full functionality of `SELFDESTRUCT`, but in a way that does not require changing an arbitrary large part of the state. \u003c@!273808422753796097\u003e has suggested a couple of ways to do this, essentially changing which address in the state tree stores the contract state each time the contract is self destructed.\nb) Allowing `SELFDESTRUCT` if the contract was created in the same transaction. This solves the issue in Pine Finance, and also gives us the invariant that deployed contracts are immutable. This may also be less complex to implement than 2a). The disadvantage is that it may be more complicated to reason about this behaviour, where `SELFDESTRUCT` is sometimes allowed, compared to allowing `SELFDESTRUCT` in all cases. Also, while this solution solves the Pine Finance case, there may be other cases that break, so further analysis should be done to find out what else might break.\n\nWhat would be the best way for me to proceed from here? Do we need more chain analysis to help us make a decision? Should I perhaps talk to the developers of Pine Finance?",
        "created_at": "2021-08-26T12:48:39.903000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Best place is to comment on the relevant ethresear.ch/ethereum-magicians thread on the topic.",
        "created_at": "2021-08-26T13:06:59.764000+00:00",
        "attachments": []
    },
    {
        "author": "albusdompeldorius",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Posted here: https://ethereum-magicians.org/t/eip-for-disabling-selfdestruct-opcode/4382/20",
        "created_at": "2021-08-26T13:49:48.889000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Does anyone have history on the 2300 gas stipend for `CALL`?",
        "created_at": "2021-08-26T17:07:55.575000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Where did that number come from, why include it all, etc.",
        "created_at": "2021-08-26T17:08:25.593000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In a world where gas costs never change, it was at one time enough for a CALL + LOG plus some data pushed around, but not enough to write anything to state.",
        "created_at": "2021-08-26T17:23:08.197000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It was before my time, but I think it was a mistake.  I'm not sure if any of the original designers would defend it at this point either.",
        "created_at": "2021-08-26T17:23:36.364000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "👍",
        "created_at": "2021-08-26T17:23:51.832000+00:00",
        "attachments": []
    }
]