[
    {
        "author": "ansgar.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I personally think that it would be important to have a clearly worked out vision here soon. I think we are too far down the merge path for \"keep eth1 separate, have a shiny new execution framework on eth2\" to be realistic. And no such framework will be ready to be introduced as an additional execution shard any time soon after the merge. But still, the question is: Do we expect the base layer execution to become multi-threaded (most likely with only the one legacy EVM shard) medium-term? if so, are we sure that embedding eth1 into the beacon chain itself is the correct way to go for the merge?",
        "created_at": "2021-02-23T09:42:22.968000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Isn't this the hope with rollups though? It seems to me we are relying on rollups for execution scaling anyway, so these seem like the natural places for concurrent innovation. Do we think the \"rollup management\" base layer is still in need of so many changes as to meaningfully profit from concurrent experimentation as well?",
        "created_at": "2021-02-23T09:44:23.779000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Also, to get back to the main topic of this channel: I am generally in favor of the \"use the willingness for change of the upcoming eth2 merge for eth1 breaking changes\" approach, but very much agree those should still be done separately (i.e. ideally before the merge).\nOn the topic of removing gas observability: I have recently started to think there are basically 2 different primitives here: sub-calls and sub-transactions. So far, the protocol only supports sub-calls (i.e. the tx origin stays the same, payer stays the same etc.), and for those I think it was a mistake to have gas observability. If the damage caused by removing that now is reasonably small, I would be in favor of that. However, at the same time I think there are multiple proposed new features that really do need gas observability and I think are better thought of as sub-transactions. Those are mainly EIP-3074 (sponsored (sub-)tx precompile, see \u003c#745077610685661265\u003e and \u003c#779922457631916064\u003e for recent discussion) and account abstraction, but it might be interesting to also think about other use cases (I think there might be a case for a `PAYGAS`-like opcode even without account abstraction). Basically, where a whole separate sub-transaction is being initiated, with its own tx origin, payer, ..., the initiating contract should be able to have all the same abilities a human creating a top-level tx has. That should include setting the gas limit. Without that, we basically close the door for anything resembling native in-protocol meta-transactions.",
        "created_at": "2021-02-23T09:57:12.890000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't think 3074 needs gas observability?",
        "created_at": "2021-02-23T10:03:03.335000+00:00",
        "attachments": null
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I remember a bunch of \"Phase 1(.5) and done\"/\"roll-up centric roadmap\" posts, but was there any post on making eth1 itself be more like an optimistic rollup, and having eth2's sole execution environment initially be the minimum possible set of (abstracted away) executions to verify optimistic and zk-rollups? I'm not sure if this is at all possible or makes sense though, but that may avoid \"cluttering\" eth2 with the legacy EVM.\n\nOtherwise, I feel that whatever path is chosen, there is something to be said for _not_ choosing a path where the current EVM has to indefinitely to exist as part of eth2. Either have it be integrated loosely at the start/merge, or choose a path where it can be made a \"loose\" coupling later on.",
        "created_at": "2021-02-23T10:03:52.029000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hmm, perhaps you are calling \"ability to limit gas to `call`\" `gas observability`?",
        "created_at": "2021-02-23T10:04:57.125000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think most people use the term gas observability to refer to opcodes like the gas remaining one (I forget its name).",
        "created_at": "2021-02-23T10:05:24.481000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, just realized I was imprecise in my wording here. Indeed, my main point was about ability to set/limit gas, not to observe it.",
        "created_at": "2021-02-23T10:07:42.662000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "To me it seems like an open question whether we can get to a \"good enough\" rollup management base layer by iterating on eth1, or if at some point we might want to introduce an additional, optimized execution framework for that.  Either way, most of the existing eth1 dapps will sooner or later have to migrate, if only into a rollup.",
        "created_at": "2021-02-23T10:11:38.835000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think there are versions of statelessness that will minimize the cost of keeping eth1 around forever though.",
        "created_at": "2021-02-23T10:13:33.807000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Side note there: I am a bit surprised that we haven't seen more effort by rollup teams to start pushing eth1 towards rollup management optimizations yet (things like native sandboxed \"EVM spawning EVM\")...",
        "created_at": "2021-02-23T10:18:28.829000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "EVM spawning EVMs would be awesome for rollup management, but some sort of versioning has to be implemented to make it work correctly (otherwise challenges could become non-deterministic after hard-forks). At the same time, implementing an EVM using an smart contract is not hard, but for some reasons not all teams are doing that (Optimism is using the bare-metal EVM to execute the rollup contracts)",
        "created_at": "2021-02-23T10:20:29.403000+00:00",
        "attachments": null
    },
    {
        "author": "ansgar.eth",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ah interesting. Makes sense that sandboxed EVM execution would be tricky to get right, and I assume might only be realistic once we have some standardized form of statelessness. But I think aside from this specific example we should start to consider \"does this help with rollup management\" as one of the guiding questions for future eth1 upgrades (or downgrades, as we are talking about feature removal here). To me the medium-term vision for eth1 would be to basically get it to some form of \"execution environments light\" where instead of execution environments we have rollups, but with much of the same general design principles. E.g. encourage per-dapp/per-rollup statelessness with expensive base layer state reads/writes, primarily to be used for dapp state root management, but increase / optimize for pure execution throughput for things like zk proofs and verkle tree proofs against shard data...",
        "created_at": "2021-02-23T10:33:14.650000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes I totally agree, and the way I see it the current roadmap is heading in that direction, state is of very little need on rollups, computation is also important but is not as critical for optimistic (imho if the incentives are right, an optimistic rollup should never see a dispute), I think the most important thing for rollups is data availability",
        "created_at": "2021-02-23T10:36:01.541000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "also all research for the evm is important, because rollups are still instances of the same evm, thus are vulnerable to the same problems of state bloat, not at the same extent because we can somewhat rely on having at least 1  honest watchtower (also we can have multiple parallel rollups), but the current evm limitations are still there",
        "created_at": "2021-02-23T10:38:49.507000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The \"original vision\" was actually to try to reduce the distinction between calls and transactions",
        "created_at": "2021-02-23T18:58:32.788000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Which eg. account abstraction is aiming to do; basically try to get down to the point where ideally a transaction is just a top-level call",
        "created_at": "2021-02-23T18:58:54.688000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So there is a bit of a fork in the road here; to go down that path or to make these two different types of call",
        "created_at": "2021-02-23T19:00:00.366000+00:00",
        "attachments": null
    }
]