[
    {
        "author": "agusx1211",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hey guys! I'm one of the guys who founded Pine finance. I'm afk right now but happy to help is pine is being a roadblock here",
        "created_at": "2021-09-18T11:57:57.078000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If our frontend works correctly we should user the same vault for two different orders, even if the orders are identical we also use a salt, so the vaults are different",
        "created_at": "2021-09-18T11:59:03.993000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I can do a deeper analysis later this week tho, btw kudos to Evan for calling this to my attention",
        "created_at": "2021-09-18T12:00:51.503000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Maybe is better to think of selfdestruct as a kill switch for a contract that can only be used once? So instead of not doing nothing it marks the contract as disabled/removed, and no other contracts can be deployed on that address?",
        "created_at": "2021-09-18T12:04:14.601000+00:00",
        "attachments": null
    },
    {
        "author": "albusdompeldorius",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hi, are you saying that the vaults have different addresses when using the front-end? I discovered quite a few redeployed vaults deployed by pinecore; at the time of the analysis ~10% of the deployed vaults were redeployments. Were these vaults created manually without using the front-end?",
        "created_at": "2021-09-18T12:27:45.051000+00:00",
        "attachments": null
    },
    {
        "author": "albusdompeldorius",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm not certain that this would solve this specific problem. If we neuter selfdestruct, funds sent to a used vault can be stolen by anyone, but if we make selfdestruct mark the contract as disabled, funds sent to a used vault would be locked instead.",
        "created_at": "2021-09-18T12:33:57.984000+00:00",
        "attachments": null
    },
    {
        "author": "agusx1211",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Are those redeployments real or just a failed deploy (reverted) followed by a real one?",
        "created_at": "2021-09-18T12:39:13.895000+00:00",
        "attachments": null
    }
]