[
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I had to look up what \"passive aggressive\" really means. And I am not sure it means what Artem is saying. I found this article (https://www.mayoclinic.org/healthy-lifestyle/adult-health/expert-answers/passive-aggressive-behavior/faq-20057901) I do not want to split hairs here, but I suspect the sentence \"Proposal 1 = add yet another piece of logic into consensus-sensitive code\" wrote by another person perhaps would not cause such reaction. Maybe Artem needs to change his identity on Discord to try to see if his criticism would be taken differently 🙂",
        "created_at": "2021-09-26T16:00:30.602000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It is certainly possible that there is pre-existing bias in interpretation.  When I read it, my mental model of Artem says the words in my head projecting my memory of his mannerisms/tone from previous conversations.",
        "created_at": "2021-09-26T16:13:30.239000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think if we don't get the balance right, it simply means that the real issues and criticism have to be discussed elsewhere - like in that joke - for every official telegram channel there are 10 un-official telegram channels discussing things not allowed in the official channel",
        "created_at": "2021-09-26T16:14:13.570000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "FWIW, I don't fully agree with Piper on this particular instance, but I can see where he is coming from I think (which is why I responded).",
        "created_at": "2021-09-26T16:15:49.543000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And more on-topic, I agree with the argument I believe was being expressed and also am not a fan of option 1 for the same reasons.",
        "created_at": "2021-09-26T16:16:16.977000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Ok, I suggest that we move on 🙂",
        "created_at": "2021-09-26T16:16:33.594000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I personally think there should be a binary choice - either leave SELFDESTRUCT as it is, or remove it completely. Anything in between does add complexity and should not be any high priority",
        "created_at": "2021-09-26T16:19:28.295000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Would you still hold that position if we had regenesis of some form (and could drop code from before the selfdestruct neutering?",
        "created_at": "2021-09-26T16:20:15.391000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Where \"regenesis\" here means any of the proposals where clients are no longer expected/required to have state or be able to execute blocks prior to some regenesis block.",
        "created_at": "2021-09-26T16:20:50.529000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Main reason to remove SELFDESTRUCT at this point is because it is a very unusual intstruction - it is only efficient if you assume non-flat state layout",
        "created_at": "2021-09-26T16:23:13.976000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "in the flat state layout, SELFDESTRUCT can be arbitrarily expensive",
        "created_at": "2021-09-26T16:23:34.755000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "unless you use some state shadowing tricks, which increase complexity of the state layout a lot",
        "created_at": "2021-09-26T16:24:00.131000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "SELFDESTRUCT just changing to an opcode that \"sends all ETH\" would not have that effect, right?",
        "created_at": "2021-09-26T16:24:46.944000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If SELFDESTRUCT does not destruct anything, then it solves the problem of being arbitrarily expensive, yes. Was this proposal 1?",
        "created_at": "2021-09-26T16:26:23.533000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Oh, I see, it is proposal 2",
        "created_at": "2021-09-26T16:27:15.683000+00:00",
        "attachments": null
    },
    {
        "author": "vorot93",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "by the way, if any particular implementation goes ahead with removal of full validation sync, that would be effectively regenesis right there",
        "created_at": "2021-09-26T16:29:46.778000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "another big issue with SELFDESTRUCT which is related to the previous one is that the inverse of it is even more expensive. And the inverse is required when you do reorg on the flat state layout",
        "created_at": "2021-09-26T16:30:29.837000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yeah, the most simple form of \"regenesis\" is to just have all clients have some kind of fast-sync mechanism and agree on a block other than 0 from which it is *expected* people can sync from normally.",
        "created_at": "2021-09-26T16:31:20.849000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I was thinking about making SELFDESTRUCT more like `rmdir` in Unix - it only works if the directory is empty 🙂",
        "created_at": "2021-09-26T16:31:27.924000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Would that address your concerns?  If you could only SELFDESTRUCT after all of the storage slots were written to 0?",
        "created_at": "2021-09-26T16:32:04.899000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Wouldn't it be difficult to count all of the set storage slots?",
        "created_at": "2021-09-26T16:32:15.734000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yes, in that case, the gas cost of SELFDESTRUCT is commensurate with its effect on the flat state",
        "created_at": "2021-09-26T16:32:47.761000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "there is an issue of counting storage slots, but I think it is solveable",
        "created_at": "2021-09-26T16:33:20.317000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Tracking set state feels like unnecessary complexity.  I would rather neuter SELFDESTRUCT personally.",
        "created_at": "2021-09-26T16:34:02.685000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Regarding re-genesis - I have not thought about it for a long time, but hopefully will start again at some point, currently trying to design (yet another) state sync in Erigon 🙂",
        "created_at": "2021-09-26T16:36:42.698000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Yup, I'll both move on and own that my interpretation involves me attributing \"tone\" based on my own biases.",
        "created_at": "2021-09-26T17:16:14.250000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Is there something problematic about the flat state model that makes the approach of using \"incarnation counters\" to just leave the state behind but start fresh in a new empty state in the next deployment of code to that address.",
        "created_at": "2021-09-26T17:17:47.703000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "incarnation counters do work, but they do add quite a fair bit of complexity. Now, for example, as we are introducing state sync, we need to first make sure that all incarnation counters are canonical across the nodes (we did not have that requirement before). Also, incarnations make it trickier to work with the history. So if SELFDESTRUCT is gone, we would be able to not use incarnation counters at least for the current state.",
        "created_at": "2021-09-26T17:31:37.195000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If I were to re-design SELFDESTRUCT, I would make it like `rmdir`, and of course, I would have tracked the storage slot count. But as we stand now, the status quo is probably going to survive for quite a while",
        "created_at": "2021-09-26T17:35:40.027000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm having trouble understanding a route for the `rmdir` to be effective.  If it is \"incentive\" based then it seems like we end up dealing with gas tokens.  If it has no incentives then I don't see people actually going through the effort to cleanup the state.  And similarly, there's an issue where in many cases it may not be feasible to clean state because it exceeds the size that could be cleaned in a single sweep and thus, leaves the contract in some \"inbetween\" state that would likely expose security issues, along with making smart contract dev more complex.\n\nMaybe this is only targeted at a small set of use cases?  If there's any material I could read on what this mechanic would look like let me know.  I know everything I just wrote is just my own extrapolation from the concept of `rmdir`.",
        "created_at": "2021-09-26T17:42:40.841000+00:00",
        "attachments": null
    }
]