[
    {
        "author": "vorot93",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Gas costs are a virtual entity that does not currently reflect implementation complexity",
        "created_at": "2021-07-22T05:25:24.172000+00:00",
        "attachments": []
    },
    {
        "author": "wjmelements",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Right, they reflect estimated computation, which is more important.",
        "created_at": "2021-07-22T17:37:42.760000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Don't forget about storage costs (which all this is really about)",
        "created_at": "2021-07-22T17:41:21.695000+00:00",
        "attachments": []
    },
    {
        "author": "vorot93",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Selfdestruct with negative gas cost does not",
        "created_at": "2021-07-22T17:52:19.025000+00:00",
        "attachments": []
    },
    {
        "author": "wjmelements",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I started a SET_CODE EIP in 2019 but never finished it",
        "created_at": "2021-07-22T17:52:20.105000+00:00",
        "attachments": []
    },
    {
        "author": "wjmelements",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "That's tiny and addressed in London. Much larger is the aforementioned savings on every contract access by skipping SLOAD+DELEGATECALL.",
        "created_at": "2021-07-22T17:53:16.877000+00:00",
        "attachments": []
    },
    {
        "author": "vorot93",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And selfdestruct is still far heavier on the node than sload and delegatecall",
        "created_at": "2021-07-22T17:54:00.212000+00:00",
        "attachments": []
    },
    {
        "author": "vorot93",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "In fact, it's the single worst opcode that EVM has",
        "created_at": "2021-07-22T17:54:28.168000+00:00",
        "attachments": []
    },
    {
        "author": "wjmelements",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "You're going to have trouble convincing me the 5 billion+ gas saved by using self destruct to upgrade https://etherscan.io/address/0x0000000000007f150bd6f54c40a34d7c3d5e9f56 in https://etherscan.io/tx/0x1626c89c81407dafa32589074cc99d17179f3c8209f44f4ad90f23f879e60fcf is less impactful than the added difficulty from code mutability when you don't even reference the advantages of immutability in your argument. Your case is focused on how hard it is for you to write that code, but I don't care about you; I care about the thousands of nodes that need to validate the millions of transactions I am going to do.",
        "created_at": "2021-07-22T18:02:16.715000+00:00",
        "attachments": []
    },
    {
        "author": "vorot93",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't have to convince you of anything. You are the epitome of special interests and lobbying on AllCoreDevs and in this Discord. If you had your way, we would have had gas tokens in Ethereum platform just because you hoarded millions of those.\n\nThe fact that you are even allowed to attend is the largest sign of governance failure in this community I've seen to date.",
        "created_at": "2021-07-22T18:07:34.242000+00:00",
        "attachments": []
    },
    {
        "author": "wjmelements",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If I had my way, I would have obsoleted all of my gas tokens to save your headache and reduce the burden on the network, but that was your least favorite of my proposals iirc.",
        "created_at": "2021-07-22T18:18:44.513000+00:00",
        "attachments": []
    },
    {
        "author": "vorot93",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "May I refresh your memory?\n\nhttps://github.com/ethereum/EIPs/pull/3322\n\n2 options:\n- you seriously wanted to have gas tokens right in Ethereum protocol, because you wanted a \"compensation plan\"\n\nhttps://ethereum-magicians.org/t/eip-3298-removal-of-refunds/5430/3\n\n- you made an intentionally bogus EIP, with the goal of stalling removal of refunds\n\nEither of these mean that you should not be allowed anywhere close to ACD, especially since you are not a client developer anyway.",
        "created_at": "2021-07-22T18:28:23.566000+00:00",
        "attachments": []
    },
    {
        "author": "wjmelements",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Of course I remember. 3322 would have obsoleted my gas tokens. You're only trying to censor me because your arguments are bad and you hate me for showing you so. Ultimately I failed to preserve elasticity only because elasticity was deemed too risky to remain in London, and for no other reason. The issues I raised regarding gas incentives resulted in a better solution, which was adopted without my opposition. You don't need to be toxic; we're all in this together.",
        "created_at": "2021-07-22T18:34:19.366000+00:00",
        "attachments": []
    },
    {
        "author": "vorot93",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So you made an intentionally bogus EIP then to stall consensus.\n\nWorse for you.",
        "created_at": "2021-07-22T18:36:15.213000+00:00",
        "attachments": []
    },
    {
        "author": "wjmelements",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Not true. I still think it's great, and would support it again with changes to block gas limit. A lot of the opposition to 3322 in the call was centered around attaching the refund to the account, but that's not strictly necessary, and not advisable since most accounts would store zero gas.",
        "created_at": "2021-07-22T18:39:33.540000+00:00",
        "attachments": []
    },
    {
        "author": "wjmelements",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Block elasticity is the best part of 1559. I hope some day in the future people will realize we can go much higher than 2x.",
        "created_at": "2021-07-22T18:41:43.362000+00:00",
        "attachments": []
    }
]