[
    {
        "author": "vorot93",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Logsbloom and receipts root verification takes non-negligible amount of time during execution and consistently shows up on perf for Akula",
        "created_at": "2022-08-07T06:57:48.746000+00:00",
        "attachments": []
    },
    {
        "author": "vorot93",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As usual, I don't believe it's reasonable to make full nodes mandatorily pay for light client needs",
        "created_at": "2022-08-07T06:58:21.504000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I am of the belief that light clients should be a top priority, and if we want to remove things that they need then we *first* need to find a way around that need (e.g., replace with another mechanism or figure out how to build useful light/stateless clients without those things).",
        "created_at": "2022-08-07T12:57:52.198000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "At the moment (and much to my chagrin), consensus clients right now need receipt history back to beacon chain genesis.",
        "created_at": "2022-08-07T12:59:00.503000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Unfortunately, many dapps follow this same pattern as well.",
        "created_at": "2022-08-07T12:59:11.988000+00:00",
        "attachments": []
    },
    {
        "author": "_shemnon",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "receipts root verification IMHO is needed as there is no other place that emitted logs contribute to the block hash.  logsblooom hash mostly contributes to receipt size bloat and all of the information is already present in the receipt and logs, so it is duplicate informatnon, which it why I support removing it.  It can still be calculated but I don't believe it adds value to the block hash calculations as it is just a restatement of other information already present.",
        "created_at": "2022-08-07T23:54:58.325000+00:00",
        "attachments": []
    }
]