[
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The callstack definitely increases the max memory required",
        "created_at": "2022-07-18T06:35:57.904000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The current de facto callstack depth is around 400 or so",
        "created_at": "2022-07-18T06:36:03.961000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(used to be 1024, and that rule is still in there, but the 63/64 rule supersedes it)",
        "created_at": "2022-07-18T06:36:16.502000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Another weird alternative is to set `max_memory = call gas`, and `max_child_call_gas = parent_call_gas - parent_memory`",
        "created_at": "2022-07-18T06:37:22.639000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So you get a nice hard \"total memory \u003c= gas limit\" invariant",
        "created_at": "2022-07-18T06:37:33.352000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But things like this would break existing apps that rely on gas limits",
        "created_at": "2022-07-18T06:37:53.176000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Which of course does not mean that they should not be done",
        "created_at": "2022-07-18T06:38:00.131000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Just that they should be done as part of a careful general effort to reform everything dumb about the gas mechanism",
        "created_at": "2022-07-18T06:38:16.614000+00:00",
        "attachments": null
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "ok, the more I think about this the more I like it",
        "created_at": "2022-07-18T06:39:51.209000+00:00",
        "attachments": null
    },
    {
        "author": "gcolvin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The whole gas model needs review and empirical research.\n\nI generally like the idea, except for the apparent hard limits.  Generally, I think hard limits may (or may not) make things slightly easier for implementors, but impose unnecessary constraints on programmers.  That is, it would be good if you could write contracts that use arbitrary amounts of  stack and memory, to arbitrary depths of message calls - just give them enough gas.\n\nThen the only constraints are economic, and the gas prices need to reflect that.  And I think that both the crypto-economics and the formal specification are easier that way -- e.g. mathematical stacks have a push operation that cannot fail, and differentiable functions are easier to work with.\n\nFor modern CPUs the important thing is to keep data in the CPU cache, where the ALU can get at it fast.  Data that spills to memory costs many more cycles to access, and programs that spill too much data will thrash.  So we want our gas cost functions to go near-vertical well before a contract would cause thrashing -- that it would cost so much gas to make a client thrash that it would not be a viable DoS surface.\n\nIt will take some work to decide just where that line should be and what functions are best, but modern CPUs have megabytes of cache.  So the limits we have now work, but are likely much more restrictive that necessary.",
        "created_at": "2022-07-18T15:58:02.161000+00:00",
        "attachments": null
    }
]