[
    {
        "author": "sandra_johnson",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "As far as I know (please correct me if I'm wrong), currently block validation \u0026 processing differ between mining and non-mining nodes with respect to the sequence of processing, i.e. miners will validate the PoW in the header, then the transactions in the block and then propagate to its peers; whereas non-mining nodes do the transaction validation last, i.e. they check the PoW in the header, propagate to its peers \u0026 then validate the transactions. I am trying to get a better understanding of changes to this sequence when Stateless Ethereum is implemented. \n1. Will non-mining nodes only validate the PoW in the block header before sending the block \u0026 its witness to its peers? Thereafter validate the state changes, assuming that the witness contains all the information required to execute the transactions in the block? \n2. Is it still the case that the Merkle proof of the sender's account is being included for each transaction, and therefore a non-mining node will forward the witness even if it is out of date, but known to have been valid at some previous stage, assuming they have the chain header?\n3. Will mining nodes validate the PoW in the header, validate the witness \u0026 the block and then propagate to other nodes? \n4. I recall hearing that mining nodes will also not be required to have full state, so who will keep historic state? \nApologies for the many questions! Decided to number them to make it easier for anyone to respond to any one or more of my questions. Thanks 🙂",
        "created_at": "2020-08-31T02:44:33.099000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The behaviour of propagating the blocks is the same for mining and non-mining nodes - they check PoW (and couple of other things), and propagate. Then they replay transactions, compute state root. etc. After that, the behaviour starts being different. Non-mining nodes wait for the next block, mining nodes start making a new block on top of the one received (if it has higher total work than the one they had before)",
        "created_at": "2020-08-31T11:15:15.947000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Depending on which version of proposals we go for, mining nodes may or may not need to keep the entire state",
        "created_at": "2020-08-31T11:16:27.839000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "also, depending on which version we go for, the witness might be created by transaction senders or by the miners",
        "created_at": "2020-08-31T11:16:55.929000+00:00",
        "attachments": null
    },
    {
        "author": "sandra_johnson",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks \u003c@456226577798135808\u003e",
        "created_at": "2020-08-31T21:54:29.620000+00:00",
        "attachments": null
    }
]