[
    {
        "author": "holiman",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Skimming the convo here... If I were to record state access, I would not record at op level, but shim the state-access interface, and record every load. That would mean that two loads (extbalance followed by extcodehash) would only show up once. Any reason to not do it in that approach?",
        "created_at": "2020-04-04T10:47:51.731000+00:00",
        "attachments": []
    },
    {
        "author": "pauld.9606",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is an update on my rewrite of the witness spec.\n\nI made major progress. Most notably, my rewrite is now much closer to \u003c@!520564582196969472\u003e 's spec, in hopes that it will be less controversial to merge.\n\nThere is some awkwardness. The Ethereum state tree includes restrictions like (i) leaf nodes are at a specific nibble-depth, (ii) extension nodes are not parents of extension or leaf nodes, (iii) the maximum nibble-depth is never exceeded, (iv) account nodes are not descendants of account nodes, and (v) nibbles must be handled somehow.\n\nTo capture all of these things, I had to add new syntax rules and new notation.\n\nIf there is negative feedback about too much syntax and notation, a solution may be to keep fewer syntax rules while dumping these extra restrictions into validation rules. So each syntax rule would have an associated semantics rule AND optional validation rules. I am sympathetic to \"economy of thought\", so I am willing to try this.\n\nJudge for yourself whether the current draft has too much syntax and notation. It is at the same link as posted above, https://notes.ethereum.org/dfeV_C-pSI2h378AadR9DQ?view .\n\n\u003c@456226577798135808\u003e \u003c@!520564582196969472\u003e \u003c@!364458974906548225\u003e and all interested parties, I will \"hop-on\" the witness voice channel on Monday, say at 6 PM Berlin time, noon New York time. I wish to briefly explain my witness spec rewrite, and ask for advice on whether and how to merge such a monster rewrite into the current witness spec doc.",
        "created_at": "2020-04-04T20:53:53.334000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hi \u003c@!682078300234973185\u003e Thank you for this work. I only read the first part of it so far (Design Goals), but I will read the rest too, of course. hopping onto the voice channel is a great idea",
        "created_at": "2020-04-04T21:07:12.757000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Is the goal to write a witness spec that works for both the new binary tree and the existing hexary tree?",
        "created_at": "2020-04-04T21:30:22.233000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If so, are we sure that's a goal we want to have?",
        "created_at": "2020-04-04T21:30:39.085000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "given that stateless won't really be viable before we have binary",
        "created_at": "2020-04-04T21:30:49.863000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "the modification to go from hex to binary isn't going to be large. Spec for hexary allows us to compute witneses on the existing data. And we can do a lot of work on the witnesses regardless of whether they are hexary or binary. For example, we can spin up a new optional network for gossiping hex witnesses and play with partitioning to better relay",
        "created_at": "2020-04-04T21:36:13.461000+00:00",
        "attachments": []
    }
]