[
    {
        "author": "_drinkcoffee",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My initial analysis: Percentage reduction due code deduplication: 0.76%\n\nNow for the many caveats:\n* Duplicate code is defined as two or more contracts whose code hash is the same. Code deduplication for witnesses is to determine that two code chunks were sent for different contract addresses that were the same code.\n* The method of determining which code a transaction uses is by statically analysing the contract code to determine which code is reachable for a given function selector.\n* Function Selector rather than strict fixed size chunking was used. Using strict fixed size will yield better deduplication results as there could be overlap at the code chunk level, even if there isn't at the function selector level.\n* Only code size has been taken into account, and no account for hashes or trie keys.\n* For all transactions in blocks 9M to 10M.\n* However, secondary calls from the contract called by the transactions to other contract are not counted.\n* Only contracts that were originally deployed by EOAs were counted. 3.8% of calls were to contracts that were deployed by other contracts. We will be adding these contracts in the next week or two.\n* Percentage of transactions to contracts that the static code analysis failed to analyse: 11.8%. I will be slowly but surely improving the static analysis approach so that it can successfully analyse more contracts.\n\nIn summary, 0.76% would be a small saving. However, there are so many caveats that this result doesn't have good reliability. We at TeamX  will aim to reduce the number of caveats over the next week or two.",
        "created_at": "2020-07-07T05:12:05.816000+00:00",
        "attachments": []
    },
    {
        "author": "mandrigin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Btw, this weekend or early next week I hope to publish my research on the Key Value witnesses that Alexey proposed on the previous call. Waiting for the results on the actual mainnet to be completed now. Around blocks 5.000.000 it looks promising.",
        "created_at": "2020-07-07T05:39:11.611000+00:00",
        "attachments": []
    }
]