[
    {
        "author": "mandrigin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!682078300234973185\u003e I made a naive PoC of generating and parsing a prefix witness https://github.com/ledgerwatch/turbo-geth/pull/440",
        "created_at": "2020-04-11T16:43:31.639000+00:00",
        "attachments": []
    },
    {
        "author": "mandrigin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "it is currently running on the mainnet (tested 2333000 blocks so far)",
        "created_at": "2020-04-11T16:43:49.611000+00:00",
        "attachments": []
    },
    {
        "author": "mandrigin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "one gotcha: I just reversed the list of ops in our (turbo-geth) witness format. \nThat made it almost like what you have described. One gotcha: branch children are stored in the reverse order.\nBut I adjusted the parsing code to account to that.",
        "created_at": "2020-04-11T16:45:51+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We also discussing the performance implications. From the first sight, it looks like the performance of trie construction would be very similar. However, the performance of simply computing the hash without building a trie could be worse for the prefix notation. This is because we need 2 additional stacks to remember branchNode mask, and the remaining number of children (when remaining number of children is 0, we pop branchNode mask from the `maskStack`, then pop required number of children from the `hashStack`, then compute the hash of would-be branch node and push it back to the `hashStack`). In the suffix notation, we only needed `hashStack`, because branchNode with its mask always appears when all the children are already on the stack, so the mask appears exactly where it is needed, and does not need to be kept around.",
        "created_at": "2020-04-11T17:17:56.038000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "the overhead of these two stack is likely to be quite small though, so I suspect we can optimise it to the point where prefix and suffix notations have almost the same performance",
        "created_at": "2020-04-11T17:23:48.568000+00:00",
        "attachments": []
    }
]