[
    {
        "author": "will7466",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e I'm about to do a scan of recent blocks to collect some stats re code merkelization, while I'm here is there additional data that people want me to collect? My plans so far:\n\u003e - For each block record the total size of all the contract bytecodes which are executed (except initcode, since that'll already be paid for)\n\u003e - For each block record the total number of contract bytecode bytes which are actually executed\n\u003e - The same, but instead of drilling down by block, drill down by contract bytecode, to see if there are any contracts which routinely execute a lot of bytes (require a large witness)\n\u003c@!296630428754771968\u003e \n\nSome of this data we can already query historically - I used alethio's data pipeline and these queries can cover historical data and run in 30 seconds to a minute and half. \n\nTo measure the \"actual executed\", we can just sync a node once and log this data and upload it so we can write map reduce jobs/hive/spark against it historically and then can graph pretty quickly/join/structure new data. Also can run matplotlib against this using something like databricks etc.\n\nAnyways, here's a doc with some query wishlists and discussions of what we'd need to do to get some of the expanded data (particularly at the opcode level). The cool thing is once we upload this/sync a node once with additional logging, this data is forever available via map reduce queries and historical partioning can be done in a minute.\n\nhttps://github.com/villanuevawill/query_wishlist",
        "created_at": "2020-04-13T14:01:47.111000+00:00",
        "attachments": []
    },
    {
        "author": "sandra_johnson",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hey \u003c@!386690701343326219\u003e, not sure if this information is already collected, but if not, could you please capture gas details to help with analysing witness gas accounting?",
        "created_at": "2020-04-13T21:40:18.156000+00:00",
        "attachments": []
    },
    {
        "author": "__lithp__",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hi \u003c@!386690701343326219\u003e, I wrote up some results here: https://ethresear.ch/t/some-quick-numbers-on-code-merkelization/7260",
        "created_at": "2020-04-13T21:49:11.039000+00:00",
        "attachments": []
    },
    {
        "author": "__lithp__",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "All the blocks I sampled touched less than 250KB of contract code, which is a much smaller number than I was expecting! Most blocks touch just 15% of of the contract code of the executed contracts.",
        "created_at": "2020-04-13T21:50:42.920000+00:00",
        "attachments": []
    }
]