[
    {
        "author": "afdudley",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Has any thought been given to \"transaction trace witnesses\" or \"partial block witnesses\"? For example, I want to provide someone\n1. the state of a previous block and the proof that state did in fact come from that previous block\n2. a set of transaction hashes\n3. ???some sort of partial trace of those transactions???\n4. a desired set of merkle leaves values for the block that includes those transactions.\nLet's call that a partial-block witness, has anyone looked into constructing these? it seems like it would be fairly easy to modify eth_call to generate this information on per transaction basis, am I missing something?",
        "created_at": "2021-03-25T19:03:49.151000+00:00",
        "attachments": null
    },
    {
        "author": "afdudley",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I want to do this using geth 1.10.x with minimal patching.",
        "created_at": "2021-03-25T19:04:19.581000+00:00",
        "attachments": null
    },
    {
        "author": "afdudley",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "this sort of partial witness should also have the property that it can be safely merged with another partial witness if they don't touch the same merkle leafs, am I right about this?",
        "created_at": "2021-03-25T19:05:35.477000+00:00",
        "attachments": null
    },
    {
        "author": "jason.carver",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hm, I think you'd also have to provide witnesses for all the transactions that execute before your \"transaction of interest\" in the block. Also, I don't think there is a single gold standard for trace format, which makes verifying harder, if you're on a different client than the one that generated it. But yeah, in general, partial witnesses are really straightforward.",
        "created_at": "2021-03-25T19:29:49.194000+00:00",
        "attachments": null
    }
]