[
    {
        "author": "g11tech",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Hi, I would like to get involved, I am reading through wit/0 protocol and stateless ethereum interests me a lot as a topic. kindly share some reading material so that I can be upto speed on it 🙂",
        "created_at": "2021-04-27T15:25:21.363000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think taking a look at the newly added JSON-RPC endpoints for generating access lists and the format that has been used there is a good place to start next since most clients are implementing these APIs.  These will be transaction level access lists, but extending them to be block level shouldn't be too much different.\n\nFor the EIP, we'll want a concept of a \"canonical\" access list, and then a way to reference them by a 32-byte hash of some sort (maybe using SSZ)",
        "created_at": "2021-04-27T15:29:36.141000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I have a call happening in a moment, I'll drop some more information in here later today when I have time",
        "created_at": "2021-04-27T15:29:53.048000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!792822129019584562\u003e Going to give you some *loose* homework after which you and I can schedule a call to answer questions and talk about next steps:\n\n- investigate the access list generation that clients are doing for https://eips.ethereum.org/EIPS/eip-2929 .\n- make sure you understand the current format of the block header, general concept of what access lists are, etc.\n- do some reading of other EIPs to get a sense for format and how they are written.\n- ask any questions you encounter along the way here in this channel\n- write down a rough draft explaining what needs to be done to the best of your understanding.  This helps me know where you're starting from and where there may be additional reading materials I can send your way.",
        "created_at": "2021-04-27T17:03:55.498000+00:00",
        "attachments": null
    },
    {
        "author": "g11tech",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Sounds good,  let me get to some digging 👍",
        "created_at": "2021-04-27T17:13:10.653000+00:00",
        "attachments": null
    }
]