[
    {
        "author": "g11tech",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "after due thought and going over the implemented access lists: my proposed construction: `access_list = Set[Address, List[AccessedStorageSlots] ,Set[AccessedInBlockTransactionNumber,List[AccessedStorageSlots] ] ]`. this could easily be exxtended to include witness data/proofs: `access_list=Set[Address,List[AccessedStorageSlots],List[AccessedWitnesses],Set[AccessedInBlockTransactionNumber,List[AccessedStorageSlots],List[AccessedWitness] ] ]`. There is some data denormalization here for the purposes of enabling client optimizations. For purposes of building `canonical access document` whose commitment/hash can be included in block header: `Set\u003cSortedByAddress\u003e[Address, List\u003cSorted\u003e[AccessedStorageSlots],Set\u003cSortedByTransactionNumber\u003e[AccessedInBlockTransactionNumber,List\u003cSorted\u003e[AccessedStorageSlots] ] ]` this can easily be constructed  from the transaction access_list that have been already generated(on miner side) , and furthermore, those transaction access list can be easily reconstructed from the above construction (on client side). above construction can also be used to construct a partial order (full accessed by order is not needed) on the transactions (DFS) enabling (optional and client dependent) parallel transaction computation/optimizations/sharding, and an easy index on to the transactions in the block affecting the current address (for light clients) as well as witness bundling in future. a merkel/verkel trie can be build for hashes/commitments with chunkified addresses in the leaf and the root embedded in the blockheader for \"integrity\" checks. if trie computation is too heavy, a simple hash/commitment can be used, but for distributed downloading of the access list especially when witness data is there. also an access_list_root type be included in the header to specify the hash derivation technique (which can evolve/extended over time)",
        "created_at": "2021-05-02T12:12:56.794000+00:00",
        "attachments": []
    },
    {
        "author": "g11tech",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "another advantage of having sorted list data is, potential compression can be applied \u003c\u003con a network protocol level like beam sync\u003e\u003e while data transmitting time on network, by transmitting diffs rather than full addresses (can be done on all the lists like transactions #s, slots) in a chunk. denormed data can be constructed on reception and integrity checked",
        "created_at": "2021-05-02T12:21:42.210000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!792822129019584562\u003e I think it would be good to provide this as a forum post in ethresearch forums.  That medium allows for an easier to read preliminary spec and for a broader audience to chime in on the design.  Doesn't have to be fully polished, but something that people can fully reason about and ask clarifying questions would be a great place to start.",
        "created_at": "2021-05-02T23:27:12.531000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(I'll take a look at what you've written above tomorrow during my normal work day, just wanted to drop the suggestion in here)",
        "created_at": "2021-05-02T23:27:38.599000+00:00",
        "attachments": []
    }
]