[
    {
        "author": "g11tech",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!364458974906548225\u003e  should we modify this document as per the new verkel state access tree to bring it in par to access list as defined by \u003c@!273808422753796097\u003e  in this  document?: https://notes.ethereum.org/@vbuterin/witness_gas_cost_2",
        "created_at": "2021-05-11T07:39:46.840000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm inclined to design against the current protocol, otherwise the change becomes blocked by waiting for the verkle change",
        "created_at": "2021-05-11T13:04:27.914000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This change won't be viable for London as it's very soon, but it's something that we should have a shot at getting in for the subsequent fork if we can get it polished in a timely manner.",
        "created_at": "2021-05-11T15:39:34.215000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Doesn't have to happen right away because I think it would be good to get a little bit of buy-in on one more draft spec, after which getting a draft EIP written up for this is probably the logical next step",
        "created_at": "2021-05-11T15:40:46.795000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "cc \u003c@!425615769280315392\u003e ^ access lists (for provable WIT protocol stuff for beam sync)",
        "created_at": "2021-05-11T15:41:17.423000+00:00",
        "attachments": null
    },
    {
        "author": "r.alxz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "hi all, I am working on wit/0 implementation for ethereumjs-client and i was wondering if there are any tests that would help confirm our witness collection is correct. for example a blockchain of 5-10 blocks with the witnesses of each would be really helpful to ensure our implementation is consistent, or if there is any other suggestions that would be great!",
        "created_at": "2021-05-11T19:56:49.790000+00:00",
        "attachments": null
    },
    {
        "author": "jason.carver",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Nope, I don't think there are any test cases published. It's worth noting that `wit/0` is not intended to be consensus-sensitive. ie~ it's ideal to report exactly the same hashes, but it's not critical. One straightforward way to test is by executing a block against only the state identified by the hashes in `wit/0`, and see if it completes successfully.\nIf you want to send me a witness (hashes and bodies) against a recent mainnet block, I'd be happy to check if it matches the py-evm implementation.",
        "created_at": "2021-05-11T20:31:21.634000+00:00",
        "attachments": null
    },
    {
        "author": "r.alxz",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "great thanks for the explanation, yeah having some results for mainnet blocks might be nice, I’ll let you know 🙂",
        "created_at": "2021-05-11T20:37:45.750000+00:00",
        "attachments": null
    }
]