[
    {
        "author": "ethernaut2991",
        "category": "general",
        "parent": "",
        "content": "Hello 👋 \nThis is Ale, a.k.a. \"The Ethernaut\" trying to start a journey towards becoming a protocol dev some day. Baby steps 🙂",
        "created_at": "2021-06-09T12:20:38.566000+00:00",
        "attachments": null
    },
    {
        "author": "gb429",
        "category": "general",
        "parent": "",
        "content": "I'm going through trinity code base (and when necessary related repos like lahja, py-evm,trie). I'll mainly be contributing to trinity as I am familiar with python. I wanted to know if it will be supported in the near future (i.e there are no plans to deprecate it)",
        "created_at": "2021-06-09T13:54:13.456000+00:00",
        "attachments": null
    },
    {
        "author": "milan3774",
        "category": "general",
        "parent": "",
        "content": "I'm not sure where I read it, but I think Trinity is deprecated now as well - if you check the repo on github, the last commit to `master` was on March 30, whereas previous is was under active development, committed to daily; I might be wrong though, I'm sure someone more knowledgable will reply soon",
        "created_at": "2021-06-09T14:03:31.350000+00:00",
        "attachments": null
    },
    {
        "author": "gb429",
        "category": "general",
        "parent": "",
        "content": "\u003c@!260514830006485002\u003e That is exactly why I asked this - there doesn't seem to be a lot of activity recently (specially compared to go ethereum). I'd definitely appreciate more concrete info on this (if it is indeed deprecated, I guess I'll have to start learning go....)",
        "created_at": "2021-06-09T14:06:40.026000+00:00",
        "attachments": null
    },
    {
        "author": "milan3774",
        "category": "general",
        "parent": "",
        "content": "I'm thinking the same 🙂",
        "created_at": "2021-06-09T14:07:46.235000+00:00",
        "attachments": null
    },
    {
        "author": "ethernaut2991",
        "category": "general",
        "parent": "",
        "content": "So, how does this apprenticeship program start?",
        "created_at": "2021-06-09T15:54:08.604000+00:00",
        "attachments": null
    },
    {
        "author": "mike.ferris",
        "category": "general",
        "parent": "",
        "content": "\u003c@!441484183852810240\u003e Good question, I was wondering the same recently when deciding which client to start contributing to / learning from. I wonder if \u003c@!364458974906548225\u003e can provide some clarity on the status of the Trinity client and repo? Is the lack of recent commits just a lull in development (perhaps due to a lack of devs, hence you running this program) or is it due to a change of plans for Trinity?",
        "created_at": "2021-06-09T16:05:52.209000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "When we set out creating trinity the goal was to build a lightweight client. After show spending almost three years deep in the protocol, exploring lots of different avenues for building the type of client we wanted to exist we eventually came to the conclusion that it couldn't be done on the existing network. This is where the portal network project came from. Starting back at first principles for what we wanted the client to look like and then building our the network functionalities necessarily to make that happen. Trinity is no longer going to be developed. We are  working on a separate portal client called 'trin' written in rust that will be one of the launch clients for the portal network.",
        "created_at": "2021-06-09T16:31:24.835000+00:00",
        "attachments": null
    },
    {
        "author": "gb429",
        "category": "general",
        "parent": "",
        "content": "\u003c@!364458974906548225\u003e Okay, could you provide some links that can give me an overview of what the portal network project is? Some quick googling showed me that the portal network is something akin to distributed dns -but this does not seem to be what you are talking about. And 'trin' is going to be the focus going forward? \nI am the type of person who can understand and implement EIP's, but not propose new ones (at least not with my current knowledge of ethereum). My plan was to solve some good first and second issues in an existing ethereum client, and if I was successful, I would've tried to undertake implementation of more complex features. With this goal in mind, which language do you think I should focus on? Go for contributing to go-eth or Rust for contributing to 'trin'?  (I do not know either of them, will need to learn)",
        "created_at": "2021-06-09T17:14:35.546000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "https://github.com/ethereum/stateless-ethereum-specs/blob/master/portal-network.md",
        "created_at": "2021-06-09T17:30:07.468000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "If you have any further questions, feel free to ask them in the \u003c#796057759858425866\u003e channel",
        "created_at": "2021-06-09T17:31:00.931000+00:00",
        "attachments": null
    },
    {
        "author": "delim_",
        "category": "general",
        "parent": "",
        "content": "Hello everyone, my name is Preston. I am currently a  full stack web developer, have  a year of professional experience. I am proficient in fairly proficient in Typescript, Javascript and Solidity. I am learning Go right now and play to possible delve into rust later on. I am extremely interested in Ethereum development. One area of Ethereum that i would like to further develop is the ERC721 standard. With NFTs exploding in popularity this year, I think that more use-cases will arise which will demand for further development of this standard. I look forward to possibly working with everyone!",
        "created_at": "2021-06-09T17:48:03.197000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "we'll be sending out messaging related to that soon. thanks for your patience!",
        "created_at": "2021-06-09T18:21:38.083000+00:00",
        "attachments": null
    },
    {
        "author": "rodzilla0621",
        "category": "general",
        "parent": "",
        "content": "An interesting concept for poof of stake, where stalkers receive private discord invites and access to channels based on their participation. \nGot the idea from another Hackathon Lecture. What do you all think?",
        "created_at": "2021-06-09T20:38:32.658000+00:00",
        "attachments": null
    }
]