[
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "There was link today in the \u003c#595701319793377299\u003e call that reminded me of this post. When you first posted here I looked seriously into this and it seemed straightforward how to write a codec to translate to DAG-CBOR. I was interested cause I have my own ssz prototype library to test, and eth2 types are manageable and small, looking for a reasonable p2p way (even bittorrent would do) to distribute it is fine since they are finalized anyway.  But then later I found out a ton of dead projects that had claimed to do this. Or to be in the process of doing this, like this one and the projects linked there \u003chttps://github.com/ipfs/go-ipld-eth-import\u003e. Is there any deeper problem that I'm not seeing here in the surface? Perhaps something with the protocol itself? I don't think of this as an option to the portal network, rather like a \"convenience\" service to have a faster way to download a close state to start syncing",
        "created_at": "2021-11-12T00:37:33.121000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "Cc \u003c@111498782201421824\u003e 👆",
        "created_at": "2021-11-12T00:57:15.275000+00:00",
        "attachments": []
    },
    {
        "author": "nasdf",
        "category": "general",
        "parent": "",
        "content": "I haven't hit any roadblocks with the IPLD codecs yet.  I think the dead projects are due to how fast things are changing.  \nIPLD had a complete redesign recently to make it more efficient for the Filecoin network and also in anticipation of the Filecoin Virtual Machine.  \nI also think previous projects were missing a good architecture and design, like we have now with the Portal Network specs.",
        "created_at": "2021-11-12T01:30:40.805000+00:00",
        "attachments": []
    },
    {
        "author": ".iphie",
        "category": "general",
        "parent": "",
        "content": "Hello everyone, I just found out about the apprenticeship program today and would want to be part of the next cohort, please when will the application for the next cohort commence? Thanks",
        "created_at": "2021-11-12T11:33:53.462000+00:00",
        "attachments": []
    },
    {
        "author": "muddlebee",
        "category": "general",
        "parent": "",
        "content": "\u003c@416542738545377290\u003e check the thread for more context 🚀",
        "created_at": "2021-11-12T11:40:53.851000+00:00",
        "attachments": []
    },
    {
        "author": ".iphie",
        "category": "general",
        "parent": "",
        "content": "Thank you, will do.",
        "created_at": "2021-11-12T11:41:23.197000+00:00",
        "attachments": []
    }
]