[
    {
        "author": "steegecs",
        "category": "general",
        "parent": "",
        "content": "Hello everyone. I am Chris. Grateful for the opportunity to be considered for this program. I recently graduated with a graduate degree focused on analytics and data science. Very interested in scaling Ethereum using sharding and optimistic roll-ups. In general, I am also super fascinated in incentive structures and mechanisms for decentralized consensus. Excited to help in whatever way i can.",
        "created_at": "2021-06-04T00:08:29.472000+00:00",
        "attachments": null
    },
    {
        "author": "defipunk",
        "category": "general",
        "parent": "",
        "content": "Only semi-related, but\n(a) How expensive is it to scan for SLOADs for new TX vs simply executing them? My gut feeling would be that unless there is a \"static\" flag on the TX, there is no way to figure this out without executing the TX itself?\n(b) As an alternative:  I haven't looked at Solana in all that much detail, but afaik they use an optimistic concurrency approach to parallelize their TX execution. I think it's an interesting idea, but having seen the effects of large launches, I wonder if specifically crafting collisions isn't a huge attack vector for them?",
        "created_at": "2021-06-04T05:21:36.014000+00:00",
        "attachments": null
    },
    {
        "author": "defipunk",
        "category": "general",
        "parent": "",
        "content": "My original thesis was on using lattice-boltzmann methods for fluid flow simulations and optimizations of the HPC implementation",
        "created_at": "2021-06-04T05:23:26.060000+00:00",
        "attachments": null
    },
    {
        "author": "defipunk",
        "category": "general",
        "parent": "",
        "content": "As a follow-up, seeing all the mathematicians in here: while I don't have much experience in cryptography, I did get a bachelor/master in Math in addition to my CompSci one 😉",
        "created_at": "2021-06-04T05:24:47.052000+00:00",
        "attachments": null
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "I thought a bit more about that after your last post.\nThe problem is that most transactions are non static.\nIf you code in solidity you know that there are three classes of functions: public, view and pure. \nOnly pure functions can be parallelized (and view that only look at the block parameters).\nPure functions can be called without sending a transaction on your local node though, which means there are almost no static transactions out there.",
        "created_at": "2021-06-04T06:06:09.422000+00:00",
        "attachments": null
    },
    {
        "author": "joshuaisbuilding",
        "category": "general",
        "parent": "",
        "content": "Thinking about this, it might be worth looking into POAPs for serious participants both funded and not. It’ll likely increase motivation and overall value gained.",
        "created_at": "2021-06-04T10:01:20.280000+00:00",
        "attachments": null
    },
    {
        "author": "mohamed.mansour",
        "category": "general",
        "parent": "",
        "content": "Pretty cool, congrats on the turn out! I like the partner idea. At Microsoft we have this concept of \"Explorer Interns\" Around 4 interns work together on a project, end to end. They rotate roles to learn more, maybe something like that could be applied here. Like a small team trying to solve something technical, or even multiple of smaller teams!",
        "created_at": "2021-06-04T10:02:23.178000+00:00",
        "attachments": null
    },
    {
        "author": "bends3537",
        "category": "general",
        "parent": "",
        "content": "Hi all. Ben here. I'm currently an epidemiologist at the state level in the US.  I mostly work in data science/management role.  I've recently gone down the crypto rabbit hole and am completely sold. Looking forward to learning with you all!",
        "created_at": "2021-06-04T10:21:41.320000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "love this idea!",
        "created_at": "2021-06-04T13:41:21.086000+00:00",
        "attachments": null
    },
    {
        "author": "void.xyz",
        "category": "general",
        "parent": "",
        "content": "How has your deep dive experience been? I've been on a similar route myself",
        "created_at": "2021-06-04T17:28:11.009000+00:00",
        "attachments": null
    },
    {
        "author": "derimagia",
        "category": "general",
        "parent": "",
        "content": "So far so good. General preamble stuff can get a bit dry of course but that was totally expected. How about you?",
        "created_at": "2021-06-04T19:06:55.668000+00:00",
        "attachments": null
    },
    {
        "author": "void.xyz",
        "category": "general",
        "parent": "",
        "content": "Every time I find an answer to a question I have about blockchain, I end up having even more questions 😛",
        "created_at": "2021-06-04T19:46:45.369000+00:00",
        "attachments": null
    },
    {
        "author": "void.xyz",
        "category": "general",
        "parent": "",
        "content": "I have about 50 tabs open right now just dedicated to different areas of blockchain research",
        "created_at": "2021-06-04T19:47:07.846000+00:00",
        "attachments": null
    },
    {
        "author": "void.xyz",
        "category": "general",
        "parent": "",
        "content": "I love this idea of POAP! Also (going on a tangent here), the application of POAPs are quite large if you were to generalize them. For example, one could create an incentive for students to show up to class by creating a POAP and having students redeem it at the end of class. The reward can be any token, really. But at the heart of POAPs is creating incentives for some particular outcome, and those outcomes are verified",
        "created_at": "2021-06-04T19:49:44.547000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "i think the simplest version of this is just a POAP for submitting a project at the end",
        "created_at": "2021-06-04T19:54:11.772000+00:00",
        "attachments": null
    },
    {
        "author": "kevin.is.human",
        "category": "general",
        "parent": "",
        "content": "Hi everyone, I'm Kevin, Growth Marketer from Canada with a background in physics and molecular biology. My previous job was as distribution lead at Goalcast where we made organic viral self-dev content and built a community of over 30 million people. I'm fascinated by this technology and can't seem to stop myself from falling deeper into the rabbit hole. Looking forward to contribute, learn and grow with you all, let's change the world!",
        "created_at": "2021-06-04T20:45:47.071000+00:00",
        "attachments": null
    }
]