[
    {
        "author": "swcbbs3087",
        "category": "general",
        "parent": "",
        "content": "how many people can be on team",
        "created_at": "2021-05-20T00:39:47.667000+00:00",
        "attachments": []
    },
    {
        "author": "dock_boss",
        "category": "general",
        "parent": "",
        "content": "2",
        "created_at": "2021-05-20T01:09:23.833000+00:00",
        "attachments": []
    },
    {
        "author": "ladyleatherman",
        "category": "general",
        "parent": "",
        "content": "Hey folx, Sent my app in on the 14th, interested in seeing what I can learn!",
        "created_at": "2021-05-20T01:38:33.249000+00:00",
        "attachments": []
    },
    {
        "author": "jarviseasy1152",
        "category": "general",
        "parent": "",
        "content": "Thank you. I get the map of topics discussed in the community.",
        "created_at": "2021-05-20T03:08:24.545000+00:00",
        "attachments": []
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "Let's imagine that a large portion of people here are keen on learning about the application layer. Would you think it makes more sense to just keep the core dev apprenticeship program tightly bound to the original scope, or to also funnel it with a wider ecosystem apprenticeship call-to-arms?",
        "created_at": "2021-05-20T03:17:32.445000+00:00",
        "attachments": []
    },
    {
        "author": "3xmd1559sporebraytondingo",
        "category": "general",
        "parent": "",
        "content": "e.g. there are firms looking for solidity devs, and there are people on the verge of becoming solidity devs. The scope of the apprenticeship program isn't to work on applications. Are those applicants pointed elsewhere, and if so should we start organising a good elsewhere?",
        "created_at": "2021-05-20T03:18:52.784000+00:00",
        "attachments": []
    },
    {
        "author": "owleksiyowpckcr",
        "category": "general",
        "parent": "",
        "content": "dumb question: what's the reason the gas is charged for code execution? I get the reason to charge gas for accessing state, but why charge for instructions executed? CPU/memory cost of actually executing transactions has to be negligible compared to PoW, and we only do \u003c20 TPS",
        "created_at": "2021-05-20T03:30:30.853000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "PoW only has to be generated by one person in the world per block, and it can be parallelized very easily.  Block execution has to be done by *everyone* who runs an Ethereum client (which ideally would be everyone who uses Ethereum).",
        "created_at": "2021-05-20T03:38:17.076000+00:00",
        "attachments": []
    },
    {
        "author": "owleksiyowpckcr",
        "category": "general",
        "parent": "",
        "content": "fair point, but with so few TPS (and no plans to really increase TPS per node) CPU/memory/stack-only operations don't seem to be a big deal. full nodes already require substantial amount of CPU/memory, and it is most likely already dominated by internal node state management\n\nI guess another argument would be that we still want to cap the run time of each transaction, and charging gas per instruction executed makes sense. this brings another question: why different non-state-management instructions have different costs. (and another question is: is there **another** way of capping the run time? perhaps not)",
        "created_at": "2021-05-20T04:25:12.523000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "We have to consider user experience as well.  In a perfect world, we would have separate costs for network utilization, CPU usage, and storage.  However, users struggle enough already with a single fee type, adding 2 more will make it incredibly difficult for users to understand.",
        "created_at": "2021-05-20T04:35:52.886000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Maybe if EIP-1559 goes over well we can make it so storage is fully charged with a basefee like mechanic, and leave network, CPU, and disk access bundled (since they are things that impact miner profitability).",
        "created_at": "2021-05-20T04:37:25.858000+00:00",
        "attachments": []
    },
    {
        "author": "owleksiyowpckcr",
        "category": "general",
        "parent": "",
        "content": "that's precisely my argument: why not roll all non-storage related opcodes into a single category and give all of them a fixed price (maybe even 0, but that will need another change)? as of now, I see all non-storage related opcodes having **different** gas gost",
        "created_at": "2021-05-20T04:37:55.773000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "And perhaps if some sort of stateless transactions are introduced we can further adjust.",
        "created_at": "2021-05-20T04:38:01.051000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Their cost is very much not 0.  If the cost of any operation is 0, I can take down the network.",
        "created_at": "2021-05-20T04:38:29.339000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "This is what we are currently planned. Some non zero amount of the applicants either misunderstood the intent of the program or potentially will be better served by learning the application layer first. We'll be looking for how to point those people in a useful/actionable direction.",
        "created_at": "2021-05-20T04:42:10.307000+00:00",
        "attachments": []
    },
    {
        "author": "owleksiyowpckcr",
        "category": "general",
        "parent": "",
        "content": "there are 2 point I'm trying to make\n1: what happens if we set gas price for all non-state related opcodes to 1?",
        "created_at": "2021-05-20T04:42:40.798000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "Someone may answer but I would encourage you to go look for yourself",
        "created_at": "2021-05-20T04:43:28.767000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "You seem to have some strong opinions but are missing the base knowledge to really have an informed opinion. Going and doing the hard part of really understanding the evm and gas mechanics will be worth it",
        "created_at": "2021-05-20T04:46:08.032000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "The way to think about all such problems is to ask yourself, \"how could I attack the network if X changed\".",
        "created_at": "2021-05-20T04:46:13.711000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Or in some cases, \"how can I attack the network right now\" (like in the pre-Berlin situation).",
        "created_at": "2021-05-20T04:46:40.758000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "general",
        "parent": "",
        "content": "Every change to Ethereum has to take that line of questioning very seriously.  It is trivial to build a system that isn't resilient to attack.  Building it so it is resilient to motivated and well funded attackers is the really hard part.",
        "created_at": "2021-05-20T04:47:34.271000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "This question is also testable. You could go fork a client and modify the evm gas rules....",
        "created_at": "2021-05-20T04:48:27.749000+00:00",
        "attachments": []
    },
    {
        "author": "owleksiyowpckcr",
        "category": "general",
        "parent": "",
        "content": "\u003e Every change to Ethereum has to take that line of questioning very seriously.  It is trivial to build a system that isn't resilient to attack.  Building it so it is resilient to motivated and well funded attackers is the really hard part.\nI get that. I'm sure something bad could be exposed in this scenario, but would appreciate help/ideas in seeing what precisely. my assumption is that the node CPU time is dominated by state management. cpu-only part of contracts with \u003c100TPS should be negligible.",
        "created_at": "2021-05-20T04:52:44.193000+00:00",
        "attachments": []
    },
    {
        "author": "owleksiyowpckcr",
        "category": "general",
        "parent": "",
        "content": "\u003e You seem to have some strong opinions but are missing the base knowledge to really have an informed opinion\nthat's why I'm asking questions and starting a discussion. I know I don't know everything, but what I've read so far creates more questions than answers. the yellow paper, for example, doesn't explain the rationale behind having Wlow/Whigh/Wmid",
        "created_at": "2021-05-20T04:54:24.692000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "You've identified an assumption underlying your whole theory, so focus on trying to break that assumption. You can do it theoretically but Piper's suggestion of actually adjusting a client is a good one, then you can write actual transactions to try and attack your modified node and see the real result.",
        "created_at": "2021-05-20T04:57:33.487000+00:00",
        "attachments": []
    },
    {
        "author": "ajsutton",
        "category": "general",
        "parent": "",
        "content": "I don't know geth's code but in Besu the place to start for that is the `GasCalculator` class: https://github.com/hyperledger/besu/blob/3267501c8cd2a1cd116b8b295e5baedab12bd3b5/ethereum/core/src/main/java/org/hyperledger/besu/ethereum/vm/GasCalculator.java#L57",
        "created_at": "2021-05-20T04:59:23.131000+00:00",
        "attachments": []
    },
    {
        "author": "owleksiyowpckcr",
        "category": "general",
        "parent": "",
        "content": "thank you!",
        "created_at": "2021-05-20T05:00:03.672000+00:00",
        "attachments": []
    },
    {
        "author": "p1ge0nh8er",
        "category": "general",
        "parent": "",
        "content": "\u003c@364458974906548225\u003e is there a provision for those who aren't selected and are ok to work without funding?",
        "created_at": "2021-05-20T07:25:36.144000+00:00",
        "attachments": []
    },
    {
        "author": "jarviseasy1152",
        "category": "general",
        "parent": "",
        "content": "\u003c@!364458974906548225\u003e I have the same problem.",
        "created_at": "2021-05-20T07:36:36.728000+00:00",
        "attachments": []
    },
    {
        "author": "joshuaisbuilding",
        "category": "general",
        "parent": "",
        "content": "https://discord.com/channels/595666850260713488/843176491386667018/844343849728213022",
        "created_at": "2021-05-20T11:29:37.570000+00:00",
        "attachments": []
    },
    {
        "author": "p1ge0nh8er",
        "category": "general",
        "parent": "",
        "content": "right, thanks",
        "created_at": "2021-05-20T12:10:02.534000+00:00",
        "attachments": []
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "is there a limit?",
        "created_at": "2021-05-20T14:00:43.568000+00:00",
        "attachments": []
    },
    {
        "author": "jarviseasy1152",
        "category": "general",
        "parent": "",
        "content": "https://discord.com/channels/595666850260713488/843176491386667018/844343849728213022 Probably six persons in the first cohort.",
        "created_at": "2021-05-20T14:34:05.855000+00:00",
        "attachments": []
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "that refers to something else. i interpreted teams from \u003c@!835294709412659211\u003e to be people that you partner with to learn from",
        "created_at": "2021-05-20T14:35:19.923000+00:00",
        "attachments": []
    },
    {
        "author": "klu93",
        "category": "general",
        "parent": "",
        "content": "Hey all, just sent in an app. Data engineer balancing work with masters in cs. I've started contributing to a few projects in the ETH ecosystem, which has helped me pick up Rust and Go, but balancing everything has been exhausting. Hoping to get accepted so I can fully dedicate my time to Ethereum!",
        "created_at": "2021-05-20T14:41:03.578000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "That's my interpretation as well. Two is going to be the default. I'm hesitant to do solo because being \"alone\" on a problem sucks. I'm hesitant to do more than two because I want to keep things simple and have easy 1:1 peer accountability.\n\nBut there are almost always situations where the \"rules\" don't make sense when it comes to squishy human stuff, so if you think you have a compelling reason to be a 1-person team or an \u003e2-person team I am willing to have that conversation",
        "created_at": "2021-05-20T14:48:49.761000+00:00",
        "attachments": []
    },
    {
        "author": "klu93",
        "category": "general",
        "parent": "",
        "content": "so if im interpreting this right, there might be a second cohort with a larger number of people if the pilot goes well? would there maybe be like a rolling system where if you were a strong candidate that didn't make the cut in what seems to be a highly competitive first cohort application round, can be reconsidered for the next cohort?",
        "created_at": "2021-05-20T16:08:05.154000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "Yes, assuming things go well, the goal is to evolve this into a rolling thing where new cohorts start while previous cohorts are still active. Each cohort improves the documentation and onboarding material. Goal is to build a smooth on ramp for learning about and contributing to the protocol. Applicants from previous cohorts will be considered for future cohorts so everyone here who has applied  will be in the pool of candidates for the second cohort (cohort-one).",
        "created_at": "2021-05-20T16:11:59.282000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "This is great, thanks for sharing! \u003c@456226577798135808\u003e under \"Benefits\", you are missing a few:\n1. Have an up-to-date, canonical specification for the Ethereum protocol. The Yellowpaper lags behind the most recent hard forks, so the \"spec\" today is \"YP + EIPs from hard forks not yet included in YP\"\n2. Post-merge (or when the merge is being spec'ed) having a harmonized Ethereum spec (eth2.0-specs + this new eth1 spec) would reduce confusion by a lot. \n3. Automatically generate tests from the new eth1 spec. Current tests for Eth1 are here: https://github.com/ethereum/tests/",
        "created_at": "2021-05-20T16:15:08.111000+00:00",
        "attachments": []
    },
    {
        "author": "benbot",
        "category": "general",
        "parent": "",
        "content": "Hey everyone! Applied a couple days ago. I'm Ben, I'm a devops guy/game dev.\n\nExcited to meet all of you see what makes ethereum tick!",
        "created_at": "2021-05-20T16:16:18.999000+00:00",
        "attachments": []
    },
    {
        "author": "klu93",
        "category": "general",
        "parent": "",
        "content": "yea that sounds really promising. so cool that this is happening",
        "created_at": "2021-05-20T16:20:47.145000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "To pile on. This is a high value project that will definitely need someone knowledgeable to steer/lead but it also has a ton of opportunities for small contributions and collaboration and if executed well, should have a significant impact on the accessibility/ease of onboarding people to the protocol",
        "created_at": "2021-05-20T16:24:11.686000+00:00",
        "attachments": []
    },
    {
        "author": "zc4str0",
        "category": "general",
        "parent": "",
        "content": "Hello! I'm a young programmer student from Brazil. I am a very curious person always learning something on internet and currently I'm very interested on Ethereum, dapps and blockchains. I still struggle to understand many many things and I wonder if any of you could share some good sources of information so I can study more. I currently stuggle to understand many things about this technology and the challenges to be wide-spread used, also I struggle to understand how can I create an app in order to help people from my country to have access to better services with cheaper price",
        "created_at": "2021-05-20T16:24:20.952000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Seja Bem-vindo! I'm not sure if it's the right place to ask for app-related literature. However, in the github pinned in this channel you find some suggested readings\nhttps://github.com/ethereum-cdap/cohort-zero/blob/main/stage-0-getting-started.md\nsome, like the yellow paper and the hexary trie description are great, the others will require you to browse and decide what you want to read and it may be difficult among all the noise. As for dapp-related literature, I'd suggest perhaps asking in a different server, perhaps https://discord.gg/CZxgjrFx",
        "created_at": "2021-05-20T16:41:12.940000+00:00",
        "attachments": []
    },
    {
        "author": "zc4str0",
        "category": "general",
        "parent": "",
        "content": "Thank you very much! I'm on CryptoDevs now so I will continue my studies there.",
        "created_at": "2021-05-20T16:42:50.878000+00:00",
        "attachments": []
    },
    {
        "author": "miloops.",
        "category": "general",
        "parent": "",
        "content": "Hello everyone! I applied today and I was encourage to introduce myself here. I have 20 years of experience in software development but I'm pretty new to blockchain development, I participated in Chainlink and Scaling Ethereum Hackathons recently winning prizes in both. My experience is mostly on Ruby (I was Ruby on Rails core committer so I have good amount of experience in Open Source Software) and Python. I co-founded a startup which was acquired by another company (Eventbrite) so after +13 years between those I quit my job last November to spent more time travelling and get into blockchain development. I'm from Argentina but moved to the Spanish Pyrenees a few months ago.",
        "created_at": "2021-05-20T19:44:55.512000+00:00",
        "attachments": []
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "\u003c@!759053369616236595\u003e welcome 🙂",
        "created_at": "2021-05-20T20:00:20.735000+00:00",
        "attachments": []
    },
    {
        "author": "owleksiyowpckcr",
        "category": "general",
        "parent": "",
        "content": "continuing on this thread\nusing this as a quick and dirty benchmark (it has flaws, but bear with me)\n```    function warm_me_up(\n        uint iterations\n    )\n        external\n        view\n        returns (uint256)\n    {\n        uint256 ret;\n        for (uint i = 0; i \u003c iterations; i += 1) {\n            ret += i;\n            ret *= i;\n            ret |= (i);\n            ret = addmod(ret, i, 0xffffffffffffffffff);\n            ret = mulmod(ret, i, 0xffffffffffffffffff);\n        }\n        return ret;\n    }\n```\nwith stock client, and  I can do ~50k iterations in ~150ms (this is obviously hw dependant) with entire block's worth of gas (15M)\n\nwith  W{base,verylow,low,mid,high} reduced to 1, I can do ~160k iterations (this is not important) in ~550ms (this is important). **I can use up entire block's gas with cpu-only operations in only 0.5s. **. With blocks generated every 10s this doesn't seem too big of a deal?\n\nI'm not saying eth will become better if we charge almost nothing for all CPU-only opcodes, only trying to understand the rationale behind different costs of CPU-only operations (in a world where real CPU utilization seems to be coming from other sources like state management).",
        "created_at": "2021-05-20T20:08:50.071000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "It sounds like you are simply arguing that the gas limit should be increased. This doesn't seem to have any bearing on the actual individual gas costs of different operations.",
        "created_at": "2021-05-20T20:31:01.311000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "You say you want to understand the different cost of different operations. Why do you think they are priced differently?",
        "created_at": "2021-05-20T20:32:47.577000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "The argument seems to be \"we can do a bunch of cpu bound operations quickly... Therefore CPU  operations should all be priced the same.\" or maybe \"therefore expensively priced CPU operations should be cheaper\".",
        "created_at": "2021-05-20T20:41:30.981000+00:00",
        "attachments": []
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "glad to have you here! \n\nbtw, there is a large argentinian contingent in Ethereum - I'd be happy to introduce you to them if you'd like",
        "created_at": "2021-05-20T21:08:13.061000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "\u003c@!824149853612539914\u003e if you want to continue this discussion, lets do it in the \u003c#706868829900505180\u003e channel to clear this one up for things related to the program.",
        "created_at": "2021-05-20T21:12:28.272000+00:00",
        "attachments": []
    },
    {
        "author": "miloops.",
        "category": "general",
        "parent": "",
        "content": "thanks! I would love to",
        "created_at": "2021-05-20T21:12:37.758000+00:00",
        "attachments": []
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "\u003c@!411952680244740096\u003e \u003c@!435647410283479050\u003e ☝️\n\n(they are busy folks, but I'm sure will reach out in the next few days 🙂)",
        "created_at": "2021-05-20T21:13:19.864000+00:00",
        "attachments": []
    },
    {
        "author": "nanexcool",
        "category": "general",
        "parent": "",
        "content": "Hola \u003c@759053369616236595\u003e ! Feel free to send a DM anytime",
        "created_at": "2021-05-20T21:23:27.810000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "🙋‍♂️  another Argentinean here",
        "created_at": "2021-05-20T21:39:58.432000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Also living outside since 2002",
        "created_at": "2021-05-20T21:40:30.522000+00:00",
        "attachments": []
    },
    {
        "author": "astoneta.eth",
        "category": "general",
        "parent": "",
        "content": "argentinian here 👋",
        "created_at": "2021-05-20T21:40:38.147000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Oh I only just now realized the River Plate avatar",
        "created_at": "2021-05-20T23:03:06.981000+00:00",
        "attachments": []
    }
]