[
    {
        "author": "tsuigeo",
        "category": "general",
        "parent": "",
        "content": "Hey guys im reading up on the concept of MEV and just wondering out loud a bit if anyone who knows topic  can chime in. Is this still an active area of research and are there any specific open issues we in cdap can start looking into or start contributing? With the latest london fork does that mark any dramatic consequence for MEV (wrt tx fees being burned rather than awarded to the miner) and if so does it make it more or less of a problem?",
        "created_at": "2021-09-19T13:38:35.913000+00:00",
        "attachments": null
    },
    {
        "author": "oba6601",
        "category": "general",
        "parent": "",
        "content": "join Flashbots discord: https://discord.gg/Pa5WUQnv",
        "created_at": "2021-09-19T15:06:54.094000+00:00",
        "attachments": null
    },
    {
        "author": "jordan_br",
        "category": "general",
        "parent": "",
        "content": "Hey man, that’s an area that I’m really interested in as well! I saw this awesome post the other day  (https://ethresear.ch/t/targeting-zero-mev-a-content-layer-solution/9224/26) which discusses introducing a content later to remove hidden centralisation coming from the miners. Would be happy to team up on an MEV project, perhaps building off of this research if it’s something you’re interested in. There’s also a couple more MEV resources I’ve got in my notes on the repo (jordanbrannan.md)",
        "created_at": "2021-09-19T18:29:43.661000+00:00",
        "attachments": null
    },
    {
        "author": "blockdev",
        "category": "general",
        "parent": "",
        "content": "I am reading up resources like https://medium.com/@VitalikButerin/zk-snarks-under-the-hood-b33151a013f6 and https://vitalik.ca/general/2021/01/05/rollup.html. Any way to get involved in these areas for the apprenticeship-program? cc \u003c@!364458974906548225\u003e if you have info on this.",
        "created_at": "2021-09-19T22:05:31.775000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "\u003c@!835519759545401344\u003e there are most certainly ways to get involved.  I would recommend aggregating a list of projects that are currently working on rollup based solutions, learning about what they are doing, and looking for ways that you can contribute.  If you don't already know how the technology of rollups work you should do that homework first.",
        "created_at": "2021-09-19T23:23:42.543000+00:00",
        "attachments": null
    }
]