[
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "https://www.dappuniversity.com/articles/solidity",
        "created_at": "2021-06-03T00:36:04.246000+00:00",
        "attachments": null
    },
    {
        "author": "rodzilla0621",
        "category": "general",
        "parent": "",
        "content": "Hello Everyone, my name is Rodney. I'm a software engineer student from South Africa wrapping up my masters of information systems\nI specialize in SQL database, Solidity and Python but i can read a lot of other code like Java and HTML \nI've been in the crypto space since 2017 and more technical since 2020 and I love every moment of it!!\n\nI have attended some hackathon and boot camps sponsored by USC and Binance so if you need some resource or just want to chat, shot me a message or reply to this\nHope to engage with you all through this journey😀",
        "created_at": "2021-06-03T00:40:42.413000+00:00",
        "attachments": null
    },
    {
        "author": "aga7hokakological",
        "category": "general",
        "parent": "",
        "content": "Hello guys I am Saurabh, I am doing my BE in information technology and I am in my last year. I can code in rust and python. I know other languages such as javascript, cpp, go. Right now exploring blockchain technology and that’s why I joind this program. I can code smart contracts in solidity also. After reading whitepaper I can see a lot of understanding is required and I am deeply exploring all the topics related to blockchain and ethereum. Hope to learn more from here",
        "created_at": "2021-06-03T05:56:40.962000+00:00",
        "attachments": null
    },
    {
        "author": "simon.w.ho",
        "category": "general",
        "parent": "",
        "content": "Hi, I’m symon, who is an ethereum developer working on a few projects of wasm framework.",
        "created_at": "2021-06-03T06:30:42.796000+00:00",
        "attachments": null
    },
    {
        "author": "simon.w.ho",
        "category": "general",
        "parent": "",
        "content": "I wonder if there is any plan to propose any phase2 ewasm specification for eth2 specs repo. Is the ewasm still the execution layer of eth2 in phase 2 as there is not much progress in the ewasm presentation.",
        "created_at": "2021-06-03T06:30:55.887000+00:00",
        "attachments": null
    },
    {
        "author": "kipit",
        "category": "general",
        "parent": "",
        "content": "Hello everyone, nice to meet you all !\nI'm Alex, a French computer science student deeply interested in Ethereum ecosystem. I will follow the program whether I'm officially selected or not, so I'll see you around 🙂",
        "created_at": "2021-06-03T09:51:25.816000+00:00",
        "attachments": null
    },
    {
        "author": "matthieubesancon",
        "category": "general",
        "parent": "",
        "content": "Hello everyone, same here, a French coder deeply interested in the ecosystem looking to learning more with you guys! Happy to talk there 🙂",
        "created_at": "2021-06-03T09:53:43.458000+00:00",
        "attachments": null
    },
    {
        "author": "greg_vardy",
        "category": "general",
        "parent": "",
        "content": "Check out Fizzy; https://github.com/wasmx/fizzy",
        "created_at": "2021-06-03T12:01:44.358000+00:00",
        "attachments": null
    },
    {
        "author": "grobmeier",
        "category": "general",
        "parent": "",
        "content": "今日は！私はクリスタンです。コンピュータープログラマーです。ヅイツじんです。日本語を勉強します。See you around Jarvis! 🙂",
        "created_at": "2021-06-03T12:53:57.025000+00:00",
        "attachments": null
    },
    {
        "author": "flexioai",
        "category": "general",
        "parent": "",
        "content": "Hello everyone 🙂 Here Alessio, I'm a first year grad student in a computational sciences master (focusing on cryptography and data analysis) in Italy. Nice to meet you all",
        "created_at": "2021-06-03T15:23:23.376000+00:00",
        "attachments": null
    },
    {
        "author": "partyman42069",
        "category": "general",
        "parent": "",
        "content": "Hi everyone! My last job was a Director of Engineering at a cloud based telephony company (so lots of great real time communications/async/state problems to solve). I am a full stack engineer, but am more focused on the front-end side of things. I missed the official cohort, but I am looking to be able to contribute and make an impact, so I will be following along with everyone throughout the process. I am super pumped to help and it is so great to meet everyone!",
        "created_at": "2021-06-03T16:29:26.273000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Hi, I'm Pedro. I'm a data scientist and python developer working in the IoT field.",
        "created_at": "2021-06-03T19:54:27.253000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I'm Portuguese but I'm working in the Netherlands.",
        "created_at": "2021-06-03T19:55:13.153000+00:00",
        "attachments": null
    },
    {
        "author": "makemake",
        "category": "general",
        "parent": "",
        "content": "Hi all! Im Vukasin, and i am currently a high school student. Ive been interested in ethereum since 2017, but i couldnt really get into it untill now.  My hope is that i can contribute to the core protocol and improve ethereum in any way i can.",
        "created_at": "2021-06-03T20:01:53.351000+00:00",
        "attachments": null
    },
    {
        "author": "thogz",
        "category": "general",
        "parent": "",
        "content": "Im assuming it is unfortunately too late to join, isnt it? ;/",
        "created_at": "2021-06-03T20:54:23.769000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "\u003c@!648600430426849289\u003e we are no longer accepting applications, so that route of being funded for the program is closed, but the program is open and permissionless with no barries to participation, take a look at the `cohort-zero` repository (pinned in this channel) for more information.",
        "created_at": "2021-06-03T20:55:14.743000+00:00",
        "attachments": null
    },
    {
        "author": "derimagia",
        "category": "general",
        "parent": "",
        "content": "Good timing for me - I was actually just started a deep dive this week so this program is pretty valuable. Briefly saw the program yesterday and was bummed about the timing but I didn't know it was open like that so this is perfect.",
        "created_at": "2021-06-03T22:21:33.475000+00:00",
        "attachments": null
    }
]