[
    {
        "author": "markoinether",
        "category": "general",
        "parent": "",
        "content": "Could not have said it better! the same here, stoked to work with people with the etherum values and work on interesting problems, MEV, perhaps other as well",
        "created_at": "2021-09-15T01:47:20.560000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "general",
        "parent": "",
        "content": "Hi ! Is the call still on for today ?",
        "created_at": "2021-09-15T03:28:01.582000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "general",
        "parent": "",
        "content": "Well. I will try again @ 930 mst Wednesday. Looking forward to see you.",
        "created_at": "2021-09-15T03:42:45.743000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "The call  is in 24 hours and 36 hours I believe",
        "created_at": "2021-09-15T03:43:55.050000+00:00",
        "attachments": []
    },
    {
        "author": "maxmuxx",
        "category": "general",
        "parent": "",
        "content": "Hello! Applied for the CDAP program as well, good to meet you all. Excited to see if I make it and hopefully start collaborating and contributing soon 🙂",
        "created_at": "2021-09-15T03:46:40.386000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "general",
        "parent": "",
        "content": "Good luck !",
        "created_at": "2021-09-15T03:51:37.541000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "general",
        "parent": "",
        "content": "I got Tuesday mst 2130 and Wednesday 930. Anyway Ty",
        "created_at": "2021-09-15T03:53:37.283000+00:00",
        "attachments": []
    },
    {
        "author": "0xashuz",
        "category": "general",
        "parent": "",
        "content": "Hi everyone, I also applied for Cohort One. Now I'm an independent developer. I've ever participated in building several useful products that have helped millions of people, but none of them can have more global impaction than Ethereum. I'm every excited to be here to learn how to contribute to development of the core protocols.",
        "created_at": "2021-09-15T04:28:34.410000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "general",
        "parent": "",
        "content": "Good Luck !",
        "created_at": "2021-09-15T04:29:01.566000+00:00",
        "attachments": []
    },
    {
        "author": "0xashuz",
        "category": "general",
        "parent": "",
        "content": "😆",
        "created_at": "2021-09-15T04:31:17.655000+00:00",
        "attachments": []
    },
    {
        "author": "k_xo.",
        "category": "general",
        "parent": "",
        "content": "hi everyone, applied for the CDAP program as well, excited to be part of the community, and learn and collaborate with all of you hopefully as well ^_^",
        "created_at": "2021-09-15T05:33:29.841000+00:00",
        "attachments": []
    },
    {
        "author": "tsuigeo",
        "category": "general",
        "parent": "",
        "content": "Heyo! Geoffrey here saying hi from manila philippines. I spent about 10 years working as an fx algo trader at an investment bank but looking to transition to a career in crypto so decided to apply for the cdap program to level up. Looking forward to meeting and learning from you all!",
        "created_at": "2021-09-15T05:39:27.979000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "general",
        "parent": "",
        "content": "Good luck Guys !",
        "created_at": "2021-09-15T05:41:33.467000+00:00",
        "attachments": []
    },
    {
        "author": "hmrtn",
        "category": "general",
        "parent": "",
        "content": "Hi all — I’m a developer in Seattle currently working at Gitcoin’s Moonshot Collective. Really excited to apply to the cohort. My goal is to learn, collaborate, and contribute in any way!",
        "created_at": "2021-09-15T06:13:07.415000+00:00",
        "attachments": []
    },
    {
        "author": "arome_",
        "category": "general",
        "parent": "",
        "content": "Hello everyone, my name is Abraham Onoja. I'm a software developer from Nigeria, currently navigating between backend development for my company flagship product and Blockchain development for a new project. Really excited to be part of this awesome community. I applied for the CDAP and I'm hoping I get in, to learn and contribute to the growth of Ethereum.",
        "created_at": "2021-09-15T06:29:11.718000+00:00",
        "attachments": []
    },
    {
        "author": "_alterx",
        "category": "general",
        "parent": "",
        "content": "Hello, my name is Gianni (aka AlterX), I am a senior software developer in C, C++ also .net platform and Qt. I have been working in the IT in general (also strong knowledge on networking and sys admin) for more than 25 years. I am quite expert on real-time middle-ware and back-end (native sockets and threads) on cross-platform. I am also quite new to blockchains, I have a general overview on how they work, I have successfully built-up an in house cardano nodes on raspberry p4 and set up all procedures for back-ups and so on (e.g. I successfully updated new versions of the node + the latest Alonzo hard fork). I have explored smart contract on ethereum, I liked them, but for me they are too high level programming so I lost interest on those (although I would once like to really use them to implement something useful). I am trying to get in to the blockchain world and one day I would like to have it as a full-time job.",
        "created_at": "2021-09-15T09:10:13.656000+00:00",
        "attachments": []
    },
    {
        "author": "ameya",
        "category": "general",
        "parent": "",
        "content": "Gm everyone! I'm Ameya, have applied for Cohort One of the CDAP as well. I have experience in Haskell and Plutus and am looking to explore the Ethereum ecosystem, especially the domain of NFTs and semi fungible tokens. Stoked to be with you all!",
        "created_at": "2021-09-15T09:49:50.619000+00:00",
        "attachments": []
    },
    {
        "author": "vladfdp",
        "category": "general",
        "parent": "",
        "content": "Hello everyone, I'm Vlad, unlike all of you I don't have any experience but hey at least I'm pretty motivated",
        "created_at": "2021-09-15T11:05:30.926000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "general",
        "parent": "",
        "content": "All the best mate. To all of us.",
        "created_at": "2021-09-15T11:57:36.994000+00:00",
        "attachments": []
    },
    {
        "author": ".takamaka",
        "category": "general",
        "parent": "",
        "content": "Hello everyone! I have also applied for Cohort One of the CDAP.  I am an enthusiastic Ethereum user, software developer with 10years of experience, willing to help change the world. I want to help build Ethereum to give us freedom of choice, the money layer, the metaverse and many more things that the world urgently needs. Overall, I want to learn as much as I can as fast as I can to help build new things.",
        "created_at": "2021-09-15T13:03:28.084000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "Good to see all of you here.  Thank you for the introductions.  We are still processing applications.  Ask questions if you have them",
        "created_at": "2021-09-15T13:17:18.340000+00:00",
        "attachments": []
    },
    {
        "author": "tsuigeo",
        "category": "general",
        "parent": "",
        "content": "Wow lots of applications for limited spots! Ive got a question about how you mentioned everything will actually be out in the open and even those not in the program officially may participate. For those of us who want to look into using this opportunity as a springboard to a career in blockchain how kosher would it be to list this as an experience on cvs, portfolios, etc if we participate even if not selected officially? And possibly if there may be any support if it comes to listing references to employers etc?",
        "created_at": "2021-09-15T13:21:46.557000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "Good questions.  So \"selection\" is only about funding.  Those that are selected will be offered a stipend for the duration of the program.  Selection has no bearing on being able to participate in the program.\n\nThe program is open and is almost entirely self directed.  There is no curriculum.  No active \"teaching\".  Anyone may choose to participate independent of being selected for funding if your situation allows.",
        "created_at": "2021-09-15T13:33:36.659000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "As for using this as a \"springboard\" into a blockchain career that is entirely up to you.  The program isn't intended or even very well suited for learning how to make blockchain applications.  If \"application\" development is what you are interested in, there are more effective ways to learn that stuff.  CDAP is about the low level protocol.",
        "created_at": "2021-09-15T13:38:12.862000+00:00",
        "attachments": []
    },
    {
        "author": "celestial_cheetah_53805",
        "category": "general",
        "parent": "",
        "content": "Its Good To Know That Anybody Can Participate in CDAP.\n\n\nWelcome Guys Lets Contribute To Ethereum.\n\nEverybody Will Earn Directly or Indirectly from Ethereum.\n\n\nhave Faith and Keep Contributing.\n\n\nAnd Anybody Have Some Good Learning materials (or How to Start Contributing Stuff) Keep Sharing It For Newer Members.",
        "created_at": "2021-09-15T13:42:10.296000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "Good places to start are the `./notes` from the first cohort.  They contain lots of links to good reading material.  Feel free to make your own `./notes` document in the `cohort-one` repo if you find anything new or if you just want to aggregate the things that were valuable to you: https://github.com/ethereum-cdap/cohort-zero\n\nAnd the development updates from the first cohort likely contain some good information about the kind of work that is currently being done: https://github.com/ethereum-cdap/cohort-zero/blob/main/development-updates.md",
        "created_at": "2021-09-15T13:46:26.486000+00:00",
        "attachments": []
    },
    {
        "author": "celestial_cheetah_53805",
        "category": "general",
        "parent": "",
        "content": "Thanks For Sharing The Links Sir",
        "created_at": "2021-09-15T13:47:54.843000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "There will also be two standup meetings in the next day:\n\n- East Standup Call in 13 hours 40 minutes: https://www.worldtimebuddy.com/?qm=1\u0026lid=2643743,7,100\u0026h=7\u0026date=2021-9-15\u0026sln=21.5-22\u0026hf=1\n- West Standup Call in 25 hours 40 minutes: https://www.worldtimebuddy.com/?qm=1\u0026lid=2643743,7,100\u0026h=7\u0026date=2021-9-16\u0026sln=9.5-10\u0026hf=1",
        "created_at": "2021-09-15T13:51:22.394000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "general",
        "parent": "",
        "content": "Ty \u003c@364458974906548225\u003e !",
        "created_at": "2021-09-15T14:36:40.806000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "BTW, the \"open secret\" for CDAP is that if you show up, engage with the process, do the work, and that work is good, then I will go to great lengths to help you find a way to continue in a sustainable manner.",
        "created_at": "2021-09-15T14:42:35.129000+00:00",
        "attachments": []
    },
    {
        "author": "timidan",
        "category": "general",
        "parent": "",
        "content": "Awesome!",
        "created_at": "2021-09-15T14:45:43.385000+00:00",
        "attachments": []
    },
    {
        "author": "celestial_cheetah_53805",
        "category": "general",
        "parent": "",
        "content": "Thanks For The Secrets To Cohort",
        "created_at": "2021-09-15T14:46:48.617000+00:00",
        "attachments": []
    },
    {
        "author": "jp.the4ducks0231",
        "category": "general",
        "parent": "",
        "content": "the ones that submitted the application for Cohort #1, can we 'watch' the standup meeting? if yes, please share the link.",
        "created_at": "2021-09-15T15:09:02.501000+00:00",
        "attachments": []
    },
    {
        "author": "celestial_cheetah_53805",
        "category": "general",
        "parent": "",
        "content": "It will Be Conducted After 12 Hour From Now",
        "created_at": "2021-09-15T15:14:10.491000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "We don't record these meetings.  Zoom link will get posted to this channel just before the call.  These are weekly calls.",
        "created_at": "2021-09-15T15:24:25.287000+00:00",
        "attachments": []
    },
    {
        "author": "_jmc_.",
        "category": "general",
        "parent": "",
        "content": "Hello everyone - here to learn and contribute as much as possible, aiming to apply to the apprenticeship program next time. Looking forward to learning from you all - thank you for sharing the resources! 🖖",
        "created_at": "2021-09-15T15:37:47.563000+00:00",
        "attachments": []
    },
    {
        "author": "_rahab_",
        "category": "general",
        "parent": "",
        "content": "Hey All! I am an applicant to cohort one, and very excited by all the enthusiasm and joy everyone here seems to have. I have solidity dev experience and am particularly interested in ZKsnarks, nfts, and layer 1 scaling. I am looking forward to getting to know everyone",
        "created_at": "2021-09-15T16:20:06.125000+00:00",
        "attachments": []
    },
    {
        "author": "_rahab_",
        "category": "general",
        "parent": "",
        "content": "Outside of this group, who do these weekly calls include if I may ask?",
        "created_at": "2021-09-15T16:20:27.737000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "The weekly calls are predominantly CDAP participants with a few extras that drop in to lurk.  They are a chance to provide visibility into what you are working on as well as getting visibility into what others are working on",
        "created_at": "2021-09-15T16:33:23.033000+00:00",
        "attachments": []
    },
    {
        "author": "georgeh0x",
        "category": "general",
        "parent": "",
        "content": "Hello everyone 👋 I applied for the CDAP the other day and just joined this discord. This looks like an exciting opportunity. Good luck to all who applied!",
        "created_at": "2021-09-15T16:55:41.438000+00:00",
        "attachments": []
    },
    {
        "author": "preach7562",
        "category": "general",
        "parent": "",
        "content": "Hey everyone! Pleasure to meet you all. I’m a potential cohort 2 member who is interested in layer 1 and layer 2 scaling solutions primarily. Contributing to the core Ethereum protocols is an honor I hope to one day achieve!",
        "created_at": "2021-09-15T17:19:03.731000+00:00",
        "attachments": []
    },
    {
        "author": "pacrob",
        "category": "general",
        "parent": "",
        "content": "Hello! I'm also a CDAP applicant, I look forward to working with you all.",
        "created_at": "2021-09-15T17:37:01.426000+00:00",
        "attachments": []
    },
    {
        "author": "celestial_cheetah_53805",
        "category": "general",
        "parent": "",
        "content": "Hello! I'm also a CDAP applicant, It will be an honour to contribute to Ethereum Community.",
        "created_at": "2021-09-15T17:39:00.264000+00:00",
        "attachments": []
    },
    {
        "author": "dtb_",
        "category": "general",
        "parent": "",
        "content": "hey yall -- question for the existing CDAP group (cohort zero). throughout the process, were there any desired but nonexistent tools that would have been helpful in the research process? it could be anything....very open ended",
        "created_at": "2021-09-15T17:54:04.251000+00:00",
        "attachments": []
    },
    {
        "author": "dtb_",
        "category": "general",
        "parent": "",
        "content": "context: i want to take on a personal side project (unrelated to the CDAP program) but figured i could potentially help build some rudimentary app/dApp that could help out the CDAP group....maybe be as simple as a basic UI to query the mainnet for data that is kinda specific to the CDAP experience (e.g., not accessible on tools like dune.xyz). or maybe it's not on-chain data but some tool that would help find info on what youre looking for during research",
        "created_at": "2021-09-15T17:54:06.580000+00:00",
        "attachments": []
    },
    {
        "author": "jeremyakatsa",
        "category": "general",
        "parent": "",
        "content": "Would also like to know this.",
        "created_at": "2021-09-15T18:21:22.452000+00:00",
        "attachments": []
    },
    {
        "author": "kernelpanic2281",
        "category": "general",
        "parent": "",
        "content": "Hello everyone. Glad to join this community. I am from SF Bay area, working in Data Infrastructure, SRE, DevOps etc. My desire to join the cohort is to get more insights into how transactions work and identifying if there are any bottlenecks that could be improved. Tall order 🙂",
        "created_at": "2021-09-15T18:56:02.200000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I see some people from my current country probably are spamming the repo",
        "created_at": "2021-09-15T21:31:10.727000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "general",
        "parent": "",
        "content": "Thank you Piper !",
        "created_at": "2021-09-15T21:33:26.009000+00:00",
        "attachments": []
    },
    {
        "author": ".a37",
        "category": "general",
        "parent": "",
        "content": "Hi everyone - Appreciate the initiative to put this program together, I think it's going to create lots of opportunity in this space.\n\nI wanted to ask if NFT smart contracts are a good way to get started in the ETH/SOL space. It's what I'm currently going through to get a handle on everything, but I don't know if it's an edge case of most smart contract applications.",
        "created_at": "2021-09-15T21:38:11.081000+00:00",
        "attachments": []
    },
    {
        "author": "dtb_",
        "category": "general",
        "parent": "",
        "content": "this space is more about the lower level protocol design -- here are some resources from the CDAP github page: https://github.com/ethereum-cdap/cohort-one/blob/master/stage-0-getting-started.md",
        "created_at": "2021-09-15T21:59:28.200000+00:00",
        "attachments": []
    },
    {
        "author": ".a37",
        "category": "general",
        "parent": "",
        "content": "Thank you!",
        "created_at": "2021-09-15T22:02:13.027000+00:00",
        "attachments": []
    }
]