[
    {
        "author": "cheechyuan.eth",
        "category": "general",
        "parent": "",
        "content": "Hi everyone, Im CheeChyuan and Im from Malaysia. Im a web developer and have taken interest in the blockchain space a few years back. Previously had played with IBM's hyperledger fabric and also written smart contracts on the kovan testnet as POC for a voting app that was used in a local university here in Malaysia.",
        "created_at": "2021-05-22T03:38:17.836000+00:00",
        "attachments": null
    },
    {
        "author": "sabnock",
        "category": "general",
        "parent": "",
        "content": "Hello everyone. My name is James from the US. I'm a software developer and I've followed the cryptocurrency space since late 2017 and used to be highly skeptical of Eth but have since changed my mind on it.",
        "created_at": "2021-05-22T17:07:20.362000+00:00",
        "attachments": null
    },
    {
        "author": "sabnock",
        "category": "general",
        "parent": "",
        "content": "I've been going through the yellow paper and my math background and the blockchain course I took in university have definitely served me well.",
        "created_at": "2021-05-22T17:08:03.173000+00:00",
        "attachments": null
    },
    {
        "author": "theamarishow",
        "category": "general",
        "parent": "",
        "content": "Hi Everyone. My name is Juan and I'm originally from Argentina. I've been a software engineer for about 5 years now with a background in distributed processing and data science. I'm happy to meet you all 🙂",
        "created_at": "2021-05-22T17:09:56.390000+00:00",
        "attachments": null
    },
    {
        "author": "0xrobertocantu",
        "category": "general",
        "parent": "",
        "content": "Hey everyone, I'm Roberto. I live in Texas in the States. I was previously on a path to be a licensed architect (buildings, construction, etc.) until I was introduced to crypto in the 2017 bull run. Naturally, I came across and learned about Ethereum and knew I wanted to pivot to the space full time at some point. Now I'm a developer and have deployed some contracts to various testnets and have participated in some hackathons, as well. Glad to be here amongst all of you. 😎",
        "created_at": "2021-05-22T18:34:59.784000+00:00",
        "attachments": null
    },
    {
        "author": "abstract_man",
        "category": "general",
        "parent": "",
        "content": "Hi everyone, My name is Darcy and I am originally from China. I graduated from college last year and currently a software developer. I just started learning about blockchain and I think Ethereum could very likely be the future as I learn all the cool stuff about it! Glad to meet you all🍉",
        "created_at": "2021-05-22T19:21:33.616000+00:00",
        "attachments": null
    },
    {
        "author": "soodmax",
        "category": "general",
        "parent": "",
        "content": "Hi everyone, my name is Atul and I am from Canada. I'm a software engineer by trade and spent first half of my career in enterprise architecture and development, last few years in various leadership roles. Still very much excited about technology, programming and the future of Ethereum and its impact on business landscape. Happy to be here!",
        "created_at": "2021-05-22T20:15:27.317000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "If anyone is looking for some small tasks to start getting their hands dirty \u003c@689161464829050960\u003e and I have been working on an EVM assembler/disassembler. There are several open tickets of varying degrees of difficulty: https://github.com/quilt/etk/issues\n\nFeel free to try and tackle any of them!",
        "created_at": "2021-05-22T20:31:51.089000+00:00",
        "attachments": null
    },
    {
        "author": "odyslam",
        "category": "general",
        "parent": "",
        "content": "Hey, super interesting. Thanks for sharing! BTW, how come and the implementation is in rust? It seems to be gaining in popularity in the space versus others like Golang",
        "created_at": "2021-05-22T20:35:53.106000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "We like rust a lot 🙂",
        "created_at": "2021-05-22T20:39:06.106000+00:00",
        "attachments": null
    },
    {
        "author": "odyslam",
        "category": "general",
        "parent": "",
        "content": "I have been working in the DevOps space for about a year now and everyone here is about Golang, so I am curious😅",
        "created_at": "2021-05-22T20:39:46.490000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "Golang is a great language for building awesome things quickly, but if you want maximum performance rust is best. I find the toolchain more pleasant to work with as well. Cargo is amazing!",
        "created_at": "2021-05-22T20:42:45.357000+00:00",
        "attachments": null
    },
    {
        "author": "odyslam",
        "category": "general",
        "parent": "",
        "content": "I have been meaning to get my hands dirty with rust for some time, thanks for the insight! yeah, about performance, that's true. I am mostly curious because I see people creating CLI-type tools with rust, for which I imagine performance is not an issue",
        "created_at": "2021-05-22T20:44:16.322000+00:00",
        "attachments": null
    },
    {
        "author": "odyslam",
        "category": "general",
        "parent": "",
        "content": "for example, I could see why you want an eth node in rust",
        "created_at": "2021-05-22T20:44:43.904000+00:00",
        "attachments": null
    },
    {
        "author": "spiralglide",
        "category": "general",
        "parent": "",
        "content": "I'm not the most well versed in Rust, but I might take a minute to look around the source code and maybe contribute.",
        "created_at": "2021-05-22T22:10:32.389000+00:00",
        "attachments": null
    },
    {
        "author": "spiralglide",
        "category": "general",
        "parent": "",
        "content": "Golang and Rust, from my experience, have similar diseases of that their best design decisions are their biggest pains",
        "created_at": "2021-05-22T22:12:05.673000+00:00",
        "attachments": null
    },
    {
        "author": "spiralglide",
        "category": "general",
        "parent": "",
        "content": "Though I think that tends to apply to almost everything in the world nowadays",
        "created_at": "2021-05-22T22:12:27.972000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "general",
        "parent": "",
        "content": "Eh, I feel like Rust's pain points are more because some features aren't done yet, and not because of design decisions, but I'm horribly biased.",
        "created_at": "2021-05-22T22:35:51.094000+00:00",
        "attachments": null
    },
    {
        "author": "samwilsn",
        "category": "general",
        "parent": "",
        "content": "Looking at you higher-kinded types, const-generics, async traits, etc",
        "created_at": "2021-05-22T22:36:22.037000+00:00",
        "attachments": null
    }
]