[
    {
        "author": "ja_0001",
        "category": "general",
        "parent": "",
        "content": "Hi guys any comment on it ? \n\nI have two ideas in case that I move forward (which I would\nlove to do it) to suggest to work during the program. \n\n\n\nThis is one:\n\nProposed readings: \nEthereum.org\n\nHow Ethereum works\n\nHigh-level explanations of Ethereum and blockchain technology generally. \n\nEthereum’s original Whitepaper\n\nUnderstanding Ethereum Allan Gulley.\n\nEth2 (Serenity): Learning everything You need to know about Eth2\n\nCasper the Friendly Finality Gasget.\n\nAllCoreDevs Update 006, Tim Beiko\n\n\nIntroduction\n\nThe EVM is a Turing complete virtual machine. EVM is intrinsically bound by gas ! Thus, the total amount of computation that can be done is intrinsically limited by the amount of gas provided !\n\nHence our strength could be our biggest weakness:\n\nProblem:\nAn attacker can overflow the network with an infinite loop generating a network collapsing. \nAttacker willing to provide a massive gas (called infinite) in order to i.e: execute a simple contract: transfer amount x from beneficiary B to beneficiary A and transfer amount x’ to beneficiary B from A. \n\nIf the attacker “invest” such a gas necessary to collapse the block generation (and Short a position from eth value - net halting (market cap value)), generating enough gas resource to repeat till Market Value gets to “Zero”. \n\nConsequence: Scalability compromised due to poor network performance and reliability. \n\nPossible Solution: \nIf a contract (or dApp) spend X amount (to be discussed and determined) executing a cyclical, not complex (to be determined) algorithm - contract, must be reviewed by validators Node immediately.\n\nProposal:\n\nGenerate a mathematical (simple) model where max X gas for cyclical contracts is allow. \nSimulate TPS for EVM when hijacked from cyclical “simple”  smart contracts. \n\nConclude if cyclical “infinite” gas smart contract could hijack EVM.",
        "created_at": "2021-09-20T04:55:37.354000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "general",
        "parent": "",
        "content": "Note: in order to avoid any possible stack overflow the attacker could generate infinite(prima) simple smart contracts. Generating the same outcome.\n\nNote2: PoW algorithm: it ensures that a particular blockchain will remain canonical into the future, making it incredibly difficult for and attacker to create new blocks that overwrite a certain part of history (e.g. by erasing transactions or creating fake transactions) or maintaining a fork (which is all of the above)\nThis as a matter of fact generates about mentioned scalability risk.\n\nNote3: Since PoS / consensus focus in optimizing TPS and scalability, introducing staking (The Beacon Chain), The Merge and Sharding in order to improve the Trilema uni or bi-directional problem, the risk for a simple, infinite’ smart contract(s) using the canonical EVM future paradigm is present either.\n\n\nThe second one is about sharding I am a Believer on it ! (To be continued...)",
        "created_at": "2021-09-20T04:56:06.297000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "\u003chttps://hackmd.io/\u003e  might be good for posting something like that in this channel markdown's formatting would make that easier to read",
        "created_at": "2021-09-20T06:49:54.586000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Sounds to me that you are proposing a fix for a problem that requires an infinite amount of funds to generate, and whose proposed fix will be trivially circumvented. For any simple in-protocol rule that you can come up with, the would-be attacker could simply make the loop slightly more complicated. I think gas price itself is already a mitigation for this attack: an attacker willing to burn massive amounts to break the network is better off buying all hashrate, or a vast majority of validators after the merge.",
        "created_at": "2021-09-20T09:53:55.316000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "general",
        "parent": "",
        "content": "Thanks !",
        "created_at": "2021-09-20T11:48:54.547000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "general",
        "parent": "",
        "content": "Thanks ! Indeed it would be a simple rule. Good you got it. Btw, Not agree about the massive funding required for it, in this case Just to define as you mentioned: a simple rule, make the system aware of it. e.g.: 1 - 2% tps negative impact due to a possible recursive loop detected that transaction would be observed. If it is a recursive loop it must be stopped. As you can see attacker would not need a massive amount (of gas even is you consider that gas price objective is desired to decreases, scalability dilemma. PoS), indeed would not need much, just as mentioned in the model a recursive simple operation performing.",
        "created_at": "2021-09-20T12:04:46.967000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "general",
        "parent": "",
        "content": "And that (in case it is applicable ) as you can see, would be the project proposal: to determine if this is a risk or not.",
        "created_at": "2021-09-20T12:59:12.134000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "I am going to suggest that this channel remain largely focused on the \"meta\" parts of the program and that you all use things like the research forums: https://ethresear.ch/ , the magicians forums: https://ethereum-magicians.org/ , hackmd documents: https://notes.ethereum.org/  and github issues in the relevant repositories for actual discussion and documentation of ideas.",
        "created_at": "2021-09-20T14:37:08.203000+00:00",
        "attachments": []
    },
    {
        "author": "celestial_cheetah_53805",
        "category": "general",
        "parent": "",
        "content": "Thanks We are Gonna Use Relevant channel for specific things.",
        "created_at": "2021-09-20T14:41:13.198000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "general",
        "parent": "",
        "content": "Thanks \u003c@364458974906548225\u003e will do !",
        "created_at": "2021-09-20T16:56:17.588000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "(feel free to drop links into this channel to any external resources you create.  using this channel for visibility is fine.  even better would be using one of the other channels here in the R\u0026D discord if there is one that is appropriate.  My message above is more about avoiding using this channel for in depth discussions of things that aren't CDAP related)",
        "created_at": "2021-09-20T17:23:32.063000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "general",
        "parent": "",
        "content": "Roger that.",
        "created_at": "2021-09-20T17:26:49.340000+00:00",
        "attachments": []
    },
    {
        "author": "dtb_",
        "category": "general",
        "parent": "",
        "content": "misc. resource – for anyone taking notes (e.g., in Notion, Jupyter, etc.) and/or eventually contributing to EIPs, this is a one-pager for inline math latex/katex functions: https://katex.org/docs/supported.html",
        "created_at": "2021-09-20T21:23:29.140000+00:00",
        "attachments": []
    },
    {
        "author": "ja_0001",
        "category": "general",
        "parent": "",
        "content": "Thanks !",
        "created_at": "2021-09-20T22:24:50.815000+00:00",
        "attachments": []
    }
]