[
    {
        "author": "zktriumph",
        "category": "general",
        "parent": "",
        "content": "Sorry guys I apologize I missed the yesterday's stand up, honestly I had to prepare for zoom meeting on a potential role with protocol labs where there was a misunderstanding due to time zone where I was sent a invite to choose  my convenient time which I chose 4pm in hopes to accommodate the host that It would be around 10am to 12 pm Los Angeles time,  but I waited and nothing and then around 1 am I got an email from a recruiter about rescheduling because I missed a meeting. \u003c@826475107995222017\u003e   I recall you were talking about wanting a permanent role on last week's stand up, you can check out https://thegraph.com/",
        "created_at": "2021-07-23T04:46:32.282000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "I sadly missed it too because I slept through my alarm :(. It is a pretty fun program though so I would have liked to said what I was up to and hear what others were up to as it is pretty interesting and cool. The freedom to get to work on/learn what you want is super appealing.",
        "created_at": "2021-07-23T06:25:05.209000+00:00",
        "attachments": []
    },
    {
        "author": "ogenev",
        "category": "general",
        "parent": "",
        "content": "Hey, you can still post your update here in the channel if you want. It is common to post an update in a chat if you miss a meeting.",
        "created_at": "2021-07-23T08:04:08.142000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Continuing here: implemented the hashing algo in assembly, nothing really fancy, but optimized for fixed size 64bytes blocks (hard-coding the padding block) and I get 190ms vs fastssz's 290, now I'm crushing prysm. Will now move to optimize for my cpu to see how far one can go, but clearly openssl is too generic: any implementation of sha256 that is prepared to hash long buffers gets crushed compared to one made for Merkle trees: this is my take on this experiment.",
        "created_at": "2021-07-23T16:54:05.951000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "FYI if anyone is looking for a project, the idea of adding a notification service to https://forkmon.ethdevops.io/ was proposed on today's AllCoreDevs call as an easy-ish project which would provide a ton of value 🙂",
        "created_at": "2021-07-23T17:31:18.392000+00:00",
        "attachments": []
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "You can ping me if you need help with that!",
        "created_at": "2021-07-23T17:32:24.300000+00:00",
        "attachments": []
    },
    {
        "author": "mariusvanderwijden",
        "category": "general",
        "parent": "",
        "content": "Code for that is here: https://github.com/ethereum/nodemonitor",
        "created_at": "2021-07-23T17:33:30.819000+00:00",
        "attachments": []
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "is the basic idea to add notifications for forks above a certain height? or when testnets stop producing blocks?",
        "created_at": "2021-07-23T19:18:50.405000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Another project for anyone who wants to familiarize themselves with EIPs and 1559 specifically: https://discord.com/channels/595666850260713488/745077610685661265/868222721450999819",
        "created_at": "2021-07-23T20:08:44.661000+00:00",
        "attachments": []
    }
]