[
    {
        "author": "defipunk",
        "category": "general",
        "parent": "",
        "content": "Hi everyone, researcher with a PhD in Systems \u0026 Networking. Over the last year, I worked for a smallish distributed systems startup, but quit my job a few months ago to focus on working the blockchain field. After trying my hand at some smart contract work, I'd like to go back to my passion and main interest, system development and research. Generally, bought my first bitcoin in 2012 and first eth late 2016/early 2017",
        "created_at": "2021-06-02T00:02:37.696000+00:00",
        "attachments": null
    },
    {
        "author": "spacerlady",
        "category": "general",
        "parent": "",
        "content": "I have. Feel free to ask me some specific questions.",
        "created_at": "2021-06-02T00:07:01.075000+00:00",
        "attachments": null
    },
    {
        "author": "spacerlady",
        "category": "general",
        "parent": "",
        "content": "My biggest issue was the first one was international. Make sure online, is within your country. Verses world wide. I was given a mentor in a different time zone and a career specialist in another country... Then unfortunately since I was into crypto and such I think my mentor had an inferiority complex and when COVID hit. I didn't request a change of mentor when I was bullied into deleting a 4 month repo hooked up to mongo db. Had to contest the money with a bank.",
        "created_at": "2021-06-02T00:10:55.890000+00:00",
        "attachments": null
    },
    {
        "author": "spacerlady",
        "category": "general",
        "parent": "",
        "content": "But have looked into other boot camp. Mainly front end but thinking I'll just skip doing a second front end course and dive into data science or cyber security centric programs.",
        "created_at": "2021-06-02T00:12:11.905000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Wow! Sorry for the off-topic but running a BBS in the 80s was hardcore! At that time I was in elementary school and my mom's lab had one VAX that connected to DARPA (direct call from Argentina). That was as close as I could get to \"internet\"",
        "created_at": "2021-06-02T00:26:23.943000+00:00",
        "attachments": null
    },
    {
        "author": "pothos0019",
        "category": "general",
        "parent": "",
        "content": "Mind if I'd dm you so we don't clutter this channel? Unless the information helps out here",
        "created_at": "2021-06-02T00:33:37.571000+00:00",
        "attachments": null
    },
    {
        "author": "uink45",
        "category": "general",
        "parent": "",
        "content": "Hello everyone! My name is Mihir, I am a second-year student studying for a Bachelor of Games and Interactive Environments in Australia.  I have experience in programming languages such as C#, Python, Solidity, and JavaScript. I entered the crypto space last year in April by learning about blockchain technology and the different protocols. In particular, I found Ethereum to be the most innovative because it provides freedom for creating any application on the blockchain. I am definitely excited to work on this protocol full-time!",
        "created_at": "2021-06-02T01:13:49.132000+00:00",
        "attachments": null
    },
    {
        "author": "king_ty774632",
        "category": "general",
        "parent": "",
        "content": "Hey Everyone, My Name is Tyree and i am a first year Software engineer student and i love technology in general from coding in different languages such as python, C, Java and even php to dealing with neural  Networks and deep learning\nits all fascinating and i cant wait to work with such like minded people",
        "created_at": "2021-06-02T01:32:53.706000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "welcome trent 😛",
        "created_at": "2021-06-02T01:55:42.721000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "glad to see all the other non-trents here as well!",
        "created_at": "2021-06-02T01:56:48.041000+00:00",
        "attachments": null
    },
    {
        "author": "0xdallascat",
        "category": "general",
        "parent": "",
        "content": "That's pretty impressive!  I think I still have some Jams and of course Vans from the 80's.  Maybe a OP t-shirt too 🙂",
        "created_at": "2021-06-02T02:12:25.078000+00:00",
        "attachments": null
    },
    {
        "author": "trent56566",
        "category": "general",
        "parent": "",
        "content": "Lol I appreciate the warm welcome Trent! I’m a Big fan btw brotha been following your Twitter for quite awhile love the analysis \u0026 breakdown from your perspective. \u003c@420951281910284289\u003e",
        "created_at": "2021-06-02T05:27:32.154000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "Very happy to see you all here.  I encourage any of you continue to open pull requests towards the `cohort-zero` repository.  If you've spent some time on a topic, maybe try writing down what you know about in your own words to test your understanding, as well as create content for others that come along to follow your breadcrumbs.  If you don't have any specific topics, try to find a question about the protocol for which you don't know the answer.",
        "created_at": "2021-06-02T06:09:40.454000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "Other great ways to learn stuff are to try and implement them.  Things like RLP encoding and the hexary patricia trie are very accessible and have well established tests for whether you have it correct.  This is another place where you could learn while producing material for others who come along later.  Something like a python implementation of any of these that is focused on readability and simplicity like the eth2.0-specs (https://github.com/ethereum/eth2.0-specs) would be really cool to see for any part of the Eth1 protocol.",
        "created_at": "2021-06-02T06:14:19.180000+00:00",
        "attachments": null
    },
    {
        "author": "gb429",
        "category": "general",
        "parent": "",
        "content": "Hello! My name is Ganesh Biradar. I am a software engineer working at Citrix. Hoping to learn a lot from this program!",
        "created_at": "2021-06-02T06:24:20.194000+00:00",
        "attachments": null
    },
    {
        "author": "ashhanai",
        "category": "general",
        "parent": "",
        "content": "Hi guys, excited to be here! My name is Naim Ashhab and I am currently mobile developer. I graduated computed science from CTU in Prague 3 years ago. I am mostly using Swift, but I am able to write something in Python, Solidity, JS and looking into Rust. I am crypto enthusiast since 2017, but I have never been able to dive into it full-time. I see Ethereum as an unbelievably disruptive technology and being able to participate to its protocol at its \"early days\" as an one-in-a-lifetime opportunity.",
        "created_at": "2021-06-02T06:27:54.978000+00:00",
        "attachments": null
    },
    {
        "author": "albusdompeldorius",
        "category": "general",
        "parent": "",
        "content": "Thanks! What would be a proper way to connect?",
        "created_at": "2021-06-02T07:14:42.687000+00:00",
        "attachments": null
    },
    {
        "author": "albusdompeldorius",
        "category": "general",
        "parent": "",
        "content": "Cool! I would like to collaborate, but haven't decided on a concrete project yet. I need to catch up on the existing theory first. I have compiled a list of material here: https://github.com/ethereum-cdap/cohort-zero/blob/7abc0aca01b9b7e053c595d45debefdb51d4f558/notes/albus.md",
        "created_at": "2021-06-02T07:21:18.356000+00:00",
        "attachments": null
    },
    {
        "author": "th4s_",
        "category": "general",
        "parent": "",
        "content": "\u003c@364458974906548225\u003e Is there also room for not so popular research topics, which are not related to core consensus?",
        "created_at": "2021-06-02T08:49:12.419000+00:00",
        "attachments": null
    },
    {
        "author": "th4s_",
        "category": "general",
        "parent": "",
        "content": "For example I would like to improve the current situation around data or analytics. Getting (historical, aggregated,...) data out of nodes has always been a pain. I would like to see  an open-source, non-commercial solution here.",
        "created_at": "2021-06-02T08:53:25.399000+00:00",
        "attachments": null
    },
    {
        "author": "pelumi.",
        "category": "general",
        "parent": "",
        "content": "Hi, I am Pelumi a lawyer from Nigeria who pivoted into software development recently. I have been following Ethereum development for years, especially for the great potential I see in it for third world countries. I believe this is a chance to get deeper and compound my knowledge about the protocol.",
        "created_at": "2021-06-02T09:20:44.148000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "https://twitter.com/trent_vanepps/status/1399817600486494209?s=20",
        "created_at": "2021-06-02T13:08:08.270000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "do you know about Trueblocks? https://twitter.com/trueblocks",
        "created_at": "2021-06-02T13:09:10.078000+00:00",
        "attachments": null
    },
    {
        "author": "jacobkaufmann",
        "category": "general",
        "parent": "",
        "content": "Hi everyone! I'm Jacob, previously a SDE at amazon in Seattle for a little over 2 years. After following the space for 2+ years I decided to pursue a full-time career in crypto, so I left my job in March 2021 to dedicate my full efforts toward Solidity/web3 development. As far as research topics go, I'm mainly interested in protocol-level mitigations to MEV",
        "created_at": "2021-06-02T13:57:57.868000+00:00",
        "attachments": null
    },
    {
        "author": "th4s_",
        "category": "general",
        "parent": "",
        "content": "Thanks! Just wrote him a mail.",
        "created_at": "2021-06-02T13:59:22.492000+00:00",
        "attachments": null
    },
    {
        "author": "th4s_",
        "category": "general",
        "parent": "",
        "content": "😄  Well seems you have a great pool to recruit from",
        "created_at": "2021-06-02T14:01:54.274000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "awesome! have you joined the Flashbots community yet?",
        "created_at": "2021-06-02T14:11:13.383000+00:00",
        "attachments": null
    },
    {
        "author": "king_ty774632",
        "category": "general",
        "parent": "",
        "content": "what is the culture like working with eth core developers?",
        "created_at": "2021-06-02T14:17:04.879000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "I'm pretty deeply entrenched in it so I don't really have an objective opinion.  It can vary widely.  It's not one team.  You can get a narrow view by listening to the allcoredevs calls.  When we do come together in person there tend to be a lot of deep dives into technical topics.  Do you have a specific questions?",
        "created_at": "2021-06-02T14:52:03.346000+00:00",
        "attachments": null
    },
    {
        "author": "king_ty774632",
        "category": "general",
        "parent": "",
        "content": "Nothing Specific Just wondering what other people insight was like with the program \ni saw there is a call in a couple minutes \nwould it be ok to join that call inside (eip editing)",
        "created_at": "2021-06-02T14:56:26.360000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "In general it should be fine for you all to join calls that are publicly posted here in the R\u0026D server.  Be polite.  Mute your microphone.  If you're unsure just ask the host.",
        "created_at": "2021-06-02T14:57:25.900000+00:00",
        "attachments": null
    },
    {
        "author": "jacobkaufmann",
        "category": "general",
        "parent": "",
        "content": "I have not, but I should change that! While I am very interested in their efforts, I was not sure whether their work would be within the scope of this apprenticeship",
        "created_at": "2021-06-02T15:05:00.288000+00:00",
        "attachments": null
    },
    {
        "author": "th4s_",
        "category": "general",
        "parent": "",
        "content": "wow open-ethereum is discontinued...",
        "created_at": "2021-06-02T15:36:39.348000+00:00",
        "attachments": null
    },
    {
        "author": "curiousapple",
        "category": "general",
        "parent": "",
        "content": "Hi Guys,\nAbhishek this side.\nI am a solidity dev.\nI am intrested in ETH2.0 and scalability.",
        "created_at": "2021-06-02T16:27:33.812000+00:00",
        "attachments": null
    },
    {
        "author": "danielr0508",
        "category": "general",
        "parent": "",
        "content": "Hi All, I've been playing with crypto since 2015.  I recently left a career as a physics/chemistry teacher. Pivoted to data engineering, but was not excited about any of the corporate jobs on the table.  Like many of you, I want to make a meaningful impact through Ethereum protocol development.  I'm currently living in New Orleans.  Looking forward to this program as a means to learn to effectively contribute to open source protocols. --Daniel",
        "created_at": "2021-06-02T16:55:15.012000+00:00",
        "attachments": null
    },
    {
        "author": "gb429",
        "category": "general",
        "parent": "",
        "content": "Since I'm completely new to the implementations of blockchains in general, I've got a few basic doubts while I'm going through the ethereum whitepaper. Is this is good place to ask them?",
        "created_at": "2021-06-02T16:55:43.299000+00:00",
        "attachments": null
    },
    {
        "author": "lelouchviindica",
        "category": "general",
        "parent": "",
        "content": "I relate to this sooo much",
        "created_at": "2021-06-02T17:18:45.098000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "\u003c@!441484183852810240\u003e the general rule is feel free to ask questions.  The more complex rule is try to ask informed questions for which you've done the due-diligence to explore the problem space yourself",
        "created_at": "2021-06-02T17:21:11.078000+00:00",
        "attachments": null
    },
    {
        "author": "gb429",
        "category": "general",
        "parent": "",
        "content": "Okay, got it!",
        "created_at": "2021-06-02T17:26:03.833000+00:00",
        "attachments": null
    },
    {
        "author": "joxoby",
        "category": "general",
        "parent": "",
        "content": "Hi all, I'm a SWE working in the Robotics/AI space, based in California. I hold an MS in Applied Mathematics and I have 5+ yrs of experience with C++ and Python. Currently exploring functional languages by learning OCaml. I'm interested in working on the protocol to improve the performance of distributed computations, especially distributed simulations. Also looking for a partner to be paired with, so please feel free to contact me if you're interested.",
        "created_at": "2021-06-02T18:26:47.912000+00:00",
        "attachments": null
    },
    {
        "author": "grobmeier",
        "category": "general",
        "parent": "",
        "content": "Hello, my name is Christian and I am a software developer since 1998. I have started to use ETH back in 2016 and always felt it's something great. These days I still believe in blockchain will change *things*, but never had time to look deeper in the tech. I would love to change that and look at the apprenticeship program as a great way to learn. My current day job includes a lot of open source, Java, Java, Java, some JavaScript, PHP and everything else related to Cloud and Web. One of the most exciting things I saw recently was \"unstoppable domains\".",
        "created_at": "2021-06-02T18:43:57.977000+00:00",
        "attachments": null
    },
    {
        "author": "ogenev",
        "category": "general",
        "parent": "",
        "content": "Are witness specifications still in progress? Has development of a prototype started?",
        "created_at": "2021-06-02T18:50:50.086000+00:00",
        "attachments": null
    },
    {
        "author": "halfinney.",
        "category": "general",
        "parent": "",
        "content": "\u003c@!364458974906548225\u003e is there room for Product Managers or Program Managers or is it just focused on development only?",
        "created_at": "2021-06-02T19:00:01.212000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "This is focused on the technical.  If your skillset is more on the PM side I'm not exactly sure where to point you.  \u003c@!552133098075193354\u003e?",
        "created_at": "2021-06-02T19:01:49.097000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003c@!487281155679191041\u003e depends on what you want to help with, but getting involved in the Ethereum Cat Herders is probably the best way to contribute to PMing.",
        "created_at": "2021-06-02T19:02:15.844000+00:00",
        "attachments": null
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "If you already know what you want to work on, then just joining that effort and doing whatever needs to be done is probably the best approach.",
        "created_at": "2021-06-02T19:02:43.517000+00:00",
        "attachments": null
    },
    {
        "author": "halfinney.",
        "category": "general",
        "parent": "",
        "content": "Thanks Tim!",
        "created_at": "2021-06-02T19:23:12.879000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "would echo tim - ECH is a great place to start with your skillsets",
        "created_at": "2021-06-02T19:33:49.183000+00:00",
        "attachments": null
    },
    {
        "author": "owanikin",
        "category": "general",
        "parent": "",
        "content": "Hello everyone, I am Ifeoluwa from Lagos Nigeria. A self-taught programmer, having done some work with python, javascript and now solidity. And I also hodl a few coins (lol). I have been deep diving into the ethereum ecosystem and loving every bit of it. It is a pleasure to be here and learn from you'all.",
        "created_at": "2021-06-02T20:15:37.987000+00:00",
        "attachments": null
    },
    {
        "author": "peteorion21",
        "category": "general",
        "parent": "",
        "content": "Hello everyone, I am Oluwatomisin.I have a background in Electrical and Electronics engineering, A self-taught programmer, a fullstack software developer , I started partial learning  about Blockchain since 2018, and now I am learning solidity. I am learning more about the Ethereum ecosystem a , it is a pleasure to be here and learn from you'all, am really loving it.",
        "created_at": "2021-06-02T21:00:35.439000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "For those that joined us in the last few days, it is probably worth scrolling up reasonable deep in this channel and doing a little reading.  You can probably gloss over the introductions, but there's a handful of good question/answer/clarification/etc buried up there.",
        "created_at": "2021-06-02T21:38:02.925000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "(some of it was extracted to the FAQ in the `cohort-zero` repo, feel free to extract more if you find something useful)",
        "created_at": "2021-06-02T21:38:34.694000+00:00",
        "attachments": null
    },
    {
        "author": "jarvis_labs",
        "category": "general",
        "parent": "",
        "content": "皆さんは、はじめまして、Hello Everyone. I am Jarvis (JJ).\nI am currently a freelance data scientist and meteorological based application developer in Japan.\nOriginally a physics student and then a  researcher, I am now looking to become a blockchain developer as a see the great possibility for blockchain tech and seeing the usability and development of Ethereum is a great place to start.\nI am pretty new to Ethereum and blockchain development less than 6 months but have over 3 years of python development and research experience. I find Ethereum to be at the current edge of blockchain development and looking forward to tackle the issues of scalability and security, to make it a truly accessible system for all. \nBest of luck to you all and hope to be working with you soon",
        "created_at": "2021-06-02T23:18:11.780000+00:00",
        "attachments": null
    }
]