[
    {
        "author": "zktriumph",
        "category": "general",
        "parent": "",
        "content": "I would like to add that those of us who are new to the protocol and were bound by our employers/NDAs concerning github contributions which doesn't reflect any activity on our profile, we should follow each other as participants of the cohort-zero.  EthGlobal is hosting a hackathon called Hack Money (https://defi.ethglobal.co/)  this month and some grant/bounty payments required that a participant should have at least 15 followers and we could also contribute to each other's projects,  I am willing to help other participants with their projects so that I can increase my contribution activity.",
        "created_at": "2021-06-11T04:22:06.510000+00:00",
        "attachments": null
    },
    {
        "author": "defipunk",
        "category": "general",
        "parent": "",
        "content": "\u003c@!364458974906548225\u003e what's your take on the cohort-zero repo? I don't want to unnecessarily increase your workload, but if you want, I'll probably continue with pull-requests",
        "created_at": "2021-06-11T06:55:13.599000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "I'm about to dish out collaboration rights to more people",
        "created_at": "2021-06-11T12:20:48.736000+00:00",
        "attachments": null
    },
    {
        "author": "hack3r_0m",
        "category": "general",
        "parent": "",
        "content": "hi, I missed applying officially via form, as I can see in github repo, it is open for public contributions, so is there any action needed from my side to enter the program?",
        "created_at": "2021-06-11T14:08:58.391000+00:00",
        "attachments": null
    },
    {
        "author": "akh4880",
        "category": "general",
        "parent": "",
        "content": "hey folks, just wanted to share this super cool resource on Zero-Knowledge Proofs (will add it to the github reading soon) \nhttps://github.com/matter-labs/awesome-zero-knowledge-proofs",
        "created_at": "2021-06-11T16:02:58.877000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "Nope, there's no official line between participation and not.  People are getting started with \"stage-1\" now and I expect most people who participate will be starting within the next 2 weeks.  There will be a public weekly \"standup\" call happening that will likely start week after next.",
        "created_at": "2021-06-11T20:02:04.631000+00:00",
        "attachments": null
    },
    {
        "author": "yanker8220",
        "category": "general",
        "parent": "",
        "content": "Another good resource for Interactive Proofs / ZK is: http://people.cs.georgetown.edu/jthaler/ProofsArgsAndZK.pdf",
        "created_at": "2021-06-11T21:05:21.872000+00:00",
        "attachments": null
    }
]