[
    {
        "author": "norswap",
        "category": "general",
        "parent": "",
        "content": "I've started doing this, but for stateless ethereum in general. I hope to be able to post a draft tomorrow, or wednesday at worse.",
        "created_at": "2021-06-22T00:13:06.727000+00:00",
        "attachments": []
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "this is awesome. I have another project in mind that will create a repo with the latest docs for each channel here to help get people up to speed",
        "created_at": "2021-06-22T02:50:44.399000+00:00",
        "attachments": []
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "see comment above, would love to link to your work once it's started!",
        "created_at": "2021-06-22T02:51:11.156000+00:00",
        "attachments": []
    },
    {
        "author": "kolbyml",
        "category": "general",
        "parent": "",
        "content": "Damn I find the diversity of interests people have participating in this program fairly interesting cause how they differ from my own. I guess that is one of the cool parts about the program. How many different people (with different ideas/interests) you meet\n\nFor me I have just been reading a ton of stuff all week, articles just keep linking me to other articles. What peaks my interest is the Portal Network and reading what lead up to this concept which was pretty vast, Piper has been making blog posts for years now on his journey and the members which follow the same goal. I am also a lot more interested in the implementation of protocol rather then the research side of it. So I have just been craving to read the geth codebase(and other clients in the eth ecosystem)  and contribute to it or just write my own client. ``An implementation of something that only exists as a specification.`` I am also going to be looking more into this as it seems fun, it might be some work to find that though.",
        "created_at": "2021-06-22T03:38:23.873000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "💰 **Looking for someone with front end development + data viz experience for a CDAP issue** 💰 \n\nThis is a tight timeline, but we would like to have a hosted version of the Tuweni network crawler up for the Goerli London fork next week. \u003c@!686695036733227017\u003e has opened an issue on the CDAP repo with details: https://github.com/ethereum-cdap/cohort-zero/issues/63\n\nFunds are available for this work. If you are interested and think you could get this live in the next week, please reach out to me to coordinate 😄",
        "created_at": "2021-06-22T17:02:11.147000+00:00",
        "attachments": []
    },
    {
        "author": "cybersyn3988",
        "category": "general",
        "parent": "",
        "content": "Hi, I'd like to get into the research side of core development and I'm somewhat experienced with Python which I heard is widely used for this matter, any suggestions on what to read to get started in the research methodologies?",
        "created_at": "2021-06-22T17:12:33.489000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "hi! is there a specific area of interest you have? i could point you to further resources but there are lots of parallel research directions (that could all be reachable from python)",
        "created_at": "2021-06-22T18:31:18.631000+00:00",
        "attachments": []
    },
    {
        "author": "cybersyn3988",
        "category": "general",
        "parent": "",
        "content": "Well, I haven't dived deep very much but as a data scientist I would be very interested in anything related to economics or data science/stats",
        "created_at": "2021-06-22T19:21:41.696000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "others here could probably give more specific recommendations but on the economics front, looking at something around EIP-1559 would be timely and likely fruitful",
        "created_at": "2021-06-22T19:46:15.920000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "i suppose various MEV research could also fit into this (there seems to be a lot of MEV interest in this group, understandably!)",
        "created_at": "2021-06-22T19:47:10.947000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "\u003c@!695743397196988466\u003e one simple econ/DS project would be to analyse the gas price distribution in blocks pre and post-EIP-1559",
        "created_at": "2021-06-22T19:48:33.904000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I'd recommend reading this as background: https://medium.com/@eric.conner/fixing-the-ethereum-fee-market-eip-1559-9109f1c1814b",
        "created_at": "2021-06-22T19:50:58.543000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I think it's not as simple as the \"Mean/Median\" over Nth Percentile as the graph shows, because the gas distribution is somewhat bi-modal: the first couple transactions in a block will pay a lot because of arbitrage opportunities. It'd be interesting to analyze the following:\n- Those \"tail\" txns aside, how does the mean/median over 10th percentile value change; \n- Pre and post-1559, what % of transaction fees come from the \"tail\" values",
        "created_at": "2021-06-22T19:52:40.621000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "1559 will hit mainnet late July/early August, but it will be live on testnets over the next few weeks. I suspect Goerli may be a used enough testnet to set up infra and run some preliminary tests prior to running the analysis on mainnet.",
        "created_at": "2021-06-22T19:54:23.414000+00:00",
        "attachments": []
    },
    {
        "author": "cybersyn3988",
        "category": "general",
        "parent": "",
        "content": "All right, thank you!! I'll look into those subjects 👌",
        "created_at": "2021-06-22T20:05:50.812000+00:00",
        "attachments": []
    },
    {
        "author": "cybersyn3988",
        "category": "general",
        "parent": "",
        "content": "Well that looks quite interesting!!! Are there any ready-to-go services to scrape that data or should I do that myself?",
        "created_at": "2021-06-22T20:07:48.878000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "Hmm, I'm not an expert here 😅 . Etherscan has an API, which may give you what you need, but I'm not sure if it is available for Goerli as well.",
        "created_at": "2021-06-22T20:09:26.586000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "FYI here's another article that goes in some detail about the \"tail\" txns and the breakdown of the fees received by miners: https://insights.deribit.com/market-research/establishing-bounds-for-miner-revenue-in-eip-1559/",
        "created_at": "2021-06-22T20:10:50.722000+00:00",
        "attachments": []
    },
    {
        "author": "cybersyn3988",
        "category": "general",
        "parent": "",
        "content": "Nice, I'll take a look at it, thanks!! 👍",
        "created_at": "2021-06-22T20:22:21.856000+00:00",
        "attachments": []
    }
]