[
    {
        "author": "taylorsmith1",
        "category": "general",
        "parent": "",
        "content": "Hi! Thank you for pointing me to this - I've been sifting and reading throughout the evening (it's late so pardon me if I proceed to be unintelligible!). \n\nI am very interested in the subject of light clients and their broader societal impact moving forward into the next phase of Ethereum. Especially interested as well in how they may impact how Alchemy and Infura are utilized.\n\nI'm coming from an oddly mixed background so I would love some input/advice around how best I can contribute and offer my skillset to this project (I've been dabbling with different ideas for a while now prior to starting this week). I am not an intense engineer; I can code (primarily Java) but cannot produce the cleanest of code just because of lack of experience. I currently work in a product management type of role. My skills are best from a high level, design-oriented, business-strategy kind of mindset, and I love to write and give talks. A major goal of mine is to produce a research paper, or a conference presentation, or something of the sort as a result of this R\u0026D experience. \n\nIf you or anyone has thoughts around how I might be able to most effectively contribute moving forward I would so appreciate it! 🏃‍♀️ If not, that's okay too, I know I'll figure it out! 😆",
        "created_at": "2021-11-17T04:12:40.427000+00:00",
        "attachments": null
    },
    {
        "author": "muddlebee",
        "category": "general",
        "parent": "",
        "content": "\u003e  I currently work in a product management type of role. My skills are best from a high level, design-oriented, business-strategy kind of mindset\n\nI think you are better suited here https://ethereumcatherders.com/ . \u003c@!642887713246150666\u003e is currently the org admin. Discord: https://discord.gg/aZMgjtHu\n\n\u003e A major goal of mine is to produce a research paper, or a conference presentation, or something of the sort as a result of this R\u0026D experience. \n\ncheck #eip-editors channel at  `Ethereum Cat Herders` discord once you join.\n\n`EIP editor apprenticeship meeting`  ➡️  https://youtu.be/pgwqySjLwIs",
        "created_at": "2021-11-17T14:10:38.100000+00:00",
        "attachments": null
    },
    {
        "author": "muddlebee",
        "category": "general",
        "parent": "",
        "content": "\u003e I am very interested in the subject of light clients and their broader societal impact moving forward into the next phase of Ethereum.\ncheck ➡️ https://discord.com/channels/595666850260713488/843176491386667018/909975044527099905\n\nand ➡️ https://discord.com/channels/595666850260713488/745077610685661265/908083074137468970",
        "created_at": "2021-11-17T14:12:17.472000+00:00",
        "attachments": null
    },
    {
        "author": "taylorsmith1",
        "category": "general",
        "parent": "",
        "content": "Thank you very much for those links \u003c@!812903897072402473\u003e , I really appreciate it! Looks great.\n\nI need to/want to participate at this level in the apprenticeship program, however, but I wanted to mix in various skillsets with the contributions I make. I just wanted to get some broader insight beyond my initial conversation with Piper.",
        "created_at": "2021-11-17T14:21:00.633000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "\u003c@!893550372885504070\u003e they all look like they are still relevant but don't take my word as truth.  For example, portal client implementation in geth *might* be a good project, but it also might be a dead end without buy in from the geth team, but it also might not be feasible to get buy-in from the geth team without a demonstrable working implementation that improves the client in some way...",
        "created_at": "2021-11-17T15:46:53.800000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "If you (or anyone here really) wants to play the long game, meaning, choosing a topic that is big and deep but should remain relevant for the next few years since they are going to take a lot of time and effort to deliver, I'd recommend these topics:\n\n- verkle/state-expiry/address-space-extension\n- post-merge-data-shards + L2-optimistic-rollups + how-to-get-users-activity-on-L2-ASAP + tooling-needed-for-L2-adoption\n- account-abstraction + tooling-needed-for-account-abstraction-adoption + maybe-transaction-batching-and-other-loosely-related-concepts\n\nThere's still lots of really relevant things that aren't part of this list.  Choosing one of these is choosing to \"Eat an Elephant\" (https://en.wiktionary.org/wiki/eat_an_elephant_one_bite_at_a_time)",
        "created_at": "2021-11-17T15:54:06.653000+00:00",
        "attachments": null
    },
    {
        "author": "taylorsmith1",
        "category": "general",
        "parent": "",
        "content": "Ah okay yes the eat an elephant metaphor is resonating. I will look into these topics - and then maybe my focus can be around adding to the research/setting the stage/shaping what the development would look like without as much anxiety around creating the crispiest code. Does that sound right?",
        "created_at": "2021-11-17T15:57:57.854000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "- First priority: whatever path leads you to learning \"all the things\"\n- Second priority: delivery of code or anything externally useful",
        "created_at": "2021-11-17T15:59:29.612000+00:00",
        "attachments": null
    },
    {
        "author": "blockdev",
        "category": "general",
        "parent": "",
        "content": "Hey. I’m interested in joining this group to learn about ZK. Can i get an invite? It shows invalid invite.",
        "created_at": "2021-11-17T16:33:32.419000+00:00",
        "attachments": null
    },
    {
        "author": "muddlebee",
        "category": "general",
        "parent": "",
        "content": "https://discord.gg/69ukXhVWnG",
        "created_at": "2021-11-17T17:23:19.437000+00:00",
        "attachments": null
    },
    {
        "author": "ja_0001",
        "category": "general",
        "parent": "",
        "content": "Hi \u003c@364458974906548225\u003e hope everything is Ok. Will be there a call tonight ?",
        "created_at": "2021-11-17T19:15:55.531000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "Yes, there will be a call tonight.",
        "created_at": "2021-11-17T19:16:13.176000+00:00",
        "attachments": null
    }
]