[
    {
        "author": "mratsim",
        "category": "general",
        "parent": "",
        "content": "You might be able to use this library: https://github.com/minio/sha256-simd\n\nwhich is a fork of multi-buffer hashing https://github.com/intel/intel-ipsec-mb",
        "created_at": "2021-07-19T09:19:56.106000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "But isn't that what fastssz is using? In any case I've implemented algorithms with sse2, sse3 and avx2 for 256 bits and even hashing 8 blocks at a time with simd is much worse than one at a time with SHA extensions in my CPU. In my intel laptop they are better performant. I can't test avx512 yet",
        "created_at": "2021-07-19T10:17:22.841000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Ah I see \u003c@570268431522201601\u003e that indeed those are essentially the same algos from Intel that I've tested with at home. Since I have a Ryzen CPU, the SHA extension version is faster, but indeed I'd expect avx2 or avx512 to be faster on not so new Intel CPUs",
        "created_at": "2021-07-19T11:01:49.562000+00:00",
        "attachments": []
    },
    {
        "author": "newweiv",
        "category": "general",
        "parent": "",
        "content": "does anyone know if there is some sorta educational-related document for \"breaking down the devp2p protocols\" or \"breaking down the general eth protocol\"? rn, I just mostly see the specs and while that is helpful, it doesn't give a great way for newcomers to start. i was thinking about doing a possible project where i write up some documents, pictures, etc. outlining each of the roles of the individual devp2p protocols, what they do, how they work together, and how they serve the needs of the upper layers of the general eth protocol. any critiques to this/does it already exist?",
        "created_at": "2021-07-19T17:04:17.100000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "i haven't seen anything and would love more educational content around ethereum networking!",
        "created_at": "2021-07-19T18:19:39.109000+00:00",
        "attachments": []
    }
]