[
    {
        "author": "muhdraffiq",
        "category": "general",
        "parent": "",
        "content": "https://takenobu-hs.github.io/downloads/ethereum_evm_illustrated.pdf\n\nI have been reading the yellow paper and also the articles made simpler in the yellow paper. So i did some digging to find simpler explanations in yellow paper and found this slides. I hope this slides help for those who are reading yellow paper",
        "created_at": "2021-05-26T06:39:56.288000+00:00",
        "attachments": null
    },
    {
        "author": "muhdraffiq",
        "category": "general",
        "parent": "",
        "content": "if this slides help, i would like to add in this notion page for others to refer",
        "created_at": "2021-05-26T06:41:20.930000+00:00",
        "attachments": null
    },
    {
        "author": "andrewlreeve",
        "category": "general",
        "parent": "",
        "content": "Hi 👋 \n\nJust quickly introducing myself. I'm Andrew and i've recently moved to New Zealand, living in a small city by the beach. I'm starting a deep dive into the blockchain space and this programme looks to be a great way to get involved. I have an electrical engineering background, with the last 2 years in software.\n\nLooking forward to meeting everyone and reading the various project ideas.",
        "created_at": "2021-05-26T07:52:34.722000+00:00",
        "attachments": null
    },
    {
        "author": "odyslam",
        "category": "general",
        "parent": "",
        "content": "I think it's better if you make a PR in the GH repo as \u003c@!364458974906548225\u003e mentioned above. You can create your own .md file in the /notes file and add freely your content",
        "created_at": "2021-05-26T09:46:57.999000+00:00",
        "attachments": null
    },
    {
        "author": "odyslam",
        "category": "general",
        "parent": "",
        "content": "For anyone who is interested in MEV/layer2, I have added some resources (articles, podcasts, papers) in my notes file. You will find them in notes/odysseas.md: https://github.com/ethereum-cdap/cohort-zero/blob/main/notes/odysseas.md",
        "created_at": "2021-05-26T09:48:13+00:00",
        "attachments": null
    },
    {
        "author": "lillian9467",
        "category": "general",
        "parent": "",
        "content": "Hello everyone, My name is Lillian Namusisi, I am from Uganda. I have a computer engineering degree with software developer experience of 3 years. I learned about blockchain in 2019 and am currently re-entering the blockchain space, and I know the Ethereum ecosystem is the right place to be!\nLooking forward to learning with everyone.",
        "created_at": "2021-05-26T09:54:17.192000+00:00",
        "attachments": null
    },
    {
        "author": "_astralr",
        "category": "general",
        "parent": "",
        "content": "Hello guys, my name is Robert. I'm from Hungary. I joined the space in 2019. I have a degree in mechanical engineering. I taught myself to code in Python and Solidity. I'm contributing to ethereum.org as a translator. I'm looking for opportunities to add more value to the ecosystem, meanwhile sharpening my blockchain knowledge.",
        "created_at": "2021-05-26T15:00:39.809000+00:00",
        "attachments": null
    },
    {
        "author": "m.bison5485",
        "category": "general",
        "parent": "",
        "content": "Hi Muhd I’ve already created the Notion Doc it just has embedded links so people can see what the content is. I also merged the PR so anyone can see it on the Cohort GitHub",
        "created_at": "2021-05-26T18:10:32.443000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "Reminder: Office hours calls happening \"tomorrow\"\n\n- Thursday May 27th at 0900 MDT (1500 UTC): https://www.timeanddate.com/worldclock/converter.html?iso=20210524T150000\u0026p1=1243\u0026p2=1440\n- Thursday May 27th at 2100 MDT (0300 UTC): https://www.timeanddate.com/worldclock/converter.html?iso=20210525T030000\u0026p1=1243\u0026p2=1440\n\nWe will use one of the discord voice channels in this server.  Drop in whenever.  Call will go for at least 1 hour, and probably no more than 2 hours.",
        "created_at": "2021-05-26T19:53:21.454000+00:00",
        "attachments": null
    },
    {
        "author": "odyslam",
        "category": "general",
        "parent": "",
        "content": "Thanks for the timeanddate link \u003c@!364458974906548225\u003e",
        "created_at": "2021-05-26T20:18:28.138000+00:00",
        "attachments": null
    },
    {
        "author": "odyslam",
        "category": "general",
        "parent": "",
        "content": "Super useful for the remote toolkit",
        "created_at": "2021-05-26T20:18:44.360000+00:00",
        "attachments": null
    },
    {
        "author": "peter.davies",
        "category": "general",
        "parent": "",
        "content": "Hi, I'm Peter. I'm currently living in Birmingham, UK (not Alabama). Have a degree in Mathematics. I've spent a lot of time thinking about elliptic curves in a non cryptographic context. I've been lurking it cryptocurrency communities for ages, but never really gotten involved. Very interested in the opportunity to do core protocol R\u0026D for Ethereum. Have been thinking recently about whether it would be feasible to use threshold decryption to prevent validators from knowing the contents of transactions before they include them in blocks to prevent MEV.",
        "created_at": "2021-05-26T20:58:02.570000+00:00",
        "attachments": null
    },
    {
        "author": "schattian",
        "category": "general",
        "parent": "",
        "content": "Hi everyone. I'm Sebastian from Argentina.  Currently, I work as a  software engineer at Amazon, Ring. I started learning about blockchain at the beginning of the year, and couldn't stopped until now. I'm passionate about standardization and simplicity, so I found this place to be the best one to put my efforts.",
        "created_at": "2021-05-26T21:20:24.474000+00:00",
        "attachments": null
    },
    {
        "author": "th4s_",
        "category": "general",
        "parent": "",
        "content": "Hey guys, my name is Thomas and I am from Germany. I have a background in physics but switched to coding a few years ago. I hope we have a cool time :)",
        "created_at": "2021-05-26T21:23:57.165000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "this sounds like an awesome area of research! glad to have you here",
        "created_at": "2021-05-26T21:58:02.284000+00:00",
        "attachments": null
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "it's been amazing to see so many new faces here! looking forward to this growing into an awesome space for collaboration and leveling up on Ethereum knowledge",
        "created_at": "2021-05-26T21:59:08.638000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Hi, also a mathematician here, and interestingly enough my last article has the words \"elliptic curves\" in the title. I  have been discussing with colleagues precisely this problem of threshold decryption. In the contexts of sidechains running on Cartesi for example that allows you to run Linux. We ran into problems that seemed unsolvable for DOS attacks and the such.",
        "created_at": "2021-05-26T22:15:24.220000+00:00",
        "attachments": null
    },
    {
        "author": "greg_vardy",
        "category": "general",
        "parent": "",
        "content": "Hey Peter, I'm in Cambridge UK and I also studied Mathematics! I'm super interested in working on zk-SNARKs \u0026 the EVM, it could also be used to prevent validators knowing contents of transactions before they include them in a block, although its currently not feasible because it's too slow. I'm actually currently writing up a super long blog post series that goes extremely deep on zk-SNARKs.\n\nI'm not sure fully preventing MEV is possible, trying to prevent it could/would result in MEV happening in private instead of the open, hence why Flashbots exists (I've been part of the flashbots community for a while). And in the context of ETH2 some MEV might actually help make the network more secure by attracting more validators/capital.",
        "created_at": "2021-05-26T22:17:46.927000+00:00",
        "attachments": null
    }
]