[
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "The \"qualifications\" requirements are intentionally loosely defined.  This is because when you look at the core developers, I'm not sure that there's very many objectively measurable attributes that are shared across the team.  There are core devs who didn't attend university.  There's plenty who did but have no formal computer science background.  There are some that don't have any extensive prior work experience.   See this section for my best stab at a description of what it takes: https://github.com/ethereum-cdap/cohort-zero/blob/main/program-details.md#who-is-it-for",
        "created_at": "2021-05-19T00:02:14.504000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "But precisely in this scenario is that letters of recommendations excel! If you have a measurable qualification you just require a score and that's it. If you are subjective by definition then letters are great too give you insight that applicants themselves can't. On the other hand in my field we rely on knowing the letter writers, something that you may not really have in a new field where the big names are probably few and young",
        "created_at": "2021-05-19T00:05:16.416000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Woah",
        "created_at": "2021-05-19T01:26:53.924000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "New channel",
        "created_at": "2021-05-19T01:26:56.980000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "awesome!",
        "created_at": "2021-05-19T01:26:57.844000+00:00",
        "attachments": null
    },
    {
        "author": "jarviseasy1152",
        "category": "general",
        "parent": "",
        "content": "This program will let me learn more  in summer vacation, even though I have degrees.😆",
        "created_at": "2021-05-19T02:41:37.562000+00:00",
        "attachments": null
    },
    {
        "author": "p1ge0nh8er",
        "category": "general",
        "parent": "",
        "content": "currently reading this https://gist.github.com/ftruzzi/fe6c6735dbbfafa4994985879254a871! looks good so far",
        "created_at": "2021-05-19T04:03:37.795000+00:00",
        "attachments": null
    },
    {
        "author": "jarviseasy1152",
        "category": "general",
        "parent": "",
        "content": "Hi \u003c@!364458974906548225\u003e. I have a question for consensus mechanism.  Now I have some humbergers, and you want to use 1 ETH to buy a humberger from me. Then we agreed offline. You give me 1 ETH, and I will give you a humberger. It seems OK. But let's consider another scenario. You keep your promises, and transfer 1 ETH to my wallet. But I'm a bad man. When I confirmed the transaction, I‘m immediately running away with my humbergers. Now the consensus mechanism in Ethereum cannot restrain my behavior. So how cryptocurrency to build a connection with the real world?",
        "created_at": "2021-05-19T04:19:49.135000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "Connecting the blockchain world and the real world is a very difficult problem. In the scenario you laid out, nothing can be done besides take it up with the local authorities and hope the justice system can resolve the issue. There are some *potential* mechanisms to resolve disputes between the blockchain and the real world, but none of them fool proof. Checkout Kleros as an example. The issue is that generally you'll need to stake at minimum the total amount of volume you need to be covered for - so suppose in your example, you dispute window ends after 24 hours. That means the burger provider would need to stake enough funds to cover all 24 hours worth of transactions. Insurance protocols might be able to reduce that burden, but now we're starting to get out of the scope of the original post 🙂",
        "created_at": "2021-05-19T04:30:18.420000+00:00",
        "attachments": null
    },
    {
        "author": "owleksiyowpckcr",
        "category": "general",
        "parent": "",
        "content": "\u003c@!821583776260948039\u003e ^ to add to the above, consider cash in your example instead of ETH. not much prevents me (seller) from taking your cash and running away. things that stop me are: 1) LEOs; 2) tarnishing my reputation; 3) leaving behind my burger stand - you'll just take it over. \nnone of these 3 constraints are 'hard' - there are some conditions when it's worth it for me to run away with your money 🙂",
        "created_at": "2021-05-19T04:56:30.181000+00:00",
        "attachments": null
    },
    {
        "author": "owleksiyowpckcr",
        "category": "general",
        "parent": "",
        "content": "the fact that constraints are soft/economic is what makes the entire ETH ecosystem both super powerful and super complicated, and not always in a good way - there's probably a lot of economic flaws in existing protocols",
        "created_at": "2021-05-19T05:00:18.259000+00:00",
        "attachments": null
    },
    {
        "author": "ryan5th_l6840",
        "category": "general",
        "parent": "",
        "content": "Multisig or escrow smart contracts help with transaction trust a little. \n\nInvoicing is another way of enforcing trust. \n\nThey help bridge to the real world by outlining exactly what each party expects both inside and outside the block chain, and recording when each party confirms a positive or negative transaction, and distributing crypto according to contract specs. Escrows are especially effective I think.",
        "created_at": "2021-05-19T08:01:07.224000+00:00",
        "attachments": null
    },
    {
        "author": "jarviseasy1152",
        "category": "general",
        "parent": "",
        "content": "\u003c@!543900561460822016\u003e \u003c@!824149853612539914\u003e \u003c@!571309525961801730\u003e  Thank you for your answers. I will deeply research it. 😀",
        "created_at": "2021-05-19T08:18:04.496000+00:00",
        "attachments": null
    },
    {
        "author": "zktriumph",
        "category": "general",
        "parent": "",
        "content": "Wouldn't it be wise for a third party to be involved,  let's say an escrow service provider that would be able facilitate the payment and delivery of the product e.g uber eats comes to mind.  Or would that consider it centralized because the network's mission is to remain decentralized? \u003c@821583776260948039\u003e",
        "created_at": "2021-05-19T09:50:13.881000+00:00",
        "attachments": null
    },
    {
        "author": "zktriumph",
        "category": "general",
        "parent": "",
        "content": "Sorry \u003c@571309525961801730\u003e  I didn't see you already answered that question,  I logged in and saw the question without checking if the there was reply below",
        "created_at": "2021-05-19T09:53:24.039000+00:00",
        "attachments": null
    },
    {
        "author": "spiralglide",
        "category": "general",
        "parent": "",
        "content": "could pretty well be used in the interest of atomic swaps as well",
        "created_at": "2021-05-19T17:04:08.817000+00:00",
        "attachments": null
    },
    {
        "author": "kodey_",
        "category": "general",
        "parent": "",
        "content": "i also love go! it's my favourite programming language. super flexible for my needs",
        "created_at": "2021-05-19T17:15:49.050000+00:00",
        "attachments": null
    },
    {
        "author": "spiralglide",
        "category": "general",
        "parent": "",
        "content": "Nice to hear! I know a lot of people who dislike it, and a couple of people who really like it.\n\nIt certainly has it's fair share of problems, but at the same time, there are things I can't live without in other languages 😂",
        "created_at": "2021-05-19T17:16:47.612000+00:00",
        "attachments": null
    },
    {
        "author": "kodey_",
        "category": "general",
        "parent": "",
        "content": "i mean i spend the majority of my day with js so it's always a lovely change when i get to use it",
        "created_at": "2021-05-19T17:17:25.132000+00:00",
        "attachments": null
    },
    {
        "author": "spiralglide",
        "category": "general",
        "parent": "",
        "content": "most of my days over the last 6 months have been with C#/.NET, but originally I was mainly doing stuff in Go. Thankfully looks like my work will be shifting back to that now 🙂",
        "created_at": "2021-05-19T17:18:08.023000+00:00",
        "attachments": null
    },
    {
        "author": "akh4880",
        "category": "general",
        "parent": "",
        "content": "The Oracle problem is a big issue/feature of all blockchains. It is hard to get info from off chain to on chain or from chain to chain. I think that the price if ETH in $ is one of the most important oracle uses. Y’all should check this proposal to use the $UNI token as the ETH-$ or oracle in a decentralized way. https://gov.uniswap.org/t/uni-should-become-an-oracle-token/11988",
        "created_at": "2021-05-19T17:19:26.089000+00:00",
        "attachments": null
    },
    {
        "author": "kodey_",
        "category": "general",
        "parent": "",
        "content": "The agency i work for we mainly use PHP / JS but i've managed to convince them to use Go for the API's we build but the type of work we do i luckily get to do a massive range of things but it's always a treat to use Go",
        "created_at": "2021-05-19T17:20:14.730000+00:00",
        "attachments": null
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "I'll point out that this line of discussion is loosely relevant, but it's mostly applicable to the application layer, i.e. people who want to build \"things\" on top of the protocol.  These are often good ways to learn about the protocol itself, but they are also only tangentially related to the core protocol.  If you'd like to discuss this type of thing, I'll encourage it to happen in \u003c#595721451651465227\u003e or to ensure that your discussion is in some way directly related to the core protocol itself.",
        "created_at": "2021-05-19T17:22:22.876000+00:00",
        "attachments": null
    },
    {
        "author": "m.bison5485",
        "category": "general",
        "parent": "",
        "content": "Hi All \u0026 thanks for the invite \u003c@!364458974906548225\u003e . Just applied to the program and looking forward to working with this community. I'm wrapping up my MSc in Computer Science and very excited to learn with you all!",
        "created_at": "2021-05-19T17:27:56.801000+00:00",
        "attachments": null
    },
    {
        "author": "delim_",
        "category": "general",
        "parent": "",
        "content": "Hello everyone, just submitted my application. Really looking forward to possible being apart of the ETH core dev team!",
        "created_at": "2021-05-19T19:50:32.676000+00:00",
        "attachments": null
    },
    {
        "author": "spiralglide",
        "category": "general",
        "parent": "",
        "content": "Welcome! Best of luck.",
        "created_at": "2021-05-19T20:01:54.060000+00:00",
        "attachments": null
    },
    {
        "author": "batu389",
        "category": "general",
        "parent": "",
        "content": "Hello all, my name is Batu. I just applied to the program. I am currently at the last year of my CS undergrad degree. Looking through the yellow paper now. Regardless of the program if you want to work on something together, I am here 🙂",
        "created_at": "2021-05-19T20:14:16.664000+00:00",
        "attachments": null
    },
    {
        "author": "jetjadeja",
        "category": "general",
        "parent": "",
        "content": "Hey there! I'm Jet, just applied yesterday. Current a freshman in HS and also working as a dev at Rari Capital (DeFi protocol on Ethereum). Ethereum, on a protocol level, has always interested me and I believe that this program is the perfect opportunity for me to learn more about it.",
        "created_at": "2021-05-19T20:30:56.620000+00:00",
        "attachments": null
    },
    {
        "author": "boop3247",
        "category": "general",
        "parent": "",
        "content": "Just submitted my application. Excited 😄",
        "created_at": "2021-05-19T21:24:59.067000+00:00",
        "attachments": null
    },
    {
        "author": "joshuaisbuilding",
        "category": "general",
        "parent": "",
        "content": "\u003c@456226577798135808\u003e \n\nRegarding your first project idea about creating a ETH 1.0 spec (https://github.com/ethereum-cdap/cohort-zero/blob/main/notes/francesco.md) I think a very relevant discussion was had on the EIPIP meeting today (https://youtu.be/BJ7X3csL9vc) around the 15 minute mark about this very thing. \n\n\u003c@552133098075193354\u003e this might be of interest to you?",
        "created_at": "2021-05-19T21:53:06.123000+00:00",
        "attachments": null
    }
]