[
    {
        "author": "akh4880",
        "category": "general",
        "parent": "",
        "content": "I also do high performance fluid dynamics simulations 👋 but on volcanoes. Happy to see other folks here.",
        "created_at": "2021-06-01T01:01:00.933000+00:00",
        "attachments": []
    },
    {
        "author": "xlrkoa",
        "category": "general",
        "parent": "",
        "content": "Neat! I have many people I know working with openfoam and Ansys. Though I do more nuclear interaction stimulations!",
        "created_at": "2021-06-01T01:03:58.954000+00:00",
        "attachments": []
    },
    {
        "author": ".themystery",
        "category": "general",
        "parent": "",
        "content": "Hey guys anyone looking for a partner to pursue the apprenticeship even if they are not officially part of the program?",
        "created_at": "2021-06-01T04:21:25.390000+00:00",
        "attachments": []
    },
    {
        "author": "peteorion21",
        "category": "general",
        "parent": "",
        "content": "\\",
        "created_at": "2021-06-01T05:31:29.942000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "I'm down",
        "created_at": "2021-06-01T06:05:28.558000+00:00",
        "attachments": []
    },
    {
        "author": "trent_vanepps",
        "category": "general",
        "parent": "",
        "content": "great! have you connected with the researchers working on this? there's also \u003c#824798757618188339\u003e, \u003c#739145593762611250\u003e, and other channels to check out!",
        "created_at": "2021-06-01T12:51:58.040000+00:00",
        "attachments": []
    },
    {
        "author": "seroze1",
        "category": "general",
        "parent": "",
        "content": "hi, would like to pair up",
        "created_at": "2021-06-01T13:01:57.490000+00:00",
        "attachments": []
    },
    {
        "author": "th4s_",
        "category": "general",
        "parent": "",
        "content": "Can somebody give me a quick recap on the v,r,s transaction fields",
        "created_at": "2021-06-01T13:35:43.141000+00:00",
        "attachments": []
    },
    {
        "author": "th4s_",
        "category": "general",
        "parent": "",
        "content": "in particular: do they have a fixed byte length?",
        "created_at": "2021-06-01T13:36:07.965000+00:00",
        "attachments": []
    },
    {
        "author": "th4s_",
        "category": "general",
        "parent": "",
        "content": "how do r and s map to elliptic curve points",
        "created_at": "2021-06-01T13:36:25.753000+00:00",
        "attachments": []
    },
    {
        "author": "th4s_",
        "category": "general",
        "parent": "",
        "content": "and what is v",
        "created_at": "2021-06-01T13:36:27.924000+00:00",
        "attachments": []
    },
    {
        "author": "th4s_",
        "category": "general",
        "parent": "",
        "content": "or point me to a good link 🙂",
        "created_at": "2021-06-01T13:36:51.535000+00:00",
        "attachments": []
    },
    {
        "author": "peter.davies",
        "category": "general",
        "parent": "",
        "content": "I'm interested in pairing up with someone regardless of whether I officially get into the program. Currently looking into verkle tries, but am very open to other areas.",
        "created_at": "2021-06-01T13:44:29.111000+00:00",
        "attachments": []
    },
    {
        "author": "peter.davies",
        "category": "general",
        "parent": "",
        "content": "\u003c@!848181786763984926\u003e I have similar interests to you, are you interested in working together on something?",
        "created_at": "2021-06-01T13:47:44.474000+00:00",
        "attachments": []
    },
    {
        "author": "dcgleason",
        "category": "general",
        "parent": "",
        "content": "Hello! Im interested in pairing up another individual interested in completing this program in the first cohort, with the idea that we might work together throughout the apprenticeship (whether we’re given the stipend or not). I’m a software developer with about 2 years of professional experience (JavaScript, React) mainly and am interested in learning by doing. Passionate about this space. Let me know! Thanks, all.",
        "created_at": "2021-06-01T14:18:20.299000+00:00",
        "attachments": []
    },
    {
        "author": "th4s_",
        "category": "general",
        "parent": "",
        "content": "figured it out 🙂 https://ethereum.stackexchange.com/questions/15766/what-does-v-r-s-in-eth-gettransactionbyhash-mean/15774",
        "created_at": "2021-06-01T14:26:20.164000+00:00",
        "attachments": []
    },
    {
        "author": "tanishqjasoria",
        "category": "general",
        "parent": "",
        "content": "Hello everyone, I am Tanishq.  I recently graduated college with a Masters in Mathematics and Computer Science.\nAt present, I am working as a Backend Developer at a startup, building algorithmic trading platform for cryptocurrencies. I have mainly worked with Python and NodeJS.\nI am quite new to Ethereum, i started exploring this field around 3 months back. I am interested in exploring, on the protocol level, how different parts in the Ethereum stack works and would love to contribute towards the improvement of the same.",
        "created_at": "2021-06-01T14:51:14.205000+00:00",
        "attachments": []
    },
    {
        "author": "emerald_654",
        "category": "general",
        "parent": "",
        "content": "Hi everyone, my name is Sean McCaffery and I’m currently a Software Engineer looking to get into Ethereum development! I’ve been involved with Ethereum since 2017 but only recently began considering making a career move into it, excited to learn with you all!",
        "created_at": "2021-06-01T17:39:34.623000+00:00",
        "attachments": []
    },
    {
        "author": "strollinghome",
        "category": "general",
        "parent": "",
        "content": "Hey all! I’m Carlos, I’ve worked as a backend/protocol engineer at Dharma for the past two years. I have experience developing in solidity for production systems. This is my last week at my current job and I will be exploring protocols and ideas over the next few months. I’m ready to dive deeper into the core of Ethereum, and I hope the apprenticeship program will help with that. Hit me up if you have any fun protocol ideas!",
        "created_at": "2021-06-01T18:30:03.461000+00:00",
        "attachments": []
    },
    {
        "author": "davidviodes9709",
        "category": "general",
        "parent": "",
        "content": "Hey everyone, I'm David Viodes. I'm an ex-restaurant worker turned Software Engineer. I attended a coding bootcamp, and once I graduated, I started learning about Blockchain technology. That eventually led me to learning about Ethereum development, and now here I am. Nice to meet you all.",
        "created_at": "2021-06-01T18:33:01.045000+00:00",
        "attachments": []
    },
    {
        "author": "rpavlovs",
        "category": "general",
        "parent": "",
        "content": "Hi everyone! I'm Roman and I'm a full-stack dev that have been doing various crypto projects since 2017. Some of them security related, others are tooling for the ecosystem, and lately better QR codes for in-person face-to-face transactions. Super excited to meet all of you!",
        "created_at": "2021-06-01T18:59:03.833000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Hey all, I'm Rami. I'm currently a 3rd year Computer Science student, primary a Backend Engineer trying to diversify into the Ethereum network. More than excited to get deeper into the Core Developer program and meet all the diverse individuals!",
        "created_at": "2021-06-01T19:16:23.875000+00:00",
        "attachments": []
    },
    {
        "author": "alex.sumner",
        "category": "general",
        "parent": "",
        "content": "Hi everyone, I'm Alex and I'm very pleased to meet you all! I'm a software developer, I've worked in a number of fields, languages and technology stacks. Over the last year I've become increasingly interested in blockchain in general and Ethereum in particular, and I'm looking forward to hopefully learning a lot more and making some contribution to it.",
        "created_at": "2021-06-01T19:20:00.619000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "general",
        "parent": "",
        "content": "Hello everyone, my name is Gavin and I am an electronics and communications engineer. I am also a student in National College of Ireland studying Computer Science, specialising in Blockchain technology. I have experience in various programming languages, including some hands-on experience with Solidity. I am excited to be a part of building upon these technologies as I believe it will bring the internet closer to what it should be; open. Playing a part in making Ethereum more secure, sustainable and  scalable would be extremely rewarding. It excites me to see so many people here eager to build the future.",
        "created_at": "2021-06-01T19:46:06.537000+00:00",
        "attachments": []
    },
    {
        "author": "czjp9450",
        "category": "general",
        "parent": "",
        "content": "Greetings! I'm Chris, currently a 4th year physics student and will begin pursuing my physics PhD beginning in the fall. I have worked on various projects utilizing Python, including data analysis and computer vision, and am experienced with C/C++ and Linux. I'm interested in Ethereum as the technology/community is extremely exciting, and I wish to contribute more of my time to understanding open protocols and decentralized p2p networks. Looking forward to seeing what people build!!",
        "created_at": "2021-06-01T19:57:40.786000+00:00",
        "attachments": []
    },
    {
        "author": "geoff5517",
        "category": "general",
        "parent": "",
        "content": "Hi All! I'm Geoff, an applied math PhD candidate from Toronto. I've been following Ethereum since 2017 and excited about the opportunity to contribute to the community. I mostly work with C++ and Python, having about five years experience with each, but I've recently gotten into Rust and have almost a year of experience there. I'm interested in finding solutions to the issue of MEV, if anyone shares this interest perhaps we could pair up!",
        "created_at": "2021-06-01T20:01:01.426000+00:00",
        "attachments": []
    },
    {
        "author": "xlrkoa",
        "category": "general",
        "parent": "",
        "content": "\u003c@!839891111962345482\u003e Toronto crew!",
        "created_at": "2021-06-01T20:01:30.340000+00:00",
        "attachments": []
    },
    {
        "author": "chazkiker",
        "category": "general",
        "parent": "",
        "content": "Hello everybody!\n\nI'm Chaz. My background is in full-stack web and software development, but I've had a long-lasting crush on blockchain and I'm super pumped to get involved in contributing to the inner-workings of Ethereum.\n\nFairly new to the development side of blockchain/crypto/Ethereum land but incredibly excited to learn more about the galaxy of Ethereum and apply my programming skills where it will prove helpful.",
        "created_at": "2021-06-01T20:11:23.686000+00:00",
        "attachments": []
    },
    {
        "author": "ov0o.",
        "category": "general",
        "parent": "",
        "content": "Hi everyone, \nI'm Hakeem. I'm a full-stack software engineer at Horse (a Shopify inventory management app). I had just started learning about Ethereum development, and have been a fan of blockchains for a few months now. I'm optimistic about web3, and I'm excited about taking a dive into Ethereum's technical details [and potentially positively contributing to it]. Nice to virtually meet you 🙏",
        "created_at": "2021-06-01T20:12:01.265000+00:00",
        "attachments": []
    },
    {
        "author": "carlosguso",
        "category": "general",
        "parent": "",
        "content": "Hi everybody! My name is Carlos and I'm a Full Stack Software Engineer working on both web and mobile products. Have a background in CS since high school starting with C language but currently using high level languages only, I'm glad to be here and happy that we all can be participating in the cohort repo",
        "created_at": "2021-06-01T20:49:28.949000+00:00",
        "attachments": []
    },
    {
        "author": "faazilaadmi",
        "category": "general",
        "parent": "",
        "content": "Hey everybody! My name is Mustafa, and I’m in my final year studying Applied Math and Computation. I have done some research for the Ethereum Foundation regarding EIP-1559 and would love to work on its implementation. If anybody else is interested in this, feel free to message me!",
        "created_at": "2021-06-01T21:00:36.929000+00:00",
        "attachments": []
    },
    {
        "author": "trent56566",
        "category": "general",
        "parent": "",
        "content": "Good evening everyone! My name is Trent Manager. I am a full-stack software engineer/Block-chain consultant at Intertec international (An IT \u0026 technical service company ). I have been investing in Ethereum since late 2019 and fell in love with the ecosystem. I've been working with solidity for about 8-10 months now, and I am very excited to have this opportunity to meet you all! It's not every day we get a new emerging asset class to take part in pleasure! to meet you all virtually",
        "created_at": "2021-06-01T21:03:41.127000+00:00",
        "attachments": []
    },
    {
        "author": "twiesenberg",
        "category": "general",
        "parent": "",
        "content": "Hi everyone, my name is Tally! I'm a computer science uni student and a junior solidity developer looking to develop a deeper, more low-level understanding of Ethereum. I started out my CS journey studying Data Science at a bootcamp, but I fell in love with the forward-thinking attitude of the Ethereum ecosystem, especially how it channels the energy of the CS giants it stands on the shoulders of (HTTP, IP, etc.). Definitely looking forward to meeting you guys!",
        "created_at": "2021-06-01T21:08:26.918000+00:00",
        "attachments": []
    },
    {
        "author": "0xdallascat",
        "category": "general",
        "parent": "",
        "content": "Hi everybody!  I'm Chris.  I come from a investing/research side of crypto since 2015.  I know some Python, C# (finance algo's) and been diving into Solidity and JavaScript recently.  I studied MIS/Econ in college (COBOL, Fortran, C++) and went for a masters in Finance, and that has been the majority of my career, with a pivot to primarily investing in Ethereum in a small LP since 2017ish.  I'm a Gen-X'er who did run a BBS in the 80's and college/grad school in the mid-late 90's....so I've been around the block a bit, but I admit I need to up more technical game (a lot, LOL).  Cheers!",
        "created_at": "2021-06-01T23:20:09.326000+00:00",
        "attachments": []
    }
]