[
    {
        "author": "zsluedem",
        "category": "general",
        "parent": "",
        "content": "Wow. That looks cool! But I never wrote .Net before. I need to take a look at the pr and try to comprehend the ideas and see if I am able to help with that. I would probably ping you again after I got enough knowledge. Thanks very much!",
        "created_at": "2022-11-04T01:29:24.116000+00:00",
        "attachments": []
    },
    {
        "author": "lukaszrozmej",
        "category": "general",
        "parent": "",
        "content": "better question is if you know some kind of assembly languages and EVM instructions as this is transpiling (compiling?) EVM bytecode to IL which is more like a high level assembly language (no registers ect.)",
        "created_at": "2022-11-04T07:24:32.100000+00:00",
        "attachments": []
    },
    {
        "author": "zsluedem",
        "category": "general",
        "parent": "",
        "content": "I have experiences with source code to ast and ast to IR(this kind of transpiling). I never worked with assembly language transpiling but I know some EVM instructions. I am not sure whether my experiences are gonna help with the project idea now. I am trying to figure that out.",
        "created_at": "2022-11-04T08:09:29.207000+00:00",
        "attachments": []
    },
    {
        "author": "lukaszrozmej",
        "category": "general",
        "parent": "",
        "content": "Feel free to try it out and see, there is no pressure here. If the end result would be progressing with it then that is fine, it doesn't have to end up with something in a shippable state. It might be too much work to get there in a short time. So it is more up to you if you want to pursue this path/task for now.",
        "created_at": "2022-11-04T13:01:30.892000+00:00",
        "attachments": []
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "just wanted to call out this message from \u003c#748530848470663208\u003e \n\nhttps://discord.com/channels/595666850260713488/748530848470663208/1038199780339355698\n\nif anyone here wants to make a very valuable contribution to ethereum, you can use this as an implementation guide to open a PR or two for this feature against the `staking-cli` repo",
        "created_at": "2022-11-04T21:16:36.151000+00:00",
        "attachments": []
    }
]