[
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "There is intention to run additional cohorts but nothing is guaranteed.  blog.ethereum.org is going to be the place to watch for new cohort announcements but nothing is currently scheduled.",
        "created_at": "2022-03-16T16:39:55.578000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Is there a measure of the success of the program?  I see that a few people that were in this program are in the protocol guild. Some writing/executing specification, others working with client teams. Do you personally think the time and effort was worth it? Does the EF (or whomever funded this)  think it was worth it? And perhaps the hardest to answer: did the protocol gain someone that wouldn't have been working otherwise by himself/herself?",
        "created_at": "2022-03-16T20:52:21.734000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "general",
        "parent": "",
        "content": "I think definitively yes, it was worth both my time and the money that was spent. I think that yes, there are people working on the protocol that wouldn't have been here otherwise and that there are people working at a higher level than they would have if they'd approached this on their own.  Lots of subjectivity in that analysis but also a good bit of hard evidence in the form of just seeing a real influx of new people and knowing that multiple people landed full time work. \n\nIt did cost me a lot. There's other complicating factors but I burned myself out a good bit during the program. Ended up spread too thin between too many things. Still recovering.",
        "created_at": "2022-03-16T21:33:16.036000+00:00",
        "attachments": []
    },
    {
        "author": "timbeiko",
        "category": "general",
        "parent": "",
        "content": "I'll +1 saying that my subjective impression is it was super valuable. The hardest bit is to find someone with the skill, time, and desire to do a good job leading it! We want to make sure we make it a good experience for folks",
        "created_at": "2022-03-16T22:06:51.762000+00:00",
        "attachments": []
    }
]