[
    {
        "author": "liquan.eth",
        "category": "general",
        "parent": "",
        "content": "Yeah, thanks to all of you for the great clarifications",
        "created_at": "2022-11-26T16:07:40.433000+00:00",
        "attachments": null
    },
    {
        "author": "wslyvh",
        "category": "general",
        "parent": "",
        "content": "If I’d start to write a spec for this, I assume that would mean an EIP as all clients need to agree/implement it? Would such a spec just standardize the naming of the APIs or usually also describes how it’s implemented?",
        "created_at": "2022-11-26T19:41:33.943000+00:00",
        "attachments": null
    },
    {
        "author": "wslyvh",
        "category": "general",
        "parent": "",
        "content": "I guess a simple, first step would be to just rename whatever clients implement themselves at the moment. Most have their own endpoints for it. Thus, we only need to standardizing naming?",
        "created_at": "2022-11-26T19:42:05.087000+00:00",
        "attachments": null
    },
    {
        "author": "ctrl_alt_lulz",
        "category": "general",
        "parent": "",
        "content": "\u003c@686695036733227017\u003e hi Mario! Following up on the automated testnet setup project. Is there a telegram chat room or side room for this to drop in? \n\nOn my end just released a bunch of utils that can help this project. Via the middleware it can download blockchain snapshots, and does BLS key gen, sign, verify, and for processes can suspend, kill, resume processes in containers, and query disk and memory stats. There’s also an in memdb for importing validators, which is still a wip. But it’ll be able to setup validator configs automatically soon as well. \n\nhttps://github.com/zeus-fyi/zeus\n\nEverything here is also Apache 2.0 Licensed.",
        "created_at": "2022-11-26T20:13:21.151000+00:00",
        "attachments": null
    },
    {
        "author": "ctrl_alt_lulz",
        "category": "general",
        "parent": "",
        "content": "Also if anyone has any spare Goerli testnet Ether would appreciate any you can send me. Wanted to do testing on setting up SSV validators and automated regular client validator deposits and imports.",
        "created_at": "2022-11-26T20:18:54.531000+00:00",
        "attachments": null
    }
]