[
    {
        "author": "behkod",
        "category": "general",
        "parent": "",
        "content": "Everything is publicly available. Plz consult the links already available in here as the starting point :\n\nhttps://discord.com/channels/595666850260713488/843176491386667018/1023659244014284891",
        "created_at": "2022-10-01T10:36:30.301000+00:00",
        "attachments": null
    },
    {
        "author": "behkod",
        "category": "general",
        "parent": "",
        "content": "But IMHO, if you haven't already read the Ethereum YP, make sure to read and thoroughly understand it (as well as appendices).",
        "created_at": "2022-10-01T10:40:13.575000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "I have never seen that YP, many core EL devs have not seen the consensus specs. You can perfectly contribute to protocol development without ever seeing the YP... There's only a handful of people that have technical knowledge of all aspects from EVM to forkchoice",
        "created_at": "2022-10-01T10:53:49.501000+00:00",
        "attachments": null
    },
    {
        "author": "kevinbogner",
        "category": "general",
        "parent": "",
        "content": "Hey just want to make sure I understood you right. I'm talking about the data analysis idea. The goal is to track the number of consensus clients and add a layer of events to show how the events might influence the number of clients(?) Until here, I'm following 🙂\n\nI didn't understand how it might be possible to spot 'network splits'.\nAre there 'only' block proposals and attestations interesting to display as events?\nWhat do you think about this quick draft I created to display this data?",
        "created_at": "2022-10-01T19:27:11.566000+00:00",
        "attachments": [
            {
                "type": "image/png",
                "origin_name": "unknown.png",
                "content": "b5de48e775c02deb044c0f6486c85a13c3f297c45445088dfcfc6d1c9d0ed2c8"
            }
        ]
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "This is good. I think any aggregation is useful. If there's any correlation between voting patterns of clients that would be nice. When there's an orphan block, did most prysm nodes vote for the orphaned one and LightHouse for the canonical one or was it just random. Are Nimbus nodes likely to vote late for blocks proposed by lighthouse or not, etc... If there's a split along client lines in the form of a consensus bug it'll be obvious. But there may be some peering issues that may lead to a statistically skewed voting and seeing this could be very interesting",
        "created_at": "2022-10-01T23:14:24.455000+00:00",
        "attachments": null
    }
]