[
    {
        "author": "kevinbogner",
        "category": "general",
        "parent": "",
        "content": "Is there something particular for the Browser tooling (https://github.com/eth-protocol-fellows/cohort-three/blob/master/projects/project-ideas.md#browser-tooling) that has been requested in the past and not yet built? \n\nI was brainstorming and came up with an interactive Ethereum roadmap for people to dig deeper into the topics (e.g., educational material, teams working on this milestone, repositories, ...). But this would be more of a gimmick than an actual 'tool,' and I'm unsure if there is even demand.",
        "created_at": "2022-09-30T11:17:05.646000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "There are a lot of viewers that would be very nice to have, \u003c@504202741933932544\u003e has built a nice forkchoice dump viewer. That takes a fixed dump. That idea can be further worked out also show you a \"history\" of the forkchoice view. I presume there are plenty of examples like this one that would be useful. One that could be a big-brother kind of data analysis would be to build a database of clients following sigma prime's https://github.com/sigp/blockprint and track live not only block proposals but attestations and use this to see if there are network splits across clients.  I'm talking about obscure applications that only few would use, but surely there are nicer visualization tools that more people would want to have",
        "created_at": "2022-09-30T11:25:04.767000+00:00",
        "attachments": null
    },
    {
        "author": "kevinbogner",
        "category": "general",
        "parent": "",
        "content": "Thank you, your idea sounds way more gripping than mine :). Nicer visualization might target a bigger audience, but the client comparison sounds more enjoyable. Blockprint also looks interesting. I will definitely take a closer look.",
        "created_at": "2022-09-30T11:48:53.418000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "cc \u003c@602753420033785856\u003e who may have nice ideas of applications of blockrpint",
        "created_at": "2022-09-30T11:49:44.569000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "\u003c@181594452228308992\u003e had a nice idea to pipe the forkchoice view through to grafana streams (i think that's what its called?), so you could rely on prometheus/grafana for historic info storage and check how forkchoice evolved in the past.",
        "created_at": "2022-09-30T12:33:05.655000+00:00",
        "attachments": null
    },
    {
        "author": "kevinbogner",
        "category": "general",
        "parent": "",
        "content": "https://github.com/tbenr/protovis that's the forkchoice viewer you are talking about, right?",
        "created_at": "2022-09-30T13:24:55.263000+00:00",
        "attachments": null
    },
    {
        "author": "parithosh",
        "category": "general",
        "parent": "",
        "content": "Yup 🙂",
        "created_at": "2022-09-30T13:33:32.875000+00:00",
        "attachments": null
    },
    {
        "author": "phas0ruk",
        "category": "general",
        "parent": "",
        "content": "Hi are we meant to have heard about follow up meetings by now? Thanks",
        "created_at": "2022-09-30T16:11:10.058000+00:00",
        "attachments": null
    },
    {
        "author": "joshd4078",
        "category": "general",
        "parent": "",
        "content": "The majority of follow-up status emails have been sent out. There are still about 15% that are still under review. If you have not received an email yet, please check your alternate folders (Spam, Promotions, etc). Remaining emails should be out by the end of day or Monday at the latest.",
        "created_at": "2022-09-30T16:15:23.929000+00:00",
        "attachments": null
    },
    {
        "author": "catthu",
        "category": "general",
        "parent": "",
        "content": "\u003c@914307919699406908\u003e I did not submit an application but still curious to participate (no funding needed). Is there anything publicly available to read?",
        "created_at": "2022-09-30T22:49:33.521000+00:00",
        "attachments": null
    }
]