[
    {
        "author": "manavgarg",
        "category": "general",
        "parent": "",
        "content": "Yep, it would be great if any updates can be shared. Also, would be able to join the devs calls? I see some proposed projects and wold like to work on one of them and was wondering if i can still somehow contribute even if i am not selected.",
        "created_at": "2022-09-26T02:00:06.374000+00:00",
        "attachments": []
    },
    {
        "author": "ameya",
        "category": "general",
        "parent": "",
        "content": "Thanks a ton",
        "created_at": "2022-09-26T07:58:40.309000+00:00",
        "attachments": []
    },
    {
        "author": "kevinbogner",
        "category": "general",
        "parent": "",
        "content": "Yes, everything is open for everyone willing to contribute. The selection process 'only' decides if you are eligible for funding from the start. If you do good work, you might also get a stipend.\n\nhttps://discord.com/channels/595666850260713488/843176491386667018/1020723681095335976",
        "created_at": "2022-09-26T09:19:07.237000+00:00",
        "attachments": []
    },
    {
        "author": "stevensteven0",
        "category": "general",
        "parent": "",
        "content": "hello I want to make partnership with you guys who should I contact with ?",
        "created_at": "2022-09-26T14:35:52.201000+00:00",
        "attachments": []
    },
    {
        "author": "joshd4078",
        "category": "general",
        "parent": "",
        "content": "Hey fellowship channel! I realized that I haven't introduced myself. My name is Josh and I'll be helping to run EPF. If you have any questions or comments, feel free to tag me in this channel and I'll do my best to get back to you ASAP (I just turned on my notifications 😅)",
        "created_at": "2022-09-26T16:43:36.782000+00:00",
        "attachments": []
    },
    {
        "author": "joshd4078",
        "category": "general",
        "parent": "",
        "content": "As you know, we stopped accepting applications on Friday, September 16th. We had a record number of applications (618!) come in for this cohort and spent the last week parsing through them.",
        "created_at": "2022-09-26T16:47:12.016000+00:00",
        "attachments": []
    },
    {
        "author": "joshd4078",
        "category": "general",
        "parent": "",
        "content": "We have begun to set up and conduct interviews. You should know within the next couple of weeks whether or not you will be asked for an interview.",
        "created_at": "2022-09-26T16:49:11.088000+00:00",
        "attachments": []
    },
    {
        "author": "joshd4078",
        "category": "general",
        "parent": "",
        "content": "However, interview are only for those candidates that we will be offering funding to. Everyone is invited to participate in the Fellowship, even if you are not asked for a follow-up interview. We are also reserving funds to allocate part way through the program for those unfunded fellows that are doing exemplary work.",
        "created_at": "2022-09-26T16:51:42.556000+00:00",
        "attachments": []
    },
    {
        "author": "minervini2",
        "category": "general",
        "parent": "",
        "content": "Thanks for the update. Re: \"You should know within the next couple of weeks whether or not you will be asked for an interview.\", will candidates receive a followup in both cases? Or no interview == no followup?",
        "created_at": "2022-09-26T17:27:00.449000+00:00",
        "attachments": []
    },
    {
        "author": "aga7hokakological",
        "category": "general",
        "parent": "",
        "content": "Everyone will get a mail saying if they pass or fail",
        "created_at": "2022-09-26T17:28:17.416000+00:00",
        "attachments": []
    },
    {
        "author": "joshd4078",
        "category": "general",
        "parent": "",
        "content": "Yes, we will send out mail to everyone (in addition to a request to joining the google group for further communications)",
        "created_at": "2022-09-26T17:32:10.870000+00:00",
        "attachments": []
    },
    {
        "author": "manavgarg",
        "category": "general",
        "parent": "",
        "content": "Have one follow up question: for folks working on their own without funding, would there be a forum to reach out to mentors for help or share updates? Is the google group gonna be for that?",
        "created_at": "2022-09-26T23:19:05.372000+00:00",
        "attachments": []
    }
]