[
    {
        "author": "j.lw",
        "category": "general",
        "parent": "",
        "content": "This isn't exactly what you are looking for, but you may find these helpful: https://github.com/J-Lw/cohort-four/blob/master/program-guide/program-details.md#phase-one https://github.com/J-Lw/cohort-four/blob/master/program-guide/repo-guide.md",
        "created_at": "2023-06-16T12:39:27.950000+00:00",
        "attachments": []
    },
    {
        "author": "eniko1555",
        "category": "general",
        "parent": "",
        "content": "I'm glad to be here. I discovered the fellowship program a few days ago, and I'm still working on my application. \nAs I'm late, I am still determining what project I want to work on. Does that have any implications for the application?",
        "created_at": "2023-06-16T12:52:48.738000+00:00",
        "attachments": []
    },
    {
        "author": "j.lw",
        "category": "general",
        "parent": "",
        "content": "As far as I'm aware, phase one and two of the program are focused on learning and defining a deliverable project. In other words, you're on track, so not knowing what exactly you want to do for a project is shouldn't carry significant weight on your application. That said, it is probably smart to do a bit of reading so that you can answer the question \"what area of the protocol would you like to work on\" in an educated way.",
        "created_at": "2023-06-16T12:58:39.265000+00:00",
        "attachments": []
    },
    {
        "author": "eniko1555",
        "category": "general",
        "parent": "",
        "content": "Oh, good to hear. Yes, I will do the required research soon, just two days it's too short for that 😢",
        "created_at": "2023-06-16T13:01:29.456000+00:00",
        "attachments": []
    },
    {
        "author": "j.lw",
        "category": "general",
        "parent": "",
        "content": "Good luck! 😄",
        "created_at": "2023-06-16T13:02:15.898000+00:00",
        "attachments": []
    },
    {
        "author": "joshd4078",
        "category": "general",
        "parent": "",
        "content": "Much of the conversation happens in this channel or in private discussions between fellows. We will go over this in the first stand-up meeting of the cohort. You are not required to have a project decided in order to submit an application.",
        "created_at": "2023-06-16T15:55:24.243000+00:00",
        "attachments": []
    }
]