[
    {
        "author": "advaitasaha",
        "category": "general",
        "parent": "",
        "content": "\u003c@774033563732541451\u003e seems like the square root I did using *Tonelli-Shanks* Algo is becoming a bottleneck.\nHow did you solve this?",
        "created_at": "2023-10-04T03:56:05.681000+00:00",
        "attachments": []
    },
    {
        "author": "jsign",
        "category": "general",
        "parent": "",
        "content": "[sidenote: I think you stopped refering to point serialization, right? sqrt of finite field elements isn't needed for that, but for point deserialization. mentioning just in case]\n\nThe story on how we have a fast sqrt for go-ipa mainly summaries as I getting in a rabbit hole, reverse engineering some really clever idea that Gottfried did in another repo after some Twitter discussion (funny...)\nBack in march when this happened, I knew this was going to be too important for other cryptography libs to consider for VKTs, so I wrote an article explaining how all this works: https://ihagopian.com/posts/tonelli-shanks-with-precomputed-dlog-tables (the intro has the Twitter story...)\n\nSo I wrote that for some reasons: 1) It could be useful for other people in the future (like you today), 2) For \"future me\" if I want to go back to remembering all this 😅  3) Hopefully nobody had to reverse engineer how this works by reading code again.",
        "created_at": "2023-10-04T10:34:50.422000+00:00",
        "attachments": []
    },
    {
        "author": "advaitasaha",
        "category": "general",
        "parent": "",
        "content": "Yes serialisation was fine,  not much of a significant difference \nBut deserialisation was ( as I tried benchmarking in the go-ipa ), it seems *Tonelli-Shanks* Algo is around 10x slow.\n\nThanks for putting up this blog together with all the resources. Will optimize the sqrt in Nim in the coming days.",
        "created_at": "2023-10-04T10:41:07.324000+00:00",
        "attachments": []
    },
    {
        "author": "devaviral",
        "category": "general",
        "parent": "",
        "content": "how to get a single day's ethereum blocks and execute the transactions and contracts? hard way is to sync a node yourself but that requires 1 TB space which I dont have and I am on macboook so not sure if thats possible. please help",
        "created_at": "2023-10-04T13:51:06.646000+00:00",
        "attachments": []
    }
]