[
    {
        "author": "mason.mind",
        "category": "general",
        "parent": "",
        "content": "like it. well written",
        "created_at": "2023-08-25T00:56:27.365000+00:00",
        "attachments": null
    },
    {
        "author": "eniko1555",
        "category": "general",
        "parent": "",
        "content": "Yes, me too!",
        "created_at": "2023-08-25T05:04:33.075000+00:00",
        "attachments": null
    },
    {
        "author": "wzht",
        "category": "general",
        "parent": "",
        "content": "\u003c@686695036733227017\u003e I've already done my presentation but I'm tempted to record a re-presentation (like a screencast) as I felt I didn't do the best job last time, that would be completely async.",
        "created_at": "2023-08-25T06:48:23.942000+00:00",
        "attachments": null
    },
    {
        "author": "cyberroninn",
        "category": "general",
        "parent": "",
        "content": "this is useful, thank you!",
        "created_at": "2023-08-25T09:02:10.805000+00:00",
        "attachments": null
    },
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "Sure feel free to do so! Just record it and share it here. You can also link it in your project proposal",
        "created_at": "2023-08-25T09:10:17.452000+00:00",
        "attachments": null
    },
    {
        "author": "joohhnnn8",
        "category": "general",
        "parent": "",
        "content": "🙋willing to sign up",
        "created_at": "2023-08-25T11:17:57.847000+00:00",
        "attachments": null
    },
    {
        "author": "sogol_malek",
        "category": "general",
        "parent": "",
        "content": "hello All, happy Friday. Im working on a project, that can solve efficient state access for stateless execution on Ethereum in general. (still all previous components (state provider and verifier i presented are part of this\" HOW\") I summarized my entire work here and would highly appreciate comments to improve it: https://ethresear.ch/t/efficient-stateless-ethereum-execution/16480?u=sogolmalek   TL;DR: Light clients struggle to efficiently access and validate data on the mainnet due to challenges in obtaining concise witness proofs. Verkle trees help lightweight clients transition between blocks but can’t prove new state accuracy. Stateless clients lack state data for actions beyond transitioning. The Portal Network doesn’t fully address these issues. Our solution adds entities to the stateless verifier LC on the Portal Network with a cache to store important state fragments. We distribute the latest state using zero-knowledge proofs and propose a chase mechanism for efficient data retrieval. This addresses challenges in accessing state data for tasks like gas estimation and enhances lightweight client efficiency.",
        "created_at": "2023-08-25T13:53:34.835000+00:00",
        "attachments": null
    }
]