[
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "",
        "created_at": "2023-08-06T00:06:35.359000+00:00",
        "attachments": []
    },
    {
        "author": "ltfschoen",
        "category": "general",
        "parent": "",
        "content": "Hey Sogol, i'm researching zkOracle, they use a Light Client to verify the ZKP of zkPoS Attestation (verifiy consensus with single zkPoS Proof by retrieving data trustlessly from each block header) \n* https://mirror.xyz/hyperoracleblog.eth/lAE9erAz5eIlQZ346PG6tfh7Q6xy59bmA_kFNr-l6dE\n* https://docs.hyperoracle.io/\n* https://github.com/hyperoracle\ni'm still creating notes and trying to understand it all, but from what i've read they mentioned somewhere they they were using Helios light client https://github.com/a16z/helios to securely obtain the Ethereum block headers as input to their zkPoS (part of their zkOracle) since its a zkSNARK-based light client with off-chain computation that offers the benefit of eliminating most client verification computation (i can't remember where i read that by it's in my notes)\n\ninterestingly the Helios light client appears to have been done in the last Cohort 3 https://github.com/eth-protocol-fellows/cohort-three/blob/master/projects/helios-cl-p2p.md",
        "created_at": "2023-08-06T01:54:30.542000+00:00",
        "attachments": []
    },
    {
        "author": "namngrg",
        "category": "general",
        "parent": "",
        "content": "Hey Mario, please help me with this. Thanks!",
        "created_at": "2023-08-06T03:43:18.681000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "Why not ping them directly in their Discord?",
        "created_at": "2023-08-06T10:08:17.446000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "The Nimbus team is pretty approachable, this channel is high volume and they may not be monitoring it",
        "created_at": "2023-08-06T10:08:43.939000+00:00",
        "attachments": []
    },
    {
        "author": "namngrg",
        "category": "general",
        "parent": "",
        "content": "Cool thanks will do that",
        "created_at": "2023-08-06T10:16:27.202000+00:00",
        "attachments": []
    },
    {
        "author": "sogol_malek",
        "category": "general",
        "parent": "",
        "content": "thank you so much \u003c@606415134348541952\u003e for sharing this! ive already started implementing helios library into my entitiy too! ill commit my code scope next week, yes this is very interesting and ofc helpful for what I aim to do, basically is to solve the problem for light clients. Currently, to validate a block, light clients must request the state piece by piece, and this results in many light clients frequently burdening the full node altogether. and having an entity \"state provider\" consist of peer-to-peer netwrok for conensus on latest stae, zkcircuit to make a zkp of latest state and the  helios LC to query the state can solve the problem, simply bc it will be easy to spread the state across all cleints at once: My work update here:https://github.com/sogolmalek/EIP-x/issues",
        "created_at": "2023-08-06T10:46:30.693000+00:00",
        "attachments": []
    }
]