[
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "\u003c@\u0026857649635274915900\u003e New Office Hours just dropped! After strong EL session yesterday, the next AMA session will take us to consensus waters because will be joined by Michael Sproul from Lighthouse. Whether you are working on LH, something CL related or just using rust, I am sure you can come up with some interesting questions for him.\n\n**IMPORTANT NOTICE:** This Office Hours will be in a different time than others. Because Michael is based in Australia, this session will be at 11AM UTC, 4 hours earlier than normally. It might benefit those fellows in eastern time zones who normally cannot make it to these calls 🙂 \n\nhttps://github.com/eth-protocol-fellows/cohort-four/issues/377",
        "created_at": "2023-09-20T09:16:39.945000+00:00",
        "attachments": null
    },
    {
        "author": "bchain99",
        "category": "general",
        "parent": "",
        "content": "hey folks, i wrote some code to trace a tx and check what it does. e.g a lot of uniswap txs are done as part of a smart contract call. so its hard to tell if a tx is a uniswap swap or not just by the tx data field. to solve this, i used the call tracer(debug_traceCall) to fetch the tx traces, iterate thru the traces and check if it matches a particular smart contract call by checking the input field for the method id. I also added a method to unpack the args of a tx from its data field only https://github.com/bharath-123/pepc-boost-testing/tree/tx-data-checks-using-tracing",
        "created_at": "2023-09-20T13:03:54.070000+00:00",
        "attachments": null
    },
    {
        "author": "bchain99",
        "category": "general",
        "parent": "",
        "content": "i thought it could be of some use to folks here 🙂 havent written a README, if ppl are interested I can write up a README",
        "created_at": "2023-09-20T13:04:24.571000+00:00",
        "attachments": null
    },
    {
        "author": "joshd4078",
        "category": "general",
        "parent": "",
        "content": "If you haven't followed the AMA follow-up thread from yesterday, \u003c@543900561460822016\u003e dropped some amazing insight and advice about the journey to becoming a core dev. The highlight for me is this...\n\n\u003e ...pick up some of the less fun tasks and do them well. I feel like one fatal flaw is that bc EPF is self driven, people work on shiny things. Which is cool and great. There is a lot of value in working on things where the \"mindshare\" is, because you have people who are thinking about the problem around the clock with you. But it's hard and competitive and sometimes not much comes from it. Digging into some deep spec tests, writing conformance tests, pushing standards forward, finding/fixing bugs, etc. This is really what the life of core devs mostly are!",
        "created_at": "2023-09-20T16:50:59.006000+00:00",
        "attachments": null
    }
]