[
    {
        "author": "tmiychao",
        "category": "general",
        "parent": "",
        "content": "The idea from the slide is about creating zk circuits which are able to prove the EVM execution, basically redoing all EVM behavior in a zk native virtual machine. This is totally possible, it's been done by multiple zkEVM teams like Linea, Scroll, Hermez... But the point Optimism communicates here is that these solutions always come with certain trade-off (complexity, compatibility, expensive proofs..) because EVM itself is very zk unfriendly, it's expensive to generate the prove of all state transitions. It will always be hard to generate those proves and the point of zk rollups is the asymmetry of very easy verification compared to expensive generation. So offchain, somebody generates proof which can take even hours to calculate (might be centralized) but you have onchain contract which can easily verify it for relatively little gas (solving trustlessness). So the block gas limit is not a question here, it's feasibility of proving all EVM in zk which is doable, not easy, but in the end can bring more scale than optimistic approach..",
        "created_at": "2023-07-22T10:59:17.342000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "If anyone is interested in working on any of the execution-api related projects, i opened a telegram to further discuss so respond here with you tg name and i will add you",
        "created_at": "2023-07-22T13:32:22.133000+00:00",
        "attachments": null
    },
    {
        "author": "0xunclebill",
        "category": "general",
        "parent": "",
        "content": "my tg is @unclebills",
        "created_at": "2023-07-22T13:37:22.802000+00:00",
        "attachments": null
    },
    {
        "author": "agnxsh",
        "category": "general",
        "parent": "",
        "content": "hi \u003c@785811170387951616\u003e is my tg",
        "created_at": "2023-07-22T16:24:08.794000+00:00",
        "attachments": null
    },
    {
        "author": "ademola.",
        "category": "general",
        "parent": "",
        "content": "Hey. I’m @Ademola1145 on telegram",
        "created_at": "2023-07-22T17:14:48.343000+00:00",
        "attachments": null
    }
]