[
    {
        "author": "sogol_malek",
        "category": "general",
        "parent": "",
        "content": "GM GM EPF Community! just removing it for now to prevent confusions for now",
        "created_at": "2023-10-01T08:44:01.137000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "why would 1153 be relevant in zkp verification? as far as i understand it, zkp verification is simply an expensive cryptographic operation. i dont see why the computation would be split across multiple contracts ( the main use for 1153 ) as the call overhead would certainly add up",
        "created_at": "2023-10-01T17:29:44.123000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "also in the doc you have a \"specification\" section - the purpose of this section is to fully explain a proposal so that an implementer may, with no outside resources, implement the proposal. in your doc it is not clear what the proposal is nor how to implement it",
        "created_at": "2023-10-01T17:33:18.438000+00:00",
        "attachments": null
    },
    {
        "author": "danielrachi",
        "category": "general",
        "parent": "",
        "content": "Hi everyone,\n\nI wrote an article explaining how Lighthouse starts a Beacon Node, focusing on its interactions with the Execution Engine. I hope some of you can find it useful `:)` \n\nhttps://hackmd.io/@danielrachi/S1u2Veflp",
        "created_at": "2023-10-01T17:51:34.091000+00:00",
        "attachments": null
    },
    {
        "author": "sogol_malek",
        "category": "general",
        "parent": "",
        "content": "thanks \u003c@543900561460822016\u003e for the comment, actually i need to provide the whole concept and problem we faced when we thought of stateless relay for Flashbot to make this sub proposal meaningful , ill share entire journey of thoughts  with you to  make it clear. i could solve my problem in current work with escrow but thought in long term this can be better solution",
        "created_at": "2023-10-01T17:58:04.125000+00:00",
        "attachments": null
    },
    {
        "author": "sogol_malek",
        "category": "general",
        "parent": "",
        "content": "mind if we could set up a call?  \u003c@543900561460822016\u003e",
        "created_at": "2023-10-01T18:00:50.098000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "nice overview of the start up process!\n\n\u003e I don’t know how far can a CL client go only with those endpoints.\nIt wont actually go very far unfortunately - i would curious to understand exactly what happens in lighthouse after the initial fcu, but eventually it is going to start sending `newPayloadV2` to the EL. This is how the CL uses the EL to ensure the validity of the execution payload. If you're trying to implement this on a portal client, you will need i) and EVM and ii) to implement state look ups for execution.\n\nThis might be difficult given the latency of pushing state into portal. I dont on the top of mind remember what the timeout for newpayload is.",
        "created_at": "2023-10-01T18:06:01.903000+00:00",
        "attachments": null
    },
    {
        "author": "lightclient",
        "category": "general",
        "parent": "",
        "content": "im not sure there is much use in a call, i would like to see a much more fleshed out idea and spec first before i can provide any constructive feedback",
        "created_at": "2023-10-01T18:06:50.816000+00:00",
        "attachments": null
    },
    {
        "author": "danielrachi",
        "category": "general",
        "parent": "",
        "content": "Thanks!",
        "created_at": "2023-10-01T22:27:25.844000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "This is client dependent, we set it at 12 seconds on prysm if I recall correctly, but most probably all Els timeout earlier",
        "created_at": "2023-10-01T23:54:43.588000+00:00",
        "attachments": null
    }
]