[
    {
        "author": "advaitasaha",
        "category": "general",
        "parent": "",
        "content": "That's really interesting",
        "created_at": "2023-07-14T02:55:48.119000+00:00",
        "attachments": []
    },
    {
        "author": "devaviral",
        "category": "general",
        "parent": "",
        "content": "Is the next office hour only for the fellowship peeps?",
        "created_at": "2023-07-14T05:37:04.877000+00:00",
        "attachments": []
    },
    {
        "author": "ngweihan_eth",
        "category": "general",
        "parent": "",
        "content": "I believe it was stated that all participants may join, regardless official fellow or not",
        "created_at": "2023-07-14T05:44:36.271000+00:00",
        "attachments": []
    },
    {
        "author": "devaviral",
        "category": "general",
        "parent": "",
        "content": "Hey \u003c@358120958726373381\u003e , I have sent you a friend req. Wanted to ask you somethings",
        "created_at": "2023-07-14T06:48:03.110000+00:00",
        "attachments": []
    },
    {
        "author": "agnxsh",
        "category": "general",
        "parent": "",
        "content": "this one is really good",
        "created_at": "2023-07-14T09:36:14.855000+00:00",
        "attachments": []
    },
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "As all every EPF call, it's public and opened 🙂",
        "created_at": "2023-07-14T10:08:41.467000+00:00",
        "attachments": []
    },
    {
        "author": "phklive",
        "category": "general",
        "parent": "",
        "content": "Hey \u003c@914307919699406908\u003e  \u0026 \u003c@686695036733227017\u003e thought i'd post here so everyone can maybe benefit from your answer.\n\nCan you provide some advice on the best practices a participant should follow to maximize their benefit from this program?\n\nFor example things you saw from previous cohort members that you thought \"That's really nice\" and that enabled them to succeed.\n\nOr just general advice too.",
        "created_at": "2023-07-14T10:19:02.070000+00:00",
        "attachments": []
    },
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "Hey \u003c@290199767961567243\u003e! \n\nIt's a good question but honestly, I am not that sure about the answer because it really depends on what YOU want to get out of the program. It's completely individual and each participant might be looking for different kind of benefit for himself - learning, making connections, building a successful project... But generally, it's all about your work and dedication. Whatever your goal is, the common denominator is that you are able to actually put the work towards it and be able to do it by yourself, independently. \n\nI believe we explained best practices on the call yesterday - taking the time for proper research to identify what contributions are needed, sharing your work by digestible regular updates, etc.. There is no single thing to do or a hack to get through it, just dedication and constant attention to your project. As an endgoal, from my point of view, the most benefiting outcome is creating a valuable contribution in the ecosystem, using it to demonstrate your skills and ultimately getting hired by one of the core teams based on that.",
        "created_at": "2023-07-14T15:59:16.337000+00:00",
        "attachments": []
    },
    {
        "author": "phklive",
        "category": "general",
        "parent": "",
        "content": "Perfect, thanks a lot.\n\nLet's do it!",
        "created_at": "2023-07-14T20:17:53.182000+00:00",
        "attachments": []
    }
]