[
    {
        "author": "tmiychao",
        "category": "general",
        "parent": "",
        "content": "Here you go folks, recording from AMA with Justin! \nhttps://drive.google.com/file/d/1JHqwDUXzOiOMvIlJrdcS5HAGbuUVD-rA/view?usp=sharing\n(my mic is muted but everyone else works)",
        "created_at": "2023-10-25T08:29:35.063000+00:00",
        "attachments": null
    },
    {
        "author": "tmiychao",
        "category": "general",
        "parent": "",
        "content": "\u003c@\u0026857649635274915900\u003e The last AMA at Office Hours is here! You can look forward to chat with Barnabé, leader of EF's RIG team. Barnabé is always excited for EPF mentoring and I am sure many of you already have been in touch with him. He is the person to talk to especially if you are interested in cryptoeconomics, MEV, censorship resistance, consensus layer security etc. Join us regular time next week! https://github.com/eth-protocol-fellows/cohort-four/issues/495",
        "created_at": "2023-10-25T16:24:13.554000+00:00",
        "attachments": null
    },
    {
        "author": "tmiychao",
        "category": "general",
        "parent": "",
        "content": "\u003c@\u0026857649635274915900\u003e And I got some more important updates for you all about the last Office Hours and cohort wrap up. \n\nThe call with Barnabé will be the last AMA session but then there will be one more Office Hours call. This last one, November 7th, is dedicated to final project presentations from all of you who cannot make it to Devconnect. EPF Day is dedicated to presenting your projects but if you are not coming there, we still want to hear about your project! Prepare a short presentation, 10 min, summarizing your activity in EPF and final state of the project. Sign up to present in the Office Hours issue and check more details there: https://github.com/eth-protocol-fellows/cohort-four/issues/496. Please reach out if you have any questions! \n\nThe cohort ends by the middle of November, in less than three weeks. During these weeks, please feel free to share your regular dev updates as always. They should fit the Week 16 column in the markdown table and if you have extra updates, feel free to add a column! Even when EPF is over and you are still working on a project, you can continue using the repo, adding notes or updates. It's totally permissionless and we would be glad to still follow your progress! 🙂 \n\nHowever, we expect to see a Final Dev Update from each of you folks 👇",
        "created_at": "2023-10-25T16:30:44.690000+00:00",
        "attachments": null
    },
    {
        "author": "tmiychao",
        "category": "general",
        "parent": "",
        "content": "There is one more table at the bottom of the dev updates doc. This one is for your **Final Dev Update**. The final update is a report summarizing your activity during the program, it serves to reflect on your project and participation. \n\nFor the final dev update, here is a loose structure you should keep in mind when writing it:\n- Project abstract and link to the updated project doc with all details (your document in `/projects`)\n- Status report about state of the project, overview of roadmap - finished/unfinished tasks, changes of plans, current usability, etc\n- Future of the project - potential next steps, improvements, use cases \n- Self-evaluation, general feedback about your project and activity within EPF \n- Feedback about EPF, your takeaways from the program, don't worry to mention both the good and bad \n\nUse the last markdown table in the `development-updates` document to share it, I will also open a thread as always. Regarding a deadline for the final dev update, we are hoping to see it before Devconnect. Note that it's mandatory for participants who are receiving stipends but anybody who participated should share their outcomes. Hope it's clear and if you are unsure about anything, please just go ahead and ask 🙂",
        "created_at": "2023-10-25T16:31:10.835000+00:00",
        "attachments": null
    },
    {
        "author": "bchain99",
        "category": "general",
        "parent": "",
        "content": "hey folks have put out a tweet briefly describing a couple of blocks produced by the PEPC-Boost relay 🙂 do take a look when free https://twitter.com/BharathVedarth1/status/1717252057160175667",
        "created_at": "2023-10-25T18:51:56.788000+00:00",
        "attachments": null
    }
]