[
    {
        "author": "angaz",
        "category": "general",
        "parent": "",
        "content": "I have an idea for a project. One of the issues I had setting up a node was verifying that I had set up the port forwarding correctly. The port scanner services told me it was configured correctly, but it actually wasn't because the router was dumb. So I was thinking that I can work on a library/tool/service which you can ask to test all the various port configurations remotely so you know that you've set it up correctly. I think it would be best to do the whole handshake connection with the various clients to make sure the whole setup is correct. And the library part I think would be nice so this can be run from the machine running the nodes in the CLI or integrated into a node stack like rocketpool or whatever. Maybe also adding some security checks like making sure you haven't accidentally exposed the RPC and such.",
        "created_at": "2023-07-30T11:26:58.312000+00:00",
        "attachments": null
    },
    {
        "author": "angaz",
        "category": "general",
        "parent": "",
        "content": "And once we have the tool, we could do some research to see how many nodes have their port forwarding properly configured. Sounds like it could be interesting. And the service/website can make a nice interface to display the suggested configurations for the configuration you want to set up, maybe show the network statistics from the research and scans and such.",
        "created_at": "2023-07-30T11:28:44.073000+00:00",
        "attachments": null
    },
    {
        "author": "wzht",
        "category": "general",
        "parent": "",
        "content": "What you're describing already exists; it's software called `nmap`. You could possibly provide a nice interface to it as you mention in your second message, and perhaps also describe any custom TCP protocols which `nmap` can accept via it's `--scanflags` argument.\n\nAlso running a port scan without permission is seen as malicious activity so I'd be careful about how you present such a tool and so on.",
        "created_at": "2023-07-30T12:04:42.178000+00:00",
        "attachments": null
    },
    {
        "author": "angaz",
        "category": "general",
        "parent": "",
        "content": "Yeah you can use many such Linux tools `nc`, `telnet` are some others. But how does someone who is new to running a node and Linux verify that they have done it correctly? Does everyone have a remote server which they can scan the ports? Did they remember to open UDP? It's not the most straightforward process.",
        "created_at": "2023-07-30T12:09:13.656000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "general",
        "parent": "",
        "content": "It is also not necessary at all to have open ports. Having said so, Linux distribution package managers for all clients, windows and mac os installers, etc, would be an awesome project for the EPF",
        "created_at": "2023-07-30T12:11:00.494000+00:00",
        "attachments": null
    },
    {
        "author": "wzht",
        "category": "general",
        "parent": "",
        "content": "I'm more alluding to the reimplementation of something speaking over a network. Using existing (and proven) software like `nmap`, `zmap`, `nc`, `telnet`, `curl` etc would be better and as you say and we both agree: a frontend to those applications specific to Ethereum that is simpler for users would be great and is key.",
        "created_at": "2023-07-30T12:26:52.881000+00:00",
        "attachments": null
    },
    {
        "author": "wzht",
        "category": "general",
        "parent": "",
        "content": "I haven't checked it out in detail but \u003c@\u0026652918665943056397\u003e has a tool regarding node setup which you could probably add all these network checks to and so forth?\n\nIt's here: https://github.com/NethermindEth/sedge",
        "created_at": "2023-07-30T12:27:44.087000+00:00",
        "attachments": null
    },
    {
        "author": "agnxsh",
        "category": "general",
        "parent": "",
        "content": "hi i've used `sedge` before, it offers a lot of customization while client setup for chains like `goerli, sepolia, gnosis, and mainnet` but it doesn't have 2 options as of yet, the one you're talking about `nmap, zmap, telnet, curl`, and any private evm compatible chain based on the the `rpc url and chain ID`",
        "created_at": "2023-07-30T13:38:20.325000+00:00",
        "attachments": null
    },
    {
        "author": "agnxsh",
        "category": "general",
        "parent": "",
        "content": "or any other evm compatible chain for that matter",
        "created_at": "2023-07-30T13:40:56.578000+00:00",
        "attachments": null
    },
    {
        "author": "angaz",
        "category": "general",
        "parent": "",
        "content": "Yeah a library to talk to the API was part of my plan there. So it can be included in this project as well.",
        "created_at": "2023-07-30T14:42:03.699000+00:00",
        "attachments": null
    },
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "What do you mean by port forwarding? Are you having trouble with p2p ports or reaching 8545 rpc from public network? Ideally, user shouldn't have to touch his router settings at all, generally I don't want to publish my physical IP tied to my node. For remote access, you can use a proxy over ssh, I did a project for this while ago https://github.com/taxmeifyoucan/eth-rpc-proxy/. Also using onion is an option for private remote access. \nWhat you are mentioning is mostly verification of the config? If you have in mind managing ports on local system level, there are also tools for that as others mentioned. Not sure if you followed my node workshop at office hours. I demonstrated manual hands on deployment but for an average user, an automatic tool which sets up all configs is necessary (especially after the merge..). Here are some options for automated setup https://ethereum.org/en/developers/docs/nodes-and-clients/run-a-node/#automatized-setup\nI proposed a project for EPF, deb repo, which is meant exactly for this and avoids dependencies like docker.",
        "created_at": "2023-07-30T15:21:18.071000+00:00",
        "attachments": null
    },
    {
        "author": "angaz",
        "category": "general",
        "parent": "",
        "content": "I would assume UPnP would be the default. So your node would be publicly accessible. But basically all of the automated setups are using docker with the default network namespacing or some other kind of NAT so, then you would need to configure the router. Connecting p2p traffic over tor, yeah I get that for privacy reasons, but I don't think many people will be able to understand that far if they are just using a dappnode/rocketpool/sedge which all are using containerization for running the nodes.",
        "created_at": "2023-07-30T15:39:15.263000+00:00",
        "attachments": null
    },
    {
        "author": "angaz",
        "category": "general",
        "parent": "",
        "content": "I just sampled two random clients: Nethermind and lighthouse and they both mention port forwarding in the docs.",
        "created_at": "2023-07-30T15:43:56.205000+00:00",
        "attachments": null
    },
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "Exactly in those automated setups, onion service would be a pretty simple package to implement and just another install click or flag for the user.",
        "created_at": "2023-07-30T18:06:59.925000+00:00",
        "attachments": null
    },
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "But back to the original idea, I think it would be great to have a tool which connects to my node endpoints and informs me about potential issues. Can be a local tool but also a hosted service where I can just past my enr. Something similar was proposed for EL node crawler https://github.com/ethereum/node-crawler/issues/20. Also having RPC provider debug would be interesting - passing your public rpc endpoint and getting info about sensitive namespaces allowed, missing headers and general liveness/correctness",
        "created_at": "2023-07-30T18:07:44.670000+00:00",
        "attachments": null
    },
    {
        "author": "angaz",
        "category": "general",
        "parent": "",
        "content": "This tool seems pretty cool. So yeah, I think it will be a good place to add a scan, and optionally add to database feature. I think it's better to improve an existing tool than to make something completely myself.\n\nBut it looks like it's dead. The link mentioned in the repo doesn't have a DNS entry: crawler.ethereum.org",
        "created_at": "2023-07-30T22:15:53.947000+00:00",
        "attachments": null
    },
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "It needs contributions and maintenance, might be a good place to start! The production version is down because of unhandled bugs but you can find it running at https://pscrawl1.ethdevops.io/",
        "created_at": "2023-07-30T22:47:35.202000+00:00",
        "attachments": null
    }
]