[
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "Checkout ACDe call happening now, discussion about Dencun, its testing and then update from Josh and Guillaume on the current state of verkles https://youtube.com/live/X46mbG8N5XM",
        "created_at": "2023-08-03T14:13:55.972000+00:00",
        "attachments": null
    },
    {
        "author": "pstylez78",
        "category": "general",
        "parent": "",
        "content": "Want to give a shout out to \u003c@466006586477772831\u003e for putting together this awesome document on lighthouses architecture https://hackmd.io/@jimmygchen/Sk%209oPHO8s",
        "created_at": "2023-08-03T15:48:47.228000+00:00",
        "attachments": null
    },
    {
        "author": "v4lproik",
        "category": "general",
        "parent": "",
        "content": "I would love to read it but I do not have access to it. Server returns 404.",
        "created_at": "2023-08-03T15:58:41.039000+00:00",
        "attachments": null
    },
    {
        "author": "ralexstokes",
        "category": "general",
        "parent": "",
        "content": "https://hackmd.io/@jimmygchen/Sk9oPHO8s",
        "created_at": "2023-08-03T15:59:22.919000+00:00",
        "attachments": null
    },
    {
        "author": "sogol_malek",
        "category": "general",
        "parent": "",
        "content": "Great article! just along my work, providing core entities for  stateless AA; our State provider can be   really cool ! I was talking to  \u003c@259648573401071617\u003e  and  he pointed out this. just thinking would be interesting to mention this point here: The state provider entity is at the core of stateless AA,`https://github.com/sogolmalek/EIP-x/blob/main/Project%20proposal.md `providing a succinct and constant-sized proof of the current state. Light clients can effortlessly verify this proof against the mainnet, improving scalability, and reducing resource requirements for light clients. Users and applications can efficiently interact with the blockchain, relying on the security and integrity of zk-proofs to verify the state. This approach enables more participants to engage with the network without needing the computational resources and storage capacity required for full nodes. I'm making myself familiar with Lighthouse Light client to query the latest state and make a zk proof of that which are spreadable across the network.  accomplishing the goal of this entity. any thoughts, plz ? if there are some helpful resources to help me with this light client or any other client that fits better to my goal would highly appreciate it if anyone can share 🙂",
        "created_at": "2023-08-03T17:26:21.209000+00:00",
        "attachments": null
    },
    {
        "author": "0xunclebill",
        "category": "general",
        "parent": "",
        "content": "maybe I’m missing something here but i don’t think lighthouse can be ran as a light client.  \n\nTheres some light client implementations listed in this article: https://ethereum.org/en/developers/docs/nodes-and-clients/light-clients/",
        "created_at": "2023-08-03T17:35:20.356000+00:00",
        "attachments": null
    },
    {
        "author": "geemo_candama",
        "category": "general",
        "parent": "",
        "content": "\u003c@864461065693036554\u003e Lighthouse  does not have a light client and does not serve all light client data afaik. Helios does not receive data over p2p also. I think Nimbus has a good CL light client implementation. Here are the altair CL light client specs: https://github.com/ethereum/consensus-specs/tree/dev/specs/altair/light-client",
        "created_at": "2023-08-03T17:53:15.002000+00:00",
        "attachments": null
    },
    {
        "author": "sogol_malek",
        "category": "general",
        "parent": "",
        "content": "gotta, thanks \u003c@968581220919296130\u003e so much for declaring! will dive deeper into this spec",
        "created_at": "2023-08-03T19:22:02.949000+00:00",
        "attachments": null
    },
    {
        "author": "sogol_malek",
        "category": "general",
        "parent": "",
        "content": "very helpful",
        "created_at": "2023-08-03T19:22:08.469000+00:00",
        "attachments": null
    },
    {
        "author": "sogol_malek",
        "category": "general",
        "parent": "",
        "content": "oook gotta! i wanted to use lighthouse to query the latest state btw",
        "created_at": "2023-08-03T19:25:50.436000+00:00",
        "attachments": null
    },
    {
        "author": "sogol_malek",
        "category": "general",
        "parent": "",
        "content": "actually this is my job to build such a component including a peer-to-peer network that get into concensus for the latest block state and makes a ZK-proof,the  i dont expect current light client to have such a component though, that's why i m designing a new entity",
        "created_at": "2023-08-03T19:29:41.788000+00:00",
        "attachments": null
    }
]