[
    {
        "author": "oniblend",
        "category": "general",
        "parent": "",
        "content": "Is there anyway to find when these meetings are occuring so I can put them in my schedule?",
        "created_at": "2024-10-23T13:21:57.018000+00:00",
        "attachments": null
    },
    {
        "author": "tmiychao",
        "category": "general",
        "parent": "",
        "content": "Only last 2 weeks of these calls are left because cohort is ending, stay tuned for another one. Schedule is in readme and if you haven't done so, check the program guide in this repo. https://github.com/eth-protocol-fellows/cohort-five?tab=readme-ov-file#communication",
        "created_at": "2024-10-23T13:25:46.715000+00:00",
        "attachments": null
    },
    {
        "author": "tmiychao",
        "category": "general",
        "parent": "",
        "content": "\u003c@\u0026857649635274915900\u003e Here we are, cohort 5 slowly coming to an end. We already mentioned project presentations and final report at standup before so I wanted to share all details here. \n\nFirst of all, there is the final report which should be eventually shared by everyone who participated in the cohort. This is not just a one more dev update but more comprehensive report on your work during the entire time, current state of the project and future plans. Please take your time to reflect and write it well, the deadline we are aiming for is before Devcon. Check details and structure here: https://notes.ethereum.org/@MarioHavel/SyNjPhqyJl\n\nThe final project presentation is also expected from everyone participating in the cohort, or at least covering every active project. Those who are coming to Devcon will do it live there but for everyone else, we are dedicating last office hours calls. Here is the issue to sign up for the next week call but if you are not ready, there will be last chance the week after https://github.com/eth-protocol-fellows/cohort-five/issues/522 Please let us know in comments if you'd like to present. \n\nFor both final report and presentation, keep in mind who is your audience. It's meant for mentors, people learning about your work and future fellows. Don't spend too much time introducing the protocol domain or technical background, assume that people have certain context and focus on explaining your project as it is. \nIf you need feedback or have any questions, we are always here for you! I am really excited to see summary of the cohort, a lot of incredible work was done. 🙂",
        "created_at": "2024-10-23T13:26:14.360000+00:00",
        "attachments": null
    },
    {
        "author": "oniblend",
        "category": "general",
        "parent": "",
        "content": "Thanks!",
        "created_at": "2024-10-23T13:27:28.115000+00:00",
        "attachments": null
    },
    {
        "author": "oniblend",
        "category": "general",
        "parent": "",
        "content": "It's all very new to me, but would like to join and get to know you better 🙂",
        "created_at": "2024-10-23T13:32:39.400000+00:00",
        "attachments": null
    }
]