[
    {
        "author": "tomi0x",
        "category": "general",
        "parent": "",
        "content": "EPF day @EthCC:\nhttps://youtu.be/_KwVJm5eHZ4?si=rZPj4SoHVF13JEDH",
        "created_at": "2024-07-11T07:08:59.758000+00:00",
        "attachments": null
    },
    {
        "author": "boma_naps",
        "category": "general",
        "parent": "",
        "content": "It's not complete",
        "created_at": "2024-07-11T09:00:07.702000+00:00",
        "attachments": null
    },
    {
        "author": "joshd4078",
        "category": "general",
        "parent": "",
        "content": "Unfortunately not. Jitsi decided to cut each recording at one hour. So we missed recording some of the content.",
        "created_at": "2024-07-11T09:15:12.506000+00:00",
        "attachments": null
    },
    {
        "author": "boma_naps",
        "category": "general",
        "parent": "",
        "content": "Alright",
        "created_at": "2024-07-11T09:29:18.578000+00:00",
        "attachments": null
    },
    {
        "author": "tmiychao",
        "category": "general",
        "parent": "",
        "content": "I am sorry it took us a while to release the recording. We couldn't recover rest of the recording, we are missing part of the panel and Dankrad's talk :/ All project presentations are in there!",
        "created_at": "2024-07-11T09:45:09.413000+00:00",
        "attachments": null
    },
    {
        "author": "pawandhananjay",
        "category": "general",
        "parent": "",
        "content": "Hey guys 👋 wanted to propose a lighthouse related project if anyone is interested\nIt's basically porting our current http library (warp) to a potentially better library (axum). Warp is something that we have had since before eth2 mainnet because we had no better options around then. Its quite a pain to deal with because it has this really annoying way of dealing with types which forces us to blindly put a bunch of things on the heap without totally understanding why we are doing this.\nWe already have moved to axum in most of the new projects in lighthouse and related projects that require a http library. \nI had a go at porting lighthouse a couple of months ago and it's at https://github.com/pawanjay176/lighthouse/tree/axum\nThe branch has some of the main methods in the validator required beacon api ported such that a lighthouse validator can be driven using the minimally implemented api. The project would involve, porting all remaining endpoints to axum, adding logging and metrics and compare its performace with the current warp server. Based on our experience with axum so far, I think the performance should be atleast comparable or better. \nAnyone interested in working on this would get a better understanding of the beacon api flow and rust type system at the very least imo\nLmk if someone is interested\n\u003c@686695036733227017\u003e lmk if i can add this proposal to some official repo",
        "created_at": "2024-07-11T12:55:31.828000+00:00",
        "attachments": null
    },
    {
        "author": "leanapple",
        "category": "general",
        "parent": "",
        "content": "I can potentially take it aside - I'm used to work with axum 👀 and would be interested to know its performance !",
        "created_at": "2024-07-11T13:03:53.371000+00:00",
        "attachments": null
    },
    {
        "author": "pawandhananjay",
        "category": "general",
        "parent": "",
        "content": "awesome, i'll dm you",
        "created_at": "2024-07-11T13:05:26.450000+00:00",
        "attachments": null
    }
]