[
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "Week 13 Dev updates | Sep 2 - 8",
        "created_at": "2024-09-02T09:33:41.213000+00:00",
        "attachments": null
    },
    {
        "author": "dragan2836472",
        "category": "general",
        "parent": "",
        "content": "Nice work! This gives a nice overview, but I'm still confused with the term \"verifying verkle trie\" in the context of \"zkevm\" or L2s. **I don't think zkEVM(L2s) need a (verkle)verifier algorithm**. Still, they only need to prove that \"edit\" of the trie is done correctly, meaning they need to compute a new state root in the \"zk\", so the only bottleneck is how many Pedersen hashes you need to do in the block to get new state root. Regarding verifying verkle proof (or verifying execution witnesses are part of the \"old\" state root), that can be done without \"zk\" but natively verify that execution witnesses are canonical to the (old)state root. Then use these witnesses for the execution, and prove (in \"zk\") that the execution is done properly, and the new state root is computed properly (meaning, editing of the trie is done properly).\n\nMaybe I'm wrong on this, but that's my understanding",
        "created_at": "2024-09-02T12:49:37.975000+00:00",
        "attachments": null
    },
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "\u003c@\u0026857649635274915900\u003e Weekly standup starting \u003ct:1725289200:R\u003e! Join us to share your progress and updates https://meet.ethereum.org/epf-standup",
        "created_at": "2024-09-02T14:43:37.096000+00:00",
        "attachments": null
    },
    {
        "author": "georgesh.eth",
        "category": "general",
        "parent": "",
        "content": "Mates, during the breakroom today, we happened to mention hiking hobby in Singapore and talk about Token2049 Singapore in about 2 weeks. If anyone are joining in Token2049 Singapore, we can hang out or meet each other. I am also organising or helping couple of events here, feel free to reach out.",
        "created_at": "2024-09-02T15:14:47.040000+00:00",
        "attachments": null
    }
]