[
    {
        "author": "tmiychao",
        "category": "general",
        "parent": "",
        "content": "\u003c@\u0026857649635274915900\u003e Hope your first week of EPF is going well! \n\nIt's great to see first weekly updates coming in. Please don't hesitate to share write-ups on your latest activities, submit it to the github repo and the thread \u003c#1249758265617682533\u003e. I am interested to learn about your process, feel free to DM me for feedback if you are unsure about anything or need any guidance. \n\nI wanted to point your attention towards today's All Core Devs call. Every Thursday at \u003ct:1718287200:t\u003e (14:00 UTC), there is an ACD call of either CL or EL devs. This is what Tim talked about in his talk on Tuesday, make sure to check the recording if you missed it. \nToday's CL call and the content can be found at https://github.com/ethereum/pm/issues/1069 but I recommend following these every week. Or at least reading the notes afterwards. It's the best place to learn about the current state of the development, latest work on clients and generally learn a lot about the protocol. You can just tune in, listen to the youtube stream and note down if you don't understand something or identify issues people are dealing with and use it as an inspiration for your EPF projects.",
        "created_at": "2024-06-13T12:15:06.223000+00:00",
        "attachments": null
    },
    {
        "author": "vaishnavi0638",
        "category": "general",
        "parent": "",
        "content": "Hey \u003c@578356786889752586\u003e !   I am interested in working on the 4881 implementation in lodestar I just saw that some PRs are raised on the project.\n\n Have a small doubt are you guys waiting for the all project proposals or the project has been assigned to someone already.",
        "created_at": "2024-06-13T12:47:35.991000+00:00",
        "attachments": null
    },
    {
        "author": "philngo",
        "category": "general",
        "parent": "",
        "content": "There is an external contributor working on it, but if this interests you, I wouldn't want to stop you from contributing to that. Feel free to join our ChainSafe discord and we can work out logistics! https://discord.gg/yjyvFRP",
        "created_at": "2024-06-13T14:39:22.897000+00:00",
        "attachments": null
    },
    {
        "author": "kboom_ro",
        "category": "general",
        "parent": "",
        "content": "ref. to what \u003c@552133098075193354\u003e was mentioning Tuesday during office hours, about Network Upgrade process improvement (https://ethereum-magicians.org/t/allcoredevs-network-upgrade-ethmagicians-process-improvements/20157) : Review request for the PFI/CFI/SFI EIP: 7723 (https://github.com/ethereum/EIPs/pull/8662)",
        "created_at": "2024-06-13T15:10:48.161000+00:00",
        "attachments": null
    },
    {
        "author": "akshat4480",
        "category": "general",
        "parent": "",
        "content": "Hey , actually I am the one who is currently solving that issue , we can work on it together if you want , I have already written the 4881 implementation and am integrating it in the lodestar repo .",
        "created_at": "2024-06-13T15:18:14.888000+00:00",
        "attachments": null
    },
    {
        "author": "akshat4480",
        "category": "general",
        "parent": "",
        "content": "Phil",
        "created_at": "2024-06-13T15:19:28.473000+00:00",
        "attachments": null
    },
    {
        "author": "tomi0x",
        "category": "general",
        "parent": "",
        "content": "Some good materials to get a good background of some of the topics discussed:\nhttps://ethresear.ch/t/peerdas-a-simpler-das-approach-using-battle-tested-p2p-components/16541\nhttps://cointelegraph.com/explained/ethereums-next-upgrade-prague-electra-pectra-explained",
        "created_at": "2024-06-13T15:32:18.645000+00:00",
        "attachments": null
    },
    {
        "author": "vaishnavi0638",
        "category": "general",
        "parent": "",
        "content": "cool sounds good",
        "created_at": "2024-06-13T17:13:16.286000+00:00",
        "attachments": null
    }
]