[
    {
        "author": "another_devx",
        "category": "general",
        "parent": "",
        "content": "Hello, I'm interested on work on lighthouse, with who I can talk about it?",
        "created_at": "2024-07-05T01:54:54.128000+00:00",
        "attachments": null
    },
    {
        "author": "hangleang.eth",
        "category": "general",
        "parent": "",
        "content": "Hey \u003c@914307919699406908\u003e, Is there any plan for retroactive stipend to permissionless participants? This might sound greedy, but it will encourage to commitment and dedication. If so, how often will it be? I guess other permissionless folks would like to know too, thank you for being permissionless, and open",
        "created_at": "2024-07-05T04:12:52.282000+00:00",
        "attachments": null
    },
    {
        "author": "0xunclebill",
        "category": "general",
        "parent": "",
        "content": "hi! i'd suggest joining the LH discord. we have a #developers channel which is a good place for contributors to ask questions.",
        "created_at": "2024-07-05T08:30:57.485000+00:00",
        "attachments": null
    },
    {
        "author": "tmiychao",
        "category": "general",
        "parent": "",
        "content": "We talked about this in the initial kick off call, check the recording if you haven't attended. Tldr, there is indeed a part of the budget left for people who just show up permissionlessly and do a great work. But it's not going to be many, it's no guaranteed and there is no official process to follow, just keep doing your best work. We will eventually approach people who make valuable contributions which means probably no sooner than around third month of the fellowship.\nAs a fellow, you shouldn't base your commitment and dedication on a small chance of a getting little stipend in the future, it's not significant.",
        "created_at": "2024-07-05T11:29:48.590000+00:00",
        "attachments": null
    },
    {
        "author": "hangleang.eth",
        "category": "general",
        "parent": "",
        "content": "clear! thank you",
        "created_at": "2024-07-05T12:09:55.359000+00:00",
        "attachments": null
    },
    {
        "author": "joshd4078",
        "category": "general",
        "parent": "",
        "content": "If there is anyone in this channel participating permissionlessly in EPF  this cohort (or \u003c@\u00261126618846711795912\u003e) and are attending EthCC, please DM me.",
        "created_at": "2024-07-05T18:13:00.622000+00:00",
        "attachments": null
    }
]