[
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "Week 2 Dev Updates | Jun 23-29",
        "created_at": "2025-06-23T10:13:26.210000+00:00",
        "attachments": null
    },
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "\u003c@\u0026857649635274915900\u003e Second week of the fellowship is here! Please read the message carefully so you don't miss on anything important. \n\nThis week is dedicated to further researching and narrowing down your areas of interest. There is a lot of topics to explore, many projects still don't have anyone looking into to them 👀\nIf you need any advice or guidance in this phase, don't hesitate to reach out!  Looking forward to see more updates on your progress, please use the thread to share them during this week: https://discord.com/channels/595666850260713488/1386650350219431988/1386650355168841858",
        "created_at": "2025-06-23T11:22:29.734000+00:00",
        "attachments": null
    },
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "We will meet exactly in one week in Cannes! EPF Day is in one week and everyone is invited to join us there. If you are planning to come and haven't seen the discord thread, DM us. Make sure to to prepare everything for the trip and a couple of slides to present your project focus. By the end of this week you should have some idea what you plan to work on since there will be an opportunity to discuss it with everyone, including mentors, in person. Each fellow will have a short (5-10 min) presentation about their project idea(s), only sort of a draft to get feedback before finishing the full project proposal. Everyone who cannot make it to Cannes will present online afterwards at Office Hours. \n\nToday at \u003ct:1750690800:t\u003e (3PM UTC), we will have our first stand up call. It's an opportunity to meet other fellows and present your current research. Everyone will give a brief (1min) update on their current progress so we all can learn about each others work, ask questions or provide feedback right away. There will be also some more info on the upcoming Office Hours and EthCC from us. See you there!",
        "created_at": "2025-06-23T11:22:31.703000+00:00",
        "attachments": null
    },
    {
        "author": "nenarapsody",
        "category": "general",
        "parent": "",
        "content": "sent you a dm!",
        "created_at": "2025-06-23T12:48:57.471000+00:00",
        "attachments": null
    },
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "\u003c@\u0026857649635274915900\u003e Our first regular standup is starting in \u003ct:1750690800:R\u003e! Join us at https://meet.ethereum.org/epf-standup",
        "created_at": "2025-06-23T14:53:04.070000+00:00",
        "attachments": null
    },
    {
        "author": "bhaskar_0707",
        "category": "general",
        "parent": "",
        "content": "welp. im getting disconnected from the meet every few minutes after joining.",
        "created_at": "2025-06-23T15:12:04.131000+00:00",
        "attachments": null
    },
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "welp. im getting disconnected from the",
        "created_at": "2025-06-23T15:32:32.801000+00:00",
        "attachments": null
    },
    {
        "author": "webby8",
        "category": "general",
        "parent": "",
        "content": "\u003c@686695036733227017\u003e might be a difficult ask, any possibility to understand which projects are not taken up apart from lodestar? happy to consider others since Erigon is quite popular",
        "created_at": "2025-06-23T15:49:09.205000+00:00",
        "attachments": null
    },
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "Here is the thread where fellows signal their current focus https://discord.com/channels/595666850260713488/1384203215360229458/1384203218065555619",
        "created_at": "2025-06-23T15:49:58.115000+00:00",
        "attachments": null
    },
    {
        "author": "harsh.ps.2003",
        "category": "general",
        "parent": "",
        "content": "I was not able to give update due to connection issues (tired 3 clients and rejoined more than 10 times for sure). So I am giving it here!\n\nIn previous week I worked on draft proposal of Fast Confirmation Rule in Lighthouse primarily. Went through Prysm's experimental implementation, found out that they are facing issues with that. Tried going through Lighthouse codebase, saw some different architecture, and wrote in my proposal how I think the FCR can be implemented in Lighthouse experimentally with proper benchmarking. Apart from this, I already have draft proposals on 3 other projects. For FCR, I dont know whether Lighthouse wants it right now or not, so maybe \u003c@686695036733227017\u003e can help here. The week 1 update is - https://hackmd.io/@harsh-ps-2003/B1QE4NVVxg\n\nIf lighthouse wants it, there are some challenges that come with implementing FCR that Prysm faced, and so, Lighthouse coredevs must have some thoughts about that. I have written my approach in draft proposal, would love it if \u003c@686695036733227017\u003e can take a look to point out some mistake if any. \n\nIf lighthouse is not interested, I can pick anyone of 3 projects that I have drafted. \nThis week 2 I want to finalize what project I want to work on, and make EthCC presentation around it. I want to dive deeper into the selected project this week. \n\nIf lighthouse wants FCR in an experimental state like Prysm, I would love to work on it.\n\nAlso, Ephemery Tests are not desired by geth team! And previously implementation in Lighthouse was unsuccessful.  So it would be great to know which team wants it!\n\nGrandine: zkVMs for Beacon Chain Snarkification project  is interesting, but I am unable to find out where risc0 and sp1 testing has happened! \n\nErigon: RISCV Executable Proof Sourcing seems quite intense. Even though I have written a detailed draft proposal on this, I am not sure this can be wrapped up in EPF. Huge scope.\n\nWeek 0 update as other 3 drafts - https://hackmd.io/@harsh-ps-2003/rk4ZFSwXxx",
        "created_at": "2025-06-23T15:51:34.241000+00:00",
        "attachments": null
    },
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "I was not able to give update due to",
        "created_at": "2025-06-23T16:18:47.252000+00:00",
        "attachments": null
    }
]