[
    {
        "author": "tmiychao",
        "category": "general",
        "parent": "",
        "content": "\u003c@\u0026857649635274915900\u003e Only few weeks left in EPF6, here is a guide on what is expected from you by the end of the cohort. Please take some time to read it https://notes.ethereum.org/@MarioHavel/cohort6finale\n\nAs we mentioned before, fellows are supposed to prepare final presentation and report by end of the cohort. Those coming to Devconnect will present at EPF Day there and everyone else will have a chance to present at last Office Hours calls on Nov 5 and Nov 12 (issues to sign up will be shared soon). You can also record your presentation locally and share the recording if you cannot make it live in neither case. \n\nApart from the presentation, there is the final report which we expect from everyone who participated in the cohort. This is not just a one more dev update but more comprehensive report on your work during the entire time, current state of the project and future plans. Check the guide for structure and details.  Please take your time to reflect and write it properly, from your heart not llm. The deadline is Nov 18, you should share it before Devconnect. \n\nFor both final report and presentation, keep in mind who is your audience. It's meant for mentors, people learning about your work and future fellows - don't spend it on explaining some part of the protocol but focus on your actual work. It will represent your work on the protocol going forward, a single stop to understand what you did, make sure it's comprehensive and focuses on right things. \n\nIf you need feedback or have any questions, please reach out, we are always here for you! Looking forward to see all the cool outcomes 🙂",
        "created_at": "2025-10-22T11:00:53.660000+00:00",
        "attachments": null
    },
    {
        "author": "tmiychao",
        "category": "general",
        "parent": "",
        "content": "Today's Office Hours will be more informal hang out, you can use it if you have any questions about final report/presentation and end of the cohort. Or any other topic you'd like to discuss, whether it's protocol, EPF related or not https://github.com/eth-protocol-fellows/cohort-six/issues/479",
        "created_at": "2025-10-22T11:02:08.193000+00:00",
        "attachments": null
    },
    {
        "author": "tmiychao",
        "category": "general",
        "parent": "",
        "content": "\u003c@\u0026857649635274915900\u003e  Office Hours starting in a minute! Join us to ask any questions, chat with other fellows and finally just hangout 🙂 https://meet.ethereum.org/epf-office-hours",
        "created_at": "2025-10-22T14:59:35.714000+00:00",
        "attachments": null
    },
    {
        "author": "tmiychao",
        "category": "general",
        "parent": "",
        "content": "https://phacker.org/",
        "created_at": "2025-10-22T15:27:42.357000+00:00",
        "attachments": null
    }
]