[
    {
        "author": "chanderprakash20",
        "category": "general",
        "parent": "",
        "content": "Hi \u003c@686695036733227017\u003e I am Research scientist but during this summer I want to contribute to ethereum through the EPF could please tell to me there is any Research project in EPF where I can contribute to help ethereum further grow I am waiting for 1 year for this Please help me out connect with relevant Research team that are giving project in this cohort of EPF I am very exicited .currently I am working on achiving privacy one layer2 solution",
        "created_at": "2025-04-24T04:07:03.922000+00:00",
        "attachments": null
    },
    {
        "author": "boma_naps",
        "category": "general",
        "parent": "",
        "content": "Check here https://efdn.notion.site/ROPs-RIG-Open-Problems-c11382c213f949a4b89927ef4e962adf all relevant research links are the ones \u003c@1209865038752383070\u003e posted — specifically this one https://efdn.notion.site/EF-Research-17ed989555418002b416eebe5e57caa9",
        "created_at": "2025-04-24T06:18:53.174000+00:00",
        "attachments": null
    },
    {
        "author": "chanderprakash20",
        "category": "general",
        "parent": "",
        "content": "\u003c@962726279336046633\u003e thanks for sharing this but for the Ethereum protocol fellowship which team is coming with Research project where I contribute my current focused Research area is privacy on layer2 expecially zk rollups could tell to me or connect with that relevant people .Another question where I can find papers , reports related or publsihed by ethereum scientist",
        "created_at": "2025-04-24T06:25:37.630000+00:00",
        "attachments": null
    },
    {
        "author": "boma_naps",
        "category": "general",
        "parent": "",
        "content": "I don't think project ideas is complete yet, but here https://github.com/eth-protocol-fellows/cohort-six/blob/main/projects/project-ideas.md you will see RIG open problems for EPF i guess.",
        "created_at": "2025-04-24T06:34:32.882000+00:00",
        "attachments": null
    },
    {
        "author": "chanderprakash20",
        "category": "general",
        "parent": "",
        "content": "ok got it if any information come related with Research Please share could tell to me where is the ethereum team Research papers and findings is ?",
        "created_at": "2025-04-24T06:36:13.871000+00:00",
        "attachments": null
    },
    {
        "author": "boma_naps",
        "category": "general",
        "parent": "",
        "content": "If you check the second link I shared, you'll see all research-related work in Ethereum and proper links to specific research or ongoing work. What I don't know is if they have a dedicated communication channel or something of the sort.",
        "created_at": "2025-04-24T06:40:39.376000+00:00",
        "attachments": null
    },
    {
        "author": "mariohavel",
        "category": "general",
        "parent": "",
        "content": "Research is a very broad term. From the topics you mentioned like l2 zk, that's not part of the core protocol. Please read the program guide and make yourself familiar with its areas and processes",
        "created_at": "2025-04-24T11:03:15.543000+00:00",
        "attachments": null
    },
    {
        "author": "chanderprakash20",
        "category": "general",
        "parent": "",
        "content": "yes I have read I am asking there is Research project related to core protocol layer1 like as in previous cohort related to the EVM cost pricing analysis or etc is it that kind of project are coming where I can  work as Researcher or not ?",
        "created_at": "2025-04-24T13:32:27.056000+00:00",
        "attachments": null
    }
]