[
    {
        "author": "maraschmiedt6542",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hello Everyone, \n\nWe are excited to host the next SSV community call this Friday at 11:30am ET and are excited for you to join us during this discussion.\n\nNow that we have gotten to genesis, the core contributors team is commencing the work on the open-source specification and audited implementation of Secret Shared Validators for Ethereum 2.0 including the implementation of an SSV node, an SSV client (initially based on Prysm with connectivity to Prysm’s BN) and a distributed key generation and sharing toolkit. \n\nSince Secret Shared Validators on Ethereum 2.0 present a path to improved resiliency and decentralization for at-home validator setups, infrastructure providers and trustless staking pools alike, we will be focusing the upcoming series of community calls to deep-dive on each use case. \n\nOn this week's agenda we will be focusing the discussion on a comparative analysis of SSV-based versus single validator staking pools. \n\nUnable to join this call? No problem, we will be circulating the takeaways and relevant recordings with you after the call. \n\nBest wishes,\nMara",
        "created_at": "2020-12-08T15:04:52.671000+00:00",
        "attachments": null
    },
    {
        "author": "\u003cmaraschmiedt\u003e",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Hi Everyone, accidentally shared the wrong TG link to this group on the email invite. Please use this thread for community comms on the SSV effort.",
        "created_at": "2020-12-08T19:05:06.690000+00:00",
        "attachments": null
    },
    {
        "author": "\u003cmaraschmiedt\u003e",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "@Souptacular if you could share the TG group link here that would be awesome!",
        "created_at": "2020-12-08T19:05:43.716000+00:00",
        "attachments": null
    }
]