[
    {
        "author": "maraschmiedt6542",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e However, if signing power is concentrated amongst a few exchanges -- which we seem to be encouraging with SSVs -- I fear this model breaks down, and fraud proofs will most certainly be required to keep that power in check.\n\u003e \n\u003e Why? In a sense, SSVs add more insurance against the behaviour of centralised actors. And this will lead to more people using centralised actors because the insurance makes it safer... **We may well be helping to create a world in which a cartel of 5 exchanges controls \u003e 2/3 of all validators. Would we be happy with that outcome?**\n\nThere is and will be an addressable market for centralized providers so long as staking requires a minimum amount of technical literacy and providers are able to offer value-added and tangental services with a convenience factor. \n\nThe majority of folks who plan to stake with a provider (1/3 of all respondents we asked in a study) already hold a big chunk of their eth on centralized exchanges - it's a sticky business and market shares are concentrated. \n\nSSVs will likely have a stronger impact on decentralizing the signing power of the leading 1-2 providers (e.g. through relative inclusion of smaller providers that may be favourable for anti-correlation strategies), compared to the aggregate traction that enhanced insurance via SSVs will have on those 5+ providers IMO.",
        "created_at": "2020-07-26T17:25:51.941000+00:00",
        "attachments": null
    },
    {
        "author": "maraschmiedt6542",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e Just to re-shill the work \u003c@!544848504078598144\u003e, and I did on this topic. I think it is useful from the standpoint of formalising exactly what failure modes SSVs can prevent. (Particularly as the problem space is much bigger than \"just\" custodial staking.) https://notes.ethereum.org/@adiasg/preventing-eth2-validator-failure\n\nOn that note, would like to re-highlight this comment by \u003c@!550420431744794624\u003e. Fully agree that it will be critical to surface and communicate the role SSVs may have on failure prevention to a problem space that extends far beyond centralized providers.",
        "created_at": "2020-07-26T17:29:37.798000+00:00",
        "attachments": null
    }
]