[
    {
        "author": "okyne",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "\u003e Can you please articulate the value you see in this advancement and maybe describe your vision for it?\n\nI may not be \u003c@!273808422753796097\u003e but I have finally posted an article I have been working on about the value DVs can bring and my outlook for how they can lower the risks and costs of validating Ethereum and adding decentralisation in depth to the protocol into the future. Thoughts and feedback welcome. 🙂 \n\nhttps://blog.obol.tech/tackling-the-staking-problem/",
        "created_at": "2022-01-21T14:17:12.648000+00:00",
        "attachments": null
    },
    {
        "author": "fod8970",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Thanks for the post and for working on this problem! I'm very excited to see progress in this space.\n\nI'm curious though. Can you help me understand the differences between Obol and ssv.network? You seem to be using the same underlying technology (the SSV approach), but is there something that Obol will be adding that will set them apart and create additional value? Or are these just two competing projects trying to do the exact same thing in parallel?\n\nAfter doing a deep dive, I found that it seems like the near-term objectives are clear and that different implementations will probably just converge to a single point -- minimizing risk, cost; maximizing decentralization, robustness, performance; creating interfaces for a next-gen pool, DIY stakers, and existing staking providers. This is in contrast to the landscape of L2s that use various technologies with their own advantages and disadvantages. With DVs, the SSV approach seems to be all there is and all there will be, at least for a while. Therefore, I don’t quite see the value in multiple implementations as they have been described so far, other than to raise the probability that one will succeed and gain traction. Am I missing something?",
        "created_at": "2022-01-21T16:21:59.938000+00:00",
        "attachments": null
    },
    {
        "author": "okyne",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "Thanks for the kind words and support 🙂 We will be outlining our architecture in more detail shortly, but I would push back on your framing that there is only one solution in this problem space, and as you have outlined yourself, there are huge numbers of ways to apply this technology and niches to focus on and specialise in.\n\nI believe there could be as many ways to implement and adopt DVT as there are rollup approaches. You could also view rollups as just \"competing projects trying to do the exact same thing in parallel\". \n\n\u003e With DVs, the SSV approach seems to be all there is and all there will be, at least for a while.\n\nI don't agree here. The only thing I will say on this is that to my knowledge SSV is based upon Prysm and is a full validator client that pulls its private keys from smart contracts on chain. Charon (our unreleased client) sits as a middleware between a validator client and a beacon node, and doesn't hold the private key shares at all. \n\nRegardless, I am a builder at heart, and I support and respect those who build and ship. I don't think it is worthwhile picking out pros and cons of architecture decisions when we are both so early in our journey. I think if I were to outline a load of bullet points now about our differences, I would look back on this answer in a few years and cringe because of how far both projects will have progressed from here. I think multiple funded implementations will add credibility to the paradigm and be positive sum for the DVT space, not zero sum. You are also probably aware of the unannounced standardisation/spec/FV effort on DVs that is underway, so there is a decent chance that Obol and SSV are interoperable in the future, decentralising both of us even further. \n\nNonetheless, I appreciate you holding us to account, and I hope you are open to us working to raise the bar and making both of us better for it. I believe we all want the same thing in the long run, and I don't believe DVT is a winner take all market. 🙂",
        "created_at": "2022-01-21T22:09:22.315000+00:00",
        "attachments": null
    }
]