[
    {
        "author": "papajm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "hmm now imagine something like solana mobile (not just that but the complete financial infrastructure,) that comes with a certain prestaked eth , on the Point of Sale machine or ATM or even hardware wallet, users dont even need to know whats happening, all they care about is letting them know that they can save on fees vs other payment networks, and even make money",
        "created_at": "2024-02-04T13:15:38.159000+00:00",
        "attachments": null
    },
    {
        "author": "papajm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "alternatively, or better complimentary would be for a home server that Vitalik proposed could come prestaked a smart home server, something more advanced than alexa or siri and manages all smart devices in your home, this can also be decentralised compute cloud also",
        "created_at": "2024-02-04T13:19:18.335000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "It is certainly easy to make it so anyone can run some code on a small device.  The hard part is doing it in a way that maintains Ethereum's censorship resistance, permissionless, and trustless properties.  Doing *that* on a small device is what is hard.",
        "created_at": "2024-02-04T13:33:17.572000+00:00",
        "attachments": null
    },
    {
        "author": "papajm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "i am not a technical guy but i can imagine a more light version that can use distributed validator technology and several authentication steps, up to layer 0.\n\nwhat are the curent specs",
        "created_at": "2024-02-04T13:35:42.931000+00:00",
        "attachments": null
    },
    {
        "author": "papajm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "it does not seem something that you cant solve with enough resources",
        "created_at": "2024-02-04T13:36:28.289000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "There are people who have thought a lot about this and solutions to the problems are in the works (like Portal Network, verkle trees, stateless, and zkproofs).  However, all of these are large undertakings that will, optimistically, take many years to build, test, deploy.",
        "created_at": "2024-02-04T13:38:23.606000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "So yes, it is a solvable problem, in theory.  In practice with an existing chain it is a very hard problem.",
        "created_at": "2024-02-04T13:38:40.198000+00:00",
        "attachments": null
    },
    {
        "author": "papajm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "looking at the specs can be run on 300 to 1000 dollars pc, only the 32eth is hard to come by if one would want to participate",
        "created_at": "2024-02-04T13:42:30.523000+00:00",
        "attachments": null
    },
    {
        "author": "papajm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "at 73k cost",
        "created_at": "2024-02-04T13:43:08.049000+00:00",
        "attachments": null
    },
    {
        "author": "papajm",
        "category": "Consensus R\u0026D",
        "parent": "",
        "content": "i dont think its super relevant but i thought i might reference this https://ethereumclassic.org/blog/2023-09-05-etc-spotlight-etcmc-ethereum-classic-plug-and-play-node-part-i to get some feedback from people who understand what this is better than me, maybe connect the chain with an LLM put an ai in that box?",
        "created_at": "2024-02-04T13:57:01.354000+00:00",
        "attachments": null
    }
]