[
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "Posting here for lack of a better channel: are any other implementers finding the `slot=2**64 - 1` tests in the spec tests slightly annoying in the context of Altair?\n\nIn Lighthouse we do slot-based decoding of blocks and states that looks like something like this:\n\n```python\nif decoded_slot \u003c altair_slot:\n    # decode as phase0 block\nelse:\n    # decode as altair block\n```\n\nFor the tests we can set `altair_slot=0` when we want to always decode types as Altair, but if we try the opposite, i.e. `altair_slot=INT_MAX`, then blocks with `slot=INT_MAX` will attempt to decode as Altair even though we want them to decode as Phase0. I can kind of hack around this, but I've reached a point where I'm considering changing things _just to be compatible with the tests_, which seems suboptimal.\n\n\u003c@!340345049063882753\u003e I know Teku is doing something similar in decoding, did you run into this issue?",
        "created_at": "2021-03-25T01:29:44.534000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "I haven't run into that yet but I think that's because I'm cheating. Teku doesn't hard code the idea of having phase 0 then Altair, it's perfectly happy to have a config where Altair is the only version of the spec.  So when we run the Altair tests altair_slot is effectively always 0 and there is no phase 0 support at all (and for phase 0 specs Altair just doesn't exist).\n\nI've also only got as far as the ssz_static tests for Altair but I think that's what you're referring to?",
        "created_at": "2021-03-25T01:39:55.184000+00:00",
        "attachments": null
    },
    {
        "author": "sproul",
        "category": "Testing",
        "parent": "",
        "content": "Ah ok interesting. I think I can do a reasonably lightweight hack to make it work.\n\n(and yeah, this is for the ssz_static tests)",
        "created_at": "2021-03-25T02:40:27.244000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "\u003c@602753420033785856\u003e if you get to the Altair fork choice tests I’d be interested to know if they work for you. I don’t seem to be able to parse the initial block even though Altair block ssz_static tests are passing. Could be a simple misconfiguration for the test runner or something but I haven’t had a chance to dig into it really well (and strange parsing failures are not exactly easy to work out with SSZ)",
        "created_at": "2021-03-25T04:41:51.101000+00:00",
        "attachments": null
    }
]