[
    {
        "author": "paulhauner",
        "category": "Testing",
        "parent": "",
        "content": "This is also my opinion, it'll be opt-in and won't prefer/suggest any endpoint. We'll mention in the help-text that it can lead to exposure of IP address, etc.",
        "created_at": "2021-03-08T06:47:51.460000+00:00",
        "attachments": null
    },
    {
        "author": "paulhauner",
        "category": "Testing",
        "parent": "",
        "content": "The issue with eth2stats or a locally running agent is that it's some other piece of software that runs (probably) on your validator machine. If we don't make assumptions about the authenticity of its code/binary/docker-image then our attack surface is opened greatly by it.\n\nPersonally, I don't run eth2stats at all because it's crashed my servers more times than I'd like to count during the early stages of eth2. I totally respect it and those who work on it, it's just that it's failed too many times to be considered \"worth it\" for me.\n\nThe advantage of a push-based approach is that there's no extra code to trust and the client has full control over the process. If the remote server takes too long to respond, we simply stop sending things to it. If it turns out that people are getting hurt by the feature then we can disable it in a release.",
        "created_at": "2021-03-08T07:03:02.454000+00:00",
        "attachments": null
    },
    {
        "author": "protolambda",
        "category": "Testing",
        "parent": "",
        "content": "Eth2stats was fun, but legacy more than a year already. It made more sense with testnets. Privacy, stability and attack surface are all valid concerns. No mainnet instance of the site for this reason. If there's some opt-in service in the client that can do a similar thing, in a secure and stable way, that's better. I'm still worried about privacy and additional client complexity, but we can't have everything.",
        "created_at": "2021-03-08T11:51:05.329000+00:00",
        "attachments": null
    }
]