[
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "https://github.com/status-im/nimbus-eth2/blob/0bae91b79565364c10e8267fadc7dd8cc1517296/docs/e2store.md#era-files - some notes about an import/export format for blocks and states - for example, it's fairly nifty to have files like these around when dealing with weak subjectivity sync - they could also be circulated with out-of-band techniques and used for multi-block test cases - some stats in the PR: https://github.com/status-im/nimbus-eth2/pull/2382 - planning to post to eth2 repo at some point (per earlier discussions) but early comments welcome!",
        "created_at": "2021-03-05T17:08:00.756000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "tldr; an era file contains 8192 blocks and one state, for a total of around 60-70mb, 10 of which is the state itself (snappy-compressed) - 8192 matches the number of block roots in that state, meaning the blocks can be verified and trust needs only to be established for the state",
        "created_at": "2021-03-05T17:11:09.936000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "sadly, the historical roots in states mix both state and block roots in the same top-level hash - if they were separate, it would be easier to blocks from distant past using historical roots from a recent state",
        "created_at": "2021-03-05T17:12:23.809000+00:00",
        "attachments": null
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "the grand total so far that we've generated for mainnet is about 3gb of blocks and 500:ish mb of states, when storing one state per 8192 blocks (snappy-compressed)",
        "created_at": "2021-03-05T17:15:01.565000+00:00",
        "attachments": null
    },
    {
        "author": "djrtwo",
        "category": "Testing",
        "parent": "",
        "content": "oh nice. this might serve as a good EIP/erc",
        "created_at": "2021-03-05T18:09:55.821000+00:00",
        "attachments": null
    }
]