[
    {
        "author": "butta",
        "category": "Testing",
        "parent": "",
        "content": "Hi everyone,\n\nI think i have messaged all eth2 client teams in the past few weeks about adding a feature that would send System related data to a specific endpoint. The idea was to provide an endpoint so that users can track their staking devices remotely on the beaconcha.in app.\n\nThere are certainly some privacy concerns doing this. One possibility would be to only send data client devs feel is \"Ok\" to send, and/or to provide pre configured flags such as `--beaconcha.in/../privacy=low`\n\nUsing third parties services usually comes with trade-offs (trust). Both applications (explorer and mobile app) are open source and anyone is able to spin up their own monitoring system\n\n\u003chttps://docs.google.com/document/d/1qPWAVRjPCENlyAjUBwGkHMvz9qLdd_6u9DPZcNxDBpc/edit\u003e\n\ncc \u003c@!668862899569295360\u003e , \u003c@!340345049063882753\u003e , \u003c@!361447803194441738\u003e , \u003c@!399309815517544451\u003e , \u003c@!291925846556540928\u003e",
        "created_at": "2021-03-02T10:45:48.824000+00:00",
        "attachments": []
    },
    {
        "author": "butta",
        "category": "Testing",
        "parent": "",
        "content": "\u003c@!203220829473996800\u003e",
        "created_at": "2021-03-02T10:45:53.754000+00:00",
        "attachments": []
    },
    {
        "author": "butta",
        "category": "Testing",
        "parent": "",
        "content": "Would love to hear your opinion 🙂",
        "created_at": "2021-03-02T10:47:31.660000+00:00",
        "attachments": []
    },
    {
        "author": "butta",
        "category": "Testing",
        "parent": "",
        "content": "My main argument is that we need to make solo staking more attractive. Exchanges currently \"own\" \u003e40% of the network (Coinbase still pending). Arguably the data itself is less worrying than users staking through exchanges.",
        "created_at": "2021-03-02T11:22:57.104000+00:00",
        "attachments": []
    },
    {
        "author": "arnetheduck",
        "category": "Testing",
        "parent": "",
        "content": "I've noted some of this in the doc and some of it in conversation, but I'd be curious to hear more arguments around these two points:\n* centralising certain sensitive information like validator counts seems like a risk - specially when tied to IP address of the node as well as identities online (even when not exposed publically)\n* putting push support for sending data to a specific web site in _all clients out there_ seems like a risk, even when disabled by default - a standalone scraper like eth2stats seems like a more distributed solution where clients are not exposed to additional surface area for attacks beyond what they're already exposing through rpc / metrics - the counter-argument here is ease of use, as eth2stats requires an additional binary to run",
        "created_at": "2021-03-02T12:14:37.533000+00:00",
        "attachments": []
    },
    {
        "author": "benjaminion",
        "category": "Testing",
        "parent": "",
        "content": "I share \u003c@!449019668296892420\u003e's concerns to an exent. I think we are ok to add this functionality in Teku if users woud value it. But I think we would leave the endpoint unspecified: users could choose to push the data to beaconcha.in by specifying the URL for that, or elsewhere if they preferred some other aggregator (like eth2stats or their own thing perhaps). It would be off by default.",
        "created_at": "2021-03-02T13:45:13.030000+00:00",
        "attachments": []
    },
    {
        "author": "zahary.",
        "category": "Testing",
        "parent": "",
        "content": "This may be move valuable and free of controversy if it acts as a locally running agent that collects data from the RPC end-point and submits it to beaconcha.in. This way, it will support all present and future clients and it wouldn't require the client teams to spend resources implementing the feature and to explain the security/convenience trade offs to the users.",
        "created_at": "2021-03-02T13:53:46.408000+00:00",
        "attachments": []
    },
    {
        "author": "butta",
        "category": "Testing",
        "parent": "",
        "content": "this feature is not meant to be beaconcha.in specific feature though. Which a seperate agent would be",
        "created_at": "2021-03-02T14:42:28.315000+00:00",
        "attachments": []
    }
]