[
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Hi Enrico, do you think protovis can handle prysm's schema? Or do we need to make changes? We just merged that forkchoice endpoint to start getting emails when there are forks",
        "created_at": "2022-08-26T01:27:22.177000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "\u003chttps://github.com/prysmaticlabs/prysm/blob/4c600cb1963840475033f8985f7d7f1b8ed5fec4/proto/prysm/v1alpha1/debug.proto#L101\u003e",
        "created_at": "2022-08-26T01:28:05.172000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "that's what that new endpoint is aimed at, hopefully we can have a standard response that gives enough info",
        "created_at": "2022-08-26T01:28:15.393000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "But Enrico has said he should be able to support Prysm's custom form in the JavaScript. It will just be simpler to build these tools if every response isn't completely custom.",
        "created_at": "2022-08-26T01:28:55.807000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Yeah I feel that standardizing the endpoint only makes sense if it's a blocker for Enrico or someone else writing similar tools.",
        "created_at": "2022-08-26T01:30:23.077000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "i mean it was in direct response to the issue he raised about it... that's the only reason i started the pr",
        "created_at": "2022-08-26T01:30:52.417000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "I like the idea of having the basics in a \"standard\" api, albeit in the debug category and preferably with the caveat that we might change the standard much. more often than other APIs.",
        "created_at": "2022-08-26T01:31:56.622000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "But we weren't sure how well it would fit for other clients and how useful it would be - hence the issue to start a discussion.",
        "created_at": "2022-08-26T01:32:18.238000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "What I worry is that we all seem to track different things in forkchoice that are basic quantities in one implementation and derived in others. Justified root is one, voted balance is another one and the such. If we take an intersection of all these, we may end up without the hability of computing the derived quantities",
        "created_at": "2022-08-26T01:34:39.166000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "Yeah I really want to avoid or at least really minimise calculations to support this API.",
        "created_at": "2022-08-26T01:35:25.875000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "That's why I like the idea of having an extra_data type field clients can stuff more info in.  Then even if the real basics are all that's standardised (absolute worst case: slot, block_root) then the other info can still be made available in client specific form.",
        "created_at": "2022-08-26T01:36:19.379000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "Of course if we only had slot and block_root in common it wouldn't be worth it at all, but if there's a reasonable amount of info in common it seems useful.",
        "created_at": "2022-08-26T01:36:51.288000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I agree, I know nothing about APIs but would it be possible to have a minimal set of required quantities and possibly more, not wrapped in an \"extra_data\" field? I believe this is the least disruptive of all to all clients cause then they just need to agree on the names of the minimal set",
        "created_at": "2022-08-26T01:44:32.448000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "yes absolutely if people are willing to be permissive, which historically we've not bene great with",
        "created_at": "2022-08-26T01:45:01.072000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "And it seems to be that those writing tooling can just take some fields that are guaranteed to be there",
        "created_at": "2022-08-26T01:45:07.569000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "i embedded it lower so that its going to be less controversial than having optional fields at the top, because sometimes that seems to lead to issues with some implementations",
        "created_at": "2022-08-26T01:45:57.101000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "currently i didnt set any of those fields required, so really any or none could be included",
        "created_at": "2022-08-26T01:46:28.907000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "I am a complete ignorant in this regard and can barely read the implementation. But it looks to me that the PR requires just the array of nodes. We have a bunch of global store fields that we embed in the response along with this array that I feel are useful and everyone has: justification/finalization checkpoints, proposer boost info, head root, etc",
        "created_at": "2022-08-26T01:50:21.094000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "if theres extra info outside the array that's easy to do to. at htis point i'll wait and see what \u003c@504202741933932544\u003e needs rather than update the pr while he's asleep, but it could easly be an object that contains an array of nodes plus summary information at the top level, i just started it roughly in line with what was in the earlier issue that he had raised, and i haven't read his script yet to see what's in use",
        "created_at": "2022-08-26T01:53:23.061000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Perfect, so my understanding is that this can be put in a way in which teams only need to agree to provide certain mandatory fields with some mandatory names (and in some mandatory order maybe?) But can have arbitrary extra fields named as they want. \n\nIf that's the case I'm happy to support this and glad that you guys are taking a lead with the tooling. I think from the fields as they are now the only one we would need to actively change is the execution optimistic status cause we only have a boolean: in my mind INVALID status in forkchoice is an implementation detail (we do have it in the protoarray implementation, but not in the tree implementation)",
        "created_at": "2022-08-26T01:57:52.655000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "yeh i think if we can find out the minimum needed for visualization, then thats probably a good guide for what shoudl be considered mandatory in this instance, and anything else can be somehow made optional or not be provided depending on if ppl want to support unknown fields",
        "created_at": "2022-08-26T01:59:00.995000+00:00",
        "attachments": null
    },
    {
        "author": ".paulharris",
        "category": "Testing",
        "parent": "",
        "content": "some implementaitons are permissive of unknown fields and just ignore them, and some tend to do bad things, so it's just a matter of making sure we're on the same page with the intent etc.",
        "created_at": "2022-08-26T02:00:00.523000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "I figured the Prysm implementation of the optimistic status would basically be `execution_optimistic ? OPTIMSTIC : VALID` and you'd just never have any nodes in the output that are INVALID because you prune them. Whereas if we only have a boolean clients that have an invalid node would have to filter them out and we get less info.  And knowing that the EL invalidated something is actually really helpful when debugging issues.",
        "created_at": "2022-08-26T03:06:51.565000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "Also the downside of having custom field names in the same object as the standard ones is you risk getting conflicts when introducing additional standard names if some clients were using it for something else.  But I'm not overly worried about that since we could just pick a slightly less perfect name for the standard (or the client specific one gets changed and there's some potential confusion until everything upgrades - it's not a critical API).",
        "created_at": "2022-08-26T03:08:59.372000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Yep, that's right, that's why I'm in favor of including this one and we will just make that conversion",
        "created_at": "2022-08-26T04:20:38.620000+00:00",
        "attachments": null
    },
    {
        "author": "ajsutton",
        "category": "Testing",
        "parent": "",
        "content": "ah yes sorry, I misinterpreted your previous message.",
        "created_at": "2022-08-26T04:21:53.693000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "Testing",
        "parent": "",
        "content": "I'm alive, catching up...",
        "created_at": "2022-08-26T07:27:57.678000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "Testing",
        "parent": "",
        "content": "in the meantime i moved the hosted app here: https://tbenr.wtf:3000",
        "created_at": "2022-08-26T07:29:02.871000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "Testing",
        "parent": "",
        "content": "yeah sounds good to have the minimal set in the root object and then an extra-info object with client specific stuff. continuing the discussion on GH",
        "created_at": "2022-08-26T07:38:01.556000+00:00",
        "attachments": null
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "Ok so this is different that what I had in mind, this requires an extra data field instead of just adding those fields directly to the root object. It's a minor annoyance buy if it's avoidable it will be better.",
        "created_at": "2022-08-26T10:19:59.620000+00:00",
        "attachments": null
    },
    {
        "author": "tbenr",
        "category": "Testing",
        "parent": "",
        "content": "https://github.com/ethereum/beacon-APIs/pull/232#issuecomment-1228335259",
        "created_at": "2022-08-26T10:36:57.323000+00:00",
        "attachments": null
    }
]