[
    {
        "author": "holiman",
        "category": "Testing",
        "parent": "",
        "content": "To CL devs: What would, technically, be the minimal needed parts for a service, which has only one job: notice when a validator misses a slot. Would it have to have the full bn client + el node (to detect deposits?). I assume it would. If so, a follow-up question: if the service was resynched from a trusted checkpoint every week, and it were deemed 'ok' to not notice new validators entering, could the eth1 client be skipped?\n\nI'd like to set up some service which just basically exports an rss feed of missed attestations. The beaconcha.in thing requires setting up an account and registering 'your' validators, I think it would be better to have a public feed where folks can subscribe (and filter locally). Ideally I'd want it to consume as little resources as possible, e.g. wouldn't have to validate anything really",
        "created_at": "2022-02-11T14:30:46.760000+00:00",
        "attachments": []
    },
    {
        "author": "holiman",
        "category": "Testing",
        "parent": "",
        "content": "For geth, it's on CI. We're not proud of it, and we've recently setup an on-prem server for this purpose (a first step might be to dual-build, and let the on-prem validate the ci binary. but that requires reproducible builds)",
        "created_at": "2022-02-11T14:32:17.600000+00:00",
        "attachments": []
    },
    {
        "author": "pietjepuk",
        "category": "Testing",
        "parent": "",
        "content": "I don't think the EL node is needed for that (at least before the merge). An EL node is currently only needed to make valid beacon block proposals if those proposals are supposed to contain new deposits.",
        "created_at": "2022-02-11T14:44:29.557000+00:00",
        "attachments": []
    },
    {
        "author": "holiman",
        "category": "Testing",
        "parent": "",
        "content": "So a pure beacon node is sufficient. That's good!",
        "created_at": "2022-02-11T14:47:34.270000+00:00",
        "attachments": []
    },
    {
        "author": "potuz",
        "category": "Testing",
        "parent": "",
        "content": "not for long, post merge you will have to have an EL, for such a service, and being you building it, I'd suggest mocking the minimum EL RPC service that will return everything as valid. You only care about seeing attestation, not about any duties, so you'll be following anyway the consensus layer canonical chain.",
        "created_at": "2022-02-11T14:54:04.626000+00:00",
        "attachments": []
    },
    {
        "author": "jgm",
        "category": "Testing",
        "parent": "",
        "content": "That may be a busy RSS feed.  There were over 275,000 missed attestations yesterday (out of a total of 65,757,886).",
        "created_at": "2022-02-11T19:19:00.919000+00:00",
        "attachments": []
    }
]