[
    {
        "author": "b.hartnett",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "Is there a write up or draft spec anywhere on the proposed flat state data structure which will be used for accessing the recent state near the head of the chain? I've read this https://github.com/ethereum/portal-network-specs/issues/194 already and I understand that there may be some similarities to how Besu stores state in Bonsai tries using the path based scheme but I haven't found anything the describes what the content keys and values/offers would look like. I assume that ephemeral state content is related to the flat state scheme?",
        "created_at": "2025-03-21T05:01:20.671000+00:00",
        "attachments": null
    },
    {
        "author": "milos88",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "The ephemeral state content issue is related to the trie-based format.",
        "created_at": "2025-03-21T09:51:11.375000+00:00",
        "attachments": null
    },
    {
        "author": "milos88",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "We currently don't have detailed spec written down for the flat format. It's something that we should do, but it was never a priority and there are still few minor things to figure out.\n\u003c@902806914252021830\u003e , is there somewhere a documentation on the Bonsai trie? Would be interested to look into it",
        "created_at": "2025-03-21T09:54:09.874000+00:00",
        "attachments": null
    },
    {
        "author": "b.hartnett",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "Sure, I found this blog post very helpful to understand the Bonsai Tries data structures: https://consensys.io/blog/bonsai-tries-guide",
        "created_at": "2025-03-21T12:17:35.049000+00:00",
        "attachments": null
    },
    {
        "author": "b.hartnett",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "The basic idea is that there is a single trie that stores all the MPT trie nodes but each trie node is stored by the path into the trie instead of by hash of the node. This is the same path that we already use in the state network. The root node path is the empty string. Account leaf paths are the hash of the address. Storage tries are path based as well and the path of each storage trie MPT node is just the (address hash + storage path) if I remember correctly. Storing by path allows you to update the values in place which deletes the old state when new state is applied.",
        "created_at": "2025-03-21T12:28:37.707000+00:00",
        "attachments": null
    },
    {
        "author": "b.hartnett",
        "category": "Portal R\u0026D",
        "parent": "",
        "content": "The trie logs mentioned in that blog post are the state diffs I was referring to",
        "created_at": "2025-03-21T12:30:06.219000+00:00",
        "attachments": null
    }
]