[
    {
        "author": "gichiba",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I just have to say I really liked Alexey's mathematical analogy where 'fully stateless' is the limit of reGenesis events going toward infinity (or every block) and the status quo is 0 reGenesis events. It got me thinking about whether there might be an even less intense version of the phase 1 reGenesis... \n\nWould there be a way to manually de-activate just a portion of the state? Like, make the zeroth reGenesis event just move the parts of state that we *know* are dusty any abandoned (or at least have some reasonable confidence that it is unused). The goal here would be to avoid any disruption to the super-active stuff while still getting the benefits of clearing away the cruft. Also to avoid creating un-intended attacks or maybe just side-effects on all the Defi stuff which would presumably go inactive and then immediately active again? \n\n\"The second mouse gets the cheese\" is an appropriate addage here, since by my understanding directly following reGenesis the first users of any contract would end up, either by accident or on purpose, paying significantly more to elevate their part of state to active without even a gurantee the transaction will go through. Along the same lines of thinking, would there be a sort of op-code like thing where someone could voluntarily de-activate a part of state like you would SELFDESTRUCT a contract?",
        "created_at": "2020-08-20T03:01:47.881000+00:00",
        "attachments": null
    },
    {
        "author": "gichiba",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I also got a little worried about the (also interesting and compelling) comparison to state rent. I think it'd be prudent to try and map out all the possible objections to reGenesis and \"this will fuck up my (insert whatever DeFi project is trending) yield\" is sure to be a point of contension no matter how good the proposal is for Ethereum overall",
        "created_at": "2020-08-20T03:05:24.127000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e would there be a sort of op-code like thing where someone could voluntarily de-activate a part of state like you would SELFDESTRUCT a contract?\n\u003c@!393833580033474560\u003e I believe you can just have a contract call that reads some state to trigger loading it.  One could author a contract that lets you read any arbitrary state, though you would end up paying some overhead for CALL instructions that would be nice to avoid.",
        "created_at": "2020-08-20T04:56:31.202000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't think there is a reason to deactivate the state. I mean someone might find it useful, but maintaining it won't be pretty",
        "created_at": "2020-08-20T06:52:41.459000+00:00",
        "attachments": null
    },
    {
        "author": "gichiba",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think I smashed two ideas too closely together. Voluntary de-activation of state is one, and fair point, it means well but would probably be a pain in the ass. \n\nThe other one I would call something like  'reGenesis immunity' -- the idea that state touched a set number of blocks *before* a reGenesis event (presumably the most active contracts) get spared from clearing, to avoid causing sudden disruption to super-active contracts that will only be immediately activated following reGenesis. It's just weird to think about all of DeFi suddenly, all at once, and only for a few blocks, hitting the speedbump of calling all the state back from inactivity",
        "created_at": "2020-08-20T11:20:05.965000+00:00",
        "attachments": null
    },
    {
        "author": "gichiba",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "again, this is all in the interest of brainstorming potential criticisms and arguments against reGenesis, so that we can avoid bad arguments and ill-informed twitter rants later down the line when the wider community needs to be convinced this will be good for everyone.",
        "created_at": "2020-08-20T11:23:55.709000+00:00",
        "attachments": null
    },
    {
        "author": "gichiba",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(FWIW I think this is just barely on the line of being technical enough to discuss in this channel, but lmk with an emoji reaction if you think it doesn't belong here)",
        "created_at": "2020-08-20T11:26:01.998000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think it is definitely a good discussion",
        "created_at": "2020-08-20T11:28:01.685000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "no need to go away anywhere 🙂",
        "created_at": "2020-08-20T11:28:12.220000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I don't have a good sense (because I don't have the data yet) of how much more gas the users sending transactions just after a regenesis event will need to include. My intuition (which is often wrong) is that it won't be bad at all",
        "created_at": "2020-08-20T11:31:18.747000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "what people need to realise that if ReGenesis is successful, it will allow pushing block gas limit much higher than it is now (because the active state is small enough to be in RAM), and it is likely that we hit some value at which the gas price will be low again for at least few months 🙂",
        "created_at": "2020-08-20T11:33:24.181000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Staged approach to ReGenesis has its downsides, of course",
        "created_at": "2020-08-20T11:34:11.218000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I can see at least 2 at the moment",
        "created_at": "2020-08-20T11:34:24.352000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "1) if transaction sender cannot specify arbitrary state items in the witness, but has to rely on the miner deterministically constructing the witness, it is harder to have transactions that have no other purpose than just activate some state. In a non-staged ReGenesis, you can have tx that does nothing, but just activates stuff",
        "created_at": "2020-08-20T11:35:32.918000+00:00",
        "attachments": null
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "2) it becomes harder to implement \"thin blocks\", where transactions aren't included into the blocks in full, but are instead referenced",
        "created_at": "2020-08-20T11:36:38.484000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003e I don't have a good sense (because I don't have the data yet) of how much more gas the users sending transactions just after a regenesis event will need to include. My intuition (which is often wrong) is that it won't be bad at all\nA block proof plus a couple storage proofs is about 600k gas to supply and validate in the EVM, with most of that cost dominated by calldata bytes.",
        "created_at": "2020-08-20T16:10:49.625000+00:00",
        "attachments": null
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Just as a point of reference.",
        "created_at": "2020-08-20T16:11:01.653000+00:00",
        "attachments": null
    }
]