[
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Current regenesis plan (the one in my head) keeps the state root calculation mechanism the same and pushes tracking of active vs inactive state onto the implementation.  While thinking about this it occured to me that we might benefit from at least exploring what it would look like if we were building this mechanism fresh.  Would we design it with two state roots?  Basically, I realized there may be unknown-unknowns hiding in there at the implementation level which won't be apparent until we actually start building.  I have no specific concerns, only leaning on prior experience/knowledge from areas of the protocol that have turned out to be conceptually well formed at the specification level only to find that at the implementation level things get difficult.",
        "created_at": "2020-08-10T19:27:49.250000+00:00",
        "attachments": []
    },
    {
        "author": "Deleted User",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "my plan is (as it always was) is to build Proof Of Concept as we are writing specifications, so that we know that the specifications are implementable",
        "created_at": "2020-08-10T20:36:16.294000+00:00",
        "attachments": []
    },
    {
        "author": "_itsaconspiracy_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "If full state is not held by miners (or some other reliable mechanism like proof of custody) then would addresses in cold storage for several epochs be at risk of losing funds?",
        "created_at": "2020-08-10T23:01:18.184000+00:00",
        "attachments": []
    },
    {
        "author": "_itsaconspiracy_",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "(Especially addresses stored before regenesis is enacted, though later ones could also face challenges with paper/hardware wallet support.)",
        "created_at": "2020-08-10T23:11:07.124000+00:00",
        "attachments": []
    }
]