[
    {
        "author": "mightypenguin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Have the current state-expiry/witness proposals handled the question of paying for witness lookup gas using old epoch EOAs or would we need a current epoch EOA?\nRequiring currently epoch ETH would be a pretty big barrier.\n1. Deposit 1 ETH into EOA.\n2. Wait 2 years.\n3. Try use 1 ETH for something.... (but it isn't in current epoch)\n\nIn the above example, the user would have to do a fresh buy of ETH with fiat or some other means before transacting on the network again... Sorry if this is already covered, or trivial, but maybe it should be spelled out more clearly in proposals.",
        "created_at": "2021-03-22T17:52:57.368000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!421657141179580418\u003e I don't think this is the case.  They would have to acquire the \"witness\" for reviving their account, but the cost should still be covered by the existing account balance (which is elevated to the active state as part of the transaction).",
        "created_at": "2021-03-22T18:31:59.345000+00:00",
        "attachments": []
    },
    {
        "author": "mightypenguin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It seems to me that this could be a DoS vector, but I'm no sure how bad.\nA malicious user could ask for invalid witnesses to be generated without any funds to pay for them. The requests would fail, but there's little or no penalty for the requestor.",
        "created_at": "2021-03-22T19:03:26.970000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "They don't ask for the witness to be generated.  Witness procurement for state that is more than 2 epochs old isn't handled by the protocol.  It must be provided with the transaction (at least that's the model as it exists in my head).",
        "created_at": "2021-03-22T19:04:54.103000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "At the core protocol level, the transaction either A) deals with state from the most recent epochs, or B) it contains the necessary proof to resurrect the state from an older epoch.",
        "created_at": "2021-03-22T19:06:00.804000+00:00",
        "attachments": []
    },
    {
        "author": "mightypenguin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I'm just concerned that witness generation is required for the network to function and\n right now (to me) the economic or other incentives for it to function are not well defined because it's outside of the core ethereum scope.",
        "created_at": "2021-03-22T19:12:15.743000+00:00",
        "attachments": []
    },
    {
        "author": "mightypenguin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But I guess we have an idea of what the gas costs should be for such a service?\nSo I guess the assumption is that witness providers would handle all of that as well.",
        "created_at": "2021-03-22T19:13:30.577000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@!421657141179580418\u003e this is kind of by design.  Currently, the state grows unbounded by any economic incentives.  This intentionally places bounds, specifically on the retention period.  The natural consequence of this are that data has to no longer be the problem of the protocol after a certain amount of the time.",
        "created_at": "2021-03-22T19:14:25.087000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I agree, that some kind of \"service\" needs to be in place for people to recover old data.  These services will be \"layer 2\" stuff since they will exist independent of the core protocol and there may be many models that arise for this, paid services, maybe peer-to-peer storage solutions, ...",
        "created_at": "2021-03-22T19:16:02.708000+00:00",
        "attachments": []
    }
]