[
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "\u003c@425279588009246720\u003e My gut likes the ephemeral translation map.  Especially that it incentivizes migration to long addresses by users, wallets, contracts, etc.",
        "created_at": "2021-06-27T05:04:42.601000+00:00",
        "attachments": []
    },
    {
        "author": "axic3354",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I like the ephemeral a lot too (and want to work on it next), but it has the same UX problem as witnesses: it could go stale and the user is penalised. Maybe with 1559 this problem is less pronounced as blocks are more predictable from the user's side.",
        "created_at": "2021-06-27T11:42:24.465000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I feel like in the vast majority of situations the ephemeral translation map would be static (not dependent on chain state), so wouldn't have the store problem in almost all cases.",
        "created_at": "2021-06-27T18:24:34.188000+00:00",
        "attachments": []
    },
    {
        "author": "sky.cactus",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This is unlike witnesses, where going stale is the common situation.",
        "created_at": "2021-06-27T18:24:54.188000+00:00",
        "attachments": []
    },
    {
        "author": "axic3354",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think likely that is the case (i.e. a long destination is used with an old token, and no other interaction takes place), but need to run all the test cases we have on this new scenario to see if it is true.",
        "created_at": "2021-06-27T20:39:07.237000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I think that there isn't a canonical document to answer your question, nor have all the decisions been made which would maybe allow us to decisively write down such a document.  Loosely, the things you mentioned are definitely part of the roadmap but there will likely be more things added to it.  Since every client will eventually have to do this work, you could potentially help the next teams out by taking some \"implementers notes\" as you figure things out.",
        "created_at": "2021-06-27T21:12:09.904000+00:00",
        "attachments": []
    },
    {
        "author": "80raghavendra",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Thanks \u003c@!364458974906548225\u003e . I understand.",
        "created_at": "2021-06-27T23:56:58.178000+00:00",
        "attachments": []
    }
]