[
    {
        "author": "mightypenguin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "New idea: Rolling Chains.\nhttps://ethresear.ch/t/rolling-eth2-chains/8684",
        "created_at": "2021-02-15T19:05:41.558000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "My intuition is that this breaks a major component of the utility of blockchains -- that is, to be able to make contracts, systems, and protocols that operate indefinitely with a given set of rules. State-rent with revival and statelessness both allow for this even if if the contract is not kept in \"active\" state on all nodes, whereas your proposal fundamentally changes the blockchain paradigm and value proposition",
        "created_at": "2021-02-15T19:10:06.345000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "migration/bridges only satisfy a subset of expected blockchain functionality. Static functionality guarantees are also a major feature",
        "created_at": "2021-02-15T19:10:57.578000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": ".\nalso, having multiple eth2 execution shard chains (and thus multiple states) would only really work with a form of statelessness. And if we have statelessness solved, we might as well not have chains restart beacuse the state problem has been addressed",
        "created_at": "2021-02-15T19:11:58.619000+00:00",
        "attachments": []
    },
    {
        "author": "mightypenguin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I would suggest that being able to upgrade ethereum at a (possibly) much faster speed would be worth that sacrifice.\nEventually (already?) the complexity of backward compatibility will slow development to a crawl.\nI suspect all chains with \"forever\" contract state will converge towards a static set of features as development inevitably slows.\nMeaning that newer chains will take their place that offer more features and cheaper execution.\nAt which point the question will become whether the newer chain will be an ethereum one or some other new project.",
        "created_at": "2021-02-15T19:21:04.004000+00:00",
        "attachments": []
    },
    {
        "author": "mightypenguin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So yes I am cheating by adding another metric to this discussion, speed of EIP or general client deployment.",
        "created_at": "2021-02-15T19:21:46.668000+00:00",
        "attachments": []
    },
    {
        "author": "mightypenguin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "We were mostly just talking about handling state size bloat.",
        "created_at": "2021-02-15T19:22:08.880000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "I actually don't think we need much upgrading once eth2 and eth1.x done 😆",
        "created_at": "2021-02-15T19:23:04.843000+00:00",
        "attachments": []
    },
    {
        "author": "djrtwo",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "hmm, I don't agree that speed of upgrading L1 is going to be the decider in any sort of blockchain competitiveness\n\nbut still, we can't really move into multi-shard execution/state unless statelessness is solved",
        "created_at": "2021-02-15T19:23:32.021000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "The chain really is powerful enough for rollups (which are basically another term for a type of execution environment) to do the job of innovating new and better execution models",
        "created_at": "2021-02-15T19:23:45.522000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "And yeah, the \"forever\" aspect just has too much meme value. Moving to some state expiry scheme where if it falls out someone with a Merkle branch can revive it is one thing, but not allowing revival at all is much more challenging",
        "created_at": "2021-02-15T19:24:35.740000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "There's definitely key areas where I think we should break backwards compatibility (I have a doc https://hackmd.io/@HWeNw8hNRimMm2m2GH56Cw/evm_feature_removing ) but they would only break like \u003c1% of applications",
        "created_at": "2021-02-15T19:25:43.884000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "But fiddling with fundamental properties of state breaks much more than that",
        "created_at": "2021-02-15T19:26:11.167000+00:00",
        "attachments": []
    },
    {
        "author": "mightypenguin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Rolling chain contracts could have a \"migrate and destroy\" function which copies all data forward when the chain they are on expires (or the function is manually called).\nBut yes it's not \"all data is kept for everyone\" anymore.",
        "created_at": "2021-02-15T19:27:20.525000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "So I've only been convinced of this very recently (thanks \u003c@!555483069038198827\u003e ) but I really do think that the better compromise is to move toward proposers needing state and no one else needing state, for at least the next ~5 years, and we can add some form of expiry after that point",
        "created_at": "2021-02-15T19:29:26.371000+00:00",
        "attachments": []
    },
    {
        "author": ".vbuterin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "Whether different accounts expire at different times or it's interval-based doesn't matter too much to me",
        "created_at": "2021-02-15T19:30:07.187000+00:00",
        "attachments": []
    }
]