[
    {
        "author": "mightypenguin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "from the \"ethresear.ch\" description:\n```The obvious gain of such “relaunch” would be that the new joiner nodes will need to start with the 40Gb genesis state and not with 150 Gb worth of blocks.```\nHow much easier/faster would a Regenesis Phase0 implementation be if we just did this? Then leave further enhancements for future rollouts. This is still a huge improvement in download size, time needed to sync and total local storage requirements.\n\"Perfect is the enemy of good.\"",
        "created_at": "2021-02-01T17:16:49.015000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "This proposal by V seems to tie in nicely with regenesis https://ethresear.ch/t/alternative-bounded-state-friendly-address-scheme/8602",
        "created_at": "2021-02-01T21:59:05.601000+00:00",
        "attachments": []
    },
    {
        "author": "pipermerriam",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "It also naturally gives us a mechanism to do continuous rolling regenesis rather than fixed points where state is dropped",
        "created_at": "2021-02-01T22:00:22.208000+00:00",
        "attachments": []
    },
    {
        "author": "mightypenguin",
        "category": "Execution R\u0026D",
        "parent": "",
        "content": "V's proposal and the Regenesis have some great potential, but I'm thinking the implementation effort for the various ETH1 clients would be large? And there are still \"unknown unknowns\" or at least \"known unknowns\" aka additional research.\n\n I was hoping that my proposal for a simpler Regenesis with a repackaged genesis file with all state would be much faster to implement for most ETH1 clients. Perhaps in testnet in 6 months and deployed in a year if there's enough interest?",
        "created_at": "2021-02-01T22:08:30.684000+00:00",
        "attachments": []
    }
]